{
 "id": "869726",
 "text": "Mithali Dorai Raj (born 3 December 1982) is an Indian cricketer. She is the Test and ODI captain of women's national cricket team.Mithali Raj ESPN Cricinfo She is a right-handed opening batswoman and sometimes right-arm leg break bowler. Raj is the highest run-scorer in women’s international cricket. She is the highest run-scorer in women's international cricket and the only female cricketer to surpass the 7,000 run mark in Women's One Day International matches. she is the first player to score seven consecutive 50s in ODIs. Raj also holds the record for most half-centuries in WODIs. In June 2018 during the 2018 Women's Twenty20 Asia Cup, she became the first player from India to score 2000 runs in T20Is, and also became the first woman cricketer to reach 2002 WT20I runs. In 2005, she became the captain of the side. Raj is the only player (female) to have captained India in more than one ICC ODI World Cup final, doing so twice in 2005 and 2017. On 1 February 2019, during India's series against New Zealand Women, Raj became the first woman to play in 200 ODI matches. In September 2019, she announced her retirement from T20Is to focus on ODI cricket. In 2019, she became the first woman to complete 20 years in international cricket. She is the recipient of several national and international awards, including the Wisden Leading Woman Cricketer in the World in 2017, Arjuna Award in 2003, and the Padma Shri in 2015, both by the Government of India. In July 2021, in the third WODI match against England, Raj became the leading run-scorer in women's international cricket. She went past Charlotte Edwards' previous record of 10,273 runs. == Early life == Mithali Raj was born on 3 December 1982 in a Tamil family in Jodhpur, Rajasthan. Her father is Dorai Raj, who was an Airman (Warrant Officer) in the Indian Air Force, and mother is Leela Raj. Raj started to play cricket at age of 10. She lives in Hyderabad, Telangana. She attended Keyes High School for Girls in Hyderabad. She attended Kasturba Gandhi Junior College for Women in Secunderabad for her intermediate studies. She began cricket coaching in her school days along with her elder brother. == Youth and domestic career == While playing for Railways in domestic competition, Raj began her career by playing with stars like Purnima Rau, Anjum Chopra and Anju Jain for Air India. == International career == Mithali has played all three cricket formats for India, Test, One Day and T20. She was named among the probables in the 1997 Women's Cricket World Cup when she was just 14, but couldn't make it to the final squad. She made her One Day International debut in 1999 against Ireland at Milton Keynes and scored unbeaten 114 runs. She made her Test debut in the 2001–02 season against South Africa at Lucknow. On 17 August 2002, at the age of 19, in her third Test, she broke Karen Rolton's record of world's highest individual Test score of 209*, scoring a new high of 214 against England in the second and final Test at County Ground, Taunton. The record has since been surpassed by Kiran Baluch of Pakistan who scored 242 against West Indies in March 2004. Raj was ill with a strain of typhoid during the CricInfo Women's World Cup in 2002, hindering India's progress. However, she then led them to their first World Cup final in 2005, in South Africa, where they met Australia who proved too strong. In August 2006, she led the side to their first ever Test and Series victory in England and wrapped up the year winning the Asia Cup – the second time in 12 months – without dropping a single game. She led the Indian team to the finals in the 2005 Women's Cricket World Cup where the team lost to Australia. She is a part-time leg-break bowler as well. She is a recipient of the Arjuna award for the year 2003. She currently tops the batting table with 703 ratings. In addition to her ability with the bat, Raj rolls her arm over bowling leg-spinners and providing variety to the attack. At the 2013 Women's World Cup, Raj was the No.1 Cricketer in the ODI chart among women. She scored 100s: 1 and 50s: 4 in Test cricket, 100s: 5 and 50s: 50 with best bowling of 3/4 in ODIs and 50s: 10 in T20s. In February 2017, she became the second player to score 5,500 runs in WODIs. Raj is the first player to captain most matches for India in ODI and T20I. In July 2017, she became the first player to score 6,000 runs in WODIs. She led the Indian team to the final of the 2017 Women's Cricket World Cup where the team lost to England by nine runs.World Cup Final , BBC Sport, 23 July 2017.England v India: Women's World Cup final – live! , The Guardian, 23 July 2017. In December 2017, she was named as one of the players in the ICC Women's ODI Team of the Year. In October 2018, she was named in India's squad for the 2018 ICC Women's World Twenty20 tournament in the West Indies. In September 2019, Raj retired from T20I Cricket. She dreams to bring the World Cup to her country by 2021. \"After representing India in T20 internationals since 2006, I wish to retire from T20Is to focus my energies on readying myself for the 2021 one-day World Cup,\" she said in a BCCI press statement. In November 2020, Raj was nominated for the Rachael Heyhoe-Flint Award for ICC Female Cricketer of the Decade, and the award for women's ODI cricketer of the decade. In May 2021, she was named as the captain of India's Test squad for their one-off match against the England women's cricket team. == Coaching career == Raj was appointed as the batting consultant for India women's national cricket team, and had played as a player-coach. == Records == * Mithali is nicknamed \"Lady Tendulkar of Indian Women's cricket\", as she is currently the all-time leading run-scorer for India in all formats, including Tests, ODIs and T20Is. * During the 2017 Women's Cricket World Cup, Raj scored her seventh consecutive half-century and made a record for most consecutive fifties by a player. * Mithali is the 1st Indian and 5th woman cricketer overall to score over 1,000 World Cup runs. * She holds the record for playing the most consecutive Women's One Day Internationals for a team (109). == Controversies == Mithali Raj was involved in controversy with cricket management due to her attitude towards the game during the 2018 ICC Women's World Twenty20. She accused the coach Ramesh Powar and BCCI COA member Diana Edulji in a letter to BCCI of bias, humiliation at not including her in the T20 world cup semifinals. Powar in turn criticized that Raj had threatened that she would retire from the game of the cricket when asked to play down the batting order. He also accused Raj of 'blackmailing and pressurising coaches' apart from causing division in the team during the recently concluded World T20. He added, \"despite being a senior player in the team she puts in minimum inputs in team meetings. She could not understand & adapt to the team plan. She ignored her role and batted for own milestones. Lack of keeping the momentum going which was putting extra pressure on other batters.\" Raj's 50 against Ireland in the same tournament in which she ended up playing 25 dot balls was also criticized by the coach, Powar. Her relationship with the T20 team's captain Harmanpreet Kaur is also said to be strained. However after reappointment of Ramesh Powar as Head coach of Indian womens' cricket team in May 2021 , the two have reconciled. Mithali and Harmanpreet also confirmed no bad blood against each other across various interviews. == Awards == Year Award Notes 2003 Arjuna Award 2015 Padma Shri India's fourth highest civilian award 2017 Youth Sports Icon of Excellence Award At the Radiant Wellness Conclave, Chennai 2017 Vogue Sportsperson of the Year At Vogues 10th anniversary 2017 BBC 100 Women 2017 Wisden Leading Woman Cricketer in the World == Outside cricket == === Personal life and interests === Raj is a Bharatanatyam dancer.From a Classical Dancer to India’s Women Team Captain, Here’s the Story Of Mithali Raj! === In popular culture === After the 2017 Women's Cricket World Cup, Viacom 18 Motion Pictures acquired the rights to make a feature film on Raj's life. She said \"Hoping that this movie inspires more people, especially young girls to take up sports as a career.\" The biopic is in planning and the shoot is scheduled to start in 2019. Raj said \"I think Priyanka Chopra will be a great choice (to play me in the biopic). Our personalities match a lot. I am not a movie buff, so I'd love the experts to do their job.\" However, it was decided that Taapsee Pannu will play the role of Mithali Raj in the biopic named Shabaash Mithu. It will be directed by Rahul Dholakia in 2020. == References == === Citations === === Further reading === * * * == Other websites == * * Category:1982 births Category:Living people Category:Indian cricketers Category:Sportspeople from Rajasthan",
 "title": "Mithali Raj"
}