{
 "id": "869784",
 "text": "Alimony is the idea that two people who are married are responsible for each other: This also means that if they separate or get divorced, the partner with more money or other resources has to pay a sum of money to the partner with less. The meaning of the term goes back to the Latin, alimentum (which means food). ==History== ;2nd millennium BC The Code of Hammurabi (1754 BC) says that a man has to provide for his wife so she can raise his children: : 137. If a man wish to separate from a woman who has borne him children, or from his wife who has borne him children: then he shall give that wife her dowry, and a part of the [fruits] of field, garden, and property, so that she can rear her children. When she has brought up her children, a portion of all that is given to the children, equal as that of one son, shall be given to her. She may then marry the man of her heart. === Ancient Rome === During the reign of Trajan (1st century) the state supported families with many children. This support was known as \"alimenta.\" The picture shows a Denarius, a Roman coin of the time. On the coin, the words \"ALIM.ITAL.\" can be read. They stand for \"alimenta Italia.\" The coin also shows Abundantia, the goddess of abundance (of food) with her children. The Code of Justinian also talks about alimony. === Since the 16th century === People began to pay alimony in the modern way starting in the 16th century: The Latin word sustentatio was directly translated. The idea was one of the first forms of social security: Family members should support each other, in case of need. English church courts awarded alimony in cases of separation and divorce. Alimony pendente lite was given before the divorce decree, based on the husband's duty to support the wife during a marriage that still continued. Alimony after the divorce was also based on the idea that church courts could not undo a marriage. They could only give a divorce a mensa et thoro, which is similar to a legal separation today. As divorce did not end the marriage, the husband still had to support his wife. In the 19th century, divorce laws were changed, and became more liberal. Divorce was still only possible in the case of marital misconduct. As a result, the requirement to pay alimony became linked to the concept of fault in the divorce. Alimony to wives was paid because it was assumed that the marriage, and the wife's right to support, would have continued but for the misbehavior of the husband. Ending alimony on divorce would have permitted a guilty husband to profit from his own misconduct. In contrast, if the wife committed the misconduct, she was considered to have lost any claim to ongoing support. During this period, parties could rarely afford alimony, and it was rarely awarded by courts. As husbands' incomes increased, and with it the possibility of paying alimony, the awarding of alimony increased, generally because a wife could show a need for ongoing financial support, and the husband had the ability to pay. Pdf. No-fault divorce led to changes in alimony. Whereas spousal support was considered a right under the fault-based system, it became conditional under the no-fault approach. According to the American Bar Association, marital fault is a \"factor\" in awarding alimony in twenty-five states and the District of Columbia. Link to journal. Permanent alimony began to fall out of favor, as it prevented former spouses from beginning new lives, though in some states (e.g., Massachusetts, Mississippi, and Tennessee), permanent alimony awards continued, but with some limitations. at 8, 9 Alimony moved beyond support to permitting the more dependent spouse to become financially independent or to have the same standard of living as during the marriage or common law marriage, though this was not possible in most cases. Pdf. In the 1970s, the United States Supreme Court ruled against gender bias in alimony awards. That means that men could get alimony from their wives, not only women from husbands. According to the U.S. Census Bureau, the percentage of male alimony recipients rose from 2.4% in 2001 to 3.6% in 2006. In states like Massachusetts and Louisiana, the salaries of new spouses may be used in determining the alimony paid to the previous partners. Most recently, in several high-profile divorces, women such as Britney Spears, Victoria Principal, and Jessica Simpson have paid multimillion-dollar settlements instead of alimony to ex-husbands. According to divorce lawyers, aggressive pursuit of spousal support by men is becoming more common, as the stigma associated with asking for alimony fades. == People covered == Today, most countries have laws about alimony. Usually, the following people are covered: * Direct line of succession: parents need to care for their children. As a special case: parents need to care for their children who are not yet adult, or who are doing some form of education. * Adopted children: Parents also need to care for adopted children, in much the same way as they care for their own children * Extended family: If two people are married (or they live in a relationship that resembles marriage): People are also responsible for the spouses of their children, and (to some extent) their families. Very often this no longer applies in the case of a divorce, if there are no children. * There's usually no alimony between the children of the first marriage, and the new partner of the parent and his or her family. * Between married people: They have the duty to care for each other, and to contribute to the common household. In some cases, this also applies to people living in marriage-like arrangements (often called cohabitation, in English). == Non-monetary support == Caring can be in the form of paying money, but it can also be one of the following: * Providing a home, a place to live * Being the legal guardian of a someone (called conservatorship, in the United States) * Caring for someone who is sick, or in bad health * Providing food, or clothing * Giving someone an education * Allowing them to spend their free time using leisure activities * Pocket money (usually called allowance) - a small amount of money those cared for can spend on things they like. == References == Category:Family law",
 "title": "Alimony"
}