{
 "id": "869854",
 "text": "Ahmad Hussein Deedat (; ) was a renowned Muslim thinker, author, orator and scholar of comparative religion. Born in Surat (India) in 1918, he joined his father in South Africa in 1927. He was able to learn English in a short time and was a bright pupil. However, he had to leave school at the age of 16 to support his family. He vigorously pursued self-education, including extensive studies on comparative religion, while working in a furniture shop. He was profoundly influenced by observing that, in addition to racial discrimination, the authorities used religious ideology to “numb the masses,” and that there was a profound misunderstanding of Islam among non- Muslims. He was inspired by the concept of holding interreligious public debates, which he read about in Kairanvi’s book “Truth Revealed” He delivered his first lecture, entitled “Mohammad: Messenger of Islam” in a movie theater in Durban, with only 15 people attending. Within a short time, his lectures attracted thousands of people who crossed the racial barrier to listen to him and ask questions. What distinguished Deedat from his contemporaries was his intensive knowledge of the Bible and Holy scriptures, coupled with his command of English. Following this tremendous initial success, The 51 Shaikh decided to dedicate his life to the explanation of Islam and promotion of its values. His contributions, especially in the field of comparative religion, extended for more than 40 years and included his authorship of numerous books and manuscripts in addition to hundreds of audio-taped lectures, televised programs and public debates on Islam. Sheikh Deedat almost single-handedly established the As- Salam Center to train propagators of Islam and provide them with theological tools to defend it. He also founded and chaired the Islamic Propagation Center International in Durban, South Africa. ==References== Category:1918 births Category:2005 deaths Category:Indian Muslims",
 "title": "Ahmed Deedat"
}