{
 "id": "86984",
 "text": "Baldwin County is a county in the U.S. state of Alabama. It is named in honor of Abraham Baldwin, a member of the United States Senate from Georgia who never actually lived in Alabama. In 2020, 231,767 people lived there. The county seat (capital city) is Bay Minette. == History == Baldwin County was made on December 21, 1809, ten years before Alabama became a state. Before this, the county had been a part of the Mississippi Territory until 1817 when the area passed into the Alabama territory The borders of the county has often changed, and many armies have invaded. In the first days of Baldwin County, the town of McIntosh Bluff (now in Mobile County) on the Tombigbee River was the county seat. Then the county seat moved to the town of Blakeley in 1810, and then to the City of Daphne in 1868. In 1900, by an Act of the Legislature of Alabama said that the county seat should move to the City of Bay Minette. The City of Daphne was not happy about this move, because being the county seat meant more people visit the city and businesses can sell more. To move the county seat to Bay Minette, some men from Bay Minette pretended that there had been a murder. When the sheriff and his deputy left the City of Daphne to look for the murderer the men from Bay Minette went to the City of Daphne. These men got the records from the Baldwin County Courthouse and took them back to the City of Bay Minette. A New Deal mural in the Bay Minette post office is a painting of this story. Baldwin County is close to the Gulf of Mexico. This is why it often has tropical weather systems which often are Hurricanes. Weather damage can sometimes be very bad, and sometimes the county is made a disaster area. For example, in September 1979 due to damage from Hurricane Frederic, in July 1997 due to Hurricane Danny, in September 1998 from Hurricane Georges in September 2004 due to damage from Hurricane Ivan and again in August 2005 due to damage from Hurricane Katrina. == Geography == According to the U.S. Census Bureau, the county has a total area of . of it is land and is water. Baldwin County is the 12th largest county east of the Mississippi River. === Neighbouring counties === * Monroe County, Alabama - northeast * Escambia County, Florida - east * Escambia County, Alabama - east * Mobile County, Alabama - west * Washington County, Alabama - northwest * Clarke County, Alabama - northwest == Environment == Two parts of Baldwin County have been called \"Outstanding Alabama Water\" by the Alabama Environmental Management Commission which oversees the Alabama Department of Environmental Management. As of April, 2007, only two other areas in Alabama have received what is the \"highest environmental status\" in the state. The areas are * part of Wolf Bay and * of the Tensaw River in northern Baldwin county. Officials think that having very clean areas of water and sea will encourage tourists to vistit the county.Gary Busby, Wolf Bay Listed as Outstanding Alabama Water, The Mobile Register, Baldwin Register, Tuesday, April 24, 2007, page 1 == People == At the census in 2020, there were 231,767 people, 93,116 households, and 64,222 families living in the county. The population density was 145.8 people per square mile (56.3/km²). The people in the county are 81.7% White, 7.9% Black or African American, 3.9% other, and 6.5% from two or more races. Hispanic or Latino were 5.5% of the people. There were 93,116 households, out of which 28.5% had children under the age of 18 living with them, 52.8% were married couples living together, 25.8% had a female householder with no partner present, 16.0% had a male householder with no partner present, and 31.0% were non-families. 26.1% of all households were made up of individuals and 12.5% had someone living alone who was 65 years of age or older. The average household size was 2.49. == Regions == * North Baldwin * Eastern Shore * Central Baldwin * South Baldwin * Southwest Baldwin * East Baldwin == Municipalities == === Cities === * Bay Minette * Daphne * Fairhope * Foley * Gulf Shores * Magnolia Springs * Orange Beach * Robertsdale * Spanish Fort === Towns === * Elberta * Loxley * Silverhill * Summerdale === Unincorporated areas === * Barnwell * Bayside * Belforest * Blackwater * Blakeley * Bon Secour * Bromly * Clay City * Crossroads * Elsanor * Fort Morgan * Houstonville * Josephine * Lillian * Magnolia Beach * Malbis * Marlow * Miflin * Montrose * Oak * Oyster Bay * Park City * Perdido * Perdido Beach * Perdido Key * Pine Grove * Pine Haven * Point Clear * Rabun * River Park * Romar Beach * Seacliff * Seminole * Stapleton * Stockton * Swift * Tensaw * Turkey Branch * Weeks Bay * Whitehouse Fork * Yupon == Education == All public schools in Baldwin County are operated by Baldwin County Public Schools. == References == == Other websites == * Baldwin County * Baldwin County map of roads/towns (map © 2007 Univ. of Alabama). * Baldwin County Economic Development Category:Alabama counties Category:1809 establishments in the United States Category:1800s establishments in Mississippi Territory",
 "title": "Baldwin County, Alabama"
}