{
 "id": "869912",
 "text": "King Abdulaziz University is a public university in Jeddah, Saudi Arabia. The establishment of this university was in the year 1387 AH / 1967 AD as a private university, with the aim of spreading higher education in the western region of the Kingdom of Saudi Arabia. With the efforts of the loyal people of this country, the dream turned into reality and the idea came into existence, as the members of the Preparatory Committee had a meeting with King Faisal bin Abdul Aziz, and he expressed all support and support for the idea of the project, and formed the founding committee of the university headed by the late King Faisal and His Excellency the Minister of Education at the time Sheikh Hassan bin Abdullah Al Sheikh. The university began its first academic year in the year (1388 AH - 1968 AD) with the opening of the preparatory study program, with a small number of male and female students (68 males - 30 female students), and in the immediately following year, the first college in the university (the College of Economics and Administration) was opened, and in the following year a college was established Arts and Humanities After the esteemed Council of Ministers issued a decision in the year (1391 AH) to annex the university to the state, and thus it was transformed from a private university to a governmental one, at the same time another decision was issued to include the faculties of Education, Sharia and Graduate Studies, which had been in existence since (1369 AH - 1949 AD) in Mecca Al-Mukarramah to King Abdul Aziz University, then separated after that to be attached to Umm Al-Qura University after its establishment. == Notable alumni == *Assim al-Hakeem is a Saudi Arabian Islamic Scholar. *Suhad Bahajri *Samia al-Amoudi == Reference == == Other websites == * * * KAU ranking from Times Higher Education World University Rankings. * Faculty of Design and Arts Category:1967 establishments in Asia Category:Jeddah Category:Colleges and universities in Saudi Arabia",
 "title": "King Abdulaziz University"
}