{
 "id": "869991",
 "text": "Tariq Jamil is a Deobandi scholar who is also one of the most popular preachers in Pakistan. He belongs to the Tablighi Jamaat group and his lectures focus on the subject of self-purification, avoidance of violence, observance of Allah’s orders and pursuing the way of Muhammad. After completing pre-medical studies, Maulana Tariq was admitted to the King Edward Medical College in Lahore. It was there—under the influence of members of the Tablighi Jamaat—that his focus changed to Islamic Education. His Islamic training is from Jamia Arabia, where he studied Qur’an, Hadith, Sufism, logic and Islamic jurisprudence. Maulana Tariq’s background in the sciences allows him to explain Islamic matters in a way that appeals to liberal Muslims. Additionally, his simple lifestyle and fluency in Urdu and Arabic, led to his fame across the Muslim world. Molana Tariq Jamil Foundation Molana Tariq Jamil, A revered figure since 1980s, has dedicated his life to philanthropy with a mission to uplift those in need. recognizing the deep-rooted need of support, he established the MTJ Foundation as a beacon of hope for those in need. His lifelong commitment to helping others is now embodied in the foundation, providing education, healthcare, and economic empowerment. Htis compassionate vision ensures that this impact transcends his own lifetime, leaving a lasting legacy of positive change for generations to come. \"Be Merciful to those on the earth, and the One in the heavens will have mercy upon you\" Sunan al-Tirmidhi 1924. Solving World's Problems with Innovative Ideas and New Thinking. MTJ Foundation ==Personal Life== Tariq Jamil is married to Safia Jamil and has 2 children namely Yousaf Jamil, Asim Jamil and Ali Jamil. On 29 October 2023, his second son Asim, passed away in Khanewal District, Punjab. == References == == Other websites == * * Category:1953 births Category:Living people Category:Missionaries Category:Punjabi people Category:Pakistani Muslims Category:Hanafis",
 "title": "Tariq Jamil"
}