{
 "id": "869901",
 "text": "Abdul Rahman Ibn Abdul Aziz al-Sudais (Arabic: عَبْدُ الرَّحْمَنِ السُّدَيْسُ) was born in the city of Qassim, Saudi Arabia in the year 1961, is a Saudi world renown Qari. In addition to being the Chief Imam and Khateeb of Masjid Al Haram in Makkah, he is also the President of the General Presidency for the Affairs of the Two Holy Mosques. At the tender age of 12, Al Sudais had memorized the Holy Qur’an, and completed his preliminary education in the ‘Al Muthana Bin Harith Elementary School ‘ and graduated in 1979 with excellent grades. The renowned Imam studied in Riyadh University – presently known as King Saud University, received a degree in Sharia in 1983, and a Master from the Sharia College of Imam Muhammad bin Saud Islamic University in 1987. In 1995 he was awarded a Ph.D. in Islamic Sharia from Umm al-Qura University and he is one of the senior teachers in the Faculty of Sharia at the same place. Sheikh Al Sudais is known for his magnanimous voice and for his emotional, overwhelming recitation of the Quran in accordance with Tajweed. Every believer of the Muslim Ummah is not alien to this voice, so much so that Sheikh Abdul Rehman Al Sudais was even appointed by King Salman to deliver Hajj Khutbah in the year 2016/1437. In 2005, he received the prize of the ‘ Islamic Personality Of the year’ in the 9th annual Dubai International Holy Quran Award. Sheikh Sudais is currently overlooking the progress of the much talked about expansion of both Masjids in Makkah and Madinah, as the expansion in Masjid Al Haram targets completion at the earliest. == References == == Other websites == * Quran recitation by Abdul Rahman Al-Sudais on Google Play (free listening and free download) * Salaat and other recordings (Audio / Video) Abdul Rahman Al-Sudais * Abdul Rahman Al-Sudais Recitation of complete Quran * Based on Koranic Verses, Interpretations, and Traditions, Muslim Clerics State: The Jews Are the Descendants of Apes, Pigs, And Other Animals by Aluma Solnick (MEMRI Special Report - No. 11. November 1, 2002) * A question of leadership (BBC. Panorama) August 21, 2005 * Statement of the Islamic Thinkers Society on As-Sudais Category:1960 births Category:Living people Category:Saudi Arabian Muslims Category:Imams Category:People who memorized the Quran Category:People from Riyadh Category:King Saud University alumni Category:Critics",
 "title": "Abdul-Rahman Al-Sudais"
}