{
 "id": "870083",
 "text": "The National September 11 Memorial & Museum (also known as the 9/11 Memorial & Museum) is a memorial and museum in New York City honoring the victims of the September 11, 2001 attacks, which killed 2,977 people, and the 1993 World Trade Center bombing, which killed six. ==Background== The memorial is located at the World Trade Center site, the former location of the Twin Towers that were destroyed during the September 11 attacks. A memorial was planned shortly after the attacks for the victims and those involved in rescue and recovery operations. The winner of the World Trade Center Site Memorial Competition was Israeli-American architect Michael Arad. The memorial has swamp white oak trees with two square reflecting pools in the center marking where the Twin Towers stood. The reflecting pool of the memorial has the names of the victims who died during the 1993 World Trade Center bombing, United Airlines Flight 93, American Airlines Flight 11, American Airlines Flight 77, United Airlines Flight 175, collision of The Pentagon and the collapse of the World Trade Centers. Tickets to the museum are $24, a price which has raised concerns and has been controversial.\"The Approval Matrix\" . New York, February 3, 2014, p.100 The dead bodies of over 1,000 victims who could not be identified have been placed 70ft below the memorial in 2014.Stepansky, Joseph; Badia, Erik; McShane, Larry (May 11, 2014). \"The Anger Remains\". Daily News (New York). p. 4. ==Gallery== File:North Tower Fountain National September 11 Memorial & Museum (Sept. 17, 2011).jpg|The North Tower reflecting pool which is located where the original Twin Towers were located in File:New York - National September 11 Memorial South Pool - April 2012 - 9693C.jpg|The South Tower reflecting pool which is located where the original Twin Towers were located in File:4.28.12Feb93BombingPanelN-73ByLuigiNovi2.jpg|The reflection pool has the names of the victims of the September 11 attacks and the 1993 World Trade Center bombing File:The Survivor Tree at the National September 11 Memorial.jpg|The survivor tree is a tree that survived the collapses of the Twin Towers File:2012 National September 11 Museum.JPG|The outside of the National September 11 Museum File:Survivors Staircase 2015 3 vc.jpg|The museum has many parts that survived the World Trade Centers such as a staircase File:Part of airplane.jpg|The museum also has a piece of the hijacked airplane that crashed into the towers File:911 Memorial New York.jpg|View of the memorial and museum from the One World Trade Center File:WTCmemorialJune2012.png|The memorial in 2012 File:September 11 Memorial 2 (29172573633).jpg|A firetruck that was destroyed during the attacks is in the museum File:A section of the 9-11 Memorial lists those who lost their lives in the World Trade Center attacks, in New York, N.Y., Nov. 12, 2012 121112-A-QM437-159.jpg|The names of the victims that died during the collapse of the Twin Towers File:10.2012 North Pool National September 11 Memorial 04.JPG|A closeup of one of the reflecting pools at the memorial ==References== ==Other websites== *Photos of the memorial *The 9/11 memorial – Interview and footage of the WTC site *Google Virtual Tour of the National September 11 Museum Category:National Memorials of the United States Category:September 11 attacks Category:Buildings and structures in New York City",
 "title": "National September 11 Memorial & Museum"
}