{
 "id": "870090",
 "text": "Tak: Mojo Mistake (also called Tak 4 or Tak 5) is a 2D Action Adventure Video Game for the Nintendo DS. It was made by Nickelodeon and Play THQ. == Plot == Tak finds himself exhausted from trying to help eveyone in his village. He decided to use his Juju magic create little helpers called Hackies. But when these little critters become unruly and unexpectedly multiply into hundreds, they invade both the Pupununu Village and The Juju Realm. Now Tak must do all he can to get rid of the troublemakers and restore balance to both worlds. == Gameplay == Tak's second DS adventure, Tak: Mojo Mistake takes him on a journey you won't recognize. It features additional content such as casting spells and mixing alchemical ingredients using the touch screen. Flip the DS sideways to play in the Juju Realm. Share ingredients with other players to create special spell \"recipes\". == Minigames == * Dodge Ball Mini Game-Use the stylus to throw balls to defeat the Caged Juju. * Chase Mini Game-Avoid obstacles to escape the Belly Juju. * Block Buster-Pop clouds to get to the Juju Realm. == Characters == * Tak * Jibolba * Lok * Jeera * Keeko * Chief * Slog * Zaria * Onga * Taka == Jujus == * Belly Juju * Caged Juju * Dinky Juju * Fauna * Flora * Flyer Juju * Kamikaze Juju * Party Juju * Perfect Juju (Mentioned by Party Juju) * Psychic Juju (Called Mind-Reader Juju) * Stony Juju * Woody Juju == Reception == Tak: Mojo Mistake recieved generally good reviews, but these reviews were better than it's companion, Tak and the Guardians of Gross. IGN says: : \"Traditionally a 3D platformer, Tak: Mojo Mistake makes the transition to two dimensions remarkably well. The controls are tight and don't rely on the touch-screen too much while still providing a decent amount of gameplay variety and the new perspective allows for some amusing visual designs as well. Environment repetition becomes a problem later on, but the brief length of the typical quest is perfectly suited for the short play sessions Nintendo's handheld is known for. In the end, Tak: Mojo Mistake may not be the next New Super Mario Bros. but it does provide a few hours of old-school 2D platforming entertainment for gamers of all ages.\" == Trivia == * This is the first game in the series to include both Television Characters and Game Characters in the same universe. ** It will also be the only time that some characters from the Video Games would appear. ** It also has the village spelled as Pupanunu, and the Television Series has it spelled Pupununu * Mojo Mistake was releases on the same day as Tak and the Guardians of Gross, which was released only on the PlayStation 2 and Wii. ** Due to this, they both could be called Tak 4. * Mojo Mistake is the only game to be released on one console, and is the only time a handheld version had a completely different storyline. * Many graphics and assests from the game are reused from the Nintendo DS version of Tak: The Great Juju Challenge. * Tak also uses his Thwark, and can upgrade to the Dream Shaker and his staff from the T.V series. * In the very beginning, Jibolba tells Tak to not go quickly run off, or he will accidently turn the village into Sheep. This is a reference to the first game, where Tlaloc turned the village into sheep. * The Hackies could have been inspired by Pins and Needles, for they were all created by juju magic and have the appearance of voodoo dolls. == Other websites == * Tak Mojo Mistake * Tak Mojo Mistake * Tak Mojo Mistake * Tak Mojo Mistake Category:2008 video games Category:Nintendo DS games Category:Nintendo DS-only games Category:THQ games Category:Platform games",
 "title": "Tak Mojo Mistake"
}