{
 "id": "870094",
 "text": "Al-Baqarah, (\"The Heifer\" or \"The Cow\"), is the second and longest chapter (surah) of the Quran.Salwa M. S. El - Awa, Introduction to Textual Relations in Qur'an, pg. 1. Part of the Routledge Studies in the Qur'an series. London: Routledge, 2005. It consists of 286 verses (āyāt). == Summary == * 1-20 Unbelievers and hypocrites reproved * 21-38 Exhortation to the worship of the true God * 39-102 Jews and Christians urged to accept the claim of Muhammad to be a prophet of God * 102-112 The opposition of Jews and Christians to Muhammad’s prophetic pretensions combated * 113 The doctrine of abrogation enunciated * 115 A Qibla declared to be redundant * 116-141The Jews denounced and the religion of Abraham declared to be the true Islam * 142-153 The Jews finally abandoned and the Arabs accepted by the adoption of Makkah as the Qibla of Islam * 154-163 The Bereaved friends of those slain at the Battle of Badr comforted * 164-172 Makkans exhorted to faith in God, and directed to observe the law respecting forbidden meats * 173-176 Law concerning lawful and unlawful food (delivered at Madina) * 177 The sum of Muslim duty * 178-179 The law of retaliation * 180-182 The law concerning bequests * 183-185 The law concerning fasting * 186-187 The fast of Ramadan * 188-202 The pilgrimage to Makkah and war for the faith * 203-206 Hypocrites and true believers contrasted * 207-208 Exhortation to a hearty acceptance of Islam * 209 The doom of infidels pronounced * 210-212 The Jews reproached * 213 Suffering to be patiently endured * 214-242 Sundry laws relating to almsgiving, war, wine, orphans etc. * 243-253 The duty of warring in defence of religion enjoined by precept, and illustrated by the history of former prophets * 255 The Throne Verse * 256-257 Laa ikraha fid deen. * 258-260 The doctrine of the resurrection illustrated * 261-274 Exhortation and encouragement to almsgiving * 275-277 Usury forbidden * 278-283 Debts in Islam including the longest verse in the Quran * 284-286 The three verses of Paradise. == References == == Other websites == * Q2:30, 50+ translations, islamawakened.com * \"The Cow\", a manuscript, dating from the 13th-century, of the al-Baqarah via the World Digital Library * Qur'anic Verses, a manuscript for al-Baqarah from the 13th- century Category:Cattle Category:Chapters in the Quran",
 "title": "Al-Baqarah"
}