{
 "id": "870089",
 "text": "Individuals that are part of a larger group are less likely to be the victim of an accident, attack, or other bad event. This idea is called safety in numbers. Related theories show that mass behaviour can reduce accident risks. In the case of traffic safety, the effect really reduces the danger, rather than simply distributing it over a larger group. == In biology == The mathematical biologist W.D. Hamilton proposed his selfish herd theory in 1971. This theory tries to explain why animals seek central positions in a group: each individual can reduce its own danger by putting itself in a position with neighbours all around. So it moves towards the centre of the group. The effect was tested in brown fur seal predation by great white sharks. Decoy seals were used, and the distance between them was varied to produce different levels of danger. The seals in greater danger had (as predicted) an increased risk of shark attack. Antipredator adaptations include behaviour such as the flocking of birds, herding of sheep, and schooling of fish. Similarly, before jumping into the water, Adelie penguins wait until their group is large enough: this reduces the risk of seal predation for each penguin in the group. The same result can be seen when predators face a large number of prey animals: the chance of each prey animal surviving is greater. == In road traffic safety == In 1949 R. J. Smeed reported that per capita road death rates tended to be lower in countries where more people owned a motor vehicle. This observation led to Smeed's Law. In 2003 P. L. Jacobsen compared rates of walking and cycling, in different countries. Jacobsen looked at the rates of collisions between motorists and cyclists or walkers. He found an inverse relationship. He used a concept called 'behavioural adaptation' to explain this. The concept says that drivers who are exposed to more cyclists on the road begin to drive more safely around them. Though an attractive concept for cycling advocates, it has not been empirically validated. Other combined modelling and empirical evidence suggests that while changes in driver behaviour might still be one way that collision risk per cyclist declines with greater numbers, the effect can be easily produced through simple spatial processes similar to the biological herding processes described above. Without consideringthe other two hypotheses, Jacobsen concluded that \"A motorist is less likely to collide with a person walking and bicycling if more people walk or bicycle.\" He described this theory as \"safety in numbers.\" Safety in numbers is also used to describe the following evidence: The number of pedestrians or cyclists correlates inversely with the risk of a motorist colliding with a pedestrian or cyclist. This non-linear relationship was first shown at intersections. Ecologic data from cities in California and Denmark, and European countries, as well as time-series data for the United Kingdom and the Netherlands confirmed it. The number of pedestrians or bicyclists injured increases at a slower rate than would be expected based on their numbers. That is, more people walk or cycle where the risk to the individual pedestrian or bicyclist is lower. A 2002 study looked at the question whether pedestrian risk decreased with pedestrian flow. The study used 1983-86 data from signalized intersections in a town in Canada. It found that in some cases pedestrian flow increased where the risk per pedestrian decreased. After cycling was promoted in Finland, there was a 75% drop in cyclists deaths and the number of trips increased by 72%. Between 2000 and 2008, serious bicycle injuries in England declined by 12%. Over the same period, the number of bicycle trips made in London doubled. Motor vehicle traffic decreased by 16%, bicycle use increased by 28% and cyclist injuries had decreased by 20% in the first year of operation of the London Congestion Charge. In January 2008, the number of cyclists in London that had been treated in hospitals for serious injuries had increased by 100% in six years. Over the same time, they report, the number of cyclists had increased by 84%. In York, comparing the periods 1991-93 and 1996–98, the number of bicyclists killed and seriously injured fell by 59%. The percentaghe of trips made by bicycle rose from 15% to 18%. In Germany, between 1975 and 2001, the total number of bicycle trips made in Berlin increased four-fold. Between 1990 and 2007, the percentage of trips made by bicycle increased from 5% to 10%. Between 1992 and 2006, the number of serious bicycle injuries fell by 38%. In Germany as a whole, between 1975 and 1998, cyclist fatalities fell by 66% and the percent of trips made by bicycle rose from 8% to 12%. In America, during the period 1999-2007, the number of cyclists killed or seriously injured decreased by 29% and the amount of cycling in New York city increased by 98%. In Portland, Oregon, between 1990 and 2000, the percentage of workers who commuted to work by bicycle rose from 1.1% to 1.8%. By 2008, the proportion has risen to 6.0%; while the number of workers increased by only 36% between 1990 and 2008, the number of workers commuting by bicycle increased 608%. Between 1992 and 2008, the number of bicyclists crossing four bridges into downtown was measured to have increased 369% between 1992 and 2008. During that same period, the number of reported crashes increased by only 14%. In Copenhagen, Denmark, between 1995 and 2006, the number of cyclists killed or seriously injured fell by 60%. During the same period, cycling increased by 44% and the percent of people cycling to work increased from 31% to 36%. In the Netherlands, between 1980 and 2005, and cyclist fatalities decreased by 58% and cycling increased by 45%. During 7 years of the 1980s, admissions to hospital of cyclists declined by 5% and cycling in Western Australia increased by 82%. == References == == Other websites == * Category:Coevolution Category:Pages with unreviewed translations Category:Traffic",
 "title": "Safety in numbers"
}