{
 "id": "870109",
 "text": "Sukh Mhanje Nakki Kay Asta! (transl. What Exactly Is Happiness!) is a Marathi television drama series on Star Pravah produced by Mahesh Kothare and Adinath Kothare. == Cast == === Main === * Girija Prabhu as Gauri Jaydeep Shinde: Jaydeep's wife; Shirke-Patil's younger daughter ; Malhar Renuka and Uday's younger sister;Lakshmi's Mother; **as Nitya Adhikari *Mandar Jadhav as Jaydeep Shinde: Gauri's husband; Mangal's son; Lakshmi's Father **as Adhiraj Jadhav === Recurring === * Varsha Usgaonkar as Nandini Yashwant Shirke-Patil (Mai): Yashwant's wife; Malhar, Gauri, Renuka and Uday's mother; Krish, Kashish and Lakshmi's grandmother * Sunil Godse as Yashwant Shirke-Patil (Dada): Nandini's husband; Malhar, Jaydeep, Renuka and Uday's father; Krish, Kashish and Lakshmi's grandfather * Madhavi Nimkar as Shalini Malhar Shirke-Patil: Shirke- Patil's eldest daughter-in-law; Malhar's wife; * Kapil Honrao as Malhar Yashwant Shirke-Patil: Shirke-Patil's eldest son; Shalini's husband; * Meenakshi Rathod / Bhakti Ratnaparkhi as Devki Uday Shirke-Patil: Shirke- Patil's second daughter-in-law * Sunil Patil as Uday Yashwant Shirke-Patil: Shirke-Patil's second son * Aparna Shardul as Renuka Yashwant Shirke-Patil: daughter of Mai & Dadasaheb * Ganesh Revadekar as Shekhar: Renuka's husband * Aarohi Sambre as Kashish Shirke-Patil – Devki and Uday's daughter * Amrut Gaikwad as Krish Shirke-Patil – Devki and Uday's son === Others === * Asha Dnyate as Amma: Maid of Shirke-Patil's house * Abhishek Gaonkar as Anil: Devki's brother * Sayli Salunkhe as Jyotika: Jaydeep's girlfriend ** Ketaki Palav replaced Sayali as Jyotika Prashant Karnik * Sanket Korlekar as Parth: Jaydeep & Jyotika's friend * Milind Shinde as Bhairu Pahilwan * Ashwini Kasar as Manasi == TVT Ratings == Week Year BARC Viewership Ref. TVT Rank Week 38 2020 3.3 4 Week 39 2020 3.4 5 Week 50 2020 6.4 1 Week 8 2021 4.4 3 Week 9 2021 5.4 2 Week 20 2021 6.0 2 Week 21 2021 7.0 1 Week 22 2021 6.0 2 == References == Category:2020 Indian television series debuts",
 "title": "Sukh Mhanje Nakki Kay Asta"
}