{
 "id": "870114",
 "text": "The Last Girl: My Story of Captivity, and My Fight Against the Islamic State is a autobiographical book by Nadia Murad in which she tells how she was captured and enslaved by the Islamic State during the Second Iraqi Civil War. Murad won the 2018 Nobel Peace Prize for this book. == Synopsis == In the first part of the book, Murad writes about growing up in the Yazidi village of Kocho, Sinjar District. She lived there with her mother, two older sisters and eight older brothers. Murad writes about several disputes with nearby Sunni villages and terrorist attacks that she remembered. She then talks about the August 2014 occupation of Kocho by the Islamic State of Iraq and the Levant. During the occupation, ISIS people killed many people in Kocho in a massacre. Some of the people of Kocho ran away to the Sinjar Mountains, and the rest were kidnapped by ISIS. The ISIS agents told the men still in Kocho that they had to change religions. The men of Kocho said no, and the ISIS agents killed them. Young women were kidnapped as sexual slaves. Murad criticized Peshmerga troops for running away from Kocho one day before the massacre. In the second part of the book, Murad tells the readers about what happened to her during the Second Iraqi Civil War. ISIS agents took her and other women to an place in Solagh. She was then taken to Mosul, which had been captured by ISIS in June 2014. Yazidi women who weren't enslaved were attacked by anyone who wanted to hurt them. A high-ranking militant wanted to buy Murad, but she convinced a skinnier judge to buy her instead. When Murad was in Al-Hamdaniya District, she tried attempted to escape through a window. The guards who caught her raped her and sent her away to an ISIS checkpoint. She was imprisoned there and raped by people passing. Then she was bought by someone in Mosul again. There, she successfully and easily escaped that man, who had left the front door unlocked. She said that was miraculous. In the third part of the book, Murad talks about how she escaped from ISIS-held territory. First, she walked around Mosul for almost two hours. Then she saw a family and asked them for help. They agreed to help her run away. Murad used fake identities to escape with the family's younger son. The family sent him away with Murad so he would not join ISIS. Murad and the boy entered Iraqi Kurdistan, but they kept their fake identities so that no one would use Murad's status as a former slave for political reasons. Murad found she could not leave Sulaymaniyah, so she decided to tell her story to the Patriotic Union of Kurdistan. The PUK gave the interview to the media, even though they had said they wouldn't. This meant that the family who had helped Murad in Mosul were in danger. Murad found some people from her family, and she waited to learn about the rest. Her mother had been killed in Solagh, and Nadia's niece Kathrine, who had tried to escape six times, had been killed in the same explosion blast that injured Lamiya Aji Bashar. Six of Murad's brothers had been killed, and one of her nephews had become an ISIS soldier. == Release == Murad's attorney is Amal Clooney, a Lebanese-British barrister. Clooney wrote the foreword to The Last Girl. ==Sales in Europe== The Last Girl was released for sale in the UK, Germany and Netherlands on October 31, 2017. Rights to print the book were sold in twenty other territories. According to the Associated Press, Murad noted in a statement \"that she had lost numerous friends and family members to ISIS and hoped her story would 'influence world leaders to act. The book was released right after the October 2017 Iraqi–Kurdish conflict. == References == Category:2017 books Category:Terrorist attacks Category:Iraq War Category:Sex crimes Category:Imprisonment and detention Category:Autobiographies",
 "title": "The Last Girl (memoir)"
}