{
 "id": "870119",
 "text": "First-wave feminism was a time of feminist activity and thought in the Western world. It happened during the 19th and early 20th century. It focused on laws about women, mainly giving women the right to vote. Later waves of feminism would focus on things like economic equality and social equality. Journalist Martha Lear was the first to call it first-wave feminism. She did this in an article she wrote for New York Times Magazine in March 1968. It was called \"The Second Feminist Wave: What do these women want?\" First-wave feminism focused on women's power under law. Second-wave feminism was about economic and social power, for example, equal pay for equal work. In her book The Second Sex, Simone de Beauvoir wrote that the first woman to \"take up her pen in defense of her sex\" was Christine de Pizan. Christine de Pizan wrote in the 15th century. Feminists Heinrich Cornelius Agrippa and Modesta di Pozzo di Forzi worked in the 16th century. Marie le Jars de Gournay, Anne Bradstreet and François Poullain de la Barre's Equality of sexes came out in 1673. == Timeline == ; 1809 * US, Connecticut: Married women were allowed to execute wills. ; 1811 * Austria: Married women were granted separate economy and the right to choose their jobs.Richard J Evans (1979). Kvinnorörelsens historia i Europa, USA, Australien och Nya Zeeland 1840–1920 (The Feminists: Women's Emancipation Movements in Europe, America and Australasia, 1840–1920) Helsingborg: LiberFörlag Stockholm. (Swedish) * Sweden: Married businesswomen were allowed to make decisions for their businesses without their husband's permission. ; 1821 * US, Maine: Married women were allowed to own and manage property in their own name if their spouse could not. ; 1827 * Brazil: The first elementary schools for girls opened.A companion to gender history by: Teresa A. Meade, Merry E. Wiesner-Hanks ; 1829 * Sweden: Midwives were allowed to use surgical tools, which were unique in Europe at the time and gave them surgical status. Stig Hadenius, Torbjörn Nilsson & Gunnar Åselius: Sveriges historia. Vad varje svensk bör veta (History of Sweden: \"What every Swede should know\") ; 1832 * Brazil: Dionísia Gonçalves Pinto, under the pen name Nísia Floresta Brasileira Augusta, published her first book. It was a translation of Woman not Inferior to Man, often attributed to Mary Wortley Montagu. ; 1833 * US, Ohio: The first co-educational American university, Oberlin College, was founded. * Guatemala: Divorce was made legal; this was rescinded (reversed) in 1840 and made legal again in 1894.Women's Roles in Latin America and the Caribbean by Kathryn A. Sloan ; 1835 * US, Arkansas: Married women were allowed to own, but not control, property in their own name. ; 1838 * US, Kentucky: Kentucky gave school suffrage (the right to vote at school meetings) to widows with children of school age. * US, Iowa: Iowa was the first U.S. state to allow sole custody of a child to its mother in the event of a divorce. * Pitcairn Islands: The Pitcairn Islands granted women the right to vote. ; 1839 * US, Mississippi: Mississippi was the first U.S. state that gave married women limited property rights. * United Kingdom: The Custody of Infants Act 1839 made it possible for divorced mothers to be granted custody of their children under seven, but only if the Lord Chancellor agreed to it, and only if the mother was of good character. * US, Mississippi: The Married Women's Property Act 1839 granted married women the right to own (but not control) property in their own name. ; 1840 * US, Texas: Married women were allowed to own property in their own name. ; 1841 * Bulgaria: The first secular girls school in Bulgaria was opened, meaning girls could get education and women could teach. ; 1842 * Sweden: Compulsory elementary school for both sexes was introduced. ; 1844 * US, Maine: Maine was the first U.S. state that passed a law to allow married women to own separate property in their own name (separate economy) in 1844. * US, Maine: Maine passed Sole Trader Law which let women engage in business without the need for their husbands' consent. * US, Massachusetts: Married women were granted separate economy. ; 1845 * Sweden: Equal inheritance for sons and daughters (in the absence of a will) became law.Lilla Focus Uppslagsbok (Little Focus Encyclopedia) Focus Uppslagsböcker AB (1979) * US, New York: Married women were granted patent rights. ; 1846 * Sweden: Trade and crafts works professions were opened to all unmarried women. ; 1847 * Costa Rica: The first high school for girls opened, and women could become teachers. ; 1848 * US, State of New York: Married Women's Property Act grant married women separate economy. * US, on June 14–15, third-party presidential candidate Gerrit Smith made women's suffrage a plank in the Liberty Party platform.Wellman, Judith. The Road to Seneca Falls , p. 176. University of Illinois Press, 2004. * US, State of New York: A women's rights convention called the Seneca Falls Convention was held in July. It was the first American women's rights convention. ; 1849 * US: Elizabeth Blackwell, born in England, became the first female medical doctor in American history. ; 1850 * United Kingdom: The first organized movement for English feminism was the Langham Place Circle of the 1850s. They also campaigned for improved female rights in employment, and education. * Haiti: The first permanent school for girls was opened. * Iceland: Equal inheritance for men and women was required. * US, California: Married Women's Property Act granted married women separate economy. * US, Wisconsin: The Married Women's Property Act granted married women separate economy. * US, Oregon: Unmarried women were allowed to own land. * The feminist movement began in Denmark with the publication of the feminist book Clara Raphael, Tolv Breve, meaning \"Clara Raphael, Twelve Letters,\" by Mathilde Fibiger. ; 1851 * Guatemala: Full citizenship was granted to economically independent women, but this was rescinded in 1879. * Canada, New Brunswick: Married women were granted separate economy. ; 1852 * US, New Jersey: Married women were granted separate economy. ; 1853 * Colombia: Divorce was made legal; this was rescinded in 1856 and made legal again in 1992. * Sweden: Both men and women could teach at both public primary and elementary schools.Inger Hultgren (Swedish): Kvinnors organisation och samhällets beslutsprocess (1982) ; 1854 * Norway: Equal inheritance for men and women was required. * US, Massachusetts: Massachusetts granted married women separate economy. * Chile: The first public elementary school for girls was opened.The Oxford encyclopedia of women in world history, Volym 1 by Bonnie G. Smith ; 1855 * US, Iowa: The University of Iowa became the first coeducational public or state university in the United States. * US, Michigan: Married women were granted separate economy. ; 1857 * Denmark: Legal majority was granted to unmarried women. * Denmark: A new law allowed unmarried women to earn their living in any craft or trade. * United Kingdom: The Matrimonial Causes Act 1857 enabled couples to obtain a divorce through civil proceedings. * Netherlands: Elementary education was made compulsory for both girls and boys. * Spain: Elementary education was made compulsory for both girls and boys. * US, Maine: Married women were granted the right to control their own earnings. ; 1858 * Russia: Gymnasiums for girls were opened. * Sweden: Legal majority was granted to unmarried women if applied for; automatic legal majority was granted in 1863. ; 1859 * Canada West: Married women were granted separate economy. * Denmark: Women could teach at public schools. * Russia: Women were allowed to audit university lectures, but this was retracted in 1863. * Sweden: Women could become college teachers. * US, Kansas: The Married Women's Property Act granted married women separate economy. ; 1860 * US, New York: New York passed a revised Married Women's Property Act which gave women shared legal custody of their children.Dicker, 2008, pp. 30, 38. ; 1861 * South Australia: South Australia granted property- owning women the right to vote in local elections. * US, Kansas: Kansas gave school suffrage to all women. Many U.S. states followed before the start of the 20th century. ; 1862 * Sweden: Restricted local suffrage was granted to women in Sweden. In 1919 suffrage was granted with restrictions, and in 1921 all restrictions were lifted. ; 1863 * Finland: In 1863, taxpaying women were granted municipal suffrage in the country side, and in 1872, the same reform was given to the cities. ; 1869 * United Kingdom: The UK granted women the right to vote in local elections. * US, Wyoming: the Wyoming territories grant women the right to vote, the first part of the US to do so. ; 1870 * US, Utah: The Utah territory granted women the right to vote, but it was revoked by Congress in 1887 as part of a national effort to rid the territory of polygamy. It was restored in 1895, when the right to vote and hold office was written into the constitution of the new state. * United Kingdom: The Married Women's Property Act was passed in 1870 and expanded in 1874 and 1882, giving women control over their own earnings and property. ; 1871 * Denmark: In 1871 the world's very first Women's Rights organization was founded by Mathilde Bajer and her husband Frederik Bajer, called Danish Women's Society (or Dansk Kvindesamfund). It still exists today. * Netherlands: First female academic student Aletta Jacobs enrolls at a Dutch university (University of Groningen). ; 1872 * Finland: In 1872, taxpaying women were granted municipal suffrage in the cities. ; 1881 * Isle of Man: The right to vote was extended to unmarried women and widows who owned property, and as a result 700 women received the vote, about 10% of the Manx electorate. ; 1884 * Canada: Widows and spinsters were the first women granted the right to vote within municipalities in Ontario, with the other provinces following throughout the 1890s. ; 1886 * US: All but six U.S. states allowed divorce on grounds of cruelty. * Korea: Ewha Womans University, Korea's first educational institute for women, was founded in 1886 by Mary F. Scranton, an American missionary of the Methodist Episcopal Church. ; 1891 * Australia: The New South Wales Womanhood Suffrage League was founded. ; 1893 * US, Colorado: Colorado granted women the right to vote. * New Zealand: New Zealand became the first self-governing country in the world in which all women had the right to vote in parliamentary elections. * Cook Islands: The Cook Islands granted women the right to vote in island councils and a federal parliament. ; 1894 * South Australia: South Australia granted women the right to vote. * United Kingdom: The United Kingdom extended the right to vote in local elections to married women. ; 1895 * US: Almost all U.S. states had passed some form of Sole Trader Laws, Property Laws, and Earnings Laws, granting married women the right to trade without their husbands' consent, own and/or control their own property, and control their own earnings. ; 1896 * Argentina: A group of anarcha-feminist women, headed by Virginia Bolten, publish La Voz de la Mujer, one of the first feminist newspapers of Latin America. * US, Idaho: Idaho granted women the right to vote. ; 1900 * Western Australia: Western Australia granted women the right to vote. * Belgium: Legal majority was granted to unmarried women. * Egypt: A school for female teachers was founded in Cairo.Women in the Middle East and North Africa: restoring women to history by Guity Nashat, Judith E. Tucker (1999) * France: Women were allowed to practice law.Gender and crime in modern Europe by Margaret L. Arnot, Cornelie Usborne * Korea: The post office profession was opened to women. * Tunisia: The first public elementary school for girls was opened. * Japan: The first women's university was opened. * Baden, Germany: Universities opened to women. * Sweden: Maternity leave was granted for female industrial workers. ; 1901 * Bulgaria: Universities opened to women. * Cuba: Universities opened to women. * Denmark: Maternity leave was granted for all women.\"/ * Sweden: The first Swedish law regarding parental leave was instituted in 1900. This law only affected women who worked as wage- earning factory workers and simply required that employers not allow women to work in the first four weeks after giving birth. * Commonwealth of Australia: The First Parliament was not elected with a uniform franchise. The voting rights were based on existing franchise laws in each of the States. Thus, in South Australia and Western Australia women had the vote, in South Australia Aborigines (men and women) were entitled to vote and in Queensland and Western Australia Aborigines were denied voting rights. ; 1902 * China: Foot binding was outlawed in 1902 by the imperial edicts of the Qing Dynasty, the last dynasty in China, which ended in 1911. * El Salvador: Married women were granted separate economy. * El Salvador: Legal majority was granted to married women. * New South Wales: New South Wales granted women the right to vote in state elections. * United Kingdom: A group of women textile workers from Northern England gave a petition to Parliament with 37,000 signatures demanding votes for women. ; 1903 * Bavaria, Germany: Universities opened to women. * Sweden: Public medical offices opened to women. * Australia: Tasmania granted women the right to vote. * United Kingdom: The Women's Social and Political Union was founded. ; 1904 * Nicaragua: Married women were granted separate economy. * Nicaragua: Legal majority was granted to married women. * Württemberg, Germany: Universities opened to women. * United Kingdom: The suffragette Dora Montefiore refused to pay her taxes because women could not vote. ; 1905 * Australia: Queensland granted women the right to vote. * Iceland: Educational institutions opened to women. * Russia: Universities opened to women. * United Kingdom: On October 10, Christabel Pankhurst and Annie Kenney became the first women to be arrested in the fight for women's suffrage. ; 1906 * Finland granted women the right to vote. It was the first country in Europe to do so. * Honduras: Married women were granted separate economy. * Honduras: Legal majority was granted to married women. * Honduras: Divorce was made legal * Korea: The profession of nurse was allowed for women. * Nicaragua: Divorce was made legal. * Sweden: Municipal suffrage, since 1862 granted to unmarried women, was granted to married women. * Saxony, Germany: Universities opened to women. * United Kingdom: A delegation of women from both the Women's Social and Political Union and the National Union of Women's Suffrage Societies met with the Prime Minister, Sir Henry Campbell-Bannerman. * United Kingdom: The word suffragette, intended as an insult to women in the Women's Social and Political Union, was used for the first time, by the Daily Mail. * United Kingdom: The National Federation of Women Workers was established by Mary Reid MacArthur. ; 1907 * France: Married women were given control of their income.French women's writing, 1848–1994 by Diana Holmes * France: Women were allowed guardianship of children. * Norway: Women were granted the right to stand for election, although this was subject to restrictions until 1913. * Finland: The first female members of parliament in world history were elected in Finland in 1907. * Uruguay: Divorce was made legal.Asunción Lavrín: Women, Feminism and Social Change in Argentina, Chile, and Uruguay, 1890–1940 * United Kingdom: The National Union of Women's Suffrage Societies organized its first national demonstration, which became known as the \"Mud March\" because of the terrible weather at the time. * United Kingdom: Emmeline Pethick-Lawrence and her husband Frederick launched the suffragette newspaper Votes for Women. * United Kingdom: The Women's Freedom League was formed when Charlotte Despard and others broke away from the Women's Social and Political Union. * United Kingdom: The Qualification of Women Act 1907 allowed women to be elected as mayors and to borough and city councils. ; 1908 * Belgium: Women were allowed to act as legal witnesses in court. * Denmark: Unmarried women were made legal guardians of their children. * Peru: Universities opened to women. * Prussia, Alsace-Lorraine and Hesse, Germany: Universities opened to women. * Denmark: Denmark granted women over 25 the right to vote in local elections. * Australia: Victoria granted women the right to vote in state elections. * United Kingdom: On January 17, suffragettes chained themselves to the railings of 10 Downing Street. Emmeline Pankhurst was sent to prison for the first time. The Women's Social and Political Union also introduced their stone-throwing campaign. ; 1909 * Sweden: Women were granted eligibility to municipal councils. * Sweden: The phrase \"Swedish man\" was removed from the application forms to public offices and women were thereby approved as applicants to most public professions. * Mecklenburg, Germany: Universities opened to women. * United Kingdom: In July, Marion Wallace Dunlop became the first imprisoned suffragette to go on a hunger strike. As a result, force-feeding was introduced. ; 1910 * Argentina: Elvira Rawson de Dellepiane founded the Feminist Center (Spanish: Centro Feminista) in Buenos Aires. * Denmark: The Socialist International, meeting in Copenhagen, established a Women's Day, international in character, to honor the movement for women's rights and to help in achieving universal suffrage for women. * US, Washington: Washington granted women the right to vote. * Ecuador: Divorce was made legal. * United Kingdom: November 18 was \"Black Friday\", when the suffragettes and police clashed violently outside Parliament after the failure of the first Conciliation Bill. Ellen Pitfield, one of the suffragettes, later died from her injuries. ; 1911 * United Kingdom: Dame Ethel Smyth composed \"The March of the Women\", the suffragette song. * Portugal: Legal majority was granted to married women (rescinded in 1933.) * Portugal: Divorce was made legal. * US, California: California granted women the right to vote. * Austria, Denmark, Germany and Switzerland: International Women's Day was marked for the first time in Austria, Denmark, Germany and Switzerland on 19 March. More than one million women and men attended IWD rallies campaigning for women's rights. * South Africa: Olive Schreiner published Women and Labor. ; 1912 * US, Oregon, Kansas, Arizona: Oregon, Kansas, and Arizona granted women the right to vote. * United Kingdom: Sylvia Pankhurst established her East London Federation of Suffragettes. ; 1913 * Russia: In 1913 Russian women observed their first International Women's Day on the last Sunday in February. Following discussions, International Women's Day was transferred to 8 March and this day has remained the global date for International Women's Day ever since. * US, Alaska: Alaska granted women the right to vote. * Norway: Norway granted women the right to vote. * Japan: Public universities opened to women. * United Kingdom: The suffragette Emily Davison was killed by the King's horse at The Derby. * United Kingdom: 50,000 women taking part in a pilgrimage organized by the National Union of Women's Suffrage Societies arrived in Hyde Park on July 26. ; 1914 * Russia: Married women were allowed their own internal passport. * US, Montana, Nevada: Montana and Nevada granted women the right to vote. * United Kingdom: The suffragette Mary Richardson entered the National Gallery and damaged the Rokeby Venus. ; 1915 * Denmark: Denmark granted women the right to vote. * Iceland: Iceland granted women the right to vote, with restrictions. * US: In 1915 the American Medical Association began to admit women as members.\"Women's History in America\" , Excerpted from Compton's Interactive Encyclopedia, 1995 * Wales: The first Women's Institute in Britain was founded in North Wales at Llanfairpwll. ; 1916 * Canada: Alberta, Manitoba and Saskatchewan granted women the right to vote. * US: Margaret Sanger opened America's first birth control clinic in 1916. * United Kingdom: The Cat and Mouse Act was introduced for suffragettes who refused to eat. ; 1917 * Cuba: Married women were granted separate economy. * Cuba: Legal majority was granted to married women. * Netherlands: Women were granted the right to stand for election. * Mexico: Legal majority for married women. * Mexico: Divorce was made legal. * US, New York: New York granted women the right to vote. * Belarus: Belarus granted women the right to vote. * Russia: The Russian SFSR granted women the right to vote. ; 1918 * Cuba: Divorce was made legal. * Russia: The first Constitution of the new Soviet State (the Russian Socialist Federative Soviet Republic) declared that \"women have equal rights to men.\" * Thailand: Universities opened to women. * United Kingdom: In 1918 Marie Stopes published Married Love. * US, Michigan, South Dakota, Oklahoma: Michigan, South Dakota, and Oklahoma granted women the right to vote. * Austria: Austria granted women the right to vote. * Canada: Canada granted women the right to vote on the federal level (the last province to enact women's suffrage was Quebec in 1940.) * United Kingdom: The Representation of the People Act was passed which allowed women over the age of 30 who had property to vote. This let only 40% of British women vote. * United Kingdom: The Parliament (Qualification of Women) Act 1918 was passed allowing women to stand as members of parliament. * Czechoslovakia: Czechoslovakia granted women the right to vote. ; 1919 * Germany: Germany granted women the right to vote. * Azerbaijan: Azerbaijan granted women the right to vote. * Italy: Women gained more property rights, including control over their own earnings, and access to some legal positions. * United Kingdom: The Sex Disqualification (Removal) Act 1919 became law. In a broad opening statement it specified that, \"[a] person shall not be disqualified by sex or marriage from the exercise of any public function, or from being appointed to or holding any civil or judicial office or post, or from entering or assuming or carrying on any civil profession or vocation\". * Luxembourg: Luxembourg granted women the right to vote. * Canada: Women were granted the right to be candidates in federal elections. * Netherlands: The Netherlands granted women the right to vote. The right to stand in election was granted in 1917. * New Zealand: New Zealand allowed women to stand for election into parliament. * United Kingdom: Nancy Astor became the first woman to take her seat in the House of Commons. ; 1920 * China: The first female students were accepted in Peking University, soon followed by universities all over China. * Haiti: Women could become pharmacists. * Korea: The profession of telephone operator, as well as several other professions, such as store clerks, were opened to women. * Sweden: Legal majority was granted to married women and equal marriage rights were granted to women. * US: The 19th Amendment was signed into law, granting all American women the right to vote. * United Kingdom: Oxford University opened its degrees to women. ; 1921 * United Kingdom: The Six Point Group was founded by Lady Rhondda to push for women's equality. ; 1922 * China: International Women's Day was celebrated in China from 1922 on. * United Kingdom: The Law of Property Act 1922 was passed, giving wives the right to inherit property equally with their husbands. * England: The Infanticide Act was passed, ending the death penalty for women who killed their children if the women's minds were found to be unbalanced. ; 1923 * Nicaragua: Elba Ochomogo became the first woman to obtain a university degree in Nicaragua. * United Kingdom: The Matrimonial Causes Act gave women the right to petition for divorce on the grounds of adultery. ; 1925 * United Kingdom: The Guardianship of Infants Act gave parents equal claims over their children. ; 1928 * United Kingdom: The right to vote was granted to all UK women equally with men in 1928. ; 1934 * Turkey: Women gained the right to vote and to become a nominee to be elected equally in 1934 after reformations for a new civil law. == References ==",
 "title": "First-wave feminism"
}