{
 "id": "870247",
 "text": "Muhammad Ilyas Attar Qadri (; born 12 July 1950) is a Pakistani Islamic scholar. He belongs to the Rizvi Qadri Sufi order. Qadri is a widely-respected sheikh with a significant global following which is supported by the Madani TV Channel. In 1981, the Sheikh founded Dawat-e-Islami, a Sunni Barelwi revivalist movement with hundreds of thousands of followers in Pakistan and over 180 other countries. It centres on the propagation of Islamic knowledge and manages two main activities: the Jamia-tul-Madina chain of religious schools, and the non-commercial Madani TV channel. ==Early Life and Education== Ilyas Qadri's Memon ancestors originated from the village of Kutyanah in Junagadh, Gujarat, India. His father dedicated many years to the Hanafi Memon Mosque in Pakistan, serving in various roles. Following Pakistan's formation, his parents immigrated to the country, initially settling in Hyderabad and later relocating to Karachi. Ilyas Qadri himself was born into a Memon family on July 12, 1950, in Karachi. Qadri pursued his studies for 22 years under the guidance of Grand Mufti of Pakistan, Muhammad Waqaruddin Qadri, at Darl Uloom Amjadia, Karachi. ==Career== Dawat-e-Islami Dawat-e-Islami has played a significant role in advancing Islamic education. It has established schools where both children and adults study and memorize the Quran, along with Jamia-tul-Madina, which provides instruction in the Dars-e-Nizami curriculum. Dawat-e-Islami encompasses various departments, including Islamic Jurisprudence, Madani Channel, Madrasa tul Madinah, Jamia- tul-Madina, Departments of Mosque Service, Madani Inamat, and Madani Qafila. He pulled millions of muslim into Biddats and shirk ===Sufism=== Qadri became a disciple of Ziauddin Madani, who himself was a student of Ahmad Raza Khan. Fadlur Rahman and Waqar-ud Din granted him authorization in Sufism. Shariful- Haq Amjadi bestowed upon him the authority to represent all four major Sufi orders: Qadriyyah, Chishtiyyah, Naqshbandiyyah, and Suhrawardiyya. Amjadi also granted him ijazah to transmit ahadith. == Others websites == * Dawat-e-Islami * Maulana Ilyas Qadri Category:People from Karachi Category:Muslim scholars Category:1950 births Category:Living people == References ==",
 "title": "Ilyas Qadri"
}