{
 "id": "870494",
 "text": "Dr. Hamis Kiggundu (born 1984), commonly known as Ham, is a Ugandan businessman, investor, real estate and property developer, philanthropist, and author. Kiggundu is the CEO of the Ham Group of Companies and the author of Success and Failure Based on Reason and Reality and Reason as the World Masterpiece. As of 2024, Kiggundu is among the richest Ugandans by net worth. == Family and religion == Kiggundu is the son of Haruna Segawa, who is part of a family with much property investments in Kampala. Kiggundu is a Muslim. == Early life and education == Kiggundu was born in 1984 in the Kalungu Masaka District in the Central area of Uganda. He attended his elementary education in Masaka, joined Kabojja International School in Kampala District for his high school education and later graduated from Makerere University with a degree in Laws. He joined the Law Development Center where he graduated with a diploma in legal practice. == Business journey == During his Middle School holidays in 2003, his parents gave reasonable capital to start a business and he started small and locally, trading in commodities and merchandise from firsthand importers abroad and selling them at a profit. With increased capital inflow, he progressed to a firsthand importer and started importing commodities from: China, Thailand, Hong Kong and Dubai. He could distribute them on wholesale both in Ugandans and neighboring countries like Kenya, Tanzania, Burundi, Congo and Sudan. Hamis accumulated more capital and upgraded to real estate, mainly buying and selling land and properties at a profit before he incorporated Ham Enterprises (U) Ltd and progressed to constructing and owning his commercial properties. Hamis has now diversified into large scale industrialization, mainly focusing on Agro processing and value addition. He has embarked on a US$156 million project in the central region where advanced Integrated Agro-Processing Industrial Plants (IAIP) are being setup at Akright City as a pioneer project, with a goal of providing value addition for resident and international consumption of Uganda's Agro produce. The project aim is to promote import substitution by adding value to local produce rather than importation of agro-processed products. Silos (Storage Units) of over 500,000 metric ton, have already been established as reported by Forbes. == Nakivubo Stadium rebuilding == === President's order === In 2015, President Museveni directed Kiggundu to re-construct and increase the capacity of Nakivubo Stadium into a modern state of the art sports facility with larger capacity. The Redevelopment works are a joint venture between the government of Uganda as the owner and Kiggundu as the developer through his company Ham Enterprises and ROKO Construction as the lead contractor. === Stadium breaking === In February 2017, Kiggundu smashed the timeworn structures and fenced off the entire stadium area to prepare for fresh construction works to commence. === Building start === In June 2017, construction works kick-started and the stadium took shape. The entire an estimated cost of US$139 million according to Forbes Africa. == Book writing == === Success and Failure Based on Reason and Reality === In June 2018 Kiggundu wrote Success and Failure Based on Reason and Reality which advises on financial success and the need to have a sense of purpose. The Book became a bestseller in Uganda and by December 2018. It was nominated and consequently won an award of Business Motivational Book of the year from The National Book Forum of Uganda. In June 2019 Hamis' book was reviewed, evaluated and eventually adopted by the Uganda Ministry of Education and Sports through the National Curriculum Development Center which put it on the Uganda school curriculum. === Reason As the World Masterpiece === In February 2021, Kiggundu wrote a second book and Reason as the World Masterpiece, a self-improvement book that focuses deeply on information about prosperity, self-development and advocates on the world human challenges, the solution to Africa's problems and Uganda's direct path from poverty to prosperity, with use of reason. == Charity == === Ham Foundation === In 2019 he started Ham Foundation, a charity organization to improve on the people's lives and their communities. ==== Clerics in the Greater Masaka Region ==== In March 2020, Kiggundu through his Ham Foundation donated over 200 bicycles, Qurans, and prayer mats to Muslim clerics in the Greater Masaka Region of Uganda. === COVID-19 === ==== Food relief ==== In April 2020 Kiggundu donated food relief to Uganda's COVID-19 task force. He also donated food supplies to over 100 Ugandan journalists through the Uganda Journalists Association but was also criticized for providing cash handouts to journalists. ==== Vaccination ==== In July 2021, Kiggundu donated to the Uganda Government 15,000 COVID-19 Vaccines doses doses for his employees and other Ugandans and additionally called upon Ugandan Corporate Entities to join him in saving lives as a way of giving back to the Ugandan Community where they operate. == Court case == === Suing Diamond Trust Bank === In March 2020, Kiggundu was featured prominently boldly and clearly in Ugandan media for his court battle against Diamond Trust Bank. He alleged that the bank defrauded him over $30 Million (UGX 34.29 billion and USD 23. 4million) over the course of 10 years. He dragged the bank to the high court of Uganda under what he called \"unclear debits\" from his bank accounts. === Victory and court order against Diamond Trust Bank === In October 2020, Kiggundu won the case and the Ugandan High Court ordered Diamond Trust Bank to refund all the unlawfully withdrawn monies totaling to UGX 34.29 billion and US$23.4 million with an additional 8% interest for legal costs. The court additionally ordered the bank to unconditionally release/discharge all mortgages allegedly created over all Kiggundu's properties and all corporate and personal guarantees issued by Kiggundu. The court also issued a permanent order to prevent DTB from enforcing the mortgages over Kiggundu's properties. === Diamond Trust Bank appeals === Diamond Trust Bank later appealed the decision in the High Court and were issued an order halting payment of the monies to Ham On June 13, 2023, the Supreme Court, led by Chief Justice Alphonse Owiny Dollo and other justices, also sent the case back to the High Court for a new trial, focusing on factual aspects after resolving legal issues in the appeal. Aggreived by the court decision, Kiggundu petitioned the Constitutional Court to nullify a Supreme Court ruling that ordered a retrial in his financial dispute with Diamond Trust Bank Uganda and Kenya, involving over 120 billion Shillings. Kiggundu argued the ruling was unconstitutional and ignored legal procedures, potentially harming Uganda's financial regulation.He sought to expunge the Supreme Court's proceedings and obtain a permanent injunction against the banks and the Attorney General. Arbitration In November 2023, This long-standing financial and legal dispute with Diamond Trust Bank was amicably resolved. Ham and Nasim Devji, the group CEO of Diamond Trust Bank reached a mutual agreement in a private meeting to drop all court cases. This decision was made to preserve their 11-year banking relationship and to foster future financial collaboration. == Hamz Brand == Hamz Brand is a key part of Kiggundu's business story. Started in 2021, Hamz quickly grew from a fashion brand to a symbol of innovation and cultural change in Uganda. === Starting with Fashion === Hamz started by selling fashionable and high-quality items like T-shirts, notebooks, caps, and more. These products became popular for their style and quality, reflecting the modern tastes and aspirations of Uganda's youth. === Moving Into Sports and Helping the Community === Kiggundu saw the potential of sports to bring people together and help the youth. He expanded Hamz into the sports world by renovating the old Nakivubo Stadium into the modern Hamz Stadium. This move helped revive a key community space. The Hamz Sports Club was also set up in Kigo, Wakiso District, focusing not just on sports but also on education and health, aiming to empower young people and improve the community. === Stepping Into the Digital World === With Hamz Ltd, the digital side of the brand, Kiggundu entered the technology field. This part of Hamz introduced new digital services like online payments and e-commerce, making it easier for Ugandans to connect and use technology. Hamz Ltd shows Kiggundu's vision for a digitally advanced Uganda. Hamz Subsidiaries and platforms include: Hamz App, Hamz Line, Hamz Wave, Hamz Chart, Ham Pay, Hamz Club, Hamz E Mall, Hamz Agro and Hamz Campus among others which are primarily accessible for download from his own Android apps store, Ham App Store and also on other android and iOS stores. === Impact on Society and Economy === Hamz is more than just a business. It has become a major part of Uganda's story of growth and self- sufficiency. The brand drives innovation and supports the idea of Ugandans helping themselves and growing sustainably. == Bank opening and agro- processing business == === Ham Agro Bank === Kiggundu is in the process of opening the Ham Agro Bank, a farmer’s Bank to accommodate for agrarian needs with Agro produce as the core instrument of trade, offering loans to farmers in form of Farming desires; for example: Machines, seeds, Services, pesticides among others. Farmers can then repay in form of Agro produce, according to Forbes. He also gave a hint on this plan while launching his book, Reason as the World Masterpiece in Kampala in March 2021 and also wrote about it in the book. ==== Ham Agro-Processing Industries ==== Kiggundu is now in the final stages of finishing the $156million a pilot project of the Ham Integrated Agro-Processing Industries in the Central region of Uganda which also be the Headquarters the entire project in Akright City, the Entebbe Express road- based industrial complex. === The US White House duplication === ==== The White House Uganda ==== Kiggundu made the administration block for his Agro processing industries an exact replica of the US White House which he named The White House Uganda in his bid to attract future tourists, both local and international to boost Uganda's tourism industry and pioneer national growth and prosperity == Ham Palm Villas == In a bid to transform Uganda and discourage nationals from leaving their motherland in search of a better life, he decides to create what we called Ugandans' desire right at home by setting up a 5 star gated community which he named Ham Palm Villas, with 500 homes, Villas and Apartments with all required amenities i.e. health and shopping facilities, international school, multi-sports complex, among others. building started in 2019 and is still on going. Kiggundu has a home located on the shores of Lake Victoria, popularly known as Ham’s Residence. The mansion was described as \"palatial\" by the Uganda Times. == Personal Life == === Residence === Hamis Kiggundu resides in Kampala, Uganda, in a luxurious estate valued at $32 million, spanning 479,160 square feet.Known as \"Ham’s Residence,\" this expansive property was constructed in 2014 and has been featured in interviews with Wodemaya and Miss Trudy, highlighting Kiggundu’s affluent lifestyle. == Awards == In 2023, Kiggundu was awarded in recognition and celebration of his exceptional contributions to rejuvenating Africa through entrepreneurship and iconic real estate development at the Pan African Pyramid Global Awards 6th Edition organised and held in Kampala by Pan-African Pyramid (PAP). In 2018 Kiggundu was given an award as an acknowledgement for his book, Success and Failure Based on Reason and Reality. It was nominated the best book of the year in the category of \"Business Motivation\" at an event held by the Book Forum of Uganda in Kampala. == References == Category:1984 births Category:Living people Category:African businesspeople Category:Ugandan people",
 "title": "Hamis Kiggundu"
}