{
 "id": "870536",
 "text": "Alfhild was a daughter of the Geatish king Synardus that lived in modern Sweden. Historians do not know if she was a real person or a legend. If she did live, it was probably between the 5th and 12th centuries. The earliest piece of writing that talks about her is the Gesta Danorum. When Alfhild was a young princess, the room she slept in was guarded by a lizard and a snake. These reptiles scared away suitors who were not brave. A Danish prince named Alf, who was also Geatish, came to Geatland and fought the animal guards and won. But Alfhild's mother told her to run away from Alf dressed as a man. She did, and she became a woman fighter called a shield maiden. She found a group of pirate ships that had lost their captain. She became the captain and made the other women part of the sailing crew. The crew doubled in number. She was so good at piracy that she hurt a large part of the Danish and Finnish shipping economy. She also sailed to Iceland once. Prince Alf then went to stop the fleet. At that time, he did not know that Alfhild was pirate leader. He found them off the coast of Finland. In the original story, Alfhild killed Alf, the latter underestimating the fleet's power, and then put his head on a spear and continued pirating. People know this from Norse hearsay in dining halls. In Christian story, she knocked off his helmet. This made her recognize him, and she stopped pirating and married Alf. She then became queen of Denmark. This version is probably wrong: It agreed with the things Christianity and patriarchy saw as good. == In popular culture == There are some differences in the story in later popular culture. Here Alfhild is almost always called Awilda. (Other spellings: Alwilda, Alvilda, Alvild, Alvilde, Alfhilda, Avilda, Alvida, Altilda, Ælfhild). During the 1800s, Alfhild/Awilda was a popular subject for scrimshaw carved by sailors on whaling ships. The story about Alf And Alfhild has also been made into Italian operas. In 1686, \"L'Amazzone Corsara, ovvero L'Alvilda, regina de Goti\", by Carlo Pallavicino. == References == Category:Pirates Category:Norwegian criminals Category:Danish culture Category:Norwegian culture",
 "title": "Alfhild (Alf and Alfhild)"
}