{
 "id": "870607",
 "text": "The Movement for the Restoration of the Ten Commandments of God was a new religious movement in Uganda. It was a doomsday cult which predicted that the world would end at the turn of the 21st century. In 2000, the Movement leadership mass-murdered almost 1000 of their followers by poisoning them or burning them to death. The Movement was founded in the 1980s by Credonia Mwerinde and Joseph Kibweteere, who claimed the Virgin Mary had appeared to them. Mwerinde was a former bartender and sex worker, and Kibweteere was an ex-government employee. The Movement's followers came to view Mwerinde as the incarnation of the Virgin Mary. Outsiders first noticed the group in 1988, because they were making children work in a school they operated. The school also had terrible hygiene. == Beliefs == The Movement split from the Roman Catholic Church. They wanted to restore the Ten Commandments. They said people can only be saved by strictly following these commandments. Their gospel was a text called A Timely Message from Heaven: The End of the Present Time. Each group member was expected to have read it at least six times. The group taught that every person who followed its teachings would be saved; everyone else would be punished. == Mass murder == According to the group, the world would end on 31st December 1999. However, when that did not happen, followers became suspicious. Many of them had previously transferred their possessions to the group; now they wanted them back. According to survivors, some people who asked for their possessions back mysteriously disappeared. Then, on 17 March 2000, Movement leaders murdered 530 followers at a religious service, in a church. The leaders of the cult had the doors nailed shut. Then they poured petrol on the wooden church and lit it on fire. === Death toll === During the following days, several bodies were discovered on the group's farms. In total, over 1,000 people died. Most had been poisoned, according to medical examiner reports. Early reports had suggested the victims were strangled because there were twisted banana fibers around their necks. After searching all of the Movement's properties, the police reported that the final death toll was 924. === Not a mass suicide === After interviews and an investigation, the police ruled out a cult suicide, and instead consider it to be a mass murder by the Movement leadership. They believe that the failure of the doomsday prophecy led to a revolt among the group's members. The leaders set a new date with a plan to kill their followers. Many factors suggest that this was not a mass suicide. Bodies were discovered at other sites; the church was nailed shut before it was set on fire; incendiaries were used to start the fire; and the sect's leaders may have escaped. According to witnesses, the Movement leadership had never spoken of mass suicide when preparing members for the end of the world. Additionally, one survivor recalled meeting a devout member of the cult with nails and a hammer on his way after he had left the cult. It is believed he is the one who shut the windows with nails to prevent anyone from escaping. === Response === The Ugandan government condemned the killings. President Yoweri Museveni called the event a \"mass murder by these priests for monetary gain\". Vice president Dr. Speciosa Wandira Kazibwe said, \"These were [...] well-orchestrated mass murders [carried out] by a network of diabolic, malevolent criminals masquerading as religious people.\" At the start, the five leaders were believed to have died in the fire. Police now believe that Joseph Kibweteere and Credonia Mwerinde may still be alive, and have issued an international warrant for their arrest. In 2014, the Uganda National Police announced that Kibweteere may have been hiding in Malawi. == References == Category:Cults",
 "title": "Movement for the Restoration of the Ten Commandments of God"
}