{
 "id": "870876",
 "text": "The history of the Catholic Church is the formation, events, and change of the Catholic Church through time. The Catholic Church began with Jesus Christ and his teachings. It is a continuation of the early Christian community established by the Disciples of Jesus. The Church believes its bishops to be the successors to Jesus's apostles and the Church's leader, the Bishop of Rome (also known as the Pope), to be the only successor to Saint Peter who ministered in Rome in the first century AD after his appointment by Jesus as head of the Church. Christianity spread throughout the early Roman Empire, with all persecutions due to conflicts with the pagan state religion. In 313, the persecutions were lessened by the Edict of Milan with the legalization of Christianity by the Emperor Constantine I. In 380, under Emperor Theodosius, Christianity became the state religion of the Roman Empire by the Edict of Thessalonica. The battles of Toulouse preserved the Christian west against the Umayyad Muslim army, even though Rome itself was destroyed in 850, and Constantinople attacked. In the 11th century, already difficult relations between the mostly Greek church in the East, and the Latin church in the West, developed into the East-West Schism, partially due to conflicts over the Pope's authority. Before and during the 16th century, the Church started a process of reform and renewal. Reform during the 16th century is known as the Counter-Reformation. In later centuries, Catholicism spread widely across the world even though it experienced a reduction of European believers due to the growth of Protestantism and also because of religious doubt and distrust during and after the Enlightenment. The Second Vatican Council in the 1960s introduced the most big changes to Catholic practices since the Council of Trent four centuries before. == Church beginnings == === Origins === === Early organization === According to Catholic tradition, the Catholic Church was founded by Jesus Christ. The New Testament narrates about Jesus' activities, teaching, his appointment of the twelve Apostles, and his instructions to them to continue his work. The Catholic Church teaches that Pentocost signaled the beginning of the public ministry of the Church. In this event, the Holy Spirit came upon the apostles. According to the Catholic Church, Christ desginated Peter as the \"rock\" upon which he would build his church. Catholics hold that Saint Peter was Rome's first bishop. He started the unbroken line which includes the current pontiff, Pope Leo XIV. That is, the Catholic Church maintains the apostolic succession of the Bishop of Rome, the Pope, who is the successor to Saint Peter. Conditions in the Roman Empire facilitated the spread of new ideas. The empire's network of roads and waterways allowed easier travel. Also, the Pax Romana made it safe to travel from one region to another. The government had encouraged inhabitants to learn Greek. Having a common language allowed ideas to be more easily expressed. Jesus's apostles gained converts in Jewish communities around the Mediterranean Sea. They established over 40 Christian communities by 100. Although most of these were in the Roman Empire, notable Christian communities were also established in Armenia, Iran and along the Indian Malabar Coast. The new religion was most successful in urban areas and it spread first among slaves and people of low social standing, and then among aristocratic women. At first, Christians continued to worship alongside Jewish believers. However, twenty years after Jesus's death, Sunday was being regarded as the primary day of worship. Christianity established itself as a separate religion when preachers such as Paul of Tarsus began converting Gentiles . To solve doctrinal differences, around year 50 the apostles gathered in the first Church council, the Council of Jerusalem. This council affirmed that Gentiles could become Christians without adopting all of the Mosaic Law. The early Christian Church was not very organized. This resulted in diverse interpretations of Christian beliefs. To have more consistency, by the end of the 2nd century Christian communities had developed a more structured hierarchy. The organization of the Church began to mimic that of the Empire. The churches in Antioch, Alexandria, and Rome were the most important. To solve problems about doctrine or policy, bishops often congregated in regional synods. This happened from the beginning of the 2nd century. By the 3rd century, the bishop of Rome began to be asked about problems that other bishops could not resolve. Influential theologians, named Church Fathers, refined the doctrine. From the year 100, some teachers such as Ignatius of Antioch and Irenaeus defined Catholic teaching. This was done by opposing them to opposed them to Gnosticism. Theological apologists consolidated teachings and traditions. Among them we can find Pope Clement I and Augustine of Hippo. === Persecutions === Christianity required its adherents to renounce all other gods. This was adopted from Judaism and was different from most religions in the Roman Empire. As Christians refuse to join pagan celebrations, they weren't able to take part in much of public life. This caused non-Christians to fear that Christians were angering the gods (this meant a threat to the peace and prosperity of the Empire). Due to its secrecy, Christians were accused of practising incest and cannibalism. In the 3rd century, Christians were persecuted by order of the emperors. They hold them responsible for the Empire's crises. All residents were ordered to give sacrifices or be punished. Jews were exempted as long as they paid the Jewish Tax. Estimates of the number of Christians who were executed ranges from a few hundred to 50,000. Many fled or renounced their beliefs. In spite of these persecutions, evangelization efforts persisted. This led to the Edict of Milan which legalized Christianity in 313. By 380, Christianity had become the state religion of the Roman Empire. == Late antiquity == When Constantine became emperor of the Western Roman Empire in 312, he attributed his victory to the Christian God. Many soldiers in his army were Christians, and his army was his base of power. With Licinius, (Eastern Roman emperor), he issued the Edict of Milan which mandated toleration of all religions in the empire. The edict had little effect on the attitudes of the people. New laws were issued to codify some Christian beliefs and practices. Constantine's biggest effect on Christianity was his patronage: * He gave land and money to the Church; * He offered tax exemptions to ecclesiastical property and personnel. These gifts and later ones combined made the Church the largest landowner in the West by the 6th century. In a reflection of their increased power in the Empire, clergy began to adopt the dress of the royal household. During Constantine's reign, more or less half of the Christians Christian did not subscribe to the official church. Constantine feared that disunity would displease God, so he eliminated some sects. To resolve other disputes, Constantine began the practice of calling ecumenical councils. These councils determined obligatory interpretations of Church doctrine. Decisions made at the Council of Nicea (325) about the divinity of Christ led to a schism. The new religion, Arianism flourished outside the Roman Empire. Partially to distinguish themselves from Arians, Catholic devotion to Mary became more important. This was the cause to further schisms. In 380, mainstream Christianity (as opposed to Arianism) became the official religion of the Roman Empire. Christianity became more associated with the Empire. This was the reason why Christians living outside of the empire were persecuted, becasuse their rulers feared they would revolt in favor of the Emperor. In 385, capital punishment was first used upon a Christian 'heretic', namely Priscillian. During this period, the Bible as we know it today was first officially arranged in Church Councils or Synods. This was done through the process of official 'canonization'. Prior to these Councils or Synods, the Bible had already reached a form that was nearly identical to its current one: * in 382 the Council of Rome first officially recognized the Biblical canon, listing the accepted books of the Old and New Testament, * in 391 the Vulgate Latin translation of the Bible was made. * Other accounts list the Council of Carthage of 397 as the Council that finalized the Biblical canon as it is known today. The Council of Ephesus in 431 declared that Jesus was both fully man and fully God. Two decades later, the Council of Chalcedon solidified Roman papal primacy. This added to continuing breakdown in relations between Rome and Constantinople, the seat of the Eastern Church. The Monophysite disagreements over the precise nature of the incarnation of Jesus led to the first of the various Oriental Orthodox Churches breaking away from the Catholic Church. == Middle Ages == === Early Middle Ages === After the fall of the Western Roman Empire in 476, trinitarian Christianity and Arian Christianity competed for the conversion of the barbarian tribes. The 496 conversion of Clovis I, pagan king of the Franks, saw the beginning of a steady rise of the faith in the West. In 530, Saint Benedict wrote his Rule of St Benedict as a practical guide for monastic community life. Its message spread to monasteries throughout Europe. Monasteries became major conduits of civilization. They preserved craft and artistic skills and maintained intellectual culture. They functioned as spiritual , agricultural, economic and production centers. During this period the Visigoths and Lombards moved away from Arianism for Catholicism. Pope Gregory the Great reformed the ecclesiastical structures and administration. Then, he launched renewed missionary efforts. Missionaries such as Augustine of Canterbury, who was sent to begin the conversion of the Anglo-Saxons, others took Christianity into northern Europe. They spread Catholicism among the Germanic, and Slavic peoples. The Synod of Whitby of 664 was decisive for the reintegration of the Celtic Church of the British Isles into the Roman hierarchy,. And in Italy, the 728 Donation of Sutri and the 756 Donation of Pepin left the papacy in charge a sizable kingdom. The Donation of Constantine further consolidated the papal position over the western part of the former Roman Empire. In the early 8th century, Byzantine iconoclasm became a major source of conflict between the Eastern and Western parts of the Church. Byzantine emperors prohibited the creation and veneration of religious images. They saw them as violations of the Ten Commandments. Pope Gregory III vehemently disagreed. A new Empress Irene siding with the pope, called for an Ecumenical Council. In 787, the fathers of the Second Council of Nicaea \"warmly received the papal delegates and his message\". At the conclusion, 300 bishops, who were led by the representatives of Pope Hadrian I \"adopted the Pope's teaching\", in favor of icons. The papacy acquired a new protector in the West with the coronation of Charlemagne by Pope Leo III in 800 and the handing over of the keys to the Tomb of Saint Peter. This freed the pontiffs from the power of the emperor in Constantinople. However, it also led to a schism, because the emperors and patriarchs of Constantinople interpreted themselves as the true descendants of the Roman Empire. Pope Nicholas I had refused to recognize Patriarch Photios I of Constantinople, who in turn had attacked the pope as a heretic. This was because he kept the filioque in the creed, which referred to the Holy Spirit emanating from God the Father and the Son. The papacy was strengthened through this new alliance, which in the long term created a new problem for the Popes. This was that, in the Investiture controversy, succeeding emperors sought to appoint bishops and even future popes. After the disintegration of the Carolingian Empire and repeated incursions of Islamic forces into Italy, the papacy, without any protection, entered a phase of major weakness. === High Middle Ages === The Cluniac reform of monasteries that began in 910 placed abbots under the direct control of the pope rather than the secular control of feudal lords. This eliminated a major source of corruption and sparked a great monastic renewal. Monasteries, convents and cathedrals still operated all schools and libraries. They also often functioned as credit establishments promoting economic growth. After 1100, some older cathedral schools were divided into: * lower grammar schools, and * higher schools for advanced learning. Many of these higher schools developed into universities. It was here where notable theologians worked to explain the connection between human experience and faith. The most notable of these theologians, Thomas Aquinas, produced Summa Theologica, which synthesized of Aristotelian thought and the Gospel. Monastic contributions to western society included: * the teaching of metallurgy, * the introduction of new crops, * the invention of musical notation, and * the creation and preservation of literature. During the 11th century, the East–West schism divided Christianity forever. It started with a dispute on whether Constantinople or Rome held jurisdiction over the church in Sicily. This led to mutual excommunications in 1054. The Western (Latin) branch of Christianity has since become known as the Catholic Church. The Eastern (Greek) branch became known as the Orthodox Church. The Second Council of Lyon (1274) and the Council of Florence (1439) both failed to heal the schism. Some Eastern churches have since reunited with the Catholic Church, and others claim never to have been out of communion with the pope. Officially, the two churches remain in schism, although excommunications were mutually lifted in 1965. The 11th century saw the Investiture controversy between Emperor and Pope over the right to make church appointments. This was the first major phase of the struggle between Church and state in medieval Europe. The Papacy were the initial victors. However, Italians divided between Guelphs and Ghibellines in factions that lasted until the end of the Middle Ages. The dispute gradually weakened the Papacy, not least by drawing it into politics. Pope Urban II started the First Crusade in 1095 when he received an appeal from Byzantine emperor Alexius I to help repel a Turkish invasion. Urban believed that a Crusade might help bring about reconciliation with Eastern Christianity. Encouraged by reports of Muslim atrocities against Christians, a series of military campaigns began in 1096. They were known as the Crusades. They were intended to return the Holy Land to Christian control. The goal was not permanently realized. Also, the Crusades left a legacy of mutual distrust between Muslims and Western and Eastern Christians. The sack of Constantinople during the Fourth Crusade left Eastern Christians resentful. In 2001, Pope John Paul II apologized to the Orthodox Christians for the sins of Catholics including the sacking of Constantinople in 1204. Two new orders of architecture emerged from the Church of this era. The earlier Romanesque style combined massive walls, rounded arches and ceilings of masonry. To compensate for the absence of large windows, interiors were painted with scenes from the Bible and the lives of the saints. Later, the Basilique Saint- Denis marked a new trend in cathedral building when it utilized Gothic architecture. In other developments, the 12th century saw the founding of eight new monastic orders. Many of them functioned as Military Knights of the Crusades. Cistercian monk Bernard of Clairvaux had great influence over the new orders and produced reforms to ensure purity of purpose. His influence led Pope Alexander III to begin reforms that would lead to the establishment of canon law. In the following century, new mendicant orders were founded by Francis of Assisi and Dominic de Guzmán which brought consecrated religious life into urban settings. Catharism grew in Languedoc in the 12th-century. The Inquisition originated during the period of struggle against this heresy. After the Cathars were accused of murdering a papal legate in 1208, Pope Innocent III declared the Albigensian Crusade. Abuses committed during the crusade caused Innocent III to informally institute the first papal inquisition to prevent future massacres and root out the remaining Cathars. Formalized under Gregory IX, this Medieval inquisition executed an average of three people per year for heresy at its height. Over time, other inquisitions were launched by the Church or secular rulers. Its main objectives were to prosecute heretics, to respond to the threat of Moorish invasion or for political purposes. The accused were encouraged to renounce their heresy and those who did not could be punished by penance, fines, imprisonment or execution by burning. A growing sense of church-state conflicts marked the 14th century. To escape instability in Rome, Clement V in 1309 became the first of seven popes to reside in the fortified city of Avignon in southern France. This period was known as the Avignon Papacy. The papacy returned to Rome in 1378 at the urging of Catherine of Siena and others who felt the See of Peter should be in the Roman church. With the death of Pope Gregory XI later that year, the papal election was disputed between supporters of Italian and French-backed candidates. This led to the Western Schism. For 38 years, separate claimants to the papal throne sat in Rome and Avignon. Efforts at resolution further complicated the issue when a third compromise pope was elected in 1409. The matter was finally resolved in 1417 at the Council of Constance. There, the cardinals asked all three claimants to the papal throne to resign, and held a new election naming Martin V pope. == Renaissance and reforms == === Discoveries and missionaries === In the late 15th and early 16th centuries, European missionaries and explorers spread Catholicism to the Americas, Asia, Africa and Oceania. Pope Alexander VI, in the papal bull Inter caetera, awarded colonial rights over most of the newly discovered lands to Spain and Portugal. Under the patronato system, state authorities controlled clerical appointments and no direct contact was allowed with the Vatican. In December 1511, the Dominican friar Antonio de Montesinos openly rebuked the Spanish authorities governing Hispaniola for their mistreatment of the American natives, telling them \"... you are in mortal sin ... for the cruelty and tyranny you use in dealing with these innocent people\". King Ferdinand enacted the Laws of Burgos and Valladolid in response. Enforcement was lax, and while some blame the Church for not doing enough while others point to the Church as the only voice raised on behalf of indigenous peoples. The issue resulted in a crisis of conscience in 16th-century Spain. In 1521, through the leadership and preaching of the Portuguese explorer Ferdinand Magellan, the first Catholics were baptized in what became the first Christian nation in Southeast Asia, the Philippines. The following year, Franciscan missionaries arrived in what is now Mexico, and sought to convert the Indians and to provide for their well-being by establishing schools and hospitals. They taught the Indians better farming methods, and easier ways of weaving and making pottery. Because some people questioned whether the Indians were truly human and deserved baptism, Pope Paul III in the papal bull Veritas Ipsa or Sublimis Deus (1537) confirmed that the Indians were deserving people. Afterward, the conversion effort gained momentum. Over the next 150 years, the missions expanded into southwestern North America. In India, Portuguese missionaries and the Spanish Jesuit Francis Xavier evangelized among non- Christians and a Christian community which claimed to have been established by Thomas the Apostle. === European Renaissance === In Europe, the Renaissance marked a period of renewed interest in ancient and classical learning. It also brought a re-examination of accepted beliefs. Cathedrals and churches had long served as picture books and art galleries for millions of the uneducated. The Church sponsored great Renaissance artists like Michelangelo and Leonardo da Vinci. Although Church leaders were able to promote Renaissance humanism, there were also conflicts between clerics and humanists. In 1509, a well known scholar of the age, Erasmus, wrote The Praise of Folly, a work which captured a widely held unease about corruption in the Church. The Papacy itself was questioned by conciliarism expressed in the councils of Constance and the Basel. Real reforms during these ecumenical councils and the Fifth Lateran Council were attempted several times but prevented. They were seen as necessary but did not succeed in large measure because of internal feuds, ongoing conflicts with the Ottoman Empire and Saracenes and the simony and nepotism practiced in the Renaissance Church of the 15th and early 16th centuries. As a result, rich, powerful and worldly men like Roderigo Borgia (Pope Alexander VI) were able to win election to the papacy. === Reformation era wars === The Fifth Lateran Council issued some but only minor reforms in March 1517. A few months later, on 31 October 1517, Martin Luther posted his Ninety-Five Theses in public, hoping to spark debate. His theses protested key points of Catholic doctrine as well as the sale of indulgences. Huldrych Zwingli, John Calvin, and others also criticized Catholic teachings. These challenges, supported by powerful political forces in the region, developed into the Protestant Reformation. During this era, many people emigrated from their homes to areas which tolerated or practiced their faith. In Germany, the Reformation led to war between the Protestant Schmalkaldic League and the Catholic Emperor Charles V. The first nine-year war ended in 1555 . However, continued tensions produced a far graver conflict, the Thirty Years' War, which broke out in 1618. In the Netherlands, the wars of the Counter- Reformation were the Dutch Revolt and the Eighty Years' War. In France, a series of conflicts termed the French Wars of Religion was fought from 1562 to 1598 between the Huguenots and the forces of the French Catholic League. A series of popes sided with and became financial supporters of the Catholic League. This ended under Pope Clement VIII, who hesitantly accepted King Henry IV's 1598 Edict of Nantes, which granted civil and religious toleration to Protestants. In 1565, several hundred Huguenot shipwreck survivors surrendered to the Spanish in Florida, believing they would be treated well. Although a Catholic minority in their party was spared, all of the rest were executed for heresy, with active clerical participation. === England === The English Reformation was based on Henry VIII's desire for annulment of his marriage with Catherine of Aragon. It was initially more of a political, and later a theological dispute. The Acts of Supremacy made the English monarch head of the English church thereby establishing the Church of England. Then, beginning in 1536, some 825 monasteries throughout England, Wales and Ireland were dissolved and Catholic churches were confiscated.When he died in 1547 all monasteries, friaries, convents of nuns and shrines were destroyed or dissolved. Mary I of England reunited the Church of England with Rome and persecuted Protestants during the Marian Persecutions. After some provocation, the following monarch, Elizabeth I enforced the Act of Supremacy. This prevented Catholics from becoming members of professions, holding public office, voting or educating their children. Executions of Catholics and dissenting Protestants under Elizabeth I, who reigned much longer, then surpassed the Marian persecutions and persisted under the following English monarchs. Elizabeth I also executed other Penal laws were also enacted in Ireland but were less effective than in England. In part because the Irish people associated Catholicism with nationhood and national identity, they resisted persistent English efforts to eliminate the Catholic Church. === Council of Trent === The Council of Trent (1545–1563) became the driving-force of the Counter-Reformation, and reaffirmed central Catholic doctrines such as transubstantiation, and the need for love and hope as well as faith to attain salvation. It also reformed many other areas of importance to the Church. It did so by improving the education of the clergy and consolidating the central jurisdiction of the Roman Curia. The criticisms of the Reformation were among factors that sparked new religious orders including the Jesuits, which became the great missionary order of later years. Spiritual renewal and reform were inspired by many new saints like Teresa of Avila, Francis de Sales and Philip Neri. Their writings spawned distinct schools of spirituality within the Church (Oratorians, Carmelites, Salesian), etc. Improvement to the education of the laity was another positive effect of the era. To popularize Counter- Reformation teachings, the Church encouraged the Baroque style. Baroque religious expression was stirring and emotional, created to stimulate religious fervor. Elsewhere, Jesuit missionary Francis Xavier introduced the Catholic Church in Japan. Church growth came to a halt in 1597 under the Shogun Toyotomi Hideyoshi who, in an effort to isolate the country from foreign influences, launched a severe persecution of Christians. Japanese were forbidden to leave the country and Europeans were forbidden to enter. Despite this, a minority Christian population survived into the 19th century when Japan opened more to outside influence, and they continue to the present day. == Baroque, Enlightenment and revolutions == === Marian devotions === The Council of Trent generated a revival of religious life and Marian devotions in the Catholic Church. During the Reformation, the Church had defended its Marian beliefs against Protestant views. Pope Paul V and Gregory XV ruled in 1617 and 1622 to be inadmissible to state, that the virgin was conceived non- immaculate. Supporting the belief that the virgin Mary, in the first instance of her conception was preserved free from all stain of original sin (aka Immaculate Conception) Alexander VII declared in 1661, that the soul of Mary was free from original sin. Pope Clement XI ordered the feast of the Immaculata for the whole Church in 1708. The feast of the Rosary was introduced in 1716, the feast of the Seven Sorrows in 1727. The Angelus prayer was strongly supported by Pope Benedict XIII in 1724 and by Pope Benedict XIV in 1742. Popular Marian piety was even more colourful and varied than ever before: Numerous Marian pilgrimages, Marian Salve devotions, new Marian litanies, Marian theatre plays, Marian hymns, Marian processions. Marian fraternities, today mostly defunct, had millions of members. === Enlightenment secularism === The Enlightenment constituted a new challenge of the Church. Unlike the Protestant Reformation, the enlightenment questioned Christianity as a whole. Generally, it elevated human reason above divine revelation. It also and down-graded religious authorities such as the papacy based on it. Toward the latter part of the 17th century, Pope Innocent XI saw increasing Turkish attacks against Europe as a threat for the Church. He built a Polish- Austrian coalition for the Turkish defeat at Vienna in 1683. Innocent X and Clement XI fought against Jansenism and Gallicanism. Both supported Conciliarism, and rejected papal primacy. This weakened the Church's ability to respond to gallicanist thinkers such as Denis Diderot, who challenged fundamental doctrines of the Church. In 1685 gallicanist King Louis XIV of France issued the Revocation of the Edict of Nantes, ending a century of religious toleration. France forced Catholic theologians to support conciliarism and deny Papal infallibility. The king threatened Pope Innocent XI with a general council and a military take-over of the Papal state. The absolute French State used Gallicanism to gain control of virtually all major Church appointments as well as many of the Church's properties. State authority over the Church became popular in other countries as well. In Belgium and Germany, Gallicanism appeared in the form of Febronianism. Emperor Joseph II of Austria (1780–1790) practiced Josephinism. He regulated Church life, appointments, and massive confiscation of Church properties. The 18th century is also the time of the Catholic Enlightenment, a multi-faceted reform movement. === French Revolution and the Church in France until 1940 === The anti-clericalism of the French Revolution promoted the nationalisation of church property and attempts to establish a state-run church. Large numbers of priests refused to take an oath of compliance to the National Assembly, leading to the Church being outlawed and replaced by a new religion of the worship of \"Reason\" but it never gained popularity. In this period, all monasteries were destroyed, 30,000 priests were exiled and hundreds more were killed. When Pope Pius VI sided against the revolution in the First Coalition, Napoleon Bonaparte invaded Italy. The 82-year-old pope was taken as a prisoner to France in February 1798 and soon died. To win popular support for his rule, Napoleon re-established the Catholic Church in France through the Concordat of 1801. The church lands were never returned, however the priests and other religious were given salaries by the government, which maintained church properties through tax revenues. Catholics were allowed to continue some of their schools. The end of the Napoleonic wars, signaled by the Congress of Vienna, brought Catholic revival and the return of the Papal States to the pope; the Jesuits were restored. France remained basically Catholic. The Revolution failed to destroy the Catholic Church, and Napoleon's concordat of 1801 restored its status. The return of the Bourbons in 1814 brought back many rich nobles and landowners who supported the Church. However, few new priests were trained in the 1790–1814 period, and many left the church. The result was that the number of parish clergy plunged from 60,000 in 1790 to 25,000 in 1815, many of them elderly. Entire regions, especially around Paris, were left with few priests. On the other hand, some traditional regions held fast to the faith, led by local nobles and historic families. The comeback was slow—very slow in the larger cities and industrial areas. With systematic missionary work and support from Napoleon III, there was a comeback. Conservative Catholics held control of the national government, 1820–1830. However, most often played secondary political roles or had to fight the assault from republicans, liberals, socialists and seculars. Throughout the lifetime of the Third Republic there were battles over the status of the Catholic Church. The French clergy and bishops were linked to the Monarchists. Republicans were based in the anticlerical middle class who saw the Church as a political threat to republicanism and progress. The Republicans detested the church for its political and class affiliations; for them, the church represented outmoded traditions, superstition and monarchism. The Republicans were strengthened by Protestant and Jewish support. Numerous laws were passed to weaken the Catholic Church. Napoleon's 1801 Concordat continued in operation but in 1881, the government cut off salaries to priests it disliked. The 1882 school laws of Republican Jules Ferry set up a national system of public schools that taught strict puritanical morality but no religion. For a while privately funded Catholic schools were tolerated. Civil marriage became compulsory, divorce was introduced and chaplains were removed from the army. When Leo XIII became pope in 1878 he tried to calm Church-State relations. In 1884 he told French bishops not to act in a hostile manner to the State. In 1892 he issued an encyclical advising French Catholics to rally to the Republic and defend the Church by participating in Republican politics. This attempt at improving the relationship failed. Deep-rooted suspicions remained on both sides and were inflamed by the Dreyfus Affair. Catholics were for the most part anti-dreyfusard. The Assumptionists published anti-Semitic and anti- republican articles in their journal La Croix. This infuriated Republican politicians, who were eager to take revenge. Often they worked in alliance with Masonic lodges. The Waldeck-Rousseau Ministry (1899–1902) and the Combes Ministry (1902–05) fought with the Vatican over the appointment of bishops. Chaplains were removed from naval and military hospitals (1903–04), and soldiers were ordered not to frequent Catholic clubs (1904). Combes as Prime Minister in 1902, was determined to thoroughly defeat Catholicism. He closed down all parochial schools in France. Then he had parliament reject authorisation of all religious orders. This meant that all fifty four orders were dissolved and about 20,000 members immediately left France, many for Spain.[190] In 1905 the 1801 Concordat was abrogated; Church and State were finally separated. All Church property was confiscated. Public worship was given over to associations of Catholic laymen who controlled access to churches. In practise, Masses and rituals continued. The Church was badly hurt and lost half its priests. In the long run, however, it gained autonomy—for the State no longer had a voice in choosing bishops and Gallicanism was dead. == Industrial age == === First Vatican Council === Before the council, in 1854 Pope Pius IX proclaimed the dogma of the Immaculate Conception. The majority of Catholic Bishops supported this decision. Eight years earlier, in 1846, the Pope declared the Immaculata the patron of the USA. During First Vatican Council, some 108 council fathers requested to add the words \"Immaculate Virgin\" to the Hail Mary. Some fathers asked to includethe dogma of the Immaculate Conception in the Creed of the Church. This was opposed by Pius IX. It was also strongly opposed by some council fathers, especially from Germany. Many French Catholics wished that the Council declared Papal infallibility and the assumption of Mary dogma. In 1870, the First Vatican Council affirmed the doctrine of papal infallibility. Controversy over this and other issues resulted in a very small breakaway movement called the Old Catholic Church. === Social teachings === The Industrial Revolution brought many concerns about the deteriorating conditions of urban workers. In 1891 Pope Leo XIII published the encyclical Rerum novarum. It was set in context Catholic social teaching: it rejected socialism but advocated the regulation of working conditions. Rerum novarum argued for the establishment of a living wage and the right of workers to form trade unions. Quadragesimo anno was issued by Pope Pius XI, on 15 May 1931, 40 years after Rerum novarum. Unlike Leo, who addressed mainly the condition of workers, Pius XI concentrated on the ethical implications of the social and economic order. He called for the reconstruction of the social order based on the principle of solidarity and subsidiarity. He noted major dangers for human freedom and dignity, arising from unrestrained capitalism and totalitarian communism. The social teachings of Pope Pius XII repeat these teachings. He applies them not only to workers and owners of capital, but also to other professions and all aspects of life. Going beyond Pius XI, he also defined social teachings in other areas such as medicine, psychology, sport, television, science, law and education. The dominant concern was the continued rights and dignity of the individual. With the beginning of the space age at the end of his pontificate, Pius XII explored the social implications of space exploration and satellites asking for a new sense of community and solidarity. === Mariology === Popes have always highlighted the link between the Virgin Mary as Mother of God and the full acceptance of Jesus Christ as Son of God. Since the 19th century, they were very important for the development of mariology to explain the veneration of Mary. Before the 19th century, Popes promulgated Marian veneration in different ways such as authorizing new Marian feast days, prayers, initiatives, the acceptance and support of Marian congregations. Since the 19th century, Popes begin to use encyclicals more frequently. Thus Leo XIII, the Rosary Pope issued eleven Marian encyclicals. Recent Popes promulgated the veneration of the Blessed Virgin with two dogmas: * Pius IX the Immaculate Conception in 1854 * the Assumption of Mary in 1950 by Pope Pius XII. Pius XII also promulgated the new feast Queenship of Mary celebrating Mary as Queen of Heaven and he introduced the first ever Marian year in 1954, a second one was proclaimed by John Paul II. Pius IX, Pius XI and Pius XII facilitated the veneration of Marian apparitions such as in Lourdes and Fátima. Later Popes such from John XXIII to Benedict XVI promoted the visit to Marian shrines (Benedict XVI in 2007 and 2008). The Second Vatican Council highlighted the importance of Marian veneration in Lumen gentium. During the Council, Paul VI proclaimed Mary to be the Mother of the Church. === Anti-clericalism === The 20th century saw the rise of various politically radical and anti-clerical governments. The 1926 Calles Law separating church and state in Mexico led to the Cristero War. In it, over 3,000 priests were exiled or assassinated, churches desecrated, services mocked, nuns raped and captured priests shot. In the Soviet Union following the 1917 Bolshevik Revolution, persecution of the Church and Catholics continued well into the 1930s. In addition to the execution and exiling of clerics, monks and laymen, the confiscation of religious implements and closure of churches was common. During the 1936–39 Spanish Civil War, the Catholic hierarchy supported Francisco Franco's rebel Nationalist forces against the Popular Front government. This was due to the Republican violence directed against the Church. === World War II === After the Second World War began in September 1939, the Church condemned the invasion of Poland and the following 1940 Nazi invasions. In the Holocaust, Pope Pius XII directed the Church hierarchy to help protect Jews and Gypsies from the Nazis. While Pius XII has been credited with helping to save hundreds of thousands of Jews, the Church has also been accused of antisemitism. Other commentators have accused Pius of not doing enough to stop Nazi atrocities. Debate over the validity of these criticisms continues to this day. == Post-Industrial age == === Second Vatican Council === The Catholic Church started a reformation process after the Second Vatican Council (1962–65). Intended as a continuation of Vatican I, under Pope John XXIII the council developed into an engine of modernisation. Its main task was double: * to make the historical teachings of the Church clear to a modern world, * to comment on topics like the nature of the church, the mission of the laity and religious freedom Other reforms decided at the Second Vatican Council were: * Revision of the liturgy, in which vernacular languages could be used. * Efforts to improve Christian unity became a priority. == Catholicism today == === Catholic-Orthodox dialogue === In June 2004, the Ecumenical Patriarch Bartholomew I's visited Rome. This happened on the Feast of Saints Peter and Paul (29 June). Its scope was another personal meeting with Pope John Paul II, for conversations with the Pontifical Council for Promoting Christian Unity. The Patriarch's partial participation in the Eucharistic liturgy followed the program of the past visits of Patriarch Dimitrios (1987) and Patriarch Bartholomew I himself: * full participation in the Liturgy of the Word, * joint proclamation by the Pope and by the Patriarch of the profession of faith according to the Nicene-Constantinopolitan Creed in Greek and as the conclusion, * the final Blessing imparted by both the Pope and the Patriarch at the Altar of the Confessio. The Patriarch did not fully participate in the Liturgy of the Eucharist involving the consecration and distribution of the Eucharist itself. In accordance with the Catholic Church's practice of including the Filioque clause when reciting the Creed in Latin, but not when reciting the Creed in Greek, Popes John Paul II and Benedict XVI have recited the Nicene Creed jointly with Patriarchs Demetrius I and Bartholomew I in Greek without the Filioque clause. The declaration of Ravenna in 2007 re-asserted these beliefs, and re-stated the notion that the bishop of Rome is indeed the protos, although future discussions are to be held on the concrete ecclesiological exercise of papal primacy. === Benedict XVI === With the election of Pope Benedict XVI in 2005, the Church largely saw a continuation of the policies of his predecessor, Pope John Paul II. However, there were some notable exceptions: Benedict decentralized beatifications and reverted the decision of his predecessor regarding papal elections. In 2007, he set a Church record by approving the beatification of 498 Spanish Martyrs. His first encyclical Deus caritas est discussed love and sex in continued opposition to several other views on sexuality. === Francis === Following the resignation of Benedict, Pope Francis was elected pope 2013. He was the first Jesuit pope, the first pope from the Americas, and the first from the Southern Hemisphere. During his papacy, he displayed a simpler and less formal approach to the office, choosing to reside in the Vatican guesthouse rather than the papal residence. === Leo XIV === Leo XIV is the current pope. He was elected on 8 May 2025 after Francis died. Category:Catholicism Category:History of Christianity",
 "title": "History of the Catholic Church"
}