{
 "id": "870879",
 "text": "A glass ceiling is an idea that people use to talk about why some people do not get promotions in companies, schools, and other groups. A company has a glass ceiling if it looks as if women and minorities could become leaders but they never really do. That is called a glass ceiling because a new employee starting at the bottom (the \"ground floor\"), can see all the way up to the top of the building (leadership), but really there is a barrier in the way.Federal Glass Ceiling Commission. Solid Investments: Making Full Use of the Nation's Human Capital. Washington, D.C.: U.S. Department of Labor, November 1995, p. 13-15. The metaphor was first made by feminists to talk about why it is harder for high-achieving women to get promotions than men.Federal Glass Ceiling Commission. Good for Business: Making Full Use of the Nation's Human Capital. Washington, D.C.: U.S. Department of Labor, March 1995. In the US, the concept is sometimes used to refer to minorities based not on gender. Women of color in countries whose population is mostly white people often find the most difficulty in \"breaking the glass ceiling\" because they are both women and people of color, two types of people who were not liked in the past.\"Demarginalising the Intersection of Race and Sex: A Black Feminist Critique of Anti-discrimination Doctrine, Feminist Theory, and Anti-racist Politics\" by Kimberlé Crenshaw in Framing Intersectionality, edited by Helma Lutz et al. (Ashgate, 2011). East Asian and East Asian American news outlets have made a used a metaphor taken from the original, the term \"bamboo ceiling\". It tries to show white people not liking East Asians, as bamboo is from Asia. Within the same ideas of the other terms surrounding the workplace, there are similar terms about extra rules about women and their roles within organisations and how they manage their jobs as mothers. These \"Invisible Barriers\" work as metaphors to describe the many extra things stopping women, usually when trying to become better in their career and usually while also trying to make their other parts of life better. \"A glass ceiling\" represents something stopping women from getting high ranks in a company where people have different amounts of power, usually shown on a pyramid diagram. Those women are not allowed to get promotion, especially to the very high rankings, inside their jobs. Since 2001, the women working who do not work in the health and educational sector have not been seen in the high ranks a lot. ==References== Category:Feminism",
 "title": "Glass ceiling"
}