{
 "id": "870948",
 "text": "In Twelverism, Nikah mut'ah is a form of marriage. It is also called Sigheh. Unlike Nikāḥ, which is the other form of marriage in Islamic law, a Nikah mut'ah marriage does not last for the two people's whole lives. It lasts only limited time. Nikah mutah is about sexual pleasure. Followers of Twelver Shia Islam believe that Nikah mut'ah is legal, but most other Muslims disagree on this belief. == Conditions == Some things must be true for a Nikah mut'ah: *The bride must not be married to anyone else at the time *If she has never been married, her legal guardian must agree *She must be a Muslim, or among the People of the Book (which means Christians, Jews, and Muslims, mostly) *After the contract ends, she must not have sex with anyone for some time. This is usually three months. This is so people will know that the father of any children she has if she becomes pregnant was her husband. Nikah mut'ah is different from the other form of marriage in other ways too: *The husband is not required to provide alimony or shelter for his wife *There's no way to settle an inheritance in favor of the partner if one of the two dies Nikah mut'ah does not have to be publicly announced. Islam says that Muslim men may have only four and no more, but this only applies to Nikah-marriages. According to Ayatollah Ali al-Sistani, the Nikah mut'ah is the only way a Muslim can marry a person of the Book who is not Muslim. He says Nikah is not possible with non-Muslims. Other Ayatollahs say that Muslims can marry non- Muslim people of the book. == Criticism == Nikah mut'ah has been used to cover child prostitution. Some Western writers have argued that mut'ah is similar to prostitution.In Iraq, religious ‘pleasure marriages’ are a front for child prostitution The Guardian, 2019 Julie Parshall writes that mut'ah is legalised prostitution allowed by the Twelver Shia authorities. She quotes the Oxford encyclopedia of modern Islamic world to make a difference between marriage (nikah) and mut'ah. She also says that while nikah is for having children, mut'ah is just for sexual gratification. ==References== Category:Islamic law Category:Marriage",
 "title": "Nikah mut'ah"
}