{
 "id": "870968",
 "text": "Nouman Ali Khan is an American Muslim speaker and author of Pakistani descent. He is founder and CEO of The Bayyinah Institute for Arabic and Quranic Studies and Chief Adviser. The fifth edition of The Five Hundred Most Influential Muslims, a biographical dictionary of Islamic personalities, lists Khan as one of the most influential Muslims in the world without any ranking. ==Early life== Khan was born 4 May 1978, in Germany to a Pakistani family and spent his preschool years in the former East Berlin. His father then worked for the Pakistan Embassy in Riyadh, Saudi Arabia, where Khan attended the Pakistan Embassy school from grades 2 to 8. His father moved the family to New York when Khan was in his teens.http://www.arabnews.com/news/445647 Sameen Tahir Khan, \"Nouman Khan: The one-man Qur’an movement\", Arab News, 22 March 2013. ==Career== His serious training in Arabic began in the United States in 1999 under Dr. Abdus-Samie, founder and formal principal of Quran College, Faisaland, Paskistan. Under Dr. Abdus-Samie, Nouman developed a keen methodical understanding of Arabic grammar. He further benefited from Dr. Abdus-Samie by internalizing his unique teaching methods and later translating his work into English for the benefit of his own students. Then Nouman served as a professor below a assistant professor at Nassau Community College and has taught Modern Standard and Classical Arabic at various venues. After serving as an instructor (a college teacher ranking below assistant professor) in Nassau Community College he founded Bayyinah Institute. After founding Bayyinah Institute he became the author of Divine Speech: Exploring Quran As Literature and Revive Your Heart: Putting Life in Perspective == Publications == Publications By Nouman Ali Khan Title Description Date Language Divine Speech: Exploring Quran As Literature Bayyinah Publishing in 2016 2016 English Revive Your Heart: Putting Life in Perspective Kube Publishing 2017 English Bondhon Guardian Publication; 1st edition ASIN: B07KV37PVR 2010 Bengali Arabic With Husna Multiple Volumes 2016 English Dirilt Kalbini Timaş Yayınları (2017) 2017 Turkish Revive Your Heart (2018 Edition) Published by Manzania 2018 Malay Revive Your Heart Guardian Publication 2019 Bengali Revive Your Heart Bayyinah publishing 2020 2020 Croatian == References == == Other websites == * Category:Living people Category:American Muslims Category:1978 births",
 "title": "Nouman Ali Khan"
}