{
 "id": "871014",
 "text": "Gender bias is a set of words used in social science that causes a bias, or slant, in scientific studies towards one gender. Studies with gender bias do not represent the true gender balance.Sabine Girod, Magali Fassiotto et al.: Reducing Implicit Gender Leadership Bias in Academic Medicine With an Educational Intervention. In: Academic Medicine. Vol.91, issue 8, August 2016, pp. 1143–1150 Gender bias has many causes: * Using gender stereotypes, rather than checking the true role: Tools that are used by doctors to identify some mental illnesses (such as clinical depression or ADHD) often use stereotyped gender roles. For example, in girls, being hyperactive is often seen as good thing. Many people think that girls are supposed to talk and smile often. In boys, being hyperactive is seen as a weakness. Another example is that in many societies in which men are in charge, men are often seen as normal, and no one questions or thinks much about that. An androcentric view happens, which is biased towards men. * Failure to take gender-specific factors into account. For example, when scientists study clinical depression again, they sometimes think that clinical depression is naturally much more common in women than in men. However, women tend to ask for professional help with depression earlier than men, who are more likely to hide their problems since they are taught not to ask for help. Depression might therefore not be more much common in women, despite what it seems. There may be a similar gender bias with ADHD. Men and women are fundamentally different, which is not taken into account. In the case of ADHD, doctors therfore see men as having a problem sooner than for women. That also affects the gender pay gapClaudia Finke: Verdienstunterschiede zwischen Männern und Frauen: Eine Ursachenanalyse auf Grundlage der Verdienststrukturerhebung 2006. Statistisches Bundesamt, Wiesbaden Januar 2011, pp- 36–48, this reference on p. 45 (PDF: 1,9 MB, 161 pages on destatis.de). of women being paid less than men. * Gender-specific language: Many languages use the male form for both sexes. Raders sometimes think the writer is talking about everyone when the writer really is talking about only men and boys. However, saying that someone \"has a full-time job\" may introduce a bias. In most cultures in the world, there are \"traditional role models,\" and women rarely have full-time jobs, especially when they also look after their children. * Overgeneralizations: Generalizion may occur from one gender to all. Many drugs are tested only on men, not women, when they are approved for use in patients. Such drugs may not work the same way on women. For example, some drugs may be dangerous for women and they they need to be tested on women as well. ==References== Category:Gender Category:Discrimination",
 "title": "Gender bias in science"
}