{
 "id": "871074",
 "text": "LIV Swiss Watches is a watch company in Miami, United States. LIV Swiss Watches' headquarters are in Miami, but most of its watches are made by hand and put together in Switzerland. It is the Swiss watch brand with the most crowdfunding support. The watches are available worldwide. Magazines and newspapers in Switzerland, Germany, France, Japan, and other countries have written about them. ==History== Esti Chazanow started LIV Swiss Watches in Miami, Florida in 2012. She wanted to build good Swiss watches that were not expensive but could also last, and so went on Kickstarter to get crowdfunding for her idea. Chazanow wanted to make LIV Swiss Watches more personalized too, instead of mass producing it. Some other crowdfunded watch brands are Sequent SuperCharger and Laventure Marine. LIV Swiss Watches has also supported and worked with Taylor Eisenhart since 2019. In 2018, LIV Watches gave the winners of the F1600 Championship Series with custom GX1-A Swiss watches. ==Watches== The first LIV watch model, the GX1 Swiss Quartz Chronograph, came out in 2014.LIV Swiss Watches history The second model, the GX1-A Swiss Automatic, was funded with $1,119,029 by over 2,169 people within 12 hours. Another model launched in 2016 is the GX Base. Later in 2017, the next LIV model, called Rebel, was also funded within 12 hours, receiving more than $1.7 million from over 2,900 people. The GX1-A was also launched in 2017. It has a luminescent (light-making) feature called Super-LumiNova. In 2018, the Titanium Ceramic Chrono watch was launched and funded. Other models include the GX1 Panda (for sportswear), GMT Cobalt, GX-AC, GX1, and many others. There are also many limited edition watches and collections. Some of them are specialized watches for divers, pilots, and other watches for specific uses and groups of people. ==References== ==Other websites== *LIV Swiss Watches *Press Category:21st- century establishments in the United States Category:Companies based in Florida Category:Miami",
 "title": "LIV Swiss Watches"
}