{
 "id": "871272",
 "text": "The executive power of the government of Afghanistan is headed by prime minister Hasan Akhund. His time in power started in 2021. ==Events== Women can not be a part of the Cabinet, the Taliban said in early September 2021. Russia said that it will not take part \"in the inauguration event for the new government of Afghanistan if it is held on the 9/11 anniversary\", media said on September 10, 2021; After Russia said that, the event was moved to another day.https://www.news18.com/news/india/taliban-cancel-911-govt-inaugural- ceremony-after-pressure-from-doha-4189874.html. CNN-News18. Retrieved 10 September 2021. \"[...] Russia told the Doha peace negotiation team that it will not participate in the inauguration event if it is held on the 9/11 anniversary\" There are worries about the Freedom of the press: \"at least 14 journalists\" were arrested \"and then released\" (or set free) over a two-day period; Committee to Protect Journalists (CPJ) said that, and media told about that on September 10, 2021. As of September 21, the Cabinet has \"members of ethnic minorities, such as the Hazaras\", said Zabihullah Mujahid; the Cabinet has vice ministers; the Cabinet still has no women.https://www.news18.com/news/world/taliban-name-deputy-ministers-double- down-on-all-male-team-4228019.html. Retrieved 21 September 2021 [The government, or] Taliban said in 2021 that \"they will ask members of the police force to come back to work to maintain Kabul security along with Taliban forces\", said CNN-News18.https://www.news18.com/news/world/afghanistan-live- updates-al-qaeda-regrouping-in-taliban-controlled-afghanistan-indian-origin- bizman-abducted-in-vehicle-used-by-insurgents-4208153.html. Retrieved 16 September 2021. \"In a recent move, the Taliban said they will call back the former government police to maintain Kabul security along with Taliban forces.\" The members of the police force had stopped coming to work, after Taliban took control of Kabul in August. Two noted groups within the Taliban and the government, are \"the Haqqani and those who support [...] Abdul Ghani Baradar\", media has said. ===Bomb attacks=== On October 3, a bomb attack at a mosque in Kabul killed [at least] 5 people; When people were leaving a prayer ceremony for the mother of deputy minister Zabiullah Mujahid, the bomb exploded. Over 100 people were killed in a suicide bombing in a mosque in Kunduz. ==Relationships with other countries== The government has relationships with other countries. In September, the foreign minister of Quatar visited Afghanistan, for talks with the prime minister.https://www.reuters.com/world/middle-east/qatari-foreign-minister- visits-kabul-al-jazeera-says-2021-09-12/. Retrieved 16 September 2021 The United Nations has a political mission in Afghanistan; the political mission is scheduled to stay at least six months more, \"with a focus on development issues\", media said in September.https://www.bangkokpost.com/world/2183947/taliban-bars-girls-from- high-school. Retrieved 14 September 2021 [As of 2024,] the Taliban government does not have formal recognition by any country.https://www.nrk.no/urix/kjempeskuffet-over-talibans-brutte-lofter- etter-norgesbesoket-1.15979383. NRK.no. Retrieved 2 June 2022Scott R. Anderson. https://www.lawfareblog.com/history-and-recognition-taliban . Lawfareblog.com. Retrieved 31 August 2021 China has diplomatic contact with the Taliban government.https://www.news18.com/news/world/chinese-delegation- conducts-recce-at-afghanistans-bagram-airbase-india-concerned-4224605.html. Retrieved 20 September 2021 ==Ministers (or members of the Cabinet)== Ministers of the Islamic Emirate are: Position Name Prime minister Akhund, Hasan Time in power: since September 2021; acting or interim. When he came to power, the Taliban were already in military control of most of the country; Hibatullah Akhundzada became head of Taliban in 2016; Taliban said in October 2021 that he died in 2020.https://www.news18.com/news/world/exclusive-taliban- confirm-chief-hibatullah-akhundzada-died-in-suicide-attack-by-pak-forces-last- year-4326965.html. Retrieved 16 October 2021 Interior minister Haqqani, Sirajuddin In September 2021, he became head of Ministry of Interior Affairs Foreign minister Muttaqi, Amir Khan center|120px--> From September 2021; acting or interim. Finance minister Hidayatullah Badri Since September 2021 Economy minister Din Mohammad Hanif Since September 2021 Defense minister Mohammad Yaqoob Since September 2021 Justice minister Abdul Hakim Ishaqzai Since September 2021 Public health minister Qalandar Ibad Since 2021 Trade or commerce minister Nooruddin Azizi Since 2021. His ethnicity is Tajik.https://www.news18.com/news/world/talibans-afghan-govt-still-non- inclusive-despite-recent-expansion-no-woman-yet-4242071.html. Retrieved 24 September 2021 Information minister Khairullah Khairkhwa Since September 2021 Education minister Noorullah Munir Acting or interim, since August 2021 Higher education minister Abdul Baqi Haqqani Acting or interim, since August 2021 Hajj or pilgrimage minister Noor Mohammad Saqib Since September 2021 Border and tribal affairs minister Norullah Noori Since September 2021 Rural rehabilitation and development minister Mohammad Younus Akhundzada Since September 2021 Public works minister Abdul Manan Omari Since September 2021 Mines and petroleum Minister Shahabuddin Delawar Since November 2021 Water and energy minister Abdul Latif Mansoor Since September 2021 Aviation and transport minister Hamidullah Akhundzada Since September 2021 Telecommunication minister Najibullah Haqqani Since September 2021 Refugees minister Khalil Haqqani Since September 2021 Religious observances minister (or minister for the propagation of virtue and the prevention of vice) Sheikh Mohammad Khalid Since September 2021 ===Deputy ministers and directors === Position Name Deputy prime minister Baradar, Abdul Ghani From September 7, 2021; acting or interim. He \"has [...] gone missing\", said journalist Emma Graham-Harrison on September 14.https://www.theguardian.com/world/2021/sep/14/questions-in-kabul-as-two- top-taliban-leaders-missing-from-public-view. Retrieved 14 September 2021 [Second] deputy prime minister Hanafi, Abdul Salam From September 7, 2021; acting or interim. Chief of intelligence Wasiq, Abdul Haq From 2021; acting or interim. Deputy minister of defense \"Zakir\", Abdul Qayyum From September 2021; acting or interim Deputy minister of information and culture Mujahid, Zabiullah From September 2021; acting or interim \\--> As of [the third quarter of] 2021, the Taliban government does not have \"formal recognition by the majority of [countries in the world, or] the international community\". Women can not be a part of the Cabinet, the Taliban said in early September. ===Former ministers=== Ministers of the Islamic Emirate who have quit or who changed job in the Cabinet of Afghanistan, are: Position Name Finance minister Gul Agha Ishakzai From August [to September] 2021 Defense minister Abdul Qayyum \"Zakir\" From August [to September] 2021; acting or interim Education minister Hemat Akhundzada From August [to September] 2021 Interior minister Ibrahim Sadr From August [to September] 2021https://direkte.vg.no/nyhetsdognet/news/taliban-har-utnevnt- ministre.RSRzbA3RF?utm_source=vgfront&utm;_content=direktewidget&utm;_medium=direktewidget_nyhetsdognet. Retrieved 24 August 2021 Public health minister Wahid Majrooh Time in power ended September 2021; Earlier in September 2021, he was the only minister from the government of prime minister Ghani, that still showed up at work in Kabul.https://www.dagsavisen.no/nyheter/verden/2021/09/12/helseminister-i- afghanistan-ber-norge-opprettholde-bistanden/. Dagsavisen. Retrieved 12 September 2021. \"Han er den eneste statsråden fra Ashraf Ghanis avsatte regjering som fortsatt møter på jobb i Kabul\" [He is the only minister from the Ashraf Ghani Cabinet, that still shows up at work in Kabul] He became acting (or interim) minister in January 2021.https://moph.gov.af/index.php/en/ministers-biography. Retrieved 12 September 2021. \"On 28 January 2021, [... President Ghani], in addition to Dr. Majrooh’s current responsibilities, as Deputy Minister for Health Care Services Provision, designated him as the Acting Minister of Public Health.\" Chief of intelligence [was from August 2021] Najibullah; Pajhwok Afghan News said that, and other media told about that on 24 August. ==Related pages== *Cabinet *Cabinet of Afghanistan ==References== ==Further reading== *More Cracks in Taliban as Int'l Face Stanikzai Upset with Afghan Regime, Pak Meddling (October 18, 2021) CNN-News18 Category:Politics of Afghanistan",
 "title": "Cabinet of prime minister Akhund"
}