{
 "id": "871347",
 "text": "Fireflies is a 2018 Indian Meitei language documentary short movie. It was directed by Johnson Rajkumar. It is about the struggles of the Meira Paibis to protect the people from crimes in Manipur state. It also shows the role of women in the male-dominated society of Manipur. It looks at how the gender gap and gender identities are settled during times of conflict and violence in the society. The movie shows women reacting to the increasing numbers of men disappearing. This took place after the Armed Forces Special Powers Act (AFSPA) was applied to Manipur state. The important point of the movie is that women stand up for the safety, security and better survival of the men. == Plot == In 1980s, when Manipur was exposed to revolutionaries and armed violence, a group of women came out to the streets to uphold peace in the state. They were called the Meira Paibis. They were freely independent women's organisations. They went on patrols during the night. They held flaming torches. They tried to bring balance in the society. == Background == In India, women are mostly seen to be confined in their homes. The women of Manipur contributed a lot towards the welfare of the social conditions. This really inspired Johnson Rajkumar, the maker of the \"Fireflies\". He tried to show the influence of gender roles in conflicts and violence. If men were doing this, they would have been called rebels. According to Johnson, the movie shows that women's collective has more to do beyond pro-feminists. Rajkumar went to Bangalore for higher education. There, he realised that the issues from Manipur and the North East India were not truly represented or interpreted in the national media. He created the \"Fireflies\" to fight the set false stories. He wanted to show the true facts. == Production == The movie is financially supported by the \"Samaj Pragati Sahayog\", a social media platform based in Madhya Pradesh, India. It is also supported by the Film Division of India. Rajkumar is the director of the movie and a Manipuri media activist. He lives in Bangalore, Karnataka. He has been making documentary movies on social and political issues. He focuses on social movements and protests. == Recognition == The movie won many awards in international film festivals. These were held in different countries of the world. === Awards === Awards Category Results Arthouse Asia International Film Festival, Kolkata (2018) Best Short Documentary Chennai International Short Film Festival, Chennai (2018) 2nd place in Best Short Documentary === Official selection === Film Festivals Venues Year 3rd Golden Tree International Documentary Film Festival Frankfurt, Germany 2018 Balkan Can Kino Athens, Greece 2018 Frames Film Festival Mumbai, India 2018 National Documentary and Short Film Festival Thrissur, Kerala 2018 Art and Imphal Festival Imphal, Manipur 2018 International Film Festival \"Cinema and You\" Mariupol, Ukraine - Kathmandu International Mountain Film Festival Kathmandu, Nepal 2019 Dada Saheb Phalke International Film Festival Mumbai, India - Davis Feminist Film Festival California - Culture Diversity and Peace Short Film Festival Dhaka, Bangladesh 2019 Human Rights Short Film Festival Dhaka, Bangladesh - == References == == Other websites == * Manipuri documentary film selected in Athens, Greece Category:2018 movies Category:Movies set in India Category:Meitei culture",
 "title": "Fireflies (movie)"
}