{
 "id": "871394",
 "text": "Roberta de Souza Rodrigues (born October 20, 1982) is a Brazilian actress and singer. She began her career in 2002 in the movie City of God and gained prominence in some telenovelas such as Mulheres Apaixonadas in 2003, Salve Jorge in 2012 and A Regra do Jogo in 2015, Roberta dated Thiago Martins. Rodrigues was born in Rio de Janeiro. == Filmography == Films & TV Year Title Role Notes 2002 City of God Berenice Movie City of Men Sheila Pereira (Poderosa) Episode: \"O Cunhado do Cara\" 2003 Mulheres Apaixonadas Zilda Garrincha - Estrela Solitária Nair Movie 2004 Cabloca Julieta O Diabo a Quatro Natasha Movie 2005 A Lua Me Disse Zenóbia Tecendo o Saber Valdete Pereira 2006 Filhos do Carnaval Rosana Páginas da Vida Paula Sob Nova Direção Dadá Episode: \"Grávidas Anônimas\" Mulheres do Brasil Telma Movie Desejo Silvana Short Noel - Poeta da Vila Lola Movie 2007 Paraíso Tropical Eloísa Dicas de Um Sedutor Lurdinha Episode: \"Não É O Que Parece\" 2008 Casos & Acasos Júlia Episode: A Escolha, A Operação e a Outra\" Faça a Sua História Eleuza Episode: \"Quem Não Tem Um Caso Para Contar?\" Se Nada Mais Der Certo Isabel Movie 2010 5x Favela - Agora por Nós Mesmos Renata Movie As Cariocas Suellen Episode: \"A Iludida de Copacabana\" 2010–2011 Os Caras de Pau Various Season 1-2 2011 Insensato Coração Fabíola dos Santos Desenrola Bruna Movie Vamos Fazer Um Brinde? Movie Dança dos Famosos Herself 2012 As Brasileiras Dirce Episode: \"A De Menor no Amazonas\" Louco Por Elas Clara Episode: \"Ex-namoradas de Léo se reunem\" Salve Jorge Maria Vanúbia da Conceição Cidade de Deus - 10 Anos Depois Herself Documental 2013–2014 Divertics Various 2014 A Grande Família Manu Season 14 Super Chef Celebridades Herself Contestant 2015 As Canalhas Sônia Episode: \"Sônia\" A Regra do Jogo Ninfa Sorria, Você Está Sendo Filmado Neide Movie 2016 Nise - O Coração da Loucura Dona Ivone Lara Movie Apaixonados - O Filme Soraia Movie 2017 Vai Que Cola Sandra Episode: \"02\" Tô de Graça Sara Jane dos Santos 2018 Cidade dos Homens Sheila Pereira (Poderosa) Segundo Sol Doralice Falcão do Nascimento 2020 Sob Pressão Marisa 2021 Dois Mais Dois Bettina Movie L.O.C.A. Rebecca Movie Nos Tempos do Imperador Lupita / Isaura == References == == Other websites == * * Roberta Rodrigues on AdoroCinema Brasileiro. Category:1982 births Category:Living people Category:Actors from Rio de Janeiro Category:Singers from Rio de Janeiro",
 "title": "Roberta Rodrigues"
}