{
 "id": "87144",
 "text": "Skype ( /skaɪp/) was a software program that used the Internet to make telephone calls. It did this by using a technology called Voice over Internet Protocol (VoIP). Using VoIP to call another phone is very cheap. It did not cost money to call another Skype user. Skype was created in 2003 by the Swedish Niklas Zennström and the Danish Janus Friis. From 2005 to 2011, Skype was owned by eBay. After eBay stopped owning it later in 2011, Skype was owned by Skype Technologies S.A.R.L. S.A.R.L. was a company in Luxembourg that became a part of Microsoft. S.A.R.L. stopped owning Skype when Skype was shut down by Microsoft. The Skype program worked on computers with Microsoft Windows, macOS and Linux. It was available as a mobile app for different platforms, including iOS and Android. Each Skype user had a unique--or one-of- a-kind--name that other users could find in order to talk to the person they wanted to talk to. Skype also had additional features such as video calls and was able to have multiple members in a conversation. When chatting, you could use various emojis. Microsoft announced that they were shutting Skype down on May 5, 2025 in favour of the free version of Microsoft Teams. As of May 5, 2025, no one can use Skype anymore. == History of Skype == * September 2002: investment from Draper Investment Company . * April 2003: Skype.com and Skype.net domain names registered. * August 2003: First public beta version released. * September 2005: Skype for talking is banned in South China. * October 2005: eBay bought Skype. * December 2005: Video Telephonyintroduced, which allowed Skype to show video and sound at the same time. * April 2006: 100 million users. * October 2006: Skype 2.0 for Mac is released, the first full release of Skype with video for Macintosh. * December 2006: Skype announces a new pricing structure as of January 18, 2007, with connection fees for all SkypeOut calls* March 2007: Skype 3.1 is released, adding some new features, including Skype Find and Skype Prime. Skype also released a 3.2 beta with a new feature called Send Money which allows users to send money via PayPal from one Skype user to another. * August 2007: Skype 3.5 for Windows released with additions such as inclusion of video content in chat, call transfer to another person or a group, * August 15, 2007: Skype 2.7.0.49 (beta) for Mac OS X released adding availability of contacts in the Mac Address Book to the Skype contact list, auto redial, contact groups, public chat creation, and an in-window volume slider to the call window. * August 16 / August 17, 2007: Skype users unable to connect to full Skype network in many countries * November 2007: Skype users in London who use the 020 city code lost the phone numbers that connected to their Skype accounts after December 2007. * February 28, 2025: Microsoft announces on their website that Skype will be shut down on May 5, 2025. * May 5, 2025: Skype is shut down. == Security == Skype had an encryption system for security. This system could not be turned on or off. Skype provided an uncontrolled registration system for users. People could use the system safely without revealing their real-life identity to other users of the system, but this also meant there was no way to know that the person they communicated with was the one they said they were. == Problems == The following list is of problems with Skype. * Skype clients could become supernodes, which are combined nodes. These supernodes held together the peer-to-peer network, which could use a big quantity, of bandwidth. For this reason, some universities banned the use of Skype. * Significant (really big) amount of obfuscated code. * Kept chatting on the network. * Blind trust in anything else talking Skype. * Ability to build a parallel Skype network. * Lack of privacy, since Skype had the keys to decrypt calls or sessions. * Heap overflow. * Skype made it hard to enforce a security policy, especially a corporate security policy. * \"No way to know if there is/will be a backdoor\". * Users of Skype on Mac OS X would have bad audio quality when connecting to Mac or Mobile clients. * Bugs and delays in the Linux version. == Reference == == Other websites == * Official Skype website * Planetskype website * Portable Skype (Windows) Category:2003 establishments Category:Video chat Category:Telephone",
 "title": "Skype"
}