{
 "id": "871614",
 "text": "SIX Swiss Exchange (formerly SWX Swiss Exchange), based in Zurich, is Switzerland's principal stock exchange (the other being Berne eXchange). SIX Swiss Exchange also trades other securities such as Swiss government bonds and derivatives such as stock options. It is owned by SIX Group which is an unlisted public limited company itself and is controlled by 122 banks or financial institutions.Annual report 2019. The main stock market index for the SIX Swiss Exchange is the blue-chip index, the SMI, or Swiss Market Index. The index consists of the 20 most significant and most liquid large and mid-cap SPI equity-securities based on the free float market capitalisation. SIX Swiss Exchange was the first stock exchange in the world to incorporate a fully automated trading, clearing and settlement system in 1995. The exchange is controlled by an association of 55 banks. Each of these banks has equal voting rights in the matter of decision making concerning the management and regulation of the exchange. SIX X-Clear Ltd provides clearing and acts as the central counterparty for clearing trades, securities settlement and custody services. ==SMI== Ticker Company name Sector ABBN ABB Computers ATLN Actelion Healthcare ADEN Adecco Retail CSGN Credit Suisse Financial Services GEBN Geberit Retail GIVN Givaudan Commodities HOLN Holcim Retail BAER Juliuis Baer Financial Services NESN Nestle Agribusiness NOVN Novartis Healthcare CFR Richemont Retail ROG Roche Healthcare SGSN SGS Retail UHR Swatch Retail SCMN Swisscom Telecommunications SREN Swiss RE Financial Services SYNN Syngenta Commodities RIGN Transocean Heavy Industry UBSN UBS Financial Services ZURN Zurich Financial Services == History == SIX Swiss Exchange was founded in 1993. It was created by merging the Geneva stock exchange, the Basel stock exchange and the Zurich stock exchange into the Verein Schweizerische Effektenbörse. == Other services == SIX Group as well as being a stock exchange provides a number of other services through separate subsidiaries, these include; * SIX x-clear Ltd providing clearing and acts as the central counterparty for clearing trades. * SIX SIS Ltd which provides securities settlement and custody services. * SIX SAG Ltd providing share registry service. * SIX Financial Information providing financial information services. * SIX pay, multipay providing payment services within Switzerland and Europe. * SIX Payment Services providing payment services within Europe, Scandinavia, USA, Australia and in the UAE. * SIX Interbank Clearing AG, running the Swiss Interbank Clearing (SIC) system providing interbank clearing or Real Time Gross Settlement on behalf of the central bank of Switzerland the Swiss National Bank. SIC became part of the SIX Group in 2008 as part of a merger of the financial market infrastructure providers in Switzerland. == Hours == The exchange's normal trading sessions are from 09:00 to 17:30 on all days of the week except Saturdays, Sundays and holidays declared by the Exchange in advance.Market Hours, SIX Swiss Exchange via Wikinvest == Notes and references == == Other websites == * Official site Category:Stock exchanges in Europe Category:Economy of Switzerland",
 "title": "SIX Swiss Exchange"
}