{
 "id": "87166",
 "text": "Maxïmo Park (sometimes spelled Maximo Park) are an English indie rock band who formed in 2000. == History == Maxïmo Park formed in 2000 (with frontman Paul Smith coming from Billingham in Teesside). To Start off with, the four founding members played only a little amount small shows, with Archis Tiku on vocals, constantly switching the instruments he played. Almost about to split up, but instead they decided to look for somebody else to sing vocals. Singer Paul Smith was discovered by the then-girlfriend of drummer Tom English in a pub while he was singing along to a Stevie Wonder song. Having found someone with a stage presence, they started to write their first songs together, all despite the fact that the frontman never imagined himself as a frontman of a band. Paul Smith had never sung on stage before. Around March 2004, a friend of the band's paid for 300 copies of a 7\" red vinyl single \"Graffiti\" and later released a vinyl of their tracks (\"The Coast Is Always Changing\"/\"The Night I Lost My Head\") that they’d recorded in their house in Fenham. After some time of doing shows around their home town, Steve Beckett of the dance- electronic label Warp Records found one of these records and decided to sign Maxïmo Park to his record label. == Members == *Tom English – drums *Duncan Lloyd – guitar *Paul Smith – vocals *Archis Tiku – bass *Lukas Wooller – keyboard == Discography == === Albums === *A Certain Trigger *Missing Songs *Our Earthly Pleasures == References == == Other websites == *Maxïmo Park official website *Maxïmo Park MySpace *An acoustic session for Vox podcast *Karaoke Plays Review *Maximo Park, Newcastle 15th Dec 07 Review === Interviews === *The Scenestar Maxïmo Park Interview July 2007 *Interview by Alexander Laurence (The Portable Infinite 2006) * Die Klangschau: 15 Songs chosen by Maxïmo Park and interview *Maximo Park video interview with stv/music, June 2007 *Video interview with Paul from Maximo Park *SUPERSWEET interview *Interview by Natalie Shaw for Clash Magazine Category:2001 establishments in England Category:2000s British music groups Category:2010s British music groups Category:English rock bands Category:Music groups from Newcastle upon Tyne Category:Musical groups established in 2001",
 "title": "Maxïmo Park"
}