{
 "id": "871830",
 "text": "This is a list of awards and nominations received by American singer- songwriter Billie Eilish. Name of the award ceremony, year presented, nominee(s) of the award, award category, and the result of the nomination Award ceremony Year Category Work Result American Music Awards 2019 New Artist of the Year Billie Eilish Favorite Social Artist Favorite Pop/Rock Female Artist Favorite Alternative Artist Favorite Music Video \"Bad Guy\" Favorite Pop/Rock Album When We All Fall Asleep, Where Do We Go? 2020 Favorite Alternative Artist Billie Eilish Favorite Social Artist Apple Music Awards 2019 Global Artist of the Year Songwriter of the Year Album of the Year When We All Fall Asleep, Where Do We Go? ARIA Music Awards 2019 Best International Artist ASCAP Pop Music Awards 2019 Vanguard Award Billie Eilish & Finneas BBC Radio 1's Teen Awards 2018 Best Social Media Star Billie Eilish 2019 Best International Solo Artist Best Single \"Bad Guy\" Billboard Live Music Awards 2019 Concert and Marketing Promotions Uber Eats x Khalid x Billie Eilish Activation at South by South Billboard Music Awards 2020 Top Artist Billie Eilish Top New Artist Top Female Artist Top Billboard 200 Artist Top Hot 100 Artist Top Streaming Songs Artist Top Song Sales Artist Top Social Artist Top Billboard 200 Album When We All Fall Asleep, Where Do We Go? Top Hot 100 Song \"Bad Guy\" Top Streaming Song Top Selling Song 2021 Top Female Artist Billie Eilish Billboard Women in Music 2019 Women of the Year Bravo Otto 2019 Best International Singer Brit Awards 2020 International Female Solo Artist 2021 Clio Awards 2019 Music Videos \"When the Party's Over\" Event Design Billie Eilish Experience (Spotify In House) Clio grand: 61 Seconds to Five Minutes \"Share Your Gifts\" Danish Music Awards 2019 Foreign Album of the Year When We All Fall Asleep, Where Do We Go? 2020 Foreign Hit of the Year \"Everything I Wanted\" Emma Gaala 2020 Best-Selling Album of the Year When We All Fall Asleep, Where Do We Go? GAFFA Awards (Norway) 2018 Best Foreign Song \"When the Party's Over\" GAFFA Awards (Sweden) 2019 Best Foreign New Act Billie Eilish 2021 Best Foreign Song \"No Time to Die\" Global Awards 2020 Best Female Billie Eilish Best Song \"Bad Guy\" Grammy Awards 2020 Best New Artist Billie Eilish Album of the Year When We All Fall Asleep, Where Do We Go? Best Pop Vocal Album Record of the Year \"Bad Guy\" Song of the Year Best Pop Solo Performance 2021 Record of the Year \"Everything I Wanted\" Song of the Year Best Pop Solo Performance Best Song Written for Visual Media \"No Time to Die\" iHeartRadio MMVAs 2018 Fan Fave New Artist Billie Eilish iHeartRadio Music Awards 2019 Best New Rock/Alternative Artist 2020 Female Artist of the Year Alternative Rock Artist of the Year Song of the Year \"Bad Guy\" Alternative Rock Song of the Year Best Lyrics Best Music Video Best Remix \"Bad Guy (Remix)\" (with Justin Bieber) Alternative Rock Album of the Year When We All Fall Asleep, Where Do We Go? 2021 Female Artist of the Year Billie Eilish Alternative Rock Song of the Year \"Everything I Wanted\" Best Lyrics Juno Awards 2020 International Album of the Year When We All Fall Asleep, Where Do We Go? LOS40 Music Awards 2019 Best International New Artist Billie Eilish Best International Album When We All Fall Asleep, Where Do We Go? Best International Video \"Bad Guy\" Melon Music Awards 2019 Top 10 Artists Billie Eilish Best Pop Song \"Bad Guy\" Best Song Meus Prêmios Nick 2020 Favorite International Artist Billie Eilish Fandom of the Year Favorite International Hit \"Everything I Wanted\" MTV Europe Music Awards 2019 Best Song \"Bad Guy\" Best Video Best New Act Billie Eilish Best Push Act Biggest Fans Best US Act 2020 Best Video \"Everything I Wanted\" MTV Millennial Awards 2019 Global Instagrammer Billie Eilish Global Hit \"Bad Guy\" 2021 Celebrity Crush Billie Eilish Music-Ship of the Year \"Lo Vas a Olvidar\" (with Rosalía) MTV Millennial Awards Brazil 2020 Global Hit \"Everything I Wanted\" MTV Movie & TV Awards 2021 Best Music Documentary Billie Eilish: The World's a Little Blurry MTV Video Music Awards 2019 Artist of the Year Billie Eilish Best New Artist Push Artist of the Year Video of the Year \"Bad Guy\" Best Pop Video Best Direction Best Editing Song of Summer Best Visual Effects \"When the Party's Over\" Best Cinematography \"Hostage\" 2020 Video of the Year \"Everything I Wanted\" Song of the Year Video for Good \"All the Good Girls Go to Hell\" Best Cinematography Best Visual Effects Best Direction \"Xanny\" 2021 Best Pop \"Therefore I Am\" Best Cinematography Best Latin \"Lo Vas a Olvidar\" (with Rosalía) Video for Good \"Your Power\" Best Direction Song of Summer \"Happier Than Ever\" MTV Video Music Awards Japan 2019 Best New International Artist Video \"Bad Guy\" Video of the Year MTV Video Play Awards 2019 Winning Video Nickelodeon Kids’ Choice Awards Abu Dhabi 2019 Favorite International Star Billie Eilish Nickelodeon Kids' Choice Awards 2019 Favorite Breakout Artist 2020 Favorite Female Artist Favorite Song \"Bad Guy\" 2021 Favorite Female Artist Billie Eilish NRJ Music Awards 2019 International Breakthrough of the Year Video of the Year \"Bad Guy\" 2020 International Female Artist of the Year Billie Eilish NME Awards 2020 Best Album in the World When We All Fall Asleep, Where Do We Go? Best Song in the World \"Bad Guy\" Best Solo Act in the World Billie Eilish People's Choice Awards 2019 Female Artist of the Year Song of the Year \"Bad Guy\" Music Video of the Year Album of the Year When We All Fall Asleep, Where Do We Go? 2020 Female Artist of the Year Billie Eilish Pollstar Awards 2020 Best Pop Tour When We All Fall Asleep Tour Best New Headliner Billie Eilish Q Awards 2019 Best Solo Artist Best Act in the World Today Best Track \"Bad Guy\" Best Album When We All Fall Asleep, Where Do We Go? Queerty Awards 2020 Anthem \"Bad Guy\" Rockbjörnen 2019 Foreign Song of the Year RTHK Top 10 Gold Songs Awards 2020 Top Ten International Gold Song Super Gold Song Top Female Artist Billie Eilish Rolling Stone's International Music Awards 2019 Beginner Space Shower Music Awards 2019 Best International Artist Spotify Awards 2019 Most-Streamed Female Artist Most-Streamed Female Artist on Consoles Most-Streamed Female Artist – For Users From 13 to 17 Years Old Most-Streamed Female Artist – For Users From 18 to 29 Years Old Swiss Music Awards 2019 Best International Solo Act Best International Breaking Act TEC Awards 2019 Outstanding Creative Achievement – Record Production/Single or Track \"Bad Guy\" Teen Choice Awards 2019 Choice Song: Female Artist Choice Female Artist Billie Eilish Choice Breakout Artist Telehit Awards 2019 Best Anglo Video \"Bad Guy\" Best Anglo Song People's Best Video Best Solo Female Act Billie Eilish UK Music Video Awards 2019 Best Pop Video – International \"When the Party's Over\" == Other accolades == === World records === Publication Year World record Record holder Guinness World Records 2019 Most simultaneous US Hot 100 entries by a female Billie Eilish Youngest female at No.1 on UK albums chart ==Notes== ==References== Eilish, Billie *",
 "title": "List of awards and nominations received by Billie Eilish"
}