{
 "id": "871887",
 "text": "Prostitution in Afghanistan is illegal. Prostitution is when someone does a sex act in exchange for money or other payment. Punishments range from five to fifteen years in prison. The country is deeply religious. It is one of the most conservative countries in the world. Sex outside marriage is against the law and can be punished with death. Because most people in Afghanistan are poor, or they have been displaced, more and more have become prostitutes. APMG Health estimated there were12,500 prostitutes in the country in 2015. In 2020 UNAIDS estimated there were 11,000 prostitutes in Kabul, Herat, Mazar and Jalalabad based on a 2019 survey. Before the foreign troops left the country, many of the brothels and prostitutes were located close to US bases. A number of women from China, Iran, Pakistan, the Philippines, Sri Lanka and Tajikistan have been trafficked into Afghanistan, to become prostitutes. Afghan women are also trafficked to other countries for sexual exploitation. Child prostitution in the form of Bacha Bazi is also a problem in the country. The Taliban, who have again come to power in 2021, have values that are deeply rooted in Islamic ethics. They have punished unmarried people with up to 80 lashes. Married prostitutes are considered adulterers, under Afghan law. Even before the Talian took control of the country, Islamic fundamentalists have killed people for having sex outside marriage, without waiting for a state trial. Prostitution is seen as very bad. To keep the family in good standing, prostitutes sometimes get killed by members of their own family. == Examples == * In July 2008, two women were accused of running a secret prostitution service and working for the police. The Taliban in the Ghazni Province killed them, although the local authorities as well as the American military in the area at the time claimed the women were innocent. * Two women accused of prostitution were shot dead in July 2010. == Situation == In the 1990s, prostitution existed in secret in Kabul. The government who followed a very strict interpretation of the Islamic Sharia law had made it illegal. Melissa Ditmore reported in Encyclopedia of Prostitution and Sex Work that during their rule the traffic in women for prostitution had increased. Prostitutes mostly worked from their homes. These were called Qalas. In Kabul there were 25 to 30 hidden brothels. Because women were not allowed to work during the Taliban regime of the 1990s, this forced many children to enter the sex trade to make a living. According to the 2010 Trafficking in Persons Report from the U.S. Embassy in Kabul, women from Iran, Tajikistan, China, and other places have been forced into prostitution in Afghanistan. Many people have lived in Afghanistan as refugees. Most of these came from neighboring countries. There have been reports that Afghan women as well as boys and girls among these refugees were forced into prostitution. Because of poverty, several families have also been reported to be selling their children. A 2007 University of Manitoba report suggests that there may be about 900 female prostitutes in Kabul. Kabul is a city with a population of over 4 million today. Latest estimates show that there may be between 11,000 and 12,500 sex workers in the country. Between 2007 and 2008, two to three people were arrested because of prostitution per week, according to the Afghan Interior Ministry's department of sexual crimes. In Afghan culture and traditions, prostitution is seen as very shameful. Sometimes, religious extremists, kill prostitutes. In some cases, prostitutes get killed by members of their own family: === Temporary marriages === Nikah mut'ah is a fixed-term marriage in Shia Islam; most other Muslims reject the idea. There have also been some reports about Mut'ah (Fegha in Persian language) beginning to be practiced in Mazar-i-Sharif. == Bacha bazi == Like in many other Islamic countries, it is a major taboo in Afghan culture for women to openly dance in front of men. Males and females are separated during weddings and other parties. As a form of adult entertainment, young males dress as females and dance in front of men to make money. \"Bacha bereesh\" (meaning \"boys without beards\" in Persian language) occasionally dance to entertain men at certain parties, especially in the north parts of Afghanistan. Powerful patrons sometimes sexually exploit the dancers. It is estimated that about 10,000 men across Afghanistan engage in sexual activities with other men. == The \"Curse of 39\" == In some parts of Afghanistan, people believe that the number 39 is cursed or a badge of shame: They say it is linked with prostitution. It is unclear, why the number is undesirable. It has often been associated with a pimp, who was living in Herat: This pimp had the nickname \"39\", after the number plate of his expensive car, and the number of his apartment. The number is said to translate into morda-gow, literally meaning \"dead cow\" but a well-known slang term for a pimp. Others have blamed corrupt police officials for spreading the rumour in order to charge between $200–500 to change a \"39\" plate. Vehicle registration plates with the number are seen as so undesirable that vehicles and apartments bearing the numerals are said to be virtually unsellable in the capital, Kabul. The drivers of such vehicles have reported abuse and derision from pedestrians and other drivers. Some have had their registration plates altered to hide the numbers. One such driver, Zalmay Ahmadi, told The Guardian: \"When I drive around all the other cars flash their lights, beep their horns and people point at me. All my classmates now call me Colonel 39.\" Number plates containing '39' were withdrawn in early 2021. == Human trafficking == In 2019, the United States Department of State Office to Monitor and Combat Trafficking in Persons downgraded Afghanistan to a 'Tier 2 watchlist' country'. In 2020, it further downgraded the country to 'Tier 3'. The Government of Afghanistan does not fully meet the minimum standards for the elimination of trafficking and is not making significant efforts to do so. The country remained in 'Tier 3' in 2021. Women and girls from China, Iran, Pakistan, Philippines, Sri Lanka, and Tajikistan have been subject to sex trafficking in Afghanistan. Afghan women, and children pay other people to help them find a job abroad. In most cases, they want to work in Iran, Pakistan, and in Europe. Some of these people force them into sex trafficking. == Related pages == * Survival sex == References == Category:Afghan society and culture Category:Pages with unreviewed translations Category:Crime in Afghanistan",
 "title": "Prostitution in Afghanistan"
}