{
 "id": "872090",
 "text": "People who were active in the sex-positive feminism movement developed feminist pornography. Like normal pornography, the aim is to show sexually explicit images, or describe situations which help to sexually arouse women. Most pornography is made for men; it often uses stereotypes. Feminist pornography wants to break out of these stereotyped gender roles. == Definition == Much like regular pornography, feminist pornography uses explicit images. Most pornography made for men use shallow stereotypes. Feminist pornography wants to question these stereotypes and the way in which things such as gender, sexuality or beauty are shown. Feminist porn movies often also show disabililty. They do this more often than porn made for men: Feminist porn also shows people who are sexually active, even though they are disabled in some way. Feminist pornography looks at what is considered a normal sexual relationship, and turns against seeing one sex as better than another. More often than pornography produced for men, feninist pornography uses language to produce erotic situations. == Characteristics == Most feminist porn movies were made in the last few decades. As these movies were made, people also tried to find interpretations for them and to agree on a common set of rules. These interpretations and rules change over time. The last change was made to accommodate the transgender community. In general, feminist porn wants to be seen as diverse and liberal, and to express liberal views on gender and sexuality. * Mainstream pornography is often focused on performance. Feminist pornography wants to change this understanding. * Working conditions should be fair. The single actor should have more liberty of expression. No matter what the porn movie shows, everyone should agree on what they do. Security and ethical standards are important. In feminist pornography, scenes are often developed in a collaboration with the actors. * It is important to also show sexual practices and sexual identities that are underrepresented in mainstream porn movies. * It is seen positively that women can take the role as directors, screenwriters and camerawomen in the production, but this fact is not mandatory. With this, feminist pornography creates an aesthetic and ethical vision of change that is neither homogeneous nor clearly defined. Jasmin Hagendorfer, artistic director of the Porn Film Festival Vienna, describes her approach as follows: > Feminist porn productions show that the desire and sexual perception of > women can very well be the focus and that porn can also be women-, gender- > and ultimately men-friendly. In addition, many feminist productions stand > for fair working conditions, a say and consensus, which are often not found > in mainstream productions. It is important to show that porn is produced by > women for women and that it will also meet a wide audience. == Criticism == Christopher Boulton says that criticism of feminist pornography comes from religion, government policy, and feminism itself. The positions of these movements are very similar. The different movements want to reach them with different means, though.Nina Schumacher: Pornografisches. Eine Begriffsethnografie. Sulzbach, Ulrike Helmer Verlag 2017, S. 190. One of the critics is the organization Stop Porn Culture. Its main proponent is Gail Dines. According to her, the porn movement in western society is bad, especially the protection of children, and of public health.Nina Schumacher: Pornografisches. Eine Begriffsethnografie. Sulzbach, Ulrike Helmer Verlag 2017, S. 191. The means are very similar to those opponents of pornography used in the 1970s and 1980s. == Economics == Like with the mainstream porn industry, the main interests of feminist pornography are about earning money. Many of the movies are produced as independent movies. Big movie companies like Vivid Entertainment, Adam and Eve and Evil Angel Productions finance and distribute feminist pornography. Feminists deal with this in different ways: Some feminists are opposed to the big companies financing or distributing the movies. Most feminists live with the fact. Courtney Trouble said she would portray almost any character in her films if the demand was there. Nina Schumacher: Pornografisches. Eine Begriffsethnografie. Sulzbach, Ulrike Helmer Verlag 2017, S. 184. Only in this way would she be able to get enough money for the projects in which she could show her own ideas, which are different from the mainstream. For example, she would take on the role of a Big Beautiful Woman, although she rejects this term for herself. Nina Schumacher: Pornografisches. Eine Begriffsethnografie. Sulzbach, Ulrike Helmer Verlag 2017, S. 184. In her view, Capitalist value creation is a means to an end. == Books == * Gayle Rubin (1993): Misguided, Dangerous and Wrong: an Analysis of Anti-Pornography Politics. In: Assiter Alison, Carol Avedon (eds. ): Bad Girls and Dirty Pictures: The Challenge to Reclaim Feminism . Pluto. * Karen Ciclitira (2004): Pornography, women and feminism: between pleasure and politics. Sexualities. * Marilyn Corsianos (2007): Mainstream pornography and \"women\": questioning sexual agency. Critical Sociology. * R. Claire Snyder- Hall (2010): Third-wave feminism and the defense of 'choice'. Perspectives on Politics. * James D. Griffith, Lea T. Adams, Christian L. Hart, Sharon Mitchell (2012): Why become a pornography actress? International Journal of Sexual Health. * Anne G. Sabo (2012): After pornified. How women are transforming pornography & why it really matters. Alresfort (UK). * Patrick Catuz: Feminism Fucks! Lit-Verlag, Vienna / Münster 2013. * Rachael Liberman (2015): It's a really great tool: feminist pornography and the promotion of sexual subjectivity. Porn Studies. * Rebecca Whisnant (2016): But what about feminist porn?: examining the work of Tristan Taormino. Sexualization, Media, and Society. == Other websites == * Feminist Porn Org: A Guide To Ethical and Feminist Porn * \"It's time for porn to change\", Erika Lust's lecture at TEDxVienna * Interview with Svenja Flaßpöhler about feminist pornography (film) - Arte, 17. October 2009 == References == Category:Pornography Category:Feminism",
 "title": "Feminist pornography"
}