{
 "id": "87224",
 "text": "Aaron Kwok is a popular Hong Kong singer and movie actor. He is one of the \"Four Heavenly Kings\" of Cantopop. He has been called \"Hong Kong's Michael Jackson\" for his dancing. Aaron Kwok is one of Hong Kong and Asia's most important pop stars. Over the last decade or so, Kwok has won over a hundred music awards. As a solo performer, he has played in over 200 concerts around the world. == Biography == After graduating from secondary school, Kwok worked at the King Fook Gold and Jewellery Co. Ltd. His father, who owns a gold retail store, wanted him to gain experience in the business and eventually taking over the family business. In 1984, Aaron Kwok joined a dancer training course at HK-TVB, where his talent for dancing was shown. There, Kwok performed in PVs and a variety of TV shows. In 1985, Kwok's outstanding performance in a pageant show was spotted. He was transferred to the acting department of the talent training course and became a TV actor, where he played a few roles in Chinese television drama shows. In the early 1990s, a Taiwanese motorcycle CM gave him instant fame. He burst onto the music scene with his now-famous song Loving You Forever (called 對你愛不完 in the Chinese and original release) and the dance moves for the song. In the next few years, his popularity reached fever-pitch and he was soon ranked alongside the most popular artists of the time. Over the years, Kwok has also taken part in other mediums such as CMs and acting, especially with director-cinematographer Andrew Lau. Kwok has also done extensive public service and charity work, which is why he was amongst the winners of the Ten Most Outstanding Young Persons Award 2003. In 2004, a string of concert dates earned Kwok a Hong Kong Dance Award presented by the Hong Kong Dance Alliance. Due to this success, Kwok toured again in 2005, receiving much praise. At the Taiwan's forty-second Golden Horse Awards ceremony on 13 November 2005, Kwok won Best Leading Actor award for his role in the movie Divergence. It was Kwok's first Golden Horse nomination and beat veteran Hong Kong star Tony Leung to win the honour. Aaron won the Best Actor Award again at the forty-third Golden Horse Awards on 24 November 2006 for his role in the movie After This Our Exile. He became the second actor in the history of the Golden Horse Awards to win the Best Actor Award year after year. Jackie Chan first achieved this back in the 1990s. == Filmography == * 2016 One Night Only - Gao Ye * 2016 Cold War 2 - Sean K. F. Lau * 2016 MBA Partners - Guest star * 2016 The Monkey King 2 - Sun Wu Kong * 2015 Monk Comes Down the Mountain - Zhou Xi Yu * 2015 Port of Call - Detective Chong * 2014 The Monkey King - Bull Demon * 2013 Silent Witness - Tong Tao * 2013 Christmas Rose - Chan Chi-tin * 2013 Conspirators - Chan Tam * 2013 Better and Better - Xie De Fa * 2012 Cold War * 2012 Floating City * 2012 The Monkey King - Bull Demon * 2011 Love in Space * 2011 The Detective 2 - Tam * 2011 Love for Life - Maestro de escuela primaria * 2010 City Under Siege - Sunny * 2010 Empire of Silver - Tercer Maestro * 2009 The Storm Warriors - Striding Cloud * 2009 Murderer - Ling Kwong * 2007 The Detective - Tam * 2006 The Silver Valley * 2006 After This Our Exile - Chow Cheung Sheng * 2005 Divergence - Suen Siu Yan * 2004 Throw Down - Tony * 2004 Heat Team - YT Lee * 2001 Para Para Sakura - Wong Kam Shing * 2000 China Strike Force - Darren Tong * 2000 And I Hate You So - Zhang Yong * 2000 2000 A.D. - Peter Li * 1998 The Storm Riders - Striding Cloud * 1998 Anna Magdalena - Yau Mok Yan (Yau Wing Fu) * 1996 Somebody Up There Likes Me - Ken Wong * 1995 Whatever Will Be, Will Be - Mr. Lam * 1994 The Kung Fu Scholar - Liu Xian Kai * 1993 Future Cops - Ryu * 1993 Legend of the Liquid Sword - Zhu Liu Xiang * 1993 Love is a Fairy Tale - Hung * 1993 The Bare-Footed Kid - Guan Fung Yao * 1993 A Moment of Romance II - Ah Fu * 1993 Millionaire Cop - Ball; Jessy Li * 1992 Game Kids - Zhong * 1992 Gangs '92 - Sam Lam * 1992 Truant Heroes - Ace * 1992 Rhythm of Destiny - Lee Ka Wah * 1992 The Shootout - Wong Ka Fai * 1991 Lee Rock III - Lui Yong Yin * 1991 The Banquet - Younger Brother of Small B Head * 1991 Savior of the Soul - Silver Fox * 1991 The Queen of Gamble - Ah Po * 1991 Lee Rock II - Lui Yong-Yin * 1990 Story of Kennedy Town - Lee Siu Wai * 1989 Close Escape - Ben Kwok Category:1965 births Category:Living people Category:Hong Kong actors Category:Hong Kong singers Category:C-pop singers",
 "title": "Aaron Kwok"
}