{
 "id": "872248",
 "text": "Numantia (Spanish: Numancia) was an ancient Celtiberian settlement. Its remains are located 7 km north of the city of Soria, on a hill known as Cerro de la Muela in the municipality of Garray. Numantia is famous for its role in the Celtiberian Wars. It was a city that became famous for its resistance against the Roman armies. == History == === Origins === The first human settlements in Numantia were established in the III millennium BC. Shepherds who made seasonal movements with their flocks inhabited this area. The area had a harsh climate but the pastures were rich. Towards the 8th century BC., handmade ceramics were used in this settlement. From the 7th century BC., the settlement became a castro. Around 350 BC., Numantia had many inhabitants and was born as a city. Roman authors don't agree on the people that lived there. Pliny the Elder believed it was the Pellendones. However, other authors, like Strabo and Ptolemy say in their writings that the city belongs to the Arevaci people. === Roman conquest === In 153 BC, Numantia had its first serious conflict with Rome. After 20 years of fighting, in 133 BC, the Roman Senate gave Scipio Aemilianus Africanus the task of destroying Numantia. After 13 months of siege, the Numantians decided to burn the city before surrendering. The few survivors were sold as slaves. Numantia was rebuilt in the time of Augustus. It was repopulated with Celtiberians. === Modern times === Today, Numancia is an archaeological site in the province of Soria. It was declared a Bien de Interés Cultural (Site of Cultural Interest) on the 29th August 1882. This site is being excavated by a group of archaeologists from the Complutense University of Madrid under the direction of Alfredo Jimeno.Alfredo Jimeno Martínez at Academia It receives funds from the Junta de Castile and León. Since 2007 there is a controversy as the Junta of Castile and León allowed the construction of industrial estate near the ruins. Several institutions have protested against that plan despite the statement from official authorities saying that the remains won't be damaged. == References == == Other websites == * Official website of the Archaeological Site of Numancia Category:Archaeological sites in Europe Category:Buildings and structures in Spain",
 "title": "Numantia"
}