{
 "id": "872243",
 "text": "The Tibetan calendar, or the Tibetan lunar calendar is a calendar based on 12 or 13 phases of the moon, which starts with a new moon, or when the moon is completely dark. A lunar month is added every 2 or 3 years to equal the solar year. The Tibetan New Years celebration is called Losar. According to almanacs, or yearly calendar with important dates, the year starts with the third Hor month, or the Third Mongolian month. Every month, certain dates in the calendar are used for Buddhist practices. Similarly, certain months also have importance. == Years == Years in the Tibetan calendar are similar to the Chinese zodiac, with animals signifying each year. The animals go as follows: : Hare Dragon Snake Horse Sheep Monkey Bird Dog Boar Rat Ox Tiger There are also elements. Each element goes as follows: : Fire Earth Iron Water Wood Each elements is associated with two years. First as male, and second as female. For example, a male Earth-Dragon year is followed by a female Earth-Snake year, then by a male Iron-Horse year. : Year (Gregorian) Year according to rabjyung Wylie Element Animal Sex 2008 rabjyung 17 lo 22 sa mo glang Earth Rat male 2009 rabjyung 17 lo 23 sa pho khyi Earth Ox female 2010 rabjyung 17 lo 24 lcags pho stag Iron Tiger male 2011 rabjyung 17 lo 25 lcags mo yos Iron Hare female 2012 rabjyung 17 lo 26 chu pho 'brug Water Dragon male 2013 rabjyung 17 lo 27 chu mo sbrul Water Snake female 2014 rabjyung 17 lo 28 shing pho rta Wood Horse male 2015 rabjyung 17 lo 29 shing mo lug Wood Sheep female During the time of the Tibetan Empire (7th – 9th century), Tibetan months were named according to the four seasons: : First spring month (dpyid zla ra ba), middle spring month (dpyid zla 'bring po), last spring month (dpyid zla mtha' chung), : first summer month (dbyar zla ra ba), middle summer month (dbyar zla 'bring po), last summer month (dbyar zla mtha' chung), : first autumn month (ston zla ra ba), middle autumn month (ston-zla 'bring-po), last autumn month (ston zla mtha' chung), : first winter month (dgun zla ra ba), middle winter month (dgun-zla 'bring-po) and last winter month (dgun zla mtha' chung). Since the 12th century, the months were named from the 12 animals in the Chinese zodiac: * taag (Tiger), * ye (Hare), * 'drug (Dragon), * drul (Snake), * ta (Horse), * lug (Sheep) * te (Monkey), * tshya (Bird), * kyi (Dog), * phag (Boar), * tshyiwa (Rat) * lang (Ox). With the introduction of the calendar of the \"Kalacakratantra\" in the second half of the 11th century, months were also named by lunar mansions. Within that, a full moon took place each month: : 1st: Chu (mchu, Skt. māgha) : 2nd: Wo (dbo, Skt. phālguna) : 3rd: Nagpa (nag pa, Skt. caitra) : 4th: Saga (sa ga, Skt. vaiśākha) : 5th: Non (snron, Skt. jyeṣṭha) : 6th: Chuto (chu stod, Skt. āṣāḍha) : 7th: Drozhin (gro bzhin, Skt. śrāvaṇa) : 8th: Trum (khrums, Skt. bhādrapada) : 9th: Takar (tha skar, Skt. āśvina) : 10th: Mindrug (smin drug, Skt. kārttika) : 11th: Go (mgo, Skt. mārgaśīrṣa) : 12th: Gyal (rgyal, Skt. pauṣa) In the second half of the 13th century, a system was introduced of counting the month by ordinal numbers, also called the Hor month: : 1st Hor month (hor-zla dang-po) : 2nd Hor month (hor-zla gnyis-pa) : 3rd Hor month (hor-zla gsum-pa) : 4th Hor month (hor-zla bzhi-pa) : 5th Hor month (hor-zla lnga-pa) : 6th Hor month (hor-zla drug-pa) : 7th Hor month (hor-zla bdun-pa) : 8th Hor month (hor-zla brgyad-pa) : 9th Hor month (hor-zla dgu-pa) : 10th Hor month (hor-zla bcu-pa) : 11th Hor month (hor-zla bcu-gcig-pa) : 12th Hor month (hor-zla bcu-gnyis-pa) Category:Calendars",
 "title": "Tibetan calendar"
}