{
 "id": "872391",
 "text": "The Sydney Harbour National Park is a national park in the Australian state of New South Wales. The protection of the park was announced in 1975. Between 1978 to 1984, the area of the park was enlarged several times. == Geography == The national park is in the middle of metropolitan Sydney with an area of about 3.93 km². This area is spread over various areas around Sydney Harbor and several islands, such as B. Bradleys Head, Middle and Georges Heads, North Head, South Head and Harbour Island. For details on the boundaries and details, see the National Park website with a brochure as a PDF file == Vegetation == About 40 % of the area is taken up by heather areas, which are partially overgrown by natural tree vegetation. About 25 % of the area - especially in protected locations with deep soils - can be described as woodland. Another 15% eucalyptus forests grow. == Wildlife == In the national park there are mainly nocturnal mammals, including gray-headed flying foxes, large long-nosed bucks, Stuart broad-footed pouches, the golden-bellied swimming rat, cusus, ringbucks, echins and bats.Information on wildlife from the National Parks Wildlife Service Around 150 bird species have been observed in the national park so far, 44 also breed here, including the Cormorant, masked lapwing, white-bellied sea eagle and gray-headed falcon . There is also a breeding colony of the little penguins here. == History == Long before Australia became a British colony, the area around Sydney Harbor was inhabited by the Aboriginal groups of the Eora, Guringai and Dharug . That changed soon after the arrival of the first European settlers and prisoners. In order to make way for the development of the colony, the Aborigines were pushed further and further from their traditional settlement and hunting areas. Many died of previously unknown diseases such as smallpox or were even killed. Around the middle of the 19th By the mid-19th century, the Aborigines were almost displaced from the Sydney area. Explanations of the history of the park on the park homepage == Other websites == * Official website of the park with photos == References == Category:National parks in Australia",
 "title": "Sydney Harbour National Park"
}