{
 "id": "872344",
 "text": "Millard Owen Sheets (June 24, 1907 – March 31, 1989) was an American artist, teacher, and architectural designer. He was one of the earliest of the California Scene Painting artists and helped define the art movement. Many of his large-scale building-mounted mosaics from the mid-20th century are still extant in Southern California. His paintings are in the Metropolitan Museum of Art and the Whitney Museum in New York, the Chicago Art Institute, the National Gallery in Washington D.C.; and the Los Angeles County Museum. ==Early life and education== Millard Sheets was born June 24, 1907, and grew up in the Pomona Valley, east of Los Angeles. He is the son of John Gosper Sheets and (1878 – 1947) and Marilla Mae Owen (1883 – 1907). He attended the Chouinard Art Institute and studied with painters Frank Tolles Chamberlin and Clarence Hinkle. While he was still a teenager, his watercolors were accepted for exhibition in the annual California Water Color Society show. By the age of 19, he was elected into membership of the California Water Color Society. The following year he was hired to teach watercolor painting even before his graduation from Chouinard. ==Career== In 1929 he won second prize in the Texas Wildflowers Competitive Exhibitions, and the generous award allowed Sheets to travel to Europe for a year to further his art education.\"Wildflower Competitive Exhibitions\" . San Antonio Art League Museum website. Retrieved Jan. 31, 2016.\"Wildflower Competitive Exhibitions: Millard Sheets\" . San Antonio Art League Museum website. Retrieved Jan. 31, 2016. By the early 1930s he began to achieve national recognition as a prominent American artist. He was exhibiting in Paris, New York City, Pittsburgh, Chicago, Houston, St. Louis, San Antonio, San Francisco, Washington D.C., Baltimore, and many other cities throughout the United States. In Los Angeles he was recognized as the leading figure and driving force behind the California Style watercolor movement. Between 1935 and 1941, his recognition, awards, and output increased, winning him repeated mention in Art Digest and a color reproduction of his work in the book Eyes on America. In 1935 at age 28, he was the subject of a monograph published in Los Angeles. His art sales enabled him to travel again to Europe, Central America, and Hawaii, where he painted on location. Although his watercolor techniques during this period ranged from very tight to very loose, a consistent, he nevertheless exhibited a personal style. During World War II, he was an artist-correspondent for Life Magazine and the United States Army Air Forces in India and Burma. Many of his works from this period document the scenes of famine, war, and death that he witnessed. His wartime experience also informed his post-war art for a number of years, where while painting in California and Mexico in the 1940s his work followed dark hues and depressing subjects. After the 1950s his style shifted toward brighter colors and subjects from his worldwide travels. Watercolor and oil painting were only part of Sheets's art career. Through his teaching at Chouinard Art Institute, Otis Art Institute, Scripps College and other institutions, hundreds of artists learned how to paint, and were then guided into art careers. He directed the art exhibition at the Los Angeles County Fair for many years and brought world-class work to Southern California. During the Great Depression, he joined forces with Edward Bruce to hire artists for the Public Works of Art Project, the first New Deal art project. In 1946, he served as a president of the California Water Color Society. In later years, he worked as an architect, illustrator, muralist, printmaker, and art exhibition juror. Outside of California, he took on commissions for the Detroit Public Library, the Mayo Clinic, the dome of the National Shrine, the University of Notre Dame library, the Hilton Hotel in Honolulu, and the Mercantile National Bank in Dallas. In 1953, Sheets was appointed director of Otis Art Institute (later named Otis College of Art and Design).\"Millard Sheets Named Art Institute Director,\" Los Angeles Times, August 20, 1953, A1. Under his leadership, the school's academic program was restructured to offer BFA and MFA degrees, and a ceramics department was created, headed by Peter Voulkos. During that time, a ceramics building, gallery, library, and studio wing were completed. By the time Sheets left Otis in 1962, the form and direction of the college had changed dramatically. == Millard Sheets Art Center == The Millard Sheets Art Center first began as the Fine Arts Program of the Los Angeles County Fair in 1922. The 20,000+ square-foot art center was built in 1937 by the Works Progress Administration to house the program, the first major gallery dedicated solely to art in Los Angeles County. Each year, the gallery provided visitors to the Los Angeles County Fair with access to art work found throughout the world. In 1994 the building was dedicated to Millard Sheets and in 2013 was identified by Fairplex as the home for year- round art education and exhibitions and is currently a part of The Learning Centers at Fairplex. == Work == === Mosaic murals at Home Savings Bank branches === In the late 1950s, Sheets was commissioned by Howard F. Ahmanson to design Home Savings Bank branches throughout Southern California that would serve as community landmarks by expressing \"community values\" or presenting \"a celebratory version of the community history.\" To accomplish this goal, Sheets designed his branch buildings with exterior façades containing large mosaic works depicting local heritage. The Ahmanson commissions multiplied to include more than 80 branch buildings after the initial 1955 commission. Sheets resigned his teaching position at Scripps College and established the Sheets Studio in Claremont, California, employing a series of artists. Sheets produced these mosaics as commercial commissions, and he rarely titled them. Nevertheless, they are now considered official public art and are titled by their images or theme. Although they enjoy some protections under the California Arts Preservation Act, many have been destroyed. The following Sheets Studio mosaics in Southern California have survived deterioration and demolition: * (1962) Early Pomona Family, Pomona, California, United States * (1968, 1982) Indians and Yuccas, Claremont, California, United States * (1971/2013) Mi Casa Es Su Casa, Beverly Hills, California, United States * (1979) Scenes of the Old West, Buena Park, California, United States * (1980) Redlands Heritage, Redlands, California, United States ==Death== Sheets died on March 31, 1989 at his home in Anchor Bay in Mendocino County, California after a longtime illness. A service was held at his home and at the First Unitarian Church of San Diego. == References == ==Other websites== * Offical website * Wildflower Competitive Exhibitions *Millard Sheets: A Legacy of Art and Architecture (complete PDF booklet about his work created for the Getty Pacific Standard Time project by the Los Angeles Conservancy) *Interview of Millard Sheets, Oral history interview with Millard Sheets, 1986 October-1988 July. Archives of American Art, Smithsonian Institution. *List of artworks by Millard Sheets at the Smithsonian American Art Museum *\"1934: A New Deal for Artists\" (exhibition on the Great Depression featuring Millard Sheets and his contemporaries), Smithsonian American Art Museum *California Watercolor *List of artworks by Millard Sheets at the Ruth Chandler Wiliamson Gallery of Scripps College *Millard Sheets Papers at the Smithsonian's Archives of American Art *Panorama of the Pomona Valley, 1965 on view at the American Museum of Ceramic Art Category:1907 births Category:1989 deaths Category:People from Pomona, California Category:American painters Category:Mural artists Category:American illustrators",
 "title": "Millard Sheets"
}