{
 "id": "872343",
 "text": "Recess is an American animated television series created by Paul Germain and Joe Ansolabehere (credited as \"Paul and Joe\") and produced by Walt Disney Television Animation, with animation done by Grimsaem, Anivision, Plus One Animation, Sunwoo Animation, and Toon City. The series focuses on six elementary school students and their interaction with other classmates and teachers. The title refers to the recess period during the daily schedule, in the North American tradition of educational schooling, when students are not in lessons and are outside in the schoolyard. During recess, the children form their own society, complete with government and a class structure, set against the backdrop of a regular school. == Plot == Recess portrays the lives of six fourth graders—cheeky and popular lovable rogue Theodore Jasper \"T.J.\" Detweiler (Ross Malinger, Andrew Lawrence), Jock Vince LaSalle (Rickey D'Shon Collins), tomboy Ashley Spinelli (Pamela Adlon), wise fool Mikey Blumberg (Jason Davis), geek Gretchen Grundler (Ashley Johnson), and awkward new kid Gus Griswald (Courtland Mead)—as they go about their daily lives in a school environment at Third Street Elementary School in Little Rock, Arkansas.[4][5] A major satirical point of the show is that the community of students at school is a microcosm of traditional human society complete with its own government, class system, and set of unwritten laws. They are ruled by a monarch, a sixth grader named King Bob, who has various enforcers to make sure his decrees are carried out. The society has a long list of rigid values and social norms that imposes a high expectation of conformity upon all the students. == Characters == * T.J. Detweiler * Vince LaSalle * Mikey Blumberg * Gus Griswald * Gretchen Grundler * Ashley Spinelli * Miss Finster * Randall * Principal Prickly Category:1990s American animated television series Category:1996 American television series debuts",
 "title": "Recess (TV series)"
}