{
 "id": "872377",
 "text": "Scooby-Doo and Guess Who? is a children's television series produced by Warner Bros. Animation and the 13th television series in the Scooby-Doo franchise. The series is produced by Chris Bailey. The show first premiered on Boomerang's SVOD service on June 27, 2019, before making its debut on Cartoon Network on July 8, 2019, and on Boomerang on October 1, 2020. == Premise == Following a similar premise to The New Scooby-Doo Movies, the series focuses on the Mystery Inc. gang as they solve mysteries while encountering and being assisted by various celebrities and fictional characters, including crossovers with DC Comics and Hanna-Barbera characters. == Voice cast == === Mystery, Inc. === * Frank Welker as Scooby-Doo, Fred * Matthew Lillard as Shaggy * Grey Griffin as Daphne * Kate Micucci as Velma === Guest stars === * Laila Ali * Sean Astin * Jessica Biel * Terry Bradshaw * Alton Brown * Carol Burnett * Steve Buscemi * Cher * Joey Chestnut * Sandy Duncan * Jeff Dunham * Darci Lynne Farmer * Jeff Foxworthy * Morgan Freeman * Jim Gaffigan * Ricky Gervais * Whoopi Goldberg * Tim Gunn * Gigi Hadid * Halsey * Mark Hamill * Chloe Kim * Liza Koshy * Tara Lipinski * Lucy Liu * Macklemore * Malcolm McDowell * Kacey Musgraves * Bill Nye * Chris Paul * Penn & Teller * Axl Rose * Kristen Schaal * Sia * Joseph Simmons * Christian Slater * Jason Sudeikis * Wanda Sykes * George Takei * Kenan Thompson * Alex Trebek * Neil deGrasse Tyson * Billy Dee Williams * \"Weird Al\" Yankovic * Maddie Ziegler Fictional guest characters include The Hex Girls, Steve Urkel, Wonder Woman, Sherlock Holmes, Batman, Alfred Pennyworth, Joker, Flash, Trickster, Magilla Gorilla, the Ghost of Abraham Lincoln, Blue Falcon and Dynomutt and the characters from The Funky Phantom. == Episodes == === Season 1 (2019–20) === # Revenge of the Swamp Monster! (with Chris Paul) # A Mystery Solving Gang Divided (with Ghost of Abraham Lincoln) # Peebles' Pet Shop of Terrible Terrors! (with Wanda Sykes) # Elementary, My Dear Shaggy! (with Sherlock Holmes) # Ollie Ollie In-Come Free! (with Ricky Gervais) # The Scooby of a Thousand Faces! (with Wonder Woman) # The Cursed Cabinet of Professor Madds Markson! (with Penn & Teller) # When Urkel-Bots Go Bad! (with Steve Urkel) # The Fastest Food Fiend! (with Jim Gaffigan) # Attack of the Weird Al-Osaurus! (with \"Weird Al\" Yankovic) # Now You Sia, Now You Don't! (with Sia) # Quit Clowning! (with Kenan Thompson) # What a Night, For a Dark Knight! (with Batman) # The Nightmare Ghost of Psychic U! (with Whoopi Goldberg) # The Sword, The Fox, and the Scooby-Doo! (with Mark Hamill) # One Minute Mysteries! (with The Flash) # Hollywood Knights! (with George Takei) # The New York Underground! (with Halsey) # Fear of the Fire Beast! (with Steve Buscemi) # Too Many Dummies! (with Jeff Dunham and Darci Lynne Farmer) # Dance Matron of Mayhem! (with Maddie Ziegler) # The Wedding Witch of Wainsly Hall! (with Jeff Foxworthy) # A Run Cycle Through Time! (with Malcolm McDowell) # I Put A Hex On You! (with The Hex Girls) # The High School Wolfman's Musical Lament! (with Christian Slater) # Space Station Scooby (with Neil deGrasse Tyson and Bill Nye) === Season 2 (2020–2021) === # The Phantom, The Talking Dog, and the Hot Hot Hot Sauce! (with Kacey Musgraves) # The Last Inmate! (with Morgan Freeman) # The Horrible Haunted Hospital of Dr. Phineas Phrag! (with Kristen Schaal) # The Hot Dog Dog! (with Joey Chestnut) # A Moveable Mystery! (with Gigi Hadid) # The Feast of Dr. Frankenfooder! (with Alton Brown) # A Fashion Nightmare! (with Tim Gunn) # Scooby on Ice! (with Tara Lipinski) # Caveman on the Half Pipe! (with Chloe Kim) # The Crown Jewel of Boxing! (with Laila Ali) # The Internet on Haunted House Hill! (with Liza Koshy) # The 7th Inning Scare! (with Macklemore) # The Dreaded Remake of Jekyll & Hyde! (with Sandy Duncan) # Total Jeopardy! (with Alex Trebek) # Dark Diner of Route 66! (with Axl Rose) # Lost Soles of Jungle River! (with Jason Sudeikis) # The Tao of Scoob! (with Lucy Liu) # Returning of the Key Ring! (with Sean Astin) # Cher, Scooby and the Sargasso Sea! (with Cher) # The Lost Mines of Kilimanjaro! (with Jessica Biel) # The Legend of the Gold Microphone! (with Joseph Simmons (Run-DMC)) # Scooby-Doo and the Sky Town Cool School! (with Billy Dee Williams) # Falling Star Man! (with Terry Bradshaw) # A Haunt of a Thousand Voices! (with Frank Welker - Scooby-Doo and Fred, Grey DeLisle - Daphne, Matthew Lillard - Shaggy, and Kate Micucci - Velma) # Scooby-Doo, Dog Wonder! (with Blue Falcon and Dynomutt) # The Movieland Monsters! (with Carol Burnett) ==Notes== Category:American animated television series Category:Scooby-Doo television series",
 "title": "Scooby-Doo and Guess Who?"
}