{
 "id": "872420",
 "text": "Heathcote National Park is a national park in east New South Wales, and about 34 km southwest of Sydney. The park is west of the Royal National Park near the suburbs of Heathcote and Waterfall. == Description == The park is 22.5 km² eucalyptus forest. Private vehicles may not enter. Walkers go in through the entrance on Freeman Road in Heathcote.Heathcote National Park. Google Maps A trail begins behind the Boy Scout Hall on Freeman Road. It goes south past water holes and small waterfalls. The path ends at the Woronora Dam, although there are several other entrances to the park around Heathcote and Waterfall. == History == Before the forest area became a park, a group of hikers had leased most of the area. Presumably they created some of the early hiking trails and campsites. The area later became a state park and again later a national park. Aboriginals lived in the area and left traces in various places.Neil Paton: ‘’Sydney and Blue Mountains Bushwalks’’. Kangaroo Press. Sydney (2004). S. 132–139 In addition, a number of European settlers lived during the Great Depression in the 1930s in simple huts, leaving only scant ruins in places like Myuna Creek back == Geography == The park consists of the deeply furrowed Hawkesbury sandstone plateau, part of the Woronora Plateau . Heathcote Creek, a tributary of the Woronora River, is found in a gorge. The sandstone is about 200 million Years old and has been around for around 94 million Years ago. After each period of land uplift, the watercourses dug into the sandstone. Heathcote Creek tumbles down some waterfalls to the Woronora River on the north edge of the park. == Flora == The hills and arid slopes are covered with forests dominated by angophora and eucalyptus. Grass trees are common. The undergrowth consists of bushes such as banksia, hakea and wax flowers. Doryanthes excelsa and Allocasuarina torulosa grow on more humid slopes. Eucalyptus patens and Grevillings grow in the valley of Heathcote Creek. == Fauna == Short-headed glide pouches, common ring pouches and probably also eastern pygmy possums live on Mirang Creek and in Minda Gully. There are also swamp wallabies. Often you can also see honey- eaters and gray-backed lyre tails. == Other websites == * nationalparks.nsw.gov.au/ * List of animals recorded in the park * NSW National Parks and Wildlife Service == References == Category:National parks in Australia",
 "title": "Heathcote National Park"
}