{
 "id": "872456",
 "text": "A condemned property (also called a condemned building) is any house, commercial property, business, apartment, townhouse, educational place (school, college) jail/prison, law enforcement or government property that is marked as unfit or not suitable for being occupied, being used or operated. A large number of properties are also condemned for being unsafe, illegal or fire-damaged. Most are dilapidated (badly damaged), deteriorated (run down, decayed), are infested by vermin/rodents or loaded with filthy conditions (excrement, spoiled food/drinks or dirt/mud across several parts of any place that is occupied). Tropical cyclone, flood, lightning or tornado damage often also leads to the condemnation of properties. Other conditions for which a building may be condemned involve places being boarded, having utilities disconnected or having dangerous materials, methamphetamine making labs or any dangerous locations. Utilities are hot water, good-to-excellent heating systems working, good-to-excellent plumbing and having a safe reliable electrical outlet. Some places are condemned for vehicles parked in a yard, vehicles that are classified as not operable, having dangerous conditions. Condemned warnings or notices (also called as placards) are usually posted onto the properties in question. They forbid when people occupy, enter or use these buildings when not authorized for doing so. Anyone other than code officials, the property inspectors or area health department officials entering, occupying or using any condemned premises, defacing or removing condemned notices/warnings are subject to fines, jail time or both. Notices of violation are often posted with the condemned notices and warnings. New York City, Philadelphia, St. Louis, Chicago, Quad Cities (most likely Rock Island, Moline and Davenport), Baltimore, Detroit and Los Angeles have higher numbers of condemned, abandoned and vacant homes, buildings or schools unlike several other mid-size/small and some large cities or towns in Canada and the United States. Condemned properties are usually renovated. Many other condemned buildings or homes, however, are demolished due to their conditions. ==References== Category:Public health Category:Buildings and structures",
 "title": "Condemned property"
}