{
 "id": "872574",
 "text": "Juanito Jones is a Spanish animated series for children with 52 episodes of 13 minutes each, created by Roser Capdevila, Gusti and Ricardo Alcántara. It was produced by Cromosoma and Televisió de Catalunya and originally broadcasted by the Spanish network Antena 3 between 2001 and 2002. It was later shown in other regions of the world, having been acquired by channels such as Nickelodeon Latin America , Noga (Israel), TF1 (Italy), Televisa (Mexico), Univision (United States) and Disney Channel in France, Italy and Spain in 2001. In Portugal debuted on RTP in 2002. In Brazil it was shown by Nickelodeon and debuted on Canal Futura on July 2, 2007. == Story == This drawing explains the adventures of Juanito Jones, a boy who confronts dangerous situations but always manages to escape easily. This is because these adventures are part of his imagination. He uses imagination as a solution to real-life problems. Juanito is always accompanied by his teddy bear, Sombra, who comes to life in his imaginary world. In real life, Juanito is always with his family. == Characters == * Juanito Jones - A boy full of imagination who lives imagining adventures resembling his life. * Sombra - A teddy bear that accompanies Juanito in all his adventures, besides being scared. He also loves anything that's made from lemons . In real life Sombra has no life, only in Juanito's imaginations he does. === Jones family === * Vanessa - Juanito's younger sister. She is stubborn and loves to get her brother in trouble, but deep down she likes him. It has a counterpart in Planeta Laranja that accompanies Juanito and Sombra on their adventures. * Carmela - Juanito's mother who is occasionally irritated with the things he does, but later apologizes. At the end of the series she becomes pregnant. * Tom - He's Juanito's father. He is calm and works in a store in town and is always carefree. * Vovô - Juanito's grandfather whose real name is Antônio. He is a gardener and always helps his grandson with problems, giving him good advice. === Other children === * Pedro - Juanito's neighbor and best friend. A scared, toothy boy who always talks to Juanito and loves to eat cheese. He has an older sister who works in a circus and rarely shows up at home. At the end of the series, he starts dating Úrsula. It has a counterpart in King Maldade's castle being redheaded and having been bewitched by the Witch Much Scream to not be able to leave the castle and still turn into a rat every time he is scared. * Frank - He's Juanito's rival. A huge, tough boy who has been picking on Juanito since they were little at school and is always accompanied by Paul. He's not very smart and always ends up doing poorly. It features a thug counterpart in the old west named Joe . * Paul - He is always walking with Frank. He has a black right eye. He always has good ideas, but Frank always makes Paul think that good ideas are not his. Like Frank he also has a counterpart in the wild west who is Joe's henchman. * Miranda - Juanito's girlfriend. Juanito met her at camp, since at first Juanito and Frank had fought with each other to see who would take her. Later, he starts to meet Juanito in his city with his friends. She has an Indian counterpart in the old west called Arco-Íris who like Miranda is also in love with Juanito, and also has another one in King Maldade's castle, exactly like her, having the same name but being the daughter of a baker. * Úrsula - A big girl next door to Juanito. He meets Juanito after he returns from camp on vacation when she moves to his neighborhood and instantly falls in love with him, starting to consider him her boyfriend even though he's already engaged to Miranda (his cousin). At the end of the series, she starts dating Pedro. == Places == * Prehistory - Shows Juanito's life in a prehistoric version as a smart caveman living with dinosaurs . * Mysterious Island - An unknown island that Juanito and Sombra are trapped on after having their boat broken at sea. It is populated by the Barrigas Pintadas tribe, a friendly indigenous tribe of which Juanito and Sombra become part. * Old West - Shows the adventures of Juanito and Sombra as a good guy in the wild west facing the tyranny of the feared Joe (Frank) in an isolated small town. Towards the middle of the series Juanito befriends an indigenous tribe with whom he falls in love with the daughter of chief Arco-Íris (Miranda). * King Maldade Castle - Set in a tenebrous castle in the middle of a swamp where the terrible King Maldade resides and his book of evil witchcraft which Juanito and Sombra have the mission to destroy. Over time the two become friends with a boy (Friend/Pedro) and start to face the Witch Much Scream (the servant of King Evil) in their plans. * Outer Space - At first it showed the adventures of Juanito, Sombra and Vanessa exploring space doing missions sent by Captain Estrela (Juanito's mother), but with time the stories start to focus on the adventures of the three in Planeta Orange, a dry and polluted planet where they help residents fend off evil aliens and preserve the local environment. == Links with the Triplets == In several episodes it is possible to see cameos and references to the series Les Tres Bessones, due to the fact that both series are produced by Cromosoma and Televisió de Catalunya. In two episodes it is possible to see the characters watching on television the cartoon of the Witch Onilda, but under the name of La Bruixa Avorrida (catalan for \"the Bored Witch\", which is also the name that the series received in Portugal). In the episode where Vanessa steals Juanito's Shadow he mentions that the only magazine Vanessa read was the Triplets. Also, in the episode where Pedro's sister returns home when she tries to pull a rabbit out of her hat, what ends up coming out is the Witch Onilda's owl. Category:2001 television series debuts Category:2002 television series endings",
 "title": "Juanito Jones"
}