{
 "id": "872620",
 "text": "The Royal National Park is a national park in New South Wales of Australia. It is located 29 kilometres south of Sydney and is part of the Sydney metropolitan area. == History == The national park was founded in 1879 by Sir John Robertson, then premier of New South Wales, making it the second oldest national park in the world after Yellowstone National Park in the United States. Sir John Robertson cared for and supported him all the rest of his life. After coal was discovered on the terrain, it was founded out of economic interests to keep competition away from the gates of Sydney. Its original name was The National Park . In 1955 it was renamed after a visit from Queen Elizabeth II. The park is repeatedly ravaged by bushfires, which contribute to the constant change and regeneration of the vegetation. Plants like the native Waratah are adapted to the environmental factor fire and need the fires to bloom in subsequent years. == Location == The park is partly in the Sydney and Wollongong administrative districts and forms a jewel with unspoiled nature between these two major cities. It is bounded to the north by the Port Hacking fjord, to the west by the motorway between the cities and to the south to Otford. The Heathcote National Park connects across the freeway and continues the green belt around Sydney. The Royal National Park offers very different landscapes and vegetation. It lies on sandstone hills that break off a few hundred meters down to the coast. They are mostly covered by eucalyptus forests with a wealth of species. Centrally, deeply cut, the Hacking River runs through the park, which flows into the seawater of Port Hacking at Audley. This rugged bay offers protection from the open sea. The water at Bundeena is very shallow and is home to an extensive mangrove forest . There are a few beaches and lagoons on the open coast to the Tasman Sea. Most of them can only be reached on foot via the coastal footpath. Wattamolla can be approached and offers ample picnic and barbecue facilities. In the southeast the forest merges into the subtropical rainforest of the Illawarra Escarpment, in which there are also palm trees. == Access == Access by car is via three routes, north from Sutherland, west from Waterfall and south from Otford via Stanwell Park . A daily or annual fee is required, which can be purchased at various points of sale as well as on NSW national parks website. == Other websites == * Official website of the park Category:1879 establishments in Australia Category:National parks in Australia",
 "title": "Royal National Park"
}