{
 "id": "872653",
 "text": "Savitribai Phule (3 January 1831 – 10 March 1897) was an Indian social reformer and poet from Maharashtra. Known as the \"first female teacher of India,\" she worked on improving the rights of women in India with her husband Jyotirao Phule. They started the first Indian girls school in Pune, at Bhide wada in 1848. She tried to end social class and unfair treatment based on sex in Indian society. She was an important person of the social reform in Maharashtra. == Early life == {1831-1897} Savitribai Phule was born on 3 January 1831 in the village of Naigaon in Satara District, Maharashtra. Her birthplace was about from Shirval and about from Pune. Savitribai Phule was the oldest daughter of Lakshmi (her mother) and Khandoji Nevase Patil (her father). They were from the Mali Community. Savitribai and Jotirao did not have any children of their own. It is said that they took Yashawant in their family. Yashawant was the son of a Brahmin woman whose husband had died. == Career == At the time of marriage, Savitribai was not able to read or write. Jyotirao taught Savitribai at their home. She completed her primary education with Jyotirao. She registered herself in two training programs to become a teacher. Later, Savitribai Phule started teaching girls at the Maharwada in Pune. Soon Savitribai and with Sagunabai started their own school at Bhide Wada. Sagunabai was a coach of Jyotirao Phule. Tatya Saheb Bhide was inspired by these works. School course at Bhide Wada included traditional western course of mathematics, science, and social studies. By the end of 1851, Savitribai and Jyotirao Phule were running three different schools for girls in Pune. These three schools had almost one hundred and fifty students registered. Teaching of these three schools was better than government schools. As a result of this, the number of girls in these schools went up to the number of boys in government schools. Savitribai and Jyotirao Phule's success came with much oppose. The opposers were the persons who did not like change. The Phules faced strong opposition from powerful castes (Brahmin) because they belonged to the week caste (Mali). Education was not for the Sudra castes for thousands of years. For this reason, Brahmins started to oppose works of Jyotirao and Savitribai. Savitribai and Jyotirao Phule were living at home of father of Jyotirao til 1849. Father of Jyotirao asked them to leave his home In 1849 because their work was a sin as per the Manusmriti and Brahmanical texts. They moved in the family of Usman Sheikh. Usman Sheikh was a friend of Jyotirao. In the 1850s, Savitribai and Jyotirao Phule established two educational trusts - The Native Female School, Pune and the Society for Promoting the Education of Mahars, Mangs, and Etceteras. These two trusts had many schools of Savitribai Phule. Jyotirao talked about Savitribai and his work in an interview. This interview was given to the Christian missionary periodical, Dnyanodaya, on 15 September 1853. He said She taught children from different castes. She opened a total of 18 schools with her husband. They also opened a care centre called Balhatya Pratibandhak Griha (literally, \"Child-killing Prohibition Home\") for pregnant rape victims. Balhatya Pratibandhak Griha helped deliver and save their children. == Death == Savitribai and her adopted son, Yashwant, opened a clinic. This clinic was for the victims of an outbreak of the bubonic plague (Third Pandemic). The clinic was in Pune. Savitribai died a heroic death. She tried to save the son of Pandurang Babaji Gaekwad. She came to know that Gaekwad's son had got the plague. Savitribai Phule ran to him. She carried him on her back to the hospital. In the process, she was infected. She died at 9:00pm on 10 March 1897. == References == Notes Citations == Further reading == * == Other websites == * Savitribai Phule at Google Arts & Culture Category:1831 births Category:1897 deaths Category:Indian writers Category:Feminists",
 "title": "Savitribai Phule"
}