{
 "id": "872645",
 "text": "Flinders Chase National Park is a national park in South Australia in Kangaroo Island south of Adelaide. The park has a size of 326 km² and is distributed over the three areas; Cape du Couedic and Rocky River, Gosse Lands and the Cape Borda Lighthouse in the west of the island. The park was founded in 1919. The closest town is Kingscote, about 110 km away. The main attractions of the park are the bizarre rocks of the Remarkable Rocks, the colonies of fur seals at Admirals Arch, and the lighthouse at Cape Borda from 1858. There are also numerous kangaroos and koalas in the park. == Wildlife == New Zealand fur seals, Australian fur seals and Australian sea lions can be found along the coast of the park. Showy land mammals are kangaroos, which are represented by two species. On the one hand by a special island subspecies of the western grey giant kangaroo and on the other hand by the derby wallaby . A purely endemic terrestrial mammal species found nowhere else on the island is the Kangaroo Island narrow-footed pouch mouse . At other mammals come koalas, platypus, pseudocheiridae, common brushtail possum, Small short-nosed bandicoot (Isodon oesulus obesulus), Tasmanian cercartetus, thin tail cercartetus, swamp rats (Rattus lutreolus), also a subspecies of the Australian bush rat (Rattus fuscipes greyi) and a special island subspecies of the short-billed hedgehog. In addition, eight species of bats live in the park. The koalas, platypus and ring-baggers were introduced from mainland Australia. The number of koalas has increased so much in recent years that many eucalyptus forests have been severely damaged. The national park administration tries to cope with the situation with sterilisation programs. In the national park there are also some species that do not belong to the original Australian fauna. These are goats, fallow deer, pigs, house cats, house rats and house mice . The kangaroo island emu was once endemic to the island, but in the 19th Century extinct. Reptiles are represented by Rosenberg's monitor lizard, dwarf copper head, black tiger otter, striped fin foot, various skinks, geckos and an agame (Ctenophorus decresii). Six species of frog are at home in the park. The leatherback turtle is found on the coasts. File:Kangaroo Island-kangaroo.jpg|Kangaroo Island Kangaroo, a subspecies of the Western Gray Giant Kangaroo File:Kangaroo Island kangaroos.jpg|Kangaroos near Karatta File:Australia kangaroo island echidna.jpg|Short-billed hedgehog File:Rocky River Trail SA.JPG|Landscape on the coast File:Flinders Chase NP 1.jpg|Bushland in the national park == Bushfires == At 6 December 2007, lightning bolts ignited a bushfire in which 19,542 ha bush burned in the national park. This corresponds to 60% of the total area. Even bigger fires raged over the turn of the 2019/2020 bushfire season, which destroyed around a quarter in the west of the island. The bushfires also largely destroyed Flinders Chase National Park, including the visitor centre.All bushfires in the state of New South Wales under control thanks to heavy rainfall, dated February 13, 2020, accessed March 26, 2020 Much of the rare wildlife was also a victim of the flames. == References == == Other websites == * Official website of the Flinders Chase National Park Category:National parks in Australia",
 "title": "Flinders Chase National Park"
}