{
 "id": "87272",
 "text": "Thelema is the English spelling of the Greek noun : \"will\", from the verb θέλω: to will, wish, purpose. Early Christian writings use the word to refer to the will of God,Rabelais, Francis de Sales and the Abbaye de Thélème by Alexander T. Pocetto, O.S. F.S., Allentown College of St. Francis de Sales, citing other writers. Online version here , retrieved from July 20, 2006. the human will,e.g. John 1:12-13 and even the will of God's opponent, the Devil.e.g. 2 Timothy 2:26 Thelema is also a way of life first written about by François Rabelais (16th century) in his famous books of fiction, Gargantua and Pantagruel.Chappell, Vere. What is Thelema? . Retrieved July 7, 2006. The core of this way of life was summed up in the phrase \"Do what thou wilt\" (\"fay çe que vouldras\" in the original old French). This idea was later put into practice in the mid 18th century by Sir Francis Dashwood at Medmenham.Mahendranath (1990). This Thelemic Law of Rabelais was revived by Aleister Crowley in 1904 when Crowley wrote The Book of the Law. This book contains both the word Thelema in Greek as well as the phrase \"Do what thou wilt.\" From this, Crowley took Thelema as the name of his own religion. Shri Gurudev Mahendranath wrote that Rabelais, Dashwood, and Crowley must share the honor of perpetuating Thelema. == Modern Thelema== ===Breadth of Thelemic thought=== The core of Thelemic thought is \"Do what thou wilt.\" People understand and apply this in different ways. For example, some people accept Crowley as a prophet. Other people regard Crowley's system to be only one form of Thelema. Crowley himself shared this view: :I admit that my visions can never mean to other men as much as they do to me. I do not regret this. All I ask is that my results should convince seekers after truth that there is beyond doubt something worth while seeking, attainable by methods more or less like mine. I do not want to father a flock, to be the fetish of fools and fanatics, or the founder of a faith whose followers are content to echo my opinions. I want each man to cut his own way through the jungle.Crowley 1979, ch.66 Many followers of Thelema learn and use other systems of spiritual thought, blending them according to their own will with Thelema. Most borrow freely from other traditions. For example, Nu and Had are thought to be the same as or similar to the Tao and Teh of Taoism, Shakti and Shiva of the Hindu Tantras, Shunyata and Bodhicitta of Buddhism, Ain Soph and Kether in the Qabalah.De LuposVoxfire (2004)Webster Like Crowley, other followers of Thelema make free use of the methods and practices of other traditions, including alchemy, astrology, qabalah, tantra, tarot, and yoga, according to their own wills. Some groups say that they are true to Crowley's system (such as A∴A∴ and Ordo Templi Orientis). Some groups build upon his teachings, expanding upon and extending them. For example, the Fraternitas Saturni (Brotherhood of Saturn), founded in 1928 in Germany, accepts the Law of Thelema, but extends it with the phrase \"Mitleidlose Liebe!\" (\"Compassionless love!\"). The Thelema Society, also in Germany, accepts Liber Legis and much of Crowley's work on magick, while also including the ideas of other thinkers, such as Friedrich Nietzsche, Charles S. Peirce, Martin Heidegger, and Niklas Luhmann. In America, the writings of Maggie Ingalls (Nema) have started a movement called Maat Magick, along with a group called the Horus-Maat Lodge, founded in 1979. This movement combines elements of Thelema with Nema's system based on the Egyptian goddess Ma'at. She wrote her own holy book titled \"Liber Pennae Praenumbra.\" They aim to combine the current Aeon of Horus with the future Aeon of Ma'at in which mankind will achieve balance. ===Modern Thelemic writings=== Most of Thelemic writing was written by Aleister Crowley. He wrote many books. Many of them were on the subject of Thelema. During his time, there were a few other people who wrote on the subject, including Charles Stansfeld Jones and J.F.C. Fuller. Since his death in 1947 only a few new writers have written on the subject: *Israel Regardie, who not only edited many of Crowley's works, but wrote a biography of him—The Eye in the Triangle—and penned many books on ritual and Qabalah, such as Garden of Pomegranates, Golden Dawn, Middle Pillar, and Tree of Life. *Kenneth Grant, who has written many books on Thelema and the occult, such as The Magical Revival, Aleister Crowley and the Hidden God, Outside the Circles of Time, and Hecate's Fountain. *Nema, whose Liber Pennae Praenumbra announces and explains the Ma'atian current has influenced Thelemites for over 25 years. She now has several books on Ma'atian Thelema including her book, Maat Magick. ==Thelema in comparative religion== Thelema has been attracting more attention in recent years from scholars of religion, especially those interested in new religious movements, contemporary Gnosticisms and Hermeticisms. References at the end of this article supply a few such sources. Perhaps the most unusual attempt was made by bishop Federico Tolli, in his German book Thelema – Im Spannungsfeld zwischen Christentum, Logentradition und New Aeon Leipzig, 2004. For Tolli, Thelema is to be regarded as the dialectical consequence of Christianity. Christianity for Tolli exists as a community in Christ, whereas Tolli sees Thelema as a necessarily individualistic response to the world. Taken from a 1938 theological dictionary (to the New Testament), the idea of 'salvation history' (Heilsgeschichte) has a great effect on Tolli's thought. Tolli regards Crowley's Heilsgeschichte as one in which the whole Universe (ergo the Will of God) is to combine (analogous to the Alchemical formula 'coagula'). \"Love\", in the form of combinatory attraction (\"Love is the law, love under will\"), is a universal principle – therefore akin to the concept of Natural religion. The main difference (for Tolli) is that in Christianity salvation of the entire Universe (\"Ganzheit\") cannot be made by 'solipsistic' man. The bishop sees Crowley as a failed – however talented – artist or \"Mystagogie\", but not as a \"Satanist\". It was Tolli who first said that the genuine meaning and idea of Thelema does not necessarily contradict the teachings of Jesus, as Crowley himself affirms. ==Related pages== *Magick *Svecchachara ==Notes== ==References== *Coppens, Philip (2006). Hell, no damnation. Retrieved July 21, 2006. *Crowley, Aleister. (1997). Magick: Book 4. 2nd ed. York Beach, Maine: Samuel Weiser. * *De Lupos, Rey. The Golden Topaz of Radiant Light in Silver Star , No. 1. Retrieved April 5 2005. *Del Campo, Gerald. Rabelais: The First Thelemite . The Order of Thelemic Knights. *Free Encyclopedia of Thelema (2005). Thelema . Retrieved March 12 2005. *Kaczynski, Richard (2002). Perdurabo: The Life of Aleister Crowley. Tempe, AZ: New Falcon Publications. *Mahendranath, Shri Gurudev (1991). The Scrolls of Mahendranath. Seattle: International Nath Order. LCCN 97132342. *Melton, J. Gordon (1983). \"Thelemic Magick in America.\" Alternatives to American Mainline Churches, ed. Joseph H. Fichter. Barrytown, NY: Unification Theological Seminary. *Starr, Martin P. (2003). The Unknown God: W.T. Smith and the Thelemites. Bolingbrook, IL: Teitan Press. *Sutin, Lawrence (2000). Do What Thou Wilt. New York, NY: St. Martin's Griffin. *Towers, Eric (1987). Dashwood: The Man and the Myth. Crucible. * van Egmond, Daniel (1998). \"Western Esoteric Schools in the Late Nineteenth and Early Twentieth Centuries.\" in van den Broek, Roelof and Hanegraaff, Wouter J. Gnosis and Hermeticism From Antiquity To Modern Times. Albany: State University of New York Press. *Voxfire, Thomas (2004). \"Something from Nothing: the Essence of Creation\" in Essays for the New Aeon . Retrieved April 5 2005. *Webster, Sam. Entering the Buddhadharma. Retrieved April 5 2005. * ==Other websites== *Thelema at the Internet Sacred Texts Archive – a collection of texts on the topic of Thelema *The Law of Thelema – by Alexander Duncan *Ashé Journal – Special Thelema Centennial Edition *Rabelais: The First Thelemite * Category:New religious movements Category:Occult",
 "title": "Thelema"
}