{
 "id": "872856",
 "text": "The Naracoorte Caves National Park is a national park in the southeast of the Australian state of South Australia, 313 km southeast of Adelaide, 83 km north of Mount Gambier and 15 km southeast of Naracoorte.Steve Parish: Australian Touring Atlas. Steve Parish Publishing Pty. Ltd. Archerfield QLD (2007). ISBN 978174193232-4. S. 69 1994, the area was declared a national park because of its extraordinarily extensive fossil finds and classified together with Riversleigh in Queensland as a UNESCO World Heritage Site. The natural world heritage area contains 26 caves on 3.05 km² area. == Facilities and sights == The park is a tourist attraction and has a campground, RV park, group accommodation, picnic areas and a cafe. The number of sights is huge. Cave tours are offered by trained guides. There you can see caves filled with a large number of interesting fossils. With the help of modern technology, visitors can be shown the inside of the normally inaccessible Bat Cave, where thousands of bats breed every year. There are also cave tours for adventurers, a number of special tours and special events. == Emergence == The limestone in the area was formed by corals and other marine life 200 million years ago when it was below sea level and again about 20 million years ago when the land was again below sea level. Since then, groundwater has loosened part of the limestone, creating the caves. These caves, like the Victoria Fossil Cave or the Blanche Cave, are often not far underground and holes opened up that posed dangers to the unwary. This created a remarkable collection of fossils. Mammals and other land creatures fell into the open holes and were unable to escape. The fossils were preserved in banks of earth washed and blown from the surface of the earth. In some places the fossil-bearing layer is up to 20 m thick. Some of these areas will be saved for future exploration when better methods of dating and reconstructing fossil records become available. The fossil traps are particularly important for research into the Australian megafauna. == References == == Sources == *Naracoorte Caves . ParksWeb: Wonambi Fossil Center. == Literature == *Joel Achenbach: Lost Giants . National Geographic. Issue 4, Volume 218 (October 2010). pp. 90–109 == Other websites == * Official website * Australian Fossil Mammal Site - Naracoorte . Department of Sustainablity, Environment, Water, Population and Communities. Australian Government * Australian Fossil Mammal Sites - (Riversleigh / Naracoorte) . UNESCO * Naracoorte Visitor Information Centre . Naracoorte Lucindale Tourism * Photos of the Naracoorte Caves by Andrew McMillan Category:National parks in Australia",
 "title": "Naracoorte Caves National Park"
}