{
 "id": "872897",
 "text": "Shafali Verma (born 28 January 2004) is an Indian cricketer who plays for the India women's national cricket team. She became the youngest cricket player from India at the age of 15. In June 2021, She became the most young player from India in all three formats (Test, One Day, T20) of international cricket. She is the right hand opening batsman of the Indian team. She is also a member of the India A Women team and the Birmingham Phoenix Women team. She is also sometimes a right-arm offbreak bowler. ==Early life== There were no cricket academies for girls in Rohtak. Shafali played cricket in a boy's academy when she was young. ==Career== Shahali played for Velocity in T20 Challenge of women before international cricket. On September 2019, she became a member of Indian women cricket team against South Africa. She played her first match for India against South Africa on 24 September 2019. She was the most young player to play for India in T20I match. On November 2019, she became the youngest cricketer who made 50 runs for India. She made 158 runs in five matches against the team representing the West Indies. She was selected as the player of the series. Shafali was a member of Indian women cricket team for the 2020 ICC Women's T20 World Cup. She was awarded with a central contract by the Board of Control for Cricket in India (BCCI). Shafali was a member of Test team of India against the England. She played her first Test match against England on 16 June 2021. The Test match was drawn. She was selected as the player of the match. On 27 June 2021, she played her first ODI match against England. ==Records == * 3rd Most runs in her first Test match (159) * 8th 90 runs in her first Test match (96) * 35th Most runs in a Test match (159) * 18th Youngest cricket player (17 years 139 days) * 17th Highest career batting average in T20 (27.70) * 36th Most fifties in T20 career (3) * 21st Highest partnerships for any wicket in T20 (143) * 12th Highest partnership for the first wicket in T20 (143) ==References== ==Other websites== * Category:2004 births Category:Indian cricketers Category:Living people Category:Sportspeople from Haryana",
 "title": "Shafali Verma"
}