{
 "id": "872898",
 "text": "The Brewarrina fish traps (Also known as Baiames Ngunnhu) are located in the town of Brewarrina on the Barwon River in the north west of New South Wales, around 800 km northwest of Sydney. It is the largest known Aboriginal fish trap facility in Australia. It is believed to be the oldest human construction in the world although it hasn't been confirmed yet. The fish traps are probably around 40,000 years old, although the exact date is not known.: Brewarrina Shire Council They are around 500 m long. They are in the Ngunnhu Aboriginal territory. The fish traps consisted of many small stone circles that could be separated by stone weirs. There the fish were led so that they could be caught. The design, complexity and size of the facility are unique in Australia. For this reason they are a national monument. Before the European settlement, the Aboriginals used the river for fishing. Stones were removed from the river by the settlers to allow paddle steamers to travel, and rocks were removed in the 1920s to be used for house foundations and roads. The steamships could not sail in the dry season. The Ngunnhu people had strong social, cultural and spiritual relationships with other Aboriginal groups, and they also allowed other Aboriginal countries to fish according to rules, times and periods. They were associated with the Aborigines of the Kamilaroi, Marowari, Paarkinji, Weilwan, Barbinja and Ualaria. The neighbouring Aboriginal countries were invited by Ngunnhu to cooroborees, ceremonies, initiations, trade and barter. The Ngunnhu attribute the possibility of fishing to the mythical Baiame, a dreamtime creature who created the landscape, lakes, rivers and beings. (PDF; 608 kB): Brewarrinna Aboriginal Fish Traps The plant is partly overgrown by reeds. The fish ladder was opened on June 3 2005 registered in the Australian National Heritage List because it was of particular historical importance for the social and cultural coexistence within the Aboriginals. == Other websites == * environment.gov.au (PDF; 42 kB): Site plan of the fish ladder == References == Category:Geography of New South Wales Category:Buildings and structures in New South Wales",
 "title": "Brewarrina Aboriginal Fish Traps"
}