{
 "id": "872918",
 "text": "The historic Darlington Probation Station is a UNESCO World Heritage Site located on Maria Island off the east coast of Tasmania, Australia. The camp is in the northwest of the island on Darling Bay in Maria Island National Park, where the former Darlington settlement was located. Since 1825 there was a camp on the island for prisoners who had committed serious crimes.Darlington Probation Station more information auf environment.gov.au (englisch), abgerufen am 11. Januar 2011 From 1842 to 1850 it was operated as one of two British penal camps, alongside the Cascades Female Factory, as an education camp. (englisch; PDF-Datei; 127 kB), abgerufen am 11. Januar 2011 == History == In 1825, the second convict colony in Van Diemens Land (now renamed as Tasmania) was established by Governor George Arthur with 50 convicts and a few soldiers on Maria Island, which was closed again in 1832. Despite the short time, several buildings were built, of which the Commissariat Store and the constructions of the convict camp, known as the Penitentiary, have been preserved. The convicts built a wood, shoe and clothes maker manufacture and tannery. The construction of a mechanised, water-powered clothing manufacture was remarkable. Because of several escape attempts and disciplinary problems, this penal colony was closed in 1832. The Port Arthur prison, which has now been established and could accommodate a large number of convicts, also played a role.artistwd.com: Maria Island Penal Establishment Retrieved 26 November 2011 Ten years later, the penal colony was reopened as a prison camp on the initiative of Lieutenant Governor Franklin in 1842, after repairing the existing buildings. When a second station opened, more than 800 convicts came to the island and more buildings were erected. Overcrowding created numerous problems and the stations were closed in 1850. Among the convicts was the Irish nationalist from the Young Ireland movement William Smith O'Brien, two Khoikhoi and five Maori who were detained there because of national conflicts over borders.artistwd.com: Maria Island Penal Establishment (englisch), abgerufen am 26. November 2011 ==Modern use== The camp has been in operation since 1 Registered in the Australian National Heritage List on August 1, 2007 and in, August 2010; one of eleven Australian Convict Sites Australian Convict Sites auf whc.unesco.org (englisch), abgerufen am 11. Januar 2011 recognised by UNESCO as a World Heritage Site. The accommodation station is one of the best preserved prison camp buildings from the early days of the Australian convict colony. There were 78 such camps in Tasmania. There are 13 buildings on Maria Island, some of which have been preserved and some of which are ruins. The buildings on the island reflect the system of labour discipline for convicts in the early British colonial times. In the convict camp there were strict rules and discipline with division into groups and according to training, the exercise of religious coercion and methods of rigid punishment. The Darlington Probation Station with this form of convict discipline with public work goes back to Franklin (1837 to 1843). In the camp there was a canteen and a classroom, a chapel and buildings for the accommodation of the priest and the religious teachers. The convicts' barracks and ruins were divided into separate rooms for well-behaving and rebellious convicts, where well-behaving convicts were housed in bedrooms and the others in separate rooms. The single cells testify to the practiced method of punishment of isolation. == References == == Other websites == * World Heritage on Maria Island Category:Australian Convict Sites Category:Australian National Heritage List Category:Buildings and structures in Tasmania Category:Protected areas of Tasmania",
 "title": "Darlington Probation Station"
}