{
 "id": "873082",
 "text": "Vatnajökull National Park (Icelandic: Vatnajökulsþjóðgarður) is one of three national parks in Iceland. It contains the entire Vatnajökull glacier and the former Skaftafell National Park in the southwest and the former Jökulsárgljúfur National Park in the north. What's special about the Vatnajökull National Park lies mainly in its great variety of scenic features, which are created by rivers, glaciers, volcanism and geothermal activity. == History == Vatnajökull National Park was opened in June 2008. It had an area of 12,000 km². Since its expansion to include Lakagígar, Langisjór and Krepputunga, the park now contains 14,200 km², or around 14% of Iceland's land area. The only park in Europe bigger than Vatnajökull National Park is the Jugyd Wa National Park in Russia. On the 25th of June 2017 the national park was upsized by another 189 km². The Jökulsárlón and parts of the Fjallsárlón and Breiðamerkursandur have been placed under protection by the Environment Minister Björt Ólafsdóttir. In 2019 the park was declared a World Heritage Site by UNESCO. == Geography and geology == The Vatnajökull has a surface area of 8,100 km² Europe's largest glacier. The thickness of the ice is between 400 to 800 m, at the thickest point the ice is 950 m. The glacier ice covers a multitude of mountains, valleys and plateaus. It even covers some active central volcanoes, of which Bárðarbunga is the largest and Grímsvötn the most active. The ice masses extend from over 2000 m above sea level up to 300 m below sea level. Nowhere else in Iceland, except on the Mýrdalsjökull glacier, does so much precipitation fall or so much water flow into the sea as on the south side of Vatnajökull. In fact, so much water is currently stored in Vatnajökull that Ölfusá, Iceland's river with the largest volume of water, would take over 200 years to transport this amount of water into the sea. The landscape that surrounds the glacier is very varied. In the north, the highland plateau is crossed by glacier rivers, which swell strongly in summer. The volcanoes Askja, Kverkfjöll and Snæfell dominate this area, as well as the volcanic table mountain Herðubreið. Long ago, huge glacial floods cut the Jökulsárgljúfur gorge into the northern part of this plateau. The mighty Dettifoss waterfall still thunders into the top of this gorge. The south side of Vatnajökull is known for many high mountain ridges, between which glacier tongues flow down into the valleys. The southernmost part of the glacier covers the central volcano Öræfajökull and Iceland's highest mountain peak, Hvannadalshnjúkur. Protected by the high ice masses, the Skaftafell, which is mostly grown over by plants, overlooks the black sands deposited to the west of the Skeiðará river. The sand is mostly ash, which comes from the frequent eruptions of the Grímsvötn. To the south of the park is Morsárfoss, the highest waterfall in Iceland. The west of Vatnajökull is also largely dominated by volcanic activity. Two of the world's largest fissures and lava eruptions in historical terms took place there: near Eldgjá (934) and Lakagígar (1783–1784). Vonarskarð, northwest of the glacier, is a colourful, well-tempered area and is a watershed between north and south Iceland. == Climate == The weather can vary considerably in an area as large as that of the national park, especially since there is a large difference in altitude. Precipitation in the lower areas south of the Vatnajokull Ice Cap varies between 1,000 mm and 3,000 mm per year. The temperatures are between 10 °C and 20 °C in summer, while winters are rather mild (the thermometer rarely falls below −10 °C and the temperature is often well above freezing point). On the mountains and the ice cap itself, annual rainfall is between 4,000 and 5,000 mm, most of it falls as snow. The thickness of the snowpack on Öræfajökull is between 10 and 15 m. Part of the snow melts while the rest of the snow forms the glacier ice. This process takes place everywhere above the snow line on the Vatnajökull ice cap. Temperatures on the southern part of the ice cap are almost always below zero and can drop to −20 °C in winter or −30 °C fall. Strong winds and storms are normal. The further north you get behind the ice cap, the lower the annual rainfall. To the northeast of the ice cap, it falls to between 350 and 450 mm per year, which is the lowest rainfall in Iceland. The precipitation rises again closer to the north coast and in parts of the highlands around Askja. The temperature can drop sharply on clear and windless days in winter. South winds generally lead to little or no precipitation in the north, which is associated with higher temperatures. North winds bring clouds with them, resulting in colder and wetter weather in the north of the country, while the south remains sunnier and milder. The same applies to westerly or southwest winds, which bring warmer weather to the east. The opposite is the case when the wind comes from the east: it leads to cold and precipitation in the east and better weather in the west of Iceland. This is the result of the foehn wind : moist, cold air rises near the highlands, condenses and falls as rain over the highlands, while warmer, drier air falls down into the valley on the other side. The temperature difference can be 10 °C or more. == Services == Vatnajökull National Park is divided into four areas, each of which is taken care of on its own. The northern area is the northwestern part of the Vatnajökull, the Askja Caldera and its surroundings, the Jökulsárgljúfur gorge and parts of the Jökulsá-á-Fjöllum river valley. A visitor centre and a camp site are in Ásbyrgi and another camp site is at Vesturdalur. In addition to the Kverkfjöll Mountains and the northeastern part of Vatnajökull, the eastern area also includes the foothills of Snæfellsöræfi. A visitor centre is in Skriðuklaustur. The southern area is the southeastern part of Vatnajökull from the Lómagnúpur Mountains in the west to Lón and Lónsöræfi in the east. A visitor centre and a campsite are in Skaftafell. Information centres in Höfn, Hoffell, Hólmur and Skálafell also cooperate with the national park administration. The western area is the southwestern part of Vatnajökull and large areas outside the glacier, including the Lakagígar craters and Langisjór. An information centre is in Kirkjubæjarklaustur and is run jointly by the national park and the local community. The visitor centre in Skaftafell is open all year round. The centres in Ásbyrgi and Skriðuklaustur are open from the beginning of May to September, but can also be opened in winter upon request. However most parts of the national park in the highlands cannot be reached in winter. National park employees carry out controls and offer courses in the highlands. The opening times of the centres vary from area to area, with the first employees driving into the highlands as soon as the main roads are clear. This happens around mid-June and they leave the area around the end of September. During the summer, employees offer short hikes with explanations on natural history. From mid-June to mid-August they conduct daily interactive hikes in Àsbyrgi and Skaftafell. In the highlands there are daily hikes from the beginning of July to mid-August. == Literature == * Hjörleifur Guttormsson, Oddur Sigurðson: Leyndardómur Vatnajökuls. Viðerni, fjöll and byggðir. Stórbrotin náttúra, eldgos og jökulhlaup. Reykjavík (Fjöll og firnindi) 1997, ISBN 9979-60-325-9 ==References== ==Other websites== * * Map of Vatnajökull National Park (PDF file; 6.28 MB) * Nature conservation authority: draft for Vatnajökull National Park, isl. Category:World Heritage Sites in Europe Category:National parks in Europe",
 "title": "Vatnajökull National Park"
}