{
 "id": "87332",
 "text": "Antidifferentiation (also called indefinite integration) is the process of finding a certain function in calculus. It is the opposite of differentiation. It is a way of processing a function to give another function (or class of functions) called an antiderivative. Antidifferentiation is like integration—but without limits. This is why it is called indefinite integration. When represented as single letters, antiderivatives often take the form of capital roman letters such as F and G. In general, an antiderivative is written in the form \\int f(x) \\ dx, where: * The long S, \\int, is called an integral sign. In integration, the integral sign has numbers on it. Those numbers tell you how to do the integration. Antiderivatives are different. They do not have numbers on their integral signs. *x is the equation you are integrating. * The letters dx mean \"with respect to x\". This tells you how to do the antidifferentiation. == Simple antidifferentiation == A function of the form ax^n can be integrated (antidifferentiated) as follows: * Add 1 to the power n, so ax^n is now ax^{n+1}. * Divide all this by the new power, so it is now \\frac{ax^{n+1}}{n+1}. * Add the constant c, so it is now \\frac{ax^{n+1}}{n+1} + c. This can be shown as: \\int ax^n\\ dx = \\frac{ax^{n+1}}{n+1} + c (also known as the power rule of integral) When there are many terms, we can integrate the entire function by integrating its components one by one: \\int 2x^6 - 5x^4\\ dx = \\frac{2x^7}{7} - \\frac{5x^5}{5} + c = \\frac{2}{7}x^7 - x^5 + c (This only works if the parts are being added or taken away.) === Examples === :\\int 3x^4\\ dx = \\frac{3x^5}{5} + c :\\int x + x^2 + x^3 + x^4\\ dx = \\frac{x^2}{2} + \\frac{x^3}{3} + \\frac{x^4}{4} + \\frac{x^5}{5} + c :\\int \\frac{1}{x + 4}\\ dx = \\ln |x + 4| \\times 1 + c = \\ln |x + 4| + c Changing fractions and roots into powers makes it easier: :\\int \\frac{1}{x^3}\\ dx = \\int x^{-3}\\ dx = \\frac{x^{-2}}{-2} + c = -\\frac{1}{2x^2} + c :\\int \\sqrt{x^3}\\ dx = \\int x^{\\frac{3}{2}}\\ dx = \\frac{x^{\\frac{5}{2}}}{\\frac{5}{2}} + c = \\frac{2}{5}x^{\\frac{5}{2}} + c = \\frac{2}{5}\\sqrt{x^5} + c == Integrating a bracket (\"chain rule\") == To integrate a bracket like (2x+4)^3, a different method is needed. It is called the chain rule. It is like simple integration, but it only works if the x in the bracket is linear (has a power of 1), such as x or 5x—but not x^5 or x^{-7}. For example, \\int (2x+4)^3\\ dx can be determined in the following steps: * Add 1 to the power 3, so that it is now (2x+4)^4 * Divide all this by the new power to get \\frac{(2x+4)^4}{4} * Divide all this by the derivative of the bracket \\left (\\frac{d(2x+4)}{dx} = 2 \\right ) to get \\frac{(2x+4)^4}{4 \\cdot 2} = \\frac{1}{8}(2x+4)^4 * Add the constant c to give \\frac{1}{8}(2x+4)^4 + c === Examples === \\int (x+1)^5\\ dx = \\frac{(x+1)^6}{6 \\times 1} + c = \\frac{1}{6}(x+1)^6 + c \\left ( \\because \\frac{d(x+1)}{dx} = 1 \\right ) \\int \\frac{1}{(7x+12)^9}\\ dx = \\int (7x+12)^{-9}\\ dx = \\frac{(7x+12)^{-8}}{-8 \\times 7} + c = -\\frac{1}{56}(7x+12)^{-8} + c = -\\frac{1}{56(7x+12)^8} + c \\left ( \\because \\frac{d(7x+12)}{dx} = 7 \\right ) ==Related pages== * Fundamental theorem of calculus * Integral * Numerical integration * Partial fraction decomposition == References == Category:Mathematical analysis Category:Calculus",
 "title": "Antiderivative"
}