{
 "id": "873322",
 "text": "Sans is a Fictional character from Undertale. While usually a comic relief character and NPC, he is also the Final boss if the player tries the \"genocide route\" of the game. His name comes from the Comic Sans font, which is used for most of his in-game dialogue. He also appears multiple times in Deltarune. (Sans also won Tumblr \"Sexy Man\" on the 8th of September 2022.) ==Appearance== Sans is a Skeleton that wears a blue jacket, black shorts with white stripes, and white slippers. In some official art he instead wears pink slippers or blue sneakers. Before Undertale, he had moved into his house in Snowdin from an unknown location with his brother Papyrus. Papyrus's dream is to become a royal guardsman, ==References== == Sans' Gaster Blasters == Sans the Skeleton, a character from the hit game UndertaleUndertale is a 2015 2D role-playing video game by Toby Fox,Robert F. \"Toby\" Fox (born October 11, 1991) is an American video game developer and video game music composer. is one of the most famous characters in the fandom due to his very hilarious humor and his battle in the game's genocide route. Out of all the monsters in the underground, only Sans can cast a gaster blaster.A Gaster Blaster is one of Sans' special attacks. Meaning not only is he the gaster blaster caster, but he is also the gaster blaster master caster. Furthermore, about his ability to cast gaster blasters, Sans being the very bone-lazy skeleton he is, with examples like sleeping in the job and not doing his task of capturing the human and taking breaks ever so often, Sans is the only monster who can move a single inch to dodge the attacks of the player, and he is proven to be very fast at dodging attacks and casting multiple gaster blasters. For then, he is the gaster blaster master caster faster. Even worse, due to the many gaster blasters he can spawn, even spawning them in a circle, it can create quite a disaster, wrecking the pillars and walls of the judgment hall.The judgement hall is the place where the Sans fight in the genocide-route happens. This room is near the barrier. Which makes him the gaster blaster master caster faster disaster. Last of all, because of how disastrous his gaster blasters are, what is needed for them is plaster. Which is how it became a gaster blaster master caster faster disaster plaster. FR FR!!! Category:Fictional characters introduced in 2015 Category:Video game characters Category:Video game memes",
 "title": "Sans (Undertale)"
}