{
 "id": "873350",
 "text": "Catalonia was first settled during the Middle Palaeolithic era. The area was occupied by the Iberians and Greeks established several colonies on the coast before the Roman conquest. It was the first area of Hispania conquered by the Romans. It then came under Visigothic rule after the collapse of the western part of the Roman Empire. In 718, the Umayyad Caliphate occupied the area and became a part of Muslim ruled al-Andalus. The Frankish Empire conquered the area from the Muslims. It created a buffer zone of Christian counties against Islamic rule known as the Marca Hispanica. In the 10th century the County of Barcelona became progressively independent from Frankish rule. In 1137, Ramon Berenguer IV, Count of Barcelona accepted King Ramiro II of Aragon's proposal to marry Queen Petronila. Thus they united the dinasties of the County of Barcelona with the Kingdom of Aragon and they created the Crown of Aragon. Meanwhile, the County of Barcelona and the other Catalan counties adopted a common polity known as Principality of Catalonia.Sesma Muñoz, José Angel. La Corona de Aragón. Una introducción crítica. Zaragoza: Caja de la Inmaculada, 2000 (Colección Mariano de Pano y Ruata - Dir. Guillermo Fatás Cabeza). . Catalonia contributed to the expansion of the Crown's trade and military, most significantly their navy. The crisis of the 14th century, the end of the reign of House of Barcelona and a civil war (1462–1472) weakened the role of the Principality in Crown and international affairs. The marriage of Ferdinand II of Aragon and Isabella I of Castile in 1469 created a dynastic union between the Crowns of Aragon and Castile. However, both kingdoms kept their own laws, institutions, borders and currency. In 1492 the Spanish colonization of the Americas began, political power began to shift away towards Castile. The economic crisis, the peasants' revolt and tensions between Catalan institutions and the Monarchy caused the Reapers' War (1640–1652). The Principality of Catalonia maintained its political status, but it lost it after the War of Spanish Succession (1701–1714). Following Catalan surrender on 11 September 1714, the king Philip V of Bourbon, inspired by the model of France, imposed a unifying administration across Spain. He suppressed the Crown of Aragon and enacted the Nueva Planta decrees, banning the main Catalan political institutions and rights. These led to the eclipse of Catalan as a language of government and literature. Catalonia experienced economic growth. This was reinforced in the late 18th century when Cádiz's trade monopoly with American colonies ended. In the 19th century Catalonia was very affected by the Napoleonic and Carlist Wars. The Napoleonic occupation and subsequent war in Spain began a period of political and economic turmoil. In the second third of the century, Catalonia became a center of industrialization. Thanks to its wealth from the industrial expansion, Catalonia experienced a cultural renaissance. This happened at the same time as nationalism and several workers movements (particularly anarchism) appeared. In the 20th century, Catalonia enjoyed and lost varying degrees of autonomy. The Second Spanish Republic established Catalan self-governance and the official use of the Catalan language. The Republican defeat established the dictatorship of Francisco Franco. During this time, the autonomy was suppressed. Between 1959 and 1974 Spain experienced an economic expansion known as the Spanish Miracle. Catalonia prospered as Spain's most important industrial and tourist area. In 1975 Franco died, bringing his regime to an end. The new democratic Spanish constitution of 1978 recognised Catalonia's autonomy and language. It regained considerable self-government. In the 2010s there have been growing calls for Catalan independence. == References == == Bibliography == * Category:Catalonia",
 "title": "History of Catalonia"
}