{
 "id": "873549",
 "text": "Shivani Kataria is an Indian swimmer. She was born on 27 September 1997 in Haryana. She swims in the women's 200 meter race using the freestyle swimming stroke. She represented India at 2016 Summer Olympics. She has also won many medals at South Asian Games and Asian Age Group Championship. == Early life == Shivani lived all her life in Gurugram (Gurgoan). She went to school at DAV Public School,Gurgoan . At the age of 6, she started swimming in a summer camp at Baba Gang Nath Swimming Centre near her house. Her parents supported her. She took her initial training under Mr. Yadav. Under his guidance, she participated in various district level competitions. She earned a bronze medal at CBSE National, Gujarat. In 2012, she decided to become a professional swimmer. She started swimming 4 hours every day along with hard training. == Career == Shivani finished sixth in the 200m freestyle at the 2013 Asian Youth Championships. She won a gold medal at the 2016 South Asian Games. In 2015, she trained for a year at the FINA camp at Thyanpura in Phuket, Thailand. She was titled B Cart after finishing with a clock time of 2:04:00. This gave her a lot of confidence to compete in the Summer Olympics in 2016. === 2016 Summer Olympics === Shivani was selected as India's wildcard entry by Digambar Kamat for the Rio Olympics. Digambar Kamat was the president of Swimming Federation of India (SFI) at that time. She made many headlines when she successfully got qualified for the Rio Olympics. With her qualification to the Olympics, she became the first Indian woman to participate in the Summer Olympics. She finished with a clock time of 2:09:30 in the Women’s 200 m freestyle event but she was failed to qualify for the semi-finals. She holds most of India's national records in swimming. From the Rio Games, she hoped to motivate young Indian swimmers to pursue a career in swimming and join her at Tokoyo Olympics. == Records == Swimming Records Event Name Time Competition 200m freestyle Shivani Kataria 2:04.34 2015 Asian Age Group Championships 4x100m freesyle relay Rujuta Khade, Maana Patel, Divya Satija, Shivani Kataria 4:00.76 2019 Asian Age Group Championships 4x100m medley relay Maana Patel, Chahat Arora, Divya Satija, Shivani Kataria 4:26.69 2019 Asian Age Group Championships 4x100m freestyle relay (Mixed ) Srihari Nataraj, Maana Patel, Shivani Kataria, Virdhawal Khade 3:42.56 2019 Asian Age Group Championshps 4x100m medley relay ( Mixed ) Srihari Nataraj, Prema Selvaraj, Divya Satija, Shivani Kataria 4:04.15 2019 Asian Age Group Championships ==References== Category:1997 births Category:Living people Category:Indian swimmers",
 "title": "Shivani Kataria"
}