{
 "id": "873525",
 "text": "is an animated television series, part of Nippon Animation's World Masterpiece Theater, The series itself is popular in The Philippines, France, South Korea, Southeast Asia, India, Taiwan, Germany, Italy, Spain, Poland and the Arab World. ==Characters== ===Main characters=== ; :* :The story's protagonist, the daughter of Captain Ralph Crewe, who runs a diamond mine in British raj, therefore she was nicknamed as \"Diamond Princess\". Brought to Miss Minchin's seminary in London to learn how to be a proper lady, after being raised in India. :At the age of four, she lost her mother. Due to being pampered and doted on her entire life, Sarah's knowledge of the world is limited, but she is still a very friendly girl. :After her father died and she was left destitute, Miss Minchin forced Sarah to work as an unpaid servant in the seminary, but Sarah instead feels like that she is a princess inside. She refuses to lose hope and remains thoughtful and compassionate. After persistent bullyings, she was falsely accused of arson and expelled from Miss Minchin's seminary, where she was taken over by Peter's house. Eventually Sarah was taken over by Tom Carrisford, and her father Ralph's bankruptcy was cancelled and she became rich again. ; :* :The main antagonist is severe headmistress of the seminary where Sarah is sent to. :Minchin established the seminary from the plebeian birth, she hated Sarah due to the wealthy birth. Minchin was swayed by the selfishness of Sarah's father Ralph and was forced to prepare a servant, a horse and a special room for Sarah. :Minchin hid hatred to Sarah due to Ralph's vast fortune and the appearance of her seminary and herself. When Sarah was reduced to poverty and an orphan, Miss Minchin stopped masking hatred and persistently maltreated Sarah. ; :*voiced by: Mie Suzuki :A country girl who comes to work at Miss Minchin's seminary in order to support her family. :Despite her situation, Becky is optimistic and something of a dreamer. She is maltreated by Miss Minchin and her fellow staff, but befriended by Sarah. ; :* :The secondary antagonist. A daughter of a petroleum new rich of the United States, and a prideful and very manipulative girl. :Lavinia was originally the most popular student at Miss Minchin's seminary, and thus becomes madly jealous when Sarah begins to get more attention than her. Even when Sarah was reduced to a servant, Lavinia continued to make her life miserable. The reason why she hated Sarah is \"calm even if she has fallen\".From 39th episode. :When Sarah became rich again, with Lavinia telling Sarah that \"When you become the Diamond Queen, I will be the wife of the President of the United States.\" :In \"bullyers\" in Japanese mangas and animes, she is the second most well known after Gian in \"Doraemon\". ; :* :A street-smart boy who becomes Sarah's carriage driver when his father cannot accept the job. :He was fired when Ralph died and Sarah fell to a penniless, after this he was employed in another workplace. Peter thinks very highly of Sarah, and continued to call her \"ojōsama\" (princess) even after her fall to hired help and harbours a crush on her. ===Servants & Students of Miss Minchin's seminary=== ; :* :A plump girl who becomes one of Sarah's friends after Sarah defends her from Lavinia's abusive treatment towards her. :Ermengarde frequently does poorly in her studies, while her father, a university professor, pushes her to excel. She has an aunt, , who is somewhat absentminded, but is quite skilled in herbalism, which proves pivotal in curing Sarah when she becomes seriously ill. ; :* :The youngest student at the seminary who is four years old. At first, Lottie acts contrary, but the little girl calms down significantly after Sarah becomes her surrogate mother. She is a crybaby, and screaming as \"Sarah Mom\" every time a certain thing. ; :* :One of Lavinia's friends. She and Gertrude are initially somewhat in awe of Sarah, much to Lavinia's consternation. But once Sarah is demoted to live-in help, they willingly join in Lavinia's tormenting of Sarah. ; :* :One of Lavinia's friends. ; :* :A harsh head maid. ; :* :A chef that is picky on what he cooks. Like Molly, he is also harsh on other servants, especially Becky. ; :* :Miss Minchin's younger sister. The personality is gentle but submissive. Amelia was raised by her elder sister Maria Minchin and her aunt, so she cannot resist Maria Minchin. ; :* :The Miss Minchin seminary's French teacher. He is impressed by Sarah's aptitude at speaking French from the start and is the only member of the faculty who continues to treat Sarah with unqualified kindness and civility after her demotion. He was expelled from the Miss Minchin seminary's due to Lavinia's dissatisfaction that \"He patronizes Sarah who has fallen to a servant\". ; :* :A corporate lawyer at Miss Minchin's seminary. He invested in Ralph's diamond mine, and is more obsessed with Ralph's diamond mine than Miss Minchin's seminary. When the diamond mine went bankrupt and Ralph died of fever, he confiscated Sarah's property and personal belongings. ===Relatives and other people=== ; :* :Sarah's devoted father. He invests in a diamond mine in India, but finds them failed, leaving himself and therefore Sarah, utterly bankrupt. He died from fever shortly after. ; :* :Lavinia's father, a petroleum new rich of the United States. He is basically generous to his daughter Lavinia, but strict about terrible behavior. When Lavinia tried to make Sarah a servant, he slapped Lavinia and blocked it. ; :* :Lavinia's mother. She has the same prideful personality as her daughter Lavinia. ; :* :A lifelong friend of Ralph Crewe who convinced him to invest in the Indian diamond mine. Believing himself guilty for Ralph's death, Carrisford makes it his mission to find Sarah and reinstate her wealth. At the end, he took over Sarah. ; :* :An Indian man who serves Tom Carrisford. ; :* :Mr. Carrisford's solicitor and confidant. He journeys across Europe to find Sarah Crewe in the bedridden Carrisford's stead. ; :* :Mr. Carmichael's polite and generous son who befriends Sarah, unaware of her connection to his father's client. ; :* :Mr. Carmichael's daughter, an elder sister of Donald Carmichael. ; :* :Becky's younger brother. ; :* :Becky's younger sister. ; :An unnamed member of the palace guards who helps Sarah pick up the potatoes during a rainy day, but he doesn't speak. ===Animal characters=== ; :* :A domestic cat of Miss Minchin's seminary. ; :* :A parrot that Sarah brought from India at the time of admission. The cliché is \"Sarah\". ; :A horse that Ralph kept in Minchin. After Ralph's death, this horse was confiscated by Mr. Barrow. ; :Ram Dass'es mischievous monkey. == References == == Other websites == * Nippon Animation's official website for Princess Sara * * Category:Children's television series Category:1980s television series Category:Television series set in London",
 "title": "Princess Sarah"
}