{
 "id": "873515",
 "text": "The Mitchells vs. the Machines is a 2021 American science fiction computer- animated comedy movie made by Netflix. It stars the voices of Abbi Jacobson, Danny McBride, Maya Rudolph, Eric André, Olivia Colman, Fred Armisen, Beck Bennett, John Legend, Chrissy Teigen, Blake Griffin, and Conan O'Brien. ==Plot== Katie Mitchell is a quirky aspiring filmmaker in Kentwood, Michigan, who often clashes with her nature-obsessed and technophobic father Rick, and has recently been accepted into film school in California. The evening before Katie leaves, Rick accidentally breaks her laptop after a fight over one of Katie's previous short films, leading the family to fear their relationship will forever be strained. To try to prevent this, Rick decides to cancel Katie's flight and instead take her, her mother Linda, younger brother Aaron, and family dog Monchi on a cross-country road trip to her college as one last bonding experience. Meanwhile, technology entrepreneur Mark Bowman declares his highly intelligent AI PAL obsolete as he unveils a new line of home robots to replace her. In revenge, PAL orders all the robots to capture humans worldwide and launch them into space. The Mitchells manage to avoid capture at a roadstop café in Kansas. Rick decides that his family should stay put in the café for their own safety, but Katie convinces him to help save the world instead. They meet two defective robots, Eric and Deborahbot 5000, who tell the family they can use a kill code to shut down PAL and all the robots. The Mitchells make it to a mall in eastern Colorado to upload the kill code, but PAL chip-enabled appliances attempt to stop them. Katie tries to upload the kill code, but is stopped when a giant Furby pursues the family. They ultimately trap and defeat the Furby, destroying a PAL router in the process, which disables the hostile devices but stops the kill code from uploading. On the way to Silicon Valley to upload the kill code directly to PAL, Linda reveals to Katie that she and Rick had originally lived in a cabin in the mountains years ago as it was his lifelong dream before he gave up on it. Upon arriving in Silicon Valley, the Mitchells disguise themselves as robots and head to PAL Labs HQ to shut it down, but PAL manipulates them by revealing surveillance footage from the café of Katie telling Aaron in secret that she was pretending to have faith in Rick so that he would take them to upload the kill code. As a heartbroken Rick sees this, the Mitchells fail to reach PAL's lair and Rick and Linda are captured by PAL's stronger and smarter robots. PAL then reprograms Eric and Deborahbot to obey her, while Katie, Aaron, and Monchi escape. Katie discovers Rick's recordings of her childhood on her camera, realizing that Rick gave up on his lifelong dream to give his daughter a normal life. In the meantime, Rick reflects on his actions after seeing one of Katie's videos that mirrors his relationship with Katie. Reinvigorated, Katie and Aaron infiltrate PAL Labs HQ again, this time using Monchi to malfunction the robots, as his appearance causes an error in their programming. With help from Mark, Rick and Linda free themselves and plan to upload Katie's home movie of Monchi to short-circuit the robots. However, Rick is outnumbered by the robots when he is about to upload the video, while Katie and Aaron are captured. Facing PAL to justify saving humanity, Katie explains that no matter how hard her family struggles, they will always stay connected despite how different they are. PAL rejects this reasoning and drops Katie from her lair. Eric and Deborahbot, having been inspired by Rick's \"reprogramming\" himself that allowed him to use a computer, revert to their malfunctioning states and upload Katie's home movie, saving her and helping the rest of the Mitchells. The family bands together to fight the rest of the robots. Katie eventually destroys PAL by dropping her into a glass of water, freeing all the humans and disabling the remaining robots. A few months after the uprising, Katie and her family arrive at her college as she shares one last goodbye with them. She later joins them on another road trip with Eric and Deborahbot to Washington, D.C. to accept the Congressional Gold Medal. ==Cast== * Abbi Jacobson as Katie Mitchell, an aspiring filmmaker who is the daughter of Rick and Linda, and Aaron's older sister.Coming to Netflix: 'The Mitchells vs. the Machines,' from the Makers of 'Gravity Falls' * Danny McBride as Rick Mitchell, the nature-obsessed and technophobic father of Katie and Aaron, and Linda's husband. * Maya Rudolph as Linda Mitchell, the mother of Katie and Aaron, and Rick's wife. * Mike Rianda as Aaron Mitchell, the dinosaur-loving son of Rick and Linda, and Katie's younger brother. ** Rianda also voices a talking dog, the Furbies, a Giant Furby and a Wi-Fi enthusiast. * Eric André as Dr. Mark Bowman, a scientist who is the founder of PAL Labs and creator of PAL. * Olivia Colman as PAL, a ruthless, arrogant and maniacal rogue virtual assistant created by Mark, who wants to exact revenge on humankind after being discarded as obsolete. * Fred Armisen as Deborahbot 5000, a damaged PAL Max robot from PAL Labs who helps the Mitchells. * Beck Bennett as Eric, another damaged PAL Max robot from PAL Labs who helps the Mitchells. Bennett also voices the other PAL Max robots in the film. * Chrissy Teigen as Hailey Posey, the Mitchells' neighbor and Jim's wife who Linda has often tried to get the respect of. * John Legend as Jim Posey, the Mitchells' neighbor and Hailey's husband. * Charlyne Yi as Abbey Posey, the dinosaur- loving daughter of the Mitchells' neighbors, Jim and Hailey Posey, and Aaron's crush. * Blake Griffin as PAL Max Prime, a sleek robot from PAL Labs created by PAL that serves as an upgraded version of the PAL Max line. * Conan O'Brien as Glaxxon 5000, a PAL Max robot from PAL Labs who appears in the Foolish Human Air video. * Doug the Pug as Monchi, the Mitchell family's pet dog. * Melissa Sturm as Sarge == Other websites == * * == References == Category:2021 science fiction movies Category:2021 computer-animated movies Category:2021 comedy movies Category:American science fiction movies Category:American animated movies Category:American comedy movies Category:Robot movies Category:Sony Pictures Animation movies",
 "title": "The Mitchells vs. the Machines"
}