{
 "id": "873548",
 "text": "The Moses Code is a 2008 esoteric documentary. It was produced by Drew Heriot, who already worked as a director on The Secret, the predecessor of The Moses Code. The world premiere took place on 5. April 2008, as part of a private cinema screening, in the presence of director James Twyman, producer Drew Heriot and James Van Praagh, one of the speakers shown in the movie. == Plot == In contrast to The Secret, The Moses Code is not limited to the fulfillment of the mostly spiritually value-free needs of an unsatisfied ego who is fixated on money and power, but rather deals with the possibilities of how this “knowledge” can be used for the benefit of people. The basis for understanding this law, which should lie in the field effects known from quantum physics, are explained using examples. It is believed that Moses received a \"code of creation\" from God to work all the miracles spoken of in the Bible. This code is also called the \"Law of Attraction\" or \" law of attraction called\". === The main speakers === So-called \"spiritual teachers\" accompany James Twyman in his movie: * Debbie Ford (bestselling author, teacher) * Neale Donald Walsch (bestselling author, teacher, radio presenter) * Michael Beckwith (Founder and Managing Director, Agape Spiritual Center) * Iyanla Van Zant (author, speaker, teacher) * Cheryl Richardson (bestselling author, speaker, radio / TV host) * James Van Praagh (medium, writer, executive producer on Ghost Whisperer ) * Harville Hendrix (hospital chaplain, counselor, author, speaker) * Mary Morrissey (writer) (teacher, writer, counselor) * Gregg Braden (bestselling author, scientist) * Joe Dispenza, DC (Writer, Editor) * Diana Cooper (seminar leader, author) * John Holland (medium, spiritual teacher) * Sonia Choquette (Spiritual Teacher, Medium, Best-Selling Author) * Robert Ohotto (intuitive astrologer) * Les Brown (speaker, entrepreneur, bestselling author) * Anakha Coman (Sacred Heart mystic, medium, motivated speaker) * Vivian Glyck (author, founder and managing director of the Just Like My Child Foundation ) * Mikki Willis (filmmaker, visionary) Among them are a few who have already appeared in the movies The Secret and What the Bleep Do We Know. == Director == James Twyman is both the writer of the book and the director of the movie. == Leading roles == Debbie Ford, Neale Donald Walsch, Joe Dispenza, James Van Praagh, Mary Manin Morrissey and others. == Movie theater == With a few exceptions, the movie will not be shown in cinemas. The German-language DVD has been around since March 6. The license holder of the performance rights is HORIZON FILM Distribution GmbH. Category:American documentary movies Category:2008 documentary movies",
 "title": "The Moses Code"
}