{
 "id": "873737",
 "text": "Tosin \"OloriSuperGal\" Ajibade (Oluwatosin Ajibade; born 17 February 1987) is a blogger and publicist from Nigeria. She is known as OloriSuperGal. She created entertainment website, OloriSuperGal.com and it became one of the most popular in Nigeria. == Early life and education == Tosin was born on 17 February 1987 in Nigeria. She studied at the Lagos State University and the School of Media and Communications, Pan-Atlantic University in Nigeria. == Media work == Tosin Ajibade is known for her lifestyle and entertainment website, OloriSuperGal.com in Nigeria as well as a South African edition. Tosin began working as a publicist in 2009. She created her blog in 2010. In 2011, she was hired at BlackHouse Media as their web manager but left in 2012 to focus on blogging. While starting off her blog, she worked with several media houses such as The Net NG, Acada Magazine and Laff Mattaz Incorporated owned by Gbenga Adeyinka the 1st. In 2014, Tosin Ajibade became one of the YNaija’s 100 Most Influential Women in Nigeria and her blog is considered today as one of the most reputable and popular in Nigeria. She is the organizer of the New Media Conference which has been held annually in 2015, 2016, 2017, 2018 and 2019. The conference focuses on new media capabilities, such as in online/digital possibilities. == Social work == Ajibade has used her blog to call attention to societal issues especially as it affects women and girls. A clear instance is the sexual assault story of a Queen's College, Lagos student by her teacher which she published. The news went viral and caught the attention of the relevant authorities. == Awards and nominations == In 2015, Ajibade was named in the Nigeria’s 100 Most Influential Women List curated by YNaija. In 2016, she won The Future Awards Africa Prize for New Media. == Published work == Tosin Ajibade is an author of two books, From Social Misfit To Social Media Hero (2018) and The Influencer Blueprint (2020). ==References== Category:1987 births Category:Living people Category:Bloggers",
 "title": "Tosin Ajibade"
}