{
 "id": "873866",
 "text": "Cartoon All-Stars to the Rescue is a 1990 United States animated television film starring many characters from United States animated television series at the time of its release. Financed by McDonald's, it was originally shown on television in USA on April 21, 1990 on all four major American television networks (ABC, CBS, NBC, and FOX), and many other television stations. McDonald's also released a VHS home video edition of the special distributed by Buena Vista Home Video. == How it was different in each country == In USA, it was introduced on home video by President George H. W. Bush and First Lady Barbara Bush. It was shown in Canada on the CBC, CTV, and Global Television Networks soon after it was shown in USA. In Australia, it was shown in November 1990, where it was shown at the same time on Australia's three major TV stations (Seven Network, Nine Network and Network Ten), with Prime Minister Bob Hawke introducing it.Toons join the drug war! TV Week, November 3, 1990 It was shown in New Zealand in December 1990 on both TV One and Channel 2 at once, where New Zealand's Prime Minister Jim Bolger introduced it. == Production == It was produced by the Academy of Television Arts & Sciences Foundation and Southern Star Productions, and was animated outside of USA by Wang Film Productions Co., Ltd.. == Story == The story is about Michael, a young teenage boy who is using marijuana and alcohol. His younger sister Corey is worried about him. When Corey's piggy bank goes missing one morning, her cartoon toys come to life to help her find it. After finding it in Michael's room along with drugs, they work together to help him by taking him on a fantasy journey to teach him about how bad drug abuse can be. == Voices == The various characters' owners let their characters be used for free because they thought it was a good thing that the special was doing. This TV show was the first time that Warner Bros. characters Bugs Bunny and Daffy Duck were voiced by someone other than Mel Blanc. He had died shortly before the production, and Jeff Bergman voiced them instead. == References == == Other websites == * * * * Cartoon all-stars to the rescue : joint hearing before the Senate Committee on the Judiciary and the House Committee on the Judiciary, One Hundred First Congress, second session, on an entertaining way of enlightening children about the dangers of substance abuse, April 19, 1990. Category:1990 in television",
 "title": "Cartoon All-Stars to the Rescue"
}