{
 "id": "873891",
 "text": "The Working Women's Forum (WWF) is a women's organisation in southern India. Jaya Arunachalam founted it in Madras (Chennai) in 1987. It helps poor women in southern India. It makes small loans, a trade union, health care, education and training. It works with the poor women whose jobs are informal, for example street vendors, silkworm growers and silk weavers, handicraft producers, washerwomen and fisherwomen. WWF has helped more than 7,000,000 women by giving them loans and other things. Women join the WWF because they can get loans and because the interest rates are not too high. There are two important organisations related to the WWF :– *Indian Co-operative Network for Women (ICNW) : It provides loans to women. * National Union of Working Women (NUWW): It is a trade union that works for the interests of women. These are the four ideas that WWF uses: Pro Women: To work only for women of the informal work sector who feed their families. Anti-Dowry: The WWF wants to stop the customs around wedding dowries. It wants to do this through collective efforts against dowries. Anti-Caste and Pro-Secularism: The WWF says it will help women no matter which social rank they have in India's caste system or which religion they have. The WWF says people from different castes should be allowed to marry each other. Anti-Politics: To avoid involving the areas related to political parties and agendas. == History == WWF was started with 30 women who formed themselves into a group with the help of Jaya Arunchalam. She was then a social/political worker in Madras. The group of women approached a bank for a loan and received a sum of ₹300 for each member. Each day they collected amount from themselves for repayment. The repayment reached 95% of the sum. By April 1978, about 800 women were involved into this activity. They formed into 40 groups and began receiving loans. This led to the emergence of Working Women's Forum. Since then the WWF has received massive recognition. Former US state secretary Hillary Clinton made a visit to the WWF in July 2011. == Objectives == WWF has few socioeconomic and political objectives such as: * To form organized groups of women who are working in the informal sector * To build and improve the entrepreneurial skills of women through credit, training and other services * To identify the women involved in working in the informal sector and provide aid * To mobilize women for their political and social rights == Publications == 'Reaching out to poor women through Grassroots initiatives: An Indian Experiment' - 1992. 'Dynamic Agents of population control and change process: An Indian Experiment' - 1992 'Indian Co-operative Network for Women - An Innovative Approach to Micro - Credit' - 1995 'National Union of Working Women - Breaking the Legacy of Invisibility' - 1995 'Social platform through social innovations - A coalition with women in the informal sector - WWF(I)' - 2000. \"Structuring a movement and spreading it on\" History and growth of the Working Women's Forum (India) 1978-2003 Jaya Arunachalam / Brunhild Landwehr (eds.) IKO-Verlag für Interkulturelle Kommunikation Frankfurt am Main. London, 2003 Women's Equality - A Struggle for Survival by Jaya Arunachalam Articles, Paper, Speeches of Jaya Arunachalam presented at various conferences GYAN BOOKS P. LTD 5 Ansari Road, Darya Ganj, New Delhi 110 002 Phone 23282060, Mr. Bill Clinton on the Forum in his Latest Book “GIVING” published in 2007 - Former President of USA Mr. Bill Clinton reference in his book “GIVING” published in September 2007 aptly testifies the services of the Founder, President WWF ‘Jaya Arunachalam’ who has empowered 800,000 women over the last 29 years through microcredit, political involvement, access to education and healthcare for their children. ==Related pages== *Bill Clinton *Hillary Clinton == References == == Other websites == * Working Women's Forum website *Indian Co-operative Network for Women (ICNW) Category:Organizations based in India",
 "title": "Working Women's Forum"
}