{
 "id": "873837",
 "text": "Isa ibn Maryam () was a 1st century preacher. In Islam, he is the next to last prophet and messenger of God, sent to guide the Children of Israel with a revelation: Injīl.The Oxford Dictionary of Islam, p.158 He is believed to be a descendant of Ibrahim, and is seen as an example for all Muslims to follow. According to the Quran, Jibrael told that the name of the figure will be Isa ibn Maryam. According to the Quran, Isa foretold the coming of Muhammad in As- Saff 61:6. p. 128. In Islam, Isa is the only prophet to return. Muslims believe that Isa will return in a Second Coming to fight Gog and Magog and Al- Masih ad-Dajjal or \"False Messiah\" and establish peace and justice on earth. == History == === Birth === The birth narrative in the Quran for Isa begins at Quran 19:16–34 and Q3:45–53. Islamic theology affirms Maryam as a pure vessel.Cleo McNelly Kearns. (2008), The Virgin Mary, Monotheism and Sacrifice, New York: Cambridge University Press, p. 254–55 Islamic exegesis affirms the virginal birth of Isa. The narrative of the virgin birth is an announcement to Mary by the angel Gabriel while Mary is being raised in the Temple after having been pledged to God by her mother. Gabriel states she is honored over all women of all nations and has brought her glad tidings of a holy son. A hadith narrated by Abu Hurairah, quotes Muhammad explaining that both Jesus and Mary were protected from Satan's touch at birth, quoting from Q3:36. The Quran states that son of Maryam and his mother a sign; and we made them abide in an elevated place, full of quiet and watered with springs.\"A. J. Wensinck and Penelope C. Johnstone, \"Maryam\", in Encyclopaedia of Islam, Second Edition, ed. by P. Bearman, Th. Bianquis, C.E. Bosworth, E. van Donzel, W. P. Heinrichs. Consulted online on 30 September 2018. , . === Prophethood === Muslims believe that Isa became a prophet when he was born and spoke in infancy. From the Islamic basis, reflected upon all previous prophets through the lens of Muslim identity, Isa is considered no more than a messenger repeating a repetitive message of the ages. Some Islamic traditions believe Isa's mission was only to the people of Israil and his status as a prophet being confirmed by numerous miracles.Gregg, Stephen; Barker, Gregory 2010, p. 83.Gregg, Stephen; Barker, Gregory 2010, p. 90. ==== Revelation ==== Muslims believe that God revealed to Isa a new scripture, Injīl (the Gospel), while also declaring the truth of the previous revelations: Tawrat (the Torah) and Zabur (the Psalms). The Quran speaks favorably of al-Injīl. Traditional Islamic exegesus claiming the biblical message to have been distorted or corrupted. This polemic effort has its origins in the medieval period with Abd al-Jabbar ibn Ahmad's writings. ==== Disciples ==== The Quran states that Isa was aided by a group of disciples who believed in His message. The Quran mentions in chapter 3, verses 52–53, that the disciples submitted to the faith of Islam: The longest narrative involving Isa's disciples is when Isa performs the miracle of bringing a table of food from heaven at their request, for further proof that his preaching is the true message. ==== Ascension ==== Muslims believe that Isa was not crucified and was raised up into the skies instead of being crucified. Muslims believe that a lookalike was crucified.Ayoub 1980, p. 116. According to some Shia writings, Isa ascended to heaven wearing a woolen shirt, spun and sewed by Maryam, his mother. As he reached the heavenly regions, he was addressed, 'O Isa, cast away from you the adornment of the world.Ayoub 1980, p. 103. == Return == Isa Masih will descent at a white minaret, on the eastern side of Damascus (believed to be the Minaret of Isa in the Umayyad Mosque),Mannheim, 2001, p. 91.Sonn (2004) p. 209 Isa would slay the Dajjal, and then everyone who is one of the People of the Book (ahl al-kitāb, referring to Jews, Sabians and Christians) will believe in him. Thus, there will be one community, that of Islam. After the death of al- Mahdi, Isa will assume leadership. This is a time associated in Islamic narrative with universal peace and justice. Islamic texts also allude to the appearance of Ya'juj and Ma'juj (known also as Gog and Magog), ancient tribes which will disperse and cause disturbance on earth. God, in response to Jesus' prayers, will kill them by sending a type of worm in the napes of their necks, and send large birds to carry and clear their corpses from the land. According to a hadith, Jesus will marry, have children and rule for forty years after which he will die. Isa would be buried in the city of Madinah in a grave left vacant beside Muhammad, Abu Bakr, and Umar. Some like the Ahmadiyya believe he has descended with two angels in the unseen because only prophets and some sahaba could see angels on a white minaret and lives as a believer of Muhammad following the Quran and Sunnah. The Muslims will not follow him because they cannot follow Jesus like the Christians that's why he declined to lead the Salaah and After the ruku, he made this statement: \"Allah has killed Dajjal and the Muslims have appeared.\" He lives a poor and simple life like Muhammed did and travels the world with his angels doing what Allah commands him to do. == Notes == == References == === Citations === === Bibliography === * * * * * * * * * * * * * * * * * * * * *Zuckermann, Ghil'ad (2006). \"'Etymythological Othering' and the Power of 'Lexical Engineering' in Judaism, Islam and Christianity. A Socio-Philo(sopho)logical Perspective\", Explorations in the Sociology of Language and Religion, edited by Tope Omoniyi and Joshua A. Fishman, Amsterdam: John Benjamins, pp. 237–258. == Further reading == * * * Islam Category:Islamic theology",
 "title": "Jesus in Islam"
}