{
 "id": "873877",
 "text": "The Women's Indian Association (WIA) was an organization in India. Annie Besant, Margaret Cousins, Jeena Raja Dasa and others started it in 1917 in Adayar, Madras. Its goal was to free women from the unpleasant conditions during the 19th and early 20th centuries. Later, the Association worked to end illiteracy, child marriage, the Devadasi system and other social problems. It also worked on negotiations with the British on the Indian constitution. WIA was part of a 14-member, all-woman delegation that met the Montague Chelmsford Commission. They argued for equal voting rights for women. Dr. Annie Besant was the first President of WIA. After the death of Ms. Besant in 1933, Ms. Jina Raja Dasa became the president of WIA. She was more involved in the internal politics of theosophists. Gradually WIA lost its fame and moral support of people. ==History== WIA represented women of all races, religions and cultures. It allowed both Indian and European women to join it. It was Founded on 8 May 1917, in Adyar, Madras. Its first president was Annie Besant. Its secretaries were Margaret Cousins who was a teacher and Irish suffragist; Dorothy Jinarajadasa who was the Irish wife of a Sri Lankan Theosophist; Ammu Swaminathan and Malathi Patwardhan. The other founders included S. Ambujammal, Kamaladevi Chattopadhyay, Mary Poonen Lukose, Begam Hasrat Mohani, Saralabai Naik, Dhanvanthi Rama Rau, Muthulakshmi Reddy, Mangalammal Sadasivier, and Herabai Tata. == Stri Dharma == WIA published a monthly journal Stri Dharma in English. Though published in English, it contained articles in Hindi and Tamil.http://epgp.inflibnet.ac.in/epgpdata/uploads/epgp_content/women_studies/gender_studies/03._women_and_history/17._history_of_womens_organisations_in_india/et/7886_et_et_17.pdf It addressed political and social issues facing women in India. It also addressed the achievements of women worldwide. == References == == Further reading == * Women's Indian Association. (1967). The inspiring saga of Women's Indian Association, 1917- 1967. Madras: W.I.A. * Women's Indian Association. (1967). Women's Indian Association, Madras, India : Golden jubilee celebration, 1917 to 1967. Madras: W.I.A. == Other websites == * Stri Dharma available from the British Library Category:Women's rights Category:Feminists",
 "title": "Women's Indian Association (WIA)"
}