{
 "id": "874054",
 "text": "Uthman ibn Ali () was a son of Ali ibn Abi Talib and Fatimah bint Huzam. Uthman was martyred in the Battle of Karbala is highly honored by Muslims. According to some hadiths, Uthman was 21 and had no children when he was martyred. His grave is in the mausoleum of the collective grave of the martyrs of Karbala in the shrine of Husayn ibn Ali. == Biography == He was son of Ali and Fatima bint Hizam.Iṣfahānī, Maqātil al-ṭālibīyyīn, p. 89. Apparently, 'Uthman did not get married and had no children.Madinat Dimashq by ibn `Asakir 45/304 According to both Shia and Sunni sources, Ali named his son after Uthman ibn Affan. Shia scholar Al-Murshid Billah quotes a narration from Abu Saeed: Sunni scholar Ibn Asakir quotes a narration from Abu Saeed: Later weak sources indicate that Ali named his son Uthman after Uthman ibn Maz'un.al- Amali al-Ithneeniyyah 1/488 == Martyrdom == According to the report which has mentioned the age of 'Uthman b. 'Ali, 21 years old at the time of martyrdom.Iṣfahānī, Maqātil al-ṭālibīyyīn, p. 89; Majlisī, Biḥār al-anwār, vol. 45, p. 37. After the martyrdom of non-Hashemite companions of Imam al- Husayn, Banu Hashim went to the battlefield. The first person from among the children of Ali who went to the battlefield was Abu Bakr ibn Ali. After him, according to a report, it was 'Abd Allah and Ja'far, brothers of 'Uthman from the same mother.Ṣadūq, al-Amālī, p. 152. After them, Uthman went to the battlefield. Khawli ibn Yazid al-Asbahi shot an arrow at 'Uthman’s forehead and throw him down the horse. Then, a man from Banu Darim tribe beheaded him.Balādhurī, Ansāb al-ashrāf, vol. 3, p. 20; Iṣfahānī, Maqātil al- ṭālibīyyīn, p. 89; Majlisī, Biḥār al-anwār, vol. 45, p. 37. == Legacy == The name of 'Uthman has been mentioned and praised in the Ziyarah al-Nahiyya al- Muqaddasa attributed to the Mahdi: \"Peace be with you, O 'Uthman ibn Ali (a) and the mercy of Allah and His blessings [be upon you], for how great your position is, and how pure your remembrance is, and how clear your influence is, and how famous your blessing is, and how high your praise is, and how great is your glory.\" == References == Category:680 deaths",
 "title": "Uthman ibn Ali"
}