{
 "id": "874197",
 "text": "Omayr () also known by the kunya Abu Nasrani () and Abu Wahab () was a Christian soldier, who fought in the Battle of Karbala. Omayr either belonged to the tribe of Banu al-Alim or the tribe of Banu Kalb.Al-Tabari, History of Nations and Kings: 1387 AH, vol. 5, p. 429. He is known as the 'Christian Martyr of Karbala'. Before being a soldier, Omayr was a well known businessman of Kufa. Omayr is well-known for his courage and soldierly experience. Omayr was a tall and masculine man with broad shoulders, who was held with very high esteem among his people. == Biography == Some sources suggest that Omayr's full name was Abdullah ibn Omayr ibn Wahab ibn Abu Wahab al-Kalbi (). Al- Tabari suggests that Omayr was from the Banu al-Alim tribe. According to Abu Makhnaf, when Kufis were preparing to fight Husayn, Omayr confronted them and asked them about their intentions. Kufis told that they would fight Husayn and Omayr then went to his wife Wahab bint Abd and informed her of his intention. It is reported that Umm Wahab said: \"God has guided you to a good path, do so and take me with you\". So he went out with his wife at night and joined Husayn. Omayr was inspired by Husayn’s spiritual charisma and was reluctant to leave him despite of being aware about the consequences of staying with Husayn. In the Battle of Karbala, when Omayr asked for the permission for fighting, Husayn granted him permission believing him to be match for both the challengers. Omayr stepped into the battlefield and the challengers asked his identity to which he introduced himself. However they could not recognize him and asked either Zuhayr ibn Qayn, Habib ibn Muzahir or Burayr to fight them. Yasir was standing nearby to whom Omayr said \"You son of the adulteress! Do you not wish to fight me?!\" saying this he attacked Yasir and engaged him in a sword duel but at the same time Salim charged at him with his sword. Omayr while protecting himself lost fingers of his left hand and in retaliatory attack he killed Salim and Yasir. After killing both of them he moved back to Husayn while reciting Martial poetry. Omayr's wife Umm Wahab witnessed Omayr's assassination. Omayr participated in the retaliatory attack when Al-Shimr attacked Al Husayn's right wing. Omayr in that engagement killed 31 of them, of which 19 were horsemen and 12 were footmen. His right hand was severed by Hani ibn Thabit and left hand by Bakr ibn Hayy having left without arms, he was taken captive and according to some sources, was a put on a cross. Then, Omayr's head was cut off and thrown towards Husayn's camp. According to Al- Tabari, Omayr became the second martyr in the Battle of Karbala.Al-Tabari, History of Nations and Kings, 1387 AH, vol. 5, p. 436. After Omayr's head was thrown, his mother picked it up, took it and wiped her son's blood from it and then ran in the direction of the enemy forces. Husayn sent her back saying that she was exempted from participating in Jihad. Omayr's wife Wahab bint Abd went to his corpse and wiped out the dust and the dirt from his head as well as his face. At this time, Shimr ibn Dhil's servant Rustam striked the woman's head with a spear, causing Umm Wahab to be killed. After Wahab bint Abd was also killed, Omayr's mother is reported to have said \"You wicked people! I bear witness that the Christians in their churches are better people than you\". == Legacy == Omayr is highly honored by both Muslims and Christians for his sacrifice in the Battle of Karbala. He is believed to be buried in the Imam Husayn Shrine in Karbala. Every year, Muslims, as well as Christians, visit the site for commemoration on Ashura. == References == Category:680 deaths",
 "title": "Omayr"
}