{
 "id": "874276",
 "text": "Nari Shakti Puraskar () im[s an award. The Ministry of Women and Child Development of the Government of India gives it out eacwh year. They give it to women or groups who do good work for women's empowerment. It is the highest level of award given to women in India. The President of India gives the awards on International Women's Day (March 8). There is usually an event at the Rashtrapati Bhawan in New Delhi. Thce awards started in 1999. During that time, a title Stree Shakti Puraskar (t) was used. Later, in 2015, the present title was used. There are eight categories for the award, six for institutions and two for individual women. The institution awards have cash prizes of rupees 2 lakhs INR. The individual awards have rupees 1 lakh INR. == Institutional categories == All six institutional categories are named after famous women in Indian history. # Devi Ahilya Bai Holkar Award:- This award is named after Ahilyabai Holkar who was an 18th century Queen of Malwa Kingdom. This award is given to the best Private Sector Organization (PSO) or public sector project for promoting the welfare of women. # Kannagi Devi Award:- This award is named after Kannagi. She is an important character in the Tamil epic Silapathikaram. This award is given to the best state for improving the Child Sex Ratio (CSR). # Mata Jijabai Award:- This award is named after Mata Jijabai. She is the mother of Shivaji. She founded the Maratha Empire in the 17th century. This award is for the best urban local body that provided services and facilities to women. # Rani Gaidinliu Zeliang Award:- This award is named after Rani Gaidinliu. She was a 20th century Naga political and spiritual leader from Manipur. This award is for the Civil Society Organization (CSO) that did good works for the betterment and well being of women. # Rani Lakshmi Bai Award:- This award is named after Rani Lakshmi Bai, the warrior queen of Jhansi kingdom. This award is given to the best institutions for research and development in women's empowerment. # Rani Rudramma Devi Award:- This award is named after Rani Rudramma Devi, the 13th century warrior queen of the Kakatiya dynasty in the Deccan Plateau. It is given to two district Panchayats and two village Panchayats. It is for the work in women's welfare. == Individual categories == The two individual categories of the award are: # Award for courage and bravery # Award for making outstanding contributions to women's endeavour, community work, or making a difference, or women's empowerment == References == Category:Women's rights Category:Indian awards",
 "title": "Nari Shakti Puraskar"
}