{
 "id": "874236",
 "text": "The Jāmiʿ al-tawārīkh (Persian/Arabic: , ) is a work of literature and history, produced in the Mongol Ilkhanate.Inal. p. 163. Written by Rashid-al- Din Hamadani (1247–1318 AD) at the start of the 14th century, large coverage of the work has caused it to be called \"the first world history\". It was in three volumes and published in Arabic and Persian versions. The surviving portions total approximately 400 pages of the original work. The work describes cultures and major events in world history from China to Europe; in addition, it covers Mongol history, as a way of establishing their cultural legacy.Carey. p. 158 The early illustrated manuscripts represent \"one of the most important surviving examples of persian art in any medium\",Compendium of Chronicles, p. 9 and are the largest surviving body of early examples of the Persian miniature. == Contents == The Jāmiʿ al-tawārīkh consists of four main sections of different lengths: # The Taʾrīkh-ī Ghazānī, the most extensive part, which includes: #* The Mongol and Turkish tribes: their history, genealogies and legends #* The history of the Mongols from Genghis Khan up to the death of Mahmud Ghazan # The second part includes: #* The history of the reign of Öljaitü up to 1310 (no known copy) #* The history of the non-Mongol peoples of Eurasia (a universal history from the time of Creation, following the organization of work of the Abbasid historian al-Tabari in his History of the Prophets and Kings, often referred to as at-Tabari's HIstory, and to the historic Muslim history of Qazi Beiza'i in the Neẓām al-tawārīkh: #** Adam and the patriarchs #** the kings of the pre-Islamic Iran #** Muhammad and the Caliphs (Rashidun, Umayyad, Abbasid and Fatimid Caliphates) #** the Islamic dynasties of Persia (Ghaznavids, the shahs of Khwarezm, the Isma'ili state of Alamut) #** the Turkic peoples, #** the History of China #** Jewish history, #** Frangistan (ie., Europe, primarily the Papal States and Holy Roman Empire) #** the Indians. # The Shu'ab-i panjganah (\"Five genealogies, of the Arabs, Jews, Mongols, Franks, and Chinese\"). This text exists in two copies of the manuscript in the library of the Topkapı Palace in Istanbul (ms 2937), but has only been published on microfilm. # The Suwar al-aqalim, a geographical compendium. Unfortunately, it has not survived in any known manuscript. ==Author== Rashid-al-Din Hamadani was born in 1247 at Hamadan, Iran into a Jewish family. == Description == === Sources === To write the Jāmiʿ al- tawārīkh, Rashid al-din based his work on many written and oral sources, some of which can be identified: * From Iran, it is very similar to work by Ata- Malik Juvayni, a Persian historian who wrote an account of the Mongol Empire entitled Tārīkh-i Jahāngushāy \"History of the World-Conqueror\". Also from Iran, the Shahnameh is drawn upon.Fitzwilliam Museum , Cambridge == Contemporary manuscripts == The Jāmiʿ al-tawārīkh was the center of an industry for a time, no doubt in part due to the political importance of its author. The workshop was ordered to produce one manuscript each in Arabic and Persian every year, which were to be distributed to different cities.Carey, pp. 158–159 Although approximately 20 of the first generation of manuscripts were produced, very few survive, which are described below. Other later copies were made from the first set, with some illustrations and history added to match current events.Canby, 31 ===Edinburgh folios=== The Edinburgh part has a page size of 41.5 × 34.2 cm, with a written area of 37 × 25 cm, and contains 35 lines per page written in Naskhi calligraphy. There are some omissions: folios 1, 2, 70 to 170, and the end; and it is dated to 1306-1307, in a later inscription, which is nonetheless accepted. The text comprises four parts: the history of Persia and pre-Islamic Arabia, the story of the Prophet and Caliphs, the history of the Ghaznavids, Seljuks and Atabeys, and the history of the sultans of Khwarezm. This part of the manuscript was discovered in the 1800s by Duncan Forbes, who found it among the papers of Colonel John Baillie, so this section is sometimes referred to as \"Baillie's collection\". Seventy rectangular miniatures adorn the manuscript, which reflect the cosmopolitan nature of Tabriz at the time of its production. In this capital, a crossroads of trade routes and influences, and a place of great religious tolerance, Christian, Chinese, Buddhist and other models of painting all arrived to feed the inspiration of the artists. ===Khalili folios=== A new painter appears for the portraits of Chinese leaders, which uses special techniques that seem to mimic those of Yuan mural painters (according to S. Blair): an attention to line and wash, and the use of black and bright red. This artist seems to be very familiar with China. The folios are dated 1314, and it was transcribed and illustrated in Tabriz under the supervision of Rashid al-Din. ==Persian manuscripts== There are two early 14th century copies in Persian in the Topkapi Palace Library, Istanbul. * MS H 1653, made in 1314, which includes later additions on the Timurid era for Sultan Shah Rukh. The full collection, known as the Majmu'ah, contains Bal'ami's version of Muhammad ibn Jarir al- Tabari's chronicle, the Jāmiʿ al-tawārīkh, and Nizam al-Din Shami's biography of Timur. The portions of the Jāmiʿ cover most of the history of the Muhammad and the Caliphate, plus the post-caliphate dynasties of the Ghaznavids, Saljuqs, Khwarazmshahs and Is'mailis, and the Turks. It contains 68 paintings in the Ilkhanid style. * MS H 1654, made in 1317, which includes 118 pictures, including 21 pages of portraits of Chinese emperors. It was copied for Rashid al-Din, and like H 1653 was later owned by Shahrukh.Blair. pp. 27–28, and note 35. == Later versions and manuscripts == == References == === Citations === === Sources === * \"Rashid al-Din Tabib\", in Encyclopedia of Islam, Brill, 1960 (2nd edition) * Allen, Terry, Byzantine Sources for the Jāmiʿ al-Tawārīkh of Rashīd Al-Dīn, 1985, Ars Orientalis, Vol. 15, pp. 121–136, * S. Blair, A compendium of chronicles : Rashid al-Din’s illustrated history of the world, 1995, 2006 (contains a complete set of the folios from Khalili collection, with discussion of the work as a whole) == Further reading == * * == Other websites == * Online text: * Hillenbrand, Robert, \"Propaganda in the Mongol ‘World History’\", 2010 Aspects of Art Lecture, British Academy * Paul Lunde and Rosalind Mazzawi, A History of the World , Saudi Aramco World, January 1981, describing the copy now in the Khalili collection * Folios from the Jami' al-tavarikh, Timeline of Art History, Metropolitan Museum of Art * Edinburgh pages in an exhibition at Cambridge * Online scan of the Edinburgh manuscript * Khalili Collection: The Jami‘ al-Tawarikh of Rashid al-Din * Devatasutra in the Arabic Compendium of Chronicles of Rashid al-Din Category:14th-century books Category:Persian literature Category:Art Category:History books",
 "title": "Jami' al-tawarikh"
}