{
 "id": "874384",
 "text": "Feminism is the idea that different sexes and genders are equal in society, that no sex or gender is better or worse than another. Feminism wants women and men to have equal status and equal rights in society. Islamic feminism tries to bring these ideas to countries in which most people are Muslim. People who are in favor of the idea also say that there are several countries with Muslim majorities, where women had important roles: there were female heads of state, prime ministers, and state secretaries. Examples of such women are Lala Shovkat of Azerbaijan, Benazir Bhutto of Pakistan, Mame Madior Boye of Senegal, Tansu Çiller of Turkey, Kaqusha Jashari of Kosovo, and Megawati Sukarnoputri of Indonesia. In Bangladesh, Khaleda Zia was elected the country's first female prime minister in 1991. She served as prime minister until 2009. Sheikh Hasina replaced her. Hasina is still prime minister in 2021. This makes Bangladesh the country with the longest continuous female premiership.\"Prime Minister of Bangladesh - PM Office Email Address.\" MediaBangladeshnet about Bangladesh Print Electronic Internet More. N.p., 15 Nov. 2015. Web. 1 Oct. 2016. Unlike other feminists, who are usually secular, Islamic feminists want to use Islam and its teachings for their ideas. One of the things Islamic feminists want to reach is that men and women are truly equal in all aspects of daily life, and in society. They also want to include non-Muslims in their view and debate. Islamic scholars see Islamic feminism as more radical as secular feminism, \"Islamic feminism: what's in a name?\" by Margot Badran, Al-Ahram, January 17–23, 2002 because it uses Islam with the Quran as its most important text. \"Exploring Islamic Feminism\" by Margot Badran, Center for Muslim-Christian Understanding, Georgetown University, November 30, 2000 As a \"school of thought\" it refers to people such as Morocccan sociologist Fatema Mernissi and scholars such as Amina Wadud and Leila Ahmed. == Definitions == === Islamic feminists === Islamic feminists read the religious texts with a feminist perspective. They can ground their arguments in Islam and its teachings. They want gender justice and the full equality of women and men in the personal and public sphere. They also want to include non-Muslims in this discussion. Islamic scholars see Islamic feminism as more radical than secular feminism. They also think that Islamic feminism is part of the teachings of Islam with the Quran as its central text. Recently, more people have been talking about the concept of Islamic feminism. Different groups in societies which are influenced by Islam wanted to get more support for some of their ideas and policies. In addition, educated Muslim women want their role in society to be more important. Rob L. Wagner: \"Saudi- Islamic Feminist Movement: A Struggle for Male Allies and the Right Female Voice\", University for Peace (Peace and Conflict Monitor), March 29, 2011 Umm Yasmin, of the Centre for Muslim Minorities and Islam, says that feminism is often mistaken as a western movement. According to Yasmin, Muslim feminists have been active since the early nineteenth century. They do not want to change the religion of Islam, but rather \"promote gender equality within a secular society\". Yasmin also says that Muslim feminists have adapted their view: Islam can be seen in context, in order to speak about men and women being equal; for Islam doesn't condone violence against women. Since the nineteenth century, both men and women have questioned the legal system regarding the Sharia Laws: These laws say that women should wear a veil. They limit their education, and have an effect on women's seclusion, polygyny and concubinage. In this context, seclusion means that women need to stay at home, and that they need to ask for permission to see or talk to other people outside the family. Many Muslim women wanted to change these laws. They have started schools for girls, and have been opposed to veiling and one man being married to several women. In support of Yasmin's argument, Fatema Mernissi says that the fact that the ideal Muslim woman is shown as \"silent and obedient\" has nothing to do with the message of Islam. In her view, conservative Muslim men manipulated the religious texts of the Qu'ran to keep their patriarchal system. They did this to prevent women from breaking free, also sexually; with it, they justified a strict veiling and a limitation of women's rights. === Feminism in Islam === says that Islamic feminism gets its understanding and mandate from the Qu'ran. According to her, it \"seeks rights and justice for women, and for men, in [all] their existence.\" In her writings, she explains that radical Islamists have corrupted Islam with the image of patriarchy and oppression to women. This image is what the rest of the world sees and understands Islam to be. Asma Barlas shares Badran's views. In her works, she discusses the difference between secular and Islamic feminism. According to her, \"in countries where Muslims make up 98% of the population, it is not possible to avoid questioning 'its basic beliefs.'\" Fatima Seedat agrees with both Barlas and Badran about the importance of feminism in the Islamic world. According to her, the term “Islamic feminism” is unnecessary since feminism is a “social practice, not merely of personal identity.” Seedat thinks that bringing Islam and feminism together creates more conflict. It allows Islamists to interpret the Qur'an to suit their political needs. She believes it is important to show how feminism has existed in the Qur'an. In her view, keeping Islam and feminism separate is better for everyone. In the same article, “Feminism, and Islamic Feminism: Between Inadequacy and Inevitability”, Seedat explains that the fact that such a term exists, separates Muslims and isolates them from the rest of the world and the feminist movement. In her essay, she states that it is important to share what Islam has to offer feminism with the rest of the world. For this reason, Muslims who are feminists should not refer to themselves as Islamic feminists. Moroccan writer and sociologist, Fatema Mernissi wrote the essay Beyond the Veil. In it, she explores the oppressive status of women in Islam, sexual ideology and gender identity through the perspective of Moroccan society and culture. Beyond the Veil argues against the discourse on women's sexuality by breaking their silence with providing a voice against the dominance of male patriarchy. === Context in the Quran === The following qoutes show the parts of Qu'ran to put feminism in context: > “O mankind! Fear your Lord Who (initiated) your creation from a single soul, > then from it created its mate, and from these two spread (the creation of) > countless men and women.” (Qur’an, 4:1) Allah created both men and women as peers. They were formed from the same soul and the same spiritual nature with neither superior to the other, as shown in the above verse > \"وَٱللَّهُ جَعَلَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوَٰجًا وَجَعَلَ لَكُم مِّنْ > أَزْوَٰجِكُم بَنِينَ وَحَفَدَةً وَرَزَقَكُم مِّنَ ٱلطَّيِّبَٰتِ > أَفَبِٱلْبَٰطِلِ يُؤْمِنُونَ وَبِنِعْمَتِ ٱللَّهِ هُمْ يَكْفُرُونَ \" النحل > ١٦:٧٢ \"And Allah has made for you spouses of your own kind, and given you > through your spouses children and grandchildren. And He has granted you > good, lawful provisions. Are they then faithful to falsehood and ungrateful > for Allah’s favours? (72)\" An-Nahl 16:72 > وَٱلْمُؤْمِنُونَ وَٱلْمُؤْمِنَـٰتُ بَعْضُهُمْ أَوْلِيَآءُ بَعْضٍ ۚ > يَأْمُرُونَ بِٱلْمَعْرُوفِ وَيَنْهَوْنَ عَنِ ٱلْمُنكَرِ وَيُقِيمُونَ > ٱلصَّلَوٰةَ وَيُؤْتُونَ ٱلزَّكَوٰةَ وَيُطِيعُونَ ٱللَّهَ وَرَسُولَهُۥٓ ۚ > أُو۟لَـٰٓئِكَ سَيَرْحَمُهُمُ ٱللَّهُ ۗ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ 9:71 > The believers, both men and women, support each other; they order what is > right and forbid what is wrong; they keep up the prayer and pay the > prescribed alms; they obey God and His Messenger. God will give His mercy to > such people: God is almighty and wise. — Abdul Haleem > 3:195 فَٱسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّى لَآ أُضِيعُ عَمَلَ عَـٰمِلٍ > مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَىٰ ۖ بَعْضُكُم مِّنۢ بَعْضٍ ۖ فَٱلَّذِينَ > هَاجَرُوا۟ وَأُخْرِجُوا۟ مِن دِيَـٰرِهِمْ وَأُوذُوا۟ فِى سَبِيلِى > وَقَـٰتَلُوا۟ وَقُتِلُوا۟ لَأُكَفِّرَنَّ عَنْهُمْ سَيِّـَٔاتِهِمْ > وَلَأُدْخِلَنَّهُمْ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ثَوَابًا > مِّنْ عِندِ ٱللَّهِ ۗ وَٱللَّهُ عِندَهُۥ حُسْنُ ٱلثَّوَابِ 3:195 Then their > Lord responded to them, \"I do not waste the deed of any doer among you, any > male or female. The one of you is as the other (Literally: some of you from > some others). So, the ones who emigrated, and were driven out of their > residences, and were hurt in My way, and fought, and were killed, indeed I > will definitely expiate them of their odious deeds, and indeed I will > definitely cause them to enter Gardens from beneath which Rivers run.\" A > requital from (the Providence of) Allah; and Allah has in His Providence the > fairest requital. — Dr. Ghali === Nineteenth century === Khawla bint al-Azwar, was a legendary female Muslim warrior/soldier during the life of the prophet Mohammad. Her brother, Dhiraar al-Azwar, trained her to fight and she fought with him in many battles. Because soldiers wore loose clothing, and wrapped themselves in cloth to protect themselves from the sand and dust, the fact that she was a woman was not known. After she had shown her talent and skill in fighting, she told the men who were close by. == History and context == According to Ahmed Elewa and Laury Silvers, many people have used Islamic tradition of the past 150 years to try to correct social errors done against Muslim women. According to them, a new form of Islamic law is being developed, to forbid practices such as female genital mutilation. People developing this law also want to make family codes (Personal law) equal, allow women to become clergy, or to help in mosques in other ways. They want women to be able to become judges in civil and religious institutions. Elewa and Silvers say that modern scholars see their work as restoration of rights provided by God and the prophet but denied by society. As of the 2020s, there are many changes in the Muslim world. States where Islam is an important religion are often run by a single ruler, or a small group of people. These stats will need to change so that people can elect who represents them. Such a process is called democratic. When they go through this change, they will need to look to improve the situation of the people as to human rights, social justice and gender equality. Islamic feminists play an important role in this process. For example, in 2012, Jordanian women protested against laws that allowed the charge of rape to be dropped, if the rapist marries his victim, Tunisian women marched for equality for women in a new constitution, Saudi women protested against the ban against car driving, Sudanese women created a silent wall of protest demanding freedom for arrested women. Elizabeth Segran describes the Islamic feminist struggle of Malaysian activist Zainah Anwar. Segran says that just talking about human rights mentioned in the Convention on the Elimination of All Forms of Discrimination Against Women (CEDAW) does not create a direct response with ordinary women. Islam is the source of their values. For this reason, integrating human rights frameworks with Islam makes sense. === Islamists === Islamists are advocates of political Islam. In their view the Quran and hadith want to establish a caliphate, an Islamic government. Some islamists say that women should have rights in public life. They do however not challenge gender inequality in the personal, private sphere. Su'ad al-Fatih al-Badawi, a Sudanese academic and Islamist politician, has argued that feminism is incompatible with taqwa (the Islamic idea of piety). In al-Badawi's view, Islam and feminism are mutually exclusive. Margot Badran of Georgetown University's Center for Muslim-Christian Understanding (now the Prince Alwaleed Bin Talal Center for Muslim-Christian Understanding) argues that Islam and feminism are not mutually exclusive and that \"Islamic feminism, which [takes] its understanding and mandate from the Qur'an, seeks rights and justice for women, and for men, in [all] of their existence. Islamic feminism is both highly contested and firmly embraced.\" === Nineteenth and twentieth century === Modern ideas of Islamic feminism started in the 19th century.. The Iranian poet Táhirih was the first modern woman to undertake Qur'anic exegesis. She was born and raised in a traditional Muslim family. Later, she became a prominent member of the Bábí Faith. During this time was openly against polygyny, the wearing of the veil, and other restrictions put on women. One of her most notable quotes are her final words before her execution in August 1852, \"You can kill me as soon as you like, but you cannot stop the emancipation of women.\" Egyptian jurist Qasim Amin wrote the book Women's Liberation (Tahrir al-Mar'a), in 1899. This book probably started the feminist movement in Egypt. In his work, Amin criticized some of the practices which were common in his society at the time: These were polygyny, the veil, and purdah, i.e. sex segregation in Islam, amongst others. He condemned them as un-Islamic and contradictory to the true spirit of Islam. His work had an enormous influence on women's political movements throughout the Islamic and Arab world Amin had a big effect on modern-day Islamic feminist movements. Despite this, present-day scholar Leila Ahmed considers his works both androcentric and colonialist. Muhammad 'Abdu, an Egyptian nationalist and proponent of Islamic modernism, could easily have written the chapters of his work that show honest considerations of the negative effects of the veil on women. Amin also uses many male misconceptions about women: In his view, women are unable to experience love. Women also talk about their husbands when they are not present. He also thinks that Muslim marriage is based on ignorance and sensuality, of which women were the main source. Amin was not the first to criticize the society he lived in. There were many women who did. The women's press in Egypt started voicing such concerns since its very first issues in 1892. Egyptian, Turkish, Iranian, Syrian and Lebanese women and men had been reading European feminist magazines even a decade earlier, and discussed their relevance to the Middle East in the general press. see \"Great Ancestors: Women Asserting Rights in Muslim Contexts\", by Farida Shaheed with Aisha L.F. Shaheed (London/Lahore: WLUML/Shirkat Gah, 2005) Twentieth century Aisha Abd al-Rahman, used her pen name Bint al-Shati (\"Daughter of the Riverbank\"), when she wrote. She was the second modern woman to do Quranic exegesis. She didn't think of herself as a feminist. Despite this, her works have feminist themes. She began producing her popular books in 1959, the same year that Naguib Mahfouz published his allegorical and feminist version of the life of Muhammad. She wrote biographies of early women in Islam, including the mother, wives and daughters of the Prophet Muhammad, as well as literary criticism. Fatema Mernissi has argued that much of the suppression of women's rights in Islamic societies is the result of political motivation and its consequent manipulative interpretation of hadith, which is against the egalitarian Islamic community of men and women Muhammad had in mind. Some versions of modern Islamic feminism do not use hadith at all, and only focus on the priciples written down in the Qu'ran. Riffat Hassan has advocated one such movement. She started a theology where what are seen as universal rights for humanity outlined in the Qur'an are prioritized over contextual laws and regulations. In addition, she claims, that if only the Qu'ran is taken as scripture, there is no story that women were created after men, or a story that they started the \"Fall of Man\". Other Muslim feminists have criticized this idea: They say it is too picky and ignores other elements of the Muslim tradition that could be helpful in making Islamic society more egalitarian. ==== Revolutionary Association of the Women of Afghanistan ==== The Revolutionary Association of the Women of Afghanistan (RAWA) is a women's organization based in Quetta, Pakistan. It promotes women's rights and secular democracy. The organization wants to involve women of Afghanistan in both political and social activities. In this way, they should get their human rights. RAWA will also continuing the struggle against the government of Afghanistan. RAWA thinks the Afghan government should be based on democratic and secular ideas - not fundamentalist - principles, in which women can participate fully. A group of intellectuals led by Meena founded the group in 1977. At the time, Meena did not use a last name. They founded the organization to promote equality and education for women. Even if Meena was assassinated because of her views, RAWA continues to \"give voice to the deprived and silenced women of Afghanistan\". Before 1978, RAWA focused mainly on women's rights and democracy, but after the coup of 1978, directed by Moscow, and the 1979 Soviet Occupation of Afghanistan, \"Rawa became directly involved in the war of resistance, advocating democracy and secularism from the outset\". In 1979 RAWA campaigned against the Democratic Republic of Afghanistan, and organized meetings in schools to mobilize support against it, and in 1981, launched a bilingual feminist magazine, Payam-e-Zan (Women's Message). RAWA also founded Watan Schools to aid refugee children and their mothers, offering both hospitalization and the teaching of practical skills. === Twenty-first century === In 2015 a group of Muslim activists, politicians, and writers issued a Declaration of Reform. This declaration also supports women's rights and states in part, \"We support equal rights for women, including equal rights to inheritance, witness, work, mobility, personal law, education, and employment. Men and women have equal rights in mosques, boards, leadership and all spheres of society. We reject sexism and misogyny.\" The Declaration also announced the founding of the Muslim Reform Movement organization to work against the beliefs of Middle Eastern terror groups. In 2015 Asra Nomani and others placed the Declaration on the door of the Islamic Center of Washington. Feminism in the Middle East is over a century old. The war on terror in Afghanistan directly affected it. It continues to grow and fight for women's rights and equality in all conversations of power and everyday life. There is currently a debate about what the status of women in Islam should be like. Both conservative and Islamic femininists use the same sources for their arguments: The Quran, the hadith, and prominent women in Muslim history. Feminists say that early Islam was more egalitarian; conservatives say that the gender assymmetries are \"divinely ordained\". == Further reading == * * * * * 17–23 January 2002, Issue No.569. * Interview with Prof Margot Badran. * * * n:7. * * * * In this special feature, a successful Belgian-Algerian Muslim woman recounts what it was like growing up immersed in two cultures with divergent views of women. * * Women and Islam in Oxford Islamic Studies Online * * Canadian Council of Muslim Women Several examples of closely argued essays for female equality, based on the Qur'an. * The Modern Muslimah Forum å * * Foreign Affairs Committee of the National Council of Resistance of Iran. Women, Islam, and Equality, an ebook * * * * * * * * Article for Domes * * \"A Declaration of the Rights of Women in Islamic Societies\", SecularIslam.com, undated * * Articles by a South African Islamic feminist * * * == References == Category:Feminism Category:Islam Category:Pages with unreviewed translations",
 "title": "Islamic feminism"
}