{
 "id": "874698",
 "text": "Colwich is a city in Sedgwick County, Kansas, United States. It is northwest of Wichita. In 2020, 1,455 people lived in Colwich. ==History== Colwich was created in 1887. The name is a portmanteau of Colorado and Wichita, or the Colorado & Wichita Railroad.Temple, Robert D. Edge Effects: The Border-Name Places, (2nd edition, 2009), iUniverse, , page 324. ==Geography== Colwich is at (37.780480, -97.540420). It is northwest of Wichita and centered around the intersection of 53rd St North and 167th St West. The United States Census Bureau shows that the city has a total area of . All of it is land. ==People== Colwich is part of the Wichita, KS Metropolitan Statistical Area. ===2020 census=== The 2020 census says that there were 1,455 people, 535 households, and 404 families living in Colwich. Of the households, 75.1% owned their home and 24.9% rented their home. The median age was 33.9 years. Of the people, 93.7% were White, 0.9% were Native American, 0.1% were Black, 0.1% were Asian, 0.5% were from some other race, and 4.7% were two or more races. Hispanic or Latino of any race were 3.4% of the people. ===2010 census=== The 2010 census shows that there were 1,327 people, 466 households, and 348 families living in Colwich. The population density was . There were 480 housing units at an average density of . The people were 97.4% White, 0.2% African American, 0.5% Native American, 1.1% from other races, and 0.9% from two or more races. Hispanic or Latino of any race were 2.5% of the population. There were 466 households, of which 44.6% had children under the age of 18 living with them, 59.7% were married couples living together, 9.9% had a female householder with no husband present, 5.2% had a male householder with no wife present, and 25.3% were non-families. 22.3% of all households were made up of individuals, and 10.7% had someone living alone who was 65 years of age or older. The average household size was 2.85 and the average family size was 3.38. The median age in the city was 32.7 years. 34.3% of residents were under the age of 18; 7.7% were between the ages of 18 and 24; 25.9% were from 25 to 44; 21.1% were from 45 to 64; and 11.1% were 65 years of age or older. The people were 50.1% male and 49.9% female. ==Education== The community is served by Renwick USD 267 public school district. ==References== ==More reading== ==Other websites== * City of Colwich * Colwich - Directory of Public Officials * Colwich City Map , KDOT Category:Cities in Sedgwick County, Kansas Category:1887 establishments in Kansas",
 "title": "Colwich, Kansas"
}