{
 "id": "874694",
 "text": "Elmdale is a city in Chase County, Kansas, United States. In 2020, 40 people lived there. It is along the U.S. Route 50 highway. ==History== In 1854, the Kansas Territory was created. In 1861, Kansas became the 34th U.S. state. In 1859, Chase County was created within the Kansas Territory, which included the land for Elmdale. In 1871, the Atchison, Topeka and Santa Fe Railway built a railroad east-west through Elmdale.Santa Fe Rail History In 1996, it merged with Burlington Northern Railroad and renamed to the current BNSF Railway. Most locals still call this railroad as the \"Santa Fe\". In 1873, a post office was moved from Middle Creek (an extinct town), to the rail community of Elmdale. ===20th century=== Elmdale was incorporated in 1904. In 1916, Camp Wood YMCA was built about 1.5 miles south of Elmdale.Camp Wood YMCA InformationCamp Wood hopes to attract entire families for recreation, education; The Wichita Eagle; April 29, 2016. There have been many floods during the history of Elmdale. In June and July 1951, due to heavy rains, rivers and streams flooded many cities in Kansas, including Elmdale. Many reservoirs and levees were built in Kansas as part of a response to the Great Flood of 1951. A levy was built and saved the town from many floods, but in 1998 a flood went over the levy. In 1967, the high school closed, then later the grade school. All students currently go to school in Cottonwood Falls. ==Geography== Elmdale is at (38.372965, -96.645988), in the Flint Hills of the Great Plains. The United States Census Bureau says that the city has a total area of . All of it is land. The Cottonwood River is about 0.5 miles east of the city. ===Climate=== The climate has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system shows Elmdale has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Elmdale, Kansas ==Area attractions== Elmdale has one building on the National Register of Historic Places (NRHP). * Clover Cliff Ranch HouseNational Register of Historic Places - Clover Cliff Ranch House (NRHP). ==People== Elmdale is part of the Emporia Micropolitan Statistical Area. ===2020 census=== The 2020 census shows that there were 40 people living in Elmdale. The population density was . There were 18 housing units at an average density of . The people were 82.5% White, 5.0% Native American, 2.5% African American, and 10.0% from two or more races. Hispanic or Latino of any race were 7.5% of the people. There were 11 households, of which 36.4% had children under the age of 18 living with them, 54.5% were married couples living together, 36.4% had a female householder with no husband present, and 9.1% had a male householder with no wife present. 18.2% of all households had only one person, and 9.1% had someone living alone who was 65 years of age or older. The average household size was 3.64. The median age in the city was 26.5 years. 42.5% of residents were under the age of 18; 5.0% were between the ages of 18 and 24; 20.0% were from 25 to 44; 27.5% were from 45 to 64; and 5.0% were 65 years of age or older. The people were 50% male and 50% female. ===2010 census=== The 2010 census shows that there were 55 people, 23 households, and 11 families living in Elmdale. The population density was . There were 27 housing units at an average density of . The people were 96.4% White and 3.6% from two or more races. Hispanic or Latino of any race were 9.1% of the people. There were 23 households, of which 26.1% had children under the age of 18 living with them, 39.1% were married couples living together, 4.3% had a female householder with no husband present, 4.3% had a male householder with no wife present, and 52.2% were non-families. 43.5% of all households were made up of individuals, and 13% had someone living alone who was 65 years of age or older. The average household size was 2.39 and the average family size was 3.09. The median age in the city was 45.3 years. 23.6% of residents were under the age of 18; 9.1% were between the ages of 18 and 24; 16.3% were from 25 to 44; 38.2% were from 45 to 64; and 12.7% were 65 years of age or older. The people were 56.4% male and 43.6% female. ==Government== The Elmdale government has a mayor and five council members. The council meets the 1st Monday of each month at 7PM. ==Education== The community is served by Chase County USD 284 public school district. It has two schools. * Chase County Junior/Senior High School, 600 Main St in Cottonwood Falls. * Chase County Elementary School, 410 Palmer St in Strong City. The Elmdale Cougars won the Kansas State High School class B baseball championship in 1961. ==Infrastructure== ===Transportation=== U.S. Route 50 highway and BNSF Railway goes through the city. ===Utilities=== * Internet ** Satellite Internet is provided by HughesNet, StarBand, WildBlue. * TV ** Satellite TV is provided by DirecTV, Dish Network. ** Free over-the-air ATSC digital TV. ==Related pages== * Great Flood of 1951 ==References== ==More reading== ==Other websites== * Elmdale - Directory of Public Officials * Chase County Chamber of Commerce * Elmdale, A \"Quiet\" town of Chase County, Kansas, History and photographs. * Historic Images of Elmdale, Special Photo Collections at Wichita State University Library. * , from Hatteberg's People on KAKE TV news * Elmdale City Map, KDOT * Topo Map of Elmdale / Clements area, USGS * Chase County Maps: Current , Historic , KDOT Category:Cities in Chase County, Kansas",
 "title": "Elmdale, Kansas"
}