{
 "id": "874700",
 "text": "Coyville is a city in Wilson County, Kansas, United States. In 2020, 60 people lived there. ==History== Coyville was planned out in 1886 when the Atchison, Topeka and Santa Fe Railway was extended to that point. The town was named after Oscar Coy, a store owner who in 1866 served as the first postmaster. ==Geography== Coyville is at (37.685436, -95.897147),. The United States Census Bureau shows that the city has a total area of . All of it is land. ===Climate=== The climate in this area has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system shows that Coyville has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Coyville, Kansas ==People== ===2020 census=== The 2020 census says that there were 60 people, 24 households, and 17 families living in Coyville. Of the households, 87.5% owned their home and 12.5% rented their home. The median age was 59.0 years. Of the people, 90.0% were White and 10.0% were two or more races. None were Hispanic or Latino. ===2010 census=== The 2010 census shows that there were 46 people, 26 households, and 8 families living in Coyville. The population density was . There were 34 housing units at an average density of . The racial makeup of the city was 80.4% White, 2.2% Native American, 8.7% from other races, and 8.7% from two or more races. Hispanic or Latino of any race were 2.2% of the population. There were 26 households, of which 19.2% had children under the age of 18 living with them, 26.9% were married couples living together, 3.8% had a male householder with no wife present, and 69.2% were non-families. 65.4% of all households were made up of individuals, and 23.1% had someone living alone who was 65 years of age or older. The average household size was 1.77 and the average family size was 3.38. The median age in the city was 49.6 years. 23.9% of residents were under the age of 18; 8.6% were between the ages of 18 and 24; 6.6% were from 25 to 44; 43.5% were from 45 to 64; and 17.4% were 65 years of age or older. The people were 45.7% male and 54.3% female. ==Related pages== * Toronto Lake and Cross Timbers State Park * Fall River Lake and Fall River State Park ==References== ==More reading== ==Other websites== * Coyville - Directory of Public Officials * USD 484, local school district * Coyville City Map , KDOT Category:Cities in Wilson County, Kansas",
 "title": "Coyville, Kansas"
}