{
 "id": "87519",
 "text": "The Western Roman Empire was the western half of the Roman Empire, which was divided by Diocletian in 286 AD. The other half of the Roman Empire became known as the Eastern Roman Empire. The Roman Empire had been in difficulties since 190 AD, when large Gothic tribes began moving into areas under Roman control. The Empire had weak leadership, which caused instability. Various power groups in the Roman armies kept trying to install their own emperors and killed those who belonged to other groups. That helped the invasions by the Germanic tribes. Diocletian ended Rome's Crisis of the Third Century and tried to bring back stable government by dividing the empire into sections. The Western Empire included Iberia, France, southern Britain, Italy, North Africa and parts of Germany. The Eastern Empire included the Balkans, Turkey, the Levant and Egypt. Rome ceased to be the capital from the time of the division. In 286, the capital of the Western Roman Empire became Mediolanum (now Milan). In 402, the capital was again moved, this time to Ravenna. The division did not help the Western Empire, which came under increasing invasions from the north: the Ostrogoths, Huns, Franks, Visigoths and Burgundians. Its armies were brought back towards Rome and abandoned Britain and France. The Empire's economy could not cope since the increased need for military spending caused inflation. Citizens were unhappy with the rising taxes and rising prices. In AD 398, Alaric led the Visigoths and began making attacks closer and closer to the capital. By 410, he had sacked Rome. In 455, the Vandals captured the city. In 476, the Goths captured the city. The fall of the Western Roman Empire took place in 476 AD, when the leader of the Goths, Odoacer, removed Emperor Romulus Augustus. Odoacer became King of Italy, and the Western Roman Empire ended. By then, however, the empire had existed in name only, and the Emperor no longer had military, financial or political power. ==Related pages== *Holy Roman Empire *The Decline and Fall of the Roman Empire ==References== ==Other websites== *www.roman-empire.net *De Imperatoribus Romanis Category:Places of Ancient Rome Category:Roman Empire Category:280s establishments",
 "title": "Western Roman Empire"
}