{
 "id": "875469",
 "text": "Andrianafidisoa, popularly known as Fidy (10 March 1964 - 6 October 2021), was a military general of the Army of Madagascar and a Director of the National Mines and Strategic Industries Office (OMNIS).\"Eight presidential candidates offer support to renegade general\", L'Express de Madagascar web site, November 23, 2007. He allegedly attempted a coup d'état against Malagasy President Marc Ravalomanana on November 18, 2006.Alain Iloniaina, \"Madagascar hunts for renegade general after coup bid\" , Reuters, November 19, 2006. == Coup attempt == Prior to his alleged coup attempt, in October 2006 General Andrianafidisoa had been barred from running for president in the election scheduled for December 3, 2006, for not paying the required deposit of 25,000,000 ariary.\"14 candidats autorisés à se présenter à la présidentielle\", AFP (Jeuneafrique.com), October 18, 2006. Andrianafidisoa had earlier supported Ravalomanana in his struggle against Didier Ratsiraka over election results in 2002,\"Attempted \"coup\" fizzles in desire for peaceful poll\", IRIN, November 20, 2006. and led an attack by pro-Ravalomanana forces on Fianarantsoa at that time. While Ravalomanana was out of the country, Andrianafidisoa had leaflets distributed declaring military rule; he called Ravalomanana's government unconstitutional and went to a base at Ivato Airport, seeking support from soldiers. One soldier was reported killed in a clash there, and Ravalomanana's flight, returning from Europe, was diverted to Mahajanga.\"Retired Madagascar army general calls for military support against president\", Associated Press, November 18, 2006. Andrianafidisoa's takeover attempt failed, and he went into hiding or on the run; the government ordered his arrest and began searching for him. However, the general stated that \"I am alive and I am not in hiding,\" on a telephone call to news organization Reuters. According to him, \"Soldiers and politicians have got the message.\" Subsequently Andrianafidisoa denied that the events had been a coup attempt, describing this as a misinterpretation. He did, however, acknowledge that he had called Ravalomanana's government unconstitutional and that he called for him to resign. On November 22, Andrianafidisoa received the backing of eight of the 14 presidential candidates, who said he was defending the constitution and the interests of the nation.\"Support for Madagascar 'coup bid'\", BBC News, November 23, 2006. A $50,000 reward was offered for Andrianafidisoa's arrest. The secretary of state for public security said that Andrianafidisoa was taken by surprise and captured on December 12 at a hotel, and that he did not resist.Alain Iloniaina, \"Madagascar captures renegade general \"Fidy\"\", Reuters, December 13, 2006. Several guns, along with ammunition, were found with him. Police began interrogating Andrianafidisoa on December 14.\"Madagascar starts interrogation of renegade general\", Reuters, December 15, 2006. Andrianafidisoa pleaded not guilty during his trial, and he and his lawyers argued that he had not attempted a coup, but had instead acted as a \"lone soldier\" attempting to alert the president to the situation of the armed forces. He was sentenced to four years in prison on February 2, 2007, and stated his intention to appeal the verdict.\"Madagascar : Gen. Fidy sentenced to 4 years imprisonment Friday\", African Press Agency, February 2, 2007. On February 20, he received an additional three-year prison sentence.\"Court sentences Malagasy dissident General to 3 years imprisonment\", African Press Agency, February 21, 2007. Ravalomanana was forced out of office by a combination of popular protests and military intervention in March 2009. Opposition leader Andry Rajoelina then took over as President of the High Authority of the Transition and promptly pardoned Andrianafidisoa, along with many other political prisoners, on 26 March 2009.Andry Ratovo, \"Libération de 28 prisonniers politiques\", L'Express de Madagascar (allAfrica.com), 27 March 2009 . == Death == Andrianafidisoa died on 6 October 2021. == References == Category:2021 deaths Category:1967 births Category:African military people Category:Malagasy people",
 "title": "Andrianafidisoa"
}