{
 "id": "875426",
 "text": "The video game industry is the industry that connects with the development, marketing, and monetization of video games. == Background == Modern personal computers have many innovations: sound cards, graphics cards, 3D graphic accelerators, faster CPUs, and dedicated co-processors like PhysX are a few of the more notable improvements. Sound cards, for example, were originally developed for the addition of digital-quality sound to games, and only later were they improved for the music industry. Graphics cards were developed to provide more screen colors, and later on to support graphical user interfaces (GUIs) and games. == Industry overview == === Size === In 2017 in the United States the Entertainment Software Association estimated that there were over 2,300 development companies and over 525 publishing companies. These companies in total have nearly 66,000 direct workers. === Roles === Ben Sawyer of Digitalmill names six layers of the industry: # Capital and publishing. # Product and talent layer. # Production and tools layer. # Distribution layer. # Hardware (or Virtual Machine or Software Platform) layer. # End-users layer. Some of the disciplines are game programmer, game designer, level designer, game producer, game artist, and game tester. Most of these professionals are employed by video game developers or video game publishers. However, many hobbyists also produce computer games and sell them commercially. === Value chain === Traditionally, the video game industry has had six layers in its value chain. # Game development with its programmers, designers, and artists. # Publishing, which includes the source of funding for the development of a video game and providing the marketing and advertising for a game. # Distribution. # Retailer. # Customers and consumers, the purchasers and players of video games # Hardware/platform manufacturers. == International practices == The video game industry started in the United States. With the personal computer, Western Europe also became a big center for video game development. Companies in North American, Europe, and Japan. are leading in this industry. Other regions, such as Australia/New Zealand, and other southeast Asian countries, for example China and South Korea, are also important. === Largest markets === According to market research firm Newzoo, these countries are the largest video game markets by annual revenue, . Rank Country Revenue (million ) 1 China 44,263 2 United States 42,107 3 Japan 20,615 4 South Korea 7,325 5 Germany 6,084 6 United Kingdom 5,533 7 France 4,351 8 Canada 3,836 9 Italy 3,482 10 Spain 2,460 == Events == === Conventions === Gaming conventions are very important in the industry. It helps publishers to demonstrate their games. It also helps game players to give their feedback. Some publishers, developers and technology producers have their own regular conventions, for example BlizzCon, QuakeCon, Nvision and the X shows. === Trade shows === The largest trade show is the E3 in Los Angeles, California, It is held by the Entertainment Software Association. Other similar trade shows are Tokyo Game Show (Japan), Brassil Game Show (Brazil), EB Games Expo (Australia), KRI (Russia), China Joy (China) and the Game Developers Conference. === Conferences === Two of the major professional conferences are: the Game Developers Conference (GDC). == Media == The attention to the video game industry started off with several magazines covering this topic. Social media influencers and video game players who create online videos or stream themselves playing games are also playing an important role in showing consumer point of view. The video game industry has a number of annual award ceremonies, associated with the conventions, trade shows and conferences, as well as standalone award shows. Many of the dedicated video game journalism websites also have their own set of awards. Most commonly, these ceremonies are capped by the top prize, the \"Game of the Year\". == References ==",
 "title": "Video game industry"
}