{
 "id": "875642",
 "text": "Groton is a town in Connecticut. Groton is next to Mystic, Norwich and New London. The town is in New London County in the southeast and coast areas of Connecticut. Groton is next to the Rhode Island state line. It is across the line from Westerly and Watch Hill. ==Population== 38,222 people lived there in the 2020 United States Census. Eight years before that, Groton about 40,000 people lived there. ==History== Groton was founded in 1705. That year, it separated from New London, Connecticut. The town was named after Groton, Suffolk in England. A hundred years before it was established, the Niantic people settled in the area between the Thames River and Pawcatuck River. They eventually settled, however, in Westerly, Rhode Island. The new people to the land were the Pequots. The latter were a branch of the Mohawk people. The Pequots people moved eastward into the Connecticut River Valley. The summer of 1614 was the first time that the Pequots met white settlers. They started trading furs for the settlers' goods. Those included steel knives, needles and boots. In 1633, the Dutch bought land from them (the Pequots). The earlier then opened a fur trading post. Meanwhile (at the same time), the English bought land for settlement from the local tribes. The Dutch had unintentionally killed the Pequots' chief. This led to revenge by the Pequot tribe, and this escalated into the Pequot War (1636–38). On the night of May 26, 1637, the Colonial forces arrived outside the Pequot village near the Mystic River. The palisade surrounding the village had only two exits. Their leader, Colonel John Mason, gave the order to set the village on fire and block off the exits. Those who tried climbing over the palisade were shot. Those who succeeded in getting over were killed by the Narragansett forces. ==Geography== According to the United States Census Bureau, the town has a total area of , of which is land and , or 31.47%, is water. ===Principal communities=== * Burnett's Corner -- historic district is along Packer Road south of Route 184 * Center Groton * City of Groton -- located along the Thames River ** Groton Heights or Groton Bank -- historic district in the northern part of the city area * Groton Long Point * Long Hill * Mystic (06355) -- mainly in the nearby town of Stonington. A small portion (West Mystic), though, is in Groton * Noank * Old Mystic * Poquonock Bridge ** Fort Hill * Submarine Base area (Census designation: \"Conning Towers-Nautilus Park\") Other minor communities and geographical areas are Bluff Point, Eastern Point, Esker Point, Jupiter Point, Mumford Cove and West Pleasant Valley. === Climate === Groton has a humid continental climate (Dfb). ==References== Category:Towns in Connecticut Category:18th-century establishments",
 "title": "Groton, Connecticut"
}