{
 "id": "875779",
 "text": "Watch Hill is a wealthy coastal village and also census-designated place (CDP). The village is part of Westerly, Rhode Island. At the 2020 United States Census, Watch Hill had 212 people living there. The village is set at the most-southwest point in all of Rhode Island. The village became very important in the 19th and 20th centuries as a major summer resort. It had rich families building sprawling (spread-out) Victorian style cottages near the southwest tips of Rhode Island. Watch Hill was called by the New York Times as a community \"with a strong sense of privacy and of discreetly used wealth.\" == History == The area was occupied by Niantic Indians in the 17th century, led by Harman Garrett. Colonists used the hill as an important lookout point during the French and Indian War and the Revolutionary War, hence the community's name. Some landmarks in the village include the Watch Hill Lighthouse, the first of which was built in 1745; 1880s The Flying Horse Carousel, the oldest operating suspended-horse carousel in the United States and a National Historic Landmark; the Ocean House hotel; and the 1916 Olympia Tea Room. One point of interest in Watch Hill is the ruins of Fort Mansfield. The ruins are an old coastal artillery post at the very end of Napatree Point. It was one of a series of such forts. They were constructed to guard the eastern entrance to Long Island Sound as part of the coastal defense network for New York City during the Spanish–American War. It was in operation between 1901 and 1909. Then it was closed down over the course of several years. The land was sold in 1926. All the government structures were torn down in winter 1928–29. The three concrete gun emplacements were left behind. They remain there as of October 2021. They usually offer tunnels and underground rooms to explore. Occasionally at low tide, some remains can be seen of the Battery Connell. Fort Road connected Watch Hill to Fort Mansfield. The New England Hurricane of 1938, though, wiped it out. The storm also destroyed 39 houses, the Yacht and Beach Clubs and a bathing pavilion. Fifteen people were killed. Others survived by clinging to wreckage when they were swept across the bay to Connecticut.\"Watch Hill In The Hurricane of September 21st, 1938\" a special pictorial issue of Seaside Topics published November 1938. Several breachways were created in Napatree Point after the hurricane passed. To this day, Sandy Point remains an island, not a northern extension of Napatree. The shortened Napatree Point is now a barrier beach without any roads or houses. It is open to the public. Napatree Point offers bird watching and surf casting. ==Geography== Watch Hill is at the most southwest area of Rhode Island. It lies on a stubby peninsula that extends to Block Island Sound. It includes a smaller peninsula known as Napatree Point. Napatree is a -long sandy spit. It extends west from the Watch Hill business district, and Sandy Point. The latter was once attached to Napatree Point. Both Napatree and Sandy Point shelter Little Narragansett Bay. They have made Watch Hill a popular harbor around which the business district has grown. Watch Hill is a two-hour drive from Boston. The place is also a three-hour drive from New York City. On clear days, there are views of Montauk, New York to the south and Block Island, Rhode Island to the southeast. == Culture == According to The New York Times, Watch Hill was historically home to \"a select group of wealthy families.\" Their lives happened around \"golf and tennis at the Misquamicut Club, bathing and yachting at the Watch Hill Yacht Club, and tea and cocktails at Ocean House and Watch Hill's other grand hotels.\" Rich families built sprawling Victorian-style \"cottages\" along the peninsula. The village was known as \"a somewhat staid and family-oriented community\" compared to glittering Newport. The latter was Rhode Island's other, more famous summer colony. Famous guests to the seaside resort included Albert Einstein, Douglas Fairbanks, Douglas Fairbanks Jr., Groucho Marx, David Niven and Jean Harlow. For several generations, the community has maintained its \"old-money summer colony\" atmosphere. This was even as traditional summer communities have developed, namely Nantucket, Martha's Vineyard and the Hamptons. New England traditions are evident in the popular hobbies of its local people. These include golf, sailing, tennis and the \"privacy-loving multigenerational families tucked into century-old shingled houses.\" Many of these are passed down in families for several generations. The New York Times notes that \"Watch Hill impresses visitors with a strong sense of privacy and of discreetly used wealth—the rambling, old-fashioned, turreted and ginger-breaded Victorian summer houses with piazzas and softly rolling lawns have little in common with the overpowering castles of the very rich in Newport, a place rarely mentioned in Watch Hill even though it is barely 30 miles distant.\" The waterfront was once lined with huge Victorian hotels. However, fire and hurricanes destroyed almost all during the 20th century. The two remaining hotels are the Ocean House and the Watch Hill Inn. Both went through major remodels during the 2000s. The Ocean House was originally opened in 1868. it was torn down in 2005, then completely rebuilt and reopened in 2010. The Ocean House today contains both hotel rooms and condominiums. It is the only Forbes Five-Star and AAA Five Diamond Hotel in Rhode Island It was described by The New York Times as a place which \"conjures up another age, when women wore white gloves to tea and golf was a newfangled pastime.\" Celebrities have stayed for holidays at this hotel. Those include Hugh Jackman and Regis Philbin. The village is listed as a census-designated place. The Watch Hill Historic District is a historic district in the village. It is listed on the U.S. National Register of Historic Places. It is a state-charted Fire District (1901). This means the Watch Hill area is authorized to tax residents to fund their volunteer fire department. The bulk of property taxes, however, go to the town to fund municipal services and schools. ==Well-known people== Well- known present and former local people of Watch Hill include: * Taylor Swift, singer-songwriter * Conan O'Brien, television host * Andrew Mellon (1855–1937), banker, industrialist and Secretary of the Treasury * Henry Ford (1863–1947), business magnate and founder of Ford Motors * Clark Gable (1901–1960), film actor * Rebekah Harkness (1915–1982), Standard Oil heiress and founder of the Harkness Ballet ==References== Category:Villages in Rhode Island Category:History of Rhode Island Category:Census-designated places in Rhode Island Category:1745 establishments",
 "title": "Watch Hill, Rhode Island"
}