{
 "id": "875709",
 "text": "Meenakshi Ashley Harris (born October 20, 1984) is an American lawyer, children's book author, producer. and In 2017, she founded the Phenomenal Woman Action Campaign, which creates statement fashion to support charity. In 2020, Harris released her first book from HarperCollins, entitled Kamala and Maya's Big Idea, which is based on the story of her mother, Maya Harris, and aunt Kamala Harris, the 49th Vice President of the United States. == Biography == === Early life and education === She was born on October 20, 1984. Her mother, Maya Harris, is a lawyer and policy expert. Her aunt, Kamala Harris, is the current vice president of the United States. Her grandmother, Shyamala Gopalan, was an Indian-American cancer researcher and civil rights activist, and her grandfather, Donald Harris, is a Jamaican-American professor of economics at Stanford and a civil rights activist. Harris received her bachelor's degree from Stanford University in 2006, and her Juris Doctor from Harvard Law School in 2012. She graduated from Bishop O'Dowd High School in Oakland. === Career === She founded \"Phenomenal\" in 2017, naming her fashion company for a 1978 Maya Angelou poem. It then branched out to include the Phenomenal Woman Action Campaign, founded in 2017 as an organization that brings awareness to social causes. The campaign covers a range of policy issues, including educational excellence and healthcare equity, criminal justice reform, gender parity in STEM, reproductive health, and political representation. Ambassadors for the campaign include Serena Williams, Jessica Alba, Mark Ruffalo, Tracee Ellis Ross, Viola Davis, Yara Shahidi, Janelle Monae, Sarah Silverman, Debbie Allen, Rosario Dawson, Van Jones, Lizzo, Cecile Richards, and more. In September 2018, Harris also coordinated a full-page ad in the New York Times with Alicia Garza, founder of the Black Lives Matter Global Network, to demonstrate national support for Christine Blasey Ford and survivors of sexual assault. Harris also operates Phenomenal Media for written content and Phenomenal Productions for videos and visual content. In December 2020, it was announced that she and Brad Jenkins would launch a production studio called Phenomenal Productions. === Children's books === In 2020, Harris released her first children's book from HarperCollins entitled Kamala and Maya's Big Idea, which is based on the real story of her mother, Maya Harris, and aunt Kamala Harris. On January 19, 2021, she released her second children's book, Ambitious Girl. === Political advising === During Kamala Harris's successful 2016 campaign for the U.S. Senate, Harris served as a senior advisor on policy and communications. From 2016 to 2017, Harris served as a commissioner on the San Francisco Commission on the Status of Women. === Personal life === Harris is married to Nikolas Ajagu. They have two daughters, Amara and Leela. == References == Category:1984 births Category:Living people Category:Lawyers from Oakland, California Category:Writers from Oakland, California Category:Stanford University alumni Category:American children's writers Category:Kamala Harris",
 "title": "Meena Harris"
}