{
 "id": "875841",
 "text": "Teikō Shiotani (, Shiotani Teiko, 1899-1988Some sources say 22 October (an example: the chronology provided by the Teiko Shiotani Memorial Photo Gallery); others say 24 October (an example: the description provided by the publisher of Yume no kageri): both web pages accessed 24 January 2020.)According to Hepburn romanization, Shiotani's adopted personal name is written \"Teikō\". Many publications in English do not provide macrons, resulting in \"Teiko\". Following an informal convention, some other publications give it as \"Teikoh\".Tomoko Takeuji, \"Shiotani Teiko and Art Photography\"; ; within Geijutsu shashin no jidai: Shiotani-Teikō-ten katarogu () = The Age of Art Photography: Shiotani Teiko Exhibition Catalogue. Mitaka, Tokyo: Mitaka City Gallery of Art and Mitaka City Sports and Culture Foundation, 2016. Pp. 17–23 (English); pp. 9–16 . was a photographer who worked near Tottori in the late 1920s and early 1930s.Noriko Tsutatani, \"To things beloved – Shiotani Teikō 1899–1988\" (in English); \"Itoshiki mono e: Shiotani Teikō: 1899–1988\" (in Japanese, ); respectively pp. 270–279 and pp. 201–208 within Itoshiki mono e. He was a notable Japanese figure in photography.\"Shiotani Teikō to geijutsu shashin kanren nenpu\" (; Chronology of Teikō Shiotani and pictorialist photography), pp. 261–268 within Teikoh Shiotani: The Legend in Art Photography.\"Shiotani Teikō nenpu\" (; Teikō Shiotani chronology); pp. 224–231 within Yume no kageri. As time passed, ideals and fashions of photography changed and his work in this field was almost entirely forgotten in Japan after war\"Teikō Shiotani: Teikō Shiotani: Album, 1923–1973: 1975\"; pp. 178–181 within Ryūichi Kaneko and Ivan Vartanian, Japanese Photobooks of the 1960s and '70s.Ivan Vartanian, \"The Japanese photobook: Toward an immediate media\"; pp. 11–23 within Ryūichi Kaneko and Ivan Vartanian, Japanese Photobooks of the 1960s and '70s. until his works attracted interest because of a book in 1975 devoted to his work. He later became known outside Japan with the help of an exhibition of Japanese photography that travelled around Europe from 1979 to 1982. == Some selected works == * Geijutsu shashin no nenpu ( = The Heritage of Art Photography in Japan. Nihon shashin zenshū () = The Complete History of Japanese Photography 2\\. Tokyo: Shogakukan, 1986. . Despite its alternative English title, virtually all of the book is in Japanese only. Plates 115–120 (pp. 116–120) are by Shiotani. * Photo Metro, March 1988. Contains 13 pages devoted to Shiotani. * Norihiko Matsumoto, ed. A Collection of Japanese Photographs 1912–1940. Tokyo: Shashinkosha, 1990. ; . Despite its English title, the book is in Japanese only. Plates 11, 16, 38 and 40 are by Shiotani. * Geijutsu shashin no jidai: Yonago Shayūkai kaikoten: Taishō makki – Shōwa shoki (; The age of art photography: Retrospective exhibition of the Yonago Photography Circle: From the end of Taishō to early Shōwa). Yonago City Museum of Art, Yonago, Tottori, 1990. Catalogue of an exhibition. Five plates, on pp. 22, 68–69. == Publications of his works == * Itoshiki mono e: Shiotani Teikō: 1899–1988 () = To things beloved: Shiotani Teikō 1899–1988. Over three hundred plates; most texts in both Japanese and English but some in Japanese only. Edited by Noriko Tsutatani (); translated by Gavin Frew. Matsue, Shimane: Shimane Art Museum, 2017. . . The catalogue of an exhibition. * Yume no kageri: Shiotani Teikō no shashin 1899–1988 () = Teiko Shiotani. Edited by Noriko Tsutatani. Tokyo: Kyūryūdō, 2019. . With 136 plates by Shiotani. For each plate, the caption and the name of the collection from which the print comes are provided in both Japanese and English; all other text is in Japanese only. Not a catalogue, but its publication accompanied an exhibition. * Seitan 120-nen geijutsu-shashin no kamisama Shiotani Teikō to sono jidai () = The Legend in Art Photography: Teikoh Shiotani and His Contemporaries. [Yonago, Tottori]: Imai Shuppan, 2019. . The catalogue of an exhibition. With 128 pages of plates by Shiotani. For each plate, a caption is provided in both Japanese and English; all other text is in Japanese only. == Exhibitions == The list is some of the Selected Exhibitions. === Solo === * Shiotani Teikō sakuhin-ten (; Exhibition of works of Teikō Shiotani). Akasaki Agricultural Management Center (Akasaki Nōgyō Kanri Sentā, ), Akasaki, September 1971. 200 works.\"Biography\"; \"Ryakureki\" (); within The Age of Art Photography. Pp. 136–138 (English); pp. 133–135 .\"Keireki\" (, CV). Uminari no fūkei: Shiotani Teikō shashinshū () / Teikoh Shiotani Portfolio 1923–1973. Nikon Salon Books 10. Tokyo: Nikkor Club, 1984. P.3. * Shiotani Teikō kaiko-ten (; Teikō Shiotani retrospective exhibition). Yonago Art Gallery U, Yonago, Tottori. October 1971. 50 works. (The gallery belonged to Shōji Ueda.) * Shiotani Teikō meisaku-ten \"Album 1923–1973\" (; Exhibition of celebrated works by Teikō Shiotani, Album 1923–1973). Pentax Gallery, Tokyo, April 1975. In conjunction with publication of a photobook. === Joint === * Shiotani Teikō, Ueda Shōji shashin-ten (; Teikō Shiotani and Shōji Ueda photograph exhibition). Tottori Prefectural Museum, Tottori City, February 1983; , Kurayoshi, May 1983; Yonago City Museum of Art, August 1983. 100 works by Shiotani, 185 by Ueda. * Photofest 1988. Museum of Fine Arts, Houston, February–March 1988. * Geijutsu shashin no jidai: Yonago Shayūkai kaikoten: Taishō makki -- Shōwa shoki (; The age of art photography: Retrospective exhibition of the Yonago Photography Circle: From the end of Taishō to early Shōwa). Yonago City Museum of Art, Yonago, Tottori, 1990. Five prints by Shiotani. Accompanied by a catalogue. == Notes == == References == == Other websites == * Shiotani Teikō Photo Project, Teiko Shiotani Memorial Photo Gallery * Kō Ogawa (), \"Shiotani Teikō san to Okidomari, soshite sofu\" () . About Shiotani, Okidomari, and the writer's grandfather. Category:Japanese photographers Category:1899 births Category:1988 deaths",
 "title": "Teikō Shiotani"
}