{
 "id": "875846",
 "text": "Yoasobi is a Japanese music band from Japan. They have Ayase, a Vocaloid producer, and Ikura, a singer-songwriter in the band. They have created songs based on short stories that are shared on the Monogatari website. Their debut single, \"Yoru ni Kakeru\" was a massive success in Japan. It topped the charts for six consecutive weeks and earned a spot on the Billboard rankings in 2020. Their Yoasobi EP (The Book) was also a hit in 2021, reaching number two on both the Oricon Albums and Billboard Japan Hot Albums charts. This solidified their place in the Japanese music industry. == Name == The name \"Yoasobi\" comes from the Japanese word \"夜遊び\" meaning \"night life\". Ayase says that he named it as a wish that he could take on numerous playful challenges. == History == === 2019-2021 === Both members of Yoasobi had active music careers before making the group. Ayase posted his first song to the video hosting website niconico and became popular in 23 November 2019 with his song \"Last Resort\". He released his debut extended play Ghost City Tokyo (, Yūrei Tōkyō). The song reached third on the ITunes album chart. Lilas Ikuta (, Ikuta Rira) who performs under the name Ikura, had already released two extended plays. He released Rerise in 2017 and Jukebox in 2019. They released their second single \"Ano Yume o nazotte\" on 18 January, 2020 On April 20, they released short music for their third single, \"Halzion\". It was the first time that Yoasobi worked with a professional novelist, and the song was released on 11 May. On July 20, Yoasobi released their fourth single \"Tabun\". Their fifth single \"Gunjo\" was released on 1st September. The song collaborated with a Blue Period manga. On 18 December, they released their sixth single \"Haruka\" based on Osamu Suzuki's novel. They stopped releasing songs on 31 December 2020. They performed \"Yoru ni Kakeru\" in . On 6 January 2021, Yoasobi released their first physical release, \"The Book\". This included six previous singles and three new songs. This release came at number two on both Oricon Albums and Billboard Japan.It was the top of Oricon Digital Albums chart for five weeks. It also received a gold certification. === 2021-Present === Yoasobi released their seventh single, \"Kaibutsu\" on the same day of the song \"The Book\". On 20 January they opened their fan club website called Club Yoasobi (). They released an anime's ending theme song and their eighth single,\"Yasashii Suisei\", Their first concert was on 14 February at the inside of a building under construction at the former area of Shinjuku Milano for an online audience of 40 thousand people. On 24 March, they combined \"Kaibutsu\" and \"Yasashii Suisei\" and released it as a Double-CD single. It ranked number two on Oricon Singles chart. On 10th May, they released the ninth single for Fuji Tv's Morning Show titled \"Mo sukoshi Dake\". They released \"Sangenshoku\", the tenth single for NTT Docomo's Mobile Service. The English version of \"Sangenshoku\" titled \"RGB\" was released on 16 July. On 9th August, the released the eleventh single titled \"Loveletter\". They worked with Tokyo FM's Radio Show. that based on Natsumi's Novel Tashi Romance, which won Yoasobi Contest Vol.2 On 1 December, Yoasobi scheduled to release their second EP, titled \"The Book 2\". This included the singles released in 2021 and the new songs for the stage \"Moshi mo inochi ga kaketara\" with the song of the same name. Also NHK's new Children Program series, which was titled \"Tsubame\", featured five elementary school students in a special group called Midories. == References == == Other websites == * Category:Japanese pop music groups",
 "title": "Yoasobi"
}