{
 "id": "876339",
 "text": "The first lady of the Democratic People's Republic of Korea (Korean; 조선민주주의인민공화국의 영부인; Hanja: 朝鲜民主主义人民共和国第一夫人) or simply known as the first lady of North Korea, is the informal title held by the wife of the supreme leader of North Korea, during the leader's term in office. Ri Sol-ju is the current first lady of North Korea, in role since April 15, 2018, as the wife of Supreme Leader Kim Jong-un. ==Origins and history== === Establishment and formation (1963–1974) === During the leadership of the North Korean premier Kim Il-Sung, his wife Kim Song-ae took on the role and duties as the first lady in 1963, eleven years after the marriage. === Vacancy (1974–2018) === After his death in July 1994, his son, Kim Jong-il assumed on the office and duties of the supreme leader and the role of first lady was left vacant during his time in office. Kim Jong-il was married twice and had three different domestic partnerships from time to time. After his death in December 2011, his son Kim Jong-un assumed the office and duties as supreme leader and the role of first lady was re-established to his wife when North Korean officials and state media lifted her title from “comrade\" to “respected first lady”. === Reinstatement (2018–present) === The title had not been used since 1974 when it was described to Kim Song-ae. The honor occurred during the April 2018 inter-Korean Summit when Ri Sol-ju and the first lady of South Korea, Kim Jung-sook had formally met and attended the summit along with their husbands. == Origins and role == The role of the first lady is not an elected position, carries no official duties, But the first lady participates in diplomacy on behalf of meeting with foreign diplomats and accompanying her husband on foreign summits and events. However, this did not take place until March 2018, when Ri Sol-ju accompanied her husband Kim Jong-un to a foreign summit between North Korea and China. == Fashion influence == South China Morning Post sources stated that Ri Sol-ju's fashion became an instant hit after she accompanied her husband to a surprise visit to China in March 2018. During the visitation summit to China, it was said she wore a camel cropped jacket with a matching midi skirt and court shoes with a necklace, ear studs, and a shiny pink and gold butterfly-shaped brooch. Ri also wore a white jacket and an apple green dress with a brown flower-shaped ribbon brooch and a nude leather clutch and at a lunch with General Secretary of the Chinese Communist Party Xi Jinping and Chinese first lady, Peng Liyuan at the Diaoyutai State Guesthouse, where her and husband stayed, she changed into an ivory two-piece dress with floral decorations on the collar and soft frilled sleeves. ==list of first ladies of North Korea== No. Portrait First Lady Tenure Age at tenure start Supreme Leader 1 Kim Song-ae 17 December 1963 – 15 August 1974 Kim Il-sung 2 Vacant 15 August 1974 – 15 April 2018 Kim Jong-il 3 Ri Sol-ju 15 April 2018 – present Kim Jong-un ==References== * *[ No.]: Number",
 "title": "First Lady of North Korea"
}