{
 "id": "876884",
 "text": "Category:Meitei people Meidingu Loiyumba (Old Manipuri: ꯂꯣꯢꯌꯨꯝꯄ, romanized: Loiyumpa), also called Ningthou Loiyumba, was a king of the Kangleipak kingdom (now called Manipur). He ruled from 1074 CE to 1122 CE. He is most well known for making the first written constitution of Manipur, called the Loiyumpa Silyen or Loiyumba Shinyen, in 1110 CE. == Early life == Loiyumba was the son of Kainou Irengba, a former king of Kangleipak. After his father died in 1074 CE, Loiyumba became king. His rule started a new time period in Manipur called the Medieval Manipur era. == The Loiyumpa Silyen == In 1110 CE, Loiyumba made the Loiyumpa Silyen (also spelled Loiyumba Shinyen), the first written constitution in Manipur. It gave different duties to each family (Meitei: yumnak) in the kingdom. It also created departments (called loisang) for things like weaving, farming, and worship. One of the leaders named in the constitution was Roso Phishahanba. He was made the head of the weaving department. The constitution also listed many royal weavers, such as Naotam Phishapa, Ngangti Phishapa, Yangnu Phishapa, and Heisu Naha Phishapa. == Reforms and achievements == King Loiyumba made many important changes in his kingdom. * He divided the land into six parts, called panas. Each one was ruled by officials who collected taxes, made sure laws were followed, and helped the king. * He started the Lallup system in 1074 CE. It was a kind of military training. Every adult male had to join it to help defend the kingdom. * He created special clothes for heroes and hunters, such as the royal shawl called Shammi Lanmi Phi. This was made by the Khoisnam family. == Laws and justice == The Loiyumpa Silyen had strict rules to keep peace and order. Crimes like theft or lying in court were punished harshly. These laws helped the king keep control and protect the people. == Legacy == King Loiyumba is remembered as one of the most important kings in Manipur's history. His constitution and reforms helped build a strong government. Many kings after him used the Loiyumpa Silyen as a guide. His rule marked the end of Ancient Manipur and the start of the Medieval Manipur period. == See also == * Loiyumpa Silyen * Cheitharol Kumbaba * List of Manipuri kings * Ningthouja dynasty * History of Manipur == References ==",
 "title": "Loiyumba"
}