{
 "id": "87693",
 "text": "Emergency medical services in the United Kingdom are part of the National Health Service (NHS) systems. They are run by local ambulance services, known in England and Wales as trusts. Scotland, Wales and Northern Ireland have one ambulance service each; the Scottish Ambulance Service (a Special Health Board), the Welsh Ambulance Service, and the Northern Ireland Ambulance Service. England is divided into ten regional ambulance services. ==Job of the Ambulance Services== NHS ambulance services must by law answer four types of requests for care, which are: * Emergency calls to 999 (or 112) * Urgent calls from a doctor to send someone to hospital * Urgent calls from a hospital to move a patient to another facility * Major incidents The ambulance services have getting more and more busy. There has been a big increase in the number calls in the last two decades, as shown in the table below: Year Emergency Calls Source 1994/5 2.61 million 2004/5 5.62 million 2006/7 6.3 million The ambulance service's work has also been getting more complicated. In the past, the main job of an ambulance was to take people to hospital. This led to ambulance services being nicknamed the \"Big White Taxi Service\". Nowadays, ambulance staff do far more treatment with the patient. It is now common for patients to be left at home after being treated. A similar service is NHS 111. This is a phone number for non-emergency medical advice. Many ambulance services employ the staff who answer 111 calls. In some cases, an ambulance may be sent to a 111 call if it is found to be more serious than expected. Ambulance trusts may also carry out non-urgent patient transport services. This is done through a business agreement with local healthcare organisations. This service is free for patients to use. In some place private companies do this job instead, but it can be a big source of money for the trusts. ==Ambulance services== Before 1974 local councils would run the ambulance service. In 1974, they were merged into larger agencies that covered one or more counties. On 1 July 2006 the number of ambulance trusts fell from 29 to 13 and they were replaced by regional services. ===England=== Each of the 9 government regions of England are covered by a single NHS ambulance trust, with the exception of the South East region. This region is split between the South Central and South East Coast ambulance trusts, while the Isle of Wight has a special arrangement in which local hospitals provide the ambulance service. NHS Ambulance Service Trusts Ambulance Service Headquarters Ceremonial counties covered East Midlands Ambulance Service NHS Foundation Trust Nottingham Derbyshire, Leicestershire, Lincolnshire, Northamptonshire, Nottinghamshire, Rutland East of England Ambulance Service NHS Foundation Trust Melbourn (near Cambridge) Bedfordshire, Cambridgeshire, Essex, Hertfordshire, Norfolk and Suffolk Isle of Wight NHS Trust Newport Isle of Wight London Ambulance Service NHS Foundation Trust London Greater London North East Ambulance Service NHS Foundation Trust Newcastle-upon-Tyne County Durham, Northumberland, Tyne & Wear and part of North Yorkshire (Stockton-on- Tees, Middlesbrough and Redcar and Cleveland) North West Ambulance Service NHS Foundation Trust Bolton Cheshire, Cumbria, Greater Manchester, Lancashire and Merseyside South Central Ambulance Service NHS Foundation Trust Bicester Berkshire, Buckinghamshire, Hampshire and Oxfordshire South East Coast Ambulance Service NHS Foundation Trust Crawley East Sussex, Kent, Surrey and West Sussex South Western Ambulance Service NHS Foundation Trust Exeter Bristol, Cornwall, Devon, Dorset, Gloucestershire, Somerset and Wiltshire West Midlands Ambulance Service University NHS Foundation Trust Brierley Hill Herefordshire, Shropshire, Staffordshire, Warwickshire, West Midlands and Worcestershire Yorkshire Ambulance Service NHS Foundation Trust Wakefield East Riding of Yorkshire, most of North Yorkshire (County Council area and York), South Yorkshire and West Yorkshire ===Scotland=== The Scottish Ambulance Service is a Special Health Board funded directly by the Health Department of the Scottish Government. In 2006 the service answered over 520,000 emergency calls. Scotland also has Britain's only government-funded Air Ambulance service. It has two Eurocopter EC 135 helicopters (based in Glasgow & Inverness) and two Beechcraft B200C King Air planes (based at Glasgow & Aberdeen). ===Northern Ireland=== The Northern Ireland Ambulance Service (NIAS) is the ambulance service that serves the whole of Northern Ireland, and was set up in 1995. As with other ambulance services in the United Kingdom, it does not charge its patients directly for its services, but is funded through tax. NIAS has over 270 ambulances and over 1,000 staff, based across 32 stations & sub-stations, 4 Control Centres and a Regional Training Centre. ===Wales=== The Welsh Ambulance Service NHS Trust (Welsh:Ymddiriedolaeth GIG Gwasanaethau Ambiwlans Cymru) was set up on April 1, 1998 and has 2,500 staff providing ambulance and related services to the 2.9 million residents of Wales. Its headquarters are at the HM Stanley Hospital, St Asaph, Denbighshire and it is divided into three regions: *Central and West Region based at Ty Maes Y Gruffudd, Cefn Coed Hospital, Cockett, Swansea *North Region based at H.M.Stanley Hospital, St Asaph, Denbighshire *South-East Region based at Caerleon House, Mamhilad Park Estate, Pontypool ==Private Ambulance Services== Private ambulance services are becoming more common in the UK. They often provide medical cover at large events, either with, or instead of the voluntary sector providers. Some organisers use a private firm instead of a voluntary ambulance service because of wider availability during the week (sometimes difficult for a voluntary service to cover) or for a wider range of skills, such as provision of qualified Paramedics. The most common use for private ambulances is for non-urgent patient transport. Many trusts and hospitals have chosen to use a private company for these tasks. NHS ambulance services may also pay the private ambulances to answer some of their 999 calls. All ambulance companies and the NHS Ambulance trusts must follow the same laws, so a private ambulance must have the same equipment and same type of staff working in it. ==Voluntary Ambulance Services== In most of the United Kingdom, the main voluntary ambulance services are the British Red Cross and St John Ambulance. In Scotland, the main voluntary ambulance is St Andrew's First Aid. The Order of Malta Ambulance Corps. can sometimes be found in Northern Ireland also. These groups have been providing both emergency and non-emergency medical cover in the UK for over 120 years, including active service in both World Wars. This is before any government organised service. The main activity of the organisations apart from training and education, is providing ambulance cover at events, as an extension of their first aid contract. They may also treat and transport certain categories of patient to hospital, although for more serious incidents, such as cardiac arrest it is likely that they would call on the ambulance service. This is arranged through agreements with the local ambulance service. Both organisations also provide 'reserve' or 'support' cover to some, though not all, of the ambulance trusts (dependent on the local MOU), where ambulance crews from one of the organisations (who are usually volunteers, but in some instances may be paid staff) will attend 999, GP Urgent or PTS calls on behalf of the ambulance trust. In these cases the organisation is paid by the trust. This service is most often called on during major incidents, when there is a high level of staff absence or when there is an unusually high call volume, although in some areas, voluntary crews are regularly used to supplement full-time trust cover. Both organisations have also provided cover for the public when NHS ambulance trust staff have held strikes or walk outs. ==Related pages== *National Health Service *Fire service in the United Kingdom * ==References== ==Other websites== *East Midlands Ambulance Trust Official Website *East Anglia Ambulance Trust Official Website *Great Western Ambulance Trust Official Website *London Ambulance Trust Official Website *North East Ambulance Trust Official Website *North West Ambulance Trust Official Website *South East Coast Ambulance Trust Official Website *South Western Ambulance Trust Official Website *West Midlands Ambulance Trust Official Website *Yorkshire Ambulance Trust Official Website *Scottish Ambulance Service Official Website Category:National Health Service",
 "title": "Emergency medical services in the United Kingdom"
}