{
 "id": "876982",
 "text": "Dumont is a borough in Bergen County, New Jersey, United States. As of the 2020 United States census, the borough's population was 17,863, an increase of 384 (+2.2%) from the 2010 census count of 17,479, which in turn reflected a decrease of 24 (−0.1%) from the 17,503 counted in the 2000 census.Table 7. Population for the Counties and Municipalities in New Jersey: 1990, 2000 and 2010, New Jersey Department of Labor and Workforce Development, February 2011. Accessed May 1, 2023. The borough was formed on July 20, 1891, as the Borough of Schraalenburgh. It was created from parts of Harrington Township and Palisades Township. This was done because of the results of a referendum held the day before. At this time, many boroughs were created in the county. 26 boroughs were formed in the county in 1894 alone.Harvey, Cornelius Burnham. Genealogical History of Hudson and Bergen Counties, New Jersey, p. 11, New Jersey Genealogical Publishing Company, 1900. Accessed September 2, 2013. \"For a period of sixteen years following the passage of this act few boroughs were organized in the State, only three of them being in Bergen County.... As it was twenty-six boroughs were created in the county from January 23, 1894, to December 18, of the same year.\" On March 7, 1898, portions of the borough were annexed to Palisades Township.Honeyman, Abraham Van Doren. Index-analysis of the Statutes of New Jersey, 1896-1909: Together with References to All Acts, and Parts of Acts, in the 'General Statutes' and Pamphlet Laws Expressly Repealed: and the Statutory Crimes of New Jersey During the Same Period, p. 255. New Jersey Law Journal Publishing Company, 1910. Accessed October 1, 2015. On June 13, 1898, the borough's name was changed to Dumont . This was in honor of Dumont Clarke, the borough's first mayor.Snyder, John P. The Story of New Jersey's Civil Boundaries: 1606-1968, Bureau of Geology and Topography; Trenton, New Jersey; 1969. p. 76 re Dumont, p. 86 re Schraalenburgh. Accessed April 18, 2012.A Brief History of the Borough of Dumont , Borough of Dumont. Accessed September 13, 2017. \"Incorporated as the Borough of Schraalenburgh in 1894, Dumont took its present name in 1898 from its first mayor, Dumont Clarke, who was president of the American Exchange Bank and had made his home in the borough since the 1870s.\"History of Bergen County Vol. 1, p. 348.Hutchinson, Viola L. The Origin of New Jersey Place Names, New Jersey Public Library Commission, May 1945. Accessed August 29, 2015. ==References== Category:Boroughs in Bergen County, New Jersey Category:1891 establishments in the United States Category:1890s establishments in New Jersey",
 "title": "Dumont, New Jersey"
}