{
 "id": "877013",
 "text": "Shahadat (شہادت) is an Islamic holiday that occurs on the first of Muharram, the first month in the Islamic calendar. == Etymology == The Arabic word Shahadat () literally means 'martyrdom'. It is derived from Shaheed () which denotes a martyr in Islam. The word Shaheed occurs frequently in the Quran in the generic sense 'witness', but only once in the sense 'martyr'; this latter sense acquires wider use in the hadiths. In Arabic, Shaheed can mean both a 'witness' and a 'martyr'.\"The word shahid (plural shahada) has the meaning of \"martyr\" and is closely related in its development to the Greek martyrios in that it means both a witness and a martyr [...] in the latter sense only once is it attested (3:141).\" David Cook, Oxford Bibliographies == Background == On 26 Dhu al-Hijjah, when Umar ibn al-Khattab was praying in the Al-Masjid an- Nabawi, Abu Lulu stabbed him with a double-bladed dagger. describes the dagger as \"unique\", having \"two pointed sharp edges, with a handle in the middle\". Umar died of these wounds on Sunday 1st Muharram of the Islamic year 24.Kitab al-Mihan 66; Siyar A'lam al-Nubala volume 2 page 459 == Observances == Shahadat has been an official holiday in Pakistan. Rallies are held in various cities including Lahore. In 2011, Tanzeem Ahl-e-Sunnat Wal Jamaat addressed gatherings in Gilgit and demanded of the government to make arrangements for observing the martyrdom day of Umar at government level. He also demanded that a official holiday should be announced on these important days. In 2014, a number of religious scholars and groups in Lahore arranged seminars. The Sipah-e-Sahaba held out a procession from the Data Darbar which was terminated in front of the Lahore Press Club after passing through various streets of the city. In their speeches, Ulema and Mashaikh demanded that 1st Muharram be declared a public holiday. The Sunni Tehreek also took out a procession to mark the day and paid tributes to Umar. In 2020, Shahadat was officially declared a holiday in Khyber Pakhtunkhwa, Pakistan. == References == Category:Islamic calendar",
 "title": "Shahadat"
}