{
 "id": "87722",
 "text": "The Nuremberg Military Tribunals are the follow up trials of war criminals held by the United States of America in Nuremberg. The trial of the 24 Major War Criminals held by the International Military Tribunal (IMT) in Nuremberg is at Nuremberg Trials The IMT only held one trial before disagreements between the four wartime allies stopped the series of trials that were planned. The four countries occupying Germany carried on with trials of many people in their own zone of occupation. Twelve that were held by the United States are the most famous of these trials. They involved some of the most important people to be prosecuted after the 24 Major War Criminals. ==Trials== The twelve US trials in front of the Nuremberg Military Tribunal took place from December 9, 1946 to April 13, 1949. The trials were: Nuremberg Military Tribunals Nr Name Opened Closed Notes I Doctors' Trial 9 December 1946 20 August 1947 20 of the 23 on trial were medical doctors. They were accused of war crimes because they did medical experiments on prisoners of war and civilians of occupied countries, and helped in the mass murder of concentration camp inmates. They were also accused of doing the same to Germans. This was called a crime against humanity. II Milch Trial 2 January 1947 14 April 1947 Luftwaffe Field Marshall Edward Milch was accused of using slave labour, and allowing medical experiments III Judges' Trial 5 March 1947 4 December 1947 War crimes and crimes against humanity by misuse of the court and prison systems. IV Pohl Trial 8 April 1947 3 November 1947 Oswald Pohl and 17 others from the SS Administration department, which was responsible for the Concentration camps and slave labour V Flick Trial 19 April 1947 22 December 1947 Freidrick Flick and 5 other directors of Flick Kommanditgesellschaft. The Flick KG used slave labour in its mines and factories, as well as taking over factories in France, Poland and Russia, and \"Aryanisation of property\" which means getting things once owned by Jews who were forced to sell cheaply. VI IG Farben Trial 27 August 1947 30 July 1948 24 leaders of the IG Farben company charged with war crimes and crimes against humanity because of the slave labour they used, as well as stealing or plundering from occupied countries, like the Flick and Krupp companies VII Hostages Trial 8 July 1947 19 February 1948 Wilhelm List and 11 other Generals in Greece and the Balkan countries were accused of keeping hostages mass murder and deportation and destroying towns VIII Einsatzgruppen Trial 29 September 1947 10 April 1948 24 leaders of the death squads charged with mass murders which were crimes against humanity and war crimes IX RuSHA Trial 20 October 1947 10 March 1948 14 leaders of the Reich Commissioner for the Strengthening of Germanism, the Repatriation Office for Ethnic Germans (Volksdeutsche Mittelstelle, VoMi), and the Lebensborn society, charged with racial cleansing and resettlement activities which included forced abortions X Krupp Trial 8 December 1947 31 July 1948 Directors of this company were charged with being involved in the plundering, devastation, and exploitation of occupied countries, as well as taking part in the murder, extermination, enslavement, deportation, imprisonment, torture, and use for slave labor of civilians who came under German control, German nationals, and prisoners of war; XI Ministries Trial 6 January 1948 13 April 1949 21 senior civil servants who were accused of planning or helping the war, the mass murders etc. XII High Command Trial 30 December 1947 28 October 1948 14 senior officers of the German Armed Forces . They were charged with War crimes by being responsible for murder, ill-treatment and other crimes against prisoners of war and enemy belligerents, and also crimes against humanity by taking part in or ordering the murder, torture, deportation, hostage-taking, etc. of civilians in occupied countries. Category:Nazism Category:World War II Category:International law Category:1940s in Germany",
 "title": "Nuremberg Military Tribunals"
}