{
 "id": "877272",
 "text": "The following is a list of deaths that happened in February 2022. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known), and a source. ==February== ===1=== *Brian Augustyn, 67, American comic book editor and writer (The Flash, Gotham by Gaslight, Imperial Guard), stroke.Brian Augustyn, longtime DC editor and Batman - Gotham by Gaslight writer dies *Bud Clark, 90, American politician, activist and businessman, Mayor of Portland, Oregon (1985–1992), heart failure.Former Portland Mayor Bud Clark Dies at 90 *Paul Danahy, 93, American politician and lawyer, member of the Florida House of Representatives (1966–1974).Judge Paul Danahy *Remi De Roo, 97, Canadian Roman Catholic prelate, Bishop of Victoria (1962–1999).Bishop Remi De Roo dies at 97 *Lotfollah Safi Golpaygani, 102, Iranian Marja', member of the Assembly of Experts for Constitution (1979) and Secretary of the Guardian Council (1980–1985), cardiac arrest.Grand Ayatollah Safi Golpaygani Passes Away *Paolo Graziosi, 82, Italian actor (China Is Near, Italian Race, Pinocchio), COVID-19.È morto Paolo Graziosi, l'ultimo ruolo in 'Tre piani' di Moretti *Juan Iglesias Marcelo, 90, Spanish politician, Senator (1982–2000) and Mayor of Cáceres (1983–1987), multiple organ failure.Fallece el exalcalde de Cáceres Juan Iglesias Marcelo a los 90 años *Shintaro Ishihara, 89, Japanese novelist and politician, MP (1968–1975, 1976–1995, 2012–2014), Minister of Transport (1987–1988) and Governor of Tokyo (1999–2012), pancreatic cancer.石原慎太郎さんが死去 89歳 昭和生まれ初の芥川賞受賞、計9期当選、都知事4期14年 *Wilfrido Lucero, 86, Ecuadorian politician and lawyer, Mayor of Tulcán (1967–1970), Prefect of Carchi (1970–1974) and member (1979–1990, 1998–2007) and President (1988–1990, 2005–2007) of the National Congress.El expresidente del Congreso, Wilfrido Lucero, falleció *Easton McMorris, 86, Jamaican cricketer (national team).Former Windies batsman Easton 'Bull' McMorris dies *Antonio Ortega Franco, 80, Mexican Roman Catholic prelate, Auxiliary Bishop of México (2004–2019).México: falleció el obispo Antonio Ortega Franco, con fama de santidad *Wolfgang Schwanitz, 91, German politician, Head of the Stasi (1989–1990).Wolfgang Schwanitz ist tot *Tito Stagno, 92, Italian journalist and television presenter (RAI).Morto Tito Stagno, raccontò l'allunaggio *Ellen Tiedtke, 91, Polish-born German actress (Ohne Pass in fremden Betten, The Fiancee), cabaret artist (DEFA) and singer, congestive heart failure.Als Ellentie bekannte Schauspielerin Ellen Tiedtke gestorben *Larry Warner, 76, American politician, member of the Texas House of Representatives (1987–1991).Larry Logan Warner of Harlingen, Texas *Glenn Wheatley, 74, Australian entertainment businessman, talent manager (Little River Band, John Farnham) and musician (The Masters Apprentices), problems caused by COVID-19.Australian Music Industry Legend Glenn Wheatley Has Died At Age 74 *Maurizio Zamparini, 80, Italian football executive, owner of Palermo (2002–2018), problems caused by peritonitis.È morto Maurizio Zamparini, l'ex presidente di Palermo e Venezia *Jon Zazula, 69, American record label businessman, founder of Megaforce Records, problems caused by COPD, CIDP and osteopenia.Jon Zazula, Co-Founder of Metallica’s First Label Megaforce, Dead at 69 ===2=== *Djilali Abdi, 78, Algerian footballer (Bel Abbès, national team).وفاة المدرب الذي أحرز كأس الجمهورية عام 1991 *Adnan Abu Odeh, 88, Jordanian politician, Minister of Culture (1970–1972) and Senator (1974–1982).وفاة عدنان أبو عودة رئيس الديوان الملكي الأردني الأسبق *Alberto Baillères, 90, Mexican businessman, Chairman of Grupo BAL (since 1959).Fallece Alberto Baillères, expresidente de Palacio de Hierro y Grupo Bal *J. Alexander Baumann, 79, Swiss politician, MP (1995–2011), heart attack.Der «Shampoo-König» ist nicht mehr *Robert Blalack, 73, Panamanian-born American visual effects artist (Star Wars, RoboCop, The Day After), Oscar (1978) and Emmy winner (1984), problems caused by cancer.Robert Blalack, Oscar-Winning Visual Effects Artist on ‘Star Wars,’ Dies at 73 *Frank Bradford, 80, American politician, member of the Georgia House of Representatives (1997–1999).Frank Bradford *Ramesh Deo, 93, Indian actor (Anand, Aap Ki Kasam, Mere Apne), heart attack.Anand actor Ramesh Deo dies at 93 *Trude Feldman, 97, American reporter (The New York Times, The Washington Post) and columnist, member of the White House Press Corps (1968–2007).In Memory of Trude B. Feldman (death announced on this date) *Bill Fitch, 89, American Hall of Fame basketball coach (Cleveland Cavaliers, Boston Celtics, Houston Rockets), NBA champion (1981).Bill Fitch dies: Coach of Celtics’ 1981 championship team was 89 *Ed Foreman, 88, American politician, member of the United States House of Representatives from Texas's 16th congressional district (1963–1965) and New Mexico's 2nd congressional district (1969–1971).Former congressman Ed Foreman — who represented southern New Mexico and west Texas — dies at 88 *Ezio Frigerio, 91, Italian art director and costume and set designer (Cyrano de Bergerac).Ezio Frigerio, the great theatre designer, dies at 91 *Willie Leacox, 74, American rock drummer (America).Former America Drummer Willie Leacox Dead at 74 (death announced on this date) *Olivier Léonhardt, 58, French politician, Mayor of Sainte-Geneviève-des-Bois (2001–2017) and Senator (since 2017), cancer.Le sénateur de l'Essonne Olivier Léonhardt est mort à l'âge de 58 ans *Tilden Santiago, 81, Brazilian trade unionist and politician, Deputy (1991–2003) and Ambassador to Cuba (2003–2006), respiratory failure caused by COVID-19. *Noel Treacy, 70, Irish politician, TD (1982–2011) and Minister of State for Finance (1987–1989, 1992–1993) and European Affairs (2004–2007). *Klaas Tuinstra, 76, Dutch politician, MP (1986–1994).Oud- Kamerlid Klaas Tuinstra (CDA) overleden *Monica Vitti, 90, Italian actress (L'Avventura, The Girl with the Pistol, The Pizza Triangle), problems caused by Alzheimer's disease.Monica Vitti Dies: Italian Screen Icon Of 1960s Classics Was 90 *Jochen Wolf, 80, German politician, member of the Landtag of Brandenburg (1990–1994), heart attack.Ex-Minister Jochen Wolf tot in seiner Wohnung in Brandenburg an der Havel aufgefunden ===3=== *Lauro António, 79, Portuguese filmmaker (Morning Undersea).Morreu o cineasta Lauro António *Herbert Benson, 86, American medical doctor and cardiologist, heart disease and kidney failure.Dr. Herbert Benson, who documented and promoted meditation’s health benefits, dies at 86 *Dieter Mann, 80, German actor (Der letzte Zeuge, Downfall, 13 Semester), problems caused by Parkinson's disease.Schauspieler Dieter Mann gestorben *Iwao Matsuda, 84, Japanese politician, MP (1986–1996) and member of the House of Councillors (1998–2010), problems caused by hypoglycemia.元科学技術担当相・松田岩夫氏が死去 *Anthony J. Mercorella, 94, American politician, member of the New York State Assembly (1966–1972) and New York City Council (1973–1975).Anthony J. Mercorella *Madis Milling, 51, Estonian television and radio presenter and politician, MP (since 2015), cardiac arrest.Riigikogu member, volunteer rescue worker dies *Antonio Miró, 74, Spanish fashion designer, heart attack.Muere Toni Miró, icono de la moda catalana *Mike Moore, 80, American baseball executive, President of the National Association of Professional Baseball Leagues (1991–2007).Former MiLB president Mike Moore passes away *Renée Pietrafesa Bonnet, 83, French- Uruguayan composer and pianist.A los 83 años falleció la compositora y pianista Renée Pietrafesa *Frank Pietrzok, 57, German politician, member of the Bürgerschaft of Bremen (1999–2005), paragliding accident.Fallece un político alemán en un accidente de parapente en Colombia *Abu Ibrahim al- Hashimi al-Qurashi, 45, Iraqi Islamic militant, Leader of the Islamic State (since 2019), suicide by explosion.Islamic State leader Abu Ibrahim al- Qurayshi killed in Syria, US says *Sir Duncan Rice, 79, Scottish academic, President of University of Aberdeen (1996–2010).Obituary: Sir Duncan Rice *Christos Sartzetakis, 92, Greek lawyer and politician, President (1985–1990), acute respiratory failure.Former president Christos Sartzetakis dead at 92 *Ludmila Vaňková, 94, Czech writer.Zemřela autorka historických románů Ludmila Vaňková. Bylo jí 94 let *Francisco Raúl Villalobos Padilla, 101, Mexican Roman Catholic prelate, Bishop of Saltillo (1975–1999), COVID-19. ===4=== *Ashley Bryan, 98, American educator, children's writer and illustrator (Freedom Over Me), congestive heart failure.Ashley Bryan, children's illustrator and author, has died at 98 *Leland Christensen, 62, American politician, member of the Wyoming Senate (2011–2019), problems caused by COVID-19.Former state Sen. Leland Christensen dies of COVID-19 complications *Avern Cohn, 97, American politician and lawyer, Judge of the U.S. District Court for Eastern Michigan (since 1979).'Titan of the federal bench' U.S. District Judge Avern Cohn dies after long career *Jason Epstein, 93, American editor (Random House) and publisher (Doubleday), co-founder of the Espresso Book Machine, congestive heart failure.Jason Epstein, Editor and Publishing Innovator, Is Dead at 93 *Neil Faulkner, 64, British archaeologist, historian, and writer, blood cancer.Neil Faulkner (death announced on this date) *Don Johnston, 85, Canadian politician and lawyer, MP (1978–1988), President of the Liberal Party (1990–1994) and Secretary-General of the OECD (1996–2006).Donald Johnston, first non-European to head OECD, passes away *Georges Labazée, 78, French educator and politician, Deputy (1981–1985) and Senator (2011–2017).Georges Labazée, ancien président du conseil départemental des Pyrénées-Atlantiques est mort *Ana Carmen Macri, 105, Argentine politician, Deputy (1952–1955).Falleció la exdiputada y fundadora Partido Peronista Femenino Ana Macri *Srboljub Nikolić, 56, Serbian footballer (HNK Šibenik, FK Bor) and manager (Jasenica).Tužna vijest Preminuo bivši fudbaler Ljubića, Leotara i Sloge *Jerzy Osiatyński, 80, German-born Polish politician, Deputy (1989–2001) and Minister of Finance (1992–1993).Nie żyje prof. Jerzy Osiatyński. Miał 81 lat *Paul Overgaard, 91, American politician, member of the Minnesota House of Representatives (1963–1969) and State Senate (1971–1973).Paul Overgaard ===5=== *Mavie Bardanzellu, 83, Italian actress (Beatrice Cenci, The Battle of Sinai, Shadows Unseen).Lutto a Luras e nel mondo del cinema, scomparsa l’attrice Mavie Bardanzellu *David Fuller, 80, American politician, member of the Montana Senate (1983–1987), problems caused by COVID-19.David E. \"Spike\" Fuller *Todd Gitlin, 79, American sociologist, political activist and writer, problems caused by cardiac arrest and COVID-19.Todd Gitlin, prominent activist and thinker, dead at 79 *Angélica Gorodischer, 93, Argentine feminist writer, cancer.Murió Angélica Gorodischer, una de las referentes de la literatura argentina *John Honderich, 75, Canadian newspaper publisher and editor (Toronto Star).Former Toronto Star publisher and editor John Honderich dead at 75 *Raymond A. Jordan, 78, American politician, member of the Massachusetts House of Representatives (1975–1994). *Boris Melnikov, 83, Russian fencer, Olympic champion (1964).Умер олимпийский чемпион 1964 года по фехтованию Борис Мельников *Abdizhamil Karimuly Nurpeisov, 97, Kazakh writer and translator.Abdizhamil Nurpeisov, ‘Kazakh Faulkner,’ Founder of Pen Club Dies in Almaty ===6=== *Angiolo Bandinelli, 94, Italian politician, Secretary of the Radical Party (1969–1970, 1971–1973) and Deputy (1986–1987).Addio a Angiolo Bandinelli, il più originale dei radicali *Haven J. Barlow, 100, American politician, member of the Utah House of Representatives (1952–1955) and State Senate (1955–1994).Former Utah lawmaker Haven Barlow dies at 100 *Maria Carrilho, 78, Portuguese politician, MP (1995–1999, 2005–2009) and MEP (1999–2004).Morreu ex-deputada do PS Maria Carrilho *George Crumb, 92, American composer (Ancient Voices of Children, Black Angels, Makrokosmos), Pulitzer Prize for Music (1968) and Grammy winner (2001).George Crumb, Prolific Avant-Garde Composer, Dies at 92 *Charles B. Deane Jr., 84, American lawyer and politician, member of the North Carolina Senate (1971–1975).Charles Bennett Deane, Jr. *Bruce Greig, 54, American death metal guitarist (Misery Index, Dying Fetus).Bruce E. Greig *Ronnie Hellström, 72, Swedish footballer (Hammarby, 1. FC Kaiserslautern, national team), esophageal cancer.Ronnie Hellström har dött *Syl Johnson, 85, American blues singer (\"Take Me to the River\", \"That's Why (I Love You So)\"), musician and record producer, congestive heart failure.Chicago Blues, Soul Legend Syl Johnson Dies at 85 *Abram Khasin, 98, Russian chess international master and correspondence grandmaster.Ушел из жизни заслуженный тренер СССР Абрам Иосифович Хасин (1923-2022) *Frank McAtamney, 87, New Zealand rugby union player (Otago, national team).Francis McAtamney *Ryszard Kubiak, 71, Polish rowing coxswain, Olympic bronze medalist (1980).Zmarł medalista olimpijski, sportowiec Zawiszy. Był odznaczony Medalem Prezydenta Bydgoszczy *Lata Mangeshkar, 92, Indian playback singer (Parichay, Kora Kagaz, Lekin...), composer and politician, MP (1999–2005), multiple organ failure caused by COVID-19.Lata Mangeshkar passes away at 92 *Kazuhiko Masumoto, 85, Japanese politician, member of the House of Representatives (1972–1976), bile duct cancer.増本一彦氏が死去 元衆院議員 *Abdelmalek Ali Messaoud, 66, Algerian footballer (USM Alger, USM Annaba, national team).وفاة اللاعب الدولي السابق لكرة القدم عبد المالك علي مسعود *Alice Moretti, 100, Swiss politician, member of the Grand Council of Ticino (1971–1987).Addio a Alice Moretti *Hans Neuenfels, 80, German novelist, poet and theatre director. *Zdzisław Jan Ryn, 83, Polish psychiatrist and politician, Ambassador to Chile (1991–1997) and Argentina (2007–2008).Zmarł prof. Zdzisław Jan Ryn, wybitny psychiatra, dyplomata i podróżnik *Henry Thillberg, 91, Swedish footballer (Malmö, national team), heart failure.Fotbollsprofil från Trelleborg har avlidit – gjorde 22 landskamper *Ilmārs Verpakovskis, 63, Latvian footballer (FK Liepājas Metalurgs, RAF Jelgava, national team).Ilmārs Verpakovskis (1958 - 2022) *John Vinocur, 81, American journalist (The Wall Street Journal, International Herald Tribune, The New York Times), sepsis.John Vinocur, Foreign Correspondent and Editor, Dies at 81 ===7=== *Noel Allanson, 96, Australian footballer (Essendon) and cricketer (Victoria).Vale Noel Allanson *Jacques Calonne, 91, Belgian composer, singer and actor (Camping Cosmos).Décès de l'artiste montois Jacques Calonne, plus jeune membre de CoBrA *Rex Cawley, 81, American athlete, Olympic champion (1964).Rex Cawley (death announced on this date) *Chen Shih-yung, 73, Taiwanese politician and lawyer, County Magistrate of Chiayi (1989–1993).嘉義縣前縣長陳適庸過世 享壽74歲 *Boris Deich, 83, Romanian-born Ukrainian politician, MP (2002–2014), COVID-19.Сегодня рано утром умер Борис Дейч *William H. Folwell, 97, American Episcopal prelate, Bishop of Central Florida (1970–1989).William Folwell, Retired Central Florida Bishop, Dies at 97 *Ivan Hudec, 74, Slovak politician and writer, Minister of Culture (1994–1998).Vo veku 74 rokov zomrel bývalý minister kultúry, spisovateľ Ivan Hudec *Hans-Ulrich Klose, 86, German politician, member of the Landtag of North Rhine-Westphalia (1985–2005).Landtag trauert um früheren Vizepräsidenten Dr. Hans-Ulrich Klose *Praveen Kumar Sobti, 74, Indian actor (Michael Madana Kama Rajan, Mahabharat), Olympic athlete (1968, 1972) and politician, Asian Games champion (1966, 1970), cardiac arrest.'Mahabharat' actor Praveen Kumar Sobti dies *Margarita Lozano, 90, Spanish actress (Viridiana, A Fistful of Dollars, Napoleon and Me).Adiós a Margarita Lozano, la actriz más hipnótica del cine español *Günter Maschke, 79, German political scientist (Nouvelle Droite) and journalist (Frankfurter Allgemeine Zeitung, Junge Freiheit), problems caused by diabetes.Der Verfassungsfeind als Intellektueller *Jamal Al-Muhaisen, 72, Palestinian politician, Governor of Nablus Governorate (2007–2009).وفاة القيادي في فتح الدكتور جمال المحيسن *Robert Mulcahy, 89, American college athletics administrator (Rutgers University).Former Rutgers athletics director Bob Mulcahy dead at 85 *Zbigniew Namysłowski, 82, Polish jazz musician and composer.Zbigniew Namysłowski nie żyje. Legendarny jazzman miał 82 lata. \"Planował koncerty w najbliższych tygodniach\" *Bruce Owen, 90, Canadian politician and lawyer, Ontario MLA (1987–1990), problems caused by a heart attack.Longstanding Barrie politician, Bruce Owen, dies at 90 *Douglas Trumbull, 79, American special effects supervisor (2001: A Space Odyssey, Blade Runner) and movie director (Silent Running), stroke caused by brain cancer.Douglas Trumbull, Who Pioneered VFX on ‘2001,’ ‘Blade Runner’ and ‘Close Encounters,’ Dies at 79 ===8=== *Arnaldo Arocha, 85, Venezuelan politician, Deputy (1969–1974, 1984–1989) and Governor of Miranda (1971–1974, 1990–1995).Falleció este #8Feb el exgobernador de Miranda Arnaldo Arocha *Sérgio Barcelos, 78, Brazilian politician, Deputy (1991–2003), cardiac arrest caused by heart surgery.Sérgio Barcellos, ex- deputado federal pelo Amapá, morre aos 78 anos *Javier Berasaluce, 91, Spanish footballer (Deportivo Alavés, Racing de Santander, Real Madrid).Fallece Javier Berasaluce, portero pentacampeón de Europa con el Real Madrid *Borivoj Dovniković, 91, Croatian movie director, animator and caricaturist.Preminuo je čuveni Borivoj Dovniković - Bordo, jedan od naših najpoznatijih vizualnih umjetnika *Leonid Filimonov, 86, Russian politician, Soviet Minister of Oil and Gas Industry (1989–1991) and Tomsk Deputy (1997–2001).Экс-глава \"Томскнефти\" Леонид Филимонов ушел из жизни *Boris Furmanov, 85, Russian politician, Minister of Architecture, Construction, and Housing (1991–1992).Ушел из жизни первый министр архитектуры и строительства России Фурманов *Bamber Gascoigne, 87, British television presenter (University Challenge) and writer (The Great Moghuls).Bamber Gascoigne, former University Challenge quizmaster, dies at 87 *Ricky Hunter, 85, Canadian professional wrestler.‘Gladiator’ Ricky Hunter Dies *Bill Lienhard, 92, American basketball player, Olympic champion (1952).Bill Lienhard, former Kansas men's basketball player and 1952 national champion, dies at 92 *Luc Montagnier, 89, French virologist, co-discovered HIV, Nobel Prize recipient (2008).Luc Montagnier, codécouvreur du virus du sida et Prix Nobel de médecine en 2008, est mort *Azita Raji, 60, Iranian-born American politician, banker and philanthropist, U.S. Ambassador to Sweden (2016–2017).Statement on the passing of former U.S. Ambassador to Sweden Azita Raji (death announced on this date) *Jackie Robinson, 94, American basketball player, Olympic champion (1948).Jack Robinson *Hélio Rosas, 92, Brazilian politician, Deputy (1987–1999)Morre Hélio César Rosas, ex-deputado federal e sócio da Rádio Difusora de Assis *Gerhard Roth, 79, Austrian writer.Gerhard Roth ist tot *David Rudman, 78, American-Russian sambo wrestler.Умер основатель центра образования \"Самбо-70\" Давид Рудман *Götz Werner, 78, German businessman, co- founder of dm-drogerie markt.dm-Gründer Götz Werner ist tot ===9=== *Jim Angle, 75, American journalist (Fox News).Fox News Channel original Jim Angle dead at 75 *Abune Antonios, 94, Eritrean Christian leader, Patriarch of the Eritrean Orthodox Tewahedo Church (2004–2006).Patriarch of the Eritrean Orthodox Church Abune Anotnios passes away *Valerio Carrara, 70, Italian politician, Senator (2001–2013).Addio a Valerio Carrara, aveva 70 anni: fu senatore e sindaco di Oltre il Colle *Betty Davis, 77, American funk soul singer-songwriter (\"They Say I'm Different\", \"Nasty Gal\"), cancer.Betty Davis, trailblazing queen of funk, dead at 77 *Johnny Ellis, 61, American politician, member of the Alaska House of Representatives (1987–1993) and State Senate (1993–2017), cardiac arrest caused by prostate cancer and multiple sclerosis.Former state Sen. Johnny Ellis has died *Jeremy Giambi, 47, American baseball player (Oakland Athletics, Kansas City Royals, Philadelphia Phillies), suicide by gunshot.Former MLB player Jeremy Giambi dies at 47, agent says *Javier Gonzales, 55, American politician, Mayor of Santa Fe (2014–2018), cancer.Former Santa Fe mayor dies from cancer *Alicia Hermida, 89, Spanish actress (Maribel and the Strange Family, Black Humor, El bosque animado).Muere Alicia Hermida, la querida Valentina de Cuéntame *Joseph Horovitz, 95, Austrian-born British composer, conductor and academic.Joseph Horovitz (1926–2022) *Fabio Duque Jamarillo, 71, Colombian Roman Catholic prelate, Bishop of Armenia (2004–2012) and Garzón (since 2021), problems caused by an infection.Bishop Fabio Duque Jaramillo, O.F.M. † *Jan Magiera, 83, Polish Olympic cyclist (1964, 1968).Dramat w Mostkach koło Starego Sącza. Nie żyje olimpijczyk Jan Magiera. Jego życie zgasło w ogniu *Ian McDonald, 75, English rock musician (King Crimson, Foreigner).Ian McDonald, King Crimson and Foreigner Founding Member, Dies *Peter Neilson, 67, British-born New Zealand politician and businessman, MP (1981–1990) and Minister of Customs (1989–1990), Works and Revenue (1990).Peter Neilson Obituary *Nora Nova, 93, Bulgarian-German singer, Eurovision contestant (1964).Почина легендата Нора Нова *Johnny Raper, 82, Australian Hall of Fame rugby league player (St George, New South Wales, national team), problems caused by dementia.Rugby league Immortal Johnny Raper dead at 82 *Super Muñeco, 59, Mexican professional wrestler (AAA, WWA).Muere Súper Muñeco, legendario luchador mexicano *André Wilms, 74, French actor (Life Is a Long Quiet River, Monsieur Hire, Europa Europa) and comedian.Décès d'André Wilms, comédien fétiche d'Aki Kaurismäki ===10=== *Herb Bergson, 65, American politician, Mayor of Superior (1987–1995) and Duluth (2004–2008), problems caused by cancer surgery.Former Duluth Mayor, Herb Bergson, Dies at 65 *Evgeniya Brik, 40, Russian actress (Stilyagi, Yolki 1914, Friday), cancer.Умерла актриса Евгения Брик *Olivia Cajero Bedford, 83, American politician, member of the Arizona House of Representatives (2003–2011) and State Senate (2011–2019).'Stalwart' former legislator Olivia Cajero Bedford dies at 83 *Henry Danton, 102, British classical dancer.Remembering Henry Danton (1919–2022) *Dale Doig, 86, American teacher and politician, Mayor of Fresno, California (1985–1989).Former Fresno Mayor Dale Doig, who appeared on miniseries ‘Fresno,’ dies at age 86 *Sir Manuel Esquivel, 81, Belizean politician, MP (1984–1998), Prime Minister (1984–1989, 1993–1998), and Leader of the Opposition (1989–1993).Former Prime Minister Right Honourable Sir Manuel Esquivel passes *Olsen Filipaina, 64, New Zealand rugby league player (Balmain, North Sydney Bears, national team), kidney failure.New Zealand rugby league legend Olsen Filipaina dies after battling kidney failure *Duvall Hecht, 91, American rower and publisher, Olympic champion (1956), founder of Books on Tape.Duvall Hecht, whose daily grind to L.A. led to Books on Tape, dies at 91 *Eduard Kukan, 82, Slovak politician, Minister of Foreign Affairs of Slovakia (1994, 1998–2006), MP (1994–1998, 2006–2009) and MEP (2009–2019), 2004 presidential candidate, heart attack.Zomrel Eduard Kukan, trojnásobný minister zahraničných vecí *Nikolai Manoshin, 83, Russian footballer (Torpedo Moscow, CSKA Moscow, Soviet Union national team) and manager.РФС выражает соболезнования родным и близким Николая Маношина *Tom McCormick, 96, American politician, member of the New Hampshire House of Representatives (2002–2004).Thomas Ferguson McCormick *Mino Milani, 94, Italian journalist (Corriere della Sera, La Domenica del Corriere, La Provincia Pavese), writer, and cartoonist.Addio allo scrittore Mino Milani, aveva 94 anni *Ingvar Oldsberg, 76, Swedish television presenter (På spåret, Bingolotto) and sports commentator.Ingvar Oldsberg är död *Waverly Person, 95, American seismologist, co-founder of the National Earthquake Information Center.Waverly Johnson Person Obituary *Francesco Samà, 81, Italian politician, Mayor of Melissa (1964–1970) and Deputy (1983–1992).Addio a Ciccio Samà, leader della sinistra calabrese *Stefan Żywotko, 102, Polish football manager (Arkonia Szczecin, Warta Poznań, JS Kabylie).Stefan Żywotko nie żyje ===11=== *Lucien Degauchy, 84, French politician, Deputy (1993–2017).L'ancien député et maire Lucien Degauchy est mort *Addai II Giwargis, 74, Iraqi Catholicos prelate, Patriarch of the Ancient Church of the East (since 1972).Irak: Assyrischer Patriarch Mar Addai II. Giwargis verstorben *Lula, 75, Brazilian footballer (Internacional, national team) and manager (Itaperuna), cardiac arrest.Morre Lula, ponta-esquerda bicampeão brasileiro com o Inter *Ted Mappus, 95, American businessman and politician, member of the South Carolina House of Representatives (1987–1991).Theodore Tobias Mappus Jr. *Pedro Villagrán, 75, Spanish politician, Senator (2004–2008).Muere a los 75 años Pedro Villagrán, médico y exsenador del PSOE ===12=== *Rahul Bajaj, 83, Indian businessman and politician, Chairman of Bajaj Group (1965–2021) and MP (2006–2010), Padma Bhushan recipient (2001), pneumonia.Industrialist Rahul Bajaj, Former Chairman Of Bajaj Group, Dies At 83 *William G. Batchelder, 79, American politician, member (1969–1998, 2007–2014) and Speaker (2011–2014) of the Ohio House of Representatives.Former Ohio House Speaker William Batchelder dies at 79 *Frank Beckmann, 72, German-born American radio host and broadcaster (WJR), problems caused by vascular dementia.WJR's longtime voice Frank Beckmann dies at 72 *Valerie Boyd, 58, American writer and biographer (Zora Neale Hurston).Valerie Boyd, Zora Neale Hurston biographer, dead at 58 *Javier Gómara Granada, 95, Spanish politician, lawyer and businessman, Deputy (1982–1986) and President of the Navarrese Parliament (1987–1991).Fallece Javier Gómara, cofundador y primer presidente de UPN *Tomás Osvaldo González Morales, 86, Chilean Roman Catholic prelate, Bishop of Punta Arenas (1974–2006), COVID-19.Fallece el padre obispo emérito de Punta Arenas, Tomás González Morales *Makoto Hasebe, 70, Japanese politician, Mayor of Yurihonjō (2009–2021), heart attack.前由利本荘市長の長谷部誠氏が死去 ７０歳 *Francis Xavier Sudartanta Hadisumarta, 89, Indonesian Roman Catholic prelate, Bishop of Malang (1973–1988) and Manokwari–Sorong (1988–2003).Lutti nell’episcopato *Carmen Herrera, 106, Cuban-born American artist.Carmen Herrera, Cuban-Born Artist Who Won Fame at 89, Dies at 106 *Tatsu Ishimoda, 97, Japanese politician, member of the House of Representatives (1972–1976), problems caused by Alzheimer's disease.石母田達氏死去（元共産党衆院議員） *Zinaida Kiriyenko, 88, Russian actress (And Quiet Flows the Don, Fate of a Man, Chronicle of Flaming Years) and singer, stroke caused by COVID-19.Скончалась актриса Зинаида Кириенко *Ivan Reitman, 75, Czechoslovakian-born Canadian movie director, screenwriter and producer (Ghostbusters, Twins, Kindergarten Cop), founder of The Montecito Picture Company.Ivan Reitman, Producer, 'Ghostbusters' Director, Dies At 75 *Hugo Torres Jiménez, 73, Nicaraguan Sandinista guerrilla and Armed Forces general.Nicaragua dissident jailed under Ortega dies in prison: family *Antoni Vadell Ferrer, 49, Spanish Roman Catholic prelate, Auxiliary Bishop of Barcelona (since 2017), pancreatic cancer.Muere el obispo auxiliar de Barcelona Antoni Vadell i Ferrer a los 49 años *Nolan Williams, 80, American politician, member of the Alabama House of Representatives (1975–1995).R. Nolan Williams Jr. ===13=== *Berit Berthelsen, 77, Norwegian Olympic athlete (1964, 1968), European Athletics bronze medalist (1969).Fakta om Berit Berthelsen *Dasril Panin Datuk Labuan, 74, Indonesian politician, member of the People's Representative Council (1982–1987, 1993–2003).Wakil Bupati Dharmasraya Dasril Panin Datuk Labuan Meninggal Dunia *Emanuel Marx, 94, German-born Israeli social anthropologist, Israel Prize winner (1998). *Aled Roberts, 59, Welsh politician, AM (2011–2016) and Language Commissioner (since 2019).Welsh Language Commissioner Aled Roberts passes away *Enzo Robutti, 88, Italian actor (Il Profeta, Tell Me You Do Everything for Me, Dog's Heart).Addio a Enzo Robutti, caratterista dal Derby a Pierino al Padrino III *Eduardo Romero, 67, Argentine golfer (PGA Tour, European Tour) and politician, Mayor of Villa Allende (since 2015), problems caused by cancer.Murió a los 67 años el ex golfista Eduardo \"Gato\" Romero *Halyna Sevruk, 92, Uzbek-born Ukrainian artist (Sixtiers).Умерла скульптор- монументалист Галина Севрук ===14=== *Harold V. Camp, 86, American politician, member of the Connecticut House of Representatives (1969–1975).Herbert Viets Camp Jr. *Alan J. Greiman, 90, American politician and lawyer, member of the Illinois House of Representatives (1972–1987).Hon. Alan Joel Greiman *Borislav Ivkov, 88, Serbian chess Grandmaster.Tuga, Srbija ostala bez VELEMAJSTORA pred kojim su padali svi svetski velikani: Preminuo slavni Bora Ivkov *Julio Morales, 76, Uruguayan footballer (Racing Club de Montevideo, Austria Wien, national team).Falleció Julio César “Cascarilla” Morales a los 76 años de edad, multicampeón con Nacional *Željko Mijač, 68, Croatian footballer (Hajduk Split, Rijeka) and manager (Standard Liège).Tužna vijest: Preminuo Željko Mijač *Richard Mulder, 83, American politician, member of the Minnesota House of Representatives (1995–2002).Dr. Richard D. \"Doc\" Mulder *Sandy Nelson, 83, American rock drummer (\"Teen Beat\", \"Let There Be Drums\").Noted drummer Nelson dies *Daniel Passent, 83, Polish journalist (Polityka), writer and politician, Ambassador to Chile (1997–2002).Nie żyje dziennikarz Daniel Passent. Miał 83 lata *Robert E. Rose, 82, American lawyer and politician, Lieutenant Governor of Nevada (1975–1979).Former Nevada chief justice, ex-Lt. Gov. Robert Rose dies *Charles Yohane, 48, Zimbabwean footballer (AmaZulu, Bidvest Wits, national team), shot.Charles Yohane: Ex- Zimbabwe footballer killed in South Africa ===15=== *David Chidgey, Baron Chidgey, 79, British politician, MP (1994–2005) and member of the House of Lords (since 2005).Former Eastleigh MP David Chidgey dies aged 79 *Youhanna Golta, 85, Egyptian Coptic Catholic hierarch, Auxiliary and Curial Bishop of Alexandria (1986–2020).Lutto nell’episcopato *Arnaldo Jabor, 81, Brazilian movie director (Pindorama, All Nudity Shall Be Punished, Tudo Bem), screenwriter and producer, problems caused by a stroke.Famosos lamentam a morte de Arnaldo Jabor *Jeong Changhwa, 81, South Korean politician, MP (1981–1992, 1998–2004).정창화 전 한나라당 원내총무 별세 *Bappi Lahiri, 69, Indian singer- songwriter, record producer and composer (Asha O Bhalobasha, Disco Dancer, Namak Halaal), lung infection caused by obstructive sleep apnea.Bappi Lahiri passes away at 69 in Mumbai Hospital *Juan Carlos Lallana, 83, Argentine footballer (national team).Luto en el Deportivo Cali: falleció el exdelantero argentino Juan Carlos Lallana *Peter Merseburger, 93, German journalist and author.Langjähriger »Panorama«-Moderator TV-Journalist Peter Merseburger ist tot *P. J. O'Rourke, 74, American political satirist, journalist, and author (Parliament of Whores, Give War a Chance), lung cancer.P.J. O'Rourke, influential satirist and commentator, dies at 74 *Alfred Sole, 78, American movie director (Alice, Sweet Alice, Pandemonium) and production designer (Veronica Mars).R.I.P. Alfred Sole, director of Alice, Sweet Alice, has passed away at 78 *Woodrow Stanley, 71, American politician, Mayor of Flint (1991–2002) and member of the Michigan House of Representatives (2009–2014).Former Flint Mayor Woodrow Stanley remembered as a ‘true public servant’ *Józef Zapędzki, 92, Polish sport shooter, Olympic champion (1968, 1972).Nie żyje Józef Zapędzki, dwukrotny mistrz olimpijski ===16=== *Vasilis Botinos, 77, Greek footballer (Olympiacos Volos, Olympiacos, national team), COVID-19.Πέθανε ο Βασίλης Μποτίνος *John Bowler, 85, English football executive, Chairman of Crewe Alexandra (1987–2021).John Bowler: Former Crewe Alexandra chairman dies, at 85 *Cristina Calderón, 93, Chilean Yaghan writer, last living full-blooded Yahgan person, COVID-19.Fallece a los 93 años Cristina Calderón, la última hablante del idioma Yagán *Michel Deguy, 91, French poet, editor (Les Temps modernes) and translator.Le poète et philosophe Michel Deguy est mort *Walter E. Dellinger III, 80, American politician, lawyer and academic, Assistant Attorney General for Legal Counsel (1993–1996) and Acting Solicitor General (1996–1997). *Luigi De Magistris, 95, Italian Roman Catholic cardinal, Regent (1979–2001) and Pro-Major Penitentiary (2001–2003) of the Apostolic Penitentiary.Lutto nel mondo della chiesa sarda, è morto a Cagliari a 95 anni Luigi De Magistris *Harry E. Goldsworthy, 107, American Air Force lieutenant general.Harry Goldsworthy *Gail Halvorsen, 101, American Army Air Force pilot (Berlin Blockade), Congressional Gold Medalist (2014), respiratory failure.Rosinenbomber-Pilot Gail Halvorsen im Alter von 101 Jahren verstorben *Esmaeil Jabbarzadeh, 61–62, Iranian politician, MP (1992–2008) and Governor of East Azerbaijan (2013–2017), cardiac arrest.اسماعیل جبارزاده درگذشت *Andrey Lopatov, 64, Russian basketball player, Olympic bronze medalist (1980).Не стало Андрея Лопатова (death announced on this date) *Didier-Léon Marchand, 96, French Roman Catholic prelate, Bishop of Valence (1978–2001).⚫Nécrologie : Décès de Monseigneur Marchand, évêque émérite de Valence *Américo Martín, 84, Venezuelan politician, Deputy (1979–1984).Muere a los 84 años Américo Martín, destacado abogado, político y escritor venezolano *John Aloysius O’Mara, 97, Canadian Roman Catholic prelate, Bishop of Thunder Bay (1976–1991) and Saint Catharines (1991–2002).Most Reverend John O'Mara *Amos Sawyer, 76, Liberian politician and academic, Interim President (1990–1994), cardiac arrest. *Jack Smethurst, 89, English actor (Love Thy Neighbour, Man About the House, King Ralph) and comedian.Sitcom star Jack Smethurst dies aged 89 ===17=== *Romāns Apsītis, 83, Latvian lawyer and politician, MP (1993–1998), Minister of Justice (1994–1995) and Ombudsman (2007–2011).Скончался соавтор декларации о независимости Латвии Роман Апситис (death announced on this date) *David Brenner, 59, American movie editor (Born on the Fourth of July, Man of Steel, Independence Day), Oscar winner (1990).David Brenner, Oscar-Winning Film Editor for Oliver Stone, Dies at 59 *Steve Burtenshaw, 86, English footballer (Brighton & Hove Albion) and manager (Sheffield Wednesday, Queens Park Rangers).Former Brighton and Arsenal man Steve Burtenshaw dies *Fausto Cigliano, 85, Italian singer, guitarist and actor (Maid, Thief and Guard, Cerasella, Passione).È morto Fausto Cigliano, l'ultimo maestro della canzone napoletana *Máté Fenyvesi, 88, Hungarian footballer (Ferencvárosi, national team) and politician, MP (1990–1992, 1998–2006).Meghalt a Ferencváros VVK-győztes, Európa-bajnoki bronzérmes labdarúgója *Gerardo Humberto Flores Reyes, 96, Guatemalan Roman Catholic prelate, Bishop of Verapaz (1971–2001).Fallece Monseñor Gerardo Flores, obispo emérito de La Verapaz *Jim Hagedorn, 59, American politician, member of the U.S. House of Representatives from Minnesota's 1st congressional district (since 2019), kidney cancer.US Rep. Hagedorn dies at age 59 *Sudhir Joshi, 81, Indian politician, Mayor of Mumbai (1973–1974).Mumbai: Shiv Sena leader former minister Sudhir Joshi no more *František Václav Lobkowicz, 74, Czech Roman Catholic prelate, Bishop of Ostrava-Opava (since 1996).Zemřel ostravsko-opavský biskup Mons. František Václav Lobkowicz O.Praem *Giuseppe Ros, 79, Italian boxer, Olympic bronze medalist (1964), COVID-19.Conegliano, l’ex pugile Bepi Ros muore di Covid sei giorni dopo il fratello *Martin Tolchin, 93, American journalist (The New York Times) and newspaper founder (The Hill), cancer.Martin Tolchin, Former Times Reporter and a Founder of The Hill, Dies at 93 *Henny Trayles, 84, German-born Uruguayan-Argentine actress (Verano del '98, Floricienta, Graduados) and comedian.A los 84 años falleció Henny Trayles, actriz de \"Floricienta\" y \"Verano del 98\" ===18=== *Gabriel Bach, 94, German-born Israeli politician and lawyer, Judge of the Supreme Court (1982–1997).Former High Court judge Gabriel Bach dies at 94 *Luigi Di Bartolomeo, 79, Italian politician, President of Molise (1992–1993), Senator (2006–2008) and Mayor of Campobasso (2009–2014).Morto ex presidente della Regione Molise Gino di Bartolomeo *Daniel LeMahieu, 75, American politician, member of the Wisconsin State Assembly (2003–2015).Daniel Roy LeMahieu *Mauri, 87, Spanish footballer (Athletic Bilbao, national team).Fallece Mauri, leyenda de los 'once aldeanos' del Athletic *Billy McEwan, 70, Scottish footballer (Rotherham United, Chesterfield) and manager (Sheffield United), Parkinson's disease.Former Darlington manager Billy McEwan dies aged 70 (death announced on this date) *Boris Nevzorov, 72, Russian actor (Find and Neutralize, Stalingrad, The Fool) and movie director, problems caused by COVID-19.Умер народный артист России Борис Невзоров *Lindsey Pearlman, 43, American actress (Chicago Justice, The Ms. Pat Show, Selena: The Series), suicide by sodium nitrite overdose.Lindsey Pearlman, US TV actor, found dead after being reported missing *Zdzisław Podkański, 72, Polish politician, MP (1993–2004) and MEP (2004–2009).Zmarł Zdzisław Podkański. Miał 72 lata *Héctor Pulido, 79, Mexican footballer (Cruz Azul, Club Jalisco, national team) and manager.Luto en Cruz Azul, fallece Héctor Pulido Leyenda de La Máquina Celeste *Tom Veitch, 80, American comic book writer (The Light and Darkness War, Animal Man, Star Wars) and novelist, COVID-19.Writer, Poet, Spiritualist Tom Veitch Passes (1941 – 2022) *Gennadi Yukhtin, 89, Russian actor (The Rumyantsev Case, Spring on Zarechnaya Street, Ballad of a Soldier), problems caused by COVID-19.Умер актер Геннадий Юхтин, игравший в \"Весне на Заречной улице\" ===19=== *Joey Beauchamp, 50, English footballer (Oxford United, Swindon Town, West Ham United).United legend Joey Beauchamp dies aged 50 *David Boggs, 71, American electrical and radio engineer, co-inventor of Ethernet, heart failure.David Boggs, Co-Inventor of Ethernet, Dies at 71 *David Bradley, 69, American politician, member of the Arizona House of Representatives (2003–2011) and State Senate (2013–2021), cancer.Former Arizona Senator David T. Bradley dies at 69 *Gary Brooker, 76, English pop rock singer-songwriter (\"A Whiter Shade of Pale\", \"Conquistador\") and pianist (Procol Harum), cancer.Gary Brooker MBE *Jean-Luc Brunel, 75, French model scout, suicide by hanging.Caso Epstein, l'ex agente di top model Brunel si impicca in cella a Parigi *Emile Francis, 95, Canadian Hall of Fame ice hockey player, coach (New York Rangers), and executive (Hartford Whalers, St. Louis Blues).Hockey Hall of Famer Emile Francis Dies at Age 95 *Dan Graham, 79, American visual artist.Dan Graham, Conceptual Artist Who Bent Time and Space, Dies at 79 *Franz Grave, 89, German Roman Catholic prelate, Auxiliary Bishop of Essen (1988–2008).Langjähriger Adveniat-Bischof Franz Grave gestorben *Adlene Harrison, 98, American politician, Mayor of Dallas (1976).Adlene Harrison, first woman to serve as Dallas mayor, dies at 98 *Patrick Hughes, 78, Irish cricketer (national team).The death has occurred of Lewis Patrick (Podge) Hughes *Xavier Marc, 74, Mexican actor (Two Mules for Sister Sara, The Bridge in the Jungle, The Legend of Zorro).Fallece el actor mexicano Xavier Marc *Kakuichi Mimura, 90, Japanese footballer (Toho Titanium, national team) and manager.元サッカー日本代表選手の三村恪一さん死去 90歳 1956年メルボルン五輪メンバ *Jacques Poos, 86, Luxembourgian politician, Minister of Finances (1976–1979) and Foreign Affairs (1984–1999) and Deputy Prime Minister (1984–1999).L'ancien ministre Jacques Poos est mort *Irma Rosnell, 94, Finnish politician, MP (1954–1987).Irma Rosnell on poissa *Charley Taylor, 80, American Hall of Fame football player (Washington Redskins).Charley Taylor dies at 80 *Karl Vaino, 98, Estonian politician, First Secretary of the Communist Party (1978–1988).Suri endine Eesti kommunistliku partei juht Karl Vaino (death announced on this date) *Gerhard Wächter, 75, German politician, MP (2002–2009).CDU im Kreis Paderborn trauert um Gerhard Wächter ===20=== *Eduardo Bonomi, 73, Uruguayan politician, Minister of Labour (2005–2009) and Interior (2010–2020) and Senator (since 2020), cardiac arrest.Esta madrugada, falleció el exministro del interior, Eduardo Bonomi *Jamal Edwards, 31, British businessman, DJ and writer, founder of SB.TV, heart attack.SB.TV founder Jamal Edwards dead at 31 *Joni James, 91, American pop singer (\"Why Don't You Believe Me?\", \"Almost Always\", \"Is it Any Wonder?\").Joni James, popular songstress of the 1950s, dies at 91 *Oleksandr Sydorenko, 61, Ukrainian swimmer, Olympic champion (1980), COVID-19.В Мариуполе умер олимпийский чемпион по плаванию ===21=== *Nava Arad, 83, Israeli politician, MK (1981–1992, 1995–1996).הלכה לעולמה חברת הכנסת לשעבר נאוה ארד *Bob Beckel, 73, American political commentator (The Five, USA Today), campaign manager, and civil servant.Bob Beckel, Ex-Democratic Party Strategist Turned Fox News Host, Dies at 73 *Stewart Bevan, 73, British actor (Doctor Who, Emmerdale, The Ghoul).Doctor Who actor Stewart Bevan dies, aged 73 (death announced on this date) *Chor Yuen, 87, Hong Kong movie director (Emperor and His Brother, The Duel of the Century, Perils of the Sentimental Swordsman), screenwriter and actor, problems caused by dementia.著名導演兼演員楚原逝世享年87歲 1956年投身演藝成就非凡 *Paul Farmer, 62, American medical anthropologist, heart attack.Dr. Paul Farmer, who devoted his life to fighting deadly epidemics, has died. He was 62 *Miguel Gallardo, 66, Spanish comic book writer (El Víbora). Muere el dibujante Miguel Gallardo, creador de Makoki y de ‘María y yo’ *Yevgeny Kozlovsky, 92, Russian geologist and politician, Minister of Geology (1975–1989).Ушёл из жизни человек, стоявший у истоков превращения России в энергетическую сверхдержаву *Mekapati Goutham Reddy, 50, Indian businessman and politician, Andhra Pradesh MLA (since 2014), heart attack caused by COVID-19.Andhra Pradesh Industries Minister Mekapati Goutham Reddy passes away *Sir Richard Shepherd, 79, British politician, MP (1979–2015).Sir Richard Shepherd obituary *Anatoliy Turusin, 82, Russian politician, Deputy (1990–1993) and MP (1994–1999).Умер Анатолий Турусин, бывший депутат Госдумы от Иркутской области *Abdul Waheed, 85, Pakistani field hockey player, Olympic champion (1960).Pakistan’s hockey Olympian Abdul Waheed Khan dies at 85 ===22=== *The Amazing Johnathan, 63, American magician and stand-up comedian, subject of The Amazing Johnathan Documentary, problems caused by cardiomyopathy.Groundbreaking Vegas magician The Amazing Johnathan dies at 63 *David Banks, 74, British newspaper editor (Daily Mirror) and broadcaster, pneumonia.David Banks *Jesús Tirso Blanco, 64, Argentine-born Angolan Roman Catholic prelate, Bishop of Lwena (since 2007).Jesus Tirso Blanco, Bishop of Luena, has died *Julio Cruz, 67, American baseball player (Seattle Mariners, Chicago White Sox).Former Seattle Mariners and Chicago White Sox infielder Julio Cruz dies at age 67 *Ivan Dziuba, 90, Ukrainian literary critic, editor (Encyclopedia of Modern Ukraine) and politician, member of the National Academy of Sciences of Ukraine (since 1991) and Minister of Culture (1992–1994).Помер літературознавець, дисидент, Герой України Іван Дзюба *Anna Karen, 85, South African-born English actress (EastEnders, On the Buses, Carry On), house fire.Anna Karen dead: EastEnders and On the Buses star killed in horror blaze in Ilford *K.P.A.C Lalitha, 73, Indian actress (Amaram, Shantham, Kadinjool Kalyanam), problems caused by diabetes and liver disease.കെ.പി.എ.സി ലളിത അന്തരിച്ചു *Mark Lanegan, 57, American folk rock singer-songwriter (\"Nearly Lost You\") and musician (Screaming Trees, The Gutter Twins).Mark Lanegan, Singer for Screaming Trees and Queens of the Stone Age, Dies at 57 *Alberto Lembo, 77, Italian politician, Deputy (1994–2001).Sabato l'addio ad Alberto Lembo, ex parlamentare vicentino e studioso poliedrico *Germain Marc'hadour, 100, French priest and writer, founder of Moreana.Monsieur Germain Marc'hadour *Lasse Näsi, 91, Finnish politician, Mayor of Sodankylä (1968–1993) and MP (1991–1995).Maakuntaneuvos Lasse Näsi on kuollut *Geraldo Sarno, 83, Brazilian movie director and screenwriter (Colonel Delmiro Gouveia), problems caused by COVID-19.Cineasta Geraldo Sarno morre aos 83 anos ===23=== *Sheila Benson, 91, American journalist and movie critic (The Los Angeles Times).Sheila Benson, former L.A. Times film critic, dies at 91 *Tatiana Birshtein, 93, Russian molecular scientist.Прощаемся с Татьяной Максимовной Бирштейн *Juan Pablo Colmenarejo, 54, Spanish journalist (Onda Cero, Cadena COPE), problems caused by a cerebral infarction.Muere Juan Pablo Colmenarejo a los 54 años de edad a causa de un infarto cerebral *José Isidro Guerrero Macías, 71, Mexican Roman Catholic prelate, Bishop of Mexicali (since 1997), COVID-19.Fallece el obispo de Mexicali por COVID19 *Britta Schall Holberg, 80, Danish politician, Minister of the Interior (1982–1986) and Agriculture (1986–1987) and MP (1984–1988, 2005–2011).Godsejer og tidligere minister Britta Schall Holberg er død, 80 år gammel: Hun var engageret lige til det sidste *George Kinley, 84, American politician and businessman, member of the Iowa House of Representatives (1971–1973) and State Senate (1973–1992).George R. Kinley *Rehman Malik, 70, Pakistani FIA official and politician, Minister of Interior (2008–2013) and Senator (since 2018), respiratory failure caused by COVID-19.Former interior minister Rehman Malik dies at 70 *Oleksiy Skrypnyk, 57, Ukrainian businessman and politician, CEO of Eleks (until 2014) and Deputy (2014–2019), blood clot.Умер экс-депутат Верховной Рады Алексей Скрипник *Antonietta Stella, 92, Italian operatic soprano.Obituary: Legendary Soprano Antonietta Stella Dies at 92 *Joeli Vidiri, 48, Fijian rugby union footballer (Counties Manukau, national team, New Zealand national team), problems caused by COVID-19.Former All Black Vidiri dies aged 48 *Jorge Zabalza, 78, Uruguayan guerrilla and politician, oesophageal cancer.Falleció Jorge Zabalza, exguerrillero tupamaro *Ion Adrian Zare, 62, Romanian footballer (Bihor Oradea, Siófok, national team) and manager.Fotbalul românesc este în doliu! Fostul internaţional Ioan Zare a încetat din viaţă ===24=== *Valentin Bakulin, 77, Russian politician, member of the Supreme Soviet of the Soviet Union (1989–1991) and Federation Council (2001–2004).Памяти товарища: Валентин Иванович Бакулин *Dmitry Debelka, 46, Belarusian wrestler, Olympic bronze medalist (2000).Белорусский борец, бронзовый призер Олимпиады Дмитрий Дебелка скончался на 47-м году жизни (death announced on this date) *Francisco Dias Alves, 86, Brazilian politician, São Paulo MLA (1978–1982) and Deputy (1982–1988).Guarulhos perde o ex-deputado Professor Dias *Sally Kellerman, 84, American actress (M*A*S*H, Back to School, Brewster McCloud), heart failure.Sally Kellerman, Hot Lips Houlihan in ‘M*A*S*H,’ Dies at 84 *Ivanka Khristova, 80, Bulgarian shot putter, Olympic champion (1976) and bronze medalist (1972).Ivanka Khristova *John Landy, 91, Australian middle- distance runner and politician, Governor of Victoria (2001–2006), Olympic bronze medalist (1956), problems caused by Parkinson's disease.Athletics great John Landy dies, aged 91 *Henry Lincoln, 92, British, screenwriter (Doctor Who) and author (The Holy Blood and the Holy Grail) and actor (The Avengers).Henry Soskin (death announced on this date) *Eduardo Mirás, 92, Argentine Roman Catholic prelate, Archbishop of Rosario (1993–2005), problems caused by COVID-19.Murió el arzobispo emérito de Rosario monseñor Eduardo Mirás, quien estaba internado por Covid *Gary North, 80, American Christian social theorist and economist, prostate cancer.Gary North, RIP *Nida Patcharaveerapong, 77, Thai actress (The Fallen Leaf, Ghost of Mae Nak, Bangkok Love Stories: Innocence), drowned.อาลัย แตงโม นิดา นางเอกสาวนักสู้ พบร่างแล้วเสียชีวิต *Vitaly Skakun, 25, Ukrainian Ground Forces soldier, explosion.Ukrainian soldier blew himself up on bridge to block advancement of Russian tanks *Cliff Stanford, 67, British businessman, co-founder of Demon Internet.UK internet pioneer Cliff Stanford has died *Va'aiga Tuigamala, 52, Samoan-born New Zealand rugby league (Wigan Warriors) and union (New Zealand national team, Samoan national team) player.Va’aiga Tuigamala, dual-code rugby legend, dies aged 52 *Tony Wrigley, 90, British historian and demographer.A tribute to Sir Tony Wrigley ===25=== *Hemananda Biswal, 82, Indian politician, Chief Minister of Odisha (1989–1990, 1999–2000) and MP (2009–2014), problems caused by pneumonia.Former chief minister of Odisha Hemananda Biswal passes away *Gérard-Joseph Deschamps, 92, Canadian Roman Catholic prelate, Bishop of Daru (1966–1999) and Bereina (1999–2002).Bishop Gérard-Joseph Deschamps, S.M.M. † *Farrah Forke, 54, American actress (Wings, Heat, Lois & Clark: The New Adventures of Superman), cancer.Farrah Forke, ‘Wings’ and ‘Lois & Clark’ Actor, Dies at 54 *Shirley Hughes, 94, English illustrator and children's writer (Dogger), Kate Greenaway Medalist (1977, 2003). *Lionel James, 59, American football player (San Diego Chargers).Lionel James, former Auburn football player, passes away *Nancy Achin Sullivan, 63, American politician, member of the Massachusetts Senate (1991–1993), problems caused by breast cancer.Nancy E. Achin *Dimitris Tsovolas, 79, Greek politician and lawyer, MP (1977–1992, 1996–2000), Minister of Finance (1985–1989), founder and President of the DIKKI (1995–2004), stomach cancer.Πέθανε ο Δημήτρης Τσοβόλας ===26=== *Ralph Ahn, 95, American actor (Lawnmower Man 2: Beyond Cyberspace, Amityville: A New Generation, New Girl) and teacher.3·1절 앞두고 도산 안창호 선생 막내아들 안필영 옹 별세(종합) *Moss Cass, 95, Australian politician, MP (1969–1983) and Minister for the Environment (1972–1975) and Media (1975).The Deceased Whitlam Ministers *Jānis Cakuls, 95, Latvian Roman Catholic prelate, Apostolic Administrator (1990–1991) and Auxiliary Bishop (1991–1993) of Riga.Mūžībā aizgājis bīskaps Jānis Cakuls *Lee O-young, 88, South Korean politician, critic and novelist, Minister of Culture (1989–1990), multiple myeloma.Ex- Culture Minister Lee O-young dies at 89 *Danny Ongais, 79, American Hall of Fame racing driver (NHRA, Formula One, CART), congestive heart failure.Indianapolis 500 veteran Danny Ongais, 79 *Antonio Seguí, 88, Argentine cartoonist and painter.Murió Antonio Seguí, el gran embajador del arte argentino *Snootie Wild, 36, American rapper (\"Yayo\", \"Made Me\"), shot. *Donald Walter Trautman, 85, American Roman Catholic prelate, Auxiliary Bishop of Buffalo (1985–1990) and Bishop of Erie (1990–2011).Former Erie Bishop Donald Trautman Dies at Age 85 ===27=== *Herman Abdullah, 71, Indonesian politician, Mayor of Pekanbaru (2001–2011).Istri Almarhum Herman Abdullah Berlinang Air Mata Saat Ikuti Pemakaman Secara Militer di TMP *Ichiro Abe, 99, Japanese judoka.Ichiro Abe Sensei Has Passed Away *Richard C. Blum, 86, American investor, Regent of the University of California (since 2002) and founder of Blum Capital, lung cancer.Dianne Feinstein's husband, Richard Blum, dies after battle with cancer *Veronica Carlson, 77, British actress (Dracula Has Risen from the Grave, The Horror of Frankenstein, Frankenstein Must Be Destroyed) and model.Iconic Hammer Horror actress Veronica Carlson dies aged 77 as tributes pour in *José Carlos Castanho de Almeida, 91, Brazilian Roman Catholic prelate, Bishop of Itumbiara (1987–1994) and Araçatuba (1994–2003).Bispo Dom José Carlos Castanho de Almeida morre aos 91 anos em Sorocaba *Ned Eisenberg, 65, American actor (Law & Order: Special Victims Unit, Limitless, Flags of Our Fathers), problems caused by bile duct cancer and ocular melanoma.Ned Eisenberg Dies: Actor On ‘Law & Order: SVU’, Broadway And In Clint Eastwood Films Was 65 *Kenneth B. Ellerbe, 61, American firefighter, Fire Chief of the D.C. FEMS (2011–2014).Former DC Fire & EMS Chief passes away *Marietta Giannakou, 70, Greek politician, Minister of Health (1990–1991) and Education (2004–2007) and MEP (2009–2014), heart attack caused by a subdural hematoma. *Sonny Ramadhin, 92, Trinidadian cricketer (West Indies).Former West Indies spinner Sonny Ramadhin dies, aged 92 *Nick Zedd, 63, American filmmaker (Geek Maggot Bingo), author and painter, cirrhosis caused by liver cancer and hepatitis C.Murió Nick Zedd, el artista del underground, padre del cine de la transgresión ===28=== *Abuzed Omar Dorda, 77, Libyan politician, Prime Minister (1990–1994) and Permanent Representative to the United Nations (1997–2003).وفاة أبوزيد دوردة في القاهرة عن عمر ناهز 78 عاما *Kim Jung-ju, 54, South Korean businessman, founder of Nexon.Nexon founder Kim Jung-ju dies at 54 *John A. Murphy, 95, Irish historian and politician, Senator (1977–1982, 1987–1993).Historian and former senator John A Murphy dies aged 95 *Bhichai Rattakul, 95, Thai politician, Minister of Foreign Affairs (1975, 1976), Deputy Prime Minister (1983–1990, 1997–2000) and Speaker of the House of Representatives-President of the National Assembly (2000), lung cancer.Former Democrat leader Bhichai dies aged 96 *Yadlapati Venkata Rao, 102, Indian politician, Andhra Pradesh MLA (1967–1983) and MP (1998–2004).Former MP Yadlapati Venkat Rao passes away ==Months== * January ==Related pages== * List of deaths due to COVID-19 * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 * Deaths in 2020 * Deaths in 2021 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *02 Category:February 2022 events",
 "title": "Deaths in February 2022"
}