{
 "id": "87786",
 "text": "Antipsychotic drugs or Neuroleptics are drugs that act on the central nervous system, and that usually have sedating properties. The name neuroleptic was introduced in 1955. From the 1990s, the term antipsychotic is the name that is more commonly used instead. Neuroleptics make the patient calm. In many of the conditions they are used for, the patients lose touch with reality. This is called psychosis. As the name suggests, antipsychotics are also used to lessen the symptoms of psychosis. Today, they are mostly used for the treatment of psychosis, as it occurs in schizophrenia and bipolar disorder. They can also be used to treat depression and mood swings. Commonly they are also used for the following classes of conditions: * Obsessive–compulsive disorder and Tourette syndrome * Depression and personality disorders * ADHD in children * Autism-spectrum disoders (mostly against irritability, and self-harming behavior) == History == The first inventor of this drug was William Perkin whom at the time (1856) was 18 when he made it, when the chemical group was first made, it was only a dye which was coloured blue or mauve.David Cunningham Owens and Eve C. Johnstone The development of antipsychotic drugs Brain Neurosci Adv. 2018 Jan-Dec; 2: 2398212818817498. Published online 2018 Dec 5. doi: 10.1177/2398212818817498 W. Perkins began \"the aniline dye industry\".Michael Titford George Grubler and Karl Hollborn: Two Founders of the Biological Stain Industry Journal of Histotechnology, 16:2, 155-158, DOI: 10.1179/his.1993.16.2.155 At a place named Rhône-Poulenc Laboratories either Charpentier, Courvoisier, Koetschet or Paul Charpentier invented chlorpromazine during 1951, or, during December 1950.Francisco López-Muñoz, Cecilio Alamo, Eduardo Cuenca, Winston W Shen, Patrick Clervoy, Gabriel Rubio History of the discovery and clinical introduction of chlorpromazine Ann Clin Psychiatry. 2005 Jul-Sep;17(3):113-35. doi: 10.1080/10401230591002002.Thomas A Ban Fifty years chlorpromazine: a historical perspective Neuropsychiatr Dis Treat. 2007 Aug; 3(4): 495–500.Mary V Seeman History of the dopamine hypothesis of antipsychotic action World J Psychiatry. 2021 Jul 19; 11(7): 355–364. Published online 2021 Jul 19. doi: 10.5498/wjp.v11.i7.355 They were trying to make a new antihistamine but discovered that it was a good anesthetic for surgery. In 1952, a director of a mental hospital named Jean Delay gave chlorpromazine to 38 patients and they all showed improvement of their symptoms. Antipsychotics were previously described as \"major tranquilisers\" but the use of this name was stopped because the effect isn't in fact to make people experience tranquility.Psychoses and related disorders National Institute for Health and Care Excellence, Manchester, EnglandD. T. Okpako p.452 In: Principles of Pharmacology: A Tropical Approach Cambridge University Press, 22 Feb 1991 ISBN 0521340950 Antipsychotics were the first drugs that allowed to treat people with psychoses. Beforehand, people with an acute psychose would be given cold showers, against their wlll, or they might be chained to a wall. In the Middle Ages, they would be whipped. Sometimes, people might say that they were possessed, and they might then be burned at the stake. Up to the middle of the 20th century, people would be put in a psychiatric hospital. The only \"treatment\" available was locking them up and sedating them. They would then no longer pose a threat to themselves, or to others. Especially in the United States, lobotomy was done. This is a special kind of surgery to the brain where they attempt to \"remove\" the mental illness from the brain. This often had serious side effects, such as severe brain damage. Anything and everything anti of psychotic began after Canstatt created the word psychosis for 1841.Martin Bürgy The Concept of Psychosis: Historical and Phenomenological Aspects Schizophrenia Bulletin, Volume 34, Issue 6, November 2008, Pages 1200–1210, https://doi.org/10.1093/schbul/sbm136 \"Canstatt C., Handbuch der Medizinischen Klinik, 1841 Stuttgart, Germany\" == References == Category:Drugs used in psychiatry",
 "title": "Antipsychotic"
}