{
 "id": "878162",
 "text": "The orange-eyed leaf frog, blue-sided tree frog, or blue-sided leaf frog (Agalychnis annae) is a frog that lives in Costa Rica. Scientists have seen it between 780 and 1650 meters above sea level. People sometimes keep these frogs as pets. ==Appearance== The adult male frog is 73.9 mm long from nose to rear end and the adult female frog is 84.2 mm long. The fronts of the faces of male and female frogs have different shapes: females' are rounder. This frog has disks on all its front and back toes for climbing. The frog's skin is green on its back but it has many colors on its underside: lavender, pink, orange and blue down the sides. It has green, blue, and orange on its front feet. It has yellow stripes on its front and back legs. Its belly is yellow to orange in color. ==Behavior== This frog hides during the day and looks for food at night. It lives in forests up in the hills, but scientists have also seen it in city parks and lots. ==Young== The female frog lays eggs on plant leaves or branches hanging above the water, 47 to 162 eggs at a time. The eggs are green when she lays them and turn light brown as the tadpole gets ready to hatch. When they do hatch, they fall off the plant into the water. The tadpoles have dark brown heads and blue color on their bodies. In a laboratory, the tadpoles take 247 days to become frogs, but scientists think it is probably faster in the wild. ==Threats== This frog is in danger of dying out for many reasons. First, human beings build things and graze animals in the forests where they live. Second, climate change is also changing their forests. Third, there is more ultraviolet radiation than there used to be, and this hurts the frog. Fourth, the disease chytridiomycosis. Chytridiomycosis is caused by a fungus that did not come from South America. People brought it there by accident. Fifth, people also brought the fish Xiphophorus hellerii to Costa Rica. This fish eats the frog's tadpoles. Sixth, the fly Megaselia scalaris eats the frog's eggs. ==References== Category:Frogs of South America",
 "title": "Blue-sided leaf frog"
}