{
 "id": "878224",
 "text": "Ebreichsdorf is a town and surrounding Gemeinde (local community) south of Vienna, in the district of Baden in Lower Austria in Austria. The Gemeinde had 11,422 people living in it at the beginning of 2021. Of those people, 5,381 were living in the town. ==Etymology== The town's name comes for Knight Eberich. ==History== People were already living in the area in the Bronze Age (about 3,000 years ago). Artifacts from that time include the Ebrrichsdorf gold treasure. This includes a golden drinking vessel that was made in the same way as other cups from the Baltic Sea at the time. It is decorated with a picture of the sun and its rays. The beginnings of a castle were noted in AD 1157,August Landgraf (1973) \"DIE WASSERBURGEN DES 13. UND 14. JAHRHUNDERTS IM OSTEN NIEDERÖSTERREICHS,\" Burgen und Schloesser 1973/I:5-18, p. 7. PDF from JSTOR with fortification towers and other changes added over time. August Landgraf (1973) \"DIE WASSERBURGEN DES 13. UND 14. JAHRHUNDERTS IM OSTEN NIEDERÖSTERREICHS,\" Burgen und Schloesser 1973/I:5-18, p. 8. PDF from JSTOR The building no longer stands. In the 18th century, making cotton and wool cloth was important, so people built a large water mill in Ebreichsdorf. During the Second World War, the castle was plundered. Between 1959 and 1963, it was rebuilt as a private residence. In 2000, the area experienced an earthquake with a magnitude greater than 4. ) Maria-Theresia APOLONER , Jean- Baptiste TARY & Götz BOKELMANN (2015) \"Ebreichsdorf 2013 Earthquake Series: Relative Location,\" Austrian Journal of Earth Sciences 108/2: 199-208. DOI: 10.17738/ajes.2015.0021 In 2013, the area experienced an earthquake of local magnitude 4.2 Jean Baptiste TARY, Maria-Theresia APOLONER & Götz BOKELMANN (2015) \"Earthquake Interactions during the 2013 Ebreichsdorf Aftershock Sequence,\" Austrian Journal of Earth Sciences 108/2: 209-218. DOI: 10.17738/ajes.2015.0022 ==Government== The current (since 2010) mayor is Wolfgang Kocevar, a member of the Social Democratic Party of Austria (German: Sozialdemokratische Partei Österreichs [zoˈtsi̯aːldemoˌkraːtɪʃə parˌtaɪ ˈøːstəraɪçs], SPÖ), political party. ==References== Category:Settlements in Lower Austria",
 "title": "Ebreichsdorf"
}