{
 "id": "878348",
 "text": "Kaumaram is a Hindu denomination that focuses on the deity of love and war Kumara, also known as Murugan (in South India), Kandan, or Kadamban, or Kartikeya. Most devotees of Kumara also revere members of his family: Parvati, Shiva, and Ganesha. The important theological texts relating to Kumara are a part of the Shaiva agama canon. This sub-tradition is found among the Tamils, Kannada, Vedda in South India, Sri Lanka, and among the Tamil diaspora worldwide. The love story of Kumara/Murugan and his wife Valli, a girl from a local tribe, is immensely popular in Tamil Nadu and South India. Thiruppugazh is one of the important Tamil literary work on Kaumaram. == Association with Tamil language == According to local legends and Tamil folklore, Kartikeya is regarded as a veteran and a guardian of the languageKartikeya#Sangam Tamil literature that is believed to have been founded by the sage Agastya,Agastya - Agastya and The Tamil Language | Global OnenessAgastya with the blessings of Kartikeya. He is considered the patron of the Tamils, due to his worship being widespread among those of Tamil descent. == Legend of Kartikeya == According to the Skanda Purana, Kartikeya Muruga was the second son of Shiva and Parvati younger brother to Ganesha. According to the Puranic sources, he incarnated as six sparks emanating from the Third eye of Lord Shiva.Skanda Purana or Kartika Purana According to the Skanda Purana, Muruga imprisoned Brahma, protected Vishnu from the asuras and taught the Pranava Mantram to Shiva. Thus Muruga is considered superior to the Trimurti. The worshippers of Lord Muruga are called Kaumaras. == Worship traditions == Tamil Nadu has six primary temples for Kartikeya that are known by the name Aru Padai Veedu, which that translates roughly as \"the Six Stations\". Modes of worship include Kavadi that is a form of dance, Alagu which is a sharp piece of metal that one pierces on the body, carrying milk and water on the heads to offer to the deity and involves a Satvic diet. Thaipusam is an occasion that is celebrated in Kaumaram. This is much more prevalent in the Murugan Temple in Malaysia. Another chief period of worship is the Shashti. This is a period of six days when villages in South India with primary Kartikeya deities come together for a celebration. The people involved take a vow on following a vegetarian diet for the period. The six days portray events from the life of Kartikeya. The chief parts covered are the ceremonies in which he is awarded the Spear Shakti Vel by his mother Shakthi, the killing of the demon Surapadman, and his marriage. Other than this, Karnataka, that is another prominent place for Kaumaras, would have its own mode of worship. Trekking the Kumara Parvatha where he is believed to have attained Mukthi giving up his life is popular although not essentially in a very traditional manner. == Literature and arts == The primary works in Sanskrit related to Kaumaram are Skanda Puranam detailing the history of Kartikeya and Kumārasambhava, a poem by the Sanskrit scholar Kalidas that literally translates as \"The Creation of Kumara\" or \"the Creation of the Son/Boy\". Adi Shankara wrote a piece on Kartikeya called Subramanya Bhujangam . In Tamil, abundant literature is to be found both in the classical texts and in the folklore. The Skanda Puranam was translated into Tamil. Chief contributors to the classical Tamil texts include Arunagirinathar who wrote hymns of praise with complicated grammar patterns and alliteration and onomatopoeia. Tamil folk music have hymns written praising the beauty and bravery of Kartikeya. Another chiefly written topic is the way he fell in love and converted his bride Valli. There is a dedicated tune called \"Kavadi Sindhu\" that is usually used to sing such hymns. This tune became associated with celebrations and dances. == Paramparai and Sampradayam == Lord Muruga in his great mercy and compassion responds to his devotees without the need for a mortal guru. He is the Supreme Guru of the Universe and responds to his devotees in ways that suit their consciousness best. There only is one Sampradaya in the Kaumara faith, that which begins from Lord Muruga Himself. Unfortunately, today the Kaumara faith has lost the glory and majesty it once possessed. It has merged largely into Shaivism. However, ancient texts such as the Kumara Tantra and the Skanda Sadbhava Tantra does give significant insight on the Kaumara faith in its original sense. == Pranava Mantram == There's an anecdote where Shiva pretends to forget the significance of the mantra Om and asks little Kartikeya. The young boy astounds everyone by showing Shiva that it is the source of all creation. This earns him the name Thagappan Swami or Swami Naadha meaning he outdid his father. == Notes == == References == == Other websites == * * Murugan devotion * Murugan devotion, Temples, Songs, Festivals * ST Temple, Dedicated to Murugan, Singapore Category:Hinduism Category:Hindu mythology",
 "title": "Kaumaram"
}