{
 "id": "87849",
 "text": "Arthur Seyss-Inquart/Arthur Seyß-Inquart (born Arthur Seyß-Inquart on 22 July 1892–16 October 1946) was a prominent lawyer and, later, a Nazi official. He was executed at the Nuremberg Trials for crimes against humanity. He worked as a Nazi official in several countries, first in pre-Anschluß Austria (before Nazi Germany took over Austria). He also worked in the Third Reich and wartime Germany; Poland; and the Netherlands. == Life before the Anschluss == Seyß- Inquart was born in 1892 in Stonařov (Stannern), Moravia, then part of the Austro-Hungarian Empire. His parents were Emil Zajtich, a school principal, and his wife Auguste Hyrenbach. The family moved to Vienna in 1907, where they changed the Czech Slavic name of \"Zajtich\" to the German \"Seyß-Inquart\". Seyß- Inquart later studied law at the University of Vienna. In 1911, Seyß-Inquart met Gertrud Maschka. The couple married in 1916 and had three children: Ingeborg Caroline Auguste Seyß-Inquart (born 18 September 1917); Richard Seyß- Inquart (born 1921); and Dorothea Seyß-Inquart (born 1928). === During World War I === At the beginning of World War I in August 1914, Seyß-Inquart joined the Austrian Army and served in Russia, Romania and Italy. He was decorated for bravery on a number of occasions. While recovering from wounds in 1917, he completed his final examinations for his degree. He went into law after the war, and in 1921 set up his own practice. During the early years of the first Austrian republic, he was close to the Vaterländische Front. === 1921-1938 === As a successful lawyer, Seyß-Inquart was asked to join the cabinet of Chancellor Engelbert Dollfuss in 1933. He became a State Councillor in 1937 under Kurt Schuschnigg. He was not a member of the Austrian National Socialist party at first.L. L. Snyder, Encyclopedia of the Third Reich (1976), McGraw- Hill, page 320. But by 1938, Seyß-Inquart was the highest-ranking politician in the Austrian National Socialist Party. In February 1938, Seyß-Inquart was appointed Minister of the Interior by Schuschnigg, after Hitler had threatened Schuschnigg. On 11 March 1938, Schuschnigg resigned as Austrian Chancellor. Austrian President Wilhelm Miklas chose Seyß-Inquart as the new Chancellor. Hitler's plan was to have Seyß-Inquart send a telegram asking for German help to stop riots. However, President Miklas did not make Seyß-Inquart chancellor until after Adolf Hitler's invasion of Austria. Two days after he was appointed Chancellor, Seyß-Inquart joined the National Socialist party. Seyss- Inquart transcript - Nuremberg Trial. == Head of Ostmark and Southern Poland == At first, Hitler planned to let Austria be independent after he took control. However, after the welcome the invading German troops got during the Anschluß, he decided to make Austria a new part of Nazi Germany. He called it Ostmark (or eastern boundary) . Seyß-Inquart wrote the law which made Austria a province of Germany, and signed it into law on 13 March 1938. Seyß-Inquart became Reichsstatthalter or Governor of the so-called Ostmark. Ernst Kaltenbrunner was chief minister and Burckel Commissioner for the Reunion of Austria (concerned with the \"Jewish Question\"). Seyß-Inquart was made an SS Gruppenführer, and in May 1939 he became a Minister without portfolio in Hitler's government. After the invasion of Poland in 1939, Seyß-Inquart became governor of Southern Poland. However, before he started work there, the General Government was created. In this new government, Seyß-Inquart became a deputy to Governor General Hans Frank. == Reichskommissar in the Netherlands == After Germany invaded the Low Countries, Seyß-Inquart became Reichskommissar for occupied Netherlands in May 1940. His job was to organize civil administration, create close economic ties with Germany, and do things that benefited the Third Reich. He supported the Dutch National Socialist Party (NSB) and allowed it to create a paramilitary force called the Landwacht as an auxiliary police force. Other political parties were banned in late 1941, and many former government officials were imprisoned at Sint- Michielsgestel. Seyß-Inquart controlled much of the administration of the country himself. He introduced measures to combat 'terror'. In May 1943, many workers held a strike in Amsterdam, Arnhem and Hilversum. Special summary court-martials were held and a collective fine of 18 million guilders was imposed. Seyß-Inquart authorized the execution of around 800 people before the end of the war. Some people say it was not merely 800 but over 1,500, including executions under the so-called \"Hostage Law\" involving political prisoners who were close to being liberated (among others); the Putten incident; and the revenge execution of 117 Dutchmen for the attack on SS and Police Leader Hanns Albin Rauter. From July 1944 on, most of Seyß-Inquart's powers were transferred to the military commander in the Netherlands and the Gestapo. However, he remained an important and powerful political figure. === Concentration camps === There were two small concentration camps in the Netherlands: * KZ Herzogenbusch near Vught, and * Kamp Amersfoort near Amersfoort. There was also a \"Jewish assembly camp\" at Westerbork, in addition to a number of other camps controlled by the military, the police, the SS or Seyß-Inquart's administration. These included a \"voluntary labor recruitment\" camp at Ommen. A total of around 530,000 Dutch civilians worked for the Germans, of whom 250,000 were sent to factories in Germany. === Antisemitic policies === Seyß-Inquart was an anti-Semite. Within a few months of his arrival in the Netherlands, he fired Jews from jobs in the government, the press, and leading positions in industry. After 1941, he escalated his anti- Jewish measures. Jews were forced to register with the government; approximately 140,000 did. Under Seyß-Inquart's leadership, a ghetto was created in Amsterdam and a transit camp set up at Westerbork. In February 1941, 600 Jews were sent to the Buchenwald and Mauthausen concentration camps. Later, Dutch Jews were sent to Auschwitz. As Allied forces approached in September 1944, the remaining Jews at Westerbork were sent to Theresienstadt. Of 140,000 registered Dutch Jews, only 44,500 survived the war. When Hitler committed suicide on 30 April 1945, Seyß-Inquart became the Foreign Minister in Admiral Karl Dönitz's new German government. The Nazi regime had tried a 'scorched earth' policy, and also destroyed some docks and harbors. Seyß- Inquart agreed with Armaments Minister Albert Speer that it was wrong to destroy everything to keep valuable materials from Allied forces or a new government after the war. Seyß-Inquart also helped distribute food during the so-called 'hunger winter' of 1945. He also allowed Allied airplanes to drop Swedish white bread for the hungry people of occupied northern Netherlands. He remained Reichskommissar until 8 May 1945. On that day, he was captured in Hamburg. He had met there with Karl Dönitz to confirm that he was blocking the scorched-earth orders. == Nuremberg Trials == At the Nuremberg Trials, Seyß- Inquart faced charges of conspiracy to commit crimes against peace; planning, starting and fighting wars of aggression; war crimes; and crimes against humanity. Gustav Steinbauer was his defense lawyer. Seyß-Inquart was found guilty of all charges except conspiracy. On hearing of his death sentence, Seyss-Inquart said:G. M. Gilbert, Nuremberg Diary (1947), Farrar Straus, page 433. > Death by hanging...well, in view of the whole situation, I never expected > anything different. It's all right. He was hanged on 16 October 1946, at the age of 54, together with nine other Nuremberg defendants. His last words were: > I hope that this execution is the last act of the tragedy of the Second > World War and that the lesson taken from this world war will be that peace > and understanding should exist between peoples. I believe in Germany. == Related pages == * World War II * Nazi Germany * Anschluss * Nuremberg Trials * War crimes * Crimes against humanity == References == == Other websites == * United States Holocaust Memorial Museum Arthur Seyss-Inquart Category:1892 births Category:1946 deaths Category:Austrian people of World War II Category:Austrian war criminals Category:Chancellors of Austria Category:Executed Austrian people Category:Executed Nazis Category:Government ministers of Austria Category:Government ministers of Nazi Germany Category:Holocaust perpetrators Category:Austrian lawyers Category:Members of the Reichstag (Nazi Germany) Category:People executed by hanging Category:Politicians of the Nazi Party Category:SS officers Category:Austrian Roman Catholics Category:Foreign ministers of Germany",
 "title": "Arthur Seyß-Inquart"
}