{
 "id": "878441",
 "text": "Jill Casey DeSantis (née Black, born June 26, 1980) is a former American television journalist and news show host and the current first lady of Florida as the wife of Governor Ron DeSantis. == Early life == Casey DeSantis was born Jill Casey Black was born on June 26, 1980 in Troy, Ohio. DeSantis graduated from the College of Charleston receiving a Bachelor of Science degree in economics and minored in French. ==News anchor career== Early in DeSantis's career, she hosted Golf Channel programs as local newscaster and anchor at an independent station in Jacksonville, Florida, and held several positions, including general assignment reporter, morning anchor, and police reporter. DeSantis also held reports for CNN. == First Lady of Florida == DeSantis assumed the role and duties as the first lady of Florida on succeeding Ann Scott, when her husband inaugurated as the 46th governor of Florida. At age of 38, DeSantis is the youngest woman to assume the role as the first lady of the state. As first lady, she launched four major initiatives during her husband's term in office such as, Hope Florida, Florida Cancer Connect, Resiliency Florida, Hope Healing for Florida and The Facts. Your Future. DeSantis was an advisor to her husband's 2024 presidential campaign. The New York Times has noted her role in advising her husband on media strategy and policy matters. In December 2023, she was criticized for telling Republicans nationwide to take part in the Iowa caucus. After receiving the Stateswoman of the Year award, people began to think she would run for governor in the 2026 gubernatorial election. However, spokesperson for the DeSantis campaign said she was not interested in running. == Personal life == Casey Black and Ron DeSantis had met each other at Naval Station Mayport when he was a naval officer on a golf course. They married in September 2009, at Disneyworld and have three children together named Mason, Madison, and Mamie DeSantis. On October 4, 2021, her husband announced that she had been diagnosed with breast cancer. On March 3, 2022, she announced that she was cancer-free. ==References== == Other websites == * Category:1980 births Category:Living people Category:American television news anchors Category:Television personalities from Ohio Category:People from Tallahassee, Florida Category:Republicans (United States)",
 "title": "Casey DeSantis"
}