{
 "id": "878624",
 "text": "Jayli Wolf is a Canadian musician and actress based in Toronto. She is better known for her alternative pop music and duo band called Once A Tree. In 2019, she wrote the official anthem We Are One for the Canadian Premier League. ==Early life and career== Jayli Wolf was born in Creston, BC to teenage parents of both Danish and Indigenous descent. She was raised primarily by her grandparents, as a Jehovah’s Witness. Later, she has reconnected with her paternal family and indigenous heritage as an adult. Wolf began her career after winning a song-writing contest through Aboriginal Peoples Television Network (APTN). She started her music career in a duo band called Once A Tree. In 2017, Rolling Stone magazine named Once A Tree one of 10 new performers to note. In 2021 she released her debut EP Wild Whisper. Since the release of her debut EP, Wolf’s song Child of the Government has since charted #1 on both CBC and IMC radio. Her music has been featured in the Degrassi: Next Class (2016), CBC’s drama series Shoot The Messenger (2016), and CTV’s police drama The Detail (2018). She has acted roles on several drama and comedy series, such as APTN’s “Mohawk Girls” and CBC’s Burden of Truth, Disney FX’s Y: The Last Man (2021) as Laura and Dan Mazer directed comedy film, The Exchange (2021) as Brenda. She was recently nominated for Best Supporting Actress at the American Indian film festival for her portrayal of Jess in Run Woman Run (2021). ==Discography== ===EPs=== Title Details Wild Whisper Released: 2021 Label: Studio 71 ===Singles=== *\"Lead Me\" (2021) *\"Child of the Government\" (2021) *\"Hush\" (2021) *\"Would You Die\" (2021) ==Filmography== ===Film=== Year Title Role Notes 2014 Being Angel Short film 2017 Ways to Water Girl Short film 2018 Level 16 2021 Run Woman Run Jess 2021 The Exchange Brenda ===Television=== Year Title Role Notes 2014–2016 Mohawk Girls Tulip Recurring role; 8 episodes 2015 Single Ladies Flight Attendant Episode: \"Gone\" 2016 Urban Native Girl 2 episodes 2019 Burden of Truth Ashley 3 episodes 2020 Tribal Susan Episode: \"The Road to Hell is Paved\" 2020 Trickster Destiny 1 episode 2021 Y: The Last Man Laura/Athena 5 episodes ==Awards and nominations== Year Award Category Work Result Ref 2021 Venice Shorts Film Awards Best Music Video \"Child of the Government\" 2021 American Indian Film Awards Best Supporting Actress \"Run Woman Run\" ==References== ==Other websites== * * Category:Actors from British Columbia Category:Year of birth missing (living people) Category:Living people",
 "title": "Jayli Wolf"
}