{
 "id": "878782",
 "text": "Mercerisation is a textile finishing treatment for cellulose fabric and yarn. It is mainly used for cotton and flax. The process changes the properties of the materials: They can be colored more easily, they withstand tearing better, and the fabric will shrink less, when washed. Fabrics treated that way also have a luster which make them resemble silk in some ways. Sometimes, cotton treated that way is called Fil d'écosse. Sometimes wool treated in the Mercosett process is also called mercerised. The process of mercerisation is long, and relatively costly. For this reason, only higher quality textiles are treated that way. == Development == About 1844, John Mercer developed the process. He noticed that when he treated cotton with solutions of sodium hydroxide, this changed the properties of the cotton: The fabric shrank, and had a higher resistance to tearing. It was also easier to color the material using dyes. In the original process of Mercer, no tension was applied. The product was termed fulled cotton, a nod to the process of fulling in woven wool fabric. For Mercer, making the material easier to color was the most important technical aspect. Mercer also tried with sulfuric acid and zinc chloride solutions and discovered the parchmentising effect of sulfuric acid. The silk-like lustre now commonly associated with mercerising is produced by tension and was discovered by Horace Lowe in 1890. == Process == Treatment with sodium hydroxide destroys the spiral form of the cellulose with formation of alkali cellulose, which is changed to cellulose hydrate on washing out the alkali. Caustic soda concentrations of 20–26% are used. Effective mercerization requires the use of wetting agents. The improved lustre of mercerised cotton is due to the production of nearly circular cotton fibres under tension. Another characteristic feature is the untwisting (deconvolution) of the cotton hair. In dry mercerization, the process is carried out while drying the fabric on a stenter. == References == == Other websites == * Online Encyclopedia - Mercerizing * Category:Fibers Category:Synthetic materials",
 "title": "Mercerised cotton"
}