{
 "id": "879020",
 "text": "Amphibia is an American animated series created by Matt Braly for Disney Channel. It was shown on the Disney Channel from June 17, 2019 to May 14, 2022. The series has 3 parts. The series features the voices of Brenda Song, Justin Felbinger, Bill Farmer, and Amanda Leighton. == Premise == === Season 2 === Anne and the Plantars go on a road trip to the Amphibian capital, Newtopia, to learn the secrets of the Calamity Box and find a way to get Anne home. There, Anne reunites with Marcy, who offers to help restore the box's power through a series of ancient trials. What they don't know is that Amphibia's ruler, King Andrias, secretly has his own plans for them. Meanwhile, Sasha and Grime plot to invade Newtopia and overthrow the King, allowing the toads to rule over all of Amphibia. === Season 3 === Anne and the Plantars are transported to Anne's home in the suburbs of East Los Angeles. Anne must now help the frog family adjust to the human world and keep their identities a secret, while searching for a way to return to Amphibia and stop Andrias from invading Multiverse. In Amphibia, Sasha and Grime lead the people of Wartwood in a rebellion against Andrias. At the same time, Andrias begins sending forces to Earth to eliminate Anne, while keeping Marcy trapped in suspended animation inside of a stasis capsule for future plans. During \"Olivia and Yunnan,\" Marcy is freed by Lady Olivia and Yunnan, but they get caught by Andrias and she is used to contain a hive mind known as \"the Core.\". == Cast == * Brenda Song as Anne Boonchuy * Justin Felbinger as Sprig Plantar * Bill Farmer as Hop Pop Plantar * Amanda Leighton as Polly Plantar * Haley Tju as Marcy Wu/Darcy * Anna Akana as Sasha Waybright * Keith David as King Andrias * Michelle Dockery as Lady Olivia * Tony Hale as Apothecary Gary, Lloyd * Chris Sullivan as Gunther, Teddy * Stephen Root as Mayor Toadstool * Jack McBrayer as Toadie * Kristen Johnston as Braddock * Matt Jones as Percy * Katie Crown as Ivy Sundew * Jill Bartlett as Maddie Flour * Kaitlyn Robrock as Felicia Sundew * Laila Berzins as Sadie Croaker * Tara Lipinski, Johnny Weir as Talent Judges * Diedrich Bader as Frog Jordan * Kevin McDonald as Albus Duckweed * James Patrick Stuart as Wally Ribbiton * Kevin Michael Richardson as Mr. Flour * John DiMaggio as Stumpy * Fred Tatasciore as Soggy Joe * Jenifer Lewis as Mama Hasselback * Kristen Schaal as Bella * Wayne Knight as Ned * Anika Noni Rose as Dr. Jan * Melissa Villaseñor as Ally * Dana Davis as Jess * RuPaul as Mr. X * Cassie Glow as Molly Jo * Brad Garrett as Robert Otto * Wallace Shawn as Humphrey Westwood * Kate Micucci as Terri * Cree Summer as Dr. Frakes == International Dubs == Country Language Channel Premiere date Title Source Canada English Disney Channel June 22, 2019 Amphibia French United Kingdom English July 6, 2019 Malta Japan Japanese August 2, 2019 (Sneak preview) September 1, 2019 (Official) ふしぎの国 アンフィビア Spanish (Latin America) Disney XD August 3, 2019 (Sneak preview) August 5, 2019 (Official) Amphibia Disney Channel India Hindi August 11, 2019 Tamil Telugu Australia English August 18, 2019 New Zealand Netherlands Dutch September 2, 2019 Hong Kong Cantonese Chinese September 8, 2019 蛙!小安的奇幻之旅 Taiwan Mandarin Chinese 蛙!小安的奇幻之旅 Southeast Asia English September 9, 2019 Amphibia Indonesian Malay Thai แอมฟิเบีย Vietnamese (subtitles) Thế Giới Lưỡng Cư South Korea Korean September 18, 2019 신비한 개구리 나라 앰피비아 Italy Italian October 5, 2019 Anfibia Russia Russian October 14, 2019 Амфибия France French October 21, 2019 Amphibia Switzerland Belgium Middle East and North Africa English Arabic مغامرات ضفدعية Greece Greek Αμφίβια Bulgaria Bulgarian December 9, 2019 Амфибия Romanian Romania Amfibienii Spain Spanish Disney XD January 11, 2020 Anfibilandia Disney Channel April 6, 2020 Germany German Disney Channel February 17, 2020 Amphibia Czechia Czech March 2, 2020 Anna mezi obojživelníky Slovakia Hungary Hungarian Békaland Israel Hebrew March 8, 2020 אמפיביה Scandinavia English Disney XD March 23, 2020 Amphibia Danish Norwegian Swedish Finnish (subtitles) Russian Poland Polish Disney XD Płazowyż Ukraine Ukrainian PlusPlus August 20, 2020 Амфібія Portugal European Portuguese Disney Channel September 14, 2020 Anfibilândia == Episodes == Season Segments Episodes Originaly aired First aired Last aired 1 39 20 June 17, 2019 July 18, 2019 2 36 20 July 11, 2020 May 22, 2021 3 31 18 October 2, 2021 May 14, 2022 As of 2024, all episodes of amphibia have been subsequently removed from the DisneyNow app. ==References== Category:Television programs",
 "title": "Amphibia (TV series)"
}