{
 "id": "879160",
 "text": "Jay and the Americans are an American rock group popular in the 1960s. Members included John \"Jay\" Traynor, Howard Kane (born Howard Kirschenbaum), Kenny Vance (born Kenneth Rosenberg) and Sandy Deanne (born Sandy Yaguda). ==Singles== Year Title Peak chart positions Record Label B-side From same album as A-side except where indicated Album US AC CB 1961 \"Tonight\" 120 – – United Artists Records \"The Other Girls\" She Cried 1962 \"She Cried\" 5 – 44 \"Dawning\" \"This Is It\" 109 – 83 \"It's My Turn to Cry\" (Non-LP track) Come a Little Bit Closer \"Yes\" – – – \"Tomorrow\" (from Come a Little Bit Closer) She Cried 1963 \"What's the Use\" – – – \"Strangers Tomorrow\" Come a Little Bit Closer \"Only in America\" 25 – 28 \"My Clair de Lune\" (from She Cried) \"Come Dance with Me\" 76 – 82 \"Look in My Eyes Maria\" 1964 \"To Wait for Love\" – – – \"Friday\" \"Come a Little Bit Closer\" 3 – 4 \"Goodbye Boys, Goodbye\" \"Let's Lock the Door (And Throw Away the Key)\" 11 – 10 \"I'll Remember You\" (from Livin' Above Your Head) Blockbusters 1965 \"Think of the Good Times\" 57 – 54 \"If You Were Mine, Girl\" \"Cara Mia\" 4 – 4 \"When It's All Over\" (Billboard #129) \"Some Enchanted Evening\" 13 – 15 \"Girl\" Jay & the Americans Greatest Hits! \"Sunday and Me\" 18 – 20 \"Through This Doorway\" (from Jay & the Americans Greatest Hits!) Sunday and Me 1966 \"Why Can't You Bring Me Home\" 63 – 55 \"Baby Stop Your Cryin'\" \"Crying\" 25 – 32 \"I Don't Need a Friend\" \"Livin' Above Your Head\" 76 – 78 \"Look at Me, What Do You See\" Livin' Above Your Head \"(He's) Raining in My Sunshine\" 90 – 62 \"The Reason for Living (For You My Darling)\" (from Livin' Above Your Head) Try Some of This! 1967 \"You Ain't as Hip as All That Baby\" – – – \"Nature Boy\" \"(We'll Meet in The) Yellow Forest\" 131 – 93 \"Got Hung Up Along the Way\" Non-LP tracks \"French Provincial\" – – – \"Shanghai Noodle Factory\" 1968 \"No Other Love\" 114 – 119 \"No, I Don't Know Her\" (from Capture the Moment) \"You Ain't Gonna Wake Up Cryin'\" – – – \"Gemini (Don't You Ever Wonder Why)\" \"This Magic Moment\" 6 11 5 \"Since I Don't Have You\" Sands of Time 1969 \"When You Dance\" 70 – 41 \"No, I Don't Know Her\" (from Capture The Moment) \"Hushabye\" 62 31 45 \"Gypsy Woman\" \"(I'd Kill) For the Love of a Lady\" – – 113 \"Learnin' How to Fly\" Capture the Moment \"Walkin' in the Rain\" 19 8 14 \"For the Love of a Lady\" (from Capture the Moment) Wax Museum, Vol. 1 1970 \"Capture the Moment\" 57 32 45 \"Do You Ever Think of Me\" (Non-LP track) Capture the Moment \"Do I Love You?\" 93 – 123 \"Tricia (Tell Your Daddy)\" (from Capture the Moment) Wax Museum, Vol. 1 1971 \"There Goes My Baby\" 90 – - \"Solitary Man\" Non-LP tracks ==References== Category:American rock bands Category:Musical groups from New York City",
 "title": "Jay and the Americans"
}