{
 "id": "879792",
 "text": "Cocomelon, formerly checkgate, ThatsMEonTV and ABCkidTV, is a YouTube channel and animated series now being maintained by British company Moonbug Entertainment and founded on September 12, 2005 by Jay Jeon and his company Treasure Studio Inc., which was based in Irvine, California, United States. It is the third most subscribed YouTube channel on YouTube and the second most subscribed channel in the United States. It is also the most subscribed kids and educational channel. It is also the first educational YouTube channel to hit 100 million subscribers. Now their YouTube channel has over 192 billion views, and over 185 million subscribers. The channel also has 11 other channels, those being Cocomelon en Español, CoComelon em Português, CoComelon 中文版, \"'Cocomelon Pусский'\", CoComelon Deutsch, CoComelon en Français, Cocomelon Arabic - كوكو ميلون اغاني اطفال, '\"Cocomelon Hindi - बच्चों के गाने'\", '\"Cocomelon Bahasa Indonesia - Lagu Anak Anak'\", CoComelon Italiano - Canzoni per Bambini, CoCoMelon MyGo! - Sign Language For Kids, Cocomelon Nederlands, and CoComelon Hrvatska- Dječije pjesmice za djecu. ==History== At the end of 2005, Jay Jeon and his company Treasure Studio Inc. created ThatsMeOnTV as a company that produces children's educational videos on DVDs. In February 2006, he launched a YouTube channel under the name (Checkgate) that gives the subscribers all of the existing videos ad-free and in high definition. In 2013, ThatsMeOnTV was rebranded as ABCKidTV. The channel began transitioning from alphabet videos to nursery rhymes. Betty Was A Singer From 2006 - 2019. Two years later, ABCKidTV joined the Channel Frederator Network, and is the number one channel (by views) of the Multi-Channel Network. In April 2016, ABCKidTV was added to Roku, and Kidoodle.TV joined in September 2016. In August 2018, the channel was rebranded to its current name, Cocomelon. Cocomelon Lane premiered on November 17, 2023 on Netflix, while Cocomelon Classroom premiered on September 21, 2024 on YouTube. They have also created an app for iOS called Cocomelon Jukebox. == Episodes == === Season 2 === == References == == Other websites == * *Official Websites Category:Educational organizations based in the United States Category:YouTube",
 "title": "Cocomelon"
}