{
 "id": "880237",
 "text": "Royalty of transgender people; Under the Mughal rule, transgender people were called khawjasaras, a designation of respect and dignity. The Mughals employed transgender people as security officials in charge of female quarters. This role was assigned to transgender people in imitation of their historic role in Holy Cities where transgender people served as facilitators between men and women performing Prayers and Pilgrimage. In most parts of the Muslim world, transgender people commanded respect and were considered holy and special in the eyes of the Lord. The spirituality of transgender people is considered as authentic as that of men and women. The Prophet of Islam treated transgender people with respect, prohibited their ill-treatment, and had good things to say about spiritually-inclined transgender people. Believing that transgender people are dearer to God (The Creator), some Muslim rulers appointed them as intercessors in Royal Palaces, including those of the Ottomans and the Mughals. In the Indus Valley Region (i.e. Pakistan), the Mughals appointed transgender people to positions of power and trust. Transgender people served as courtiers and councils, giving advice to princes and princesses. They were familiar with court etiquette and knew the secret workings of Mughal households. They were domestic insiders. Having the controls of intelligence officers and the prestige of Royal confidantes, transgender people enjoyed special powers and privileges unavailable even to the most powerful wazirs (ministers) of the Islamic Kingdom. Transgender people were educated in statecraft and nuances of religion. This treatment and elevation in the Mughal courts provided a great incentive for non-Muslim transgender people to accept Islamic faith. The Qur'an is clear on genetic determinations by pointing out that Allah is the: Every child has the equal blessings of the Lord and there is no justification for parents, courts, or governments to engage in gender- based ill-treatment. ==Other websites== * Category:History of Pakistan Category:Pakistani culture Category:LGBT rights in Pakistan",
 "title": "LGBT history in Pakistan"
}