{
 "id": "880219",
 "text": "Lesbian, gay, bisexual, and transgender (LGBT) individuals in Jordan face legal challenges and discrimination not experienced by non-LGBT persons. In the Ancient times of Jordan, according to traditional Biblical accounts, Jewish scriptures and Islamic jurisprudence interpretations was the first place in the world where the same-sex activity was recorded in recorded times of human history, the story told by prophet Lot. However, until recently, the International Day Against Transphobia and Biphobia in 2014 and 2015 in the Jordanian capital, Amman, was troubling, primarily for educational purposes and for the community to raise voice and discuss challenges. Events were being held. LG GTT in Jordan Many activists and members of the Jordanian society and LG GTT allies attended. ==Criminal Law== In 1951, an analysis of Jordan's Surgical Code legalized the legalization of private, adult, non-commercial, and voluntary physical laws. Jordan's penal code no longer allows family members to honour kill or maim any member of their family, which is interpreted as \"Illegal\" sexual intercourse in the whole family. By 2013, the newly revised Penal Code makes unlawful murder, unlawful killing legal. In 1999, a Jordanian family living in the United States repeatedly murdered their adult daughter and found out she was gay. Jordan was under the Ottoman Empire, where Homosexuality was condemned by the committee 75 years ago, but between 1922 and 1945, the country was ruled by a League of Nations. However, in 1951 the new nation legalized Homosexuality. The Jordanian government also tolerates a few cafes in Amman that are widely considered to be gay friendly. The revised edition in 2004, has a few provisions of direct impact on LGBT rights. First, the content ban on \"sexual perversion\" has been replaced with a general requirement that the press \"respect the values of ... the Arab and Islamic nation\" and that the press must also avoid encroaching into people's private lives. Many Gay Muslims taken Hadith to show that Frottage is not forbidden like this Hadith: Yahya related to me from Malik from Ibn Shihab from Said ibn al- Musayyab that Umar ibn al-Khattab and Uthman ibn Affan and A'isha, the wife of the Prophet, may Allah bless him and grant him peace, used to say, \"When the circumcised part touches the circumcised part, ghusl is obligatory.\"https://sunnah.com/urn/501030 ==References== Category:Politics of Jordan Jordan Category:LGBT in Asia Category:LGBT in the Middle East",
 "title": "LGBT rights in Jordan"
}