{
 "id": "880439",
 "text": "Valhalla Entertainment Productions, Inc. is an American movie and television production studio. Their productions include among others AMC's The Walking Dead television series, its companion series, Fear the Walking Dead, and the spin-off, The Walking Dead: World Beyond. == History == Formerly Pacific Western Productions, the studio was established by producer Gale Anne Hurd in 1982Gale Anne Hurd Biography – IMDB. and it was folded into Valhalla Motion Pictures in 2000. In 1988, Gale Anne Hurd established a label No Frills Film, devoted to producing low-budget and independent movies, usually with the nature of B-movie. In 1993, No Frills Film was merged into Pacific Western Productions. Five years later, Gale Anne Hurd established another production label, Valhalla Motion Pictures, which was ultimately merged with Pacific Western Productions in 2000. The same year it signed a first-look contract with Kinowelt USA, which was acquired by StudioCanal after Kinowelt was forced into bankruptcy. In 2001, Valhalla Motion Pictures established a television division that its main focus was on producing television series and movies for networks and syndication. Valhalla had an overall contract with Universal Cable Productions to creating new television and web series, which was renewed in 2015.Gale Anne Hurd Renews Valhalla Entertainment Deal with Universal Cable Productions. Valhalla produced USA Network's drama series, Falling Water, and Amazon's original series, Lore. In the comic book industry, Valhalla has created a six-issue miniseries comic book, The Scourge, for Aspen Comics, and a four-issue comic book miniseries, ANTI, for 12 Gauge Comics.Walking Dead Producer Gale Anne Hurd Talks Comic Book Movies. Dead Man's Run, which was created for Aspen Comics by Greg Pak.Pak, Aspen and Valhalla Entertainment Team Up for “Dead Man’s Run”. On February 7, 2017, Valhalla Motion Pictures merged into Valhalla Entertainment, which was originally established in 1996. == Logo == On March 24, 2016, the United States Patent and Trademark Office denied a trademark registration by Valhalla Game Studios on the grounds there was likelihood of confusion between Valhalla Motion Pictures and Valhalla Games Studios' mark.United States Patent and Trademark Office Opposition No. 91206662 . == References == == Other websites == * * * Official Twitter page * Official Facebook page Category:1982 establishments in the United States Category:American movie studios",
 "title": "Valhalla Entertainment"
}