{
 "id": "880527",
 "text": "Home Sweet Home Alone (also known as Home Alone 6) is an American Christmas comedy film directed by Dan Mazer with a script by Mikey Day and Streeter Seidell. It is the sixth film in the Home Alone franchise. The project is produced by 20th Century Studios as a Disney+ original film, the first 20th Century Studios film to be produced for the streaming service. It was announced after The Walt Disney Company acquired 21st Century Fox and inherited the film rights to the Home Alone franchise. The film stars Ellie Kemper, Rob Delaney, Archie Yates, Aisling Bea, Kenan Thompson, Pete Holmes, Ally Maki, and Chris Parnell. ==Plot== Jeff and Pam McKenzie are trying to sell their house, but have not told their children, Abby and Chris. Jeff had lost his job and Pam's salary is not able to afford keeping their home. To make matters worse, Jeff's obnoxious and more successful brother Hunter and his wife, Mei, and son Ollie, have decided to stay with them for Christmas. During an open house, Max Mercer and his mother Carol stop by to use the restroom. Max has a brief exchange with Jeff, during which the latter reveals a box of old dolls, including a malformed one with an upside down face. Carol comments on how dolls with unusual deformities tend to sell due to their rarity. As Max and Carol return home, the whole family is preparing to leave for Tokyo, Japan for the holidays, with Carol leaving earlier than the rest of the family. Max, annoyed with the fuss, decides to hide in the garage parked car and falls asleep. Concerned about losing their home, Jeff goes to retrieve the doll, only to find that it is missing. Believing that Max stole it, he manages to locate the Mercer household the next day, only to find the whole family hastily leaving. During the commotion, he overhears the security code and sees where the house key is hidden. He tells Pam about it and they agree to go and steal the doll at night. Meanwhile, Max discovers that the whole family has left and takes advantage of it by having fun, though he quickly grows bored. Jeff and Pam arrive at the Mercer house and get inside. Max overhears them talking about getting an \"ugly little boy\" and assumes they are talking about him. He manages to scare them away by calling the cops. Officer Buzz McCallister arrives, but Pam manages to divert him. Max realizes that if he found out he was home alone, his parents might get arrested. Carol discovers that Max has been left home alone and buys a ticket to head back. The McKenzies head to church the next day where they run into their realtor Gavin Washington who tells them that they have a buyer, but they need to decide by the end of the year; putting pressure on them. Max arrives and unknowingly converses with Jeff and Pam's son Chris who sympathetically gives him his nerf gun. Jeff and Pam spot Max talking with an elder afterwards and assume she is his grandmother. They resolve to break into the house once again while the rest of their family is still at church. They sneak around the back of the house, but end up in the neighbor's backyard instead. Max overhears them once again plotting with Jeff agreeing to arrive dressed as Santa in an effort to fool him. Max responds by setting up traps in his house while Jeff and Pam wait for their family to fall asleep on Christmas Eve. Jeff and Pam are subjected to Max's traps, during which they discover that Max did not steal the doll, but instead stole a can of soda. They clear up the misunderstanding, but learn that Max is also home alone and agree to let him stay with them until his mother comes back. As they explain the whole situation to their family, it turns out that Ollie stole the doll and manage to safely retrieve it, thus ensuring that the McKenzies will stay. Carol arrives to pick up Max and, having moved into their house only two months ago, finds friends in the McKenzies and thanks them for taking care of Max. One year later, the Mercers and McKenzies have Christmas dinner together with Jeff having gotten a new job and willingly gives Max the soda he craved the year prior. ==Marketing== The first trailer released on October 12, 2021. It was met with negative responses by fans, and received over 79,000 dislikes on YouTube. == Cast == * Archie Yates as Max Mercer, a boy who is accidentally left at home by his family. * Ellie Kemper as Pam McKenzie, a criminal who aims to steal a priceless heirloom from the Mercers' home, and the wife of Jeff. * Rob Delaney as Jeff McKenzie, Pam's husband who at first isn't willing to be a criminal. * Aisling Bea as Carol Mercer, the mother of Max. * Kenan Thompson as Gavin * Ally Maki as Mei * Pete Holmes as Blake, Carol's husband and Max's father. * Chris Parnell as Uncle Stu, the uncle of Max. * Timothy Simons as Hunter * Andy Daly as Mike * Mikey Day as Priest * Jim Rash as Bell Choir Leader *Katie Beth Hall as Abby McKenzie, Jeff and Pam's daughter. *Justine Archambault as Young Abby McKenzie *Max Ivutin as Chris McKenzie, Jeff and Pam's son. *Amadeo Correia as Young Chris McKenzie *Maddie Holliday as Katie Mercer, the sister of Max *Aiden and Allan Wang as Ollie McKenzie, Hunter and Mei's son. Additionally, Devin Ratray reprises his role as an adult Buzz McCallister from Home Alone (1990) and Home Alone 2: Lost in New York (1992) with the character now working as a police officer. John Novak and Eddie G appear as Johnny and Snakes respectively, two movie characters who were portrayed by Ralph Foody and Michael Guido in the first film as well. ==References== ==Other websites== * Category:2021 comedy movies Category:American comedy movies Category:Christmas movies",
 "title": "Home Sweet Home Alone"
}