{
 "id": "88058",
 "text": "Dr Robert Anton Wilson (January 18, 1932 – January 11, 2007) was a futurist thinker, libertarian, and writer. He held a Ph.D in Psychology. At one time he was a writer for Playboy magazine. == Works == Wilson was the author of the Schrödinger's Cat trilogy (1979). He also co-wrote (with Robert Shea) the Illuminatus! trilogy (1975), which took a humorous look at the American fear of conspiracies. These books mix true facts with fiction. In The Cosmic Trigger (1976), he introduced Discordianism, Sufism, futurism, the Illuminati and other unusual subjects to the general public. He also worked with Timothy Leary to promote futurist ideas of space migration, life extension, and intelligence enhancement. Other fiction books by Wilson include The Earth Will Shake (1982) and Reality Is What You Can Get Away With (1996). His non-fiction books include Quantum Psychology, The New Inquisition (1994), and other volumes of The Cosmic Trigger. He and Miriam Joan Hill co-wrote Everything Is Under Control: Conspiracies, Cults, and Cover-Ups (1998), an encyclopedia of conspiracy theories. == References == *Smoley, Richard and Jay Kinney, \"Doubt!: The Gnosis Interview with Robert Anton Wilson,\" Gnosis, No. 50 (Winter 1999). == Other websites == === Official sites === * R.A.W. Official Website , now maintained by his family * RAW Data Wilson's blog, now maintained by his daughter, Christina * Maybe Logic - The Lives and Ideas of Robert Anton Wilson === Interviews === * Collection of online interviews * Robert Anton Wilson Multimedia, Video & Audio Hundreds of media files including interviews and links * deoxy.org interviews and writings * \"Robert Anton Wilson: The Author of The Illuminatus Trilogy Expounds on Multiple Realities, Guerrilla Ontology, LSD, Life Extension and Things that Go Bump in the Night\" by Michael Hollingshead in High Times, 1980 * Video appearances by Wilson including May 23, 1996 appearance on Politically Incorrect with Bill Maher * \"The ROC Interview - Author - Futurist - M.V.P. (Most Valuable Philosopher) Robert Anton Wilson\" by Randy Lee Payton of Rock Out Censorship, February 2001 * \"President Hannibal Lector & the Thing That Ate the Constitution: An Interview with Robert Anton Wilson\" by David Jay Brown, 2003 * \"23 Questions With Robert Anton Wilson\" by Jody Franklin, August 2004 and March 2005 * \"Man Bites Dogma\" - Wilson interviewed by Michael Dare (no date given) === Online writings, profiles and press === * Collection of online writings by Wilson * Robert Anton Wilson profile on BlackCrayon.com * 8-Circuit Model of Timothy Leary and Robert Anton Wilson * Robert Anton Wilson on Dazed Digital - multi-media feature (high bandwidth site) * \"Patricia Luna Wilson\" by Art Quaife - Wilson's teenage daughter, murdered on October 2, 1976. Her parents had her brain placed into cryonic suspension. === Obituaries === *\"Robert Anton Wilson, 74, Who Wrote Mind-Twisting Novels, Dies\", New York Times Obituary by Dennis Hevesi, January 13, 2007 *\"\"Robert Anton Wilson - He turned Playboy readers' conspiracy theories into drug-assisted cult fiction\" by Michael Carlson for The Guardian, January 18, 2007 *\"Robert Anton Wilson, Jan 18, 1932 - Jan 11, 2007\" at Erowid Character Vaults Category:1932 births Category:2007 deaths Category:Writers from New York City",
 "title": "Robert Anton Wilson"
}