{
 "id": "880576",
 "text": "Johnny Test is a revival of the 2005 series of the same name. It is a Canadian/French animated series created by Scott Fellows and developed by WildBrain for Netflix. It premiered on Netflix on July 16, 2021. It also premiered on TVOKids on October 16, 2021. An interactive special titled Johnny Test's Ultimate Meatloaf Quest premiered on November 16. The second season of the show released on January 7, 2022. == Voice cast == * James Arnold Taylor as Johnny Test, Hank Anchorman, Mr. Mittens, Dark Vegan * Trevor Devall as Dukey, Mr. Henry Teacherman * Emily Tennant as Mary Test * Maryke Hendrikse as Susan Test * Ian James Corlett as Hugh Test * Kathleen Barr as Lila Test * Bill Mondy as Mr. Black, Brain Freezer * Deven Mack as Mr. White * Lee Tockar as The General, Bling Bling Boy, Albert, Speed McCool * Andrew Francis as Gil * Scott McNeil as King Zizrar == Production and development == On June 11, 2013, Teletoon announced the original series renewal for season 7 consisting of 13 episodes and a three-part special. However, in response to a tweet on June 25, 2015, voice actor James Arnold Taylor stated that he wasn't aware of any plans for more seasons. However, on March 15, 2019, when Wildbrain (previously known as DHX Media) released a video confirming the show's revival along with web shorts (titled: Johnny Test: The Lost Web Series) on the official Johnny Test YouTube channel, but were set to private in October of that year. In January 2020, WildBrain announced that their Vancouver studio was hiring for a new Johnny Test project separate from the web shorts (released on May 2, 2020, but later made private). On May 6, 2020, WildBrain confirmed the series had been picked up by Netflix for two more seasons and a 66-minute interactive special set for release in 2021, with Fellows returning as showrunner and executive producer. In June 2021, it was announced that most of the main cast would reprise their respective roles. == Episodes == ===Season 1 (2021-22)=== ===Special=== ===Season 2 (2022-23)=== == References == == Other websites == * Johnny Test (2021) at Netflix Category:2021 Canadian television series debuts Category:2022 Canadian television series endings",
 "title": "Johnny Test (2021 TV series)"
}