{
 "id": "88073",
 "text": "Léon Theremin (born Lev Sergeyevich Termen, ) (August 15, 1896 – November 3, 1993) was a Russian inventor. He is most famous for his invention of the theremin, one of the first electronic musical instruments. Léon Theremin was born in Saint Petersburg and his family had French ancestry.Bulat Galeyev LMJ6 ==Biography== ===Early inventions=== He invented the theremin (also called the thereminvox) in 1919, in the middle of the Russian Civil War. Theremin also invented the first electronic burglar alarm, which he called a \"radio watchman\".Glinsky 41, \"patent ... radio watchman and the Termenvox ... By December 8, 1924, Len had two German Empire patent applications pending\" ===Move to the United States=== Theremin moved to the United States, arriving December 30, 1927 with his first wife, Katia Constantinova.Mattis 1989 He performed on the theremin with the New York Philharmonic in 1928. He patented his invention in the United States in 1928Glinsky 346 and granted commercial production rights to RCA. Theremin set up a laboratory in New York in the 1930s, where he developed the Theremin and experimented with other electronic musical instruments and other inventions. Theremin was interested in a role for the Theremin in dance music. He developed performance locations that could automatically react to dancers' movements with varied patterns of sound and light. He worked with the American Negro Ballet. After the Soviet consulate had apparently demanded he divorce Katia, the inventor fell in love with and married the young prima ballerina Lavinia Williams. His marriage to the African-American dancer caused shock and disapproval in his social circles, but the couple remained together. ===Return to the Soviet Union=== Theremin abruptly returned to the Soviet Union in 1938. At the time, the reasons for his return were not clear. Some claimed that he was simply homesick, while others believed that he had been kidnapped by Soviet officials. Beryl Campbell, one of Theremin's dancers, said his wife Lavia \"called to say that he had been kidnapped from his studio\" and that \"some Russians had come in\" and that she felt that he was going to be spirited out of the country.Theremin: An Electronic Odyssey, written, directed and produced by Steven M. Martin. Orion/MGM, 1994: 26mins Beryl Campbell reports Lavinia's call; 50mins Lydia Kavina reports Stalin's award Theremin was put to work in a secret research and development laboratories in the Soviet Gulag labor camp system. Theremin created the \"Buran\" eavesdropping system which recorded conversations in French and American embassies by measuring the window glass vibrations using a low power infrared beam from a distance.Glinsky 261 Lavrentiy Beria, head of the KGB then used Buran to spy on US, British and French embassies. In 1945 Theremin invented the first covert listening device (or \"bug\") for spying. Theremin's device was embedded in a carved wooden plaque of the Great Seal of the United States. On August 4, 1945, Soviet school children presented the bugged carving to U.S. Ambassador Averell Harriman, as a \"gesture of friendship\" to the USSR's World ar II ally. It hung in the ambassador’s Moscow office until 1952, when the bug was discovered by a British radio operator who heard conversations on an open radio channel. The CIA found the device in the Great Seal carving. Peter Wright, a scientist and former NI5 counterintelligence officer, eventually figured out how it worked. ===Later life=== After his release from the labor camp in 1947z, Theremin volunteered to remain working with the KGB until 1966. By 1947 Theremin had remarried, to Maria, and they had two children: Lena and Natalia. After working for the KGB, Theremin worked at the Moscow Conservatory of MusicGlinsky 341, \"where Lev Sergeyevich had constructed musical instruments\" for 10 years where he taught and built Theremins, electronic cellos and some Terpsitones. There he was discovered by a visiting New York Times correspondent, but when an article by Christopher Walker appeared, according to Lydia, the Vice President of the conservatory said \"The people don't need electronic music. Electricity is for killing traitors in the electric chair\", fired Theremin,Glinsky 341, \"his rough dismissal in 1967\" closed his laboratory and had his instruments destroyed. After 51 years in the Soviet Union Léon Theremin started travelling, first visiting France in June 1989 and then the United States in 1991, each time accompanied by his daughter Natalia,Glinsky 339 where he was reunited with Clara Rockmore who performed a number of concerts at this time. He also made a demonstration concert at the Royal Conservatory of The Hague in early 1993 before dying in Moscow in 1993 at the age of 97. ==Documentary movie== Léon Theremin is the subject of the documentary movie, Theremin: An Electronic Odyssey, written, directed, and produced by Steven M. Martin. The documentary was a winner at the Sundance Film Festival in 1994. The movie features legendary thereminists Clara Rockmore and Lydia Kavina as well as electronic instrument pioneer Robert Moog, Nicolas Slonimsky, The Beach Boys founder Brian Wilson, and Theremin himself. ==Notes== == References == * linked from LMJ6 * * copied here * == Other websites == * Theremin Centre, Moscow, holds Lev Sergeivitch Termen archives (Russian only) *Natalia Theremin's interview to magazine AURA-Z * Lev Sergeivitch Termen: The Inventor of the theremin * An Introduction to Leon Theremin * Online bibliography about both the man and the instrument * An encounter with Léon Theremin * Inventor of the Week Archive - LEON THEREMIN (1896-1993) * from The History Channel * Moog re LT's work on television, bugging * ARTMargins by Natascha Drubek-Meyer, \"Between “Bad Things” and Good Vibrations: Leon Theremin and his T-Vox\" - long article with citations Category:1896 births Category:1993 deaths Category:Russian musicians Category:Russian inventors",
 "title": "Léon Theremin"
}