{
 "id": "880945",
 "text": "Lightyear is a 2022 computer-animated superhero film movie that is based on the character Buzz Lightyear from the Toy Story series and is a spin-off movie. It is the fitfh movie of the Toy Story franchise, and is directed by Angus MacLane, and stars Chris Evans in the title role. Lightyear was released in theaters on June 17, 2022. ==Plot== After an astronaut named Buzz Lightyear accidentally crash lands a spaceship on an alien planet in the middle of nowhere, Buzz Lightyear feels guilty about that so Buzz decides to try to fix the crystal they need to go faster than the speed of light. But every time he tries to do that he goes four years into the future instead while everyone else builds a colony on the planet. Eventually Buzz’s partner Hawthorne dies of old age so her replacement Commander Burnside ends Buzz’s mission and decides to deactivate Buzz’s robot cat Sox so Buzz steals a spaceship and takes Sox with him 22 years into the future. When Buzz comes back to the planet he finds out it’s being attacked by an army of robots working for someone named Zurg and Buzz works with a team led by Hawthorne’s granddaughter to beat Zurg. Buzz learns that aside from him everyone was able to make the planet their home. Buzz finds out Zurg is actually him from the future and that he went back in time to keep them from ever crashing into the planet. When Buzz refuses to help Future Buzz, Future Buzz tries to kill him so Buzz and his team have to beat Future Buzz and save the planet. Commander Burnside then rewards Buzz and his team by making them a group of soldiers to protect the Galaxy. ==Other websites== * Category:Movies set in the future Category:Toy Story Category:2022 movies Category:2022 action movies Category:2022 science fiction movies Category:2020s superhero movies Category:2020s family movies Category:2022 computer-animated movies Category:American 3D animated movies Category:American action movies Category:American science fiction movies Category:American superhero movies Category:American family movies Category:Movies about astronauts Category:Pixar movies Category:Movies composed by Michael Giacchino",
 "title": "Lightyear (movie)"
}