{
 "id": "881290",
 "text": "Human rights in Turkey are protected by a variety of international law treaties, which take precedence over domestic legislation, according to Article 90 of the 1982 Constitution. The International Covenant on Civil and Political Rights (ICCPR) was not signed by Turkey until 2000. ==Human rights in Northern Cyprus== Human rights in Northern Cyprus are protected by the constitution of Northern Cyprus.The Constitution of the Turkish Republic of Northern Cyprus , Article 30, Retrieved 2011-05-05: \"Yasa, insan haklarına, demokrasi, sosyal adalet ve hukukun üstünlüğü ilkelerine dayanan laik devletin, ulusal güvenliğin ve genel ahlakın korunması halleri dışındaki bir dene dayanarak, halkın bu araçlarla Haber almasını, düşünce ve kanaatlara ulaşmasını ve kamuoyunun serbestçe oluşumunu engelleyici kayıtlar koyamaz.\". However, there have been reports of violations of the human rights of minorities, democratic freedom, freedom from discrimination, freedom from torture, freedom of movement, freedom of religion, freedom of speech, right to education, right to life, right to property, and the rights of displaced persons. === Rights of LGBT === Sexual intercourse between consenting adult females is legal in Northern Cyprus.State-sponsored Homophobia, A world survey of laws prohibiting same sex activity between consenting adults, by Daniel Ottoson , The International Lesbian, Gay, Bisexual, Trans and Intersex Association, May 2010. Male homosexuality was still criminalised in Northern Cyprus until January 2014, while anti-homosexuality legislation formerly in effect in the Republic of Cyprus was repealed following a 1993 ruling by the European Court of Human Rights (Modinos v. Cyprus). On 27 January 2014 Turkish Cypriot deputies passed an amendment repealing a colonial-era law that punished homosexual acts with up to five years in prison by a new Criminal Code. It was the last territory in Europe to decriminalise sexual relations between consenting, adult men. In response to the vote , Paulo Corte-Real from the International Lesbian, Gay, Bisexual, Trans and Intersex Association, a rights advocacy group said that \"We welcome today's vote and can finally call Europe a continent completely free from laws criminalising homosexuality\". ==References== Category:Politics of Turkey Turkey",
 "title": "Human rights in Turkey"
}