{
 "id": "881309",
 "text": "Mariam Mikhaïl Faransis (born 1950, Yabroud) is a Syrian writer, scholar. Faransis is a professor of Stylistics at the Lebanese University, From 1993 until 2017, she was a member of the Department of French Language. Faransis has writen several research studies in the field of supraphrastic linguistics. Her research is written in both French and Arabic. r.b.c. == Publications == === In French === * 1996, Narrative text analysis instrument (Instrument d’analyse du texte narrative), Jounieh, Lebanon, Library St Paul. * 2005, Elements of enonciativo-referential textual syntax of the Construction of the text (De la Construction du texte. Éléments de syntaxe textuelle enonciativo- référencielle), Jounieh, Lebanon, Library St Paul, . * 2006, « On the performativity of the compositional structures of the text (De la performativité des structures compositionnelles du texte) », Lebanon, USEK, Revue de Lettres et de Traduction, No 12, p. 69-83. * 2012, Linguistics for transphrastic figures of Contrastive Transphrastic Rhetoric (de la Rhétorique contrastive transphrastique. Linguistique pour figures transphrastiques), Jounieh, Lebanon, Library St Paul, . * 2013, « Set of reference shots, alternation of two narrative axes and mimicry effect in La Neige en deuil (Jeu de plans de référence, alternance de deux axes narratifs et effet de mimétisme dans La Neige en deuil) », Plural Voices (Voix Plurielles), vol. 10, No 2, Montreal, p. 375-392. * 2018, « Supraphrastic textual parameters and characterization of the compositional form of the text (Paramètres textuels supraphrastiques et caractérisation de la forme compositionnelle du texte) », dans Stylistiaue et méthode. Quels paliers de pertinence textuelle? (M. Monte, et al), Lyon, PUL, p. 171-183. === In Arabic === * 1977, « Child in Dostoyevsky's novels (الطفل في روايات دوستويفسكي) », Damascus, al-Maʹrifah, No 181, p. 96-104. * 1980, « Child between words and meanings (الطفل بين الألفاظ والمعاني) », Damascus, al- Maʹrifah, No 214-215, p. 192-196. * 1981, « The construction of the narrative in Soloist game on violent (البناء القصصي في عزف منفرد على الكمان) », Damascus, al-Maʹrifah, No 216, p. 167-184. * 1998, Of the Construction of the text. Speech reference axes (في بناء النص ودلالته: محاور الإحالة الكلامية), Damascus, Ministry of Culture, legal deposit: ع- 1871 / 10 /1998. * 1999, « Reading in the rhetoric of the Gospels (قراءة في بلاغة الأناجيل) », Beirut, ITTIJAH, No 14, p. 188-202. * 2001, Of the Construction of the text. Actantial and referential composition of the text (في بناء النص ودلالته: نظم النص التخاطبي - الإحالي), Damascus, Ministry of Culture, legal deposit: ع- 1- 1662 / 9 / 2001. * 2009, « Characteristic Traits of the Unfaithful Translator (خصائص المترجم الخائن) », Damascus, al-Thawrah, Cultural supplement, No 664, p. 6. * 2013, « Street of thieves: the Arab Spring: terrorist fundamentalists here, heralds of democracy there (شارع اللصوص: الربيع العربي: أصوليون تدميريون هنا وحاملو لواء الدمقراطية هناك) », Beirut - Damascus, FIKR, No 181, p. 116-123. == References == Category:1950 births Category:living people Category:Syrian writers",
 "title": "Mariam Faransis"
}