{
 "id": "881461",
 "text": "This is a list of countries in the 1990s, giving an overview of states around the world during the period between 1 January 1990 and 31 December 1999. It contains 241 entries, arranged alphabetically, with information on the status and recognition of their sovereignty. It includes 197 widely recognized sovereign states, 28 entities which claim an effective sovereignty but are considered de facto dependencies of other powers by the general international community, 2 associated states, 14 states which were initially unrecognized but then gained full recognition later in the decade, and 1 state which was initially widely recognized but then lost full recognition later in the decade. ==Members or observers of the United Nations== Name and capital city Information on status and recognition of sovereignty \\---- \\---- === A === === A === === A === \\---- \\---- → → Afghanistan * Republic of Afghanistan * Islamic State of Afghanistan Widely recognized UN member state. Claimed to be the sole legitimate government of Afghanistan and recognized as such by the UN, but only controlled a small portion of the country after 26 September 1996. \\---- \\---- → * People's Socialist Republic of Albania * Republic of Albania Widely recognized UN member state. \\---- \\---- – People's Democratic Republic of Algeria Widely recognized UN member state. \\---- \\---- – Principality of Andorra Widely recognized independent state. The President of France and Bishop of Urgell were ex officio Co-Princes of Andorra. UN member state (from 28 July 1993). The defense of Andorra was the responsibility of France and Spain. \\---- \\---- * People's Republic of Angola Angola adopted a new constitution on 25 August 1992 * Republic of Angola Widely recognized UN member state. \\---- \\---- Widely recognized UN member state; Commonwealth realm. Antigua and Barbuda had two dependencies, Barbuda and Redonda. \\---- \\---- – Argentine Republic Widely recognized UN member state. Argentina was a federation of 22 provinces, two federal territories, and one federal territory. It had a claim over Argentine Antarctica, which was suspended under the Antarctic Treaty. It also claimed the Falkland Islands and South Georgia and the South Sandwich Islands, both of which were British overseas territories. \\---- \\---- – Republic of Armenia The Armenian people voted for succession from the Soviet Union in a referendum on 21 September 1991. The parliament of Armenia ratified the result on 23 September 1991. De facto independent state; claimed by the Soviet Union to 26 December 1991. Widely recognized (from 26 December 1991).Armenia was not recognized by Pakistan. UN member state (from 2 March 1992). \\---- \\---- – Commonwealth of Australia Widely recognized UN member state; Commonwealth realm. Australia was a federation of six states and three territories. It had sovereignty over the following external territories: * Ashmore and Cartier Islands * Australian Antarctic Territory (suspended under the Antarctic Treaty.) * Christmas Island * Cocos (Keeling) Islands * Coral Sea Islands * Heard Island and McDonald Islands * \\---- \\---- – Republic of Austria Widely recognized UN member state. EU member (from 1 January 1995). Austria was a federation of nine states. \\---- \\---- – Republic of Azerbaijan On August 30, 1991, Azerbaijan's Parliament adopted the Declaration on the Restoration of the State Independence of the Republic of Azerbaijan De facto independent state; claimed by the Soviet Union to 26 December 1991. Widely recognized state from 26 December 1991; UN member state from 2 March 1992. Azerbaijan had one autonomous republic, Nakhchivan. It included the disputed region of Nagorno-Karabakh, where a partially recognized breakaway republic declared independence on 6 January 1992. \\---- \\---- === B === === B === === B === \\---- \\---- – Commonwealth of the Bahamas Widely recognized UN member state; Commonwealth realm. \\---- \\---- Bahrain – State of Bahrain Widely recognized UN member state. \\---- \\---- – People's Republic of Bangladesh Widely recognized UN member state. \\---- \\---- Widely recognized UN member state. Commonwealth realm. \\---- \\---- – Kingdom of Belgium Widely recognized UN member state. EEC member to 1 November 1993; EU member from 1 November 1993. Belgium was a federation of three communities and three regions. \\---- \\---- Belize Widely recognized UN member state.Belize was not recognized by Guatemala (to 24 November 1992) Commonwealth realm. \\---- \\---- → * People's Republic of Benin The People's Republic of Benin was renamed the Republic of Benin on 1 March 1990. Its new constitution was adopted on 2 December 1990. * Republic of Benin Widely recognized UN member state. \\---- \\---- – Kingdom of Bhutan Widely recognized UN member state. Bhutan was officially guided by India in its foreign affairs, but effectively pursued an independent foreign policy. \\---- \\---- – Republic of Bolivia Widely recognized UN member state. \\---- \\---- → * Republic of Bosnia and Herzegovina * Bosnia and Herzegovina De facto independent state. Claimed by Yugoslavia (to 28 April 1992). Widely recognized (from 7 April 1992). UN member state (from 22 May 1992). Much of the de jure territory of the Republic of Bosnia and Herzegovina was the under control of the following self-declared entities which, although they did not claim independence, were effectively self-governing: * Autonomous Province of Western Bosnia (from 27 September 1993 to 26 July 1995) * (from 28 August 1993 to 18 March 1994) * (to 7 April 1992) In addition, there were three states which had declared and established de facto independence from Bosnia and Herzegovina: Republika Srpska (from 7 April 1992 to 14 December 1995) and Republic of Western Bosnia (from 26 July 1995 to 7 August 1995). After the Dayton Accords, Bosnia and Herzegovina was a federation of two constituent entities: the Federation of Bosnia and Herzegovina, which was itself a federation of ten cantons, and Republika Srpska. There was also a neutral Brčko District (from 5 March 1999). \\---- \\---- – Republic of Botswana Widely recognized UN member state. \\---- \\---- → – Federative Republic of Brazil Widely recognized UN member state; Brazil was a federation of 26 states and one federal district. \\---- \\---- – State of Brunei, Abode of Peace Widely recognized UN member state. Brunei claimed part of the Spratly Islands (disputed by the People's Republic of China, the Republic of China, Vietnam, the Philippines, and Malaysia). \\---- \\---- → * People's Republic of Bulgaria The Grand National Assembly of Bulgaria adopted a motion changing Bulgaria's official name on 15 November 1990. * Republic of Bulgaria Widely recognized UN member state. \\---- \\---- Widely recognized UN member state. \\---- \\---- Burma Myanmar Burma Myanmar \\---- \\---- – Republic of Burundi Widely recognized UN member state. \\---- \\---- → → Byelorussia / Belarus *Byelorussian Soviet Socialist Republic *Republic of Belarus Widely recognized UN member state. De facto independent state that was nominally a constituent state of the Soviet Union to 26 December 1991; widely recognized from 26 December 1991. \\---- \\---- === C === === C === === C === \\---- \\---- Cambodia Kampuchea Cambodia Kampuchea \\---- \\---- – Republic of Cameroon Widely recognized UN member state. \\---- \\---- Widely recognized UN member state. Commonwealth realm. Canada was a federation of ten provinces and three territories. \\---- \\---- → – Republic of Cape Verde Widely recognized UN member state. \\---- \\---- Widely recognized UN member state. \\---- \\---- – Republic of Chad Widely recognized UN member state. \\---- \\---- * Chilean military dictatorship (to 11 March 1990) * Chilean transition to democracy (11 March 1990) * Republic of Chile (from 11 March 1990) Widely recognized UN member state; it had a claim over Chilean Antarctic Territory which was suspended under the Antarctic Treaty. \\---- \\---- – People's Republic of China Widely recognized UN member state.The People's Republic of China and the Republic of China did not recognize each other, as both states claimed to be the sole legitimate government of China. The following states recognized the ROC instead of the PRC: Bahamas (to 23 May 1997), Belize, Burkina Faso (from 4 February 1994), Central African Republic (from 8 July 1991 to 29 January 1998), Chad (from 15 August 1997), Costa Rica, Dominica, Dominican Republic, El Salvador, the Gambia (from 25 July 1995), Guatemala, Guinea-Bissau (from 26 May 1990 to 13 April 1998), Grenada, Haiti, Honduras, South Korea (to 24 August 1992), Lesotho (from 5 April 1990 to 12 January 1994), Macedonia (to 27 January 1999), Malawi, Marshall Islands (from 20 November 1998), Monaco (to 16 January 1995), Nauru, Nicaragua (from 9 November 1990), Niger (from 30 June 1992 to 19 August 1996), Palau (from 1999), Panama, Paraguay, Saint Kitts and Nevis, Saint Lucia (to 1 September 1997), Saint Vincent and the Grenadines, São Tomé and Príncipe (from 6 May 1997), Saudi Arabia (to 21 July 1990), Senegal (from 6 January 1996), Solomon Islands, South Africa (to 1 January 1998), Swaziland, Tonga (to 2 November 1998), Tuvalu, and Vatican City. After 9 September 1997, Liberia recognized both the ROC and the PRC, which led to the PRC severing diplomatic relations. The People's Republic of China had five autonomous regions: Guangxi, Inner Mongolia, Ningxia, Xinjiang and Tibet. Additionally, it had sovereignty over two special administrative regions: * (from 1 July 1997) * (from 20 December 1999) The People's Republic of China claimed Taiwan, Kinmen, the Matsu Islands, Pratas Island and the Vereker Banks, and Itu Aba, all of which were governed by the Republic of China. It also claimed the Paracel Islands (disputed by the Republic of China and Vietnam), the Spratly Islands (disputed by the Republic of China, Vietnam, the Philippines, Malaysia and Brunei), and South Tibet (controlled by India). The People's Republic of China administered Aksai Chin and the Trans-Karakoram Tract, which were within the disputed region of Kashmir. \\---- \\---- – Republic of Colombia Widely recognized UN member state. Colombia administered Bajo Nuevo Bank and Serranilla Bank (disputed by Nicaragua and the United States) \\---- \\---- → → – Federal Islamic Republic of the Comoros Widely recognized UN member state. The Comoros was a federation of three islands: Grande Comore, Mohéli, and Anjouan. Anjouan was a de facto independent state from 3 August 1997. Mohéli was a de facto independent state from 11 August 1997 to 1998. Comoros claimed sovereignty over the French overseas territories of Mayotte and the Glorioso Islands. It also claimed Banc du Geyser (disputed by Madagascar and France). \\---- \\---- → Congo / Congo, Republic of the * People's Republic of the Congo A Sovereign National Conference was held in the People's Republic of Congo from 25 February 1991 to 10 June 1991, during which the country was renamed. * Republic of the Congo Widely recognized UN member state. \\---- \\---- Congo, Democratic Republic of the Zaire Congo, Democratic Republic of the Zaire \\---- \\---- – Republic of Costa Rica Widely recognized UN member state. \\---- \\---- Côte d'Ivoire Ivory Coast Côte d'Ivoire Ivory Coast \\---- \\---- – Republic of Croatia Croatia and Slovenia declared independence from Yugoslavia on 25 June 1991. De facto independent state. Claimed by Yugoslavia (to 28 April 1992). Widely recognized (from 15 January 1992). UN member state (from 22 May 1992). Croatia contained the following self-declared entities, all of which claimed to be part of Yugoslavia. Although they did not explicitly claim independence, they were de facto self- governing: * SAO Krajina (to 19 December 1991) * SAO Western Slavonia (from 12 August 1991 to 26 February 1992) * SAO Eastern Slavonia, Baranja and Western Syrmia (to 26 February 1992) * (from 19 December 1991 to 7 August 1995) * Republic of Eastern Slavonia, Baranja and Western Syrmia (from 7 August 1995 to 15 January 1996) On 15 January 1996, the last of these entities came under the administration of the United Nations Transitional Authority for Eastern Slavonia, Baranja and Western Sirmium. It was reintegrated into Croatia on 15 January 1998. \\---- \\---- – Republic of Cuba Widely recognized UN member state; the Cuban area of Guantánamo Bay was under the complete control of the United States. \\---- \\---- – Republic of Cyprus Widely recognized UN member state.Cyprus was not recognized by Turkey or Northern Cyprus The northeastern part of the island was the de facto independent state of Northern Cyprus, recognized only by Turkey. \\---- \\---- Widely recognized independent state. UN member state (from 19 January 1993). \\---- \\---- Czechoslovakia * Czechoslovak Socialist Republic Following the Velvet Revolution, the Czechoslovak Socialist Republic was replaced by the Czechoslovak Federative Republic. (Source: Česko-slovenská federatívna republika, Zbierka zákonov č. 19/1990, page 362, \"Ústavný zákon 81/1990 Zb. z 29. marca 1990 o zmene názvu Československej socialistickej republiky\", March 29, 1990 (Constitutional law about the change of the name of the Czechoslovak Socialistic Republic)) * Czechoslovak Federative Republic After a naming dispute, the name of Czechoslovakia was changed to \"Czech and Slovak Federative Republic\" (Source: Česká a Slovenská Federatívna Republika, Zbierka zákonov č. 21/1990, page 404, \"Ústavný zákon 101/1990 Zb. z 20. apríla 1990 o zmene názvu Česko-slovenskej federatívnej republiky\", April 20, 1990 (Constitutional law about the change of the name of the Czecho-Slovak Federative Republic)) * Czech and Slovak Federative Republic Czechoslovakia was dissolved on midnight of 31 December 1992. From the start of 1993, the Czech Republic and Slovakia were independent countries. Widely recognized UN member state.Owing to a dispute over lands seized during World War II, Liechtenstein and Czechoslovakia did not recognize each other. This dispute continued with Czechoslovakia's successor states. Czechoslovakia was a federation of two republics. \\---- \\---- === D === === D === === D === \\---- \\---- – Kingdom of Denmark Widely recognized UN member state; EEC member to 1 November 1993. EU member (from 1 November 1993). The Danish Realm also included two of its constituent states: * * \\---- \\---- – Republic of Djibouti Widely recognized UN member state. \\---- \\---- – Commonwealth of Dominica Widely recognized UN member state. \\---- \\---- Widely recognized UN member state. \\---- \\---- === E === === E === === E === \\---- \\---- – Republic of Ecuador Widely recognized UN member state. \\---- \\---- – Arab Republic of Egypt Widely recognized UN member state. \\---- \\---- – Republic of El Salvador Widely recognized UN member state. \\---- \\---- – Republic of Equatorial Guinea Widely recognized UN member state. \\---- \\---- → – State of Eritrea Eritrea declared independence from Ethiopia on 24 May 1993 Widely recognized independent state. UN member state (from 28 May 1993). \\---- \\---- – Republic of Estonia De facto independent state claimed by the Soviet Union to 6 September 1991. Widely recognized state from 6 September 1991; UN member state from 17 September 1991. \\---- \\---- → → → * People's Democratic Republic of EthiopiaThe Workers' Party of Ethiopia regime collapsed on 28 May 1991. * Transitional Government of Ethiopia Ethiopia's constitution came into force on 22 August 1995 * Federal Democratic Republic of Ethiopia Widely recognized UN member state. The province of Eritrea was under the control of a self-governing provisional government from 29 May 1991 to 23 May 1993. After 1995, Ethiopia was a federation of nine regions and two chartered cities. \\---- \\---- === F === === F === === F === \\---- \\---- * Republic of Fiji Fiji adopted a new constitution on 25 July 1990 * Sovereign Democratic Republic of Fiji Fiji adopted a new constitution on 25 July 1997 which came into force on 27 July 1998. * Republic of the Fiji Islands Widely recognized UN member state. Fiji had an autonomous dependency, Rotuma. \\---- \\---- – Republic of Finland Widely recognized UN member state. EU member (from 1 January 1995). Finland had a neutral and demilitarised region: * \\---- \\---- – French Republic Widely recognized UN member state. EEC member (to 1 November 1993). EU member (from 1 November 1993). France included four overseas departments: French Guiana, Guadeloupe, Martinique and Réunion. It also had sovereignty over the following overseas territories: * , with one dependency: ** Clipperton Island * French Southern and Antarctic Lands (including a claim to Adélie Land which was suspended under the Antarctic Treaty.) * * New Caledonia * * The Scattered Islands in the Indian Ocean, consisting of five uninhabited possessions: ** Bassas da India (disputed by Madagascar) ** Europa Island (disputed by Madagascar) ** Glorioso Islands (disputed by Madagascar, Comoros, and the Seychelles) ** Juan de Nova Island (disputed by Madagascar) ** Tromelin Island (disputed by Mauritius and the Seychelles) * France also claimed Banc du Geyser (disputed by Madagascar and the Comoros). \\---- \\---- === G === === G === === G === \\---- \\---- – Gabonese Republic Widely recognized UN member state. \\---- \\---- – Republic of the Gambia Widely recognized UN member state. \\---- \\---- * Republic of Georgia * Georgia De facto independent state claimed by the Soviet Union until 26 December 1991. Widely recognized sovereign state from 26 December 1991; UN member state from 31 July 1992. Georgia had two autonomous republics: Adjara and Abkhazia. The latter republic was effectively self-governing from 30 September 1993 to 12 October 1999. After 12 October 1999, it was home to a de facto independent state. Georgia also included the disputed region of South Ossetia, where an unrecognized recognized breakaway republic declared independence on 29 May 1992. \\---- \\---- – German Democratic Republic West Germany and East Germany reunified on 3 October 1990. Widely recognized UN member state. \\---- \\---- Germany, West / Germany – Federal Republic of Germany Widely recognized UN member state. EEC member (to 1 November 1993). EU member (from 1 November 1993). Germany was a federation of sixteen states. \\---- \\---- – Republic of Ghana Widely recognized UN member state. \\---- \\---- – Hellenic Republic Widely recognized UN member state; EEC member (to 1 November 1993). EU member (from 1 November 1993). Greece had sovereignty over Mount Athos, an autonomous monastic state that was jointly governed by the multi- national \"Holy Community\" on the mountain and the Civil Governor appointed by the Greek Ministry of Foreign Affairs, and spiritually came under the direct jurisdiction of the Ecumenical Patriarchate. \\---- \\---- Widely recognized UN member state; Commonwealth realm. Grenada had one autonomous dependency and it was Carriacou and Petite Martinique. \\---- \\---- – Republic of Guatemala Widely recognized UN member state. \\---- \\---- – Republic of Guinea Widely recognized UN member state. \\---- \\---- – Republic of Guinea-Bissau Widely recognized UN member state. \\---- \\---- – Co-operative Republic of Guyana Widely recognized UN member state. \\---- \\---- === H === === H === === H === \\---- \\---- – Republic of Haiti Widely recognized UN member state; Haiti claimed the uninhabited United States possession of Navassa Island. \\---- \\---- Holy See Vatican City Holy See Vatican City \\---- \\---- – Republic of Honduras Widely recognized UN member state. \\---- \\---- – Republic of Hungary Widely recognized UN member state. \\---- \\---- === I === === I === === I === \\---- \\---- – Republic of Iceland Widely recognized UN member state. \\---- \\---- – Republic of India Widely recognized UN member state; India was a federation of twenty-five states and seven union territories. Indian sovereignty over South Tibet was disputed by China; India administered part of the disputed region of Kashmir as the state of Jammu and Kashmir. \\---- \\---- – Republic of Indonesia Widely recognized UN member state.. Indonesia had three special provinces: Aceh, Jakarta, and Yogyakarta. \\---- \\---- – Islamic Republic of Iran Widely recognized UN member state. \\---- \\---- → *Iraqi Republic (until 6 January 1992) *Republic of Iraq (from 6 January 1992) Widely recognized UN member state. \\---- \\---- Widely recognized UN member state; EEC member to 1 November 1993. EU member from 1 November 1993. \\---- \\---- – State of Israel Widely recognized UN member state. Israel occupied East Jerusalem, the Gaza Strip the Golan Heights, the Israeli Security Zone in Southern Lebanon, and the West Bank. These areas were not generally recognized as being part of Israel. \\---- \\---- Italy – Italian Republic Widely recognized UN member state; EEC member to 1 November 1993. EU member from 1 November 1993. \\---- \\---- – Republic of Côte d'Ivoire Widely recognized UN member state. \\---- \\---- === J === === J === === J === \\---- \\---- Widely recognized UN member state; Commonwealth realm. \\---- \\---- → Widely recognized UN member state. Japan claimed the Liancourt Rocks, which were controlled by South Korea. \\---- \\---- – Hashemite Kingdom of Jordan Widely recognized UN member state. \\---- \\---- === K === === K === === K === \\---- \\---- → → → Kampuchea / Cambodia * Coalition Government of Democratic Kampuchea * National Government of Cambodia * United Nations Transitional Authority in Cambodia * Kingdom of Cambodia Widely recognized UN member state. Claimed to be the sole legitimate government of Cambodia, despite being in exile until 15 March 1992. \\---- \\---- → → – Republic of Kazakhstan Kazakhstan declared independence from the Soviet Union on 16 Dec 1991 De facto independent state; claimed by the Soviet Union to 26 December 1991. Widely recognized state from 26 December 1991; UN member state from 2 March 1992. \\---- \\---- – Republic of Kenya Widely recognized UN member state. \\---- \\---- – Republic of Kiribati Widely recognized independent state. UN member state (from 14 September 1999). \\---- \\---- → – Democratic People's Republic of Korea Widely recognized independent state. Permanent observer at the UN (to 17 September 1991). UN member state (from 17 September 1991). Claimed to be the sole legitimate government of Korea. \\---- \\---- → – Republic of Korea Widely recognized independent state. Permanent observer at the UN (to 17 September 1991). UN member state (from 17 September 1991). Claimed to be the sole legitimate government of Korea. South Korea controlled the Liancourt Rocks, which were claimed by Japan. \\---- \\---- – State of Kuwait Iraq annexed Kuwait on 8 August 1990. Following the Persian Gulf War, Kuwait was declared liberated on 27 February 1991. Widely recognized UN member state. \\---- \\---- → * Republic of Kyrgyzstan * Kyrgyz Republic De facto independent state; claimed by the Soviet Union to 26 December 1991. Widely recognized state from 26 December 1991; UN member state from 2 March 1992. \\---- \\---- === L === === L === === L === \\---- \\---- – Lao People's Democratic Republic Widely recognized UN member state. \\---- \\---- – Republic of Latvia De facto independent state claimed by the Soviet Union to 6 September 1991; widely recognized state from 6 September 1991 and UN member state from 17 September 1991. \\---- \\---- – Lebanese Republic Widely recognized UN member state. Lebanon was occupied by Syria. Some of Southern Lebanon was occupied by Israel. \\---- \\---- – Kingdom of Lesotho Widely recognized UN member state. \\---- \\---- – Republic of Liberia Widely recognized UN member state. \\---- \\---- Libya – Great Socialist People's Libyan Arab Jamahiriya Widely recognized UN member state. \\---- \\---- – Principality of Liechtenstein Widely recognized independent state. UN member state (from 18 September 1990). The defense of Liechtenstein was the responsibility of Switzerland. \\---- \\---- – Republic of Lithuania De facto independent state claimed by the Soviet Union to 6 September 1991. Widely recognized state from 6 September 1991; UN member state from 17 September 1991. \\---- \\---- – Grand Duchy of Luxembourg Widely recognized UN member state. EEC member (to 1 November 1993). EU member (from 1 November 1993). \\---- \\---- === M === === M === === M === \\---- \\---- → → Macedonia – Republic of Macedonia De facto independent state claimed by Yugoslavia to 28 April 1992. Widely recognized UN member state from 8 April 1993. \\---- \\---- * Democratic Republic of Madagascar Madagascar adopted a new constitution on 19 August 1992 * Republic of Madagascar Widely recognized UN member state. Madagascar claimed the French possessions of Bassas da India, Europa Island, Glorioso Islands and Juan de Nova Island. It also claimed Banc du Geyser (disputed by Comoros and France). \\---- \\---- – Republic of Malawi Widely recognized UN member state. \\---- \\---- Widely recognized UN member state. Malaysia was a federation of thirteen states and two federal territories. Malaysia claimed part of the Spratly Islands (disputed by the People's Republic of China, the Republic of China, Vietnam, the Philippines, and Brunei). \\---- \\---- – Republic of Maldives Widely recognized UN member state. \\---- \\---- – Republic of Mali Widely recognized UN member state. \\---- \\---- – Republic of Malta Widely recognized UN member state. \\---- \\---- – Republic of the Marshall Islands Widely recognized state under a Compact of Free Association with the United States; UN member state (from 17 September 1991). The Marshall Islands claimed the United States territory of Wake Island. \\---- \\---- – Islamic Republic of Mauritania Widely recognized UN member state. \\---- \\---- * Mauritius Mauritius declared itself a Republic on 12 Mar 1992 * Republic of Mauritius Widely recognized UN member state. Commonwealth realm (to 12 March 1992). Mauritius had three dependencies: Agalega Islands, Cargados Carajos and Rodrigues. It claimed the British Indian Ocean Territory and the French territory of Tromelin Island. \\---- \\---- – United Mexican States Widely recognized UN member state. Mexico was a federation of 31 states and one federal district. \\---- \\---- – Federated States of Micronesia Widely recognized state under Compact of Free Association with the United States. UN member state (from 17 September 1991). The FSM was a federation of four states. \\---- \\---- – Republic of Moldova De facto independent state claimed by the Soviet Union to 26 December 1991; widely recognized state from 26 December 1991 and UN member state from 2 March 1992. Moldova had two autonomous territorial units and they were Gagauzia and Transnistria. Both units (only Transnistria after 23 December 1994) were home to de facto independent statelets. \\---- \\---- – Principality of Monaco Widely recognized independent state. Permanent observer at the UN (to 28 May 1993). UN member state (from 28 May 1993). The defense of Monaco was the responsibility of France. \\---- \\---- → * Mongolian People's Republic Mongolia adopted a new constitution on 12 Feb 1992 * Mongolia Widely recognized UN member state. \\---- \\---- – Kingdom of Morocco Widely recognized UN member state. Morocco claimed sovereignty over and controlled most of the disputed Western Sahara, which was home to the de facto independent Sahrawi Arab Democratic Republic. Morocco disputed the Spanish sovereignty over Ceuta, Isla de Alborán, Isla Perejil, Islas Chafarinas, Melilla, and Peñón de Alhucemas. \\---- \\---- * People's Republic of Mozambique * Republic of Mozambique Widely recognized UN member state. \\---- \\---- Myanmar – Union of MyanmarCommonly known in English as \"Burma\". Widely recognized UN member state. \\---- \\---- === N === === N === === N === \\---- \\---- – Republic of Namibia Namibia gained independence from a South African League of Nations mandate on 21 March 1990. Widely recognized independent state. UN member state (from 23 April 1990). \\---- \\---- – Republic of Nauru Widely recognized independent state. UN member state (from 14 September 1999). The defense of Nauru was the responsibility of Australia. \\---- \\---- Nepal – Kingdom of Nepal Widely recognized UN member state. \\---- \\---- – Kingdom of the Netherlands Widely recognized UN member state. The Kingdom of the Netherlands consisted of three autonomous countries: * * * The Kingdom of the Netherlands as a whole was a member of the EEC (to 1 November 1993) and the EU (from 1 November 1993), but Aruba and the Netherlands Antilles were not. \\---- \\---- Widely recognized UN member state; Commonwealth realm. New Zealand had responsibilities for the two free associated states of: * * It also had sovereignty over two dependent territories: * Ross Dependency (suspended under the Antarctic Treaty) * Tokelau The government of Tokelau claimed Swains Island, part of American Samoa (a U.S. dependence). New Zealand did not recognize this claim. \\---- \\---- – Republic of Nicaragua Widely recognized UN member state. \\---- \\---- – Republic of Niger Widely recognized UN member state. \\---- \\---- * Nigeria military junta (to 17 November 1993) * Third Republic of Nigeria (from 17 November 1993 to 29 May 1999) * Fourth Republic of Nigeria (from 29 May 1999) Widely recognized UN member state. Nigeria was a federation of 36 states and one federal territory. \\---- \\---- – Kingdom of Norway Widely recognized UN member state. Norway had two integral overseas areas: Jan Mayen and Svalbard. The latter of area had a special status due to the Spitsbergen Treaty. Norway had sovereignty over the following dependencies: * Bouvet Island * Peter I Island (suspended under the Antarctic Treaty) * Queen Maud Land (suspended under the Antarctic Treaty) \\---- \\---- === O === === O === === O === \\---- \\---- → – Sultanate of Oman Widely recognized UN member state. \\---- \\---- === P === === P === === P === \\---- \\---- – Islamic Republic of Pakistan Widely recognized UN member state. Pakistan was a federation of four provinces and four territories; it administered part of the disputed region of Kashmir as the territories of Azad Kashmir and the Northern Areas. \\---- \\---- – Republic of Palau Widely recognized state under Compact of Free Association with the United States; UN member state from 15 December 1994. \\---- \\---- – Republic of Panama Widely recognized UN member state. \\---- \\---- – Independent State of Papua New Guinea Widely recognized UN member state. Commonwealth realm. \\---- \\---- → – Republic of Paraguay Widely recognized UN member state. \\---- \\---- – Republic of Peru Widely recognized UN member state. \\---- \\---- → – Republic of the Philippines Widely recognized UN member state. The Philippines had one autonomous region: Muslim Mindanao. The Philippines administered Scarborough Shoal, which was disputed by the People's Republic of China and the Republic of China. It also claimed sovereignty over the Spratly Islands (disputed by the People's Republic of China, the Republic of China, Vietnam, Brunei, and Malaysia) and the Malaysian territory of Sabah. \\---- \\---- – Republic of Poland Widely recognized UN member state. \\---- \\---- – Portuguese Republic Widely recognized UN member state. EEC member (to 1 November 1993). EU member (from 1 November 1993). Portugal had two autonomous regions: the Azores and Madeira. Portugal had one Chinese territory which it administered as a dependency: * Macau (to 19 December 1999) Portugal claimed sovereignty over the former colony of Portuguese Timor (which had been annexed by Indonesia) until 25 October 1999. It also claimed the Spanish municipalities of Olivenza and Táliga. \\---- \\---- === Q === === Q === === Q === \\---- \\---- – State of Qatar Widely recognized UN member state. \\---- \\---- === R === === R === === R === \\---- \\---- Widely recognized UN member state. \\---- \\---- → – Russian Federation Widely recognized UN member state from 26 December 1991. Russia was a federation of 21 republics, 49 oblasts, 6 krais, 2 federal cities, 1 autonomous oblast, and 10 autonomous okrugs. One of those republics, Tatarstan, declared state sovereignty on 6 November 1992 and was effectively self-governing until 15 February 1994. \\---- \\---- – Rwandese Republic Widely recognized UN member state. \\---- \\---- === S === === S === === S === \\---- \\---- – Federation of Saint Kitts and Nevis Widely recognized UN member state; Commonwealth realm. Saint Kitts and Nevis was a federation of fourteen parishes within two islands. Nevis (which was one of the islands) had autonomy. \\---- \\---- Saint Lucia Widely recognized UN member state; Commonwealth realm. \\---- \\---- Widely recognized UN member state. Commonwealth realm. \\---- \\---- Samoa Western Samoa Samoa Western Samoa \\---- \\---- – Republic of San Marino Widely recognized independent state; UN member state from 2 March 1992. \\---- \\---- – Democratic Republic of São Tomé and Príncipe Widely recognized UN member state; São Tomé and Príncipe had one autonomous province and it was Príncipe (from 29 April 1995). \\---- \\---- – Kingdom of Saudi Arabia Widely recognized UN member state. \\---- \\---- – Republic of Senegal Widely recognized UN member state. \\---- \\---- → – Republic of Seychelles Widely recognized UN member state; the Seychelles claimed the British Indian Ocean Territory and the French territories of Tromelin Island and the Glorioso Islands. \\---- \\---- – Republic of Sierra Leone Widely recognized UN member state. \\---- \\---- – Republic of Singapore Widely recognized UN member state. \\---- \\---- – Slovak Republic Widely recognized independent state. UN member state (from 19 January 1993). \\---- \\---- – Republic of Slovenia De facto independent state claimed by Yugoslavia (to 28 April 1992). Widely recognized (from 15 January 1992); UN member state (from 22 May 1992). \\---- \\---- Widely recognized UN member state. Commonwealth realm. \\---- \\---- * Somali Democratic Republic * Somali Republic President Ali Mahdi Muhammad of Somalia was ousted on 18 November 1991, although he continued to claim the title of President from exile. After this, there was no widely-recognized central government in the country. * Somalia Widely recognized UN member state. Somalia's internationally recognized government did not exercise full control over the country from 26 January 1991 to 18 November 1991. After 18 November 1991, Somalia did not have any recognized central government. Many areas of the country had no effective government at all or were ruled by local clans. During this period, Somalia included one state which was de facto self-governing (although it did not claim independence from Somalia): * Jubaland (from 3 September 1998 to 11 June 1999) In addition, there were two states which had declared and established de facto independence from Somalia: Puntland (from 1 August 1998), and Somaliland (from 18 May 1991). \\---- \\---- → – Republic of South Africa Widely recognized UN member state. South Africa had six autonomous \"bantustans\": Gazankulu, KaNgwane, KwaNdebele, KwaZulu, Lebowa, and QwaQwa. There were also four bantustans which were nominally independent: Bophuthatswana, Ciskei, Transkei, and Venda. All ten bantustans were formally abolished when a new constitution took effect on 27 April 1994. South Africa administered one League of Nations mandate: *South-West Africa (to 20 March 1990) \\---- \\---- – Union of Soviet Socialist Republics Widely recognized UN member state. The Soviet Union was a federation of 15 republics, two of which (Byelorussia and Ukraine) were UN members in their own right. \\---- \\---- – Kingdom of Spain Widely recognized UN member state; EEC member (to 1 November 1993). EU member (from 1 November 1993); Spain was divided into seventeen autonomous communities and two autonomous cities. Its sovereignty over Ceuta, Isla de Alborán, Isla Perejil, Islas Chafarinas, Melilla and Peñón de Alhucemas was disputed by Morocco. Its sovereignty over Olivenza and Táliga was disputed by Portugal. It claimed the British overseas territory of Gibraltar. \\---- \\---- – Democratic Socialist Republic of Sri Lanka Widely recognized UN member state. \\---- \\---- – Republic of the Sudan Widely recognized UN member state. After 1991, Sudan was a federation of 30 states. \\---- \\---- – Republic of Suriname Widely recognized UN member state. \\---- \\---- – Kingdom of Swaziland Widely recognized UN member state. \\---- \\---- – Kingdom of Sweden Widely recognized UN member state. EU member (from 1 January 1995). \\---- \\---- – Swiss Confederation Widely recognized independent state. Permanent observer at the UN. Switzerland was a federation of 26 cantons. \\---- \\---- – Syrian Arab Republic Widely recognized UN member state. Syria included the Golan Heights, which were occupied by Israel. It disputed the Turkish sovereignty over Hatay Province. \\---- \\---- === T === === T === === T === \\---- \\---- → – Republic of Tajikistan Tajikistan declared independence from the Soviet Union on De facto independent state; claimed by the Soviet Union to 26 December 1991. Widely recognized (from 26 December 1991). UN member state (from 2 March 1992). Tajikistan had one autonomous province: Gorno-Badakhshan. \\---- \\---- – United Republic of Tanzania Widely recognized UN member state; Tanzania had one autonomous region and it was Zanzibar. \\---- \\---- Thailand – Kingdom of Thailand Widely recognized UN member state. \\---- \\---- – Togolese Republic Widely recognized UN member state. \\---- \\---- – Kingdom of Tonga Widely recognized independent state; UN member state (from 14 September 1999). \\---- \\---- – Republic of Trinidad and Tobago Widely recognized UN member state; Trinidad and Tobago had one autonomous island and it was Tobago. \\---- \\---- → – Tunisian Republic Widely recognized UN member state. \\---- \\---- – Republic of Turkey Widely recognized UN member state. \\---- \\---- → → De facto independent state claimed by the Soviet Union to 26 December 1991; widely recognized state from 26 December 1991 and UN member state from 2 March 1992. \\---- \\---- === U === === U === === U === \\---- \\---- – Republic of Uganda Widely recognized UN member state. \\---- \\---- → → Ukraine *Ukrainian Soviet Socialist Republic *Ukraine Widely recognized UN member state; constituent republic within the Soviet Union to 26 December 1991. Widely recognized (from 26 December 1991); Ukraine had one autonomous republic and it was Crimea. \\---- \\---- Widely recognized UN member state. The United Arab Emirates was a federation of seven emirates. \\---- \\---- – United Kingdom of Great Britain and Northern Ireland Widely recognized UN member state; EEC member (to 1 November 1993) and EU member (from 1 November 1993). The United Kingdom was composed of four constituent countries: England, Northern Ireland, Scotland, and Wales. It had sovereignty over the following dependent territories: * * → * → (suspended under the Antarctic Treaty) * (disputed by Mauritius and the Seychelles) * * → * → (disputed by Argentina) * * Hong Kong (to 30 June 1997) * → * * , with two dependencies ** Ascension Island ** Tristan da Cunha * → (disputed by Argentina) * Sovereign Base Areas of Akrotiri and Dhekelia * → In addition, the British Monarch had direct sovereignty over three self-governing Crown dependencies: * , with two dependencies: ** ** ** * * \\---- \\---- – United States of America Widely recognized UN member state. The United States was a federation of 50 states, one federal district, and one incorporated territory. It asserted sovereignty over the following inhabited insular areas: * (including Swains Island, disputed by Tokelau) * * * → * The United States administered one United Nations Trust Territory: * (to 30 September 1994), consisting of one territory ** \\---- \\---- – Eastern Republic of Uruguay Widely recognized UN member state. \\---- \\---- → – Republic of Uzbekistan De facto independent state claimed by the Soviet Union to 26 December 1991; widely recognized state from 26 December 1991 and UN member state from 2 March 1992. Uzbekistan had one autonomous region (or \"republic\") and it was Karakalpakstan. \\---- \\---- === V === === V === === V === \\---- \\---- – Republic of Vanuatu Widely recognized UN member state. \\---- \\---- – Vatican City State Widely recognized independent state. Vatican City was administered by the Holy See, a sovereign entity recognized by a large number of countries and a permanent observer at the United Nations. The Holy See also administered a number of extraterritorial properties in Italy. The Pope was the ex officio head of state of Vatican City. \\---- \\---- * Republic of Venezuela * Bolivarian Republic of Venezuela Widely recognized UN member state. Venezuela was a federation of 23 states, three territories, one federal dependency, and one federal district. \\---- \\---- – Socialist Republic of Vietnam Widely recognized UN member state. Vietnam claimed sovereignty over the Paracel Islands (disputed by China and Taiwan) and Spratly Islands (disputed by the People's Republic of China, the Republic of China, Brunei, the Philippines, and Malaysia). \\---- \\---- === W === === W === === W === \\---- \\---- / Samoa * Independent State of Western Samoa Western Samoa's constitution was amended on 4 July 1997 to change the name of the country to Samoa * Independent State of Samoa Widely recognized UN member state. \\---- \\---- === Y === === Y === === Y === \\---- \\---- – Republic of Yemen North Yemen and South Yemen unified on 22 May 1990 Widely recognized UN member state. \\---- \\---- – Yemen Arab Republic Widely recognized UN member state. \\---- \\---- * People's Democratic Republic of Yemen * Democratic Republic of Yemen The former South Yemen declared independence on 21 May 1994. . Aden fell to Northern Yemeni forces on 7 July 1994. Widely recognized UN member state (to 22 May 1990). De facto independent state (from 7 July 1994). Claimed by Yemen. (from 7 July 1994). \\---- \\---- Yugoslavia – Socialist Federal Republic of Yugoslavia (to 27 April 1992) Widely recognized independent state and UN member state to 27 April 1992. Yugoslavia was a federation of six republics, four of which (Bosnia and Herzegovina, Croatia, Macedonia, and Slovenia) declared independence in 1991 and 1992. The two remaining republics, Montenegro and Serbia, established the Federal Republic of Yugoslavia on 27 April 1992. It claimed to continue Yugoslavia's international personality, but this claim was not widely recognized. \\---- \\---- === Z === === Z === === Z === \\---- \\---- → Zaire / Congo, Democratic Republic of the * Republic of Zaire * Democratic Republic of the Congo Widely recognized UN member state. \\---- \\---- → – Republic of Zambia Widely recognized UN member state. \\---- \\---- – Republic of Zimbabwe Widely recognized UN member state. \\---- \\---- ==Non-UN members or observers== ===Widely-recognized=== Name and capital city Information on status and recognition of sovereignty – Federal Republic of Yugoslavia (from 27 April 1992) Widely recognized independent state from 27 April 1992. Serbia and Montenegro was a federation of two republics, Montenegro and Serbia. Serbia and Montenegro claimed to continue Yugoslavia's international personality, but this claim was not widely recognized. Serbia itself included two autonomous provinces, which were Vojvodina and Kosovo and Metohija. The latter province was under the administration of the United Nations Interim Administration Mission in Kosovo from 10 June 1999. \\---- \\---- → → → Widely recognized independent state and Commonwealth realm. ===Others=== Name and capital city Information on status and recognition of sovereignty – Republic of Abkhazia De facto independent state not recognized by any other state; claimed by Georgia as the Autonomous Republic of Abkhazia. \\---- \\---- → Afghanistan, Islamic Emirate of Partially-recognized de facto independent state; claimed to be the sole legitimate government of Afghanistan, but this was not recognized by the UN or most countries. \\---- \\---- – State of Anjouan De facto independent state. Not recognized by any other state. Claimed by the Comoros. \\---- \\---- – Republic of Bophuthatswana Bophuthatswana was reintegrated into South Africa on 13 Mar 1994 Nominally independent South African bantustan.The nominally independent bantustans of Bophuthatswana, Ciskei, Transkei, and Venda were only recognized by South Africa and by each other. The rest of the world regarded them as part of South Africa. \\---- \\---- – Republic of Bougainville The Republic of Bougainville declared independence on 17 May 1990. After a lengthy peace process started in 1997, the Bougainville Interim Government agreed to give up their self-declared independence and establish a reconciliation government on 24 December 1998. De facto independent state. Not recognized by any other state. Claimed by Papua New Guinea. \\---- \\---- Cambodia, State of Partially recognized de facto independent state.Although the State of Cambodia had near total control over the territory of Cambodia, the majority of the states in the world recognized the former government of Democratic Kampuchea, which retained Cambodia's UN membership. The State of Cambodia was mainly recognized by Vietnam and states within the Soviet sphere of influence. Claimed to be the sole legitimate government of Cambodia. \\---- \\---- * Chechen Republic Chechnya declared state sovereignty on 1 Nov 1991The Chechen Republic of Ichkeria enacted its constitution on 12 March 1992. * Chechen Republic of Ichkeria Partially recognized de facto independent state; claimed by Russia as the Republic of Chechnya. \\---- \\---- – Republic of Ciskei Ciskei was taken over by South Africa on 22 Mar 1994 Nominally independent South African bantustan. \\---- \\---- A state in free association with New Zealand, recognized by China (from 25 July 1997). The Cook Islands is a member of multiple UN agencies with full treaty making capacity; it shares a head of state with New Zealand as well as having shared citizenship. \\---- \\---- Gagauzia – Gagauz Republic Gagauzia declared independence on 19 August 1991. The Parliament of Moldova adopted an autonomy statute for Gagauzia on 23 December 1994. De facto independent state; not recognized by any other state. Claimed by the Soviet Union until 26 December 1991 and by Moldova from 27 August 1991 to 23 December 1994. \\---- \\---- Mindanao – Federal Republic of Mindanao (de facto) De facto independent state. Not recognized by any other state. Claimed by the Philippines. \\---- \\---- Mohéli – Democratic Republic of Mohéli Mohéli declared independence from the Comoros on 11 August 1997 De facto independent state. Not recognized by any other state. Claimed by the Comoros. \\---- \\---- – Nagorno-Karabakh Republic The Nagorno-Karabakh Republic declared independence from Azerbaijan on 6 January 1992. De facto independent state; not recognized by any other state. Claimed by Azerbaijan. \\---- \\---- A state in free association with New Zealand. Niue is a member of multiple UN agencies with full treaty making capacity. It had shared citizenship with New Zealand. \\---- \\---- – Turkish Republic of Northern Cyprus Partially recognized de facto independent state.Northern Cyprus was recognized only by Turkey. Claimed by the Republic of Cyprus. \\---- \\---- – State of Palestine Disputed region consisting of three occupied territories: the West Bank, the Gaza Strip, and East Jerusalem. The declared State of Palestine, which claimed independence for all the Palestinian territories, was recognized by a large number of countries. In foreign relations, Palestine was represented by the Palestine Liberation Organization, which was a permanent observer at the United Nations. The Palestinian National Authority (established on 4 May 1994) was an interim administrative body that exercised limited control over parts of the West Bank and the Gaza Strip. \\---- \\---- Puntland – Puntland State of Somalia Puntland declared temporary independence from Somalia on 1 August 1998. De facto independent state. Not recognized by any other state. Claimed by Somalia. \\---- \\---- * Serbian Republic of Bosnia and Herzegovina The name Republika Srpska was adopted on 12 August 1992. (Source: ) * Republika Srpska De facto independent state until 14 December 1995 not recognized by any other state; claimed by Bosnia and Herzegovina and recognized as such by the UN. \\---- \\---- Partially recognized de facto independent state. The Sahrawi Arab Democratic Republic claimed the disputed territory of Western Sahara, most of which was under control of Morocco. The territories under its control, the so-called Free Zone, were claimed by Morocco. Its government resided in exile at Tindouf in Algeria. \\---- \\---- → – Republic of Somaliland De facto independent state. Not recognized by any other state. Claimed by Somalia. \\---- \\---- – Republic of South Ossetia De facto independent state. Not recognized by any other state. Claimed by Georgia. \\---- \\---- – Republic of China Since the implementation of the Act Governing Principles for Editing Geographical Educational Texts (地理教科書編審原則) in 1997, the guiding principle for all maps in geographical textbooks was that Taipei was to be marked as the capital with a label stating: “Location of Central Government” Partially recognized de facto independent state. The Republic of China claimed to be the sole legitimate government of China, but only administered Taiwan, Kinmen, the Matsu Islands, Pratas Island and Itu Aba. The Republic of China had territorial claims over Mongolia; the Russian republic of Tuva; the Sixty-Four Villages East of the River (administered by Russia); The majority of Gorno- Badakhshan (administered by Tajikistan); The eastern tip of the Wakhan Corridor (administered by Afghanistan); a small portion of Gilgit-Baltistan (administered by Pakistan and part of the disputed Kashmir region); Aksai Chin (administered by the People's Republic of China and part of the disputed Kashmir region); eastern Bhutan; South Tibet (controlled by India); and Kachin State (administered by Myanmar). \\---- \\---- Unrecognized de facto self- governing entity. Claimed by Sri Lanka. \\---- \\---- – Tatar Soviet Socialist Republic De facto independent state. De facto part of the Russian Federation since 15 February 1994. De jure since March 2002. \\---- \\---- – Republic of Transkei Nominally independent South African bantustan (until 27 April 1994). \\---- \\---- *Pridnestrovian Moldavian Soviet Socialist Republic Transnistria had declared its independence from Modolva (but within the Soviet Union) on 2 September 1990. The Soviet Union did not recognize that declaration, leading to Transnistria's full declaration of independence on 25 August 1991. * Pridnestrovian Moldavian Republic De facto independent state not recognized by any other country; claimed by the Soviet Union to 26 December 1991 and Moldova from 27 August 1991. \\---- \\---- – Republic of Venda Nominally independent South African bantustan. \\---- \\---- Western Bosnia – Republic of Western Bosnia De facto independent state. Not recognized by any other state. Claimed by Bosnia and Herzegovina. ==Other entities== Excluded from the list above are the following noteworthy entities which either were not fully sovereign or did not claim to be independent: * as a whole had no government and no permanent population. Seven states claimed portions of Antarctica and five of these had reciprocally recognised one another's claims. \"Australia, New Zealand, France, Norway and the United Kingdom reciprocally recognize the validity of each other's claims.\" These claims, which were regulated by the Antarctic Treaty System, were neither recognised nor disputed by any other signatory state.CIA – the World Factbook – Antarctica – accessed 19 January 2008 * was occupied and administered by Indonesia until October 1999 as Timor Timur, but this was not recognized by the United Nations, which considered it to be Portuguese territory under Indonesian occupation. In October 1999, Indonesia relinquished control over the territory to the United Nations Transitional Administration in East Timor, which took over responsibility for it. * was a part of the Soviet Union until August 1991, but its annexation was not widely recognized. A government in exile claimed independence for Estonia until 15 September 1992, but aside from its embassies in the West it controlled no territory. * The European Union was a sui generis supranational organisation which had 12 (later 15) member states. It was established on 1 November 1993. The member states had transferred a measure of their legislative, executive, and judicial powers to the institutions of the EU, and as such the EU had some elements of sovereignty, without generally being considered a sovereign state. The European Union did not claim to be a sovereign state and had only limited capacity for relations with other states. * Kosovo was a territory that was nominally part of Serbia and Montenegro, but after 10 June 1999 came under United Nations administration as part of the United Nations Interim Administration Mission in Kosovo. * was a part of the Soviet Union until 1991, but its annexation was not widely recognized. A government in exile claimed independence for Latvia until 21 August 1991, but aside from its embassies in the West it controlled no territory. * was a part of the Soviet Union until 1990, but its annexation was not widely recognized. A government in exile claimed independence for Lithuania until 6 September 1991, but aside from its embassies in the West it controlled no territory. * The Sovereign Military Order of Malta was an entity claiming sovereignty and (from 24 August 1994) a United Nations observer. The order had bi-lateral diplomatic relations with a large number of states, but had no territory other than extraterritorial areas within Rome.Bilateral relations with countries , Retrieved 2011-12-22 The order's Constitution stated: \"The Order is a subject of international law and exercises sovereign functions.\" Although the order frequently asserted its sovereignty, it did not claim to be a sovereign state. It lacked a defined territory. Since all its members were citizens of other states, almost all of them lived in their native countries, and those who resided in the order's extraterritorial properties in Rome did so only in connection with their official duties, the order lacked the characteristic of having a permanent population. * The United Nations Transitional Administration in East Timor was a transitional non-independent territory governed by the United Nations. It was neither sovereign nor under the sovereignty of any other state. It was established on 25 October 1999, following the end of the Indonesian occupation of East Timor. * West Berlin was a political enclave that was closely aligned with – but not actually a part of – West Germany. It consisted of three occupied sectors administered by the United States, the United Kingdom, and France. West Berlin was incorporated into the reunified Germany on 3 October 1990. ==Notes== ==References== Category:1990s Category:Lists of countries in the 20th century",
 "title": "List of countries in the 1990s"
}