{
 "id": "88141",
 "text": "Yulia Volodymyrivna Tymoshenko (, born 27 November 1960), is a Ukrainian politician. Tymoshenko is a member of the Verkhovna Rada since 2014. She is the leader of the Yulia Tymoshenko Bloc political party. She was the Prime Minister of Ukraine for two separate terms in 2005 and again from 2007 until 2010. ==Political career== Her first term as Prime Minister was from 24 January to 8 September 2005. She was re-elected on 18 December 2007 but was removed by the Ukrainian Parliament on 3 March 2010Ukrainian parliament creates new coalition, Kyiv Post (11 March 2010) after the government with her own political party and the political party of Viktor Yushchenko (former President of Ukraine) Our Ukraine and the small Lytvyn Bloc lost a no- confidence vote. While they were once strong allies, today there is a lot of political rivalry between Yushchenko and Tymoshenko. When Viktor Yushchenko lost the 2004 Ukrainian presidential election, and his followers argued that the election had been corrupt, she was his main ally and one of the leaders of the Orange Revolution.Profile: Yulia Tymoshenko, BBC News ===Presidential campaigns=== In February 2010 Tymoshenko lost the presidential election to Viktor Yanukovych; with a 3.48% difference, she said Yanukovych won because of fraud.Profile: Viktor Yanukovych, BBC News She has promised to make life for the new President as difficult as possible. She was an unsuccessful candidate for President of Ukraine in the 2019 presidential election. ==Criminal charges== On 11 October 2011 a Ukrainian judge sentenced Tymoshenko to seven years in prison for misusing her powers as Prime Minister when she signed a natural gas deal with Russia in 2009.Ukraine ex-PM Yulia Tymoshenko jailed over gas deal, BBC News (11 October 2011) She had been in prison for improper behaviour in court since 5 August 2011. Tymoshenko appealed against the sentence on 24 October 2011;Tymoshenko files appeal against court ruling in gas case, Kyiv Post (24 October 2011) she said the sentence was an act of revenge by Viktor Yanukovych (he has said it is not).Yanukovych denies political motives for trial of Tymoshenko, Kyiv Post (11 October 2011) The European Union and Russia protested against the sentence. ==Personal life== Tymoshenko was born in Dnipro, Ukrainian SSR, Soviet Union. She studied at Dnipro Polytechnic, Oles Honchar Dnipro National University and Kyiv National Economic University. Tymoshenko's first name is sometimes spelled Yuliya, Yulia, Iulia, or Julia. In 1979, she married businessman Oleksandr Tymoshenko. They have a daughter, businesswoman Eugenia. ==References== == Other websites == * Yulia Tymoshenko personal site Official personal site of Yulia Tymoshenko Category:1960 births Category:Living people Category:Prime ministers of Ukraine Category:Prisoners",
 "title": "Yulia Tymoshenko"
}