{
 "id": "881450",
 "text": "This is a list of countries in the 2010s, giving an overview of states around the world during the period between 1 January 2010 and 31 December 2019. It contains 209 entries, arranged alphabetically, with information on the status and recognition of their sovereignty. It includes 195 widely recognized sovereign states, 2 associated states, and 12 entities which claim an effective sovereignty but are considered de facto constituents of other powers by the general international community. ==Members or observers of the United Nations== Name and capital city Information on status and recognition of sovereignty \\---- \\---- === A === === A === === A === \\---- \\---- → – Islamic Republic of Afghanistan Widely recognized UN member state. \\---- \\---- – Republic of Albania Widely recognized UN member state. \\---- \\---- – People's Democratic Republic of Algeria Widely recognized UN member state. \\---- \\---- – Principality of Andorra Widely recognized UN member state; the President of France and Bishop of Urgell were ex officio Co-Princes of Andorra. The defense of Andorra was the responsibility of France and Spain. \\---- \\---- – Republic of Angola Widely recognized UN member state and a non-permanent member of the UN Security Council during 2015 and 2016. \\---- \\---- Widely recognized UN member state; Commonwealth realm. Antigua and Barbuda has two dependencies, Barbuda and Redonda. \\---- \\---- – Argentine Republic Widely recognized UN member state and a non-permanent member of the UN Security Council during 2013 and 2014. Argentina is a federation of 23 provinces and an autonomous city. It had a claim over Argentine Antarctica, which is suspended under the Antarctic Treaty. It also claims the Falkland Islands and South Georgia and the South Sandwich Islands, both of which were British overseas territories. \\---- \\---- – Republic of Armenia Widely recognized UN member state and a non-permanent member of the UN Security Council during 2012 and 2013. \\---- \\---- – Commonwealth of Australia Widely recognized UN member state and a non- permanent member of the UN Security Council during 2013 and 2014; Commonwealth realm. Australia is a federation of six states and three territories. It had sovereignty over the following external territories: * Ashmore and Cartier Islands * Australian Antarctic Territory (suspended under the Antarctic Treaty.) * * * Coral Sea Islands * Heard Island and McDonald Islands * \\---- \\---- – Republic of Austria Widely recognized UN member state and a non- permanent member of the UN Security Council during 2010. EU member. Austria is a federation of nine states. \\---- \\---- – Republic of Azerbaijan Widely recognized UN member state and a non-permanent member of the UN Security Council during 2012 and 2013. Azerbaijan had one autonomous republic, Nakhchivan. It included the disputed region of Nagorno-Karabakh, where a partially recognized breakaway republic had declared independence. \\---- \\---- === B === === B === === B === \\---- \\---- – Commonwealth of the Bahamas Widely recognized UN member state; Commonwealth realm. \\---- \\---- – Kingdom of Bahrain Widely recognized UN member state. \\---- \\---- – People's Republic of Bangladesh Widely recognized UN member state. \\---- \\---- Widely recognized UN member state; Commonwealth realm. \\---- \\---- → – Republic of Belarus Widely recognized UN member state. \\---- \\---- – Kingdom of Belgium Widely recognized UN member state and a non-permanent member of the UN Security Council during 2019. EU member. Belgium is a federation of three communities and three regions. \\---- \\---- → Widely recognized UN member state; Commonwealth realm. \\---- \\---- – Republic of Benin Capital: Porto-Novo (official), Cotonou (seat of government) Widely recognized UN member state. \\---- \\---- – Kingdom of Bhutan Widely recognized UN member state. \\---- \\---- – Plurinational State of Bolivia Capital: Sucre (official), La Paz (administrative) Widely recognized UN member state and a non-permanent member of the UN Security Council during 2017 and 2018. \\---- \\---- Widely recognized UN member state and a non-permanent member of the UN Security Council during 2010 and 2011. Bosnia and Herzegovina is a federation of two constituent entities: the Federation of Bosnia and Herzegovina, which was itself a federation of ten cantons, and Republika Srpska. \\---- \\---- – Republic of Botswana Widely recognized UN member state. \\---- \\---- – Federative Republic of Brazil Widely recognized UN member state and a non-permanent member of the UN Security Council during 2010 and 2011. Brazil is a federation of 26 states and one federal district. \\---- \\---- – Nation of Brunei, Abode of Peace Widely recognized UN member state. Brunei claims part of the Spratly Islands (disputed by the People's Republic of China, the Republic of China, Vietnam, the Philippines, and Malaysia). \\---- \\---- – Republic of Bulgaria Widely recognized UN member state. EU member. \\---- \\---- Widely recognized UN member state. \\---- \\---- Burma Myanmar Burma Myanmar \\---- \\---- – Republic of Burundi Capital: Bujumbura (to 24 December 2018), Gitega (from 24 December 2018) Widely recognized UN member state. \\---- \\---- === C === === C === === C === \\---- \\---- – Kingdom of Cambodia Widely recognized UN member state. \\---- \\---- – Republic of Cameroon Widely recognized UN member state. \\---- \\---- Widely recognized UN member state; Commonwealth realm. Canada is a federation of ten provinces and three territories. \\---- \\---- * Republic of Cape Verde (to 24 October 2013) * Republic of Cabo Verde (from 24 October 2013) Widely recognized UN member state. \\---- \\---- Widely recognized UN member state. \\---- \\---- – Republic of Chad Widely recognized UN member state and a non- permanent member of the UN Security Council during 2014 and 2015. \\---- \\---- – Republic of Chile Widely recognized UN member state and a non-permanent member of the UN Security Council during 2014 and 2015. Chile has two special territories: Easter Island and the Juan Fernández Islands. It had a claim over Chilean Antarctic Territory, which is suspended under the Antarctic Treaty. \\---- \\---- – People's Republic of China Widely recognized UN member state and a permanent member of the UN Security Council. The People's Republic of China had five autonomous regions: Guangxi, Inner Mongolia, Ningxia, Xinjiang and Tibet. Additionally, it had sovereignty over two special administrative regions: * * The People's Republic of China claims Taiwan, Kinmen, the Matsu Islands, Pratas Island and the Vereker Banks, and Itu Aba, all of which were governed by the Republic of China. It also claims the Paracel Islands (disputed by the Republic of China and Vietnam), the Spratly Islands (disputed by the Republic of China, Vietnam, the Philippines, Malaysia and Brunei), and South Tibet (controlled by India). The People's Republic of China administered Aksai Chin and the Trans-Karakoram Tract, which were within the disputed region of Kashmir. \\---- \\---- – Republic of Colombia Widely recognized UN member state and a non-permanent member of the UN Security Council during 2011 and 2012. Colombia administered Serranilla Bank and claims Bajo Nuevo Bank (disputed by Nicaragua and the United States) \\---- \\---- – Union of the Comoros Widely recognized UN member state. The Comoros is a federation of three islands autonomous islands: Grande Comore, Mohéli, and Anjouan. Comoros also claims sovereignty over the French region of Mayotte and the Glorioso Islands. Comoros also claims Banc du Geyser (disputed by Madagascar and France). \\---- \\---- Widely recognized UN member state. \\---- \\---- Widely recognized UN member state. \\---- \\---- – Republic of Costa Rica Widely recognized UN member state. \\---- \\---- Côte d'Ivoire Ivory Coast Côte d'Ivoire Ivory Coast \\---- \\---- – Republic of Croatia Widely recognized UN member state. EU member (from 1 July 2013). \\---- \\---- – Republic of Cuba Widely recognized UN member state. The Cuban area of Guantánamo Bay is under the permanent control of the United States. \\---- \\---- – Republic of Cyprus Widely recognized UN member state. EU member. The northeastern part of the island is the de facto independent state of Northern Cyprus, recognized only by Turkey. \\---- \\---- Widely recognized UN member state. EU member. \\---- \\---- === D === === D === === D === \\---- \\---- – Kingdom of Denmark Widely recognized UN member state. EU member. The Kingdom of Denmark also included two autonomous countries: * * \\---- \\---- – Republic of Djibouti Widely recognized UN member state. \\---- \\---- – Commonwealth of Dominica Widely recognized UN member state. \\---- \\---- Widely recognized UN member state and a non-permanent member of the UN Security Council during 2019. \\---- \\---- === E === === E === === E === \\---- \\---- – Democratic Republic of Timor-Leste Widely recognized UN member state. \\---- \\---- – Republic of Ecuador Widely recognized UN member state. \\---- \\---- – Arab Republic of Egypt Widely recognized UN member state and a non-permanent member of the UN Security Council during 2016 and 2017. \\---- \\---- – Republic of El Salvador Widely recognized UN member state. \\---- \\---- – Republic of Equatorial Guinea Widely recognized UN member state and a non-permanent member of the UN Security Council during 2018 and 2019. \\---- \\---- – State of Eritrea Widely recognized UN member state. \\---- \\---- – Republic of Estonia Widely recognized UN member state. EU member. \\---- \\---- / Swaziland Capital: Mbabane (administrative), Lobamba (royal and legislative) * Kingdom of Swaziland (to 19 April 2018) * Kingdom of Eswatini (from 19 April 2018) Widely recognized UN member state. \\---- \\---- – Federal Democratic Republic of Ethiopia Widely recognized UN member state and a non-permanent member of the UN Security Council during 2017 and 2018. Ethiopia is a federation of nine regions and two chartered cities. \\---- \\---- === F === === F === === F === \\---- \\---- * Republic of the Fiji Islands (to 2 February 2011) * Republic of Fiji (from 2 February 2011) Widely recognized UN member state. Fiji had an autonomous dependency, Rotuma. \\---- \\---- – Republic of Finland Widely recognized UN member state. EU member. Finland had a neutral and demilitarised region: * \\---- \\---- – French Republic Widely recognized UN member state and a permanent member of the UN Security Council. EU member. France includes five (four until March 2011) overseas departments: French Guiana, Guadeloupe, Martinique, Mayotte (from 31 March 2011) and Réunion. It also has sovereignty over the following overseas territories: * Clipperton Island * * (including a claim to Adélie Land which is suspended under the Antarctic Treaty.) * (to 31 March 2011) * * * Saint Martin * * French Southern and Antarctic Lands (district of Scattered Islands in the Indian Ocean): ** Bassas da India (disputed by Madagascar) ** Europa Island (disputed by Madagascar) ** Glorioso Islands (disputed by Madagascar and Comoros) ** Juan de Nova Island (disputed by Madagascar) ** Tromelin Island (disputed by Mauritius) * France also claims Banc du Geyser (disputed by Madagascar and the Comoros). \\---- \\---- === G === === G === === G === \\---- \\---- – Gabonese Republic Widely recognized UN member state and a non-permanent member of the UN Security Council during 2010 and 2011. \\---- \\---- * Republic of the Gambia (to 11 December 2015, from 29 January 2017) * Islamic Republic of the Gambia (from 11 December 2015 to 29 January 2017) Widely recognized UN member state. \\---- \\---- Widely recognized UN member state. Georgia had two autonomous republics: Adjara and Abkhazia. The latter republic is home to a de facto independent state. Georgia also included the disputed region of South Ossetia, where a partially recognized breakaway republic had declared independence. \\---- \\---- – Federal Republic of Germany Widely recognized UN member state and a non-permanent member of the UN Security Council during 2011 and 2012 and 2019. EU member. Germany is a federation of sixteen states. \\---- \\---- – Republic of Ghana Widely recognized UN member state. \\---- \\---- – Hellenic Republic Widely recognized UN member state. EU member. Greece has sovereignty over Mount Athos, an autonomous monastic state that is jointly governed by the multi-national \"Holy Community\" on the mountain and the Civil Governor appointed by the Greek Ministry of Foreign Affairs, and spiritually under the direct jurisdiction of the Ecumenical Patriarchate. \\---- \\---- Widely recognized UN member state; Commonwealth realm. Grenada has one autonomous dependency, Carriacou and Petite Martinique. \\---- \\---- – Republic of Guatemala Widely recognized UN member state and a non-permanent member of the UN Security Council during 2012 and 2013. \\---- \\---- – Republic of Guinea Widely recognized UN member state. \\---- \\---- – Republic of Guinea-Bissau Widely recognized UN member state. \\---- \\---- – Co-operative Republic of Guyana Widely recognized UN member state. \\---- \\---- === H === === H === === H === \\---- \\---- – Republic of Haiti Widely recognized UN member state. Haiti claims the uninhabited United States possession of Navassa Island. \\---- \\---- Holy See Vatican City Holy See Vatican City \\---- \\---- – Republic of Honduras Widely recognized UN member state. \\---- \\---- * Republic of Hungary (to 1 January 2012) * Hungary (from 1 January 2012) Widely recognized UN member state and EU member. \\---- \\---- === I === === I === === I === \\---- \\---- – Republic of Iceland Widely recognized UN member state. \\---- \\---- – Republic of India Widely recognized UN member state and a non-permanent member of the UN Security Council during 2011 and 2012. India is a federation of twenty-nine states and seven union territories. Indian sovereignty over South Tibet is disputed by the People's Republic of China. India administers part of the disputed region of Kashmir as the state of Jammu and Kashmir. \\---- \\---- – Republic of Indonesia Widely recognized UN member state and a non-permanent member of the UN Security Council during 2019. Indonesia had five special provinces: Aceh, Jakarta, Papua, West Papua, and Yogyakarta. \\---- \\---- – Islamic Republic of Iran Widely recognized UN member state. \\---- \\---- – Republic of Iraq Widely recognized UN member state. Iraq is constitutionally designated as a federation of autonomous regions, but only one region (Iraqi Kurdistan) had been established. \\---- \\---- – Republic of Ireland Widely recognized UN member state. EU member. \\---- \\---- *State of Israel (to 17 March 2016) *Israel (from 17 March 2016) Widely recognized UN member state. Israel occupies East Jerusalem, the Gaza Strip, the Golan Heights, and the West Bank. These areas were not generally recognized as being part of Israel. \\---- \\---- – Italian Republic Widely recognized UN member state and a non-permanent member of the UN Security Council during 2017. EU member. Italy had 5 autonomous regions: Aosta Valley, Friuli-Venezia Giulia, Sardinia, Sicily, and Trentino-Alto Adige/Südtirol. \\---- \\---- – Republic of Côte d'Ivoire Capital: Yamoussoukro (official), Abidjan (seat of government) Widely recognized UN member state and a non-permanent member of the UN Security Council during 2018 and 2019. \\---- \\---- === J === === J === === J === \\---- \\---- Widely recognized UN member state; Commonwealth realm. \\---- \\---- Widely recognized UN member state and a non-permanent member of the UN Security Council during 2010 and 2016 and 2017. \\---- \\---- – Hashemite Kingdom of Jordan Widely recognized UN member state and a non-permanent member of the UN Security Council during 2014 and 2015. \\---- \\---- === K === === K === === K === \\---- \\---- – Republic of Kazakhstan Capital: Astana (renamed Nur-Sultan in 2019) Widely recognized UN member state and a non-permanent member of the UN Security Council during 2017 and 2018. \\---- \\---- – Republic of Kenya Widely recognized UN member state. \\---- \\---- – Republic of Kiribati Widely recognized UN member state. \\---- \\---- – Democratic People's Republic of Korea Widely recognized UN member state. It claims to be the sole legitimate government of Korea. \\---- \\---- → – Republic of Korea Widely recognized UN member state and a non-permanent member of the UN Security Council during 2013 and 2014. South Korea had one autonomous region: Jeju-do. It claims to be the sole legitimate government of Korean Peninsula. \\---- \\---- – State of Kuwait Widely recognized UN member state and a non-permanent member of the UN Security Council during 2018 and 2019. \\---- \\---- – Kyrgyz Republic Widely recognized UN member state. \\---- \\---- === L === === L === === L === \\---- \\---- – Lao People's Democratic Republic Widely recognized UN member state. \\---- \\---- – Republic of Latvia Widely recognized UN member state. EU member. \\---- \\---- – Lebanese Republic Widely recognized UN member state and a non-permanent member of the UN Security Council during 2010 and 2011. \\---- \\---- – Kingdom of Lesotho Widely recognized UN member state. \\---- \\---- – Republic of Liberia Widely recognized UN member state. \\---- \\---- → * Great Socialist People's Libyan Arab Jamahiriya (to 23 October 2011) * Libya (from 27 February 2011 to 22 December 2017) * State of Libya (from 22 December 2017) Widely recognized UN member state. Control passed due to civil war between 15 February 2011 and de facto 20 October 2011, de jure 23 October 2011. \\---- \\---- – Principality of Liechtenstein Widely recognized UN member state. The defense of Liechtenstein is the responsibility of Switzerland. \\---- \\---- – Republic of Lithuania Widely recognized UN member state and a non-permanent member of the UN Security Council during 2014 and 2015. EU member. \\---- \\---- – Grand Duchy of Luxembourg Widely recognized UN member state and a non-permanent member of the UN Security Council during 2013 and 2014. EU member. \\---- \\---- === M === === M === === M === \\---- \\---- Macedonia North Macedonia Macedonia North Macedonia \\---- \\---- – Republic of Madagascar Widely recognized UN member state. Madagascar claims the French possessions of Bassas da India, Europa Island, Glorioso Islands and Juan de Nova Island. It also claims Banc du Geyser (disputed by Comoros and France) \\---- \\---- → → – Republic of Malawi Widely recognized UN member state. \\---- \\---- Capital: Kuala Lumpur (official), Putrajaya (administrative) Widely recognized UN member state and a non-permanent member of the UN Security Council during 2015 and 2016. Malaysia is a federation of thirteen states and three federal territories. Malaysia claims part of the Spratly Islands (disputed by the People's Republic of China, the Republic of China, Vietnam, the Philippines, and Brunei). \\---- \\---- – Republic of Maldives Widely recognized UN member state. \\---- \\---- – Republic of Mali Widely recognized UN member state. Part of Mali's territory was controlled by the de facto State of Azawad from 6 April 2012 to 12 July 2012. \\---- \\---- – Republic of Malta Widely recognized UN member state. EU member. \\---- \\---- – Republic of the Marshall Islands Widely recognized UN member state under Compact of Free Association with the United States. The Marshall Islands claims the United States territory of Wake Island. \\---- \\---- → – Islamic Republic of Mauritania Widely recognized UN member state. \\---- \\---- – Republic of Mauritius Widely recognized UN member state. Mauritius had one autonomous dependency: Rodrigues. Mauritius also had two other dependencies: Agalega Islands and Cargados Carajos. It claims the British Indian Ocean Territory and the French territory of Tromelin Island. \\---- \\---- – United Mexican States Widely recognized UN member state and a non-permanent member of the UN Security Council during 2010. Mexico is a federation of 31 states and one federal district. \\---- \\---- Widely recognized UN member state under Compact of Free Association with the United States. The FSM is a federation of four states. \\---- \\---- – Republic of Moldova Widely recognized UN member state. Moldova had two autonomous territorial units: Gagauzia and Transnistria. The latter is home to a de facto independent state. \\---- \\---- – Principality of Monaco Widely recognized UN member state. The defense of Monaco is the responsibility of France. \\---- \\---- → Widely recognized UN member state. \\---- \\---- Widely recognized UN member state. \\---- \\---- – Kingdom of Morocco Widely recognized UN member state and a non-permanent member of the UN Security Council during 2012 and 2013. Morocco claims sovereignty over and controlled most of the disputed Western Sahara, which is home to the de facto independent Sahrawi Arab Democratic Republic. Morocco disputed the Spanish sovereignty over Ceuta, Isla de Alborán, Isla Perejil, Islas Chafarinas, Melilla, and Peñón de Alhucemas. \\---- \\---- – Republic of Mozambique Widely recognized UN member state. \\---- \\---- → *Union of Myanmar (to 21 October 2010) *Republic of the Union of Myanmar (from 21 October 2010) Widely recognized UN member state. \\---- \\---- === N === === N === === N === \\---- \\---- – Republic of Namibia Widely recognized UN member state. \\---- \\---- – Republic of Nauru Capital: Yaren (unofficial, seat of parliament) Widely recognized UN member state. The defense of Nauru is the responsibility of Australia. \\---- \\---- – Federal Democratic Republic of Nepal Widely recognized UN member state. Nepal is designated as a federation, and its seven provinces were created on 20 September 2015. \\---- \\---- – Kingdom of the Netherlands Capital: Amsterdam (official), The Hague (seat of government) Widely recognized UN member state and a non-permanent member of the UN Security Council during 2018. The Kingdom of the Netherlands consists of four (three until October 2010) autonomous countries: * * * (to 10 October 2010) * (from 10 October 2010) * (from 10 October 2010) Territory of islands without autonomy (consists of three special municipalities that are part of the Netherlands): * (from 10 October 2010) The Kingdom of the Netherlands as a whole is a member of the EU, but Aruba, Curaçao, Sint Maarten and Caribbean Netherlands are not. \\---- \\---- Widely recognized UN member state and a non- permanent member of the UN Security Council during 2015 and 2016; Commonwealth realm. New Zealand had responsibilities for the two free associated states of: * * It also had sovereignty over two dependent territories: * Ross Dependency (suspended under the Antarctic Treaty) * The government of Tokelau claims Swains Island, part of American Samoa (a U.S. dependence). New Zealand does not recognize this claim. \\---- \\---- – Republic of Nicaragua Widely recognized UN member state. Nicaragua had two autonomous regions: the North Caribbean Coast Autonomous Region and South Caribbean Coast Autonomous Region. Until constitutional reforms in 2014, they were referred to as the North Atlantic Autonomous Region and South Atlantic Autonomous Region. \\---- \\---- – Republic of Niger Widely recognized UN member state. \\---- \\---- – Federal Republic of Nigeria Widely recognized UN member state and a non-permanent member of the UN Security Council during 2010 and 2011 and 2014 and 2015. Nigeria is a federation of 36 states and one federal territory. \\---- \\---- / Macedonia * Republic of Macedonia (to 12 February 2019) * Republic of North Macedonia (from 12 February 2019) Widely recognized UN member state. \\---- \\---- – Kingdom of Norway Widely recognized UN member state. Norway had two integral overseas areas: Jan Mayen and Svalbard. The latter of area had a special status due to the Spitsbergen Treaty. Norway had sovereignty over the following dependencies: * Bouvet Island * Peter I Island (suspended under the Antarctic Treaty) * Queen Maud Land (suspended under the Antarctic Treaty) \\---- \\---- === O === === O === === O === \\---- \\---- – Sultanate of Oman Widely recognized UN member state. \\---- \\---- === P === === P === === P === \\---- \\---- – Islamic Republic of Pakistan Widely recognized UN member state. Pakistan is a federation of four provinces and four territories. It administers part of the disputed region of Kashmir as the territories of Azad Kashmir and the autonomous territory of Gilgit-Baltistan. \\---- \\---- – Republic of Palau Widely recognized UN member state under Compact of Free Association with the United States. \\---- \\---- Capital: Ramallah (administrative), Gaza City (administrative), Jerusalem (claims) *Palestinian National Authority (to 3 January 2013) *State of Palestine (from 2 January 2013) Partially recognised de facto self-governing entity. Palestine claims sovereignty over a disputed region consisting of three Israeli-occupied territories: the West Bank, the Gaza Strip, and East Jerusalem. In foreign relations, Palestine was represented by the Palestine Liberation Organization, which was a permanent observer at the United Nations (to 29 November 2012). Permanent observer at the United Nations (since 29 November 2012). The Palestinian National Authority is an interim administrative body that exercised limited control over parts of the West Bank and the Gaza Strip. Gaza is under the control of Hamas. \\---- \\---- – Republic of Panama Widely recognized UN member state. \\---- \\---- – Independent State of Papua New Guinea Widely recognized UN member state; Commonwealth realm. Papua New Guinea has one autonomous region: Bougainville. \\---- \\---- → – Republic of Paraguay Widely recognized UN member state. \\---- \\---- – Republic of Peru Widely recognized UN member state and a non-permanent member of the UN Security Council during 2018 and 2019. \\---- \\---- – Republic of the Philippines Widely recognized UN member state. The Philippines had one autonomous region: Muslim Mindanao (until 2019), Bangsamoro (since 2019). The Philippines administered Scarborough Shoal, which was disputed by the People's Republic of China and the Republic of China. It also claims sovereignty over the Spratly Islands (disputed by China, Taiwan, Vietnam, Brunei, and Malaysia) and the Malaysian territory of Sabah. Part of the Philippines' territory was controlled by the de facto Bangsamoro Republik from 27 July 2013 to 28 September 2013. \\---- \\---- – Republic of Poland Widely recognized UN member state and a non-permanent member of the UN Security Council during 2018 and 2019. EU member. \\---- \\---- – Portuguese Republic Widely recognized UN member state and a non-permanent member of the UN Security Council during 2011 and 2012. EU member. Portugal had two autonomous regions: the Azores and Madeira. Portugal claims the Spanish municipalities of Olivenza and Táliga. \\---- \\---- === Q === === Q === === Q === \\---- \\---- – State of Qatar Widely recognized UN member state. \\---- \\---- === R === === R === === R === \\---- \\---- Widely recognized UN member state. EU member. \\---- \\---- – Russian Federation Widely recognized UN member state and a permanent member of the UN Security Council. Russia is a federation of 22 republics, 46 oblasts, 9 krais, 3 federal cities, 1 autonomous oblast, and 4 autonomous okrugs. Republic of Crimea and the city of Sevastopol, annexed in 2014, are recognized as a part of Ukraine by most of the international community. \\---- \\---- – Republic of Rwanda Widely recognized UN member state and a non-permanent member of the UN Security Council during 2013 and 2014. \\---- \\---- === S === === S === === S === \\---- \\---- – Federation of Saint Kitts and Nevis Widely recognized UN member state; Commonwealth realm. Saint Kitts and Nevis is a federation of fourteen parishes within two island. Nevis (which is one of the islands) has autonomy. \\---- \\---- Widely recognized UN member state; Commonwealth realm. \\---- \\---- Widely recognized UN member state; Commonwealth realm. \\---- \\---- – Independent State of Samoa Widely recognized UN member state. \\---- \\---- → – Republic of San Marino Widely recognized UN member state. \\---- \\---- – Democratic Republic of São Tomé and Príncipe Widely recognized UN member state. São Tomé and Príncipe had one autonomous province: Príncipe. \\---- \\---- – Kingdom of Saudi Arabia Widely recognized UN member state. \\---- \\---- – Republic of Senegal Widely recognized UN member state and a non-permanent member of the UN Security Council during 2016 and 2017. \\---- \\---- → – Republic of Serbia Widely recognized UN member state. Serbia had two autonomous provinces: Vojvodina and Kosovo and Metohija. The latter was governed by the United Nations Interim Administration Mission in Kosovo; Kosovo declared independence in 2008, and is a partially recognized de facto independent republic. \\---- \\---- – Republic of Seychelles Widely recognized UN member state. The Seychelles claims the British Indian Ocean Territory. \\---- \\---- – Republic of Sierra Leone Widely recognized UN member state. \\---- \\---- – Republic of Singapore Widely recognized UN member state. \\---- \\---- – Slovak Republic Widely recognized UN member state. EU member. \\---- \\---- – Republic of Slovenia Widely recognized UN member state. EU member. \\---- \\---- Widely recognized UN member state; Commonwealth realm. \\---- \\---- *Somalia (to 1 August 2012) *Federal Republic of Somalia (from 1 August 2012) Widely recognized UN member state. Over the course of the Somali Civil War, several autonomous regional governments were established in the de jure territory of Somalia. Although these states did not claim independence from Somalia, they were de facto self-governing: * Ahlu Sunna Waljama'a * al- Shabaab * Galmudug * Himan and Heeb * Hizbul Islam (to 20 December 2010) * Jubaland/Azania * There were also areas of the country which at various times had no effective government at all or which were ruled by local clans. In addition, there is one state which has declared and established de facto independence from Somalia: Somaliland. \\---- \\---- – Republic of South Africa Capital: Pretoria (administrative), Cape Town (legislative), Bloemfontein (judicial) Widely recognized UN member state and a non-permanent member of the UN Security Council during 2011 and 2012 and 2019. \\---- \\---- – Republic of South Sudan (from 9 July 2011) Widely recognized independent state. UN member state (from 14 July 2011). Disputes Abyei with the Republic of the Sudan. South Sudan is a federation of 10 states. \\---- \\---- – Kingdom of Spain Widely recognized UN member state and a non-permanent member of the UN Security Council during 2015 and 2016. EU member. Spain is divided into seventeen autonomous communities and two autonomous cities. Its sovereignty over Ceuta, Isla de Alborán, Isla Perejil, Islas Chafarinas, Melilla and Peñón de Alhucemas is disputed by Morocco. Its sovereignty over Olivenza and Táliga is disputed by Portugal. It claims the British overseas territory of Gibraltar. \\---- \\---- – Democratic Socialist Republic of Sri Lanka Capital: Sri Jayawardenapura-Kotte (administrative), Colombo (commercial) Widely recognized UN member state. \\---- \\---- – Republic of the Sudan Widely recognized UN member state. Sudan is a federation of 25 states (later 15, then 17, then 18), ten of which formed South Sudan on 9 July 2011. Disputes Abyei with the Republic of the South Sudan \\---- \\---- – Republic of Suriname Widely recognized UN member state. \\---- \\---- Swaziland Eswatini Swaziland Eswatini \\---- \\---- – Kingdom of Sweden Widely recognized UN member state and a non- permanent member of the UN Security Council during 2017 and 2018. EU member. \\---- \\---- – Swiss Confederation Widely recognized independent state. UN member state. Switzerland is a federation of 26 cantons. \\---- \\---- – Syrian Arab Republic Widely recognized UN member state. Syria included the Golan Heights, which were occupied by Israel. It disputed the Turkish sovereignty over Hatay Province. Syrian Arab Republic is widely viewed as the legitimate authority of Syria. \\---- \\---- === T === === T === === T === \\---- \\---- – Republic of Tajikistan Widely recognized UN member state. Tajikistan had one autonomous province: Gorno-Badakhshan. \\---- \\---- – United Republic of Tanzania Capital: Dodoma (official), Dar es Salaam (seat of government) Widely recognized UN member state. Tanzania had one autonomous region: Zanzibar. \\---- \\---- → – Kingdom of Thailand Widely recognized UN member state. \\---- \\---- Timor-Leste East Timor Timor-Leste East Timor \\---- \\---- – Togolese Republic Widely recognized UN member state and a non-permanent member of the UN Security Council during 2012 and 2013. \\---- \\---- – Kingdom of Tonga Widely recognized UN member state. \\---- \\---- – Republic of Trinidad and Tobago Widely recognized UN member state. Trinidad and Tobago had one autonomous island: Tobago. \\---- \\---- – Tunisian Republic Widely recognized UN member state. \\---- \\---- – Republic of Turkey Widely recognized UN member state and a non-permanent member of the UN Security Council during 2010. \\---- \\---- Widely recognized UN member state. \\---- \\---- Widely recognized UN member state; Commonwealth realm. \\---- \\---- === U === === U === === U === \\---- \\---- – Republic of Uganda Widely recognized UN member state and a non- permanent member of the UN Security Council during 2010. \\---- \\---- Widely recognized UN member state and a non-permanent member of the UN Security Council during 2016 and 2017. Ukraine has one autonomous republic: Crimea. Crimea and the city of Sevastopol have been under de facto Russian control since 2014. \\---- \\---- Widely recognized UN member state. The United Arab Emirates is a federation of seven emirates. \\---- \\---- – United Kingdom of Great Britain and Northern Ireland Widely recognized UN member state and a permanent member of the UN Security Council. EU member. The United Kingdom is composed of four countries: England, Northern Ireland, Scotland, and Wales. It has sovereignty over the following British overseas territories: * * * (suspended under the Antarctic Treaty) * (disputed by Mauritius and the Seychelles) * * * (disputed by Argentina) * (disputed by Spain) * * * * (disputed by Argentina) * Sovereign Base Areas of Akrotiri and Dhekelia * In addition, the British Monarch (not the United Kingdom) has direct sovereignty over three self-governing Crown dependencies: * , with two dependencies: ** ** * * \\---- \\---- – United States of America Widely recognized UN member state and a permanent member of the UN Security Council. The United States is a federation of 50 states, one federal district, and one incorporated territory. It asserted sovereignty over the following inhabited insular areas: * (including Swains Island, disputed by Tokelau) * * * * It also asserted sovereignty over eight uninhabited unincorporated territories: These islands were sometimes designated for statistical purposes as the United States Minor Outlying Islands * Baker Island * Howland Island * Jarvis Island * Johnston Atoll * Kingman Reef * Midway Atoll * Navassa Island (claims by Haiti) * Wake Island (claims by the Marshall Islands) The United States claims Bajo Nuevo Bank and Serranilla Bank. Its claim to Serranilla is disputed by Colombia and Nicaragua and its claim to Bajo Nuevo is disputed by Colombia, Jamaica, and Nicaragua. Some government sources stated that these two areas were unincorporated territories of the United States. \\---- \\---- – Eastern Republic of Uruguay Widely recognized UN member state and a non-permanent member of the UN Security Council during 2016 and 2017. \\---- \\---- – Republic of Uzbekistan Widely recognized UN member state. Uzbekistan had one autonomous republic: Karakalpakstan. \\---- \\---- === V === === V === === V === \\---- \\---- – Republic of Vanuatu Widely recognized UN member state. \\---- \\---- – Vatican City State Widely recognized independent state. Vatican City is administered by the Holy See, a sovereign entity recognized by a large number of countries and a Permanent observer at the United Nations. The Holy See also administered a number of extraterritorial properties in Italy. The Pope is the ex officio head of state of Vatican City. \\---- \\---- – Bolivarian Republic of Venezuela Widely recognized UN member state and a non-permanent member of the UN Security Council during 2015 and 2016. Venezuela is a federation of 23 states, one federal dependency, and one federal district. \\---- \\---- – Socialist Republic of Vietnam Widely recognized UN member state. Vietnam claims sovereignty over the Paracel Islands (disputed by China and Taiwan) and Spratly Islands (disputed by China, Taiwan, Brunei, the Philippines, and Malaysia). \\---- \\---- === Y === === Y === === Y === \\---- \\---- – Republic of Yemen Widely recognized UN member state. \\---- \\---- === Z === === Z === === Z === \\---- \\---- – Republic of Zambia Widely recognized UN member state. \\---- \\---- – Republic of Zimbabwe Widely recognized UN member state. \\---- \\---- ==Non-UN members or observers== Name and capital city Information on status and recognition of sovereignty – Republic of Abkhazia Partially-recognized de facto self-governing entity. Claimed by Georgia as the Government of the Autonomous Republic of Abkhazia. \\---- \\---- / Nagorno-Karabakh * Nagorno- Karabakh Republic (to 21 February 2017) * Republic of Artsakh (from 21 February 2017) De facto self-governing entity. Not recognized by any other state. Claimed by Azerbaijan. \\---- \\---- – State of Azawad (from 6 April 2012 to 12 July 2012) De facto self-governing state. Not recognized by any other state. Claimed by Mali. Debellation by Ansar Dine and MUJAO completed on 12 July 2012. \\---- \\---- – United Federated States of Bangsamoro Republik (from 27 July 2013 to 28 September 2013) Capital: Davao City (Claimed), Zamboanga City (De facto) De facto self- governing state. Not recognized by any other state. Claimed by the Philippines. Bangsamoro Republik dissolves after the Zamboanga City crisis ends in Philippine government victory on 28 September 2013. \\---- \\---- A state in free association with New Zealand, recognized by Japan (from 16 June 2011), Netherlands (from 16 August 2011) and China. The Cook Islands is a member of multiple UN agencies with full treaty making capacity. It shares a head of state with New Zealand as well as having shared citizenship. \\---- \\---- – Republic of Crimea (from 17 March 2014 to 21 March 2014) De facto self-governing state. Partially recognized de facto self-governing entity. Claimed by Ukraine as the Autonomous Republic of Crimea. \\---- \\---- – Republic of Kosovo Partially-recognized de facto self-governing entity. Claimed by Serbia as the Autonomous Province of Kosovo and Metohija under UN administration. \\---- \\---- Nagorno-Karabakh Artsakh Nagorno-Karabakh Artsakh \\---- \\---- A state in free association with New Zealand, recognized by China. Niue is a member of multiple UN agencies with full treaty making capacity. It had shared citizenship with New Zealand. \\---- \\---- – Turkish Republic of Northern Cyprus Partially-recognized de facto self-governing entity. Claimed by the Republic of Cyprus. \\---- \\---- Novorossiya – Federal State of Novorossiya Confederation of unrecognized states: Donetsk People's Republic and Luhansk People's Republic. Claimed by Ukraine. \\---- \\---- Capital: Tifariti (temporary), El Aaiún (claimed) Partially-recognized de facto self-governing entity. The Sahrawi Arab Democratic Republic claims the disputed territory of Western Sahara, most of which is under control of Morocco. The territories under its control, the so-called Free Zone, were claims by Morocco. Its government resided in exile in Tindouf, Algeria. \\---- \\---- – Republic of Somaliland De facto self-governing entity. Not recognized by any other state. Claimed by Somalia. \\---- \\---- – Republic of South Ossetia Partially-recognized de facto independent state. Claimed by Georgia as the Provisional Administrative Entity of South Ossetia. \\---- \\---- – Republic of China Capital: Taipei (seat of government) Partially-recognized de facto independent state. The \"Republic of China\" claims to be the sole legitimate government of China, but only administered Taiwan, Kinmen, the Matsu Islands, Pratas Island and Itu Aba. Claimed by China. \\---- \\---- – Pridnestrovian Moldavian Republic Partially-recognized de facto self-governing entity. Claimed by Moldova. ==Other entities== Excluded from the list above are the following noteworthy entities which either were not fully sovereign or did not claim to be independent: * as a whole had no government and no permanent population. Seven states claims portions of Antarctica and five of these had reciprocally recognized one another's claims. These claims, which were regulated by the Antarctic Treaty System, were neither recognized nor disputed by any other signatory state.CIA – the World Factbook – Antarctica – accessed 19 January 2008 * The European Union is a sui generis supranational organization which had 27 (then 28) member states. The member states had transferred a measure of their legislative, executive, and judicial powers to the institutions of the EU, and as such the EU had some elements of sovereignty, without generally being considered a sovereign state. The European Union did not claim to be a sovereign state and had only limited capacity for relations with other states. * The Sovereign Military Order of Malta is a United Nations observer. The order had bi-lateral diplomatic relations with a large number of states, but has no territory other than extraterritorial areas within Rome and Malta.Bilateral relations with countries , Retrieved 22 December 2009 The order's Constitution stated: \"The Order is a subject of international law and exercises sovereign functions.\" Although the order frequently asserted its sovereignty, it did not claim to be a sovereign state. It lacked a defined territory. Since all its members were citizens of other states, almost all of them lived in their native countries, and those who resided in the order's extraterritorial properties in Rome did so only in connection with their official duties, the order lacked the characteristic of having a permanent population. ==Notes== ==References== Category:2010s Category:Lists of countries in the 21st century",
 "title": "List of countries in the 2010s"
}