{
 "id": "881468",
 "text": "==Sovereign states== Name and capital city Information on status and recognition of sovereignty \\---- \\---- === A === === A === === A === \\---- \\---- Abuja - Abuja Emirate Widely recognized independent state. \\---- \\---- → Acre - Independent State of Acre De facto independent state to March 15, 1900, from November 1900 to December 24, 1900, and from January 27, 1903, to November 11, 1903. Claimed by Bolivia. \\---- \\---- Agadez - Tenere Sultanate of Aïr Widely recognized independent state to 1900. \\---- \\---- Andorra - Principality of Andorra Widely recognized independent state. \\---- \\---- Angoche - Angoche Sultanate Widely recognized independent state. \\---- \\---- - Argentine Republic Widely recognized independent state. \\---- \\---- Aro - Aro Confederacy Widely recognized independent state. \\---- \\---- Ashanti - Ashanti Empire Widely recognized independent state. \\---- \\---- → → Australia - Commonwealth of Australia Widely recognized independent state from January 1, 1901. Australia is autonomous but still dependent from the United Kingdom. Australia has 1 External Territory: * – Territory of Papua \\---- \\---- - Austro-Hungarian Monarchy Capital: Vienna (Cisleithania), Budapest (Transleithania) Widely recognized independent state. Austria-Hungary has 1 concession: * Tientsin \\---- \\---- ===B=== ===B=== ===B=== \\---- \\---- Bali - Kingdom of Bali Widely recognized independent state. \\---- \\---- \\- Emirate of Beihan Widely recognized independent state. \\---- \\---- - Kingdom of Belgium Widely recognized independent state. Belgium has 1 colony and 1 concession: * * Tientsin \\---- \\---- Bhutan * Bhutan * Kingdom of Bhutan Widely recognized independent state. \\---- \\---- Biu - Biu Kingdom Widely recognized independent state. \\---- \\---- - Republic of Bolivia Capital: Sucre (official), La Paz (administrative) Widely recognized independent state. \\---- \\---- Brakna - Brakna Emirate Widely recognized independent state. \\---- \\---- Brazil - Republic of the United States of Brazil Widely recognized independent state. Brazil was a federation of 20 states, one territory, and one federal district. \\---- \\---- Bulgaria * Principality of Bulgaria * Kingdom of Bulgaria De facto independent state until October 5, 1908. Widely recognized independent state from October 5, 1908. \\---- \\---- ===C=== ===C=== ===C=== \\---- \\---- - Dominion of Canada Widely recognized independent state. Canada is autonomous but still dependent from the United Kingdom. \\---- \\---- Champasak - Kingdom of Champasak Widely recognized independent state. \\---- \\---- - Republic of Chile Widely recognized independent state. \\---- \\---- - Great Qing Empire Widely recognized independent state. \\---- \\---- Chokwe - Chokwe Kingdom Widely recognized independent state. \\---- \\---- - Republic of Colombia Widely recognized independent state. \\---- \\---- - Congo Free State Widely recognized independent state. State in personal union with the Kingdom of Belgium. \\---- \\---- → - Republic of Costa Rica Widely recognized independent state. \\---- \\---- - Cretan State De facto independent state, . \\---- \\---- - Republic of Cuba Widely recognized independent state. \\---- \\---- ===D=== ===D=== ===D=== \\---- \\---- Darfur -Sultanate of Darfur Widely recognized independent state. \\---- \\---- Daure-Baure - Kingdom of Daure-Baure Widely recognized independent state. \\---- \\---- Daure-Zango - Kingdom of Daure-Zango Widely recognized independent state. \\---- \\---- Dendi - Dendi Kingdom Widely recognized independent state. \\---- \\---- - Kingdom of Denmark Widely recognized independent state. Denmark has 2 colonies and 1 dependency: * Danish West Indies * Greenland * \\---- \\---- - Emirate of Dhala Widely recognized independent state. \\---- \\---- - Dominican Republic \\---- \\---- ===E=== ===E=== ===E=== \\---- \\---- → Ecuador - Republic of Ecuador Widely recognized independent state. \\---- \\---- El Salvador - Republic of El Salvador Widely recognized independent state. \\---- \\---- Ethiopia - Ethiopian Empire Widely recognized independent state. \\---- \\---- ===F=== ===F=== ===F=== \\---- \\---- - French Republic \\---- \\---- ===G=== ===G=== ===G=== \\---- \\---- Geledi - Sultanate of the Geledi Widely recognized independent state. \\---- \\---- - German Realm Widely recognized independent state. The following are colonies, concessions and protectorates of Germany: * Kamerun \\---- \\---- Greece - Kingdom of Greece Widely recognized independent state. \\---- \\---- - Republic of Guatemala Widely recognized independent state. \\---- \\---- Gumel - Gumel Emirate Widely recognized independent state. \\---- \\---- Gumma - Kingdom of Gumma \\---- \\---- ===H=== ===H=== ===H=== \\---- \\---- Ha'il - Emirate of Ha'il Widely recognized independent state. \\---- \\---- Haiti - Republic of Haiti Widely recognized independent state. \\---- \\---- Honduras - Republic of Honduras \\---- \\---- ===I=== ===I=== ===I=== \\---- \\---- Igala - Igala Kingdom Widely recognized independent state. \\---- \\---- Igara - Kingdom of Igara Widely recognized independent state. \\---- \\---- Ilé-Ifẹ̀ - Ilé-Ifẹ̀ Kingdom Widely recognized independent state. \\---- \\---- - Kingdom of Italy \\---- \\---- ===J=== ===J=== ===J=== \\---- \\---- - Empire of Japan Widely recognized independent state. \\---- \\---- ===K=== ===K=== ===K=== \\---- \\---- Kajara - Kajara Kingdom Widely recognized independent state. \\---- \\---- Kano - Kano Emirate Widely recognized independent state. \\---- \\---- Kasanje - Kasanje Kingdom Widely recognized independent state. \\---- \\---- Kebbi - Kebbi Emirate Widely recognized independent state. \\---- \\---- Kel Ahaggar Widely recognized independent state. \\---- \\---- - Greater Korean Empire Widely recognized independent state. \\---- \\---- Kuba - Kuba Kingdom Widely recognized independent state. \\---- \\---- ===L=== ===L=== ===L=== \\---- \\---- Lafia Beri- Beri - Lafia Beri-Beri Kingdom Widely recognized independent state. \\---- \\---- - Republic of Liberia Widely recognized independent state. \\---- \\---- - Principality of Liechtenstein Widely recognized independent state. \\---- \\---- - Grand Duchy of Luxembourg Widely recognized independent state. \\---- \\---- ===M=== ===M=== ===M=== \\---- \\---- Mbunda - Mbunda Kingdom Widely recognized independent state. \\---- \\---- - United Mexican States Widely recognized independent state. \\---- \\---- - Principality of Monaco Widely recognized independent state. \\---- \\---- → Montenegro - Principality of Montenegro Widely recognized independent state. \\---- \\---- – Sultanate of Morocco Widely recognized independent state. \\---- \\---- Mutayr - Emirate of Mutayr Widely recognized independent state. \\---- \\---- ===N=== ===N=== ===N=== \\---- \\---- Nepal - Kingdom of Nepal Widely recognized independent state. \\---- \\---- - Kingdom of the Netherlands Widely recognized independent state. \\---- \\---- - Dominion of Newfoundland Widely recognized independent state. Newfoundland is autonomous but still dependent from the United Kingdom. \\---- \\---- New Zealand - Dominion of New Zealand Widely recognized independent state. New Zealand is autonomous but still dependent from the United Kingdom. \\---- \\---- → Nicaragua - Republic of Nicaragua Widely recognized independent state. \\---- \\---- Niue - Kingdom of Niue-Fekai Widely recognized independent state. \\---- \\---- – Kingdom of Norway Widely recognized independent state. In personal union with Sweden until June 7, 1905. \\---- \\---- Nri - Kingdom of Nri Widely recognized independent state. \\---- \\---- Nshenyi - Nshenyi Kingdom Widely recognized independent state. \\---- \\---- ===O=== ===O=== ===O=== \\---- \\---- Obwera - Obwera Kingdom Widely recognized independent state. \\---- \\---- Onitsha - Onitsha Kingdom Widely recognized independent state. \\---- \\---- Widely recognized independent state. \\---- \\---- - Sublime Ottoman State Widely recognized independent state. \\---- \\---- Ouaddai - Wadai Empire Widely recognized independent state. \\---- \\---- ===P=== ===P=== ===P=== \\---- \\---- → - Republic of Panama Widely recognized independent state from November 3, 1903. \\---- \\---- - Republic of Paraguay Widely recognized independent state. \\---- \\---- → Persia - Sublime State of Persia Widely recognized independent state. \\---- \\---- - Peruvian Republic Widely recognized independent state. \\---- \\---- Philippines - Philippine Republic De facto independent state, to March 23, 1901. \\---- \\---- Portugal - Kingdom of Portugal Widely recognized independent state. The following are colonies, vassals and possessions of Portugal: * Kongo - Kingdom of Kongo * Portuguese Angola \\---- \\---- Potiskum - Potiskum Emirate Widely recognized independent state. \\---- \\---- ===R=== ===R=== ===R=== \\---- \\---- Rabih's Empire \\---- \\---- Riyadh - Emirate of Riyadh Widely recognized independent state. \\---- \\---- - Kingdom of Romania Widely recognized independent state. \\---- \\---- Rujumbura – Rujumbura Kingdom Widely recognized independent state. \\---- \\---- Rukiga – Rukiga Kingdom Widely recognized independent state. \\---- \\---- \\- Russian Empire Widely recognized independent state. \\---- \\---- ===S=== ===S=== ===S=== \\---- \\---- \\- Most Serene Republic of San Marino Widely recognized independent state. \\---- \\---- - Kingdom of Serbia Widely recognized independent state. \\---- \\---- - Kingdom of Siam Widely recognized independent state. \\---- \\---- Sokoto - Caliphal State in the Bilād as-Sūdān Widely recognized independent state. \\---- \\---- Spain - Kingdom of Spain Widely recognized independent state. \\---- \\---- Swaziland - Kingdom of Swaziland Widely recognized independent state. \\---- \\---- → – Kingdom of Sweden Widely recognized independent state. \\---- \\---- - Swiss Confederation ===T=== * Tagant – Emirate of Tagant * Tonga - Kingdom of Tonga * - South African Republic * Trarza – Emirate of Trarza ===U=== * - United Kingdom of Great Britain and Ireland * → - United States of America * Upper Yafa - Sultanate of Upper Yafa * - Oriental Republic of Uruguay ===V=== * → Venezuela - United States of Venezuela ===W=== * Wukari – Wukari Federation ==States claiming sovereignty== Aceh - Kingdom of Aceh Darussalam Protectorate of the Ottoman Empire until 1903. \\---- \\---- Chita - Chita Republic Unrecognized state. \\---- \\---- Cruzob - Chan Santa Cruz De facto independent state. \\---- \\---- Dervish State - Dervish State \\---- \\---- Khiva - Khanate of Khiva Semi-independent state. Under Russian protection. \\---- \\---- Kruševo - Republic of Kruševo De facto independent state. \\---- \\---- Shuntian Kingdom - Heavenly Kingdom of the Great Mingshun Unrecognized state from January 28 to January 31, 1903. \\---- \\---- Tagalog Republic Unrecognized state. \\---- \\---- ==Non-sovereign territories== ===United Kingdom=== * – Cape of Good Hope * Fiji – Colony of Fiji * New South Wales – Colony of New South Wales * New Zealand – Colony of New Zealand * Queensland – Colony of Queensland * South Australia – Colony of South Australia * Tasmania – Colony of Tasmania * Victoria – Colony of Victoria * Western Australia – Colony of Western Australia ==Notes== ==References== Category:1900s Category:Lists of countries in the 20th century",
 "title": "List of countries in the 1900s"
}