{
 "id": "881737",
 "text": "This is a list of countries in the 1950s, giving an overview of states around the world during the period between 1 January 1950 and 31 December 1959. It contains 108 entries, arranged alphabetically, with information on the status and recognition of their sovereignty. It includes 102 widely recognized sovereign states, 5 entities which were de facto sovereign but which were not widely recognized by other states, and 1 state which was initially unrecognized but then gained full recognition later in the decade. ==Sovereign states== Name and capital city Information on status and recognition of sovereignty \\---- \\---- === A === === A === === A === \\---- \\---- Afghanistan – Kingdom of Afghanistan Widely recognized UN member state. \\---- \\---- Albania – People's Republic of Albania Widely recognized independent state. UN member state (from 14 December 1955) \\---- \\---- Andorra – Principality of Andorra Widely recognized independent state. The President of France and Bishop of Urgell were ex officio Co-Princes of Andorra. The defense of Andorra was the responsibility of France and Spain. \\---- \\---- – Arab Federation of Iraq and Jordan (from 14 February 1958 to 14 July 1958)Jordan and Iraq united to form the Arab Federation on 14 February 1958. It was dissolved on July 14 following the overthrow of the Hashemite monarchy in Iraq. Widely recognized independent state. The Arab Federation occupied West Bank but these areas were not generally recognized as being part of the Arab Federation.Only the United Kingdom recognized the West Bank, including East Jerusalem as being part of the Arab Federation. \\---- \\---- – Argentine RepublicThe name \"Argentine Nation\" was also used for the purposes of legislation. Widely recognized UN member state. Argentina was a federation of 23 provinces and 10 federal territories.23 Provinces: Buenos Aires, Catamarca, Chubut (from 15 June 1955), Córdoba, Corrientes, Entre Ríos, Formosa (from 15 June 1955), Jujuy, La Pampa (renamed Eva Perón from 29 January 1952 to 27 April 1956), La Rioja, Mendoza, Misiones (from 1953), Neuquén (from 15 June 1955), Presidente Juan Perón (from 10 August 1951, renamed Chaco on 27 April 1956), Río Negro (from 15 June 1955), Salta, San Juan, San Luis, Santa Cruz (from 1957), Santa Fe, Santiago del Estero, Tucumán. 10 Territories: Buenos Aires, Chaco (to 10 August 1951, renamed Presidente Juan Perón on 1950), Chubut (to 15 June 1955), Formosa (to 15 June 1955), Misiones (to 1953), Neuquén (to 15 June 1955), Río Negro (to 15 June 1955), Santa Cruz (to 1957), Tierra del Fuego. It had a claim over Argentine Antarctica. It also claimed the Falkland Islands and South Georgia and the South Sandwich Islands, both of which were British overseas territories. \\---- \\---- – Commonwealth of Australia Widely recognized UN member state. Commonwealth realm. Australia was a federation of six states and three territories.6 States: New South Wales, Queensland, South Australia, Tasmania, Victoria, Western Australia. 3 Territories: Australian Capital Territory, Jervis Bay Territory, Northern Territory. It had sovereignty over the following external territories: * Australian Antarctic Territory * Christmas Island (from 1 October 1958) * Cocos (Keeling) Islands (from 23 November 1955) * Heard Island and McDonald Islands * Norfolk Island Australia administered two United Nations Trust Territories: * Nauru (with New Zealand and the United Kingdom) * Papua and New Guinea \\---- \\---- – Republic of Austria Widely recognized state under Allied occupation. Independent state (from 27 July 1955). Permanent observer at the UN (from 1952 to 14 December 1955). UN member state (from 14 December 1955). Austria was a federation of nine states.9 States: Burgenland, Carinthia, Lower Austria, Salzburg, Styria, Tyrol, Upper Austria, Vorarlberg, Vienna. \\---- \\---- === B === === B === === B === \\---- \\---- – Kingdom of Belgium Widely recognized UN member state. EEC member (from 25 March 1957). Belgium had sovereignty over one colony: * Belgium administered one United Nations trust territory: * Ruanda-Urundi \\---- \\---- → – Kingdom of Bhutan Capital: Punakha (to 1955), Thimphu (from 1955) Widely recognized independent state. Bhutan was officially guided by India in its foreign affairs. \\---- \\---- – Republic of Bolivia Capital: Sucre (official), La Paz (administrative) Widely recognized UN member state. \\---- \\---- Brazil – United States of Brazil Widely recognized UN member state. Brazil was a federation of 20 states, five territories, and one federal district. \\---- \\---- Bulgaria – People's Republic of Bulgaria Widely recognized independent state. UN member state (from 14 December 1955). \\---- \\---- Burma – Union of Burma Widely recognized UN member state. \\---- \\---- === C === === C === === C === \\---- \\---- – Kingdom of Cambodia (from 9 November 1953)Cambodia gained independence from France on 9 November 1953 Widely recognized independent state. UN member state (from 14 December 1955). \\---- \\---- → – Dominion of Canada Widely recognized UN member state; Commonwealth realm. Canada was a federation of ten provinces and two territories.10 Provinces: Alberta, British Columbia, Manitoba, New Brunswick, Newfoundland, Nova Scotia, Ontario, Prince Edward Island, Quebec, Saskatchewan. 2 Territories: Northwest Territories, Yukon. \\---- \\---- → – Dominion of Ceylon Widely recognized independent state. UN member state (from 14 December 1955). Commonwealth realm. \\---- \\---- – Republic of Chile Widely recognized UN member state. It had a claim over Chilean Antarctic Territory. \\---- \\---- Partially recognized de facto independent state.The People's Republic of China and the Republic of China did not recognize each other, as both states claimed to be the sole legitimate government of China. The following states recognized the PRC instead of the ROC: Afghanistan (from 20 January 1955), Albania, Algeria (from 20 December 1958), Bulgaria, Burma (from 8 June 1950), Cambodia (from 19 July 1958), Ceylon (from 7 February 1957), Czechoslovakia, Denmark (from 11 May 1950), Egypt (from 30 May 1956), Finland (from 28 October 1950), East Germany, Guinea (from 4 October 1959), Hungary, India (from 1 April 1950), Indonesia (from 13 April 1930), Iraq (from 25 August 1958), North Korea, Liechtenstein (from 14 September 1950), Mongolia, Morocco (from 1 November 1958), Nepal (from 1 August 1955), Norway (from 5 October 1954), Pakistan (from 21 May 1951), Poland, Romania, the Soviet Union, Sudan (from 4 February 1959), Sweden (from 9 May 1950), Switzerland (from 14 September 1950), Syria (from 1 August 1956), North Vietnam (from 18 January 1950), North Yemen (from 24 September 1956), Yugoslavia (from 2 January 1955). The United Kingdom recognized the PRC on 6 January 1950, but this recognition was not initially accepted. The People's Republic of China had four autonomous regions: Guangxi (from 5 March 1958), Inner Mongolia, Ningxia (from 25 October 1958), Xinjiang (from 1 October 1955). The People's Republic of China claimed Taiwan, Kinmen, the Matsu Islands, Pratas Island and the Vereker Banks, and Itu Aba, all of which were governed by the Republic of China. It also claimed the Paracel Islands (disputed by the Republic of China and South Vietnam), the Spratly Islands (disputed by the Republic of China, South Vietnam, and the Philippines), and South Tibet (controlled by India's North-East Frontier Agency). \\---- \\---- Capital: Taipei (seat of government), Nanjing (claimed) Widely recognized UN member state. The Republic of China claimed to be the sole legitimate government of China, but only administered Taiwan, Kinmen, the Matsu Islands, Pratas Island, Itu Aba, and portions of Yunnan Province. The Republic of China had territorial claims over Mongolia; the Tuvan Autonomous Soviet Socialist Republic; the Sixty-Four Villages East of the River (administered by the Soviet Union); The majority of Gorno-Badakhshan (administered by the Soviet Union); The eastern tip of the Wakhan Corridor (administered by Afghanistan); part of the disputed Kashmir region; eastern Bhutan; South Tibet (controlled by India's North-East Frontier Agency); and Kachin State (administered by Burma). \\---- \\---- – Republic of Colombia Widely recognized UN member state. Colombia claimed Quita Sueño Bank, Roncador Bank, and Serrana Bank (disputed by the United States); Bajo Nuevo Bank (disputed by Jamaica, Nicaragua and the United States); and Serranilla Bank (disputed by Nicaragua and the United States) \\---- \\---- – Republic of Costa Rica Widely recognized UN member state. \\---- \\---- Cuba * Cuban First Republic * Cuban Second Republic Widely recognized UN member state. The Cuban area of Guantánamo Bay was under the permanent control of the United States. \\---- \\---- Czechoslovakia – Czechoslovak Republic Widely recognized UN member state.Owing to a dispute over lands seized during World War II, Liechtenstein and Czechoslovakia did not recognize each other. \\---- \\---- === D === === D === === D === \\---- \\---- Dadra / Dadra and Nagar Haveli Capital: Dadra (to 2 August 1954), Silvassa (from 2 August 1954) * Free Dadra (from 22 July 1954 to 15 August 1954)Dadra was liberated from Portuguese Rule on 22 July 1954. and Nagar Haveli was liberated 2 August 1954. On 15 August 1954 the territory was renamed \"Free Dadra and Nagar Haveli\", and became effectively independent under a local administration. It was entirely surrounded by and closely allied with India, which sent an official to help administer the state. * Free Dadra and Nagar Haveli (from 15 August 1954) De facto independent state.Dadra and Nagar Haveli was recognized only by India Claimed by Portugal. \\---- \\---- – Kingdom of Denmark Widely recognized UN member state. The Danish Realm also included one autonomous region: * Denmark had one colony: * Greenland (to 5 June 1953) \\---- \\---- Widely recognized UN member state. \\---- \\---- === E === === E === === E === \\---- \\---- Ecuador – Republic of Ecuador Widely recognized UN member state. \\---- \\---- → * Kingdom of Egypt (to 19 June 1953)The Egyptian Republic was declared on 19 June 1953 * Republic of Egypt (from 19 June 1953 to 1 February 1958)Egypt and Syria united to form the United Arab Republic on 1 February 1958. Widely recognized UN member state. Egypt occupied Gaza Strip. Egypt administered one condominium: * Anglo-Egyptian Sudan (to 31 December 1955, with the United Kingdom) \\---- \\---- – Republic of El Salvador Widely recognized UN member state. \\---- \\---- Ethiopia – Ethiopian Empire Widely recognized UN member state. \\---- \\---- === F === === F === === F === \\---- \\---- – Republic of Finland Widely recognized independent state. Permanent observer at the UN (from 1952 to 14 December 1955). UN member state (from 14 December 1955). Finland had a neutral and demilitarised region: * \\---- \\---- → France * Fourth Republic * Fifth Republic Widely recognized UN member state. EEC member (from 25 March 1957). France included 21 overseas departments: French Guiana, Guadeloupe, Martinique, Réunion, and multiple departments in French Algeria (three departments to 1955, four departments from 1955 to 1957, fourteen departments from 1957 to 1958, and seventeen departments from 1958 on.) The French Union contained the following autonomous associated states: * Cambodia (to 9 November 1953) * Laos (to 22 October 1953) * Vietnam (to 21 July 1954) The French Community consisted of the following autonomous republics: * (from 1 December 1958) * (from 28 November 1958) * (from 28 November 1958) * (from 4 December 1958) * (from 28 November 1958) * (from 4 December 1958) * (from 14 October 1958) * Mali Federation (from 4 April 1959) * (from 28 November 1958) * (from 19 December 1958) * Senegal (from 25 November 1958 to 4 April 1959) * Sudanese Republic (from 24 November 1958 to 4 April 1959) * (from 11 December 1958) France administered the foreign affairs of the following protectorates: * Morocco * Tunisia * (to 1 January 1957) France also had sovereignty over the following overseas territories: * Adélie Land (to 6 August 1955) * Comoros * French Equatorial Africa, consisting of four territories: ** Chad (to 28 November 1958) ** Gabon (to 28 November 1958) ** Middle Congo (to 28 November 1958) ** Ubangi-Shari (to 1 December 1958) * French India (to 21 July 1954) * French Oceania (renamed French Polynesia on 22 July 1957), with one dependency: ** Clipperton Island * French Somaliland * French Southern and Antarctic Lands (from 6 August 1955) * French West Africa, consisting of eight territories: ** Dahomey (to 4 December 1958) ** French Guinea (to 1 October 1958) ** French Sudan (to 24 November 1958) ** Ivory Coast (to 4 December 1958) ** Mauritania (to 28 November 1958) ** Niger (to 19 December 1958) ** Senegal (to 25 November 1958) ** Upper Volta (to 11 December 1958) * Madagascar (to 14 October 1958), with three dependencies ** Crozet Islands (to 6 August 1955) ** Kerguelen Islands (to 6 August 1955) ** Saint-Paul and Amsterdam Islands (to 6 August 1955) * New Caledonia, with one dependency ** Wallis and Futuna * Saint Pierre and Miquelon It also co-administered one condominium: * New Hebrides (with the United Kingdom) France administered two United Nations Trust Territories: * French Cameroons (to 31 December 1959) * (renamed Togo on 22 February 1958) France administered one occupied territory: * Fezzan (to 23 December 1951, under UN supervision) \\---- \\---- === G === === G === === G === \\---- \\---- → – German Democratic Republic Capital: East Berlin (disputed) Widely recognized state under Soviet occupation. Independent state (from 26 March 1954). \\---- \\---- Germany, West – Federal Republic of Germany Widely recognized state under Allied occupation. Independent state (from 5 May 1955). Permanent observer at the UN (from 1952). EEC member (from 25 March 1957). West Germany was a federation of thirteen states.13 States: Baden (to 25 April 1952), Baden-Württemberg (from 25 April 1952), Bavaria, Bremen, Hamburg, Hesse, Lower Saxony, North Rhine-Westphalia, Rhineland-Palatinate, Saarland (from 1 January 1957), Schleswig-Holstein, Württemberg-Baden (to 25 April 1952), Württemberg-Hohenzollern (to 25 April 1952). \\---- \\---- Ghana (from 6 March 1957)Ghana gained independence from the United Kingdom on 6 March 1957 Widely recognized independent state. UN member state (from 8 March 1957). Commonwealth realm. \\---- \\---- Greece – Kingdom of Greece Widely recognized UN member state. Greece had sovereignty over Mount Athos, an autonomous monastic state that was jointly governed by the multi- national \"Holy Community\" on the mountain and the Civil Governor appointed by the Greek Ministry of Foreign Affairs, and spiritually came under the direct jurisdiction of the Ecumenical Patriarchate. \\---- \\---- – Republic of Guatemala Widely recognized UN member state. \\---- \\---- – People's Revolutionary Republic of Guinea (from 2 October 1958)Guinea gained independence from France on 2 October 1958 Widely recognized independent state. UN member state (from 12 December 1958). \\---- \\---- === H === === H === === H === \\---- \\---- * Republic of Haiti * Duvalier dynasty Widely recognized UN member state. Haiti claimed the uninhabited United States possession of Navassa Island. \\---- \\---- Holy See Vatican City Holy See Vatican City \\---- \\---- – Republic of Honduras Widely recognized UN member state. \\---- \\---- → → Hungary – People's Republic of Hungary Widely recognized independent state. UN member state (from 14 December 1955). \\---- \\---- === I === === I === === I === \\---- \\---- – Republic of Iceland Widely recognized UN member state. \\---- \\---- * Dominion of India (to 26 January 1950)India became a republic on 26 January 1950 * Republic of India (from 26 January 1950) Widely recognized UN member state. Commonwealth realm (to 26 January 1950). From 26 January 1950 to 1 November 1956, India was a federation of ten Part A states, eight Part B states, nine Part C states, and four Part D Territories.10 Part A States: Andhra State (from 1 November 1953), Assam, Bihar, Bombay, Madhya Pradesh, Madras, Orissa, Punjab, Uttar Pradesh, West Bengal. 8 Part B States: Hyderabad, Madhya Bharat, Mysore, Patiala and East Punjab States Union, Rajasthan, Saurashtra, Travancore-Cochin, Vindhya Pradesh. 9 Part C States: Ajmer-Merwara, Bhopal, Bilaspur (to 1954), Coorg, Delhi, Himachal Pradesh, Kutch, Manipur, and Tripura. 4 Part D Territories: Andaman and Nicobar Islands, Chandernagore (from 2 May 1950 to 2 November 1954), Jammu and Kashmir, Pondicherry (from 28 May 1956). After 1 November 1956, India was a federation of fourteen states and seven union territories.14 States: Andhra Pradesh, Assam, Bihar, Bombay, Jammu and Kashmir, Kerala, Madhya Pradesh, Madras, Mysore, Orissa, Punjab, Rajasthan, Uttar Pradesh, West Bengal. 7 Union Territories: Andaman and Nicobar Islands, National Capital Territory of Delhi, Himachal Pradesh, Laccadive, Minicoy, and Amindivi Islands, Manipur, Puducherry, Tripura. India had partial sovereignty over one protectorate: * Sikkim (from 5 December 1950) Indian sovereignty over South Tibet, administered as part of its North-East Frontier Agency, was disputed by the People's Republic of China. India administered part of the disputed region of Kashmir as the state of Jammu and Kashmir. \\---- \\---- * Republic of the United States of Indonesia (to 17 August 1950)Indonesia adopted a unitary constitution on 17 August 1950 * Republic of Indonesia (from 17 August 1950) Widely recognized independent state. UN member state (from 28 September 1950). Until 17 August 1950, Indonesia was a federation of fourteen states.14 States: Bangka, Belitung, and Riau (to 4 April 1950), Banjar (to 4 April 1950), Central Java (to 9 March 1950), Dayak Besar (to 4 April 1950), East Borneo (to 24 April 1950), East Indonesia, East Java (to 9 March 1950), East Sumatra, Madura (to 9 March 1950), Republic of Indonesia, South Sumatra (to 24 March 1950), Southeast Kalimantan (to 4 April 1950), West Java (to 11 March 1950), West Kalimantan. Indonesia had two special provinces: Aceh (from 26 May 1959) and Yogyakarta (from 3 August 1950). \\---- \\---- Iran – Imperial State of Iran Widely recognized UN member state. \\---- \\---- → Iraq * Kingdom of Iraq (to 14 February 1958) * Iraqi Republic (from 14 July 1958) Widely recognized UN member state. \\---- \\---- Ireland also had the legal description of \"Republic of Ireland\", although this was not its constitutional name. Widely recognized independent state. UN member state (from 14 December 1955). \\---- \\---- – State of Israel Widely recognized UN member state.Israel was not recognized by Afghanistan, Egypt, Indonesia, Iraq, Jordan, Lebanon, Libya, North Korea, Pakistan, Saudi Arabia, Sudan, Syria, or Yemen. \\---- \\---- Italy – Italian Republic Widely recognized independent state. UN member state (from 14 December 1955). Italy had 5 autonomous regions: Aosta Valley, Friuli-Venezia Giulia, Sardinia, Sicily, and Trentino-Alto Adige/Südtirol. EEC member (from 25 March 1957). Italy administered one United Nations Trust Territory: * Somalia (from 1 April 1950) \\---- \\---- === J === === J === === J === \\---- \\---- Widely recognized state under United States occupation until 28 April 1952. Full sovereignty restored on 28 April 1952. Permanent observer at the UN (from 1952 to 18 December 1956). UN member state (from 18 December 1956). Japan had residual sovereignty over the Ryukyu Islands and the Bonin-Volcano Islands, which were occupied and administered by the United States. \\---- \\---- – Hashemite Kingdom of Jordan (to 14 February 1958, from 14 July 1958) Widely recognized independent state. UN member state (from 14 December 1955). Jordan occupied West Bank but these areas were not generally recognized as being part of Jordan.Only the United Kingdom recognized the West Bank as being part of Jordan. \\---- \\---- === K === === K === === K === \\---- \\---- – Democratic People's Republic of Korea Capital: Seoul (de jure, claimed), Pyongyang (de facto) Widely recognized independent state.North Korea was not recognized by Estonia, France, Japan, or South Korea. Claimed to be the sole legitimate government of Korea. \\---- \\---- Korea, South – Republic of Korea Widely recognized independent state.South Korea was not recognized by the Soviet Union, the People's Republic of China, Romania or North Korea. Permanent observer at the UN. Claimed to be the sole legitimate government of Korea. \\---- \\---- === L === === L === === L === \\---- \\---- Laos – Kingdom of Laos (from 22 October 1953)Laos gained full independence from France on 22 October 1953 Widely recognized independent state. UN member state (from 14 December 1955). \\---- \\---- – Lebanese Republic Widely recognized UN member state. \\---- \\---- – Republic of Liberia Widely recognized UN member state. \\---- \\---- Libya – United Kingdom of Libya (from 24 December 1951)Libya gained independence from a UN trusteship on 24 December 1951 Widely recognized independent state. UN member state (from 14 December 1955). Libya was a federation of three provinces.3 Provinces: Cyrenaica, Tripolitania, and Fezzan. \\---- \\---- Liechtenstein Widely recognized independent state. The defense of Liechtenstein was the responsibility of Switzerland. \\---- \\---- – Grand Duchy of Luxembourg Widely recognized UN member state. EEC member (from 25 March 1957). \\---- \\---- === M === === M === === M === \\---- \\---- – Federation of Malaya (from 31 August 1957)Malaya gained independence from the United Kingdom on 31 August 1957 Widely recognized independent state. UN member state (from 17 September 1957). Malaya was a federation of eleven states.11 States: Johor, Kedah, Kelantan, Malacca, Negeri Sembilan, Pahang, Perak, Perlis, Penang, Selangor, Terengganu. \\---- \\---- – United Mexican States Widely recognized UN member state. Mexico was a federation of 29 states, three territories, and one federal district.29 States: Aguascalientes, Baja California (from 16 January 1952), Campeche, Chiapas, Chihuahua, Coahuila, Colima, Durango, Guanajuato, Guerrero, Hidalgo, Jalisco, México, Michoacán, Morelos, Nayarit, Nuevo León, Oaxaca, Puebla, Querétaro, San Luis Potosí, Sinaloa, Sonora, Tabasco, Tamaulipas, Tlaxcala, Veracruz, Yucatán, Zacatecas. 2 Territories: Baja California (to 16 January 1952), Baja California Sur, Quintana Roo. 1 Federal District: Federal District \\---- \\---- – Principality of Monaco Widely recognized independent state. Permanent observer at the UN (from 1956). The defense of Monaco was the responsibility of France. \\---- \\---- Mongolia – Mongolian People's Republic Widely recognized independent state. \\---- \\---- (from 7 April 1956) *Sherifian Empire (from 7 April 1956 to 14 August 1957)Morocco became a kingdom on 14 August 1957 *Kingdom of Morocco (from 14 August 1957) To 1 March 1956, de jure sovereign state under French protectorate Moroccan rule restored over the Spanish zone of Northern Morocco on 7 April 1956. Moroccan rule restored over the Tangier International Zone on 29 October 1956. Moroccan rule restored over Cape Juby on 2 April 1958. Widely recognized independent state. UN member state (from 12 November 1956). Morocco disputed the Spanish sovereignty over Ceuta, Isla de Alborán, Isla Perejil, Islas Chafarinas, Melilla and Peñón de Alhucemas. \\---- \\---- Muscat and Oman – Sultanate of Muscat and Oman Widely recognized independent state under the informal protection of the United Kingdom. Muscat and Oman contained one self-governing territory, The Imamate of Oman (to 11 August 1957). \\---- \\---- === N === === N === === N === \\---- \\---- Nepal – Kingdom of Nepal Widely recognized independent state. UN member state (from 14 December 1955). \\---- \\---- – Kingdom of the Netherlands Capital: Amsterdam (official), The Hague (seat of government) Widely recognized UN member state. The Kingdom of the Netherlands consisted of three autonomous countries: * (from 15 December 1954) * (from 15 December 1954) * (from 15 December 1954) The Kingdom of the Netherlands as a whole was a member of the EEC (from 25 March 1957), but Suriname and the Netherlands Antilles were not. The Kingdom of the Netherlands had sovereignty over the following colonies: * Netherlands Antilles (to 15 December 1954) * Netherlands New Guinea * Suriname (to 15 December 1954) \\---- \\---- – Dominion of New Zealand Widely recognized UN member state. Commonwealth realm. New Zealand had sovereignty over four dependent territories: * Cook Islands * Niue * Ross Dependency * Tokelau Islands The government of Tokelau Islands claimed Swains Island, part of American Samoa (a U.S. dependence). New Zealand administered two United Nations Trust Territories: * Nauru (with Australia and the United Kingdom) * Western Samoa Trust Territory \\---- \\---- – Republic of Nicaragua Widely recognized UN member state. \\---- \\---- – Kingdom of Norway Widely recognized UN member state. Norway had two integral overseas areas: Jan Mayen and Svalbard. The latter area had a special status due to the Spitsbergen Treaty. Norway had sovereignty over the following dependencies: * Bouvet Island * Peter I Island * Queen Maud Land \\---- \\---- === P === === P === === P === \\---- \\---- * Dominion of Pakistan (to 23 March 1956) * Islamic Republic of Pakistan (from 23 March 1956) Widely recognized UN member state. Commonwealth realm (to 23 March 1956). Pakistan was a federation of eight provinces, thirteen princely states, and one territory.8 Provinces: Azad Kashmir (to 14 October 1955), Baluchistan (to 14 October 1955), East Bengal (renamed East Pakistan on 14 October 1955), Northern Areas (to 14 October 1955), North-West Frontier Province (to 14 October 1955), Sind (to 14 October 1955), West Pakistan (from 14 October 1955), West Punjab (to 14 October 1955). 13 Princely States: Amb (to 1950), Bahawalpur (to 14 October 1955), Baluchistan States Union (from 3 October 1952 to 14 October 1955), Chitral (to 14 October 1955), Dir (to 14 October 1955), Hunza (to 14 October 1955), Kalat (to 3 October 1952), Khayrpur (to 14 October 1955), Kharan (to 3 October 1952), Las Bela (to 3 October 1952), Makran (to 3 October 1952), Nagar (to 14 October 1955), Swat (to 14 October 1955). 1 Territory: Federal Capital Territory (to 14 October 1955). It administered part of the disputed region of Kashmir. \\---- \\---- – Republic of Panama Widely recognized UN member state. \\---- \\---- → – Republic of Paraguay Widely recognized UN member state. \\---- \\---- → – Peruvian Republic Widely recognized UN member state. \\---- \\---- – Republic of the Philippines Capital: Quezon City (official), Baguio (summer) Widely recognized UN member state. \\---- \\---- Poland * Republic of Poland (to 22 July 1952)Poland adopted a Communist constitution on 22 July 1952 * Polish People's Republic (from 22 July 1952) Widely recognized UN member state. \\---- \\---- Portugal – Portuguese Republic Widely recognized independent state. UN member state (from 14 December 1955). Portugal had sovereignty over the following colonies (overseas province from 11 June 1951): * Cape Verde Islands * Macau * Portuguese East Africa (renamed Mozambique on 11 June 1951) * Portuguese Guinea * Portuguese India * Portuguese Timor * Portuguese West Africa (renamed Angola on 11 June 1951) * São Tomé and Príncipe It also had sovereignty over one possession: * São João Baptista de Ajudá Portugal claimed the Spanish municipalities of Olivenza and Táliga. \\---- \\---- === R === === R === === R === \\---- \\---- → RomaniaEnglish speakers often used the spellings \"Rumania\" and \"Roumania\" during this period. – Romanian People's Republic Widely recognized independent state. UN member state (from 14 December 1955). \\---- \\---- === S === === S === === S === \\---- \\---- – Republic of San Marino Widely recognized independent state. \\---- \\---- – Kingdom of Saudi Arabia Widely recognized UN member state. \\---- \\---- Sikkim – Kingdom of Sikkim (to 5 December 1950) Widely recognized independent state under the informal protection of India. \\---- \\---- South Africa – Union of South Africa Capital: Pretoria (administrative), Cape Town (legislative), Bloemfontein (judicial) Widely recognized UN member state. Commonwealth realm. South Africa administered one League of Nations mandate: * South-West Africa \\---- \\---- South Maluku – Republic of South Maluku (from 25 April 1950 to 17 October 1952)The Republic of the South Moluccas declared independence from Indonesia on 25 April 1950. It was annexed by Indonesia on 17 October 1952. De facto independent state. Not recognized by any other state. Claimed by Indonesia. \\---- \\---- → – Union of Soviet Socialist Republics Widely recognized UN member state. The Soviet Union was a federation of 16 (later 15) republics, two of which (Byelorussia and Ukraine) were UN members in their own right.15 Republics: Armenia, Azerbaijan, Byelorussia, Estonia, Georgia, Karelia (to 16 July 1956), Kazakhstan, Kirghizia, Latvia, Lithuania, Moldavia, Russian SFSR, Tajikistan, Turkmenistan, Ukraine, Uzbekistan. \\---- \\---- Spain – Spanish State Widely recognized independent state. Permanent observer at the UN (from 1955 to 14 December 1955). UN member state (from 14 December 1955). Spain had sovereignty over the following overseas provinces: * Fernando Pó (from 30 June 1959) * Ifni (from 10 April 1958) * Río Muni (from 30 June 1959) * Spanish Sahara (from 10 April 1958) * Spanish Guinea (to 30 June 1959) * Spanish West Africa (to 10 April 1958) Spain administered the foreign affairs of one protectorate: * Spanish Morocco, de jure the Spanish sphere of influence in Morocco (to 7 April 1956) Its sovereignty over Ceuta, Isla de Alborán, Isla Perejil, Islas Chafarinas, Melilla and Peñón de Alhucemas was disputed by Morocco. Its sovereignty over Olivenza and Táliga was disputed by Portugal. It claimed the British overseas territory of Gibraltar. \\---- \\---- Sudan – Republic of the Sudan (from 1 January 1956)The Sudan gained independence from an Anglo-Egyptian condominium on 1 January 1956. Widely recognized independent state. UN member state (from 12 November 1956). \\---- \\---- – United Suvadive Republic (from 3 January 1959)The United Suvadive Republic declared independence from the United Kingdom on 3 January 1959. De facto independent state. Not recognized by any other state. Claimed by the United Kingdom. \\---- \\---- – Kingdom of Sweden Widely recognized UN member state. \\---- \\---- – Swiss Confederation Widely recognized independent state. Permanent observer at the UN. Switzerland was a federation of 25 cantons.25 Cantons: Aargau, Appenzell Ausserrhoden, Appenzell Innerrhoden, Basel-Stadt, Basel-Landschaft, Bern, Fribourg, Geneva, Glarus, Graubünden, Lucerne, Neuchâtel, Nidwalden, Obwalden, Schaffhausen, Schwyz, Solothurn, St. Gallen, Thurgau, Ticino, Uri, Valais, Vaud, Zug, Zürich \\---- \\---- Syria (to 1 February 1958) * First Syrian Republic * Second Syrian Republic Widely recognized UN member state. \\---- \\---- === T === === T === === T === \\---- \\---- Thailand – Kingdom of Thailand Widely recognized UN member state. \\---- \\---- Tibet s:Seventeen Point Agreement for the Peaceful Liberation of Tibet De facto independent state. Recognized by no other sovereign state. Claimed by the Republic of China and by the People's Republic of China. \\---- \\---- * Kingdom of Tunisia Tunisia gained independence from France on 20 March 1956 Tunisia became a republic on 25 July 1957. * Tunisian Republic Widely recognized independent state. UN member state from 12 November 1956. \\---- \\---- – Free Territory of Trieste Trieste was annexed by Yugoslavia and Italy on 26 October 1954 Widely recognized state under occupation of the United Kingdom, United States, and Yugoslavia. \\---- \\---- – Republic of Turkey Widely recognized UN member state. \\---- \\---- === U === === U === === U === \\---- \\---- (from 1 February 1958) Widely recognized UN member state. United Arab States member (from 1958). The United Arab Republic consisted of two states: Syria and Egypt. The United Arab Republic occupied the Gaza Strip, but this area was not generally recognized as being part of the UAR. \\---- \\---- United Arab States (from 8 March 1958) Widely recognized UN member state. The United Arab States consisted of two states (later three): The United Arab Republic (Egypt and Syria, later, just Egypt), North Yemen, and later Syria. \\---- \\---- – United Kingdom of Great Britain and Northern Ireland Widely recognized UN member state. The United Kingdom was composed of four countries: England, Northern Ireland, Scotland, and Wales. The United Kingdom administered the foreign affairs of the following protected states: * * * Kuwait * → (to 30 August 1957) * → Maldives Islands * Qatar * (from 3 July 1952) * Trucial States, consisting of eight protected states: ** → ** ** ** Fujairah ** Kalba (to 30 July 1952) ** ** ** Umm al-Quwain The United Kingdom co-administered the following condominiums: * Anglo-Egyptian Sudan (to 31 December 1955, with Egypt) * Canton and Enderbury Islands (with the United States) * → (with France) It also had sovereignty over the following crown colonies and protectorates: * Aden, with one dependency: ** Kamaran * → * (to 3 January 1958) * Basutoland * Bechuanaland * * * * British Leeward Islands (to 3 January 1958) * → → British Somaliland * British Western Pacific Territories, consisting of five territories ** → British Solomon Islands ** Fiji (to 3 July 1952) ** ** Pitcairn Islands (to 3 July 1952) ** (to 3 July 1952) * British Windward Islands (to 3 January 1958) * Christmas Island (from 1 January 1958 to 1 October 1958) * * (disputed by Argentina), with one dependency ** Falkland Islands Dependencies * Fiji (from 3 July 1952), with one dependency ** Rotuma * Gambia * * (to 5 March 1957) * → Hong Kong * → Jamaica (to 3 January 1958) * Kenya * * Mauritius * Nigeria * * (to 1 August 1953) * (to 1 August 1953) * Pitcairn Islands (from 3 July 1952) * (from 1 August 1953) * , with two dependencies ** Ascension Island ** Tristan da Cunha * * Seychelles * Sierra Leone * → , with two dependencies ** Christmas Island (to 1 January 1958) ** Cocos (Keeling) Islands (to 23 November 1955) * (to 1 August 1953) * Swaziland * (to 3 January 1958) * Uganda * (from 3 January 1958) * Zanzibar In addition, the British Monarch had direct sovereignty over three self-governing Crown dependencies: * , with two dependencies: ** ** * * The United Kingdom administered four United Nations Trust Territories: * British Togoland (to 13 December 1956) * British Cameroons * Nauru (with Australia and New Zealand) * Tanganyika The United Kingdom administered four occupied territories: * Cyrenaica (to 23 December 1951, under UN supervision) * Eritrea (to 15 September 1952, under UN supervision from 19 February 1951) * Italian Somaliland (to 1 April 1950) * Tripolitania (to 23 December 1951, under UN supervision) \\---- \\---- → – United States of America Widely recognized UN member state. The United States was a federation of 48 (later 50) states, one federal district, and two (later one) incorporated territories.50 States: Alabama, Alaska (from 3 January 1959), Arizona, Arkansas, California, Colorado, Connecticut, Delaware, Florida, Georgia, Hawaii (from 21 August 1959), Idaho, Illinois, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine, Maryland, Massachusetts, Michigan, Minnesota, Mississippi, Missouri, Montana, Nebraska, Nevada, New Hampshire, New Jersey, New Mexico, New York, North Carolina, North Dakota, Ohio, Oklahoma, Oregon, Pennsylvania, Rhode Island, South Carolina, South Dakota, Tennessee, Texas, Utah, Vermont, Virginia, Washington, West Virginia, Wisconsin, Wyoming. 1 Federal District: District of Columbia. 3 Incorporated Territories: Alaska (to 3 January 1959), Hawaii (to 21 August 1959), Palmyra Atoll (from 21 August 1959). It asserted sovereignty over the following inhabited unincorporated territories: * (including Swains Island, disputed by Tokelau) * Guam * * * It also asserted sovereignty over fifteen uninhabited unincorporated territories:These islands were sometimes designated for statistical purposes as the United States Miscellaneous Caribbean Islands and the United States Miscellaneous Pacific Islands. * Bajo Nuevo Bank (claimed by Colombia and Nicaragua) * Baker Island * Birnie Island (claimed by United Kingdom) * Caroline Island (claimed by United Kingdom) * Christmas Island (claimed by United Kingdom) * Corn Islands * Howland Island * Jarvis Island * Johnston Atoll * Kingman Reef * Midway Atoll * Navassa Island (claimed by Haiti) * Quita Sueño Bank (claimed by Colombia) * Roncador Bank (claimed by Colombia) * Serrana Bank (claimed by Colombia) * Serranilla Bank (claimed by Colombia, Jamaica, and Nicaragua) * Swan Islands * Wake Island The United States co-administered the following condominium: * Canton and Enderbury Islands (with the United Kingdom) After 28 April 1952, the United States administered two territories under the residual sovereignty of Japan: * Bonin-Volcano Islands * Ryukyu Islands In addition, the United States administered one United Nations Trust Territory: * \\---- \\---- – Eastern Republic of Uruguay Widely recognized UN member state. \\---- \\---- === V === === V === === V === \\---- \\---- – Vatican City State Widely recognized independent state. Vatican City was administered by the Holy See, a sovereign entity recognized by a large number of countries. The Holy See also administered a number of extraterritorial properties in Italy. The Pope was the ex officio head of state of Vatican City. \\---- \\---- → Venezuela * United States of Venezuela (to 15 April 1953)Venezuela adopted a new constitution on 15 April 1953 * Republic of Venezuela (from 15 April 1953) Widely recognized UN member state. Venezuela was a federation of 20 states, two territories, one federal dependency, and one federal district.20 States: Anzoátegui, Apure, Aragua, Barinas, Bolívar, Carabobo, Cojedes, Falcón, Guárico, Lara, Mérida, Miranda, Monagas, Nueva Esparta, Portuguesa, Sucre, Táchira, Trujillo, Yaracuy, Zulia. 2 Territories: Amazonas, Delta Amacuro. 1 Federal District: Federal District. 1 Federal Dependency: Federal Dependencies. \\---- \\---- → – Democratic Republic of Vietnam De facto independent state. Claimed by France (to 21 July 1954). Widely recognized (from 21 July 1954). \\---- \\---- * State of Vietnam (from 21 July 1954 to 26 October 1955)The Geneva Accords formalized the division of Vietnam into two independent states. The State of Vietnam in the south became known as the Republic of Vietnam on 26 October 1955. * Republic of Vietnam (from 26 October 1955) Widely recognized independent state. Permanent observer at the UN (from 1952). South Vietnam claimed sovereignty over the Paracel Islands (disputed by the People's Republic of China and the Republic of China) and Spratly Islands (disputed by the People's Republic of China, the Republic of China, and the Philippines). \\---- \\---- === Y === === Y === === Y === \\---- \\---- Yemen – Mutawakkilite Kingdom of Yemen (to 8 March 1958) Widely recognized UN member state. United Arab States member (from 1958). \\---- \\---- – Federal People's Republic of Yugoslavia Widely recognized UN member state. Yugoslavia was a federation of six republics.6 Republics: Bosnia and Herzegovina, Croatia, Macedonia, Montenegro, Serbia, Slovenia. \\---- \\---- ==Other entities== Excluded from the list above are the following noteworthy entities which either were not fully sovereign or did not claim to be independent: * Estonia was incorporated into the Soviet Union in 1940, but the legality of the annexation was not widely recognized. The Baltic diplomatic services in the West continued to be recognised as representing the de jure state. * Latvia was incorporated into the Soviet Union in 1940, but the legality of the annexation was not widely recognized. The Baltic diplomatic services in the West continued to be recognised as representing the de jure state. * Lithuania was incorporated into the Soviet Union in 1940, but the legality of the annexation was not widely recognized. The Baltic diplomatic services in the West continued to be recognised as representing the de jure state. * The Saudi–Iraqi neutral zone was a strip of neutral territory between Iraq and Saudi Arabia. * The Saudi–Kuwaiti neutral zone was a strip of neutral territory between Kuwait and Saudi Arabia. * The Sovereign Military Order of Malta was an entity claiming sovereignty. The order had bi-lateral diplomatic relations with a large number of states, but had no territory other than extraterritorial areas within Rome.Bilateral relations with countries , Retrieved 2009-12-22 Although the order frequently asserted its sovereignty, it did not claim to be a sovereign state. It lacked a defined territory. Since all its members were citizens of other states, almost all of them lived in their native countries, and those who resided in the order's extraterritorial properties in Rome did so only in connection with their official duties, the order lacked the characteristic of having a permanent population. * Tangier was an international zone under the joint administration of France, Spain, the United Kingdom, Italy, Portugal and Belgium. It was reintegrated into Morocco on 29 October 1956. * → West Berlin was a political enclave that was closely aligned with – but not actually a part of – West Germany. It consisted of three occupied sectors administered by the United States, the United Kingdom, and France. ==Notes== ==References== Category:1950s Category:Lists of countries in the 20th century",
 "title": "List of countries in the 1950s"
}