{
 "id": "881734",
 "text": "This is a list of countries in the 1940s, giving an overview of states around the world during the period between 1 January 1940 and 31 December 1949. It contains 106 entries, arranged alphabetically, with information on the status and recognition of their sovereignty. It includes 99 widely recognized sovereign states, and six entities which were de facto sovereign but which were not widely recognized by other states. Academic datasets differ in terms of the number of states in the 1940s. At the start of the 1940s, the lowest estimate of the number of states is in the mid-50s whereas the highest is in the low-70s. At the end of the 1940s, the lowest estimate is in the mid-70s while the highest is in the mid-80s. ==Sovereign states== Name and capital city Information on status and recognition of sovereignty \\---- === A === \\---- Afghanistan – Kingdom of Afghanistan Widely recognized independent state. LON member state to 20 April 1946. UN member state from 19 November 1946. \\---- → Albania * Democratic Government of Albania * People's Republic of Albania Widely recognized independent state. \\---- Andorra – Principality of Andorra Widely recognized independent state. The President of France and Bishop of Urgell were ex officio Co-Princes of Andorra. The defense of Andorra was the responsibility of France and Spain. \\---- – Argentine Republic Widely recognized independent state. LON member state to 20 April 1946. UN member state from 27 December 1945. Argentina was a federation of 23 provinces and 10 federal territories. It had a claim over Argentine Antarctica (from 1942). It also claimed the Falkland Islands and South Georgia and the South Sandwich Islands, both of which were British overseas territories. \\---- \\- Commonwealth of Australia Widely recognized independent state. Dominion of the British Empire to 9 October 1942. LON member state to 20 April 1946. UN member state from 1 November 1945. Commonwealth realm. Australia was a federation of six states and three territories. It had sovereignty over the following external territories: * Australian Antarctic Territory * Heard Island and McDonald Islands (from 26 December 1947) * Norfolk Island Australia administered one League of Nations mandate/United Nations trust territory: * New Guinea (to 6 November 1949) Australia administered two United Nations Trust Territories: * Nauru (with New Zealand and the United Kingdom) * Papua and New Guinea (from 6 November 1949) \\---- ===B=== \\---- Belgium - Kingdom of Belgium Widely recognized independent state. LON member state to 20 April 1946. UN member state from 27 December 1945. Belgium had sovereignty over one colony: * Belgium administered one League of Nations mandate / United Nations trust territory: * Ruanda-Urundi \\---- – Kingdom of Bhutan Widely recognized independent state. Bhutan was officially guided by India in its foreign affairs. \\---- Bolivia – Republic of Bolivia Capital: Sucre (official), La Paz (administrative) Widely recognized independent state. LON member state to 20 April 1946. UN member state from 14 November 1945. \\---- Brazil – United States of Brazil Widely recognized independent state. UN member state from 24 October 1945. Brazil was a federation of 20 states, five territories, and one federal district. \\---- → → Bulgaria * Kingdom of Bulgaria * People's Republic of Bulgaria Widely recognized independent state. LON member state to 20 April 1946. \\---- Burma – Union of Burma Widely recognized independent state. UN member state from 19 April 1948. \\---- ===C=== \\---- \\- Dominion of Canada Widely recognized independent state.LON member state to 20 April 1946. UN member state from 9 November 1945. Commonwealth realm. Canada was a federation of ten provinces and two territories. \\---- – Dominion of Ceylon Widely recognized independent state. Commonwealth realm. \\---- – Republic of Chile Widely recognized independent state. UN member state (from 24 October 1945) \\---- * People's Republic of China Partially recognized de facto independent state. The Republic of China claimed to be the sole legitimate government of China (from 1 October 1949), but only administered the mainland. It also claimed the Paracel Islands (disputed by the Republic of China and South Vietnam), the Spratly Islands (disputed by the Republic of China, South Vietnam, and the Philippines), and South Tibet (controlled by India's North-East Frontier Agency). \\---- * Republic of China (mainland) * Republic of China (Taiwan) Widely recognized independent state. LON member state to 20 April 1946. UN member state from 24 October 1945. The Republic of China claimed to be the sole legitimate government of China (from 1 October 1949), but only administered Taiwan, Hainan, Kinmen, the Matsu Islands, Pratas Island, Itu Aba, and portions of Yunnan Province. The Republic of China had territorial claims over Mongolia; the Tuvan Autonomous Soviet Socialist Republic; the Sixty-Four Villages East of the River (administered by the Soviet Union); The majority of Gorno-Badakhshan (administered by the Soviet Union); The eastern tip of the Wakhan Corridor (administered by Afghanistan); part of the disputed Kashmir region; eastern Bhutan; South Tibet (controlled by India's North-East Frontier Agency); and Kachin State (administered by Burma). \\---- – Republic of Colombia Widely recognized independent state. LON member state to 20 April 1946. UN member state from 5 November 1945. Colombia claimed Quita Sueño Bank, Roncador Bank, and Serrana Bank (disputed by the United States); Bajo Nuevo Bank (disputed by Jamaica, Nicaragua and the United States); and Serranilla Bank (disputed by Nicaragua and the United States) \\---- * First Republic of Costa Rica * Second Republic of Costa Rica Widely recognized independent state. UN member state (from 2 November 1945) \\---- – Republic of Cuba Widely recognized independent state; LON member state to 20 April 1946 and UN member state from 2 November 1945. The Cuban area of Guantánamo Bay was under the total control of the United States. \\---- Czechoslovakia – Czechoslovak Republic * Czechoslovak Socialist Republic Widely recognized independent state. UN member state (from 24 October 1945). \\---- ===D=== \\---- – Kingdom of Denmark Widely recognized independent state. LON member state to 20 April 1940. UN member state from 24 October 1945. \\---- Widely recognized independent state. LON member state to 9 April 1946. UN member state from 24 October 1945. \\---- ===E=== \\---- Ecuador * Republic of Ecuador * Republic of Ecuador Widely recognized independent state; LON member state to 9 April 1946 and UN member state from 21 December 1945. \\---- Egypt – Kingdom of Egypt Widely recognized independent state; LON member state to 9 April 1946 and UN member state from 24 October 1945. \\---- – Republic of El Salvador Widely recognized independent state; UN member state from 24 October 1945. \\---- – Republic of Estonia Widely recognized independent state and LON member state to June 17, 1940. \\---- – Ethiopian Empire Widely recognized independent state and LON member state to 24 October 1945; UN member state from 24 October 1945. \\---- ===F=== \\---- – Republic of Finland Widely recognized independent state. LON member state to 9 April 1946. \\---- France * French Republic * French State * Provisional Government of the French Republic * French Republic Widely recognized independent state. LON member state to 18 April 1941 and from 20 August 1944 to 9 April 1946. UN member state from 24 October 1945. France administered the foreign affairs of the following protectorate: * \\---- ===G=== \\---- * German Realm * Greater German Realm Widely recognized independent state to 8 May 1945. \\---- – Kingdom of Greece Widely recognized independent state. LON member state to April 1941, from Oct 13 1944 to 20 April 1946. UN member state from 25 October 1945. \\---- – Republic of Guatemala Widely recognized independent state. UN member state (from 21 November 1945) \\---- ===H=== \\---- – Republic of Haiti Widely recognized independent state. LON member state to April 1942. UN member state from 24 October 1945. \\---- Honduras – Republic of Honduras Widely recognized independent state. UN member state from 17 December 1945. \\---- → → Hungary * Kingdom of Hungary * Hungarian Republic * Hungarian People's Republic Widely recognized independent state. \\---- ===I=== \\---- Iceland * Kingdom of Iceland * Iceland Widely recognized independent state. In personal union with Denmark to 17 June 1944. UN member state from 19 November 1946. \\---- India – Union of India Widely recognized independent state. UN member state. Commonwealth realm. \\---- * Republic of Indonesia * United States of Indonesia Widely recognized independent state. \\---- Iran – Imperial State of Iran Widely recognized independent state. UN member state (from 12 November 1945) \\---- Iraq – Kingdom of Iraq Widely recognized independent state and LON member state to 20 April 1946; UN member state from 21 December 1945. \\---- Widely recognized independent state and LON member state to 20 April 1946. \\---- – State of Israel Widely-recognized UN member state from 11 May 1949. \\---- Italian Social Republic Puppet state of Germany, independent to the Kingdom of Italy. \\---- \\---- → Italy Capital: Rome (to September 1943, from February 1944), Brindisi (from September 1943 to February 1944) * Kingdom of Italy * Italian Republic Widely recognized independent state. ===J=== \\---- * Empire of Japan * Japan Widely recognized independent state. \\---- ===K=== \\---- Korea – People's Republic of Korea \\---- – Democratic People's Republic of Korea Widely recognized independent state. Claimed to be the sole legitimate government of Korea. \\---- → → – Republic of Korea Widely recognized independent state. Permanent observer at the UN. Claimed to be the sole legitimate government of Korea. \\---- ===L=== \\---- – Republic of Latvia Widely recognized independent state. LON member state to 5 August 1940 and in exile to 20 April 1946. Conquered by a Soviet offensive but maintained a government in exile. \\---- – Lebanese Republic Widely recognized independent state. UN member state from October 1945. \\---- – Republic of Liberia Widely recognized independent state.LON member state to 20 April 1946. UN member state from 2 November 1945. \\---- Liechtenstein – Principality of Liechtenstein Widely recognized independent state. \\---- – Republic of Lithuania Widely recognized independent state.LON member state to 5 August 1940 and in exile to 20 April 1946. Conquered by a Soviet offensive but maintained a government in exile. \\---- – Grand Duchy of Luxembourg Widely recognized independent state; LON member state to 10 May 1940, from 11 Sept 1944 to 20 April 1946 and in exile from 10 May 1940 to 11 Sept 1944. Conquered by a German offensive but maintained a government in exile based in London and a UN member state from 24 October 1945. \\---- ===M=== \\---- – United Mexican States Widely recognized independent state. LON member state to 20 April 1946. UN member state from 17 November 1945. \\---- – Principality of Monaco Widely recognized independent state. \\---- → Mongolia – Mongolian People's Republic Widely recognized independent state. \\---- ===N=== \\---- Nepal – Kingdom of Nepal Widely recognized independent state. \\---- – Kingdom of the Netherlands Widely recognized independent state. LON member state to 20 April 1946. UN member state from 10 December 1945. Under occupation by Germany from 10 May 1940 to 5 May 1945. \\---- New Zealand – Dominion of New Zealand Widely recognized independent state. LON member state to 20 April 1946. UN member state from 24 October 1945. Dominion of the British Empire until 25 Nov 1947. \\---- – Republic of Nicaragua Widely recognized independent state. UN member state (from 24 Oct 1945). \\---- – Kingdom of Norway Widely recognized independent state. LON member state to 20 April 1946. UN member state from 24 October 1945. Under occupation by Germany from 9 April 1940 to 8 May 1945. \\---- ===P=== \\---- – Dominion of Pakistan Widely recognized independent state. UN member state (from 30 September 1947). Commonwealth realm. \\---- – Republic of Panama Widely recognized independent state. LON member state to 20 April 1946. UN member state from 13 November 1945. \\---- – Republic of Paraguay Widely recognized independent state. UN member state from 24 Oct 1945. \\---- – Peruvian Republic Widely recognized independent state. UN member state from 31 Oct 1945. \\---- *Commonwealth of the Philippines *Republic of the Phillipnes Widely recognized independent state. Under Japanese Occupation from 3 Jan 1942 – 17 Aug 1945 during which a puppet government was established on 14 Oct 1943. Resistance by Philippine Guerrillas continued until the puppet regieme's fall on 17 Oct 1945. UN member state from 24 October 1945. \\---- de facto independent country, considered to be a puppet state of Japan. \\---- Poland – Republic of Poland * Provisional Government of National Unity * Polish People's Republic Widely recognized independent state. LON member state to 20 April 1946. UN member state from 24 October 1945. \\---- Portugal – Portuguese Republic Widely recognized independent state. LON member state to 20 April 1946. ===R=== \\---- → Romania * Kingdom of Romania * Romanian People's Republic Widely recognized independent state. \\---- ===S=== \\---- – Most Serene Republic of San Marino Widely recognized independent state. \\---- Saudi Arabia – Kingdom of Saudi Arabia Widely recognized independent state; UN member state from 24 October 1945. \\---- Sikkim – Kingdom of Sikkim Widely recognized independent state. \\---- – Union of South Africa Capital: Pretoria (administrative), Cape Town (legislative), Bloemfontein (judicial) Widely recognized independent state. UN member state from 17 November 1945. Commonwealth realm. \\---- – Union of Soviet Socialist Republics Widely recognized independent state. UN member state from 24 October 1945. The Soviet Union was a federation of 11 (later 15) republics. \\---- → Spain – Spanish State Widely recognized independent state. Spain had sovereignty over the following overseas provinces: * Ifni * * * Spanish West Africa * Spanish Morocco \\---- – Kingdom of Sweden Widely recognized independent state. UN member state. \\---- – Swiss Confederation Widely recognized independent state. LON member state. Permanent observer at the UN. \\---- Syria – Syrian Republic Widely recognized independent state. \\---- ===T=== / Siam * Kingdom of Thailand * Kingdom of Siam Widely recognized independent state. LON member state. UN member state. \\---- \\---- Tibet De facto independent state. Claimed by the Republic of China and by the People's Republic of China. \\---- \\---- Transjordan / Jordan * Hashemite Kingdom of Transjordan * Hashemite Kingdom of Jordan Widely-recognized independent state. \\---- – Free Territory of Trieste Widely recognized independent state. \\---- Tripura – Kingdom of Tripura Widely recognized independent state. \\---- – Republic of Turkey Widely recognized independent state. LON member state to October 4, 1945. UN member state from October 4, 1945. \\---- ===U=== \\---- – United Kingdom of Great Britain and Northern Ireland Widely recognized independent state. LON member state to October 4, 1945. UN member state from October 4, 1945. The United Kingdom was composed of four countries: England, Northern Ireland, Scotland, and Wales. The United Kingdom had sovereignty over: * – Aden Colony and Protectorate * Amoy * * Bahrain – State of Bahrain * * Basutoland – Territory of Basutoland * Bechuanaland – Bechuanaland Protectorate * * Bhutan – Kingdom of Bhutan * * * British Leeward Islands – Federal Colony of the Leeward Islands * British Somaliland – British Somaliland Protectorate * British Western Pacific Territories * British Windward Islands – Federal Colony of the Windward Islands * Brunei – State of Brunei * Burma * * Cyprus * Cyrenaica * Eritrea * Falkland Islands * Faroe Islands * Federated Malay States * Gambia – Gambia Colony and Protectorate * * * – Bailiwick of Guernsey * Heard Island and McDonald Islands * * – Indian Empire [UN from October 30, 1945] * * Italian Somaliland * * – Bailiwick of Jersey * – State of Johor Darul Ta'zim * – State of Kedah Darul Aman * – State of Kelantan Darul Naim * – Kenya Colony and Protectorate * – State of Kuwait * Maldive Islands – Sultanate of the Maldive Islands * Malta * * Muscat and Oman – Sultanate of Muscat and Oman * Newfoundland – Dominion of Newfoundland * – Colony and Protectorate of Nigeria * * Northern Rhodesia – Protectorate of Northern Rhodesia * – Nyasaland Protectorate * – State of Perlis Indera Kayangan * Qatar – State of Qatar * Saint Helena * Sarawak – Kingdom of Sarawak * Seychelles * Sierra Leone – Sierra Leone Colony and Protectorate * – Colony of Southern Rhodesia * * Suez Canal Zone * Swaziland – Swaziland Protectorate * Terengganu – State of Terengganu Darul Iman * * Tripolitania * Trucial States * Uganda * Zanzibar – Sultanate of Zanzibar \\---- – United States of America Widely recognized independent state. UN member state from October 4, 1945. The United States had sovereignty over: * Alaska – Alaska Territory * American Samoa – Territory of American Samoa * Baker Island * Bonin Islands * Clipperton Island * Guam – Territory of Guam * Hawaii – Territory of Hawaii * Howland Island * Jarvis Island * Johnston Atoll * Kingman Reef * Southern Korea * Midway Atoll * Navassa Island * Palmyra Atoll * * * Ryukyu Islands – United States Civil Administration of the Ryukyu Islands * * Volcano Islands * Wake Island \\---- – Oriental Republic of Uruguay Widely recognized independent state. LON member state to December 18, 1945. UN member state from December 18, 1945. \\---- ===V=== \\---- – Vatican City State Widely recognized independent state. \\---- Venezuela – United States of Venezuela Widely recognized independent state. \\---- ===Y=== \\---- Yemen – Mutawakkilite Kingdom of Yemen Widely recognized independent state. \\---- → → * Kingdom of Yugoslavia * Democratic Federal Yugoslavia * Federal People's Republic of Yugoslavia Widely recognized independent state. UN member state from October 24, 1945. Under occupation by Nazi Germany from April 6, 1941 to May 25, 1945. A government in exile was regarded as the legitimate government by the Allies. \\---- ==Other entities== Excluded from the list above are the following noteworthy entities which either were not fully sovereign or did not claim to be independent: * was divided into four zones of occupation by France, the United Kingdom, the United States, and the Soviet Union. * China, Provisional Government of – Provisional Government of the Republic of China was organized and recognized by Japan military authority during Second Sino-Japanese War. * China, Reformed Government of – Reformed Government of the Republic of China was organized and recognized by Japan military authority during Second Sino-Japanese War. * East Turkestan, officially the East Turkistan Republic, existed from November 12, 1944 to December 22, 1949, when it was conquered by China. * was incorporated into the Soviet Union in 1940, but the legality of the annexation was not widely recognized. The Baltic diplomatic services in the West continued to be recognised as representing the de jure state. * was incorporated into the Soviet Union in 1940, but the legality of the annexation was not widely recognized. The Baltic diplomatic services in the West continued to be recognised as representing the de jure state. * was incorporated into the Soviet Union in 1940, but the legality of the annexation was not widely recognized. The Baltic diplomatic services in the West continued to be recognised as representing the de jure state. * – Great Empire of Manchuria was organized and recognized by Japan military authority after Mukden Incident. Recognized by Axis powers member states. * – Mongol Military Government was organized and recognized by Japan military authority during Second Sino-Japanese War. Recognized by Axis powers member states. * National Government of the Republic of China – National Government of the Republic of China was organized and recognized by Japanese military, combined Reformed Government and Provisional Government together. Recognized by Axis powers member states. * The Saudi Arabian–Iraqi neutral zone was a strip of neutral territory between Iraq and Saudi Arabia. * The Saudi Arabian–Kuwaiti neutral zone was a strip of neutral territory between Kuwait and Saudi Arabia. * Slovakia – Slovak Republic was organized and recognized by German military after Munich Agreement. Recognized by Axis powers member states. Recognized by Axis powers member states and several neutral states. * The Sovereign Military Order of Malta was an entity claiming sovereignty. The order had bi-lateral diplomatic relations with a large number of states, but had no territory other than extraterritorial areas within Rome.Bilateral relations with countries , Retrieved 2009-12-22 Although the order frequently asserted its sovereignty, it did not claim to be a sovereign state. It lacked a defined territory. Since all its members were citizens of other states, almost all of them lived in their native countries, and those who resided in the order's extraterritorial properties in Rome did so only in connection with their official duties, the order lacked the characteristic of having a permanent population. * Tangier was an international zone under the joint administration of France, Spain, the United Kingdom, Italy, Portugal and Belgium. * West Berlin was a political enclave that was closely aligned with – but not actually a part of – West Germany. It consisted of three occupied sectors administered by the United States, the United Kingdom, and France. ==Notes== ==References== Category:1940s Category:Lists of countries in the 20th century",
 "title": "List of countries in the 1940s"
}