{
 "id": "881739",
 "text": "This is a list of countries in the 1960s, giving an overview of states around the world during the period between 1 January 1960 and 31 December 1969. It contains 165 entries, arranged alphabetically, with information on the status and recognition of their sovereignty. It includes 143 widely-recognized sovereign states, 2 constituent republics of another sovereign state that were UN members on their own right, 7 associated states, and 11 entities which were de facto sovereign (and 1 nominally independent puppet state) but which were not widely-recognized by other states. ==Sovereign states== Name and capital city Information on status and recognition of sovereignty \\---- \\---- === A === === A === === A === \\---- \\---- Afghanistan – Kingdom of Afghanistan Widely-recognized UN member state. \\---- \\---- Albania – People's Republic of Albania Widely-recognized UN member state. \\---- \\---- * Algerian State (from 5 July 1962 to 25 September 1962)Algeria became independent from France on 5 July 1962 and declared itself to be a People's Democratic Republic on 25 September 1962. * People's Democratic Republic of Algeria (from 25 September 1962) Widely-recognized independent state. UN member state (from 8 October 1962). \\---- \\---- Andorra – Principality of Andorra Widely-recognized independent state. The President of France and Bishop of Urgell were ex officio Co-Princes of Andorra. The defense of Andorra was the responsibility of France and Spain. \\---- \\---- → Anguilla – Republic of Anguilla (from 12 July 1967 to 19 March 1969)Anguilla declared independence from the United Kingdom on 12 July 1967. British rule was restored on 19 March 1969. De facto independent state. Not recognized by any other state. Claimed by the United Kingdom as part of the associated state of Saint Christopher-Nevis-Anguilla. \\---- \\---- Antigua (from 27 February 1967) Associated state of the United Kingdom. Antigua had a dependency, Redonda. \\---- \\---- – Argentine RepublicThe name \"Argentine Nation\" was also used for the purposes of legislation. Widely-recognized UN member state. Argentina was a federation of 22 provinces and two federal territories.23 Provinces: Buenos Aires, Catamarca, Chaco, Chubut, Córdoba, Corrientes, Entre Ríos, Formosa, Jujuy, La Pampa, La Rioja, Mendoza, Misiones, Neuquén, Río Negro, Salta, San Juan, San Luis, Santa Cruz, Santa Fe, Santiago del Estero, Tucumán. 2 Territories: Buenos Aires, Tierra del Fuego. It had a claim over Argentine Antarctica, which was suspended under the Antarctic Treaty. It also claimed the Falkland Islands and South Georgia and the South Sandwich Islands, both of which were British overseas territories. \\---- \\---- – Commonwealth of Australia Widely- recognized UN member state; Commonwealth realm. Australia was a federation of six states and three territories.6 States: New South Wales, Queensland, South Australia, Tasmania, Victoria, Western Australia. 3 Territories: Australian Capital Territory, Jervis Bay Territory, Northern Territory. It had sovereignty over the following external territories: * Australian Antarctic Territory (suspended under the Antarctic Treaty.) * Christmas Island * Cocos (Keeling) Islands * Coral Sea Islands (from 30 September 1969) * Heard Island and McDonald Islands * Norfolk Island Australia administered two United Nations Trust Territories: * Nauru (to 30 January 1968, with New Zealand and the United Kingdom) * Papua and New Guinea \\---- \\---- – Republic of Austria Widely-recognized UN member state. Austria was a federation of nine states.9 States: Burgenland, Carinthia, Lower Austria, Salzburg, Styria, Tyrol, Upper Austria, Vorarlberg, Vienna. \\---- \\---- === B === === B === === B === \\---- \\---- (from 30 November 1966)Barbados gained independence from the United Kingdom on 30 November 1966. Widely-recognized independent state. UN member state (from 9 December 1966). Commonwealth realm. \\---- \\---- – Kingdom of Belgium Widely-recognized UN member state. EEC member. Belgium had sovereignty over one colony: * (to 29 June 1960) Belgium administered one United Nations trust territory: * Ruanda-Urundi (to 30 June 1962), consisting of two autonomous states: ** Rwanda (from 18 October 1960) ** Burundi (from 21 December 1961) \\---- \\---- Benin – Republic of Benin (from 19 September 1967 to 20 September 1967)Benin declared independence from Nigeria on 19 September 1967 and was overrun the following day Nominally independent puppet state of Biafra. Claimed by Nigeria. \\---- \\---- → – Kingdom of Bhutan Widely- recognized independent state. Permanent observer at the UN (from 1968). Bhutan was officially guided by India in its foreign affairs. \\---- \\---- – Republic of Biafra (from 30 May 1967) Partially recognized de facto independent state.Recognized by Gabon, Ivory Coast, Tanzania, and Zambia. Claimed by Nigeria. \\---- \\---- Capital: Sucre (official), La Paz (administrative) * Republic of Bolivia * Republic of Bolivia Widely-recognized UN member state. \\---- \\---- – Republic of Botswana (from 30 September 1966)Botswana gained independence from the United Kingdom on 30 September 1966. Widely-recognized independent state. UN member state (from 17 October 1966). \\---- \\---- → → Brazil Capital: Rio de Janeiro (to 21 April 1960), Brasília (from 21 April 1960) * United States of Brazil (to 15 March 1967)Brazil was renamed the Federative Republic of Brazil on 15 March 1967 * Federative Republic of Brazil (from 15 March 1967) Widely-recognized UN member state. Brazil was a federation of 22 states, four territories, and one federal district. \\---- \\---- → Bulgaria – People's Republic of Bulgaria Widely-recognized UN member state. \\---- \\---- Burma – Union of Burma Widely-recognized UN member state. \\---- \\---- → → → Burundi (from 1 July 1962) * Kingdom of Burundi (from 1 July 1962 to 28 November 1966)Burundi declared independence from Belgium on 1 July 1962 and became a republic on 28 November 1966. * Republic of Burundi (from 28 November 1966) Widely-recognized independent state. UN member state (from 18 September 1962). \\---- \\---- === C === === C === === C === \\---- \\---- – Kingdom of Cambodia Widely-recognized UN member state. \\---- \\---- → / Cameroon * Republic of Cameroun (from 1 January 1960 to 1 October 1961)Cameroun became independent from France on 1 January 1960. It united with British Cameroons on 1 October 1961. * Federal Republic of Cameroon (from 1 October 1961) Widely-recognized independent state. UN member state (from 20 September 1960). After 1 October 1961, Cameroon was a federation of two regions.2 Regions: East Cameroun, West Cameroun. \\---- \\---- → – Dominion of Canada Widely-recognized UN member state; Commonwealth realm. Canada was a federation of ten provinces and two territories.10 Provinces: Alberta, British Columbia, Manitoba, New Brunswick, Newfoundland, Nova Scotia, Ontario, Prince Edward Island, Quebec, Saskatchewan. 2 Territories: Northwest Territories, Yukon. \\---- \\---- (from 13 August 1960)The Central African Republic declared independence from France on 13 August 1960. Widely-recognized independent state. UN member state (from 20 September 1960). \\---- \\---- – Dominion of Ceylon Widely-recognized UN member state; Commonwealth realm. \\---- \\---- – Republic of Chad (from 11 August 1960)Chad declared independence from France on 11 August 1960 Widely-recognized independent state. UN member state (from 20 September 1960). \\---- \\---- – Republic of Chile Widely-recognized UN member state. It had a claim over Chilean Antarctic Territory, which is suspended under the Antarctic Treaty. \\---- \\---- Partially recognized de facto independent state.The People's Republic of China and the Republic of China did not recognize each other, as both states claimed to be the sole legitimate government of China. The following states recognized the PRC instead of the ROC: Afghanistan, Albania, Algeria, Bulgaria, Burma, Burundi (from 21 December 1963 to 29 January 1965), Cambodia, Central African Republic (from 29 September 1964), Democratic Republic of Congo (from 20 February 1961), Republic of Congo (from 22 February 1964), Cuba (from 28 September 1960), Czechoslovakia, Dahomey (from 12 November 1964 to April 1966), Denmark, Egypt, Finland, France (from 27 January 1964), East Germany, Ghana (from 5 July 1960), Guinea, Hungary, India, Indonesia, Iraq, Kenya (from 14 December 1963), North Korea, Laos (from 25 April 1961), Liechtenstein, Mali (from 25 October 1960), Mauritania (from 19 July 1965), Mongolia, Morocco, Nepal, Norway, Pakistan, Poland, Romania, Somalia (from 14 December 1960), the Soviet Union, Sri Lanka, Sudan, Sweden, Switzerland, Syria, Tanganyika (from 9 December 1961 to 26 April 1964), Tanzania (from 26 April 1964), Tunisia (from 10 January 1964), Uganda (from 18 October 1962), North Vietnam, North Yemen, South Yemen (from 31 January 1968), Yugoslavia, Zambia (from 29 October 1964), Zanzibar (from 11 December 1963 to 26 April 1964). The People's Republic of China had five autonomous regions: Guangxi, Inner Mongolia, Ningxia, Xinjiang and Tibet (from 9 September 1965). The People's Republic of China claimed Taiwan, Kinmen, the Matsu Islands, Pratas Island and the Vereker Banks, and Itu Aba, all of which were governed by the Republic of China. It also claimed the Paracel Islands (disputed by the Republic of China and Vietnam), the Spratly Islands (disputed by the Republic of China, South Vietnam, and the Philippines), and South Tibet (controlled by India's North-East Frontier Agency). The People's Republic of China administered Aksai Chin (from 21 November 1962) and the Trans-Karakoram Tract (from 3 March 1963), which were within the disputed region of Kashmir. \\---- \\---- Capital: Taipei (seat of government), Nanjing (claimed) Widely-recognized UN member state under the name \"China\". The Republic of China claimed to be the sole legitimate government of China, but only administered Taiwan, Kinmen, the Matsu Islands, Pratas Island and Itu Aba. The Republic of China had territorial claims over Mongolia; the Tuvan Autonomous Soviet Socialist Republic; the Sixty-Four Villages East of the River (administered by the Soviet Union); The majority of Gorno-Badakhshan (administered by the Soviet Union); The eastern tip of the Wakhan Corridor (administered by Afghanistan); a small portion of Gilgit-Baltistan (administered by Pakistan and part of the disputed Kashmir region); Aksai Chin (administered by the People's Republic of China and part of the disputed Kashmir region); eastern Bhutan; South Tibet (controlled by India's North-East Frontier Agency); and Kachin State (administered by Burma). \\---- \\---- – Republic of Colombia Widely-recognized UN member state. Colombia claimed Quita Sueño Bank, Roncador Bank, and Serrana Bank (disputed by the United States); Bajo Nuevo Bank (disputed by Jamaica, Nicaragua and the United States); and Serranilla Bank (disputed by Nicaragua and the United States) \\---- \\---- / Congo, Republic of the * Republic of the Congo (from 15 August 1960)Congo-Brazzaville gained independence from France on 15 August 1960 Widely-recognized independent state. UN member state (from 20 September 1960). \\---- \\---- → → Congo (Léopoldville) / Congo, Democratic Republic of the Capital: Léopoldville (renamed Kinshasa in 1966) * Republic of the Congo (from 30 June 1960 to 1 August 1964)The Republic of the Congo gained independence from Belgium on 30 June 1960 and was renamed the Democratic Republic of Congo on 1 August 1964. * Democratic Republic of the Congo (from 1 August 1964) Widely-recognized independent state. UN member state (from 20 September 1960). Congo (Léopoldville) contained one self-declared state which, although it did not claim independence, was de facto self-governing: * South Kasai (from 8 August 1960 to 30 December 1961). \\---- \\---- Congo (Stanleyville) / Congo, Free Republic of the – Free Republic of the Congo (from 13 December 1960 to 5 August 1961) Rival state set up during the Congo Crisis. Recognized by 21 states. Claimed by Congo (Léopoldville). \\---- \\---- Cook Islands (from 4 August 1965) A state in free association with New Zealand. It shares a head of state with New Zealand as well as having shared citizenship. \\---- \\---- – Republic of Costa Rica Widely-recognized UN member state. \\---- \\---- – Republic of Cuba Widely-recognized UN member state. The Cuban area of Guantánamo Bay was under the permanent control of the United States. \\---- \\---- – Republic of Cyprus (from 16 August 1960)Cyprus gained independence from the United Kingdom on 16 August 1960 Widely-recognized independent state.Cyprus was not recognized by Turkey. UN member state (from 20 September 1960). \\---- \\---- Czechoslovakia * Czechoslovak Republic (to 11 July 1960)Czechoslovakia adopted a new constitution on 11 July 1960 * Czechoslovak Socialist Republic (from 11 July 1960) Widely-recognized UN member state.Owing to a dispute over lands seized during World War II, Liechtenstein and Czechoslovakia did not recognize each other. After 1 January 1969, Czechoslovakia was a federation of two republics.2 Republics: Czech Socialist Republic, Slovak Socialist Republic. \\---- \\---- === D === === D === === D === \\---- \\---- Dadra and Nagar Haveli – Free Dadra and Nagar Haveli (to 11 August 1961)Dadra and Nagar Haveli, a former Portuguese enclave, had been effectively independent under a local administration since 1954. It was entirely surrounded by and closely allied with India, which sent an official to help administer the state. It was formally annexed by India on 11 August 1961. De facto independent state.Dadra and Nagar Haveli was recognized only by India Claimed by Portugal. \\---- \\---- – Republic of Dahomey (from 1 August 1960)Dahomey declared independence from France on 1 August 1960 Capital: Porto-Novo (official), Cotonou (seat of government) Widely-recognized independent state. UN member state (from 20 September 1960). \\---- \\---- – Kingdom of Denmark Widely-recognized UN member state. The Danish Realm also included one autonomous area: * \\---- \\---- (from 1 March 1967) Associated state of the United Kingdom. \\---- \\---- * Third Republic * Fourth Republic Widely-recognized UN member state. \\---- \\---- === E === === E === === E === \\---- \\---- Ecuador * Republic of Ecuador * Republic of Ecuador Widely- recognized UN member state. \\---- \\---- Egypt United Arab Republic Egypt United Arab Republic \\---- \\---- – Republic of El Salvador Widely-recognized UN member state. \\---- \\---- Equatorial Guinea – Republic of Equatorial Guinea (from 12 October 1968)Equatorial Guinea gained independence from Spain on 12 October 1968 Widely-recognized independent state. UN member state (from 12 November 1968). \\---- \\---- Ethiopia – Ethiopian Empire Widely-recognized UN member state. \\---- \\---- === F === === F === === F === \\---- \\---- – Republic of Finland Widely-recognized UN member state. Finland had a neutral and demilitarised region: * \\---- \\---- France – French Republic Widely-recognized UN member state. EEC member. France included 21 overseas departments: French Guiana, Guadeloupe, Martinique, Réunion, and seventeen departments in French Algeria (to 3 July 1962). The French Community consisted of the following autonomous republics: * (to 12 August 1960) * (to 10 August 1960) * (to 14 August 1960) * (to 4 August 1960) * (to 16 August 1960) * (to 6 August 1960) * Malagasy Republic (to 25 June 1960) * Mali Federation (to 19 June 1960) * (to 27 November 1960) * (to 2 August 1960) * (to 4 August 1960) France also had sovereignty over the following overseas territories: * Comoros * French Somaliland (renamed French Afars and Issas on 5 July 1967) * French Polynesia, with one dependency: ** Clipperton Island * French Southern and Antarctic Lands (including a claim to Adélie Land which was suspended under the Antarctic Treaty.) * New Caledonia, with one dependency ** Wallis and Futuna (to 29 July 1961) * Saint Pierre and Miquelon * The Scattered Islands in the Indian Ocean (from 26 June 1960), consisting of five uninhabited possessions: ** Bassas da India (disputed by the Malagasy Republic) ** Europa Island (disputed by the Malagasy Republic) ** Glorioso Islands (disputed by the Malagasy Republic) ** Juan de Nova Island (disputed by the Malagasy Republic) ** Tromelin Island (disputed by Mauritius) * Wallis and Futuna (from 29 July 1961) It also co-administered one condominium: * → (with the United Kingdom) France administered one United Nations Trust Territory: * Togo (to 26 April 1960) France also claimed Banc du Geyser (disputed by the Malagasy Republic). \\---- \\---- === G === === G === === G === \\---- \\---- – Gabonese Republic (from 17 August 1960)Gabon declared independence from France on 17 August 1960 Widely-recognized independent state. UN member state (from 20 September 1960). \\---- \\---- The Gambia (from 18 February 1965)Gambia gained independence from the United Kingdom on 18 February 1965 Widely-recognized independent state. UN member state (from 21 September 1965). Commonwealth realm. \\---- \\---- – German Democratic Republic Capital: East Berlin (disputed) Widely-recognized independent state. \\---- \\---- Germany, West – Federal Republic of Germany Widely-recognized independent state; permanent observer at the UN. EEC member. West Germany was a federation of ten states.10 States: Baden-Württemberg, Bavaria, Bremen, Hamburg, Hesse, Lower Saxony, North Rhine-Westphalia, Rhineland-Palatinate, Saarland, Schleswig-Holstein. \\---- \\---- → → * Ghana (to 1 July 1960)Ghana became a republic on 1 July 1960 * Republic of Ghana (from 1 July 1960) Widely-recognized UN member state; Commonwealth realm (to 1 July 1960). \\---- \\---- Greece – Kingdom of Greece Widely-recognized UN member state. Greece had sovereignty over Mount Athos, an autonomous monastic state that was jointly governed by the multi-national \"Holy Community\" on the mountain and the Civil Governor appointed by the Greek Ministry of Foreign Affairs, and spiritually came under the direct jurisdiction of the Ecumenical Patriarchate. \\---- \\---- Grenada (from 3 March 1967) Associated state of the United Kingdom. \\---- \\---- – Republic of Guatemala Widely-recognized UN member state. \\---- \\---- – People's Revolutionary Republic of Guinea Widely-recognized UN member state. \\---- \\---- Guyana (from 26 May 1966)Guyana gained independence from the United Kingdom on 26 May 1966 Widely-recognized independent state. UN member state (from 20 September 1966); Commonwealth realm. \\---- \\---- === H === === H === === H === \\---- \\---- → – Republic of Haiti Widely-recognized UN member state. Haiti claimed the uninhabited United States possession of Navassa Island. \\---- \\---- Holy See Vatican City Holy See Vatican City \\---- \\---- – Republic of Honduras Widely-recognized UN member state. \\---- \\---- Hungary – People's Republic of Hungary Widely-recognized UN member state. \\---- \\---- === I === === I === === I === \\---- \\---- – Republic of Iceland Widely- recognized UN member state. \\---- \\---- – Republic of India Widely-recognized UN member state. India was a federation of seventeen states and eleven union territories.17 States: Andhra Pradesh, Assam, Bihar, Bombay (to 1 May 1960), Gujarat (from 1 May 1960), Haryana (from 1 November 1966), Jammu and Kashmir, Kerala, Madhya Pradesh, Madras (renamed Tamil Nadu in August 1968), Maharashtra (from 1 May 1960), Mysore, Orissa, Punjab, Rajasthan, Uttar Pradesh, West Bengal. 11 Union Territories: Andaman and Nicobar Islands, Chandigarh (from 1 November 1966), Dadra and Nagar Haveli (from 11 August 1961), National Capital Territory of Delhi, Goa, Daman and Diu (from 20 December 1961), Himachal Pradesh, Laccadive, Minicoy, and Amindivi Islands, Manipur, Nagaland (from 1 December 1963), Pondicherry, Tripura. India had sovereignty over one protectorate: * → → Indian sovereignty over South Tibet, administered as part of its North-East Frontier Agency, was disputed by the People's Republic of China. India administered part of the disputed region of Kashmir as the state of Jammu and Kashmir. \\---- \\---- – Republic of Indonesia Widely-recognized UN member state. Indonesia withdrew from the UN from 20 January 1965 to 28 September 1966. Indonesia had three special provinces: Aceh, Jakarta (from 1966), and Yogyakarta. \\---- \\---- → Iran – Imperial State of Iran Widely-recognized UN member state. \\---- \\---- → – Iraqi Republic Widely-recognized UN member state. \\---- \\---- Ireland also had the legal description of \"Republic of Ireland\", although this was not its constitutional name. Widely-recognized UN member state. \\---- \\---- – State of Israel Widely- recognized UN member state.Israel was not recognized by Afghanistan, Algeria, Egypt, Indonesia, Iraq, Jordan, North Korea, Kuwait, Lebanon, Libya, Malaysia, Pakistan, Saudi Arabia, Sudan, Syria, North Yemen, or South Yemen. Israel occupied the Gaza Strip (from 6 June 1967) the Golan Heights (from 10 June 1967), the Sinai Peninsula (from 8 June 1967), and the West Bank, including East Jerusalem (from 6 June 1967). These areas were not recognized as being part of Israel. \\---- \\---- Italy – Italian Republic Widely-recognized UN member state. EEC member. Italy had 5 autonomous regions: Aosta Valley, Friuli-Venezia Giulia, Sardinia, Sicily, and Trentino-Alto Adige/Südtirol. Italy administered one United Nations Trust Territory: * Somalia (to 30 June 1960) \\---- \\---- – Republic of Ivory Coast (from 7 August 1960)The Ivory Coast declared independence from France on 7 August 1960 Widely-recognized independent state. UN member state (from 20 September 1960). \\---- \\---- === J === === J === === J === \\---- \\---- (from 6 August 1962)Jamaica gained independence from the United Kingdom on 6 August 1962 Widely-recognized independent state. UN member state (from 18 September 1962); Commonwealth realm. \\---- \\---- Widely-recognized UN member state. Japan had residual sovereignty over the Ryukyu Islands, which were occupied and administered by the United States. \\---- \\---- – Hashemite Kingdom of Jordan Widely-recognized UN member state. Jordan occupied West Bank, including East Jerusalem, until 6 June 1967, but these areas were not generally recognized as being part of Jordan.Only the United Kingdom recognized the West Bank, including East Jerusalem, as being part of Jordan. Jordan continued to claim the territories after they were occupied by Israel in 1967. \\---- \\---- === K === === K === === K === \\---- \\---- Katanga – State of Katanga (from 11 July 1960 to 15 January 1963)Katanga declared independence on 11 July 1960 and surrendered to Congo (Léopoldville) on 15 January 1963. De facto independent state. Not recognized by any other state. Claimed by Congo (Léopoldville). \\---- \\---- (from 12 December 1963) * Kenya (from 12 December 1963 to 12 December 1964)Kenya gained independence from the United Kingdom on 12 December 1963. It became a republic on 12 December 1964. * Republic of Kenya (from 12 December 1964) Widely-recognized independent state. UN member state (from 16 December 1963). Commonwealth realm (to 12 December 1964). \\---- \\---- – Democratic People's Republic of Korea Capital: Seoul (de jure, claimed), Pyongyang (de facto) Widely-recognized independent state.North Korea was not recognized by Estonia, France, Japan, or South Korea. Claimed to be the sole legitimate government of Korea. \\---- \\---- Korea, South * First Republic * Second Republic * Supreme Council for National Reconstruction * Third Republic Widely-recognized independent state.South Korea was not recognized by the Soviet Union, the People's Republic of China, Romania or North Korea. Permanent observer at the UN. Claimed to be the sole legitimate government of Korea. \\---- \\---- – State of Kuwait (from 19 June 1961)Kuwait became independent from the United Kingdom on 19 June 1961 Widely-recognized independent state. Permanent observer at the UN (from 1962 to 14 May 1963). UN member state (from 14 May 1963). \\---- \\---- === L === === L === === L === \\---- \\---- Laos – Kingdom of Laos Widely- recognized UN member state. \\---- \\---- – Lebanese Republic Widely-recognized UN member state. \\---- \\---- – Kingdom of Lesotho (from 4 October 1966)Lesotho gained independence from the United Kingdom on 4 October 1966 Widely- recognized independent state. UN member state (from 17 October 1966). \\---- \\---- – Republic of Liberia Widely-recognized UN member state. \\---- \\---- → Libya * United Kingdom of Libya (to 25 April 1963)Libya adopted a new constitution on 25 April 1963, abolishing the federal system. * Kingdom of Libya (from 25 April 1963 to 1 September 1969)The Libyan Arab Republic was established on 1 September 1969 * Libyan Arab Republic (from 1 September 1969) Widely-recognized UN member state. Until 7 October 1963, Libya was a federation of three provinces.3 Provinces: Cyrenaica, Tripolitania, and Fezzan. \\---- \\---- Liechtenstein Widely-recognized independent state. The defense of Liechtenstein was the responsibility of Switzerland. \\---- \\---- – Grand Duchy of Luxembourg Widely-recognized UN member state. EEC member. \\---- \\---- === M === === M === === M === \\---- \\---- Malagasy Republic (from 26 June 1960)The Malagasy Republic gained independence from France on 26 June 1960 Widely-recognized independent state. UN member state (from 20 September 1960). The Malagasy Republic claimed the French possessions of Bassas da India, Europa Island, Glorioso Islands and Juan de Nova Island. It also claimed Banc du Geyser (disputed by France) \\---- \\---- (from 6 July 1964) * Malawi (from 6 July 1964 to 6 July 1966)Malawi gained independence from the United Kingdom on 6 July 1964 * Republic of Malawi (from 6 July 1966) Widely- recognized independent state. UN member state (from 1 December 1964). Commonwealth realm (to 6 July 1966). \\---- \\---- – Federation of Malaya (to 16 September 1963)Malaya, Singapore, Sarawak, and North Borneo united to form Malaysia on 16 September 1963. Widely-recognized UN member state. Malaya was a federation of eleven states.11 States: Johor, Kedah, Kelantan, Malacca, Negeri Sembilan, Pahang, Perak, Perlis, Penang, Selangor, Terengganu. \\---- \\---- (from 16 September 1963) Widely-recognized UN member state. Malaysia was a federation of fourteen states.14 States: Johor, Kedah, Kelantan, Malacca, Negeri Sembilan, Pahang, Perak, Perlis, Penang, Sabah, Sarawak, Selangor, Singapore (to 9 August 1965), Terengganu. \\---- \\---- / Maldives (from 26 July 1965) * Sultanate of the Maldive Islands (from 26 July 1965 to 11 November 1968)The Maldives gained independence from the United Kingdom on 26 July 1965 and became a republic on 11 November 1968. * Republic of Maldives (from 11 November 1968) Widely-recognized independent state. UN member state (from 21 September 1965). \\---- \\---- Mali Sudanese Republic Mali Sudanese Republic \\---- \\---- Mali Federation (from 20 June 1960 to 20 August 1960)The Mali Federation gained independence from France on 20 June 1960 and was dissolved when Senegal withdrew on 20 August 1960. Widely-recognized independent state. The Mali Federation was a federation of two states.2 States: Senegal, Soudan. \\---- \\---- Malta – State of Malta (from 21 September 1964)Malta gained independence from the United Kingdom on 21 September 1964 Widely-recognized independent state. UN member state (from 1 December 1964). Commonwealth realm. \\---- \\---- – Islamic Republic of Mauritania (from 28 November 1960)Mauritania gained independence from France on 28 November 1960 Widely-recognized independent state. UN member state (from 27 October 1961). \\---- \\---- Mauritius (from 12 March 1968)Mauritius gained independence from the United Kingdom on 12 March 1968 Widely-recognized independent state. UN member state (from 24 April 1968). Commonwealth realm. Mauritius had three dependencies: Agalega Islands, Cargados Carajos and Rodrigues. It claimed the British Indian Ocean Territory and the French territory of Tromelin Island. \\---- \\---- → – United Mexican States Widely-recognized UN member state. Mexico was a federation of 31 states, two territories, and one federal district.29 States: Aguascalientes, Baja California, Campeche, Chiapas, Chihuahua, Coahuila, Colima, Durango, Guanajuato, Guerrero, Hidalgo, Jalisco, México, Michoacán, Morelos, Nayarit, Nuevo León, Oaxaca, Puebla, Querétaro, San Luis Potosí, Sinaloa, Sonora, Tabasco, Tamaulipas, Tlaxcala, Veracruz, Yucatán, Zacatecas. 2 Territories: Baja California Sur, Quintana Roo. 1 Federal District: Federal District \\---- \\---- – Principality of Monaco Widely-recognized independent state. Permanent observer at the UN. The defense of Monaco was the responsibility of France. \\---- \\---- Mongolia – Mongolian People's Republic Widely-recognized independent state. UN member state (from 27 October 1961). \\---- \\---- – Kingdom of Morocco Widely-recognized UN member state. Morocco disputed the Spanish sovereignty over Ceuta, Isla de Alborán, Isla Perejil, Islas Chafarinas, Melilla, and Peñón de Alhucemas. \\---- \\---- Muscat and Oman – Sultanate of Muscat and Oman Widely-recognized independent state under the informal protection of the United Kingdom. \\---- \\---- === N === === N === === N === \\---- \\---- – Republic of Nauru (from 31 January 1968)The UN Trusteeship over Nauru (administered by Australia, New Zealand, and the United Kingdom) came to an end on 31 January 1968. Capital: Yaren (unofficial) Widely-recognized independent state. The defense of Nauru was the responsibility of Australia. \\---- \\---- → Nepal – Kingdom of Nepal Widely-recognized UN member state. \\---- \\---- – Kingdom of the Netherlands Capital: Amsterdam (official), The Hague (seat of government) Widely- recognized UN member state. The Kingdom of the Netherlands consisted of three autonomous countries: * * * The Kingdom of the Netherlands as a whole was a member of the EEC. The Kingdom of the Netherlands had sovereignty over one external territory: * (to 1 October 1962, renamed West Papua on 1 December 1961) \\---- \\---- – Dominion of New Zealand Widely-recognized UN member state; Commonwealth realm. New Zealand had responsibilities for one free associated state: * Cook Islands (from 4 August 1965) It also had sovereignty over four dependent territories: * Cook Islands (to 4 August 1965) * Niue * Ross Dependency (suspended under the Antarctic Treaty) * Tokelau Islands The government of Tokelau Islands claimed Swains Island, part of American Samoa (a U.S. dependence). New Zealand administered two United Nations Trust Territories: * Nauru (to 30 January 1968, with Australia and the United Kingdom) * (to 31 December 1961) \\---- \\---- – Republic of Nicaragua Widely- recognized UN member state. \\---- \\---- – Republic of Niger (from 3 August 1960)Niger declared independence from France on 3 August 1960 Widely- recognized independent state. UN member state (from 20 September 1960). \\---- \\---- (from 1 October 1960) * Federation of Nigeria (from 1 October 1960 to 1 October 1963)Nigeria gained independence from the United Kingdom on 1 October 1960Nigeria became a republic on * Federal Republic of Nigeria (from 1 October 1963) Widely-recognized independent state. UN member state (from 7 October 1960). Commonwealth realm (to 1 October 1963). Nigeria was a federation of three regions (to 27 May 1967) and twelve states (from 27 May 1967).3 Regions: Eastern (to 27 May 1967), Northern, Western. 12 States: Mid-Western, Benue- Plateau, South-Eastern, East Central, Kaduna, Kano, Kwara, Lagos, North- Eastern State, Rivers, Sokoto, Western. \\---- \\---- – Kingdom of Norway Widely-recognized UN member state. Norway had two integral overseas areas: Jan Mayen and Svalbard. The latter of area had a special status due to the Svalbard Treaty. Norway had sovereignty over the following dependencies: * Bouvet Island * Peter I Island (suspended under the Antarctic Treaty) * Queen Maud Land (suspended under the Antarctic Treaty) \\---- \\---- === P === === P === === P === \\---- \\---- – Islamic Republic of Pakistan Capital: Karachi (to 1 August 1960), Rawalpindi (from 1 August 1960 to 14 August 1967), Islamabad (from 14 August 1967) Widely-recognized UN member state. Pakistan was a federation of two provinces. It administered part of the disputed region of Kashmir.2 Provinces: East Pakistan, West Pakistan. \\---- \\---- – Republic of Panama Widely-recognized UN member state. \\---- \\---- – Republic of Paraguay Widely-recognized UN member state. \\---- \\---- – Peruvian Republic Widely-recognized UN member state. \\---- \\---- – Republic of the Philippines Capital: Quezon City (official), Baguio (summer) Widely-recognized UN member state. The Philippines administered Scarborough Shoal, which was disputed by the People's Republic of China and the Republic of China. It also claimed sovereignty over the Spratly Islands (disputed by the People's Republic of China, the Republic of China, and South Vietnam) and the Malaysian territory of Sabah. \\---- \\---- Poland – Polish People's Republic Widely-recognized UN member state. \\---- \\---- Portugal – Portuguese Republic Widely-recognized UN member state. Portugal had sovereignty over the following overseas provinces: * Angola * Cape Verde Islands * Macau * Mozambique * Portuguese Guinea * Portuguese India (to 19 December 1961) * Portuguese Timor * São Tomé and Príncipe It also had sovereignty over one possession: * São João Baptista de Ajudá (to 1 August 1961) Portugal continued to claim Portuguese India after its annexation by India on 14 January 1961. It also claimed the Spanish municipalities of Olivenza and Táliga. \\---- \\---- === R === === R === === R === \\---- \\---- → (from 11 November 1965)Rhodesia unilaterally declared independence from the United Kingdom on 11 November 1965. De facto independent state. Not recognized by any other state. Claimed by the United Kingdom. \\---- \\---- → RomaniaEnglish speakers often used the spellings \"Rumania\" and \"Roumania\" during this period. * Romanian People's Republic (to 21 August 1965)Romania adopted a new constitution on 21 August 1965. . * Socialist Republic of Romania (from 21 August 1965) Widely-recognized UN member state. \\---- \\---- – Rwandese Republic Rwanda's official French name was \"République rwandaise\". It could be translated into English as \"Rwandese Republic\" s:CIA World Fact Book, 2004/Rwanda, \"Rwandan Republic\" , or \"Republic of Rwanda\". (from 1 July 1962)Rwanda gained independence from Belgium on 1 July 1962 Widely-recognized independent state; UN member state (from 18 September 1962). \\---- \\---- Rwenzururu – Kingdom of Rwenzururu (from 30 June 1963)Rwenzururu declared independence from Uganda in November 1962 De facto independent state. Not recognized by any other state. Claimed by Uganda. \\---- \\---- === S === === S === === S === \\---- \\---- → (from 27 February 1967) Associated state of the United Kingdom. \\---- \\---- Saint Lucia (from 1 March 1967) Associated state of the United Kingdom. \\---- \\---- Saint Vincent (from 27 October 1969) Associated state of the United Kingdom. \\---- \\---- – Republic of San Marino Widely-recognized independent state. \\---- \\---- – Kingdom of Saudi Arabia Widely-recognized UN member state. \\---- \\---- – Republic of Senegal (from 20 August 1960) Widely-recognized independent state. UN member state (from 28 September 1960). \\---- \\---- Sierra Leone (from 27 April 1961)Sierra Leone gained independence from the United Kingdom on 27 April 1961. Widely-recognized independent state. UN member state (from 27 September 1961). Commonwealth realm. \\---- \\---- (from 9 August 1965) * State of Singapore (from 9 August 1965 to 22 December 1965)Singapore gained independence from the United Kingdom on 31 August 1963. Singapore gained independence from Malaysia on 9 August 1965 * Republic of Singapore (from 22 December 1965)Constitution of the Republic of Singapore is adopted Transitional independent state (1963). Widely-recognized (from 9 August 1965). UN member state (from 21 September 1965). \\---- \\---- Somalia (from 1 July 1960) * Somali Republic (from 1 July 1960 to 21 October 1969)Somalia gained independence from Italy on 1 July 1960The Somali Democratic Republic was established on 21 October 1969 * Somali Democratic Republic (from 21 October 1969) Widely-recognized independent state. UN member state (from 20 September 1960). \\---- \\---- Somaliland – State of Somaliland (from 26 June 1960 to 30 June 1960)Somaliland gained independence from the United Kingdom on 2 June 1960. It joined Somalia when it became independent on 1 July 1960. Transitional independent state. \\---- \\---- Capital: Pretoria (administrative), Cape Town (legislative), Bloemfontein (judicial) * Union of South Africa (to 31 May 1961)South Africa became a republic on 31 May 1961 * Republic of South Africa (from 31 May 1961) Widely- recognized UN member state. Commonwealth realm (to 31 May 1961). South Africa had one autonomous bantustan: Transkei (from 30 May 1963). South Africa administered one League of Nations mandate: * South-West Africa \\---- \\---- – Union of Soviet Socialist Republics Widely-recognized UN member state. The Soviet Union was a federation of 15 republics, two of which (Byelorussia and Ukraine) were UN members in their own right.15 Republics: Armenia, Azerbaijan, Byelorussia, Estonia, Georgia, Kazakhstan, Kirghizia, Latvia, Lithuania, Moldavia, Russian SFSR, Tajikistan, Turkmenistan, Ukraine, Uzbekistan. \\---- \\---- Spain – Spanish State Widely-recognized UN member state. Spain had sovereignty over the following overseas provinces: * Fernando Pó (to 15 December 1963) * Ifni (to 4 January 1969) * Río Muni (to 15 December 1963) * Spanish Guinea (from 15 December 1963 to 11 October 1968) * Spanish Sahara Its sovereignty over Ceuta, Isla de Alborán, Isla Perejil, Islas Chafarinas, Melilla and Peñón de Alhucemas was disputed by Morocco. Its sovereignty over Olivenza and Táliga was disputed by Portugal. It claimed the British overseas territory of Gibraltar. \\---- \\---- Sudan * Republic of the Sudan (to 25 May 1969)Sudan became a Democratic Republic on 25 May 1969 * Democratic Republic of the Sudan (from 25 May 1969) Widely-recognized UN member state. \\---- \\---- → Sudanese Republic / Mali (from 20 August 1960) * Sudanese Republic (from 20 August 1960 to 22 September 1960)The Sudanese Republic declared itself the Republic of Mali on 22 September 1960 * Republic of Mali (from 22 September 1960) Widely-recognized independent state. UN member state (from 28 September 1960). \\---- \\---- – United Suvadive Republic (to 23 September 1963)The United Suvadive Republic gave up its self-declared independence on 23 September 1963. De facto independent state. Not recognized by any other state. Claimed by the United Kingdom. \\---- \\---- – Kingdom of Swaziland (from 6 September 1968)Swaziland gained independence from the United Kingdom on 6 September 1968. Capital: Mbabane (administrative), Lobamba (royal and legislative) Widely- recognized independent state. UN member state (from 24 September 1968). \\---- \\---- – Kingdom of Sweden Widely-recognized UN member state. \\---- \\---- – Swiss Confederation Widely-recognized independent state. Permanent observer at the UN. Switzerland was a federation of 25 cantons.25 Cantons: Aargau, Appenzell Ausserrhoden, Appenzell Innerrhoden, Basel-Stadt, Basel-Landschaft, Bern, Fribourg, Geneva, Glarus, Graubünden, Lucerne, Neuchâtel, Nidwalden, Obwalden, Schaffhausen, Schwyz, Solothurn, St. Gallen, Thurgau, Ticino, Uri, Valais, Vaud, Zug, Zürich \\---- \\---- → Syria – Syrian Arab Republic (from 28 September 1961)Syria seceded from the United Arab Republic on 28 September 1961 Widely-recognized independent state. UN member state (13 October 1961). Syria included the Golan Heights, which were occupied by Israel (from 10 June 1967). It disputed the Turkish sovereignty over Hatay Province. \\---- \\---- === T=== === T=== === T=== \\---- \\---- (from 9 December 1961) * Tanganyika (from 9 December 1961 to 9 December 1962)Tanganyika gained independence from the United Kingdom on 9 December 1961. Tanganyika became a republic on 9 December 1962 * Republic of Tanganyika (from 9 December 1962 to 26 April 1964)Tanganyika and Zanzibar united to form the United Republic of Tanganyika and Zanzibar on 26 April 1964. It was renamed the Republic of Tanzania on 29 October 1964. Widely-recognized independent state. UN member state (from 14 December 1961). Commonwealth realm (to 9 December 1962). \\---- \\---- / Tanzania * United Republic of Tanganyika and Zanzibar (from 26 April 1964 to 29 October 1964) * United Republic of Tanzania (from 29 October 1964) Widely- recognized UN member state. Tanzania had one autonomous region: Zanzibar. \\---- \\---- Thailand – Kingdom of Thailand Widely-recognized UN member state. \\---- \\---- – Togolese Republic (from 27 April 1960)Togo gained independence from a French-administered UN Trusteeship on 27 April 1960. Widely-recognized independent state. UN member state (from 20 September 1960). \\---- \\---- Trinidad and Tobago (from 31 August 1962)Trinidad and Tobago gained independence from the United Kingdom on 31 August 1962. Widely-recognized independent state. UN member state (from 18 September 1962). Commonwealth realm. \\---- \\---- – Tunisian Republic Widely-recognized UN member state. \\---- \\---- – Republic of Turkey Widely-recognized UN member state. \\---- \\---- === U === === U === === U === \\---- \\---- (from 9 October 1962) * Uganda (from 9 October 1962 to 8 September 1967)Uganda gained independence from the United Kingdom on 9 October 1962 and became a republic on 8 September 1967. * Republic of Uganda (from 8 September 1967) Widely-recognized independent state. UN member state (from 25 October 1962). Commonwealth realm (to 9 October 1963). \\---- \\---- United Arab Republic Widely-recognized UN member state. United Arab States member (to 1961). The United Arab Republic consisted of two states: Syria (to 28 September 1961) and Egypt. It included the Sinai Peninsula, which was occupied by Israel from 8 June 1967. The United Arab Republic occupied the Gaza Strip until 6 June 1967, but this area was not generally recognized as being part of the UAR. It continued to claim these territories after their occupation by Israel in 1967. \\---- \\---- United Arab States (to 26 December 1961) Widely-recognized UN member state. The United Arab States consisted of two states (later three): The United Arab Republic (Egypt and Syria, later, just Egypt), North Yemen, and later Syria. \\---- \\---- – United Kingdom of Great Britain and Northern Ireland Widely-recognized UN member state. The United Kingdom was composed of four countries: England, Northern Ireland, Scotland, and Wales. The United Kingdom had responsibilities for the following self-governing free associated states: * Antigua (from 27 February 1967), with one dependency ** Redonda * (from 1 March 1967) * Grenada (from 3 March 1967) * → (from 27 February 1967) * Saint Lucia (from 1 March 1967) * Saint Vincent (from 27 October 1969) The United Kingdom administered the foreign affairs of the following protected states: * * * Kuwait (to 19 June 1961) * Maldive Islands (to 26 July 1965) * Qatar * (from 25 April 1967 to 5 September 1968) * * Trucial States, consisting of seven protected states: ** ** ** ** Fujairah ** ** ** The United Kingdom co-administered the following condominiums: * Canton and Enderbury Islands (with the United States) * → (with France) It also had sovereignty over the following crown colonies and protectorates: * → Aden (to 29 November 1967, renamed South Arabia on 18 January 1963), with one dependency: ** Kamaran * Antigua (from 31 May 1962 to 1 November 1967), with one dependency ** Redonda (from 27 February 1967) * → * (from 31 May 1962 to 29 November 1966) * Basutoland (to 3 October 1966) * Bechuanaland (to 29 September 1966) * * British Antarctic Territory (from 3 March 1962, suspended under the Antarctic Treaty) * (to 25 May 1966) * * British Indian Ocean Territory (from 8 November 1965, disputed by Mauritius) * British Somaliland (to 25 June 1960) * (from 1 January 1960) * British Western Pacific Territories, consisting of two territories ** ** British Solomon Islands * (from 31 May 1962) * → Cyprus (to 15 August 1960) * (from 31 May 1962 to 1 March 1967) * (disputed by Argentina), with one dependency ** Falkland Islands Dependencies * Fiji, with one dependency ** Rotuma * Gambia (to 17 February 1965) * * Grenada (from 31 May 1962 to 27 February 1967) * Hong Kong * Jamaica (from 31 May 1962 to 5 August 1962) * Kenya (to 11 December 1963) * Malta (to 20 September 1964) * Mauritius (to 11 March 1968) * Montserrat (from 31 May 1962) * Nigeria (to 30 September 1960) * → North Borneo (to 15 September 1963, renamed Sabah on 31 August 1963) * (from 31 December 1963 to 23 October 1964) * (31 December 1963 to 5 July 1964) * Pitcairn Islands * (to 31 December 1963) * (from 31 May 1962 to 27 February 1967) * , with two dependencies ** Ascension Island ** Tristan da Cunha * (from 31 May 1962 to 27 February 1967) * Saint Vincent (from 31 May 1962 to 27 October 1967) * → Sarawak (to 15 September 1963, renamed Sarawak on 22 July 1963) * Seychelles * Sierra Leone (to 26 April 1961) * Singapore (to 30 August 1963) * (from 31 December 1963 to 11 November 1965) * Sovereign Base Areas of Akrotiri and Dhekelia (from 16 August 1960) * Swaziland (to 25 April 1967) * (from 31 May 1962 to 30 August 1962) * → Turks and Caicos Islands (from 31 May 1962) * → Uganda (to 8 October 1962) * (to 31 May 1962) * Zanzibar (to 9 December 1963) In addition, the British Monarch had direct sovereignty over three self-governing Crown dependencies: * , with two dependencies: ** ** * * The United Kingdom administered three United Nations Trust Territories: * British Cameroons (to 30 September 1961) * Nauru (to 30 January 1968, with Australia and New Zealand) * Tanganyika (to 8 December 1961) \\---- \\---- → – United States of America Widely-recognized UN member state. The United States was a federation of 50 states, one federal district, and one incorporated territory.50 States: Alabama, Alaska, Arizona, Arkansas, California, Colorado, Connecticut, Delaware, Florida, Georgia, Hawaii, Idaho, Illinois, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine, Maryland, Massachusetts, Michigan, Minnesota, Mississippi, Missouri, Montana, Nebraska, Nevada, New Hampshire, New Jersey, New Mexico, New York, North Carolina, North Dakota, Ohio, Oklahoma, Oregon, Pennsylvania, Rhode Island, South Carolina, South Dakota, Tennessee, Texas, Utah, Vermont, Virginia, Washington, West Virginia, Wisconsin, Wyoming. 1 Federal District: District of Columbia. 1 Incorporated Territory: Palmyra Atoll. It asserted sovereignty over the following inhabited unincorporated territories: * (including Swains Island, disputed by Tokelau) * → * * * It also asserted sovereignty over fifteen uninhabited unincorporated territories:These islands were sometimes designated for statistical purposes as the United States Miscellaneous Caribbean Islands and the United States Miscellaneous Pacific Islands. * Bajo Nuevo Bank (claimed by Colombia and Nicaragua) * Baker Island * Birnie Island (claimed by United Kingdom) * Caroline Island (claimed by United Kingdom) * Christmas Island (claimed by United Kingdom) * Corn Islands * Howland Island * Jarvis Island * Johnston Atoll * Kingman Reef * Midway Atoll * Navassa Island (claimed by Haiti) * Quita Sueño Bank (claimed by Colombia) * Roncador Bank (claimed by Colombia) * Serrana Bank (claimed by Colombia) * Serranilla Bank (claimed by Colombia, Jamaica, and Nicaragua) * Swan Islands * Wake Island The United States co- administered the following condominium: * Canton and Enderbury Islands (with the United Kingdom) The United States administered two territories under the residual sovereignty of Japan: * Bonin-Volcano Islands (to 26 June 1968) * Ryukyu Islands In addition, the United States administered one United Nations Trust Territory: * \\---- \\---- – Republic of Upper Volta (from 5 August 1960)Burkina Faso declared independence from France on 5 August 1960 Widely- recognized independent state. UN member state (from 20 September 1960). \\---- \\---- – Eastern Republic of Uruguay Widely-recognized UN member state. \\---- \\---- === V === === V === === V === \\---- \\---- – Vatican City State Widely- recognized independent state. Vatican City was administered by the Holy See, a sovereign entity recognized by a large number of countries. Permanent observer at the UN (from 6 April 1964). The Holy See also administered a number of extraterritorial properties in Italy. The Pope was the ex officio head of state of Vatican City. \\---- \\---- Venezuela – Republic of Venezuela Widely- recognized UN member state. Venezuela was a federation of 20 states, two territories, one federal dependency, and one federal district.20 States: Anzoátegui, Apure, Aragua, Barinas, Bolívar, Carabobo, Cojedes, Falcón, Guárico, Lara, Mérida, Miranda, Monagas, Nueva Esparta, Portuguesa, Sucre, Táchira, Trujillo, Yaracuy, Zulia. 2 Territories: Amazonas, Delta Amacuro. 1 Federal District: Federal District. 1 Federal Dependency: Federal Dependencies. \\---- \\---- – Democratic Republic of Vietnam Widely-recognized independent state. \\---- \\---- – Republic of Vietnam Widely-recognized independent state. Permanent observer at the UN. South Vietnam claimed sovereignty over the Paracel Islands (disputed by the People's Republic of China and the Republic of China) and Spratly Islands (disputed by the People's Republic of China, the Republic of China, and the Philippines). \\---- \\---- === W === === W === === W === \\---- \\---- – Independent State of Western Samoa (from 1 January 1962)Western Samoa gained independence from a New Zealand- administered UN Trusteeship on 1 January 1962. Widely-recognized independent state. \\---- \\---- === Y === === Y === === Y === \\---- \\---- → Yemen / Yemen, North Capital: Ta'izz (to 26 September 1962), Sana'a (from 26 September 1962) * Mutawakkilite Kingdom of Yemen (from 26 December 1961 to 27 September 1962)The Yemen Arab Republic was established on 27 September 1962 * Yemen Arab Republic (from 27 September 1962) Widely-recognized UN member state; United Arab States constituent member (to 1961). \\---- \\---- – People's Republic of South Yemen (from 30 November 1967)South Yemen gained independence from the United Kingdom on 30 November 1967. Widely-recognized independent state. UN member state (from 14 December 1967). \\---- \\---- * Federal People's Republic of Yugoslavia (to 7 April 1963)http://www.worldstatesmen.org/Yugoslavia_1963.doc * Socialist Federal Republic of Yugoslavia (from 7 April 1963) Widely-recognized UN member state. Yugoslavia was a federation of six republics.6 Republics: Bosnia and Herzegovina, Croatia, Macedonia, Montenegro, Serbia, Slovenia. \\---- \\---- === Z === === Z === === Z === \\---- \\---- – Republic of Zambia (from 24 October 1964)Zambia became independent from the United Kingdom on 24 October 1964 Widely-recognized independent state. UN member state (from 1 December 1964). \\---- \\---- → → Zanzibar (from 12 December 1963) * Sultanate of Zanzibar (from 10 December 1963 to 12 January 1964)Zanzibar gained independence from the United Kingdom on 10 December 1963. The Sultan of Zanzibar was overthrown on 12 January 1964. * People's Republic of Zanzibar and Pemba (from 12 January 1964 to 26 April 1964) Widely-recognized independent state. UN member state (from 16 December 1963). \\---- \\---- ==Other entities== Excluded from the list above are the following noteworthy entities which either were not fully sovereign or did not claim to be independent: *Antarctica as a whole had no government and no permanent population. Seven states claimed portions of Antarctica and five of these had reciprocally recognised one another's claims. \"Australia, New Zealand, France, Norway and the United Kingdom reciprocally recognize the validity of each other's claims.\" These claims, which were regulated by the Antarctic Treaty System (from 23 June 1961), were neither recognised nor disputed by any other signatory state.CIA – the World Factbook – Antarctica – accessed 19 January 2008 * was incorporated into the Soviet Union in 1940, but the legality of the annexation was not widely-recognized. The Baltic diplomatic services in the West continued to be recognised as representing the de jure state. * was incorporated into the Soviet Union in 1940, but the legality of the annexation was not widely-recognized. The Baltic diplomatic services in the West continued to be recognised as representing the de jure state. * was incorporated into the Soviet Union in 1940, but the legality of the annexation was not widely-recognized. The Baltic diplomatic services in the West continued to be recognised as representing the de jure state. * The Saudi–Iraqi neutral zone was a strip of neutral territory between Iraq and Saudi Arabia. * The Saudi–Kuwaiti neutral zone was a strip of neutral territory between Kuwait and Saudi Arabia (to 18 December 1969). * The Sovereign Military Order of Malta was an entity claiming sovereignty. The order had bi-lateral diplomatic relations with a large number of states, but had no territory other than extraterritorial areas within Rome.Bilateral relations with countries , Retrieved 2009-12-22 The order's Constitution stated: \"The Order is a subject of international law and exercises sovereign functions.\" Although the order frequently asserted its sovereignty, it did not claim to be a sovereign state. It lacked a defined territory. Since all its members were citizens of other states, almost all of them lived in their native countries, and those who resided in the order's extraterritorial properties in Rome did so only in connection with their official duties, the order lacked the characteristic of having a permanent population. * West Berlin was a political enclave that was closely aligned with – but not actually a part of – West Germany. It consisted of three occupied sectors administered by the United States, the United Kingdom, and France. * West New Guinea (West Irian) was a transitional non-independent territory governed by the United Nations. It was neither sovereign nor under the sovereignty of any other state. It was established on 1 October 1962 over the former Netherlands New Guinea colony and became a province of Indonesia on 1 May 1963. ==Notes== ==References== Category:1960s Category:Lists of countries in the 20th century",
 "title": "List of countries in the 1960s"
}