{
 "id": "881724",
 "text": "This is a list of countries in the 1920s, giving an overview of states around the world during the period between 1 January 1920 and 31 December 1929. It contains entries, arranged alphabetically, with information on the status and recognition of their sovereignty. It includes Widely-recognized sovereign states, and entities which were de facto sovereign but which were not Widely- recognized by other states. ==Sovereign states== Name and capital city Information on status and recognition of sovereignty \\---- \\---- === A === === A === === A === \\---- \\---- Abkhazia – Socialist Soviet Republic of Abkhazia Recognized independent state. It was subordinate to the Georgian SSR from December 16, 1921. \\---- \\---- → → → → Afghanistan * Emirate of Afghanistan * Kingdom of Afghanistan * Emirate of Afghanistan * Kingdom of Afghanistan Reign of Amanullah Khan, Inayatullah Khan, and Mohammed Nadir Shah: Widely- recognized independent state Reign of Habibullāh Kalakāni, Ali Ahmad Khan and Abd-al Karim: Not recognized by any state. \\---- \\---- → → → Albania * Principality of Albania * Albanian Republic * Albanian Kingdom Widely-recognized independent state. LON member state from December 17, 1920. \\---- \\---- Andorra – Principality of Andorra Widely-recognized independent state. \\---- \\---- – Argentine Republic Widely- recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- → Armenia * Republic of Armenia * Armenian Socialist Soviet Republic Widely-recognized independent state. Became part of the Transcaucasian SFSR from March 12, 1922. \\---- \\---- Asir – Idrisid Emirate of Asir Widely-recognized independent state. Vassal state of Kingdom of Hejaz and Nejd from October 21, 1926. \\---- \\---- Asir, Upper – Sheikdom of Upper Asir Widely-recognized independent state. Partitioned between Sultanate of Nejd and Idrisid Emirate of Asir from August 30, 1920. \\---- \\---- – Commonwealth of Australia Widely-recognized independent state after November 15, 1926. LON founding member state from January 10, 1920. Australia had two external territories: * Norfolk Island * Australia administered two League of Nations mandates: * Nauru * New Guinea \\---- \\---- Austria – Republic of Austria Widely-recognized independent state. LON member state from December 15, 1920. \\---- \\---- → → Azerbaijan * Azerbaijan Democratic Republic * Azerbaijan Socialist Soviet Republic Widely-recognized independent state. Became part of the Transcaucasian SFSR from March 12, 1922. * Nakhichevan ASSR Московский договор между Росскией и Турцией, 16 марта 1921 года \\---- \\---- === B === === B === === B === \\---- \\---- – Kingdom of Belgium Widely-recognized independent state. LON founding member state from January 10, 1920. Belgium had sovereignty over one colony and one concession: * * Tientsin Belgium administered one League of Nations mandate: * Ruanda-Urundi \\---- \\---- * Republic of Bolivia * Republic of Bolivia Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- Brazil – Republic of the United States of Brazil Widely-recognized independent state. LON founding member state from January 10, 1920; withdrew in June 14, 1926. Brazil was a federation of 20 states, one territory, and one federal district. \\---- \\---- – Kingdom of Bulgaria Widely-recognized independent state. LON member state from December 16, 1920. \\---- \\---- === C === === C === === C === \\---- \\---- – Dominion of Canada Widely-recognized independent state after November 15, 1926. LON founding member state from January 10, 1920. \\---- \\---- – Republic of Chile * Parliamentary Era * Republic of Chile Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- → – Republic of China Capital: Nanking, Peking, Chungking Widely- recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- – Republic of Colombia Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- – Republic of Costa Rica Widely-recognized independent state. LON member state from December 16, 1920; withdrew in January 22, 1925. \\---- \\---- – Republic of Cuba Widely- recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- → Czechoslovakia * Czecho-Slovak Republic * Czechoslovak Republic Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- === D === === D === === D === \\---- \\---- – Free City of Danzig Widely-recognized independent. Under League of Nations protection. \\---- \\---- – Kingdom of Denmark Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- Widely-recognized independent state. LON member state from September 28, 1924. \\---- \\---- === E === === E === === E === \\---- \\---- Ecuador * Republic of Ecuador * Republic of Ecuador Widely-recognized independent state. \\---- \\---- – Kingdom of Egypt Widely-recognized independent state. \\---- \\---- – Republic of El Salvador Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- – Republic of Estonia Widely-recognized independent state. LON member state from September 22, 1921. \\---- \\---- – Ethiopian Empire Widely-recognized independent state. LON member state from September 28, 1923. \\---- \\---- === F === === F === === F === \\---- \\---- – Republic of Finland Widely-recognized independent state. LON member state from December 16, 1920. \\---- \\---- – Free State of Fiume Widely-recognized independent. Annexed by Italy from February 22, 1924. \\---- \\---- France – French Republic Widely-recognized independent state. LON founding member state from January 10, 1920. France administered the foreign affairs of the following protectorates: * French Morocco France administered the following League of Nations mandates: * Alawite * Greater Lebanon * Syrian Federation * State of Syria * → Souaida * French Cameroons * French Togoland * Saar Basin \\---- \\---- === G === === G === === G === \\---- \\---- → → Georgia * Democratic Republic of Georgia * Georgian Soviet Socialist Republic Widely-recognized independent state. Georgian SSR had one autonomous republic (from July 16, 1921): Adjarian ASSR. Became part of the Transcaucasian SFSR from March 12, 1922. * SSR Abkhazia \\---- \\---- Germany – German Realm Widely-recognized independent state. LON member state from September 8, 1926. \\---- \\---- → Greece * Kingdom of Greece * Hellenic Republic Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- – Republic of Guatemala Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- === H === === H === === H === \\---- \\---- → Ha'il / Jabal Shammar – Emirate of Ha'il Widely-recognized independent state. It was completely conquered by Saudi forces from November 2, 1921 and subsequently incorporated into the Sultanate of Nejd. \\---- \\---- – Republic of Haiti Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- → – Hashemite Kingdom of Hejaz Widely-recognized independent state. Annexed by Sultanate of Nejd, creating the Kingdom of Hejaz and Nejd from January 8, 1926. \\---- \\---- Honduras – Republic of Honduras Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- Hungary – Kingdom of Hungary Widely-recognized independent state. LON member state from September 18, 1922. \\---- \\---- === I === === I === === I === \\---- \\---- Iceland – Kingdom of Iceland Widely- recognized independent state. \\---- \\---- – Irish Free State Widely-recognized independent state after November 15, 1926. LON member state from September 10, 1923. \\---- \\---- – Kingdom of Italy Widely-recognized independent state. LON founding member state from January 10, 1920. Italy had four colonies and one concession: * Italian Cyrenaica * Italian Eritrea * Italian Somaliland * Italian Tripolitania * Tientsin \\---- \\---- === J === === J === === J === \\---- \\---- – Empire of Japan Widely-recognized independent state. LON founding member state from January 10, 1920. Japan administered one League of Nations mandate: * South Seas Mandate \\---- \\---- === L === === L === === L === \\---- \\---- & Latvia * Republic of Latvia * Widely-recognized independent state. LON member state from September 22, 1921. \\---- \\---- – Republic of Liberia Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- → – Principality of Liechtenstein Widely- recognized independent state. \\---- \\---- – Republic of Lithuania Widely- recognized independent state. LON member state from September 22, 1921. \\---- \\---- – Grand Duchy of Luxembourg Widely-recognized independent state. LON member state from December 16, 1920. \\---- \\---- === M === === M === === M === \\---- \\---- – United Mexican States Widely-recognized independent state. \\---- \\---- – Principality of Monaco Widely-recognized independent state. \\---- \\---- Mongolia * Mongolian People's Government * Mongolian People's Republic Widely-recognized independent state. \\---- \\---- Mountain Republic - Mountainous Republic of the Northern Caucasus Widely-recognized independent state. Incorporated into the Russian SFSR as the Mountain ASSR from January 20, 1921. \\---- \\---- === N === === N === === N === \\---- \\---- → Nejd * Emirate of Nejd and Hasa * Sultanate of Nejd Widely-recognized independent state. Nejd annexed Hejaz, creating the Kingdom of Hejaz and Nejd from January 8, 1926. \\---- \\---- Nejd and Hejaz – Kingdom of Nejd and Hejaz Capital: Mecca (Hejaz), Riyadh (Nejd) * Nejd ** Sultanate of Nejd ** Kingdom of Nejd and its Dependencies * Hejaz – Kingdom of Hejaz Widely-recognized independent state. Nejd and Hejaz had one protectorate: * Asir \\---- \\---- Nepal – Kingdom of Nepal Widely-recognized independent state. \\---- \\---- – Kingdom of the Netherlands Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- – Dominion of Newfoundland Widely- recognized independent state after November 15, 1926. \\---- \\---- New Zealand – Dominion of New Zealand Widely-recognized independent state after November 15, 1926. LON founding member state from January 10, 1920. The following are territories of New Zealand: * Cook Islands * Niue Island * Ross Dependency * Union Islands New Zealand administered one League of Nations mandate: * Western Samoa \\---- \\---- – Republic of Nicaragua Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- – Kingdom of Norway Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- === O === \\---- === O === \\---- === O === \\---- \\---- – Sublime Ottoman State Widely-recognized independent state. Ottoman Empire had one protectorate: * North Caucasian Emirate \\---- \\---- === P === === P === === P === \\---- \\---- – Republic of Panama Widely-recognized independent state. \\---- \\---- – Republic of Paraguay Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- → Persia * Persian Empire * Imperial State of Persia Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- – Peruvian Republic Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- → Poland – Republic of Poland Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- * First Portuguese Republic * Ditadura Nacional Widely- recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- === R === === R === === R === \\---- \\---- – Kingdom of Romania Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- – Russian Socialist Federative Soviet Republic Widely- recognized independent state. Became part of the Soviet Union from December 30, 1922. Russia had two protectorates and one concession: * Bukhara * Khiva * Tientsin \\---- \\---- === S === === S === === S === \\---- \\---- – Most Serene Republic of San Marino Widely-recognized independent state. \\---- \\---- Serbs, Croats and Slovenes / Yugoslavia * Kingdom of Serbs, Croats, and Slovenes * Kingdom of Yugoslavia Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- Siam – Kingdom of Siam Widely- recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- → – Union of South Africa Capital: Cape Town, Pretoria, Bloemfontein, and Pietermaritzburg Widely-recognized independent state after November 15, 1926. LON founding member state from January 10, 1920. South Africa administered one League of Nations mandate: * → South West Africa \\---- \\---- → → – Union of Soviet Socialist Republics Widely-recognized independent state. The Soviet Union was a federation of four (later seven) republics. \\---- \\---- Spain – Kingdom of Spain Widely-recognized independent state. LON founding member state from January 10, 1920. Spain had sovereignty over two colonies and one protectorate: * * * Spanish Morocco \\---- \\---- – Kingdom of Sweden Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- – Swiss Confederation Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- === T === === T === === T === \\---- \\---- Tibet De facto independent state. Claimed by the Republic of China. \\---- \\---- – Transcaucasian Socialist Federative Soviet Republic Widely-recognized independent state. The Transcaucasian SFSR was a federation constituted by the Armenian SSR, the Azerbaijan SSR and the Georgian SSR. Became part of the Soviet Union from December 30, 1922. \\---- \\---- * Turkey * Republic of Turkey Widely-recognized independent state. \\---- \\---- === U === === U === === U === \\---- \\---- * United Kingdom of Great Britain and Ireland * United Kingdom of Great Britain and Northern Ireland Widely-recognized independent state. LON founding member state from January 10, 1920. The following were colonies, and territories of the United Kingdom: * Aden - Aden Protectorate * Amoy * * Bahrain – State of Bahrain * Baker Island * * Basutoland – Territory of Basutoland * Bechuanaland – Bechuanaland Protectorate * Bermuda * Bhutan – Kingdom of Bhutan * * * * British Leeward Islands – Federal Colony of the Leeward Islands * – British Somaliland Protectorate * British Western Pacific Territories * British Windward Islands – Federal Colony of the Windward Islands * Brunei – State of Brunei * * Cyprus * Falkland Islands * Federated Malay States * Fiji * Gambia – Gambia Colony and Protectorate * * * Guernsey – Bailiwick of Guernsey * Heard Island and McDonald Islands * Hong Kong * * Isle of Man * Jamaica * Kenya * Jarvis Island * – Bailiwick of Jersey * Jiujiang * Kuwait – Sheikhdom of Kuwait * Maldive Islands – Sultanate of the Maldive Islands * Malta * Mauritius * Muscat and Oman – Sultanate of Muscat and Oman * Nigeria – Colony and Protectorate of Nigeria * * Northern Rhodesia – Protectorate of Northern Rhodesia * – Nyasaland Protectorate * Qatar – State of Qatar * Saint Helena * Sarawak – Kingdom of Sarawak * Seychelles * Sierra Leone – Sierra Leone Colony and Protectorate * – Colony of Southern Rhodesia * * Swaziland – Swaziland Protectorate * Transjordan * * Tristan da Cunha * Trucial States * Uganda * Unfederated Malay States ** – State of Johor Darul Ta'zim ** – State of Kedah Darul Aman ** – State of Kelantan Darul Naim ** – State of Perlis Indera Kayangan ** Terengganu – State of Terengganu Darul Iman * Victoria Land * Weihaiwei * Zanzibar * Zhenjiang United Kingdom administered the following League of Nations mandates: * British Cameroons * British Togoland * → Iraq * Palestine ** → Transjordan * Saar Basin * Tanganyika \\---- \\---- – United States of America Widely-recognized independent state. The following were territories of the United States of America: * Alaska * American Samoa * Corn Islands * Guam * Hawaii * Howland Island * Johnston Atoll * Kingman Reef * Midway Atoll * Navassa Island * * Petrel Islands * Philippine Islands * Puerto Rico * Quita Sueno Bank * Roncador Bank * Serrana Bank * Serranilla Bank * Swan Islands * \\---- \\---- – Eastern Republic of Uruguay Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- === V === === V === === V === \\---- \\---- – Vatican City State Widely recognized independent state. Vatican City is administered by the Holy See. \\---- \\---- – United States of Venezuela Widely-recognized independent state. LON founding member state from January 10, 1920. \\---- \\---- === Y === === Y === === Y === \\---- \\---- Yemen – Mutawakkilite Kingdom of Yemen Widely- recognized independent state. \\---- \\---- ==Other states== * Alash – Alash Autonomy * Ararat – Republic of Ararat (from October 28, 1927) * Armenia, Mountainous * Azadistan * Baranya-Baja – Serb-Hungarian Baranya-Baja Republic * Bottleneck – Free State Bottleneck * Bukharan ** Bukharan People's Soviet Republic ** Bukharan Socialist Soviet Republic * Byelorussia – Byelorussian Socialist Soviet Republic * Carnaro – Italian Regency of Carnaro * Central Lithuania – Republic of Central Lithuania * Don – Don Republic * * Galicia – Galician Socialist Soviet Republic * Gilan – Persian Socialist Soviet Republic * Ireland – Irish Republic * Karelia ** Karelian United Government ** Republic of Eastern Karelia * Khorasan – Autonomous Government of Khorasan * Khorezm ** Khorezm People's Soviet Republic ** Khorezm Socialist Soviet Republic * – Kuban People's Republic * Kurdistan – Kingdom of Kurdistan * – Labin Republic * Lajtabánság – Banate of Leitha * Lemko-Rusyn – Lemko-Rusyn Republic * Mirdita – Republic of Mirdita * Mongolia * North Ingria – Republic of North Ingria * Rhineland – Rhenish Republic * Rif – Confederal Republic of the Tribes of the Rif * Siberia, Autonomous – Provisional Government of Autonomous Siberia * Southern Karelia – Olonets Government of Southern Karelia * Syria – Arab Kingdom of Syria * Tannu Tuva ** People's Republic of Tannu Tuva (to November 24, 1926) ** Tuvan People's Republic (from November 24, 1926) * Uhtua – Republic of Uhtua * Ukraine, Soviet – Ukrainian Socialist Soviet Republic ==Notes== ==References== Category:1920s Category:Lists of countries in the 20th century",
 "title": "List of countries in the 1920s"
}