{
 "id": "881741",
 "text": "This is a list of countries in the 1980s, giving an overview of states around the world during the period between 1 January 1980 and 31 December 1989. It contains 188 entries, arranged alphabetically, with information on the status and recognition of their sovereignty. It includes 171 widely-recognized sovereign states, 2 constituent republics of another sovereign state that were UN members on their own right, 2 associated states, and 13 entities which claim an effective sovereignty but are considered de facto dependencies of other powers by the general international community. ==Sovereign states== Name and capital city Information on status and recognition of sovereignty \\---- \\---- === A === === A === === A === \\---- \\---- → → Afghanistan * Democratic Republic of Afghanistan * Republic of Afghanistan Widely-recognized UN member state. \\---- \\---- Albania – People's Socialist Republic of Albania Widely- recognized UN member state. \\---- \\---- – People's Democratic Republic of Algeria Widely-recognized UN member state. \\---- \\---- – Principality of Andorra Widely-recognized independent state. The President of France and Bishop of Urgell were ex officio Co-Princes of Andorra. The defense of Andorra was the responsibility of France and Spain. \\---- \\---- Angola – People's Republic of Angola Widely-recognized UN member state. \\---- \\---- * Antigua * Antigua and Barbuda Associated state of the United Kingdom (to 31 October 1981); widely-recognized independent state (from 1 November 1981). UN member state (from 11 November 1981); Commonwealth realm. Antigua and Barbuda had two dependencies: Barbuda and Redonda. \\---- \\---- – Argentine Republic Widely- recognized UN member state. Argentina was a federation of 22 provinces and two federal territories. It had a claim over Argentine Antarctica, which was suspended under the Antarctic Treaty. It also claimed the Falkland Islands and South Georgia and the South Sandwich Islands, both of which were British overseas territories. \\---- \\---- – Commonwealth of Australia Widely- recognized UN member state; Commonwealth realm. Australia was a federation of six states and three territories. It had sovereignty over the following external territories: * Ashmore and Cartier Islands * Australian Antarctic Territory (suspended under the Antarctic Treaty.) * Christmas Island * Cocos (Keeling) Islands * Coral Sea Islands * Heard Island and McDonald Islands * \\---- \\---- – Republic of Austria Widely-recognized UN member state. Austria was a federation of nine states. \\---- \\---- === B === === B === === B === \\---- \\---- – Commonwealth of the Bahamas Widely-recognized UN member state; Commonwealth realm. \\---- \\---- Bahrain – State of Bahrain Widely-recognized UN member state. \\---- \\---- – People's Republic of Bangladesh Widely- recognized UN member state. \\---- \\---- Widely-recognized UN member state; Commonwealth realm. \\---- \\---- – Kingdom of Belgium Widely-recognized UN member state. EEC member. After 8 August 1980, Belgium was a federation of three communities and three regions. \\---- \\---- Belize Widely-recognized independent state. UN member state (from 25 September 1981); Commonwealth realm. \\---- \\---- Benin – People's Republic of Benin Widely-recognized UN member state. \\---- \\---- – Kingdom of Bhutan Widely- recognized UN member state. Bhutan was officially guided by India in its foreign affairs, but effectively pursued an independent foreign policy. \\---- \\---- * Republic of Bolivia * Republic of Bolivia Widely-recognized UN member state. \\---- \\---- – Republic of Bophuthatswana Nominally independent South African bantustan. \\---- \\---- – Republic of Botswana Widely-recognized UN member state. \\---- \\---- Brazil – Federative Republic of Brazil Widely-recognized UN member state. Brazil was a federation of 26 states, four territories (none from 1 January 1989), and one federal district. \\---- \\---- – State of Brunei, Abode of Peace Widely-recognized independent state. UN member state (from 21 September 1984). Brunei claimed part of the Spratly Islands (disputed by China, Taiwan, Vietnam, the Philippines, and Malaysia). \\---- \\---- Bulgaria – People's Republic of Bulgaria Widely-recognized UN member state. \\---- \\---- Burkina Faso Upper Volta \\---- \\---- Burma / Myanmar * Socialist Republic of the Union of Burma * Union of Burma * Union of Myanmar Widely-recognized UN member state. \\---- \\---- – Republic of Burundi Widely-recognized UN member state. \\---- \\---- === C === === C === === C === \\---- \\---- Cambodia, State of Kampuchea, People's Republic of \\---- \\---- * United Republic of Cameroon * Republic of Cameroon Widely-recognized UN member state. \\---- \\---- * Dominion of Canada (to 17 April 1982) * Canada (from 17 April 1982) Widely-recognized UN member state; Commonwealth realm. Canada was a federation of ten provinces and two territories. \\---- \\---- – Republic of Cape Verde Widely-recognized UN member state. \\---- \\---- Widely-recognized UN member state. \\---- \\---- – Republic of Chad Widely-recognized UN member state. \\---- \\---- Chile – Republic of Chile Widely-recognized UN member state. It had a claim over Chilean Antarctic Territory, which is suspended under the Antarctic Treaty. \\---- \\---- Widely-recognized UN member state. The People's Republic of China had five autonomous regions: Guangxi, Inner Mongolia, Ningxia, Xinjiang and Tibet. The People's Republic of China claimed Taiwan, Kinmen, the Matsu Islands, Pratas Island and the Vereker Banks, and Itu Aba, all of which were governed by the Republic of China. It also claimed the Paracel Islands (disputed by the Republic of China and Vietnam), the Spratly Islands (disputed by the Republic of China, Vietnam, the Philippines, Malaysia and Brunei), and South Tibet (controlled by India). The People's Republic of China administered Aksai Chin and the Trans-Karakoram Tract, which were within the disputed region of Kashmir. \\---- \\---- Partially-recognized de facto independent state. The Republic of China claimed to be the sole legitimate government of China, but only administered Taiwan, Kinmen, the Matsu Islands, Pratas Island and Itu Aba. The Republic of China had territorial claims over Mongolia; the Tuvan Autonomous Soviet Socialist Republic; the Sixty-Four Villages East of the River (administered by the Soviet Union); The majority of Gorno-Badakhshan (administered by the Soviet Union); The eastern tip of the Wakhan Corridor (administered by Afghanistan); a small portion of Gilgit-Baltistan (administered by Pakistan and part of the disputed Kashmir region); Aksai Chin (administered by the People's Republic of China and part of the disputed Kashmir region); eastern Bhutan; South Tibet (controlled by India); and Kachin State (administered by Myanmar). \\---- \\---- – Republic of Ciskei Nominally independent South African bantustan. \\---- \\---- – Republic of Colombia Widely-recognized UN member state. Colombia administered Bajo Nuevo Bank and Serranilla Bank (disputed by Nicaragua and the United States). \\---- \\---- – Federal Islamic Republic of the Comoros Widely-recognized UN member state. The Comoros was a federation of three islands. Comoros claimed sovereignty over the French overseas territories of Mayotte and the Glorioso Islands. It also claimed Banc du Geyser (disputed by Madagascar and France). \\---- \\---- Congo – People's Republic of the Congo Widely-recognized UN member state. \\---- \\---- A state in free association with New Zealand. It shares a head of state with New Zealand as well as having shared citizenship. \\---- \\---- – Republic of Costa Rica Widely-recognized UN member state. \\---- \\---- – Republic of Cuba Widely-recognized UN member state. The Cuban area of Guantánamo Bay was under the control of the United States. \\---- \\---- – Republic of Cyprus Widely-recognized UN member state. Cyprus included one self-declared state which, although it did not claim independence, was de facto self-governing: * Turkish Federated State of Cyprus (to 15 November 1983) After 15 November 1983, The northeastern part of the island was the de facto independent state of Northern Cyprus, recognized only by Turkey. \\---- \\---- Czechoslovakia – Czechoslovak Socialist Republic Widely-recognized UN member state. Czechoslovakia was a federation of two republics. \\---- \\---- === D === === D === === D === \\---- \\---- – Kingdom of Denmark Widely-recognized UN member state; EEC member. The Danish Realm also included two of its constituent countries: * * \\---- \\---- Derg Ethiopia \\---- \\---- – Republic of Djibouti Widely-recognized UN member state. \\---- \\---- → → Dominica – Commonwealth of Dominica Widely-recognized UN member state. \\---- \\---- Widely-recognized UN member state. \\---- \\---- === E === === E === === E === \\---- \\---- – Republic of Ecuador Widely-recognized UN member state. \\---- \\---- → – Arab Republic of Egypt Widely-recognized UN member state. Egypt included the Sinai Peninsula, which was occupied by Israel until 25 April 1982. \\---- \\---- – Republic of El Salvador Widely-recognized UN member state. \\---- \\---- – Republic of Equatorial Guinea Widely-recognized UN member state. \\---- \\---- → Ethiopia * Provisional Military Government of Socialist Ethiopia (Derg or Socialist Ethiopia) * People's Democratic Republic of Ethiopia Widely-recognized UN member state. \\---- \\---- === F === === F === === F === \\---- \\---- * Dominion of Fiji * Republic of Fiji Widely-recognized UN member state; Commonwealth realm (to 7 October 1987). Fiji had an autonomous dependency, Rotuma. \\---- \\---- – Republic of Finland Widely-recognized UN member state. Finland had a neutral and demilitarised region: * \\---- \\---- – French Republic Widely-recognized UN member state. EEC member. France included five overseas departments: French Guiana, Guadeloupe, Martinique, Réunion, and Saint Pierre and Miquelon (to 11 June 1985). It also had sovereignty over the following overseas territories: * , with one dependency: ** Clipperton Island * French Southern and Antarctic Lands (including a claim to Adélie Land which was suspended under the Antarctic Treaty.) * * New Caledonia * (to 29 July 1980, jointly with the United Kingdom) * (from 11 June 1985) * The Scattered Islands in the Indian Ocean, consisting of five uninhabited possessions: ** Bassas da India (disputed by Madagascar) ** Europa Island (disputed by Madagascar) ** Glorioso Islands (disputed by Madagascar, Comoros, and the Seychelles) ** Juan de Nova Island (disputed by Madagascar) ** Tromelin Island (disputed by Mauritius and the Seychelles) * France also claimed Banc du Geyser (disputed by Madagascar and the Comoros). \\---- \\---- === G === === G === === G === \\---- \\---- – Gabonese Republic Widely-recognized UN member state. \\---- \\---- – Republic of the Gambia Widely-recognized UN member state. \\---- \\---- – German Democratic Republic Widely-recognized UN member state. \\---- \\---- – Federal Republic of Germany Widely-recognized UN member state. EEC member. West Germany was a federation of ten states. \\---- \\---- – Republic of Ghana Widely-recognized UN member state. \\---- \\---- – Hellenic Republic Widely-recognized UN member state. EEC member (from 1 January 1981). Greece had sovereignty over Mount Athos, an autonomous monastic state that was jointly governed by the multi-national \"Holy Community\" on the mountain and the Civil Governor appointed by the Greek Ministry of Foreign Affairs, and spiritually came under the direct jurisdiction of the Ecumenical Patriarchate. \\---- \\---- * People's Revolutionary Government of Grenada * Grenada Widely-recognized UN member state; Commonwealth realm. Grenada had one autonomous dependency, Carriacou and Petite Martinique. \\---- \\---- – Republic of Guatemala Widely-recognized UN member state. \\---- \\---- * People's Revolutionary Republic of Guinea (to April 3, 1984) * Republic of Guinea (from April 3, 1984) Widely-recognized UN member state. \\---- \\---- – Republic of Guinea-Bissau Widely-recognized UN member state. \\---- \\---- – Co-operative Republic of Guyana Widely-recognized UN member state. \\---- \\---- === H === === H === === H === \\---- \\---- → – Republic of Haiti Widely-recognized UN member state. Haiti claimed the uninhabited United States possession of Navassa Island. \\---- \\---- Holy See Vatican City \\---- \\---- – Republic of Honduras Widely-recognized UN member state. \\---- \\---- * People's Republic of Hungary * Republic of Hungary Widely-recognized UN member state. \\---- \\---- === I === === I === === I === \\---- \\---- – Republic of Iceland Widely-recognized UN member state. \\---- \\---- – Republic of India Widely-recognized UN member state. India was a federation of twenty-eight states and ten union territories. Indian sovereignty over South Tibet was disputed by China. India administered part of the disputed region of Kashmir as the state of Jammu and Kashmir. \\---- \\---- – Republic of Indonesia Widely-recognized UN member state. \\---- \\---- → – Islamic Republic of Iran Widely-recognized UN member state. \\---- \\---- – Iraqi Republic Widely-recognized UN member state. \\---- \\---- Widely- recognized UN member state. EEC member. \\---- \\---- – State of Israel Widely- recognized UN member state. Israel occupied the Gaza Strip the Golan Heights, the Israeli Security Zone in Southern Lebanon (from 6 June 1982), the Sinai Peninsula (to 25 April 1982), and the West Bank, including East Jerusalem. These areas were not recognized as being part of Israel. \\---- \\---- Italy – Italian Republic Widely-recognized UN member state; EEC member. Italy had 5 autonomous regions and they were the Aosta Valley, Friuli-Venezia Giulia, Sardinia, Sicily, and Trentino-Alto Adige/Südtirol. \\---- \\---- * Republic of Ivory Coast * Republic of Côte d'Ivoire Widely-recognized UN member state. \\---- \\---- === J === === J === === J === \\---- \\---- Widely-recognized UN member state; Commonwealth realm. \\---- \\---- Widely-recognized UN member state. \\---- \\---- – Hashemite Kingdom of Jordan Widely-recognized UN member state. Until 31 July 1988, Jordan claimed West Bank, including East Jerusalem, which were Israeli-occupied territories. \\---- \\---- === K === === K === === K === \\---- \\---- Kampuchea, Democratic * Democratic Kampuchea * Coalition Government of Democratic Kampuchea Widely-recognized UN member state. Claimed to be the sole legitimate government of Kampuchea, despite being in exile. \\---- \\---- → Kampuchea, People's Republic of / Cambodia, State of * People's Republic of Kampuchea * State of Cambodia Partially recognized de facto independent state. Claimed to be the sole legitimate government of Kampuchea. The People's Republic of Kampuchea was occupied by Vietnam until 25 September 1989. \\---- \\---- – Republic of Kenya Widely-recognized UN member state. \\---- \\---- – Republic of Kiribati Widely-recognized independent state. \\---- \\---- – Democratic People's Republic of Korea Widely-recognized independent state. Permanent observer at the UN; claimed to be the sole legitimate government of Korea. \\---- \\---- → * Fourth Republic * Fifth Republic * Sixth Republic Widely-recognized independent state. Permanent observer at the UN; claimed to be the sole legitimate government of Korea. \\---- \\---- – State of Kuwait Widely-recognized UN member state. \\---- \\---- === L === === L === === L === \\---- \\---- – Lao People's Democratic Republic Widely-recognized UN member state. \\---- \\---- – Lebanese Republic Widely-recognized UN member state; Lebanon was occupied by Syria. Some of Southern Lebanon was occupied by Israel (from 6 June 1982). \\---- \\---- → – Kingdom of Lesotho Widely-recognized UN member state. \\---- \\---- – Republic of Liberia Widely-recognized UN member state. \\---- \\---- Libya * Socialist People's Libyan Arab Jamahiriya * Great Socialist People's Libyan Arab Jamahiriya Widely-recognized UN member state. \\---- \\---- → – Principality of Liechtenstein Widely-recognized independent state. The defense of Liechtenstein was the responsibility of Switzerland. \\---- \\---- – Grand Duchy of Luxembourg Widely-recognized UN member state. EEC member. \\---- \\---- === M === === M === === M === \\---- \\---- Madagascar – Democratic Republic of Madagascar Widely-recognized UN member state. Madagascar claimed the French possessions of Bassas da India, Europa Island, Glorioso Islands and Juan de Nova Island. It also claimed Banc du Geyser (disputed by Comoros and France) \\---- \\---- – Republic of Malawi Widely-recognized UN member state. \\---- \\---- Widely-recognized UN member state. Malaysia was a federation of thirteen states and two federal territories. Malaysia claimed part of the Spratly Islands (disputed by the People's Republic of China, the Republic of China, Vietnam, the Philippines, and Brunei). \\---- \\---- – Republic of Maldives Widely-recognized UN member state. \\---- \\---- – Republic of Mali Widely-recognized UN member state. \\---- \\---- – Republic of Malta Widely-recognized UN member state. \\---- \\---- – Republic of the Marshall Islands Widely-recognized state under Compact of Free Association with the United States. The Marshall Islands claimed the United States territory of Wake Island. \\---- \\---- – Islamic Republic of Mauritania Widely-recognized UN member state. \\---- \\---- Mauritius Widely-recognized UN member state; Commonwealth realm. Mauritius had three dependencies: Agalega Islands, Cargados Carajos and Rodrigues. It claimed the British Indian Ocean Territory and the French territory of Tromelin Island. \\---- \\---- – United Mexican States Widely-recognized UN member state. Mexico was a federation of 31 states and one federal district. \\---- \\---- Widely-recognized state under Compact of Free Association with the United States. The FSM was a federation of four states. \\---- \\---- – Principality of Monaco Widely-recognized independent state. Permanent observer at the UN.The defense of Monaco was the responsibility of France. \\---- \\---- Mongolia – Mongolian People's Republic Widely-recognized UN member state. \\---- \\---- – Kingdom of Morocco Widely-recognized UN member state. Morocco claimed sovereignty over and controlled most of the disputed Western Sahara, which was home to the de facto independent Sahrawi Arab Democratic Republic. Morocco disputed the Spanish sovereignty over Ceuta, Isla de Alborán, Isla Perejil, Islas Chafarinas, Melilla, and Peñón de Alhucemas. \\---- \\---- → → Mozambique – People's Republic of Mozambique Widely-recognized UN member state. \\---- \\---- Myanmar Burma \\---- \\---- === N === === N === === N === \\---- \\---- – Republic of Nauru Widely-recognized independent state. The defense of Nauru was the responsibility of Australia. \\---- \\---- Nepal – Kingdom of Nepal Widely- recognized UN member state. \\---- \\---- – Kingdom of the Netherlands Widely-recognized UN member state. The Kingdom of the Netherlands consisted of three autonomous countries: * (from 1 January 1986) * * → The Kingdom of the Netherlands as a whole was a member of the EEC, but Aruba and the Netherlands Antilles were not. \\---- \\---- * Dominion of New Zealand * New Zealand Widely-recognized UN member state; Commonwealth realm. New Zealand had responsibilities for the two free associated states of: * * It also had sovereignty over two dependent territories: * Ross Dependency (suspended under the Antarctic Treaty) * Tokelau The government of Tokelau claimed Swains Island, part of American Samoa (a U.S. dependence). New Zealand did not recognize this claim since 25 March 1981. \\---- \\---- – Republic of Nicaragua Widely-recognized UN member state. Nicaragua had two autonomous regions: Región Autónoma del Atlántico Norte (from 1987) and Región Autónoma del Atlántico Sur (from 1987). \\---- \\---- – Republic of Niger Widely-recognized UN member state. \\---- \\---- – Federal Republic of Nigeria Widely-recognized UN member state. Nigeria was a federation of 21 states and one federal territory. \\---- \\---- A state in free association with New Zealand. Niue is a member of multiple UN agencies with full treaty making capacity. It had shared citizenship with New Zealand. \\---- \\---- – Turkish Republic of Northern Cyprus Partially recognized de facto independent state. Claimed by the Republic of Cyprus. \\---- \\---- – Kingdom of Norway Widely-recognized UN member state. Norway had two integral overseas areas: Jan Mayen and Svalbard. The latter of area had a special status due to the Spitsbergen Treaty. Norway had sovereignty over the following dependencies: * Bouvet Island * Peter I Island (suspended under the Antarctic Treaty) * Queen Maud Land (suspended under the Antarctic Treaty) \\---- \\---- === O === === O === === O === \\---- \\---- – Sultanate of Oman Widely-recognized UN member state. \\---- \\---- === P === === P === === P === \\---- \\---- – Islamic Republic of Pakistan Widely- recognized UN member state. Pakistan was a federation of four provinces and four territories; it administered part of the disputed region of Kashmir as the territories of Azad Kashmir and the Northern Areas. \\---- \\---- – State of Palestine (non-sovereign, non-UN member nation) Disputed region consisting of two occupied territories: the Gaza Strip and the West Bank, including East Jerusalem. The declared State of Palestine, which claimed independence for all the Palestinian territories from 15 November 1988, was recognized by a large number of countries. In foreign relations, Palestine was represented by the Palestine Liberation Organization, which was a permanent observer at the United Nations. \\---- \\---- – Republic of Panama Widely-recognized UN member state. \\---- \\---- – Independent State of Papua New Guinea Widely-recognized UN member state; Commonwealth realm. \\---- \\---- → Paraguay – Republic of Paraguay Widely-recognized UN member state. \\---- \\---- * Peruvian Republic * Republic of Peru Widely-recognized UN member state. \\---- \\---- → → – Republic of the Philippines Widely-recognized UN member state. The Philippines had one autonomous region: Muslim Mindanao (from 1 August 1989). The Philippines administered Scarborough Shoal, which was disputed by the People's Republic of China and the Republic of China. It also claimed sovereignty over the Spratly Islands (disputed by the People's Republic of China, the Republic of China, Vietnam, Brunei, and Malaysia) and the Malaysian territory of Sabah. \\---- \\---- → * Polish People's Republic * Republic of Poland Widely-recognized UN member state. \\---- \\---- – Portuguese Republic Widely-recognized UN member state. EEC member (from 1 January 1986). Portugal had two autonomous regions: the Azores and Madeira. Portugal had one Chinese territory which it administered as a dependency: * Macau Portugal claimed sovereignty over the former colony of Portuguese Timor, which had been annexed by Indonesia. It also claimed the Spanish municipalities of Olivenza and Táliga. \\---- \\---- === Q === === Q === === Q === \\---- \\---- – State of Qatar Widely-recognized UN member state. \\---- \\---- === R === === R === === R === \\---- \\---- → * Socialist Republic of Romania * Romania Widely-recognized UN member state. \\---- \\---- – Rwandese Republic Widely-recognized UN member state. \\---- \\---- Rwenzururu – Kingdom of Rwenzururu De facto independent state. Not recognized by any other state. Claimed by Uganda. \\---- \\---- === S === === S === === S === \\---- \\---- Partially recognized de facto independent state. The Sahrawi Arab Democratic Republic claimed the disputed territory of Western Sahara, most of which was under control of Morocco. The territories under its control, the so-called Free Zone, were claimed by Morocco. Its government resided in exile in Tindouf, Algeria. \\---- \\---- → * Saint Christopher-Nevis-Anguilla * Saint Christopher and Nevis * Federation of Saint Kitts and Nevis Associated state of the United Kingdom (to 18 September 1983); widely-recognized independent state (from 19 September 1983). UN member state (from 23 September 1983); Commonwealth realm. Saint Kitts and Nevis was a federation of fourteen parishes within two islands. Nevis (which was one of the islands) had autonomy. \\---- \\---- Saint Lucia Widely-recognized UN member state; Commonwealth realm. \\---- \\---- → → Widely-recognized independent state. UN member state (from 16 September 1980); Commonwealth realm. \\---- \\---- – Republic of San Marino Widely-recognized independent state. \\---- \\---- – Democratic Republic of São Tomé and Príncipe Widely-recognized UN member state. \\---- \\---- – Kingdom of Saudi Arabia Widely-recognized UN member state. \\---- \\---- – Republic of Senegal Widely-recognized UN member state. \\---- \\---- – Republic of Seychelles Widely-recognized UN member state; the Seychelles claimed the British Indian Ocean Territory and the French territories of Tromelin Island and the Glorioso Islands. \\---- \\---- – Republic of Sierra Leone Widely-recognized UN member state. \\---- \\---- – Republic of Singapore Widely-recognized UN member state. \\---- \\---- Widely- recognized UN member state; Commonwealth realm. \\---- \\---- Somalia – Somali Democratic Republic Widely-recognized UN member state. \\---- \\---- → – Republic of South Africa Widely-recognized UN member state. South Africa had seven autonomous bantustans: Ciskei (to 4 December 1981), Gazankulu, KaNgwane (from 31 August 1984), KwaNdebele (from 1 April 1981), KwaZulu, Lebowa, and QwaQwa. There were also four bantustans which were nominally independent: Bophuthatswana, Ciskei (from 4 December 1981), Transkei, and Venda. South Africa administered one League of Nations mandate: * South-West Africa \\---- \\---- – Union of Soviet Socialist Republics Widely-recognized UN member state. The Soviet Union was a federation of 15 republics, two of which (Byelorussia and Ukraine) were UN members in their own right. \\---- \\---- → – Kingdom of Spain Widely-recognized UN member state; EEC member (from 1 January 1986). Spain consisted of seventeen autonomous communities. Its sovereignty over Ceuta, Isla de Alborán, Isla Perejil, Islas Chafarinas, Melilla and Peñón de Alhucemas was disputed by Morocco. Its sovereignty over Olivenza and Táliga was disputed by Portugal. It claimed the British overseas territory of Gibraltar. \\---- \\---- – Democratic Socialist Republic of Sri Lanka Widely-recognized UN member state. \\---- \\---- * Democratic Republic of the Sudan * Republic of the Sudan Widely-recognized UN member state. \\---- \\---- – Republic of Suriname Widely-recognized UN member state. \\---- \\---- – Kingdom of Swaziland Widely-recognized UN member state. \\---- \\---- – Kingdom of Sweden Widely- recognized UN member state. \\---- \\---- – Swiss Confederation Widely- recognized independent state; permanent observer at the UN. Switzerland was a federation of 26 cantons. \\---- \\---- → – Syrian Arab Republic Widely- recognized UN member state. Syria included the Golan Heights, which were occupied by Israel. It disputed the Turkish sovereignty over Hatay Province. \\---- \\---- === T === === T === === T === \\---- \\---- Tafea – Nation of Tafea De facto independent state. Claimed by the Anglo-French New Hebrides Condominium. \\---- \\---- Unrecognized de facto self-governing entity. Claimed by Sri Lanka. \\---- \\---- – United Republic of Tanzania Widely-recognized UN member state. Tanzania had one autonomous region: Zanzibar. \\---- \\---- Thailand – Kingdom of Thailand Widely-recognized UN member state. \\---- \\---- – Togolese Republic Widely-recognized UN member state. \\---- \\---- – Kingdom of Tonga Widely-recognized independent state. \\---- \\---- – Republic of Transkei Nominally independent South African bantustan. \\---- \\---- – Republic of Trinidad and Tobago Widely-recognized UN member state. Trinidad and Tobago had one autonomous island: Tobago (from 23 September 1980). \\---- \\---- – Tunisian Republic Widely-recognized UN member state. \\---- \\---- – Republic of Turkey Widely-recognized UN member state. \\---- \\---- Tuvalu Widely-recognized independent state; Commonwealth realm. \\---- \\---- === U === === U === === U === \\---- \\---- * Third Republic of Uganda (to 26 January 1986) * Fourth Republic of Uganda (from 26 January 1986) Widely-recognized UN member state. \\---- \\---- Widely-recognized UN member state; the United Arab Emirates was a federation of seven emirates. \\---- \\---- – United Kingdom of Great Britain and Northern Ireland Widely-recognized UN member state. EEC member. The United Kingdom was composed of four countries: England, Northern Ireland, Scotland, and Wales. The United Kingdom had responsibilities for the following self- governing free associated states: * Antigua (to 31 October 1981), with two dependencies ** Barbuda ** Redonda * (from 19 December 1980 to 18 September 1983) * (to 19 December 1980) The United Kingdom administered the foreign affairs of the following protected states: * (to 31 December 1983) * (to 29 July 1980, jointly with France) It also had sovereignty over the following crown colonies (dependent territories after 1 January 1983): * Anguilla (from 19 December 1980) * (to 20 September 1981) * * British Antarctic Territory (suspended under the Antarctic Treaty) * British Indian Ocean Territory (disputed by Mauritius and the Seychelles) * * * Falkland Islands (disputed by Argentina), with one dependency ** Falkland Islands Dependencies (to 3 October 1985) * → * Hong Kong * Montserrat * * , with two dependencies ** Ascension Island ** Tristan da Cunha * South Georgia and the South Sandwich Islands (from 3 October 1985, disputed by Argentina) * (to 17 April 1980) * Sovereign Base Areas of Akrotiri and Dhekelia * Turks and Caicos Islands In addition, the British Monarch had direct sovereignty over three self-governing Crown dependencies: * → , with three dependencies: ** ** ** * * → \\---- \\---- – United States of America Widely-recognized UN member state; the United States was a federation of 50 states, one federal district, and one incorporated territory. It asserted sovereignty over the following inhabited insular areas: * (including Swains Island, disputed by Tokelau) * * → (from 4 November 1986) * * In addition, the United States administered one United Nations Trust Territory: * , consisting of four territories: ** (to 20 October 1986) ** (to 2 November 1986) ** Northern Mariana Islands (to 3 November 1986) ** (from 1 January 1981) The United States ceded Roncador Bank and Serrana Bank to Colombia and abandoned its claim to Quita Sueño Bank on 17 September 1981, but it did not explicitly renounce its claims to Serranilla Bank or Bajo Nuevo Bank. According to some government sources, these islands are still considered to be unincorporated territories of the United States. \\---- \\---- → Upper Volta / Burkina Faso * Republic of Upper Volta * Burkina Faso Widely- recognized UN member state. \\---- \\---- – Eastern Republic of Uruguay Widely- recognized UN member state. \\---- \\---- === V === === V === === V === \\---- \\---- – Republic of Vanuatu Widely-recognized independent state; UN member state (from 15 September 1981). \\---- \\---- – Vatican City State Widely- recognized independent state. Vatican City was administered by the Holy See, a sovereign entity recognized by a large number of countries and a Permanent observer at the United Nations. The Holy See also administered a number of extraterritorial properties in Italy. The Pope was the ex officio head of state of Vatican City. \\---- \\---- Vemerana – Republic of Vemerana De facto independent state. Not recognized by any other state. Claimed by the Anglo- French New Hebrides Condominium. \\---- \\---- – Republic of Venda Nominally independent South African bantustan. \\---- \\---- Venezuela – Republic of Venezuela Widely-recognized UN member state. Venezuela was a federation of 20 states, two territories, one federal dependency, and one federal district. \\---- \\---- – Socialist Republic of Vietnam Widely-recognized UN member state. Vietnam claimed sovereignty over the Paracel Islands (disputed by the People's Republic of China and the Republic of China) and Spratly Islands (disputed by the People's Republic of China, the Republic of China, Brunei, the Philippines, and Malaysia). \\---- \\---- === W === === W === === W === \\---- \\---- – Independent State of Western Samoa Widely-recognized UN member state. \\---- \\---- === Y === === Y === === Y === \\---- \\---- – Yemen Arab Republic Widely-recognized UN member state. \\---- \\---- – People's Democratic Republic of Yemen Widely-recognized UN member state. \\---- \\---- – Socialist Federal Republic of Yugoslavia Widely-recognized UN member state; Yugoslavia was a federation of six republics. \\---- \\---- === Z === === Z === === Z === \\---- \\---- – Republic of Zaire Widely-recognized UN member state. \\---- \\---- Zambia – Republic of Zambia Widely-recognized UN member state. \\---- \\---- – Republic of Zimbabwe Widely-recognized independent state; UN member state (from 25 August 1980). \\---- \\---- ==Other entities== Excluded from the list above are the following noteworthy entities which either were not fully sovereign or did not claim to be independent: * Antarctica as a whole had no government and no permanent population. Seven states claimed portions of Antarctica and five of these had reciprocally recognised one another's claims. \"Australia, New Zealand, France, Norway and the United Kingdom reciprocally recognize the validity of each other's claims.\" These claims, which were regulated by the Antarctic Treaty System, were neither recognised nor disputed by any other signatory state.CIA – the World Factbook – Antarctica – accessed 19 January 2008 * was occupied and administered by Indonesia as Timor Timur, but this was not recognized by the United Nations, which considered it to be Portuguese territory under Indonesian occupation. * was effectively a part of the Soviet Union, but the legality of the annexation was not widely-recognized. The Baltic diplomatic services in the West continued to be recognised as representing the de jure state. * was effectively a part of the Soviet Union, but the legality of the annexation was not widely-recognized. The Baltic diplomatic services in the West continued to be recognised as representing the de jure state. * was incorporated into the Soviet Union in 1940, but the legality of the annexation was not widely-recognized. The Baltic diplomatic services in the West continued to be recognised as representing the de jure state. * The Saudi Arabian–Iraqi neutral zone was a strip of neutral territory between Iraq and Saudi Arabia (to 26 December 1981). * The Sovereign Military Order of Malta was an entity claiming sovereignty. The order had bi-lateral diplomatic relations with a large number of states, but had no territory other than extraterritorial areas within Rome.Bilateral relations with countries , Retrieved 22 December 2009 The order's Constitution stated: \"The Order is a subject of international law and exercises sovereign functions.\" Although the order frequently asserted its sovereignty, it did not claim to be a sovereign state. It lacked a defined territory. Since all its members were citizens of other states, almost all of them lived in their native countries, and those who resided in the order's extraterritorial properties in Rome did so only in connection with their official duties, the order lacked the characteristic of having a permanent population. * West Berlin was a political enclave that was closely aligned with – but not actually a part of – West Germany. It consisted of three occupied sectors administered by the United States, the United Kingdom, and France. ==Notes== ==References== Category:1980s Category:Lists of countries in the 20th century",
 "title": "List of countries in the 1980s"
}