{
 "id": "881791",
 "text": "Article 36 of the PRC Constitution provides constitutional protection for citizens’ freedom of religion and the country's official ethnic policies also reiterate protection of the freedom of religion of ethnic minorities, but in practice the Uyghur population, predominantly living in the Xinjiang Uyghur Autonomous Region, are subject to strict controls on the practice of Islam.U.S. Department of Justice (March 2015) ‘Annual Report 2008’. Retrieved 6 December 2017. Examples of these restrictions now include: *Official religious practices must be held in government-approved mosques *Uyghurs under 18 years old are not allowed to enter mosques or pray in school *The study of religious texts is only permitted in designated state schools *Government informers regularly attend religious gatherings in mosques *Women are not allowed to wear headscarves and veils and men are not allowed to have beards *The use of traditionally Islamic names (e.g., Abdul), is banned Since the September 11 attacks in 2001, the Chinese government began to label violence in the Xinjiang Uyghur Autonomous Region as terrorism, unlike in previous years. Chinese counter-terror legislation now makes explicit links between religion and extremism and has led to regulations that explicitly ban religious expression among Uyghurs in particular. On January 19, 2021, outgoing Secretary of State Mike Pompeo formally declared that China is committing a genocide against the Uighurs and crimes against humanity. In a written letter, Pompeo wrote, “I believe this genocide is ongoing, and that we are witnessing the systematic attempt to destroy Uyghurs by the Chinese party- state.” Pompeo called for “all appropriate multilateral and relevant juridical bodies, to join the United States in our effort to promote accountability for those responsible for these atrocities.\" China strongly denies that human rights abuses are going on in Xinjiang. Pompeo has previously stated that China is trying to \"erase its own citizens.\" On 16 August 2021, a young Chinese woman, named Wu Huan, told the Associated Press in her testimony that she was allegedly held for eight days at a Chinese-run secret detention facility in the United Arab Emirates, along with two other Uyghurs. Wu Huan said she was abducted from a hotel in Dubai and detained by Chinese officials at a villa converted into a jail. It was the first evidence that China was operating a “black site” beyond its borders. == References == East Turkestan Category:Xinjiang",
 "title": "Human rights in East Turkestan"
}