{
 "id": "881727",
 "text": "This is a list of countries in the 1930s, giving an overview of states around the world during the period between 1 January 1930 and 31 December 1939. It contains entries, arranged alphabetically, with information on the status and recognition of their sovereignty. It includes widely recognized sovereign states, entities which were de facto sovereign but which were not widely recognized by other states, and 1 state which was initially unrecognized but then gained full recognition later in the decade. ==Sovereign states== Name and capital city Information on status and recognition of sovereignty \\---- \\---- === A === === A === === A === \\---- \\---- → Afghanistan – Kingdom of Afghanistan Widely recognized independent state. LON member state from September 27, 1934. \\---- \\---- Albania – Albanian Kingdom Widely recognized LON member state. Under occupation by Italy from 12 April 1939. \\---- \\---- → Andorra – Principality of Andorra Widely recognized independent state. \\---- \\---- \\---- \\---- – Argentine Republic Widely recognized LON member state. Argentina was a federation of 23 provinces and 10 federal territories. It had a claim over Argentine Antarctica. It also claimed the Falkland Islands and South Georgia and the South Sandwich Islands, both of which were British overseas territories. \\---- \\---- – Commonwealth of Australia Widely recognized LON member state; Commonwealth realm. Australia was a federation of six states and three territories. It had sovereignty over the following external territories: * Australian Antarctic Territory * Norfolk Island * Australia administered two League of Nations mandates: * Nauru * New Guinea \\---- \\---- → Austria * Republic of Austria * Federal State of Austria Widely recognized LON member state. Taken over by Nazi Germany from 12 March 1938. \\---- \\---- === B === === B === \\---- \\---- – Kingdom of Belgium Widely recognized LON member state. Belgium had sovereignty over one colony and one concession: * * Tientsin Belgium administered one League of Nations mandate: * Ruanda-Urundi \\---- \\---- – Republic of Bolivia Widely recognized independent state. \\---- \\---- Brazil * First Brazilian Republic * Republic of the United States of Brazil * United States of Brazil Widely recognized independent state. Brazil was a federation of 20 states, one territory, and one federal district. \\---- \\---- Bulgaria – Kingdom of Bulgaria Widely recognized LON member state. \\---- \\---- === C === === C === \\---- \\---- – Dominion of Canada Widely recognized LON member state; Commonwealth realm. \\---- \\---- Unrecognized state. Taken over by Hungary from 18 March 1939. \\---- \\---- * Republic of Chile * Socialist Republic of Chile * Republic of Chile Widely recognized LON member state; withdrew in May 14, 1938. \\---- \\---- – Republic of China Widely recognized LON member state. \\---- \\---- – Republic of Colombia Widely recognized LON member state. \\---- \\---- – Republic of Costa Rica Widely recognized independent state. \\---- \\---- – Republic of Cuba Widely recognized LON member state. \\---- \\---- * First Czechoslovak Republic * Second Czechoslovak Republic Widely recognized LON member state. Under occupation by Nazi Germany from 15 May 1939. A government in exile was regarded as the legitimate government by the Allies. \\---- \\---- === D === === D === \\---- \\---- – Free City of Danzig Widely recognized independent state. Taken over by Nazi Germany from 12 September 1939. \\---- \\---- – Kingdom of Denmark Widely recognized LON member state. Denmark had sovereignty over one possession: * \\---- \\---- Widely recognized LON member state. \\---- \\---- === E === === E === \\---- \\---- Ecuador – Republic of Ecuador Widely recognized independent state. LON member state from September 28, 1934. \\---- \\---- – Kingdom of Egypt Widely recognized independent state. LON member state from May 26, 1937. \\---- \\---- * Republic of El Salvador * Military dictatorship in El Salvador Widely recognized LON member state; withdrew in August 11, 1937. \\---- \\---- – Republic of Estonia Widely recognized LON member state. \\---- \\---- – Ethiopian Empire Widely recognized LON member state. Under occupation by Italy from May 9, 1936 and taken over by Italian East Africa from June 1, 1936. \\---- \\---- === F === === F === \\---- \\---- – Republic of Finland Widely recognized LON member state. \\---- \\---- France – French Republic Widely recognized LON member state. France administered the foreign affairs of the following colonies and protectorates: * Adélie Land * Clipperton Island * French Equatorial Africa * French Guiana * French India – French Establishments in India * French Indochina * French Morocco * French Oceania – French Establishments in Oceania * French Somaliland * French Tunisia * French West Africa * Guadeloupe * Inini * French Madagascar * Martinique France administered the following League of Nations mandates: * Alawite * Lebanese Republic * State of Syria * → Syrian Republic * Jabal ad-Druze * French Cameroons * French Togoland * Saar Basin \\---- \\---- === G === === G === \\---- \\---- → → Germany * Weimar Republic * Nazi Germany Widely recognized LON member state; withdrew in October 19, 1933. \\---- \\---- → Greece * Hellenic Republic * Kingdom of Greece Widely recognized LON member state. \\---- \\---- – Republic of Guatemala Widely recognized LON member state; withdrew in May 26, 1936. \\---- \\---- === H === === H === \\---- \\---- Haiti – Republic of Haiti Widely recognized LON member state. \\---- \\---- – Hatay State Widely recognized independent state. Taken over by Turkey from 7 July 1939. \\---- \\---- – Republic of Honduras Widely recognized LON member state; withdrew in July 10, 1936. \\---- \\---- – Kingdom of Hungary Widely recognized LON member state; withdrew in April 11, 1939. \\---- \\---- === I === === I === \\---- \\---- – Kingdom of Iceland Widely recognized independent state. \\---- \\---- Persia / Iran * Imperial State of Persia * Imperial State of Iran Widely recognized LON member state. \\---- \\---- Iraq – Kingdom of Iraq Widely recognized independent state. LON member state from October 3, 1932. \\---- \\---- * Irish Free State * Republic of Ireland Widely recognized LON member state; Commonwealth realm. \\---- \\---- – Kingdom of Italy Widely recognized LON member state; withdrew in December 11, 1937. Italy had sovereignty over two colonies (four colonies until January 1934 and three colonies until June 1936) and one concession: * Italian Cyrenaica * Italian Tripolitania * Italian Libya * Italian Eritrea * Italian Somaliland * Italian East Africa * Tientsin \\---- \\---- === J === === J === \\---- \\---- – Empire of Japan Widely recognized LON member state; withdrew in March 27, 1933. Japan had sovereignty over three colonies and two concessions: * Chōsen * Karafuto * Kwantung * Taiwan * Tientsin Japan administered one League of Nations mandate: * South Seas Mandate \\---- \\---- === L === === L === \\---- \\---- – Republic of Latvia Widely recognized LON member state. \\---- \\---- – Republic of Liberia Widely recognized LON member state. \\---- \\---- → Liechtenstein – Principality of Liechtenstein Widely recognized independent state. \\---- \\---- – Republic of Lithuania Widely recognized LON member state. \\---- \\---- – Grand Duchy of Luxembourg Widely recognized LON member state. \\---- \\---- === M === === M === \\---- \\---- → – United Mexican States Widely recognized independent state. LON member state from September 12, 1931; declared a member in September 12, 1931. Mexico had sovereignty over one territory: * Isla de la Pasión \\---- \\---- – Principality of Monaco Widely recognized independent state. \\---- \\---- Mongolia – Mongolian People's Republic Widely recognized independent state. \\---- \\---- === N === === N === \\---- \\---- → Nejd and Hejaz – , Saudi Arabia * – Kingdom of Nejd and Hejaz ** Nejd – Kingdom of Nejd and its Dependencies ** Hejaz – Kingdom of Hejaz * Kingdom of Saudi Arabia Widely recognized independent state. Nejd and Hejaz had sovereignty over one protectorate: * Asir \\---- \\---- Nepal – Kingdom of Nepal Widely recognized independent state. \\---- \\---- – Kingdom of the Netherlands Widely recognized LON member state. Netherlands had sovereignty over 3 colonies: * Curaçao and Dependencies * Dutch East Indies * Surinam \\---- \\---- – Dominion of Newfoundland Widely recognized independent state; de facto Commonwealth realm to February 16, 1934. \\---- \\---- New Zealand – Dominion of New Zealand Widely recognized LON member state; Commonwealth realm. New Zealand had sovereignty over four dependent territories: * Cook Islands * Niue Island * Ross Dependency * Union Islands New Zealand administered one League of Nations mandate: * Western Samoa \\---- \\---- – Republic of Nicaragua Widely recognized LON member state; withdrew in June 27, 1936. \\---- \\---- – Kingdom of Norway Widely recognized LON member state. Norway had sovereignty over 3 uninhabited possessions: * Bouvet Island * Peter I Island * Sverdrup Islands \\---- \\---- === P === === P === \\---- \\---- – Republic of Panama Widely recognized LON member state. \\---- \\---- – Republic of Paraguay Widely recognized LON member state; withdrew in February 23, 1935. \\---- \\---- – Peruvian Republic Widely recognized LON member state; withdrew in April 8, 1939. \\---- \\---- Poland – Republic of Poland Widely recognized LON member state. Under occupation by Nazi Germany from 6 October 1939. A government in exile was regarded as the legitimate government by the Allies. \\---- \\---- Portugal * Ditadura Nacional * Estado Novo Widely recognized LON member state. Portugal had sovereignty over eight colonies and one possession: * * Portuguese Macau * Portuguese East Africa * * Portuguese India * * Portuguese West Africa * Fort of São João Baptista de Ajudá * São Tomé and Príncipe \\---- \\---- === R === === R === \\---- \\---- – Kingdom of Romania Widely recognized LON member state. \\---- \\---- === S === === S === \\---- \\---- – Most Serene Republic of San Marino Widely recognized independent state. \\---- \\---- Siam / Thailand * Kingdom of Siam * Kingdom of Thailand Widely recognized LON member state. \\---- \\---- – Union of South Africa Capital: Pretoria (administrative), Cape Town (legislative), Pietermaritzburg (archival), Bloemfontein (judicial) Widely recognized LON member state; Commonwealth realm. South Africa administered one League of Nations mandate: * South West Africa \\---- \\---- – Union of Soviet Socialist Republics Widely recognized independent state. LON member state from September 18, 1934; expelled in December 14, 1939. The Soviet Union was a federation of seven (later 11) republics. \\---- \\---- → → Spain * Kingdom of Spain * Spanish Republic * Spanish State Widely recognized LON member state; withdrew in May 1939. Spain had sovereignty over three colonies and one protectorate: * Ifni * * * Spanish Morocco \\---- \\---- – Kingdom of Sweden Widely recognized LON member state. \\---- \\---- – Swiss Confederation Widely recognized LON member state. \\---- \\---- === T === === T === \\---- \\---- Tibet De facto independent state. Claimed by the Republic of China. \\---- \\---- – Republic of Turkey Widely recognized independent state. LON member state from July 18, 1932. \\---- \\---- === U === === U === \\---- \\---- – United Kingdom of Great Britain and Northern Ireland Widely recognized LON member state. The United Kingdom had sovereignty over 61 colonies: * Aden – Aden Colony and Protectorate * Amoy * * Bahrain – State of Bahrain * Baker Island * * Basutoland – Territory of Basutoland * Bechuanaland – Bechuanaland Protectorate * Bermuda * Bhutan – Kingdom of Bhutan * * * British Leeward Islands – Federal Colony of the Leeward Islands * British Somaliland – British Somaliland Protectorate * British Western Pacific Territories * British Windward Islands – Federal Colony of the Windward Islands * Brunei – State of Brunei * Burma * * Cyprus * Enderby Land * Falkland Islands * Federated Malay States * Gambia – Gambia Colony and Protectorate * * * Guernsey – Bailiwick of Guernsey * Heard Island and McDonald Islands * Hong Kong * – Indian Empire * Isle of Man * * Jarvis Island * – Bailiwick of Jersey * – State of Johor Darul Ta'zim * – State of Kedah Darul Aman * – State of Kelantan Darul Naim * – Kenya Colony and Protectorate * Kuwait – Sheikhdom of Kuwait * Maldive Islands – Sultanate of the Maldive Islands * * * Muscat and Oman – Sultanate of Muscat and Oman * – Colony and Protectorate of Nigeria * * Northern Rhodesia – Protectorate of Northern Rhodesia * – Nyasaland Protectorate * – State of Perlis Indera Kayangan * Qatar – State of Qatar * Saint Helena * Sarawak – Kingdom of Sarawak * Seychelles * Sierra Leone – Sierra Leone Colony and Protectorate * – Colony of Southern Rhodesia * * Swaziland – Swaziland Protectorate * Terengganu – State of Terengganu Darul Iman * * Tristan da Cunha * Trucial States * * Victoria Land * Weihaiwei * Zanzibar United Kingdom administered the following League of Nations mandates: * British Cameroons * British Togoland * Iraq * Palestine ** Transjordan * Saar Basin * Tanganyika \\---- \\---- – United States of America Widely recognized independent state. The United States had sovereignty over 21 territories: * Alaska – Alaska Territory * American Samoa – Territory of American Samoa * Corn Islands * Guam – Territory of Guam * Hawaii – Territory of Hawaii * Howland Island * Johnston Atoll * Kingman Reef * Midway Atoll * Navassa Island * * Petrel Islands * Philippine Islands * Puerto Rico * Quita Sueno Bank * Roncador Bank * Serrana Bank * Serranilla Bank * Swan Islands * * Wake Island \\---- \\---- – Eastern Republic of Uruguay Widely recognized LON member state. \\---- \\---- === V === === V === \\---- \\---- – Vatican City State Widely recognized independent state. \\---- \\---- → Venezuela – United States of Venezuela Widely recognized LON member state; withdrew in July 12, 1938. \\---- \\---- === Y === === Y === \\---- \\---- Yemen – Mutawakkilite Kingdom of Yemen Widely recognized independent state. \\---- \\---- – Kingdom of Yugoslavia Widely recognized independent state. \\---- \\---- ==Other entities== Excluded from the list above are the following noteworthy entities which either were not fully sovereign or did not claim to be independent: \\---- * Ararat – Republic of Ararat * Catalonia – Catalan Republic * China, Provisional Government of – Provisional Government of the Republic of China * China, Reformed Government of – Reformed Government of the Republic of China * Democratic Finland – Finnish Democratic Republic Capital: Helsinki (official), Terijoki (de facto) * East Hebei – East Hebei Autonomous Council * East Turkestan – Turkish Islamic Republic of East Turkestan * Jiangxi – Chinese Soviet Republic Capital: Ruijin (1931–1936), Bao'an (1936–1937), Yan'an (1937) * – State of Manchuria ** State of Manchuria ** Great Empire of Manchuria * – Mongol Military Government * Shanghai – Dadao Municipal Government of Shanghai * Slovakia – Slovak Republic (a client state of Nazi Germany recognized by several neutral states) * → → Tuva – Tuvan People's Republic ==Notes== ==References== Category:1930s Category:Lists of countries in the 20th century",
 "title": "List of countries in the 1930s"
}