{
 "id": "881810",
 "text": "Human rights in India is a hard issue in the nation. ==Background== The issues are caused by the country's large size and population. For other reasons, there are: *widespread poverty *lack of education *diverse culture ==Laws== The Constitution of India gives fundamental rights. This includes freedom of religion. Clauses also provide for freedom of speech, as well as separation of executive and judiciary and freedom of movement within the country and abroad. The country also has an independent judiciary as well as bodies to look into issues of human rights. == LGBT rights == Until the Delhi High Court allowed private sexual acts between consenting adults on 2 July 2009, homosexuality was considered criminal as per interpretations of the ambiguous Section 377 of the 150-year-old Indian Penal Code (IPC). It was a law passed by the British colonial government. However, this law was very rarely enforced.Letter to Indian Prime Minister Manmohan Singh On the arrest of four men on charges of homosexual conduct in Lucknow letter by Scott Long, director of Lesbian, Gay, Bisexual, and Transgender Rights Programme at Human Rights Watch ===Judges=== In its ruling to allow homosexuality, the Delhi High Court noted that existed law conflicted with the fundamental rights guaranteed by the Constitution of India, and such ban violates Articles 21, 14 and 15 of the Constitution. ====2010s==== On 11 December 2013, homosexuality was again banned by a Supreme Court ruling. On 6 September 2018, a five judge constitutional bench of the Supreme Court of India, in a landmark judgement, allowed homosexuality. ====2020s==== On June 7, 2021, the Madras High Court ruled that it would take strict action against anyone found attempting to medically “cure” or change the sexual orientation of the LGBTQIA+ community to heterosexual. In its judgement, Justice N Anand Venkatesh also gave directives to educational institutions to sensitize students. Also, it instructed police and prison authorities to conduct programs that not just sensitized police personnel but also ensured non-discrimination of the LGBTQIA+ community. ==References== India, Republic of Category:Politics of India",
 "title": "Human rights in India"
}