{
 "id": "881988",
 "text": "Rachel Renée Russell is an American author of the children's book series Dork Diaries and its spin-off The Misadventures of Max Crumbly. Russell grew up in Saint Joseph, Michigan, and has four younger siblings, two sisters and twin brothers. Dork Diaries, written in a diary format, uses doodles,drawings, and comic strips to chronicle the daily life of the main character, Nikki Maxwell, as she struggles to fit in and survive middle school. The series is based on Russell's middle school experiences. Her daughter, Nikki, is the illustrator of the series. The main character, Nikki Maxwell, is named after her daughter. The Misadventures of Max Crumbly is about a character, Maxwell Crumbly, who keeps a diary about his challenges in middle school. He is introduced in Dork Diaries: Tales From A Not-So Perfect Pet Sitter. 55 million copies of Dork Diaries are in print worldwide in 42 languages. Her new book, Tales from a Not-So-Posh Paris Adventure, was scheduled to be released on 13 October 2020 but was delayed due to the Coronavirus pandemic. It is currently scheduled to be release on November 9, 2021. ==Bibliography and awards == * Dork Diaries: Tales From a Not-So-Fabulous Life (Book 1) was released on June 2, 2009. It spent 42 weeks on the New York Times Bestsellers list\"The New York Times Best Sellers: Children's Books\" and 7 weeks on the USA Today Best Sellers list.\"Best-Selling Books Database on USA Today\" * Dork Diaries: Tales From a Not-So-Popular Party Girl (Book 2) was released on June 8, 2010. It has spent 42 weeks on the New York Times Bestsellers list\"The New York Times Best Sellers: Children's Books\" on nytimes.com\" and 12 weeks on the USA Today Best Sellers list. * Dork Diaries: Tales From a Not-So-Talented Pop Star (Book 3) was released on June 7, 2011, and landed on the New York Times Bestsellers list for Children's Series and 13 weeks on the USA Today Best Sellers list. * Dork Diaries: How To Dork Your Diary was released in October 2011 and landed on the New York Times Best Sellers list for Children's Series. * Dork Diaries: Tales From a Not-So-Graceful Ice Princess (Book 4) was released in June 2012 and landed on the New York Times Best Sellers list for Children's Series. It also won the 2013 Children's Choice Book of the Year Award for the 5th/6th grade division. * Dork Diaries: Tales From a Not-So-Smart Miss Know-It-All (Book 5) was released in October 2012. It also landed on the New York Times Best Sellers list for Children's Series. * Dork Diaries: Tales From a Not-So- Happy Heartbreaker (Book 6) was released on June 4, 2013, and landed on the New York Times Best Sellers list for Children's Series. * Dork Diaries: OMG! All About Me Diary! was released on October 8, 2013, and landed on the New York Times Best Sellers list for Children's Series. * Dork Diaries: Tales From a Not-So-Glam TV Star (Book 7) was released on June 3, 2014, and landed on the New York Times Best Sellers list for Children's Series. * Dork Diaries: Tales From a Not-So-Happily Ever After (Book 8) was released on September 30, 2014, and landed on the New York Times Best Sellers list for Children's Series. * Dork Diaries: Tales From a Not-So-Dorky Drama Queen (Book 9) was released on June 2, 2015, and landed on the New York Times Best Sellers list for Children's Series. * Dork Diaries: Tales From a Not-So-Perfect Pet Sitter (Book 10) was released on October 20, 2015, and landed on the New York Times Best Sellers list for Children's Series. * The Misadventures of Max Crumbly: Locker Hero (Book 1) was released on June 7, 2016, and landed on the New York Times Best Sellers list for Middle-Grade Children's Best Sellers. * Dork Diaries: Tales From a Not-So-Friendly Frenemy (Book 11) was released on October 18, 2016, and landed on the New York Times Best Sellers list for Children's Series. * The Misadventures of Max Crumbly: Middle School Mayhem (Book 2) was released on June 6, 2017, and landed on the New York Times Best Sellers list for Middle-Grade Children's Best Sellers. * Dork Diaries: Tales From a Not-So-Secret Crush Catastrophe(Book 12) was released on October 1, 2017, and landed on the New York Times Best Sellers list for Children's Series. * Dork Diaries: Tales From a Not-So-Happy Birthday (Book 13) was released on October 12, 2018, and landed on the New York Times Best Sellers list for Children's Series. * The Misadventures of Max Crumbly: Masters of Mischief (Book 3) was released on June 4, 2019, and landed on the New York Times Best Sellers list for Children's Series. * Dork Diaries: Tales From a Not-so-Best Friend Forever (Book 14) was released on October 22, 2019, and landed on the New York Times Best Sellers list for Children's Series. * As of August 2020, the Dork Diaries book series has spent 325 weeks on the New York Times Best Sellers list in the Children's Series category. == References == == Other websites == * Category:American children's writers Category:Living people Category:African-American writers Category:1945 births",
 "title": "Rachel Renée Russell"
}