{
 "id": "882459",
 "text": "\"Squid's Visit\" is the first part of the 16th episode of the sixth season of SpongeBob SquarePants. It was first broadcast on Nickelodeon on June 4, 2009. The episode is about SpongeBob SquarePants trying to get Squidward Tentacles to visit his home. == Story == SpongeBob learns that Squidward does not usually do anything after working at the Krusty Krab. He asks Squidward many times to meet him at his house. On the next day, Squidward tells SpongeBob that he does not want to leave his home to visit SpongeBob's house. SpongeBob asks his neighbor Patrick on what to do. Patrick says he should borrow something from Squidward so that he will have to go to SpongeBob to get it back. Squidward accidentally drops pepper while making a casserole. He tries to get his vacuum cleaner but learns that SpongeBob has taken it. He puts the casserole in his oven and goes to SpongeBob's house to get the vacuum cleaner back. He learns that SpongeBob has made the inside of his house look just like Squidward's house. Squidward becomes afraid and asks SpongeBob for the vacuum cleaner. While SpongeBob is gone, Squidward looks around and sees that SpongeBob has copied small details of Squidward's house. He goes to the bathroom and believes that SpongeBob spies on him. He becomes unconscious after slipping on cream and hitting his head on a toilet. He wakes up and thinks that he was dreaming. He screams when he sees SpongeBob and goes to a room with many paintings. He learns that SpongeBob has made copies of all 492 of his portraits. He goes to a closet and finds his vacuum cleaner. He learns that SpongeBob has put all of his furniture in the closet. He leaves SpongeBob's house and learns that his house has burned down. He did not take his casserole out of the oven which started a fire. Squidward faints and later sleeps in SpongeBob's house, while SpongeBob and Gary sleep where Squidward's house used to be. == References == == Other websites == * Category:2009 television episodes Category:SpongeBob SquarePants episodes",
 "title": "Squid's Visit"
}