{
 "id": "882562",
 "text": "Power Rangers RPM (Racing Performance Machines) is a TV show Power Rangers started in 2009. It aired from February 14 to December 26 2009 with 35 episodes. It is based on the Super Sentai series Engine Sentai Go-onger. It is the sequel to Power Rangers Jungle Fury. A sequel to called Power Rangers Samurai started in 2011 and ended in 2012. ==Plot== AI computer virus Venjix is all set to attack Corinth, the only city that has survived the carnage by its droids. The RPM Power Rangers must learn to use the advanced biotech vehicles to save mankind. ==Characters== Actor Name Rangers Zord Eka Darville Scott Truman Ranger Operator Series Red Eagle Eagle Zord Ari Boyland Flynn Allistair Ranger Operator Series Blue Lion Lion Zord Rose Mclver Summer Landsdown Ranger Operator Series Yellow Bear Bear Zord Milo Cawthorne Ziggy Grover Ranger Operator Series Green Shark Shark Zord Daniel Ewing Dillon Ranger Operator Series Black Wolf Wolf Zord Mike Ginn Gem Ranger Operator Series Gold Falcon Zord Li Ming Hu Gemma Ranger Operator Series Silver Tiger Zord ==Cast and Characters== ===Rangers=== * Eka Darville as Scott Truman, the Ranger Operator Series Red Eagle. * Ari Boyland as Flynn Allistair, the Ranger Operator Series Blue Lion. * Rose Mclver as Summer Landsdown, the Ranger Operator Series Yellow Bear. * Milo Cawthorne as Ziggy Grover, the Ranger Operator Series Green Shark. * Daniel Ewing as Dillon, the Ranger Operator Series Black Wolf. * Mike Ginn as Gem, the Ranger Operator Series Gold. * Li Ming Hu as Gemma, the Ranger Operator Series Silver. ===Supporting characters=== * Olivia Tennet as Dr. K. * James Gaylyn as Colonel Mason Truman * Damien Avery as Colonel Hicks * Mia Koning as Vasquez * Murray Keana as Benny ===Villians=== * Adelaide Kane as Tenaya 7/15. * Andrew Laing as Venjix Virus * Mark Mitchinson as the voice of General Shifter * Charlie McDermott as the voice of General Crush * Leighton Cardno as the voice of General Kilobyte * John Summer as Bob Fresco * Gary Young as Ronin ===Guest Stars=== * Jason Smith as Casey Rhodes, the Jungle Fury Red Ranger * Anna Hutchison as Lily Chilman, the Jungle Fury Yellow Ranger * Aljin Abella as Theo Martin, the Jungle Fury Blue Ranger * David de Lautour as Robert \"RJ\" James, the Jungle Fury Wolf Ranger * Nikolai Nikolaeff as Dominic \"Dom\" Hargan, the Jungle Fury Rhino Ranger * Bruce Allpress as Master Phant, the Green Elephant Spirit Ranger * Oliver Driver as Master Swoop, the Black Bat Spirit Ranger * Paul Gittin as Master Fin, the Aqua Shark Spirit Ranger * Bebe Skinner as Jairod/Dai Shi * Holly Shanahan as Camille ==References== Category:Mighty Morphin Power Rangers Category:English-language television programs",
 "title": "Power Rangers RPM"
}