{
 "id": "882556",
 "text": "Power Rangers Operation Overdrive is a TV show Power Rangers started in 2007. It aired from February 19 to November 26 2007 35 episodes. It is based on the Super Sentai series GoGo Sentai Boukenger. It is the sequel to Power Rangers Mystic Force. A sequel to called Power Rangers Jungle Fury started in 2008. ==Plot== Five teenagers set out to protect ancient jewels which hold great powers from the hands of two evil brothers who want to use it for selfish reasons. ==Characters== Actor Name Rangers James Maclurcan Mackenzie \"Mack\" Hartford Red Overdrive Ranger Catilin Murphy Veronica \"Ronny\" Robinson Yellow Overdrive Ranger Samuell Benta William \"Will\" Aston Black Overdrive Ranger Rhoda Montemayor Rose Ortiz Pink Overdrive Ranger Gareth Yuen Dax Lo Blue Overdrive Ranger Dwayne Cameron Tyzonn Mercury Overdrive Ranger ==Cast and Characters== ===Rangers=== * James Maclurcan as Mackenzie \"Mack\" Hartford, the Red Overdrive Ranger. * Catilin Murphy as Veronica \"Ronny\" Robinson, the Yellow Overdrive Ranger. * Samuell Benta as William \"Will\" Aston, the Black Overdrive Ranger. * Rhoda Montemayor as Rose Ortiz, the Pink Overdrive Ranger. * Gareth Yuen as Dax Lo, the Blue Overdrive Ranger. * Dwayne Cameron as Tyzonn, the Mercury Overdrive Ranger. ===Supporting characters=== * Rod Lousich as Andrew Hartford. * David Weatherley as Spencer. * Campbell Cooley as Alpha 6 (voice). * Nic Sampson as Sentinel Knight (voice). * Beth Allen as Villa. *Veteran Rangers ** Johnny Yong Bosch as Adam Park, the second Black Ranger. ** Tori Hanson as Tori Hanson, the Blue Wind Ranger. ** Emma Lahana as Kira Ford, the Yellow Dino Ranger. ** Matt Austin as Bridge Carson, the third S.P.D. Red Ranger. ** Richard Brancatisano as Xander Bly, the Green Mystic Ranger. ===Villains=== * Gerald Urquhart as Flurious. * Ria Vandervis as Miratrix. * Adam Gardiner as the voice of Kamdor * James Gaylyn as the voice of Cheetar * Lori Dungey as the voice of Crazar * Kelson Henderson as Norg and the voice of Mig. * Mark Ferguson as the voice of Moltor. * David Weatherley as the voice of Benglo * Glen Levy as the voice of Thrax ==References== Category:Mighty Morphin Power Rangers Category:English-language television programs",
 "title": "Power Rangers Operation Overdrive"
}