{
 "id": "882558",
 "text": "Power Rangers Jungle Fury is a TV show Power Rangers started in 2008. It aired from February 11 to November 17 2008 35 episodes. It in based on the Super Sentai series Juken Sentai Gekiranger. It is the sequel to Power Rangers Operation Overdrive. A sequel to it called Power Rangers RPM started in 2009. ==Plot== When the evil Dai Shi escapes and hatches a plan which will allow animals to rule the human world, the Power Rangers set out on a mission to stop him. ==Characters== Actor Name Rangers Zord Jason Smith Casey Rhodes Red Tiger Ranger Tiger Zord Anna Hutchinson Lily Chilman Yellow Cheetah Ranger Cheetah Zord Aljin Abella Theo Martin Blue Jaguar Ranger Jaguar Zord David de Lautour Robert \"RJ\" James Purple Wolf Ranger Wolf Zord Nikolai Nikolaeff Dominic \"Dom\" Hargan White Rhino Ranger Rhino Zord Bruce Allpress Master Phant Green Elephant Spirit Ranger Elephant Zord Oliver Drive Master Swoop Black Bat Spirit Ranger Bat Zord Paul Gittins Master Fin Aqua Shark Spirit Ranger Shark Zord ==Cast and Characters== ===Rangers=== * Jason Smith as Casey Rhodes, the Red Tiger Ranger. * Anna Hutchinson as Lily Chilman, the Yellow Cheetah Ranger. * Aljin Abella as Theo Martin, the Blue Jaguar Ranger. * David de Lautour as Robert \"RJ\" James, the Purple Wolf Ranger. * Nikolai Nikolaeff as Dominic \"Dom\" Hargan, the White Rhino Ranger. ===Additional Rangers=== * Bruce Allpress as Master Phant, the Green Elephant Spirit Ranger. * Oliver Driver as Master Swoop, the Black Bat Spirit Ranger. * Paul Gittins as Master Fin, the Aqua Shark Spirit Ranger. ===Supporting characters=== * Sarah Thompson as Fran. * Kelson Henderson as Flit (voice). * Nathaniel Lees as Master Mao. * Michelle Langstone as Master Guin. * Stig Eldred as Master Rilla. * Andrew Laing as Master Lope. * Aljin Abella as Lewin Martin. ===Villains=== * Bede Skinner as Jarrod. * Holly Shanahan as Camille. * Mark Wright as Scorch (voice). * Geoff Dolan as the voice of Dai Shi * Cameron Rhodes as the voice of Carnisoar * Elisabeth Easther as the voice of Jellica * Derek Judge as the voice of Grizzaka * Mark Wright as the voice of Scorch * Richard Simpson as the voice of Snapper * Jared Turner as the voice of Whiger (In Episode 29) ===Guest Stars=== * James Maclurcan as Mackenzie \"Mack\" Hardford; The Red Overdrive Ranger * Samuell Benta as William \"Will\" Aston; The Black Overdrive Ranger * Gareth Yuen, as Dax Lo; The Blue Overdrive Ranger * Caitlin Murphy, as Veronica \"Ronny\" Robinson; The Yellow Overdrive Ranger * Rhoda Montemayor, as Rose Ortiz; The Pink Overdrive Ranger * Dwayne Cameron, as Tyzonn; The Mercury Ranger * Gerald Urquhart, as Furious * Mark Ferguson, as the voice of Moltor * Ria Vandervis, as Miratrix == References == Category:Mighty Morphin Power Rangers Category:English-language television programs",
 "title": "Power Rangers Jungle Fury"
}