{
 "id": "882540",
 "text": "The Special Region of Yogyakarta (, pronounced ; Javanese: ꦣꦲꦺꦫꦃꦲꦶꦯ꧀ꦡꦶꦩꦺꦮꦔꦪꦺꦴꦒꦾꦏꦂꦠ Dhaérah Istiméwa Yogyakarta) is a provincial-level autonomous region of Indonesia in the south of Java. Indian Ocean is on the southern side of the Special Region. The Special Region is located next to Central Java. Yogyakarta is ruled by the Yogyakarta Sultanate, the only official monarchy in the government of Indonesia. The city of Yogyakarta is a popular tourist destination and cultural center of the region. The Yogyakarta Sultanate was established in 1755 and supported for Indonesia's independence during the Indonesian National Revolution (1945–1949). Yogyakarta is led by Sultan Hamengkubuwono X as the governor and Prince Paku Alam as the vice governor. The Special Region has a land area of 3,185.8km2. It is the second- smallest province of Indonesia after Jakarta. == Government and politics == === Governor === Special Region is led by a governor who is helped by a vice governor. The governor and vice governor of the Special Region are chosen by the President. The governor must be a Sultan of Yogyakarta and the vice governor must be a Price of Pakualaman === Administrative divisions === The Special Region of Yogyakarta is subdivided into four regencies (kabupaten) and one city (kota): Name Capital Area (km2) Population 2000 Census Population 2010 Census Population 2020 Census HDI 2018 Estimates Yogyakarta City Yogyakarta City 0.861 () Bantul Regency Bantul 0.794 () Gunung Kidul Regency Wonosari 0.692 () Kulon Progo Regency Wates 0.737 () Sleman Regency Sleman 0.834 () Totals 0.795 () The city of Yogyakarta is located in the Special Region of Yogyakarta. It is a hub of classical Javanese fine art and culture such as batik, ballet, drama, music, poetry, and puppet shows. It is also one of Indonesia's centers of higher education. At the city's center is the Sultan's palace called the Kraton. The city spread in all directions from the Kraton, the modern city core is in the north. == Demographics == ===Religion=== The majority of the population is Muslim, which is 92.94%, followed by Catholic Christians 4.11%, then Protestant Christians 2.44%, Hindus 0.43%, Buddhists 0.09% and Confucianism 0.02%. == Sister relationship == Yogyakarta Special Region has signed sister province relationship with region/state: * Kyoto Prefecture, Japan * Victoria, Australia * Gyeongsangbuk-do, South Korea * Yamanashi Prefecture, Japan == References ==",
 "title": "Special Region of Yogyakarta"
}