{
 "id": "882549",
 "text": "Power Rangers S.P.D. (Space Patrol Delta) is a TV show Power Rangers started in 2005. It aired from February 5 to November 28, 2005, 40 episodes. It is based on the Super Sentai series Tokusou Sentai Dekaranger. It is the sequel to Power Rangers Dino Thunder. A sequel to called Power Rangers Mystic Force started in 2006. ==Plot== In the future, the people of Earth welcome extraterrestrial beings to live with them. But peace is short-lived when the alien forces become destructive, driving the Power Rangers SPD into action. ==Characters== Actor Name Rangers Brandon Jay McLaren Jack Landors S.P.D. Red Ranger Chris Violette Schuyler \"Sky\" Tate S.P.D. Blue Ranger Matt Austin Bridge Carson S.P.D. Green Ranger Monica May Elizabeth \"Z\" Delgado S.P.D. Yellow Ranger Alycia Purrott Sydney \"Syd\" Drew\" S.P.D. Pink Ranger John Tui Anibus \"Doggie\" Cruger S.P.D. Shadow Ranger Brett Stewart Sam S.P.D. Omega Ranger Michelle Langstone Kat Manx S.P.D. Kat Ranger Antonia Prebble Nova S.P.D. Nova Ranger Malika Lim Lina Song S.P.D Gold Ranger ==Cast and Characters== ===B-Squad=== * Brandon Jay McLaren as Jack Landors, the S.P.D. Red Ranger. * Chris Violette as Schuyler \"Sky\" Tate, the S.P.D. Blue Ranger. * Matt Austin as Bridge Carson, the S.P.D. Green Ranger. * Monica May as Elizabeth \"Z\" Delgado, the S.P.D. Yellow Ranger. * Alycia Purrott as Sydney \"Syd\" Drew, the S.P.D. Pink Ranger. ===Additional Rangers=== * John Tui as Anibus \"Doggie\" Cruger, the S.P.D. Shadow Ranger. * Brett Stewart as Sam, the S.P.D. Omega Ranger. * Michelle Langstone as Dr. Katherine \"Kat\" Manx, the S.P.D. Kat Ranger. * Antonia Prebble as Nova, the S.P.D. Nova Ranger. * Malika Lim as Lina Song, the S.P.D. Gold Ranger (2 episodes). ===Dino Thunder Rangers=== * James Napier as Connor McKnight, the Red Dino Ranger. * Kevin Duhaney as Ethan James, the Blue Dino Ranger. * Emma Lahana as Kira Ford, the Yellow Dino Ranger. * Jeffrey Perazzo as Trent Fernandez, the White Dino Ranger & Tommy Oliver, the Black Dino Ranger (voice). ===Villains=== * Rene Naufahu as Emperor Gruumm. * Olivia James-Baird as Mora. * Josephine Davidson as Morgana. ===A-Squad=== * Gina Varela as Charlie, the A-Squad Red Ranger. * Nick Kemplen (voice) as the A-Squad Blue Ranger. * Thomas Kiwi & Nick Kemplen (voice) as the A-Squad Green Ranger. * Allan Smith & Greg Cooper II (voice) as the A-Squad Yellow Ranger. * Motoko Nagino & Claire Dougan (voice) as the A-Squad Pink Ranger. ==References== Category:Mighty Morphin Power Rangers Category:English-language television programs",
 "title": "Power Rangers S.P.D."
}