{
 "id": "88276",
 "text": "Robert Indiana (born as Robert Clark; September 13, 1928 - May 19, 2018) was an American artist. He was known for being a part of the pop art movement. He was born in New Castle, Indiana. Indiana moved to New York City in 1954 and joined the pop art movement. Indiana's work often has bold, simple, iconic images, especially numbers and short words like \"EAT\", \"HUG\", and \"LOVE\". His sculpture in the lobby of Taipei 101, called 1-0 (2002, aluminum), uses multicolored numbers. After the September 11, 2001 attacks, Indiana made a series of Peace Paintings, which were shown in New York in 2004. Indiana died on May 19, 2018 in Vinalhaven, Maine of respiratory failure at the age of 89.Robert Indiana, artist behind Philly's iconic LOVE sculpture, dies at 89 ==LOVE== Indiana's best known image is the word love in upper-case letters, arranged in a square with a tilted letter O. This image was first created for a Christmas card for the Museum of Modern Art in 1964. It was put on an eight- cent US Postal Service postage stamp in 1973, the first of their regular series of \"love stamps.\" Sculptures of the image can be found at many places in the United States: *Sixth Avenue in New York City *E W Fairchild-Martindale Library, Lehigh University Asa Packer Campus *Pratt Institute campus in Brooklyn, New York *Indianapolis Museum of Art, Indianapolis, Indiana *Scottsdale's Civic Center *\"LOVE Park\" in Philadelphia *New Orleans Museum of Art's sculpture garden *Middlebury College campus, Vermont *University of Pennsylvania campus, Philadelphia *Museum of Art at Brigham Young University, Utah *Ursinus College campus in Collegeville, Pennsylvania *Pool area of the Red Rock Resort Spa and Casino in Las Vegas * Wichita State University campus in Wichita, Kansas * City Park in New Orleans, Louisiana Sculptures of the image can also be found at many places outside of the United States: *Taipei 101 in Taipei, Taiwan (also displays Indiana's 1-0)Publicly posted material, Floor 89, Taipei 101. 2007-08-17. *Shinjuku I-LAND Tower in Office district of West Shinjuku in Tokyo, Japan *Orchard Road in Singapore *Plaza del Sagrado Corazón in Bilbao, Basque Country Spain *Outside 1445 West Georgia Street in Vancouver, Canada *Praca do Rossio in Lisbon, Portugal * Hotel XIXe Siècle in Montreal, Canada An Indiana sculpture showing the Hebrew word for love (ahava) is displayed at The Israel Museum in Jerusalem, Israel. ==References== Category:American sculptors Category:American painters Category:People from Indiana Category:Deaths from respiratory failure Category:1928 births Category:2018 deaths",
 "title": "Robert Indiana"
}