{
 "id": "88302",
 "text": "Avram Noam Chomsky (born December 7, 1928) is an American linguist, philosopher, political activist, author, and lecturer. He was an Institute Professor and professor emeritus of linguistics at the Massachusetts Institute of Technology. == Linguistics == Chomsky created the theory of generative grammar. This is one of the most important contributions to the field of linguistics made in the 20th century. He also helped start the cognitive revolution in psychology through his review of B. F. Skinner's Verbal Behavior. He challenged the behaviorist way of looking at behavior and language. This was the main approach used in the 1950s. His natural approach to the study of language also changed the philosophy of language and mind. He also invented the Chomsky hierarchy, a way of looking at formal languages in terms of their power to explain language. According to the Arts and Humanities Citation Index in 1992, Chomsky was cited as a source more often than any other living scholar during the 1980–1992 time period. He was the eighth-most cited scholar in any time period. == Politics == In the 1960s he criticized the Vietnam War. Because of that, Chomsky became more widely known for his media criticism and politics. He is a key intellectual figure within the left wing of United States politics. Chomsky is widely known for his political activism, and for his criticism of capitalism and the foreign policy of the United States and other governments. Chomsky often calls himself a libertarian socialist and an anarcho-syndicalist, and he has talked and written extensively on these subjects. He is a member of the Industrial Workers of the World, following his father William Chomsky who was also a member. In late 2015, Chomsky announced his support for Vermont U.S. senator Bernie Sanders in the upcoming 2016 United States presidential election. ==Health== Chomsky had a massive stroke in June 2023 and was hospitalized in São Paulo, Brazil. His wife talked about his health issues a year late in June 2024, where he remained hospitalized in Brazil. ==Honors== He was elected a member of the American Academy of Arts and Sciences in 1963, a member of the National Academy of Sciences in 1972, a foreign member of the Academia Europaea in 1995, a foreign member of the Serbian Academy of Sciences and Arts in 2003 and a member of the American Philosophical Society in 2004. He received honorary degrees from the University of Uppsala, the University of Chicago, the University of Delhi, the Massachusetts Institute of Technology, the University of Pennsylvania, the University of London, the Loyola University Chicago, the Swarthmore College, the Bard College, the University of Cambridge, the Columbia University, the Harvard University, the Georgetown University, the Amherst College, the McGill University, the National University of Colombia, the University of Toronto, the University of Calcutta, the Scuola Normale Superiore, the Western University in Ontario and the University of Buenos Aires. He was awarded the Kyoto Prize in Basic Sciences in 1988. == Notes == == References == * * * == Other websites == * Official website * Why It's Over For America, by Noam Chomsky, The Independent, May 30, 2006 * MIT homepage * * Conversation with Noam Chomsky * NY Times article on Chomsky—September 22, 2006 * Video of Chomsky's talk 'Force, law and the possibilities for survival' in March 2005 * joint Noam Chomsky—Howard Zinn interview, April 16 2007 part one part two * On nedia: State of Nature interview with Noam Chomsky (September, 2006) Category:1928 births Category:Living people Category:20th- century American philosophers Category:21st-century American philosophers Category:American anarchists Category:American historians Category:American political activists Category:Industrial Workers of the World Category:Jewish American academics Category:Jewish American scientists Category:Jewish American writers Category:Jewish philosophers Category:American linguists Category:Massachusetts Institute of Technology faculty Category:Scientists from Philadelphia Category:Socialists Category:Writers from Philadelphia Category:Educators from Philadelphia Category:Members of Academia Europaea",
 "title": "Noam Chomsky"
}