{
 "id": "883053",
 "text": "3 Words is the debut studio album by English singer Cheryl Cole released on 23 October 2009 by Fascination Records. Musically, it features a dance-pop and R&B; sound to it. The album debuted at number one on the UK Albums Chart, selling 125,271 copies in its first week. The album also charted on the Irish, Australian and Swiss charts. In the UK the album was certified three times Platinum by the British Phonographic Industry and has since sold 1,000,000 copies in the country alone. ==Critical reception== 3 Words received generally favourable reviews from music critics, earning a rating of 62 out of 100 on Metacritic based on 6 reviews. ==Track listing== Sample credits * \"Heaven\" contains samples from \"Is You\" by D.I.M., written by Andreas Meid. * \"Happy Hour\" contains samples from \"Nevermore\" by Renaldo Domino, written by Richard Pegue. * \"Boy Like You\" contains samples from \"Little Lies\" by Fleetwood Mac, written by Christine McVie and Eddy Quintela. ===3 Words – The B-Sides EP=== A digital EP featuring the three B-sides to the three singles from the 3 Words album, titled 3 Words – The B-Sides EP, was released online on 18 April 2010 from Fascination Records. ==Personnel== * Cheryl Cole – lead vocals, co-writer * William \"will.i.am\" Adams – executive producer, featured vocals, background vocals, producer, arrange, mixing, Instrumentation, co-writer * Taio Cruz – producer, featured vocals, instrumentation, co-writer * Priscilla Renea – co- writer, background vocals * Louis Biancaniello – instrumentation * Carsten Schack, Kenneth Karlin (Soulshock & Karlin) – producers, arrangement, instrumentation, mixing * Steve Kipner – producer, arrangement * Nick Knight – photographer * Reggie \"Syience\" Perry – producer, arrangement * Fraser T Smith – producer, instrumentation * Samual \"Sam\" Watters – producer * Wayne Wilkins – producer, arrangement, mixing * Tom Coyne – mastering * Mikaelin 'Blue' Bluespruce – recording engineer ==Charts== The album debuted at number one in the UK with sales of 125,271. It then retained the number 1 position for another week. On 6 November 2009 the British Phonographic Industry (BPI) certified the album platinum. It has since gone 3× Platinum, with sales of over 1,000,000 copies. ===Weekly charts=== Chart (2009–2010) Peak position Greece Albums (IFPI Greece) 15 South Korean Albums (Gaon) 5 ===Year- end charts=== Chart (2009) Position Irish Albums Chart 23 UK Albums Chart 11 Chart (2010) Position UK Albums Chart 37 ==Certifications== ==Release history== Region Release date Format Label Catalogue Ireland 23 October 2009 CD, digital download Polydor 2721459 United Kingdom 26 October 2009 Fascination 2721459 HMV bonus version 2724424 Italy 12 February 2010 CD, digital download Universal Music 060252732483 Netherlands 0602527324838 Switzerland Portugal 15 February 2010 Russia Mexico 16 March 2010 602527324838 Brazil Germany 19 March 2010 0602527214597 France 22 March 2010 Australia 9 April 2010 0602527324838 Denmark 17 May 2010 Digital download 0602527214597 ==References== Category:2009 albums Category:Debut albums Category:Dance-pop albums Category:R&B; albums",
 "title": "3 Words"
}