{
 "id": "883460",
 "text": "The Dhaka topi ( ), is a hat which is popular in Nepal among Nepalis and North Indian states of Sikkim and Assam, including Darjeeling and Dehradun among Sikkimese and Indian Gorkhas. It is a part of Nepalese and Indian-Gorkha national dress, worn by men on celebrations and festivals. ==Dhaka topi== Dhaka ko Topi in Nepali means a \"hat made of Dhaka cloth\". Dhaka cloth is fine cotton cloth that used to be imported from Dhaka, the current capital of Bangladesh. The Dhaka topi was a part of the Nepalese national dress, and a symbol of Nepalese nationality. It became popular during King Mahendra's rule between 1955 and 1972. Back then people needed to wear Dhaka topi for official photographs for passports and documents. It was also worn by government officials as a part of the national dress. In the times of king Mahendra, Dhaka topis were available for rent near the Singha Durbar in Kathmandu. The badge of kukri cross is worn on the cap mostly by officials in Kathmandu or when a Nepalese visit the Palace. It is not worn by the lay Nepali. Dhaka clothing is no longer a part of Nepalese fashion, but it is still an important part of society and Nepalese identity. They are also given away as gifts during Dashain and Tihar festivals. These days many Nepalis rarely wear a cap unless they are attending some cultural programme. However, many older men and women still wear clothes made from Dhaka. People wearing Dhaka topi are still commonly seen on the streets of Kathmandu. Dhaka cloth still plays a role in rituals, such as weddings and funerals of many ethnic groups living in the Kathmandu valley. Even though there are many places producing these hats, they still have a hard time producing enough for all the buyers. International Nepali Dhoti and Topi Day is celebrated by Nepali people around the world on 1 January. In this day people wear Dhaka topi as their pride to promote the culture. Nepali people from Madhesi and Tharu community wear Dhoti, while other wear Dhaka and Bhadgaunle topis on that day. There are more people wearing topi than dhoti in this day. Madhesi people use this day as an opportunity to promote their culture. Madhesis and Sikhs in Nepal are often discriminated against because of they usually don't wear Dhaka topi. ==Dhaka cloth== Dhaka is one of the most popular cotton textile in Nepal. They usually have various coloured patterns in them. Coloured cotton is imported from India and weaved into detailed patterns using only a few colours. This fabric is also used for a type of blouse called Dhaka ko cholo, meaning a \"blouse made of dhaka cloth\", and shawls for women.Poudyal, Anubhuti, \"Put a cap on it \", ECS Nepal, 12 December 2013. Some farmers and weavers have tried making silk Dhaka topi cloth with little success. There are different myths about the origin of Dhaka fabric. One story tells that a minister returned from Dhaka, Bangladesh with the idea of such a topi. It then ended up replacing the old black cap in popularity. Another story tells that name is so because at first cloths and threads for Dhaka topi used to come from Dhaka, similar to Dhakai muslin (fine cotton of Dhaka). It is also possible that Hindu weavers started living in Nepal to run away from the Muslim invasion of Bengal. The method of pattern weaving used around Dhaka is called Jamdani. It is very different from what is currently used by Nepalese weavers. A few fragments of Dhaka fabric in the collection of the National Museum of Nepal are thought to be from the early 20th century. The most popular legend comes from the introduction of Dhaka weaving to Ganesh Man Maharjan, who worked in an Jamdani factory in 1950s. He was inspired to learn it when he noticed Dambar Kumari, Junga Bahadur Rana's daughter, wearing Dhaka clothes she brought back from Benares. Upon returning to his home Palpa his wife and he started a factory to produce Dhaka cloth in 1957. They had one spool and one hand-operated Charkha spinning wheel bought from Kathmandu and local weavers trained by Mahajan. His business did well because of the high price of better quality imports.Amendra Pokharel,\"Dented Pride: The Story of Daura Suruwal and Dhaka Topi\", ECS Nepal, 11 July 2010Nirmal Shrestha, \"Palpali Dhaka\", ECS Nepal, 6 May 2016 As the Shah dynasty government showed a liking for Dhaka cloth and topis made out of it, other weavers started following Maharajan. By early 1970, his own factory Swadeshi Vastrakala Palpali Dhaka Udhyog had grown to employ around 350 workers. At that time Jaishanker Textile Industry, Khanal Textile Industry, and Nabin Textile Industry were the major producers of cotton yarn used to make Dhaka cloth. Even though the business was good and the government was supportive, most weavers were poor. An expert weaver worked 12–16 hours a day for a month to produce 4–5 metres of Dhaka cloth. But, their wage was just 10-30 Nepalese rupees, one egg and 250 grams of Jeri. In the 1970s, the Dhaka weaving industry in Palpa changed a lot as it was introduced to Jacquard loom and easily available shiny acrylic fiber. Jacquard looms made it possible to produce several metres a day, instead of around 9-inches on a hand-loom. Many weavers lost their jobs because of this. Dhaka caps lost some of the qualities in its patterns, and the cloth started being produced in other places. Now weavers in the capital Kathmandu, Palpa District in the middle mountains area, and Tehrathum District in the East are the main producers of Dhaka cloth. Limbus and Rais from the middle mountains are famous for the Dhaka cloth they produce. Tansen, the most popular source of Dhaka topis, is town with Magar, Brahmin, Chhetris with Newars who came in the 19th century looking for wealth. Apart from the famous Dhaka clothes, Tensen is also known for its metal craft including Karuwa mugs, jars and other items. It is a custom to buy Palpali Dhaka clothes as souvenir while visiting the area. This includes shawls and thailo purses that has two pairs of strings that can be drawn to open and close the purse. A Dhaka topi industry has been established in Darjeeling by Indian Gorkhas. ==Topis== The traditional outfit of Nepali men includes Daura- Suruwal (Nepalese shirt and trouser suit), Patuka (cloth worn around the waist instead of a belt), ista coat (the Nepalese half-jacket without sleeves) and a topi. For woman it's Gunyou Cholo (a dress like ghagra-kurta) with no topi. Many communities wear their own traditional dresses. Like the Tamang women wear a different round hat. Some Buddhist Tamang women wear Bakhus which are ethnic to the Tibetan people. Topis for Nepali man can be either black (called bhaad-gaaule or kalo topi) or multicoloured (called Dhaka or Nepali topi). Bhaad-gaaule topis are similar to Dhaka topi but they are black in colour because they are not made from Dhaka. Before the Nepali government started promoting Dhaka topis, Bhaad-gaaule topis that were largely made in Bhaktapur were popular. They were commonly worn by Newaris. These kalo topis (blacks caps) were once popular among upper class people of Rana dynasty. These black caps are now becoming popular again, mainly among the youth. Milliners of Bhaktapur almost had to close their business once because of the popularity of Dhaka topi. However, now their business is doing well as they were making around 600 kalo topis a week by 2015. Other than Dhaka and kalo topis there are many other topis made and worn in Nepal including chuclie topi, birke topi, karchupe topi and cap topi. ==References== ==Other websites== * * * Lionel Messi wears a Dhaka topi, Huffington Post Category:Hats Category:Nepali culture",
 "title": "Dhaka topi"
}