{
 "id": "883561",
 "text": "The 2025 Australian federal election was held on 3 May 2025 to elect members of the 48th Parliament of Australia. All 150 seats in the House of Representatives and 40 of the 76 seats in the Senate were up for election. The incumbent Labor government, led by Anthony Albanese, won re-election to a second term in office in a landslide victory, growing their parliamentary majority. ==Background== At the previous election, the three-term incumbent centre-right Liberal-National Coalition government, led by Prime Minister Scott Morrison, was defeated by the centre-left Labor Party, led by Opposition Leader Anthony Albanese. Albanese became the new Prime Minister. Morrison resigned as Liberal leader and was replaced by Peter Dutton, who became Opposition Leader, while Barnaby Joyce lost the National Party leadership to David Littleproud in a leadership spill. ===Current standings=== Affiliation House Senate Results of the 2022 election As of 3 December 2023 Change Results of the 2022 election As of 3 December 2023 Change Labor 77 78 1 26 26 0 Coalition 58 55 3 32 31 1 The Greens 4 4 0 12 11 1 One Nation 0 0 0 2 2 0 United Australia 0 0 0 1 1 0 Katter's Australian 1 1 0 0 0 0 Centre Alliance 1 1 0 0 0 0 Lambie Network 0 0 0 2 2 0 Independents 10 12 2 1 3 2 Total seats 151 76 ===Redistribution=== There will be a redistribution of the electoral divisions in three states before the election: New South Wales, Victoria and Western Australia. Even though Australia's population has grown, New South Wales and Victoria have too many seats over the quota, so they will both have one less seat each, while Western Australia will gain an extra seat, meaning the House of Representatives will have 150 seats instead of 151. The Northern Territory will also have a redistribution, but there will still be two seats in the Northern Territory. Queensland, South Australia, Tasmania and the Australian Capital Territory will not undergo a redistribution until after this election. ==References== Category:2020s in Australia Category:Elections in Australia Category:Future elections Australian federal election Category:May 2025 events",
 "title": "2025 Australian federal election"
}