{
 "id": "883657",
 "text": "Power Rangers Dino Charge is a TV show Power Rangers started in 2015. It aired from February 7 to December 10 2015-2016 44 episodes. It in based on the Super Sentai series Zyuden Sentai Kyoryuger. It is the sequel to Power Rangers Megaforce. A sequel to it called Power Rangers Ninja Steel started in 2017-2018. The second season, and overall 22nd season of Power Rangers, Power Rangers Dino Super Charge started in 2016. ==Plot== ===Season 1: Dino Charge=== Sixty-five million years ago, a dinosaur-like alien named Keeper was pursued through the galaxy by Sledge, an intergalactic bounty hunter bent on acquiring ten magical stones called the Energems in Keeper's care and using them to conquer the universe. Keeper crash landed on prehistoric Earth, entrusting the gems to many dinosaurs for safe-keeping and crippled Sledge's ship with a bomb that left the bounty hunter stranded in deep space. Unfortunately, Sledge's collection of asteroids held in a tractor beam accidentally rained down on prehistoric Earth and ultimately caused the extinction of dinosaurs. In the present day, Keeper is found by archaeologist Kendall Morgan and they set up a base under the Amber Beach Dinosaur Museum in the city Amber Beach. They begin a mission to find the Energems, but five have already been found by teenagers, who use them to morph into the Dino Charge Power Rangers. The group consists of the Red Ranger, Tyler Navarro, the adventurous leader of the group who is searching for his father who disappeared ten years ago on an archaeological dig; the Pink Ranger, Shelby Watkins, a waitress with a vast knowledge dinosaurs; the Blue Ranger, Koda, a cave man living in modern times as he found his Energem in his tribe's cave, and was kept in animation until the present day; the Green Ranger, Riley Griffin, the youngest of the group who is a skilled fencing swordman; and the Black Ranger, Chase Randall, the suave aid laid-back New Zealander. With these powers, the Dino Charge Power Rangers fight against Sledge, Poisandra, Fury, Wrench, Curio, and their prison full of monsters in order to find the remaining Energems and protect Earth. As time goes by, the Rangers are joined by additional teammates with additional Dino Zords: the Gold Ranger, Sir Ivan, an eight-hundred-year-old knight from Zandar who was trapped in the body of Sledge's minion Fury and the Graphite Ranger Prince Phillip III of Zandar, the modern day crown prince of Ivan's home country. Kendall takes over the position of the Purple Ranger from Albert Smith who abandons the position due to his fears of Fury's minions. New threats also merge, including the human- like villain, Heckyl. ===Season 2: Dino Super Charge=== The Ranger team gets two new members: the Aqua Ranger, who is revealed to be Tyler's long lost father James and the Silver Ranger, who is revealed to be Zenowing, a follower and apprentice of Keeper. However, with new powers come new enemies in the form of Singe, a mysterious warrior who arrives on Earth and quickly steps in as Heckyl's number two, much to Fury's anger. However, Heckyl starts to get curious when he realizes that Singe knows more about the Energems than he admits. After the Rangers discover the location of the Titano Zord, Heckyl demands to know how Singe knew its location, only for Singe to flee and return to Earth with the person who hired him named Lord Arcanon, who holds the evil Dark Energem. It was Lord Arcanon who hired Sledge to bring him the galaxy's most dangerous monsters to make an army out of them. Arcanon's reign ends with the return of Sledge who destroys his former employer with Snide (who was split from Heckyl) before Sledge betrays him and let the Rangers destroyed Snide too and takes back leadership of his crew. At that time, Heckyl regains all of his memories as a good person, which he lost from the Dark Energem. The Rangers went back in time and destroyed Sledge and his crew in the past. After their enemies' destruction, the Rangers go their separate ways of Koda and Ivan finally go back to their own times, Heckyl becomes the guardian of the Dark Energem as he and Zenowing return to Sentai 6, and Keeper returns to his home planet. The present day Rangers arrive back to their own time and find that it is a zoo and there are live dinosaurs since Sledge's asteroids never hit Earth and the extinction of the dinosaurs never came to pass. ==Characters== Actor Name Rangers Zord Number Brennan Mejia Tyler Navarro Dino Charge Red Ranger T-Rex Zord 1 James Davies Chase Randall Dino Charge Black Ranger Para Zord 2 Yoshi Sudarso Koda Dino Charge Blue Ranger Stego Zord 3 Michael Taber Riley Griffin Dino Charge Green Ranger Raptor Zord 4 Camille Hyde Shelby Watkins Dino Charge Pink Ranger Tricera Zord 5 Davi Santos Sir Ivan of Zandar Dino Charge Gold Ranger Ptera Zord 6 Rueben Turner James Navarro Dino Charge Aqua Ranger Ankylo Zord 7 Jarred Blakiston Prince Phillip III Dino Charge Graphite Ranger Pachy Zord 8 Claire Blackwelder Kendall Morgan Dino Charge Purple Ranger Plesio Zord 9 Alistair Browning Zenowing Dino Charge Silver Ranger Titano Zord 10 Ryan Carter Heckyl Dino Charge Dark Ranger Spino Zord 00 ==Cast== ===Dino Charge Rangers=== * Brennan Mejia as Tyler Navarro, the Dino Charge Red Ranger. * Camille Hyde as Shelby Watkins, the Dino Charge Pink Ranger. * Yoshi Sudarso as Koda, the Dino Charge Blue Ranger. * Michael Taber as Riley Griffin, the Dino Charge Green Ranger. * James Davies as Chase Randall, the Dino Charge Black Ranger. * Davi Santos as Sir Ivan of Zandar, the Dino Charge Gold Ranger. * Reuben Turner (portrayal) and Daniel Musgrove (voice) as James Navarro, the Dino Charge Aqua Ranger. * Jarred Blakiston as Prince Phillip III, the Dino Charge Graphite Ranger. * Claire Blackwelder as Kendall Morgan, the Dino Charge Purple Ranger. * Alistair Browning as Zenowing, the Dino Charge Silver Ranger. ===Allies=== * Richard Simpson as Keeper (voice). * Patricia Vichman as Moana. * Alexander Walker as Matt Griffin. * Mila Simons as Chloe Randall. * Elizabeth Dowden as Kaylee. * James Gaylyn as Mr. Watkins. * Campbell Cooley as Mecha Voice. * Ryan Carter as Heckyl. ===Villains=== * Adam Gardinder as the voice of Sledge. * Campbell Cooley as the voice of Snide. * Paul Harrop as the voice of Fury. * Estevez Gillespie as the voice of Wrench and Curio. * Jackie Clarke as Poisandra. * Andy Grainger as the voice of Lord Arcanon. * Mark Mitchinson as the voice of Singe. * Matt Wright as the voice of Doomwing. == References == Category:Mighty Morphin Power Rangers Category:English-language television programs",
 "title": "Power Rangers Dino Charge"
}