{
 "id": "88383",
 "text": "Assassin's Creed is an action-adventure video game developed by Ubisoft for the PlayStation 3 and Xbox 360 consoles. It was released in November 2007. A PC version of the game was released in 2008. The game started a franchise of graphic novels, comics, apparel as well as sequel games including Assassin's Creed II, Assassin's Creed: Brotherhood and more. The newest ones are Assassin's Creed: Unity and Assassin's Creed: Rogue, which were both release on November 11, 2014. ==Story summary== The story is about a bartender, Desmond Miles, who is kidnapped and placed in a machine, called an \"Animus\" (plural \"Animi\"), which reads genetic memories and puts them on a screen in 3D. Desmond is forced against his will to relive the memories of his ancestor Altaïr Ibn-La'Ahad (first name pronounced Al-ti-ear) who lived in during the Third Crusade. The player must play as Altaïr as he attempts to regain his status as a Master Assassin in the Assassin Order by taking nine Templar lives. The Assassins being the mortal enemy of the Templars who are wanting to use mind control in order to have complete control of society. The Assassins want to preserve free will, and with the gift of freedom creating tools like swords, crossbows, knives, axes, tomahawk, bow and arrow, AK-47, hidden blades, kill the Templars who oppress them with the government mind control. The Templars later own Abstergo industries. While in modern day segments the player, as Desmond, must discover who Abstergo Industries (the company who kidnapped him) is, and why the Assassin's and Templars are fighting eachother. The story focuses on finding an object called a \"Piece of Eden\" which can control other people supernaturally. ==References== ==Other websites== * Assassin's Creed UK site * Assassin's Creed US site Category:2007 video games Category:Assassin's Creed Category:Ubisoft games Category:Action-adventure games Category:Open-world video games Category:PlayStation 3 games Category:Single-player video games Category:Stealth video games Category:Video games about contract killers Category:Video games set in Italy Category:Windows games Category:Xbox 360 games Category:Xbox One games",
 "title": "Assassin's Creed"
}