{
 "id": "883887",
 "text": "The Comfort Zone is the second studio album by American singer and actress Vanessa Williams, released on August 20, 1991, by Mercury's Wing Records label. Much like her debut album, The Right Stuff (1989), The Comfort Zone features a new jack swing and R&B; sound to it, along with a dance-pop edge to its music. ==Critical reception== The Comfort Zone received mainly positive reviews from music critics and was also nominated for five Grammy Awards: Best R&B; Vocal Performance, Female for \"Runnin' Back to You\" in 1992; Best Pop Vocal Performance, Female, Record of the Year and \"Song of the Year\" for \"Save the Best for Last\" and Best R&B; Vocal Performance, Female for \"The Comfort Zone\" in 1993. ==Track listing== The tracks \"Work to Do\" and \"What Will I Tell My Heart?\" both appeared in the film Harley Davidson and the Marlboro Man; the latter also appeared on the film's soundtrack album. ==Personnel== ===Musicians=== *DJ L.A. Jay, Dr. Jam, Mark Hammond, Harvey Mason Sr. - drums *Dave Darlington, DJ L.A. Jay, Trevor Gale, Kenni Hairston, Mark Hammond, Reggie Stewart, Keith Thomas - drum programming *D.J. LA Jay, Bob Rosa, Rob Von Arx - \"beats\" *Phase 5, Bob Rosa, Rob Von Arx - samples *Greg Arnold, Derek Bramble, Merv DePyere, DJ L.A. Jay, Dr. Jam, David Frank, Trevor Gale, Kenni Hairston, Fred McFarlane, Monty Seward, Keith Thomas - keyboards *Jorgen Kaufma, Brian McKnight, Randy Waldman - piano *Stanley Clarke, Fred McFarlane, Cornelius Mims, Jimmie Lee Sloas, Keith Thomas - bass *David Frank - synthesized bass *Dann Huff, Paul Jackson, Jr., Jerry McPherson, Wah Wah Watson - guitar *Jerry McPherson - mandolin *Gerald Albright, Pete Christlieb, Mark Douthit, Thomas Haas, Scott Mayo - saxophone *Fernando Pullum - trumpet *Duane Benjamin - trombone *Hubert Laws - flute *The Nashville String Machine - strings *Horns arranged by Scott Mayo *Strings arranged by Keith Thomas *Debbie Cole, Dres, Lori Fulton, Vicki Hampton, Kipper Jones, Valerie Mayo, Donna McElroy, Rick Nelson, Tata Vega - backing vocals *Vocals arranged by Gerry Brown, Kipper Jones, Brian McKnight, Mark Stevens, Keith Thomas and Vanessa Williams ===Technical=== *Produced by Vanessa Williams (also executive), Ed Eckstine (executive), Keith Thomas, Brian McKnight, Kenni Hairston, Derek Bramble, Gerry Brown, Bruce Carbone, Dave Darlington, DJ L.A. Jay, Kipper Jones, Phase 5, Mark Stevens and Reggie Stewart *Engineers – Derek Bramble, Claude Demers, Joe Schiff, Will Schillinger, Allen Sides, Kieran Walsh, Matt Wells, Gerry Brown *Assistant engineers – Steve Charles, Foley, Roy Gamble, Marty Lester, Todd Moore, Gary Paczosa, Mike Piersante, Brian Soucey *Mixing – Gerry Brown, Bruce Carbone, Dave Darlington, Humberto Gatica, Bill Whittington, Vanessa L. Williams *Mix assistants – Jeff Gledt, John Kunz, John David Parker, Brian Soucey *Mastering – Herb Powers ==Charts== ===Weekly charts=== Weekly chart performance for The Comfort Zone Chart (1992) Peak position ===Year-end charts=== 1991 year-end chart performance for The Comfort Zone Chart (1991) Position US Top R&B;/Hip-Hop Albums (Billboard) 85 1992 year-end chart performance for The Comfort Zone Chart (1992) Position US Billboard 200 45 US Top R&B;/Hip-Hop Albums (Billboard) 6 ==Certifications== } ==Related pages== * List of Billboard number-one R&B; albums of 1992 ==References== Category:1991 albums Category:Vanessa Williams albums Category:Dance-pop albums Category:New jack swing albums Category:R&B; albums",
 "title": "The Comfort Zone (album)"
}