{
 "id": "884284",
 "text": "The 2013 UEFA European Under-19 Championship was the 12th edition of the UEFA European Under-19 Championship, since its C from an under-18 tournament in 2002, and the 62nd since the tournament was created in 1948. It was hosted in Lithuania from 20 July to 1 August 2013, in three cities. Only players born after 1 January 1994 were available to participate. The qualification matches began in September 2012 and ended in June 2013, with seven teams joining the Lithuanian hosts in the final tournament. Spain were the two-time defending champions, after defeating Greece in the final of the previous edition, but were eliminated and defeated by France in the semi-finals. In the final, France were beaten 1–0 by Serbia. ==Venues and stadiums== The final round matches were held in three stadium venues located in three Lithuanian cities: Stadium Location Capacity Matches Ref Alytus Stadium Alytus 3,748 4 group matches and 1 semi-final Darius and Girėnas Stadium Kaunas 9,280 4 group matches and 1 semi-final ARVI Football Arena Marijampolė 6,250 4 group matches and the final ==Qualification== Qualification for the final tournament occurred in two phases: a qualifying round and an elite round. During these rounds, 51 national teams competed to determine the seven teams that would join the automatically qualified host nation, Lithuania. The qualifying round was played between 26 September and 26 November 2012, following a draw that took place on 29 November 2011 at the UEFA headquarters in Nyon, Switzerland. According to the UEFA under-19 national team coefficient ranking, the top three teams – Spain, Serbia and Turkey – were given a bye to the elite round, whereas the remaining 48 teams were divided into two pots and drawn into 12 groups of four teams. Each group included two teams from both pots and was contested as a round-robin tournament, hosted in the country of one of the teams. The group winners and runners-up, along with the best third- placed team, qualified for the next round. The elite round was played between 22 May and 11 June 2012 and was contested by the 25 teams advancing from the qualifying round plus the three teams which received byes. The draw took place on 5 December 2012 at the UEFA headquarters and allocated the 28 teams – previously arranged into four seeding pots according to their qualifying round coefficient (teams with bye were automatically seeded in the first pot) – into seven groups of four. Each group was contested similarly to the qualifying round, with the seven group winners securing qualification for the final tournament. ===Qualified teams=== The following eight teams qualified for the final tournament: Country Qualified as Previous appearances in final tournament1 only U-19 era (since 2002) Hosts 0 (debut) Winner of Group 1 6 (2003, 2005, 2007, 2009, 2010, 2012) Winner of Group 2 5 (20052, 2007, 2009, 2011, 2012) Winner of Group 3 5 (2003, 2006, 2007, 2010, 2012) Winner of Group 4 9 (2002, 2004, 2006, 2007, 2008, 2009, 2010, 2011, 2012) Winner of Group 5 1 (2010) Winner of Group 6 0 (debut) Winner of Group 7 4 (2004, 2006, 2009, 2011) : 1 Bold indicates champion for that year. Italic indicates host for that year. : 2 As Serbia and Montenegro ==Match officials== UEFA named six referees and eight assistant referees to officiate matches at the final tournament. Additionally, two referees from the host nation were chosen as fourth officials. ;Referees * Aleksei Kulbakov (Belarus) * Emir Alečković (Bosnia and Herzegovina) * Michael Oliver (England) * Felix Zwayer (Germany) * Orel Grinfeld (Israel) * Martin Strömbergsson (Sweden) ;Assistant referees * Mubariz Hashimov (Azerbaijan) * Dermot Broughton (Ireland) * Stelios Nikita (Cyprus) * Derya Oguz (Denmark) * Michael Karsiotis (Greece) * Mitchell Scerri (Malta) * Nikola Razić (Montenegro) * Leif Erik Opland (Norway) ;Fourth officials * Gediminas Mažeika (Lithuania) * Sergejus Slyva (Lithuania) ==Squads== ==Group stage== The draw for the group stage was held on 14 June 2013 in Kaunas, at the Town Hall, and was run by the UEFA Youth and Amateur Football Committee chairman, Jim Boyce, who was assisted by final tournament ambassadors Vaida Česnauskienė and Marius Stankevičius. The eight finalists were drawn into two groups of four teams and played matches against each other in a round-robin system. The top two teams from each group advanced to the semi-finals. If two or more teams are equal on points on completion of the group matches, the following tie-breaking criteria are applied: # Higher number of points obtained in the matches played between the teams in question; # Superior goal difference resulting from the matches played between the teams in question; # Higher number of goals scored in the matches played between the teams in question; # If two teams are still tied after criteria 1–3 have been applied, the criteria are reapplied on those teams. If the tie is not broken, criteria 5–8 are applied; # Superior goal difference in all group matches; # Higher number of goals scored in all group matches; # Fair play conduct of the teams (final tournament); # Drawing of lots. If two teams are tied after having met in the last round of the group stage, their final ranking is determined instead by a penalty shoot-out. This method is only valid when determining which team qualifies for the next round or for another competition. All times are in Eastern European Summer Time (UTC+03:00). ===Group A=== \\---- \\---- ===Group B=== \\---- \\---- ==Knockout stage== ===Bracket=== {{Round4 |29 July – Alytus| (p)|2 (3)|| 2 (2) |29 July – Kaunas|| 1| | 2 |1 August – Marijampolė|| 1|| 0}} ===Semifinals=== \\---- ===Final=== ==Goalscorers== ;3 goals * Anass Achahbar * Gratas Sirgėdas * Alexandre Guedes ;2 goals * Yassine Benzia * Adrien Hunou * Rai Vloet * Andrija Luković * Iker Hernández * Sandro Ramírez * Okan Deniz * Recep Niyaz ;1 goal * Antoine Conte * Avto Endeladze * Nika Kacharava * Lukas Artimavičius * Mimoun Mahi * Tobias Figueiredo * Ricardo Horta * Rony Lopes * Carlos Mané * Bernardo Silva * Leandro Silva * Uroš Đurđević * Mijat Gaćinović * Dejan Meleg * Aleksandar Mitrović * Marko Pavlovski * José Rodríguez * Álvaro Vadillo * Fede Vico * Enver Cenk Şahin * İbrahim Yılmaz ;Own goals * Džiugas Petrauskas (against Portugal) ==Awards== * Golden Player: Aleksandar Mitrović * Golden Boot: Gratas Sirgėdas, Anass Achahbar, Alexandre Guedes Name Goals Scored Assists Minutes played Gratas Sirgėdas 3 0 141 Anass Achahbar 3 0 255 Alexandre Guedes 3 0 390 ===Team of the Tournament=== After the final, the UEFA technical team selected 23 players to integrate the \"team of the tournament\". ;Goalkeepers * Bacho Mikava * Predrag Rajković * Alfonso Herrero ;Defenders * Antoine Conte * Aymeric Laporte * Tobias Figueiredo * Rafa * Miloš Veljković * Héctor Bellerín * Borja López ;Midfielders * Anthony Martial * Adrien Rabiot * Bilal Başaçıkoğlu * Rai Vloet * Bernardo Silva * Marko Pavlovski * José Rodríguez * Álvaro Vadillo * Recep Niyaz ;Forwards * Yassine Benzia * Gratas Sirgėdas * Hélder Costa * Aleksandar Mitrović ==Notes== ==References== ==Other websites== * UEFA.com Category:2013 in association football Category:2013 in Europe Category:History of Lithuania Category:Sport in Lithuania Category:July 2013 events Category:August 2013 events Category:UEFA European Under-19 Championship",
 "title": "2013 UEFA European Under-19 Championship"
}