{
 "id": "884322",
 "text": "Milena Morena Tartagni (born 21 September 1949 Predappio) is an Italian road and track cyclist. At the Road World Championships she won three medals, two silvers and one bronze. She won ten national titles, two on the road and eight on the track. == Life == She moved to Bollate, Milan, together with her family. In 1965, she joined the Gruppo Sportivo Pregnanese. She began training immediately with coaches Enrico Zenaboni, and Alfredo Bonariva. In 1966, she won her first \"international\" races in Prato and Adria (Rovigo). These victories allowed her to wear the blue jersey of the national team for the first time at the Nürburgring World Championships in Germany, where she was the youngest participant. In 1967, she won seven road victories, as well as a second place in the National Elite Road Championship. She won her first Italian track pursuit title in Lanciano. In 1968, she participated in the world championships held in Imola, and placed third. She won the Italian championships on the road and on the track (pursuit and speed). Also, she set a world record for 3 km on track at the Olympic Velodrome in Rome with a time of 4'09 \"3. In 1969, she was confirmed Italian champion on the road and on the track. She competed in 34 races and won 11. She began to compete abroad. In 1970, at the Road World Championships in Leicester, she finished second behind the Soviet Anna Konkina. Also in 1970, she won the national track championships and came in second at the national road championships. In 1971, again at the world championships held in Mendrisio, she came second again. She won the national road race, as well as finished in second place at the national track pursuit championships.. In 1972, in Bassano del Grappa, she won the title of speed and that of the pursuit, while she was third on the road. She was second on the road in 1973. In 1974, she won the Giro of Varese, and finished third in the road championships. In 1976, he won the Alfredo Binda Trophy in Cittiglio. In 1980, she retired, after more than 100 victories (including ten national titles), continuing to deal with cycling and working within the Italian Cycling Federation. Since April 2014 she holds, within the council of the Municipality of Senago, the position of Councilor for sports and leisure, youth and labor policies. == References == == Other websites == * Morena Tartagni – Foto F.OSSOLA | Cyclinside.it Category:1949 births Category:Italian cyclists Category:Living people",
 "title": "Morena Tartagni"
}