{
 "id": "885002",
 "text": "A unit of time or midst unit is any particular time interval, used as a standard way of measuring or expressing duration. The base unit of time in the International System of Units (SI) and by extension most of the Western world, is the second, defined as about 9 billion oscillations of the caesium atom. Note: The light-year is not a unit of time, but a unit of length of about 9.5 petametres (9 454 254 955 488 kilometers). ==List== Unit Length, Duration and Size Notes Planck time The amount of time light takes to travel one Planck length. yoctosecond One septillionth of a second. jiffy (physics) The amount of time light takes to travel one fermi (about the size of a nucleon) in a vacuum. zeptosecond One sextillionth of a second. Time measurement scale of the NIST strontium atomic clock. Smallest fragment of time currently measurable is 247 zeptoseconds. attosecond One quintillionth of a second. femtosecond One quadrillionth of a second. Pulse time on fastest lasers. svedberg Time unit used for sedimentation rates (usually of proteins). picosecond One trillionth of a second. nanosecond One billionth of a second. Time for molecules to fluoresce. shake 10 nanoseconds, also a casual term for a short period of time. microsecond One millionth of a second. Symbol is µs centimillisecond One hundred thousandth of a second or one hundredth of a millisecond. decimillisecond One ten-thousandth of a second or one tenth of a millisecond. millisecond One thousandth of a second. Shortest time unit used on stopwatches. centisecond One hundredth of a second. jiffy (electronics) or Used to measure the time between alternating power cycles. Also a casual term for a short period of time. decisecond One tenth of a second. quadrisecond / semisemisecond One quarter of a second. semisecond / half second One half of a second. second SI Base unit. decasecond half a minute It’s known by math. minute milliday Also marketed as a \".beat\" by the Swatch corporation; Milliday is a more accurate name. moment ( on average) Medieval unit of time used by astronomers to compute astronomical movements, length varies with the season. hectosecond 1 minute and 40 seconds ke 14 minutes and 24 seconds kilosecond 16 minutes and 40 seconds half an hour It’s known by math. hour decakilosecond Ten thousand seconds or ten kiloseconds. Half an day Its known by math. day Longest unit used on stopwatches and countdowns. hectokilosecond One hundred thousand seconds or one hundred kiloseconds. week Also called \"sennight\". megasecond 277.777778333333 hours or about 1 week and 4.6 days. fortnight 14 days lunar month Various definitions of lunar month exist. month 28-31 days Occasionally calculated as 30 days. quarter and season quadrimester semester A division of the academic year. Literally \"six months\", also used in this sense. half year lunar year year common year 52 weeks and 1 day. tropical year , Extract of page 18 Average. Gregorian year Average. sidereal year leap year and biennium triennium quadrennium olympiad lustrum decade indiction gigasecond 16,666,666.6667 minutes or about 31.7 years. jubilee century millennium Also called \"kiloannum\". terasecond About 31,709 years. megaannum Also called \"Megayear.\" 1,000 millennia (plural of millennium), or 1 million years. petasecond About 31,709,791 years. galactic year The amount of time it takes the Solar System to orbit the center of the Milky Way Galaxy one time. Around 230,000,000 years. cosmological decade varies 10 times the length of the previous cosmological decade, with CÐ 1 beginning either 10 seconds or 10 years after the Big Bang, depending on the definition. gigaannum Also refers to an indefinite period of time, otherwise is 1,000,000,000 years. exasecond About 31,709,791,983 years. zettasecond About 31,709,791,983,764 years. yottasecond About 31,709,791,983,764,584 years. Age of universe 13700000000years Roughly 4.35 yottaseconds ==References== Category:Units of time",
 "title": "Unit of time"
}