{
 "id": "885037",
 "text": "Reginald Fleming Johnston ( Edinburgh, 13 October, 1874 - ibid., 6 March, 1938) was a British academic and diplomat, he was too the tutor and an advisor of the last emperor of China, Puyi. He was also the colonial governor of Weihaiwei. == Biography == He was born in the Scottish city of Edinburgh in 1874, he had higher studies at the University of Edinburgh and later at the Magdalen College, Oxford. In 1898 he entered to the colonial service and started to work for the British administration in Hong Kong. At this time he learned Chinese. After being stationed for a time in Hong Kong, in 1906 Johnston was transferred as a district officer to the British concession of Weihaiwei, a territory placed on the Shandong peninsula. In Weihaiwei he was under the command of Commissioner James Stewart Lockhart, who became into a close friend to Johnston. His work was very well received by the local people. In October 1918, he was offered to be the guardian of the young Puyi, the overthroned Chinese emperor who still continued living in the Forbidden City of Beijing as a non-sovereign monarch. Johnston accepted the offer and at the end of 1918 he moved to the Chinese capital, becoming the new imperial guardian. During the following years he had a great influence on Puyi, to whom he showed the western culture - something significant, considering the reactionary and ultra-conservative atmosphere of the imperial Court. At the request of the emperor about possible Western names for himself and some of his companions, it was Johnston himself who recommended a Western name - Henry. At this time, Johnston and Isabel Ingram - a daughter of an American missionary and the guardian of Empress Wan Rong - were the only foreigners allowed to be inside the court of the Qing dynasty in its entire history. Another of Puyi's tutors was the Chinese career official Zheng Xiaoxu, who was a lot of esteemed by Johnston. There was mutual respect between the this two people, and Zheng even recommended to Puyi that Johnston be imperial commissioner for the Summer Palace. By initiative of Jhonston, the Summer Palace was visited for the first time by Puyi and became an occasional residence that made it possible to break the cloister of the Forbidden City. But, this all ended in 1924, when Puyi and his family were expelled from the Forbidden City. Johnston went back to the colonial service. In 1927 he was designated the commissioner of the concession of Weihaiwei, a position that he had until the 1930s. On that date the territory was returned to China. He moved to the United Kingdom, and in 1931 he was designated Professor of Chinese at the School of Oriental Studies at the University of London. Despite his extensive experience about China, he did not adapt well to the university environment. He retired in 1937. The ex-tutor continued maintaining contact with Puyi, even when he was established by the Japanese as emperor of the puppet state of Manchukuo. Johnston bought the small Scottish island of Eilean Rìgh, where he set up his home with Chinese-style gardens and even hoisted a Manchukuo flag. He died in 1938, without having gotten married. For his own decision, almost all of his letters and texts were burned after his death. == Works == * —— (1905). Remarks on the Province of Shantung. Cornell University Library. * —— (1908). From Peking to Mandalay: A Journey from North China to Burma Through Tibetan Ssuch'uan and Yunnan. Soul Care Publishing. * —— (1910). Lion and Dragon in Northern China. Nabu Press. * —— (1911). A Chinese Appeal to Christendom Concerning Christian Missions. Nabu Press. * —— (1913). Buddhist China. Soul Care Publishing. * —— (1918). Letters to a Missionary. Cornell University Library. * —— (1921). The Chinese Drama. Kelly and Walsh. * —— (1934). Twilight in The Forbidden City. Soul Care Publishing. * —— (1935). Confucianism and Modern China. Soul Care Publishing. * == References == ==Further reading== *Shiona Airlie, Reginald Johnston, 2001. *Robert Bickers, \"Coolie work: Sir Reginald Johnston at the School of Oriental Studies, 1931-1937\", Journal of the Royal Asiatic Society, Series III, 5, 3 pp. 385–401.(November, 1995) JSTOR, www.jstor.org/stable/25183064 *Raymond Lamont- Brown, Tutor to the Dragon Emperor: The Life of Sir Reginald Fleming Johnston, 1999. *Shiona Airlie, Scottish Mandarin: The Life and Times of Sir Reginald Fleming Johnston,Royal Asiatic Society, 2012. Category:Knights Commander of the Order of St Michael and St George Category:Commanders of the Order of the British Empire Category:British diplomats Category:Academics of the University of London",
 "title": "Reginald Johnston"
}