{
 "id": "885030",
 "text": "My Life as a Teenage Robot, also referred to as simply Teenage Robot or MLaaTR, is a 2002 American animated comedy television series. It was created by Rob Renzetti for Nickelodeon. It was produced by Frederator Studios in association with Nickelodeon Animation Studios. == Characters == * Jenny Wakeman (voiced by Janice Kawaye) is the main protagonist and titular crime- fighting teenage robot. * Nora Wakeman (voiced by Candi Milo) is Jenny's mother and creator. * Brad Carbunkle (voiced by Chad Doreck) is Jenny's best friend and next-door neighbor. * Tuck Carbunkle (voiced by Audrey Wasilewski) - Brad's 8-year-old little brother. * Sheldon Lee (voiced by Quinton Flynn) == Overview == Set in the fictional town of Tremorton, My Life as a Teenage Robot (2002 - 2006) follows the adventures of a teenage robot girl named Jenny Wakeman (a.k.a. XJ-9), who was created by her mother Dr. Nora Wakeman and designed to protect Earth, while also striving to live the life of a normal teenage girl. The show focuses on making lighthearted fun of typical teenage problems and other conventions of the teenage and superhero lives, with a blend of action and comedy sequences. Despite critical success, My Life as a Teenage Robot was a ratings disappointment. Season 3 aired in the United States as \"never before seen episodes\" on Nicktoons Network between 2008 and 2009, three years after their initial production and premiering in other countries. The series is distributed outside in some countries by the Canadian animation studio, Nelvana Limited. The entire series is available on iTunes, Amazon DVD, and was available on Paramount+ from 2021 to 2024. My Life as a Teenage Robot received mostly positive reviews from critics, being nominated for numerous awards, most prominently one Primetime Emmy Award and eleven Annie Awards. == Episodes == List of My Life as a Teenage Robot episodes Season Episodes Segments Year(s) produced Premiere (Worldwide) Finale (Worldwide) Premiere (USA) Finale (USA) 1 13 26 2002 October 18, 2002 February 23, 2003 August 1, 2003 February 27, 2004 2 23 2004 - 2005 September 17, 2004 N/A December 8, 2004 September 9, 2005 3 26 2005 - 2006 November 6, 2005 June 16, 2006 October 4, 2008 May 2, 2009 == Production == The pilot, My Neighbor Was A Teenage Robot, was produced in 1998 for Oh Yeah! Cartoons and premiered on Nickelodeon in the United States on December 4, 1999. === Season 1 === After the success of the Oh Yeah Cartoons! pilot short, \"My Neighbor Was A Teenage Robot\" (produced in 1998 and aired on Nickelodeon in 1999), Nickelodeon announced a full half-hour series in early 2002. Creator Rob Renzetti joined Frederator Studios to produce the series. The series entered pre-production in 2001, and production of the first season officially commenced in March of 2002, and wrapped in late November 2002 with the completion of \"The Wonderful World of Wizzly\" and \"Call Hating.\" \"Unlicensed Flying Object\" was the first script written for the series in March of 2002. Despite \"It Came From Next Door\" chronologically being the first episode, it is basically a remake of the pilot and the decision to write it into an episode was made after the scripts for \"Unlicensed Flying Object\", \"Raggedy Android\", and \"The Boy Who Cried Robot\" were written, thus making \"It Came From Next Door\" the fourth script written for the series. Writing of the season was completed in August 2002 with the final draft of \"Saved by the Shell.\" After passing the storyboard and animatic phase, episodes were shipped overseas to the Seoul-based Rough Draft Korea animation studio, where color and animation were added to the episodes. This phase of the first season's production lasted until November 2002, and post-production wrapped later that month. Rob Renzetti thought of many different styles for the series before finally settling with the Art Deco and anime-inspired aesthetics that the show is known for. The episode \"Raggedy Android\" was the first episode storyboarded, and was handled mostly by Renzetti himself. This can be seen in the episode as the fairgoers are drawn in a variety of different art styles that were exclusive to that particular episode. After \"Raggedy Android\", the series' style was finalized as Renzetti and co. found their footing. === Season 2 === The high ratings of season 1 led Nickelodeon to renew the series for a second season in late 2003, and the season entered production in early 2004. Jenny was given a slight redesign for the second season, which was used for the remainder of the series. Her eyes have become more rounded and she is now slightly taller. Production of season 2 continued through the rest of 2004 and into early 2005. With the completion of \"Escape From Cluster Prime\", production wrapped in March 2005. Near the end of the season's production cycle, a third season was ordered, which entered production as season 2 was wrapping up. === Season 3 === Although this final season was produced between 2005 and 2006, it never aired in its home country, the United States, until October 2008 to May 2009. This is probably due to the fact that the series was cancelled in 2005, shortly after the end of the second season. However, the entire season aired in foreign countries such as the United Kingdom, Japan and Germany between 2005 and 2007, before reaching the United States. Pre- production of season 3 commenced at the beginning of 2005, with the first episode written being \"There's No Place Like Homeschool.\" The first half of the season (\"Weapons of Mass Distraction\" through \"Good Old Sheldon\") was produced in 2005, while the second half (\"Infectious Personality\" through \"Turncoats\") was produced in 2006. With the completion of the episodes \"Samurai Vac\" and \"Turncoats\" on April 14, 2006, the series officially ceased production following its 2005 cancellation. == Airing == === Season 1 === Unlike most other Nicktoons, My Life as a Teenage Robot actually premiered internationally. The series premiered in Australia with the first episodes, \"It Came From Next Door\" and \"Pest Control\", on October 18, 2002, the United Kingdom on November 3, 2002, and Mexico on February 7, 2003, before finally debuting in the United States on August 1. By the time the series had its American premiere, the first season had already finished airing in the United Kingdom, and 11 of the season's 13 half-hour episodes had aired in Australia, as well as 10 in Mexico. Most of the first season aired in the United States in late 2003, with the last few episodes being delayed to early 2004, ending on February 27 with \"The Wonderful World of Wizzly\" and \"Call Hating\", a full year after their worldwide premiere in the United Kingdom. By this time, season 2 was already in production. Each individual episode debuted in the United States more than a full year (August 2003 to February 2004) after it was ready to air (July 2002 to November 2002). This would become all too common later in the series' run, and starting in season 2, coupled with the additional issue of episodes premiering in America out of their intended order. This came to a head in season 3, which didn't air in the United States for three years (2008 - 2009) after initial production and their worldwide premieres. It is unknown why the American premiere was delayed to August 2003 when the entire first season was ready to air in 2002, though it could be that Nickelodeon felt that the show was too edgy to air in 2002, so soon after the September 11, 2001 terrorist attacks in New York City. === Season 2 === The season was meant to premiere in the United States on October 1, 2004 with \"Victim of Fashion\", airing in its intended order. However, decisions by the network caused the premiere to be delayed to December with \"A Robot For All Seasons\" and the episodes to air out of order. Like the first season, season 2 premiered in Australia first, with \"Victim of Fashion\" on September 17, 2004. The same episode also first aired in Canada on October 4, beginning the season's run in that country ahead of the United States as well. The season also premiered in the United Kingdom ahead of the United States, on October 31. By the time season 2 premiered in the United States on December 8, 2004, half of the season had already aired in Australia and the United Kingdom. After airing \"A Robot For All Seasons\" in December, five more half-hour episodes were burned out in the United States the week of January 24-28, 2005. After that, one more episode pairing aired in March, and another in June, before the season finale \"Escape from Cluster Prime\" on August 12. Despite this, several more episodes produced before \"Escape From Cluster Prime\" were delayed until September in the United States, including \"Victim of Fashion\", the first episode produced for the season. This causes several continuity errors when viewed in American airing order, for example the episode \"Designing Women\", which was produced well before \"Escape From Cluster Prime\", but aired in the United States after the fact. By the time the second season finished its run in the United States on September 9, production of the third season was already well underway. === Season 3 === Perhaps the most infamous and well-known delay of My Life as a Teenage Robot is that the third and final season aired in the United States three years after it was produced (from 2008 to 2009), as well as airing in a large number of countries before its own. Episodes were leaked in the United States throughout 2006 and 2007 thanks to said international premieres, often being ripped on websites like The Pirate Bay. The season had its world premiere in the United Kingdom on November 6, 2005, followed by Australia and Canada in December 2005, Japan in January 2006, Mexico in April 2006, and Germany in September 2006. The season, and thus the series, ended its run in Australia on June 16, 2006 with the final episodes \"Samurai Vac\" and \"Turncoats\", in Australia the following month, Germany in October 2006, Mexico in November, followed by Japan and Canada in 2007. The season first aired in the United States on October 4, 2008 with the episodes \"Weapons of Mass Distraction\" and \"There's No Place Like Home School\", and finished airing on May 2, 2009 with \"Samurai Vac\" and \"Turncoats\", thus officially ending the series' run in its home country. This final episode pairing didn't air on Nickelodeon, instead airing on its sister network, Nicktoons. The season aired in the United States three years after it was produced and aired in other countries. == Reception == My Life as a Teenage Robot received a generally positive reception from critics and the general public. As of June 2018, it holds a 7.0/10 rating on the Internet Movie Database and an 8.2/10 rating on TV.com. == Animation note == The font used for the title card, and for the end credits is ITC Anna. However, the letters A, B, E, H, K and R were modified. == Availability == On December 12, 2011, all three seasons of My Life as a Teenage Robot were released on DVD at Amazon CreateSpace, and later eBay. Escape from Cluster Prime is absent from the season 2 DVD, however it is on the season 3 DVD. On February 5, 2012, Magna Home Entertainment released all three seasons of My Life as a Teenage Robot as a single DVD set in Australia. Until 2021, the full series was available for streaming on Hulu. From 2021 to 2024, it was available on Paramount+. == References == == Other websites == * Category:2002 American television series debuts Category:2006 American television series endings Category:Nicktoons Category:English-language television programs Category:Children's animated television series Category:American anthropologists Category:Traditional animation Category:Nickelodeon television series Category:Nickelodeon Category:2000s American children's television series Category:2000s American animated television series",
 "title": "My Life as a Teenage Robot"
}