{
 "id": "885027",
 "text": "German art has a tradition of the visual arts. Examples have been found from as early as the Venus of Hohle Fels; Research shows that it is from between 40,000 and 35,000 years ago, The archeological finds of Bronze Age gold hats, have Germany in its center; The same goes for the \"central\" form of Urnfield culture, and Hallstatt culture. VenusHohlefels2.jpg|Venus of Hohle Fels Goldblechkegel von Ezelsdorf-Buch - 1 - Spitze.JPG|The top part of the gold hat from Ezelsdorf/Buch ==Middle Ages== German art from the Middle Ages begins with the Frankish Empire of Charlemagne (d. 814), the first state to rule the majority of the modern territory of Germany, as well as France and much of Italy. Of Carolingian art, there were a small number of objects. The most common type of object to survive is the illuminated manuscript; Wall paintings were common but, like the buildings that they were in, they have nearly all disappeared. ==Renaissance painting and prints== Printmaking by woodcut and engraving was already more developed in Germany and the Low Countries than anywhere else, and the Germans took the lead in developing book illustrations. The woodblocks were often (on loan, or) lent to printers of editions in other cities or languages. The greatest artist of the German Renaissance, Albrecht Dürer, began his career as an apprentice to a leading workshop in Nuremberg, that of Michael Wolgemut, who had largely gone away from painting so that he instead could work with [and profit] from the new medium. Dürer worked on the book, the Nuremberg Chronicle, published by his godfather Anton Koberger, Europe's largest printer-publisher at the time.Bartrum (2002) The making of the Isenheim Altarpiece, ended in 1515; It was made by Matthias Grünewald; It is widely looked at as the greatest German Renaissance painting. The piece has Renaissance principles of composition; the work is in the Gothic form of a multi-winged triptych.Snyder, Ch. XVII The art movement, the Danube school of painting started with a [group of, or a] circle of artists during the first third of the 16th century in Bavaria and Austria, including Albrecht Altdorfer, Wolf Huber and Augustin Hirschvogel. With Altdorfer at the front, the movement made the first examples of independent landscape art in the West (nearly 1,000 years after China), in both paintings and prints.Wood, 9 – this is the main subject of the whole book Their religious paintings had an expressionist style somewhat similar to Grünewald's. Dürer's pupils Hans Burgkmair and Hans Baldung Grien worked largely in prints, and Baldung kept working on the subject of witches, in a number of prints.Snyder, Ch. XVII, Bartrum, 1995 ===Sculpture=== In Catholic parts of South Germany the Gothic tradition of wood carving continued to [its popularity, and to] flourish until the end of the 18th century. Veit Stoss (d. 1533), Tilman Riemenschneider (d.1531) and Peter Vischer the Elder (d. 1529) were Dürer's contemporaries, and their long careers covered the transition between the Gothic and Renaissance periods; Their ornament often stayed Gothic even after their compositions began to show Renaissance principles.Snyder, 298–311 Two and a half centuries later, Johann Joseph Christian and Ignaz Günther were leading masters in the late Baroque period, both dying in the late 1770s, almost a decade before the French Revolution. Famous work on German Baroque interiors came from the Wessobrunner School, a later term for the stuccoists of the late 17th and 18th centuries. Another result of German skill in working on sculptures, was in porcelain; The most famous modeller is Johann Joachim Kaendler of the Meissen factory in Dresden, but the best work of Franz Anton Bustelli for the Nymphenburg Porcelain Manufactory in Munich is often considered the greatest achievement of 18th-century porcelain.Savage, 156 ==17th to 19th-century painting== ===Baroque, Rococo and Neoclassicism=== Baroque painting was slow to arrive in Germany, with very little before about 1650. The period remains little-known outside Germany, and though it \"never made any claim to be among the great schools of painting\", its neglect by non- German art history remains striking.Griffiths & Carey, 24 (quotation), and Scheyer, 9 (from 1960, but the point remains valid) Many foreign painters spent time working in Germany for princes, among them Bernardo Bellotto in Dresden, and Gianbattista Tiepolo, who spent three years painting the Würzburg Residence with his son. Many German painters worked abroad, including Johann Liss who worked mainly in Venice, Joachim von Sandrart and Ludolf Bakhuisen, the leading marine artist of the final years of Dutch Golden Age painting. In the late 18th century the portraitist Heinrich Füger and his pupil Johann Peter Krafft, whose best known works are three large murals in the Hofburg, had both moved to Vienna as students and stayed there.Novotny, 62–65 Early artists of Neoclassicism in Germany were Anton Raphael Mengs (d. 1779), the Danish painter Asmus Jacob Carstens (d. 1798), and the sculptor Gottfried Schadow (d. 1850). Mengs was one of the most highly regarded artists of his day, working in Rome, Madrid and elsewhere, and finding an early Neo-Classical style. Carstens' shorter career was turbulent and troubled, leaving a trail of unfinished works, but through pupils and friends such as Gottlieb Schick, Joseph Anton Koch and Bonaventura Genelli, more influential.Novotny, 49–59 Koch was born in the mountains of the Austrian Tyrol and became the leading Continental painter of landscapes, concentrating on mountain views, despite spending much of his career in Rome. ===Romanticism and the Nazarenes=== From the German Romanticism, Caspar David Friedrich is well-known outside Germany. Other noted artists are Philipp Otto Runge, who like Friedrich had trained at the Copenhagen Academy and was forgotten after his death until a revival in the 20th century. Friedrich painted almost entirely landscapes, with a distinctive Northern feel, and always a feeling of quasi-religious stillness. Often his figures are seen from behind – they like the viewer are lost in contemplation of the landscape.Novotny, 95–101 Runge's portraits, mostly of his own circle, are naturalistic except for his huge-faced children, but the other works in his brief career increasingly reflected a visionary pantheism.Novotny, 106–112 Adrian Ludwig Richter is mainly remembered for his portraits, and Carl Wilhelm Kolbe was an etcher, whose later prints show figures almost swallowed up by gigantic vegetation.Griffiths and Carey, 112–122 The Nazarene movement started with a group of early 19th-century German Romantic painters who had a goal to revive honesty and spirituality in Christian art. The principal motivation of the Nazarenes was a reaction against Neoclassicism and the routine art education of the academy system. They rejected what they saw as the superficial virtuosity of later art. Their programme (had similarities with, or) was not dissimilar to that of the English Pre-Raphaelite Brotherhood in the 1850s, although the core group took it as far as wearing pseudo-medieval clothing. In 1810 Johann Friedrich Overbeck, Franz Pforr, Ludwig Vogel and the Swiss Johann Konrad Hottinger moved to Rome, where they occupied the abandoned monastery of San Isidoro. They were joined by Philipp Veit, Peter von Cornelius, Julius Schnorr von Carolsfeld, Friedrich Wilhelm Schadow and a loose grouping of other German artists. They met up with the Austrian romantic landscape artist Joseph Anton Koch, (d. 1839) who became an unofficial tutor to the group. In 1827 they were joined by Joseph von Führich, and Eberhard Wächter was later associated with the group. Unlike the strong support given to the Pre-Raphaelites by the dominant art critic of the day, John Ruskin, Goethe was dismissive of (or did not agree with,) the Nazarenes: \"This is the first case in the history of art when real talents have taken the fancy to form themselves backwards by retreating into their mother's womb, and thus found a new epoch in art.\"Griffiths & Carey, 24–25 and passim, quotation from p. 24 The art movement, Düsseldorf school of painting, was a group of artists who painted mostly landscapes, and who studied at, or were influenced by the Düsseldorf Academy. The academy's influence grew in the 1830s and 1840s, while the painter Wilhelm von Schadow was chief;Schadow and his students \"bildeten den Krystallisationspunkt, um den sich in späteren Jahren die Düsseldorfer Schule anlegte\". Wolfgang Müller von Königswinter: Düsseldorfer Künstler aus den letzten fünfundzwanzig Jahren. Leipzig, 1854, S. 1 It had many American students, several of whom got connected with the Hudson River School.John K. Howat: American Paradise: The World of the Hudson River School, S. 311 ===Naturalism and beyond=== Biedermeier is a style in literature, music, the visual arts and interior design. It started in the time period between the end of the Napoleonic Wars in 1815 and the revolutions of 1848. Biedermeier art was interesting for the rich middle classes; This realism in art, often [held high, or] celebrated domestic virtues, and came to dominate over French- leaning tastes of the aristocracy, as well as the yearnings of Romanticism. Carl Spitzweg was a leading German artist in the style.Doyle, Margaret, in Encyclopedia of the Romantic Era, 1760–1850, Volume 1, ed. Christopher John Murray, p. 89, Taylor & Francis, 2004 Adolph Menzel followed the development of early Impressionism to create a style that he used for depicting grand public occasions, among other subjects like his Studio Wall. Karl von Piloty was a leading academic painter of history subjects who did teaching at in Munich; Among his more famous pupils were Hans Makart, Franz von Lenbach, Franz Defregger, Gabriel von Max and Eduard von Grützner. \"Munich school\" is used about both of German and of Greek painting, after Greeks like Georgios Jakobides studied under him. . Piloty's most influential pupil was Wilhelm Leibl. Being the head of the so called Leibl-Circle, an informal group of artists with a non-academic approach to art, he did important work on Realism in Germany.Wilhelm Leibl. The art of seeing, Kunsthaus Zürich, 2019 The Berlin Secession was a group started in 1898 by painters including Max Liebermann, who got much inspiration from the art of Manet and the French Impressionists, and Lovis Corinth then still painting in a naturalistic style. The group existed until the 1930s. Its regular exhibitions [was important for, or] helped launch the next two generations of Berlin artists.Hamilton, 181–184, and see index for later mentions Near the end of the century, the Benedictine Beuron Art School was known for religious murals, in rather muted colours, with inspiration from Les Nabis. In some ways that art looked forward to Art Nouveau or the Jugendstil (\"Youth Style\") as it is known in German.Hamilton, 113 Franz Stuck and Max Klinger are the leading German Symbolist painters. ==20th century== [\"The working-council for art\", or] Arbeitsrat für Kunst and November Group, both formed in 1918. In 1922 The November Group, the Dresden Secession, Das Junge Rheinland, and several other progressive groups formed a \"Cartel of advanced artistic groups in Germany\" (Kartell fortschrittlicher Künstlergruppen in Deutschland).Crockett, Dennis (1999). German Post- Expressionism : The Art of the Great Disorder 1918–1924. University Park, Pa: Pennsylvania State University Press. p. 76. . Die Brücke (\"The Bridge\") was a group of painters that were important to expressionism in Germany. The group was started in Dresden in 1905 by architecture students who wanted to be painters: Fritz Bleyl (d. 1966), Erich Heckel (d. 1970), Ernst Ludwig Kirchner (d. 1938) and Karl Schmidt-Rottluff (d. 1976), with Max Pechstein and others later joining.Hamilton, 197–204, and Honour & Fleming, 569–576 Emil Nolde (d. 1956) was for a short time a member of Die Brücke, but was not in agreement with the younger members of the group. Die Brücke moved to Berlin in 1911, and the group ended in 1913. The group was known for use of woodcut in art. Der Blaue Reiter (\"The Blue Rider\") was started in Munich, Germany in 1911. Wassily Kandinsky, Franz Marc, August Macke, Alexej von Jawlensky, Marianne von Werefkin and others started the group (because, or) in response to the rejection of Kandinsky's painting Last Judgment from an exhibition by Neue Künstlervereinigung. (Kandinsky had been a member of that group.) The name Der Blaue Reiter came from Marc's enthusiasm for horses, and from Kandinsky's love of the colour blue. For Kandinsky, blue is the colour of spirituality; The darker the blue, the more it awakens human desire for the eternal (see his 1911 book On the Spiritual in Art). Kandinsky had also titled a painting Der Blaue Reiter in 1903.Honour & Fleming, 569–576, and Hamilton, 215–221 The intense sculpture and printmaking of Käthe Kollwitz was strongly influenced by Expressionism, which also formed the starting point for the young artists who went on to join other tendencies within the movements of the early 20th century.Hamilton, 189–191 Die Brücke and Der Blaue ReiterHunter, Jacobus, and Wheeler (2000) p. 113From the Manifesto of Die Brücke, qtd Hunter et al p. 113 and the Bauhaus had Utopian leanings, and they were trying to combine fine and applied arts (Gesamtkunstwerk) with a view towards creating a better society. ===Weimar period=== From the early 20th century until 1933, there was a boom (or a big increase) in the production of works of German art of a grotesque style.Esti Sheinberg (2000) Irony, Satire, Parody and the Grotesque in the Music of Dmitrii Shostakovich, pp.248–9, Pamela Kort (2004) Comic Grotesque, Prestel Publishing Artists using the Satirical-Grotesque genre included George Grosz, Otto Dix and Max Beckmann, at least in their works of the 1920s. The leading artists of Dada in Germany, were Kurt Schwitters and Hannah Höch.Hunter, Jacobus, and Wheeler (2000) pp. 173–77 They were known for their use of collage for political commentary. Schwitters later developed his Merzbau, a forerunner of installation art. Dix and Grosz were also associated with the Berlin Dada group. Max Ernst led a Dada group in Cologne, where he also worked on collages, but with a great interest in Gothic fantasy. He made a transition into surrealism, and he became the leading German artist of surrealism.Hamilton, 473–478 The Swiss-born Paul Klee, Lyonel Feininger and others experimented with cubism. The New Objectivity (German: Neue Sachlichkeit), was an art movement which started in Germany during the 1920s; It was in opposition (or against) expressionism. Grosz and Dix were at the front of the movement. They were on the \"Verist\" side of the movement together with Beckmann and Christian Schad, Rudolf Schlichter, Georg Scholz (in his early work), Elfriede Lohse-Wächtler, and Karl Hubbuch. The other tendency is sometimes called Magic Realism, and included Anton Räderscheidt, Georg Schrimpf, Alexander Kanoldt, and Carl Grossberg. The movement was never a formal group.Hamilton, 478–479 Plakatstil, \"poster style\" in German, was an early style (or kind) of poster design that began in the early 20th century; It had bold, straight fonts with very simple designs, in contrast to Art Nouveau posters. Lucian Bernhard was one of its important people. ===Art in the Third Reich=== The Nazi regime banned modern art; It was seen as degenerate art. Nazi ideology said that modern art had gone away from the norm of classical beauty. The 1920s to 1940s are considered the heyday of modern art movements. The government looked at avant-garde artists as enemies of the state and a threat to the German nation. Many artists went into exile (or settled in other countries); Few came back after World War II. Dix and Pechstein stayed. Nold stayed and made his \"unpainted pictures\" in secret after being forbidden (or having a prohibition) to paint. Beckmann, Ernst, Grosz, Feininger and others went to America. Klee went to Switzerland, where he died. Kirchner took his own life. In July, 1937, the Nazis showed the exhibition Entartete Kunst (Degenerate art), in Munich; After that showing, the exhibition was moved to eleven other cities in Germany and Austria. Hamilton, 486–487 ==Art after World War II== The trends in Germany, of art after World War II can be divided into Socialist realism in the DDR (communist East Germany), and in West Germany a variety of movements including Neo- expressionism and Conceptualism. Famous artists of socialist realism include Walter Womacka, Willi Sitte, Werner Tübke and Bernhard Heisig. Famous neo- expressionists include or included Georg Baselitz, Anselm Kiefer, Jörg Immendorff, A. R. Penck, Markus Lüpertz, Peter Robert Keil and Rainer Fetting. Other famous artists include Martin Kippenberger, Gerhard Richter, Sigmar Polke, and Neo Rauch. Famous German conceptual artists include Bernd and Hilla Becher, Hanne Darboven, Hans-Peter Feldmann, Hans Haacke, and Charlotte Posenenske.Marzona, Daniel. (2005) Conceptual Art. Cologne: Taschen. Various pages The Performance artist, sculptor, and theorist Joseph Beuys was maybe the most influential German artist of the late 20th century.Moma Focus, retrieved 16 December 2009 The exhibition documenta was held as late as 2022; The next exhibition is scheduled five years after that. Art Cologne and Transmediale are held every year. ==Related pages== *Düsseldorf school of painting (art movement) ==Sources== ==References== *Bartrum, Giulia (1995); German Renaissance Prints, 1490–1550; British Museum Press, 1995, *Bartrum, Giulia (2002), Albrecht Dürer and his legacy: the graphic work of a Renaissance artist, British Museum Press, 2002, *Beckwith, John. Early Medieval Art: Carolingian, Ottonian, Romanesque, Thames & Hudson, 1964 (rev. 1969), *Clark, Sir Kenneth, Landscape into Art, 1949, page refs to Penguin edn of 1961 *Dodwell, C.R.; The Pictorial arts of the West, 800–1200, 1993, Yale UP, *Focillon, Henri, The Art of the West in the Middle Ages, Volume II, Gothic Art, Phaidon/Oxford University Press, 3rd edn, 1980, *Gombrich, E.H., The Story of Art, Phaidon, 13th edn. 1982. *Gossman, Lionel, Making of a Romantic Icon: The Religious Context of Friedrich Overbeck’s ‘Italia und Germania.' American Philosophical Society, 2007. . *Griffiths, Antony and Carey, Francis; German Printmaking in the Age of Goethe, 1994, British Museum Press, * Hamilton, George Heard, Painting and Sculpture in Europe, 1880–1940 (Pelican History of Art), Yale University Press, revised 3rd edn. 1983 *Harbison, Craig. The Art of the Northern Renaissance, 1995, Weidenfeld & Nicolson, *Hugh Honour and John Fleming, A World History of Art,1st edn. 1982 & later editions, Macmillan, London, page refs to 1984 Macmillan 1st edn. paperback. *Hunter, Sam; John Jacobus, Daniel Wheeler (2000) Modern Art: Painting, Sculpture, Architecture. New York: Prentice Hall and Harry N. Abrams *Kitzinger, Ernst, Early Medieval Art at the British Museum, (1940) 2nd edn, 1955, British Museum *Michael Levey, Painting at Court, Weidenfeld and Nicolson, London, 1971 *Novotny, Fritz, Painting and Sculpture in Europe, 1780–1880 (Pelican History of Art), Yale University Press, 2nd edn. 1971 *George Savage, Porcelain Through the Ages, Penguin, (2nd edn.) 1963 *Schultz, Ellen (ed). Gothic and Renaissance Art in Nuremberg, 1986, New York, Metropolitan Museum of Art, *Scheyer, Ernst, Baroque Painting in Germany and Austria: A Gap in American Studies, Art Journal, Vol. 20, No. 1 (Autumn, 1960), pp. 9–18, JSTOR online text *Snyder, James; Northern Renaissance Art, 1985, Harry N. Abrams, *Trevor-Roper, Hugh; Princes and Artists, Patronage and Ideology at Four Habsburg Courts 1517–1633, Thames & Hudson, London, 1976, *Wood, Christopher, Albrecht Altdorfer and the Origins of Landscape, 1993, Reaktion Books, London, Category:German culture",
 "title": "German art"
}