{
 "id": "885202",
 "text": "The vice premiers of the State Council of the People's Republic of China () are high-ranking officials under the premier and above the ministers. The current vice premiers, in order of rank, are Han Zheng, Sun Chunlan, Hu Chunhua and Liu He. ==Current Premiers== Vice premiers of the People's Republic of China Vice premiers of the People's Republic of China Vice premiers of the People's Republic of China Vice premiers of the People's Republic of China Portrait Information Information Posts Rank 1st Member of the Politburo Standing Committee (7th Ranked) \\---- finance, development, reform, land, resources, environmental protection, housing, urban-rural development, etc. Name Han Zheng Member of the Politburo Standing Committee (7th Ranked) \\---- finance, development, reform, land, resources, environmental protection, housing, urban-rural development, etc. Constituency Shaanxi At-large Member of the Politburo Standing Committee (7th Ranked) \\---- finance, development, reform, land, resources, environmental protection, housing, urban-rural development, etc. Ethnicity Han Member of the Politburo Standing Committee (7th Ranked) \\---- finance, development, reform, land, resources, environmental protection, housing, urban-rural development, etc. Birthplace Shanghai Member of the Politburo Standing Committee (7th Ranked) \\---- finance, development, reform, land, resources, environmental protection, housing, urban-rural development, etc. took office since 19 March 2018 Member of the Politburo Standing Committee (7th Ranked) \\---- finance, development, reform, land, resources, environmental protection, housing, urban-rural development, etc. Rank 2nd Member of the Politburo \\---- education, health, sports, & culture Name Sun Chunlan Member of the Politburo \\---- education, health, sports, & culture Constituency Jilin At-large Member of the Politburo \\---- education, health, sports, & culture Ethnicity Han Member of the Politburo \\---- education, health, sports, & culture Birthplace Raoyang County, Hebei Member of the Politburo \\---- education, health, sports, & culture took office since 19 March 2018 Member of the Politburo \\---- education, health, sports, & culture Rank 3rd Member of the Politburo \\---- agriculture, water resources, commerce, & tourism Name Hu Chunhua Member of the Politburo \\---- agriculture, water resources, commerce, & tourism Constituency Hunan At-large Member of the Politburo \\---- agriculture, water resources, commerce, & tourism Ethnicity Han Member of the Politburo \\---- agriculture, water resources, commerce, & tourism Birthplace Wufeng County, Hubei Member of the Politburo \\---- agriculture, water resources, commerce, & tourism took office since 19 March 2018 Member of the Politburo \\---- agriculture, water resources, commerce, & tourism Rank 4th Member of the Politburo \\---- industry, transport, bank, human resources, & social security Name Liu He Member of the Politburo \\---- industry, transport, bank, human resources, & social security Constituency Shanxi At-large Member of the Politburo \\---- industry, transport, bank, human resources, & social security Ethnicity Han Member of the Politburo \\---- industry, transport, bank, human resources, & social security Birthplace Beijing Member of the Politburo \\---- industry, transport, bank, human resources, & social security took office since 19 March 2018 Member of the Politburo \\---- industry, transport, bank, human resources, & social security * Category:1954 establishments in Asia Category:1950s establishments in China",
 "title": "Vice Premier of the People's Republic of China"
}