{
 "id": "885458",
 "text": "John Bedford Lloyd (born January 2, 1956) was an American character actor. Lloyd was born in New Haven, Connecticut, the son of Ann Storrs Lloyd and Edward B. Lloyd of Southport, Connecticut. His father was an architect. He has a sister, Susan Storrs Lloyd, and a brother, Thomas Bedford Lloyd. Thomas was married to Susan DeLong Ball. While studying at Williams College in Williamstown, Massachusetts, he was cast in the play One Flew Over the Cuckoo's Nest, and decided to become a professional actor. He later attended Yale School of Drama. After graduating, he moved to Manhattan and began his professional acting career on the stage. He has appeared in movies such as Trading Places, Crossing Delancey, Philadelphia, Fair Game, The Bourne Supremacy, Wall Street: Money Never Sleeps, The Front Runner and in TV series such as Hometown, Law & Order, Aliens in the Family, John Adams, and Ozark. He married actress Anne Twomey on August 23, 1986. The couple have two daughters, Hannah and Elizabeth. == Filmography == ===Film=== Year Title Role Notes 1983 Trading Places Andrew 1984 C.H.U.D. Shadow Man 1987 Sweet Lorraine Jack 1987 Tough Guys Don't Dance Wardley Meeks III 1988 Crossing Delancey Nick 1989 The Abyss Jammer Willis 1990 Waiting for the Light Reverend Stevens 1991 Diary of a Hitman Dr. Jameson 1992 Primary Motive Pat O'Hara 1993 Philadelphia Matt Beckett 1995 Killer: A Journal of Murder Dr. Karl Menninger 1995 Fair Game Det. Louis Aragon 1995 Nixon Cuban Man 1998 Mixing Nia Larry 2001 Super Troopers Mayor Timber 2001 Riding in Cars with Boys Mr. Forrester 2004 The Bourne Supremacy Teddy 2004 The Manchurian Candidate Jay \"J.B.\" Johnston 2005 Winter Passing Leontes 2006 The Hoax Frank Mccullough 2007 The Killing Floor Martin Soll 2010 13 Mark 2010 Wall Street: Money Never Sleeps Treasury Secretary 2013 Muhammad Ali's Greatest Fight Byron 'Whizzer' White 2014 Away from Here Jon 2016 The Brooklyn Banker Agent Cahil 2016 No Pay, Nudity Ron 2017 Radium Girls Arthur Roeder ===Television=== Year Title Role Notes 1985 Hometown Peter Kincaid 1987 Kojak: The Price of Justice Bass TV Movie 1985-87 Spenser: For Hire Keith Kincaid / Powers' Thug 1988 The Equalizer D.A. Francis Scanlon 1989-1993 L.A. Law Mitch Gelleher / Duane Butler 1992-2005 Law & Order Prentiss's Lawyer / Dr. Christian Varick / Jonathan Ryder 1993 seaQuest DSV Leslie ”The Regulator” Farina S1: E11 1996 Aliens in the Family Doug Brody 1996-97 Remember WENN Victor Comstock / Jonathan Arnold #1 1996-2000 Spin City Wayne Sheridan / Dr. Bronsteen 1999 The Simple Life of Noah Dearborn Robert Murphy TV Movie 1999 The West Wing Lloyd Russell 2001 All My Children Warren Dunn 2004 Law & Order: Special Victims Unit Mike Tucker 2008 John Adams Richard Palmes 2009 Taking Chance General Kruger TV Movie 2009-10 Three Rivers Dr. Yorn 2011 Blue Bloods Vincenzo 2011 Suits Gerald 2011 Pan Am Captain Dennis 2012 Political Animals Hal 2014 Chicago P.D. Don Enrietto 2014 The Good Wife Bob Klepper 1 episode 2018 Ozark Frank Cosgrove 3 episodes 2018 Bull Commissioner Taylor Episode: \"Excessive Force\" 2019 Gotham General Wade 2 episodes 2020 Tommy Lou Woods ==References== ==Other websites== * Category:1956 births Category:Living people Category:American movie actors Category:American television actors Category:Actors from New Haven, Connecticut",
 "title": "John Bedford Lloyd"
}