{
 "id": "885476",
 "text": "The Portuguese Communist Party is a communist, Marxist–Leninist political party in Portugal based upon democratic centralism. The party is characterized as being between the left-wing and far-left on the political spectrum. The Party was founded in 1921, establishing contacts with the Comintern in 1922. PCP was made illegal after a fascist coup in the late 1920s, the PCP played a major role in the opposition to the dictatorial regime of António de Oliveira Salazar. During the five-decades-long dictatorship, the party was constantly suppressed by the political police, which forced its members to live in clandestine status under the threat of arrest, torture, and murder. After the Carnation Revolution in 1974, which overthrew the 48-year regime, the 36 members of party's Central Committee had, in the aggregate, experienced more than 300 years in jail.Cunhal, Álvaro (1997). O caminho para o derrubamento do fascismo. Edições Avante!. After the end of the dictatorship, the party became a major political force of the new democratic regime. One of its goals, according to the party is to maintain its \"vanguard role in the service of the class interests of the workers\".Working-class party and all workers: the role of the PCP in strengthening the organization, unity and struggle of the workers at pcp.pt. https://web.archive.org/web/20201028205209/http://www.pcp.pt/partit-of-the- class-operate-of-all-workers--paper-of-the-pcp-no-reforco-organization-unity Filed] in Wayback Machine\"Ficará para história a reposição de direitos que se julgavam perdidos\" in Notícias ao Minuto. Archived in Wayback Machine The PCP is the fourth largest in the Portuguese Assembly of the Republic, where it holds 10 of the 230 assembly seats. The Party publishes the weekly Avante!, founded in 1931. Its youth organization is the Portuguese Communist Youth, a member of the World Federation of Democratic Youth. ==References== Category:Politics of Portugal",
 "title": "Portuguese Communist Party"
}