{
 "id": "885866",
 "text": "The Tokyo Metro Museum is a railway museum in Edogawa Ward, Tokyo, Japan. Metro Cultural Foundation is the caretaker of the museum. It is an organization of the Tokyo Metro which does not work for any profit. The museum is 100 meters away from Kasai Station. Visitors enter the museum through a subway ticket gate. Then they go through a section of an underground line. This line was the first underground line of Tokyo. It was opened in 1927 between Ueno and Asakusa. As of 2021, it is a part of the Ginza Line. ==Collection== The museum presents some examples of the rolling stock used in the Tokyo metro system. It displays a car from an Eidan 300 train that ran on the Marunouchi line. It also displays a car from an Eidan 1000 train that ran on the Ginza line. The museum has seven main exhibit spaces that explain, * History of the subway; * Building the subway; * Keeping the subway safe; * Passenger services; * How do trains work?; * Subways of Japan and the world; * Subway play land. Driving simulators are also available for visitors to try. ===Collection details=== As soon as visitors enter through a subway automatic ticket gate, they see an exhibit on the relationship between the city and the subway over the years. They also see the reconstruction of the Ueno station, as it is in 1927. The next exhibit focus upon the construction of the subway tunnels and the safety of the lines. It exhibits details about the anti-flood system, the traffic-control system, power control centres and how the disaster prevention centre work. The next section of the museum displays a Series 100 subway car. The museum allows visitors to enter the cab and use various car controls including the motors, the brakes and the pantograph. Scale examples show the electrical collection system used by the subway and the third rail. It also shows the working examples of electric motors and brakes. In the next section of the museum, there are real simulators. These simulators are used for the training of metro staff. Visitors can try one of three simulators under the guidance of museum staff. The museum has a lecture hall and a lounge. It also has a library with a collection of subway-related works. ==References== Railway museums in Japan",
 "title": "Tokyo Metro Museum"
}