{
 "id": "886078",
 "text": "Power Rangers Beast Morphers is a TV show Power Rangers started in 2019-2020. It aired from March 2 to December 12 2019-2020 with 44 episodes. It is based on the Super Sentai series Tokumei Sentai Go-Busters. It is a sequel to Power Rangers Ninja Steel. It is also the sequel season to Power Rangers RPM. A sequel to it called Power Rangers Dino Fury started from 2021-2022. == Plot == Scientists in the city of Coral Harbor have discovered a way to convert the infinite power of the Morphin Grid into a physical substance called \"Morph-X\", providing the city with a source of unlimited clean energy. To protect this city, a secret agency known as Grid Battleforce combines Morph-X with animal DNA to create a new team of Power Rangers. Now the Beast Morpher Rangers: Devon Daniels, Ravi Shaw, and Zoey Reeves must defend the Morphin Grid from Evox, an evil sentient computer virus from another dimension and his evil avatar clones of original Ranger candidates Blaze and Roxy, who were rendered comatose. After the three of them of transported to the Cyber Dimension, Evox, Cybervillain Blaze, and Cybervillain Roxy gain its de facto ruler Scrozzle as an ally as he helps them in their plan to return Evox to Earth. As the Rangers battle Evox's robot monsters, they gain two new additions to the team: Nate Silva, the head researcher and scientist of Grid Battleforce who becomes the Gold Ranger and Steel, a robot Nate was forced to create as a body for Evox, who gains sentience and becomes the Silver Ranger. In the second season, Evox possesses Mayor Daniels and plots to finish when he started with the help of Scrozzle, who uses a machine to revive the Blaze and Roxy avatars as robots. Along the way, the Rangers uncover Evox's true origins and receive help from the Mighty Morphin Power Rangers, Power Rangers Dino Thunder, and Power Rangers Dino Charge Rangers as well as allies of the Power Rangers RPM Rangers to defeat Evox and his minions once and for all. ==Characters== Rangers Actor Name Zord Red Beast Morpher Ranger Rorrie D. Travis Devon Daniels Racer Zord Blue Beast Morpher Ranger Jasmeet \"Jazz\" Baduwalia Ravi Shaw Wheeler Zord Yellow Beast Morpher Ranger Jacqueline Scislowski Zoey Reeves Chopper Zord Gold Beast Morpher Ranger Abraham Rodriguez Nathan \"Nate\" Silva Wrecker Zord Silver Beast Morpher Ranger Jamie Linehan Steel Silva Jet Zord ==Cast and Characters== ===Rangers=== * Rorrie D. Travis as Devon Daniels, the Red Beast Morpher Ranger. * Jasmeet \"Jazz\" Baduwalia as Ravi Shaw, the Blue Beast Morpher Ranger. * Jacqueline Scislowski as Zoey Reeves, the Yellow Beast Morpher Ranger. * Abraham Rodriguez as Nathan \"Nate\" Silva, the Gold Beast Morpher Ranger. * Jamie Linehan (voice) and Sam Jellie (human) as Steel Silva, the Silver Beast Morpher Ranger. ====Mighty Morphin==== * Austin St. John as Jason Lee Scott, the Mighty Morphin Red Ranger. ====Dino Thunder==== * James Napier as Connor McKnight, the Dino Thunder Red Ranger and the Triassic Ranger. * Jason David Frank as Tommy Oliver, the Dino Thunder Black Ranger ====Dino Charge==== * Brennan Mejia as Tyler Navarro, the Dino Charge Red Ranger. * James Davies as Chase Randall, the Dino Charge Black Ranger. * Yoshi Sudarso as Koda, the Dino Charge Blue Ranger. * Davi Santos as Sir Ivan of Zandar, the Dino Charge Gold Ranger. ===Allies=== * Kelson Henderson as the voice of Cruise * Charlie McDermott as the voice of Smash * Emmett Skilton as the voice of Jax * Kristina Ho as Betty Burke * Comse Flores as Ben Burke * Kevin Copeland as Adam Daniels * Teuila Blakely as Commander Shaw * Sia Trokenheim as Muriel Reeves * Mark Wright as General Burke * Colby Strong as Blaze * Liana Ramirez as Roxy * Miriama Smith as Regina Collins * Madeleine Adams as Megan * Molly Leishman as Kerry Dixon * Olivia Tennet as Doctor K * Richard Simpson as the voice of Keeper * Jack Buchanan as Captain Chaku * Lina Clare as Starlight * Mel Odedra as Bruce Silva * Rachel Foreman as Cheryl Silva * James Galvyn as Colonel Mason Truman ===Villains=== * Andrew Laing as the voice of Evox/Venjix * Campbell Cooley as the voice of Scrozzle * Colby Strong as Cybervillain Blaze and Robo-Blaze * Liana Ramirez as Cybervillain Roxy and Robo-Roxy * Jamie Linehan as the voice of Vargoyle * Kevin Keys as the voice of Ryjack ====Mighty Morphin==== * Adrian Smith as the voice of Goldar Maximus ====Dino Charge==== * Adam Gardiner as the voice of Sledge * Jackie Clarke as the voice of Poisandra * Paul Harrop as the voice of Fury * Estevez Gillespie as the voice of Wrench and Curio * Campbell Cooley as the voice of Snide == References == Category:Mighty Morphin Power Rangers Category:English-language television programs",
 "title": "Power Rangers Beast Morphers"
}