{
 "id": "886129",
 "text": "Bohemia is a hamlet (and census-designated place) in Suffolk County, New York, United States. The population was 9,852 at the 2020 census. Bohemia is bordered by Central Islip and Great River to the west; Islandia, Ronkonkoma and Lake Ronkonkoma to the north; Holbrook to the east; and Oakdale, Sayville, West Sayville, and Bayport to the south. The school district in the town is the Connetquot School District. The zip code is 11716 and the telephone area code is 631. The town is near the Oakdale and Ronkonkoma rail road stations of the Long Island Rail Road, providing easy access to Manhattan where many residents work. Long Island MacArthur Airport is partially in Bohemia (along with the bordering town of Ronkonkoma, New York). The airport serves travelers from the Greater New York Metropolitan Area and around the nation who want a more convenient alternative to the congestion at JFK and Laguardia airports. The airport's most popular destinations include: Orlando, Florida; Chicago, Illinois; West Palm Beach, Florida; and Las Vegas, Nevada. Connetquot River State Park is in Bohemia. The park provides areas for horses. == History == The earliest natives of Bohemia were the Secatogue tribe of the Algonquian peoples. Bohemia was founded in 1855 by Slavic immigrants. For 100 years, Bohemia remained a very small village. At the time of the centennial in 1955, the population was about 3,000. Today there about 11,000 inhabitants from many national and ethnic backgrounds. == Local cigar industry == Immigrants that came to Bohemia had good cigar-making skills. There used to be several cigar making factories in the town. Two notable cigar factories were Albert Kovanda's factory, on the corner of Lakeland and Smithtown Avenues, and the M. Foster Cigar Factory, at Ocean Avenue and Church Street. The local cigar industry continued until the 1930s. == Name change == Over the years, there have been a number of attempts to change the name of Bohemia, which some people felt was too tied to one ethnic group. They felt this was keeping new people and new businesses from coming to the town. Proposed names have included: Sayville Heights or North Sayville, after the town immediately to the south; Lidice, after a Czech town destroyed by Nazi troops during World War II; and MacArthur, after the airport built in the 1940s (the airport is named for controversial American General Douglas MacArthur). None of the attempts to change the name received enough support for the change. == Geography == Bohemia is in New York at (40.770042, −73.113760). According to the United States Census Bureau, the CDP has a total area of . == Bohemia Historical Society == Bohemia Historical Society (BHS) was founded in 1984. This non-profit local organization provides classes, slide presentations, community activities, a newsletter, its own website and its own museum. The museum was opened on April 26, 2009, and it has on display a number of exhibits depicting life in the early days of Bohemia, a photograph collection, and a book collection that includes many historical Czech manuscripts. Additionally, the building is the BHS's meeting place. == Connetquot River State Park == Connetquot River State Park Preserve hosts 3,473 acres of land and water for the protection and propagation of game birds, fish and animals. The preserve has 50 miles of hiking, horseback riding, cross-country ski and nature trails, as well as fishing on the Connetquot River. == Education == District: Connetquot School District High School: Connetquot High School, grades 9–12 Elementary: Sycamore Avenue School, Edward J. Bosti Elementary, Idle Hour Elementary and John Pearl Elementary, grades K-5 Grades 6–8 are serviced by the Oakdale-Bohemia Middle School, in neighboring Oakdale, New York (formerly known as Oakdale-Bohemia Junior High School). Another middle school is Ronkonkoma Middle School. The Dellacave Institute for Professional Development is located on Sycamore Avenue. The Institute offers a wide variety of courses designed for continued professional growth for lifetime learners. == Climate == The climate in this area has hot, humid summers and generally mild to cool winters. According to the Köppen Climate Classification system, Bohemia has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Bohemia, New York == References == == Other websites == * History of Bohemia in Newsday * Bohemia Historical Society * Old Photograph of Cerny’s Bakery, a former Czech Bakery recently added to the National Register of Historic Places (Pintrest) Category:Census-designated places in New York (state) Category:Hamlets in New York (state) Category:Islip (town), New York",
 "title": "Bohemia, New York"
}