{
 "id": "88631",
 "text": "Ewan Gordon McGregor (born 31 March 1971) is a Scottish actor who has had a lot of success in both mainstream and indie movies. He is ranked #36 in Empire magazine's \"The Top 100 Movie Stars of All Time\" list. He played the lead role in Danny Boyle's Trainspotting, Obi-Wan Kenobi in the prequel trilogy of Star Wars, and in his motorcycle adventures with friend Charley Boorman. McGregor starred as Christopher Robin in the 2018 Disney movie Christopher Robin. He also starred as the villain Black Mask in the 2020 DCEU movie Birds of Prey. McGregor lives in Los Angeles, California. He also has a home in North London, England. == Filmography == Year Title Role Director Notes 1994 Being Human Alvarez Bill Forsyth Shallow Grave Alex Law Danny Boyle 1995 Blue Juice Dean Raymond Carl Prechezer 1996 Trainspotting Mark Renton Danny Boyle Jerome Peter Greenaway Emma Frank Churchill Douglas McGrath Brassed Off Andy Barrow Mark Herman 1997 Nightwatch Martin Bells Ole Bornedal Meneer Chrome Philippe Rousselot Robert Lewis Danny Boyle 1998 Velvet Goldmine Curt Wild Todd Haynes Little Voice Billy Mark Herman 1999 Desserts Stroller Jeff Stark Short film Star Wars Episode I: The Phantom Menace Obi-Wan Kenobi George Lucas Rogue Trader Nick Leeson James Dearden Eye of the Beholder Stephen Wilson/The Eye Stephan Elliott 2000 Nora James Joyce Pat Murphy 2001 Moulin Rouge! Christian Baz Luhrmann Black Hawk Down SPC John Grimes Ridley Scott 2002 Star Wars Episode II: Attack of the Clones Obi-Wan Kenobi George Lucas Solid Geometry Phil Denis Lawson 2003 Down with Love Catcher Block Peyton Reed Young Adam Joe Taylor David Mackenzie Faster Narrator Mark Neale Voice Big Fish Edward Bloom (young) Tim Burton 2005 Logan Swan Logan Swan Star Wars Episode III: Revenge of the Sith Obi-Wan Kenobi George Lucas Valiant Valiant Gary Chapman Voice Lincoln Six Echo / Tom Lincoln Michael Bay Stay Dr. Sam Foster Marc Forster 2006 Stormbreaker Ian Rider Geoffrey Sax Scenes of a Sexual Nature Billy Ed Blum Miss Potter Norman Warne Chris Noonan 2007 Cassandra's Dream Ian Blane Woody Allen 2008 Incendiary Jasper Black Sharon Maguire Deception Jonathan McQuarry Marcel Langenegger 2009 Angels & Demons Camerlengo Father Patrick McKenna Ron Howard I Love You Phillip Morris Phillip Morris John Requa Glenn Ficarra Bob Wilton Grant Heslov Amelia Gene Vidal Mira Nair 2010 The Ghost Writer Roman Polanski Alternative title: The Ghost Nanny McPhee and the Big Bang Rory Green Susanna White Jackboots on Whitehall Chris The McHenry Brothers Voice Beginners Oliver Fields Mike Mills 2011 Perfect Sense Michael David Mackenzie Fastest Narrator Mark Neale Voice Haywire Kenneth Steven Soderbergh 2012 Salmon Fishing in the Yemen Dr. Alfred Jones Lasse Hallström Henry Bennett J. A. Bayona 2013 Jack the Giant Slayer Elmont Bryan Singer August: Osage County Bill Fordham John Wells 2014 A Million Ways to Die in the West Cowboy at Fair Seth MacFarlane Cameo Son of a Gun Brendan Lynch Julius Avery 2015 Mortdecai Inspector Alistair Martland David Koepp Last Days in the Desert Yeshua / Satan Rodrigo García Miles Ahead Dave Brill Don Cheadle Star Wars: The Force Awakens Obi-Wan Kenobi (voice) J. J. Abrams Cameo 2016 Jane Got a Gun John Bishop Gavin O'Connor Our Kind of Traitor Peregrine \"Perry\" Makepeace Susanna White American Pastoral Seymour \"Swede\" Levov Himself Also director 2017 T2 Trainspotting Mark Renton Danny Boyle Beauty and the Beast Lumière Bill Condon 2018 Zoe Cole Drake Doremus Christopher Robin Christopher Robin Marc Forster 2019 Doctor Sleep Danny Torrance Mike Flanagan 2020 Birds of Prey Roman Sionis / Black Mask Cathy Yan == Television == *The Scarlet and the Black (1993) *Lipstick On Your Collar (1993) *Tales from the Crypt - Cold War (1996) *ER (1997) *Long Way Round (2004) *Long Way Down (2007) == Discography == * \"TV Eye\" Single (Soundtrack for movie Velvet Goldmine Cover version of original song by The Stooges - 1998) * \"Gimme Danger\" Single (Soundtrack for movie Velvet Goldmine Cover version of original song by The Stooges - 1998) * \"Come What May\" Single (Duet with Nicole Kidman - October 2001) UK #27 * \"Your Song\" single * \"Elephant Love Medley\" Single (Duet with Nicole Kidman - October 2001) == References == == Other websites == * * *Ewan McGregor to star in \"Othello\" at the Donmar Warehouse on Theatre.com Category:1971 births Category:Living people Category:British television producers Category:Naturalized citizens of the United States Category:Scottish movie actors Category:Scottish stage actors Category:Scottish television actors Category:Scottish voice actors Category:People from Perth and Kinross",
 "title": "Ewan McGregor"
}