{
 "id": "886447",
 "text": "Giuseppe Bisi (Genoa, April 10, 1787 - Varese, October 28, 1869) was an Italian painter, chancellery of the viceroy Eugene of Beauharnais, Professor of the Brera Academy since 1838. == Biography == Son of the painter and modeler Tommaso Bisi (Genoa 1758 - Milan 2 December 1826). Essentially a painter landscape painting, Giuseppe Bisi outlined his own pictorial way in which nature is simply observed in his everyday life, despite the time, in which the artist lived his artistic youth, evoked atmospheres more markedly Romanticism. His landscapes were purchased by sovereigns and high Italian and foreign nobles, Among his collectors were Napoleon III, Re Carlo Alberto di Savoia, Re Vittorio Emanuele II, the Emperor of Austria Ferdinand I of Austria, the Emperor of Russia Grand Duke Michael Alexandrovich of Russia, etc. He was professor of landscape at the Brera Academy from 1838 to 1856. In 1829 he made a study trip to Rome which gave him the starting point for subjects of the Lazio landscape. Back in Milan he consolidated his fame and success there. In 1838 he obtained the chair of landscape painting, which had just been established at the Accademia di Brera. Brother of Michele Bisi, he was the husband of the artist Ernesta Legnani, whom he had married in 1811 with whom he had nine daughters. His daughters Raffaela, Antonietta and Fulvia Bisi. His nephew is the painter Luigi Bisi (Milan, 1814), who later became President of the Brera Academy. == Musuem == * Pinacoteca di Brera * Gallery of Modern Art, Milan * Pinacoteca Tosio Martinengo, Brescia * Musei Civici di Como == Exhibitions == He participated in the Brera exhibitions of 1833, 1835 and 1837. He exhibited in Turin from 1838. == Work of Art == * Veduta del Palazzo Raimondi (1838), comissioned by the Emperor of Austria Ferdinand I of Austria * Veduta di Genova dall'alto * Veduta della Villa Sommariva (1823) * Veduta di Genova dall'alto (1825), Pinacoteca di Brera * Veduta del porto di Genova (1826), Pinacoteca di Brera * Veduta di Castel Gandolfo (1830) * Lierna view on Varenna Lake Como (1835) * Orlando e Rodomonte * Paesaggio con bagnanti * Veduta di Torno (1860), Musei Civici di Como, Palazzo del Municipio == Style == The rigor of the sign, of neoclassical inspiration, is lightened by the liveliness of the colors, even if sometimes a little glazed, and by the clear transparent atmosphere of waters and skies. From some of his views notable engravings were taken, which he himself sometimes created (series of the Via Mala near Spluga, 1820-1825). ==Related pages== *Lierna view on Varenna Lake Como (Bisi) ==Notes== ==References== *Opere di G.Bisi *Milano, Galleria d’Arte Moderna == Bibliography == * Agostino Mario Comanducci, Pittori italiani dell'ottocento: dizionario critico e documentario, C.E. Artisti d'Italia, 1934. * Agostino Mario Comanducci, Dizionario illustrato dei Pittori, Disegnatori e Incisori Italiani Moderni (1800-1900), OVEM, 1945. * Agostino Mario Comanducci, Dizionario illustrato dei pittori, disegnatori e incisori italiani moderni e contemporanei, vol. 4, Milano, Leonilde M. Patuzzi, 1962. Category:1787 births Category:1826 deaths Category:19th-century Italian painters Category:Painters from Milan",
 "title": "Giuseppe Bisi"
}