{
 "id": "88644",
 "text": "Paul Stephen Rudd (born April 6, 1969) is an American actor. ==Early and personal life== Rudd was born on April 6, 1969 in Passaic, New Jersey. His father, Michael Rudd, was a historical tour guide and former vice-president of Trans World Airlines who died of cancer when Rudd was 39. His mother, Gloria Irene (Granville), was a sales manager at the television station KCMO-TV in Kansas City, Missouri. His parents were born in England; his father was from Edgware and his mother from Surbiton, both in London.Stated on The Graham Norton Show, February 1, 2013. Rudd's parents were both Jewish (descended from Jewish immigrants who moved to Britain from Russia, Belarus, and Poland). Rudd's parents were second cousins. His father's family's original surname, \"Rudnitsky\", was changed by his grandfather to \"Rudd\", and his mother's family's surname was originally \"Goldstein\".Stated on Finding Your Roots, October 31, 2017. Rudd had a Bar Mitzvah service. Growing up, he loved reading British comics, The Beano, and The Dandy, which his uncle in the UK would send to him. At age ten, his family moved to Lenexa, Kansas. They spent three years living in Anaheim, California, because of his father's occupation. Rudd attended Broadmoor Junior High and graduated from Shawnee Mission West High School in the class of 1987. Rudd attended the University of Kansas, where he majored in theatre. He was a member of the Sigma Nu fraternity's Nu Chapter there. He studied at the American Academy of Dramatic Arts/West in Los Angeles with fellow actor Matthew Lillard. Rudd spent three months studying Jacobean drama at the British American Drama Academy based in Oxford, England. While attending acting school, Rudd worked as a Bar Mitzvah disc jockey. ==Filmography== Year Title Role Director Notes 1995 Clueless Josh Amy Heckerling Halloween: The Curse of Michael Myers Tommy Doyle Joe Chappelle 1996 Romeo + Juliet Dave Paris Baz Luhrmann Alex Kari Skogland 1997 Earl John Patrick Kelley 1998 Overnight Delivery Wyatt Trips Jason Bloom George Hanson Nicholas Hytner 1999 200 Cigarettes Kevin Risa Bramon Garica Wally Worthington Lasse Hallström 2000 Gen-Y Cops Ian Curtis Benny Chan 2001 Wet Hot American Summer Andy David Wain Reaching Normal Kenneth Anne Heche Graham Granville Jesse Peretz 2003 Adam Sorenson Neil LaBute Two Days Paul Miller Sean McGinly House Hunting Daniel Amy Lippman Short film 2004 Anchorman: The Legend of Ron Burgundy Brian Fantana Adam McKay P.S. Sammy Silverstein Dylan Kidd Wake Up, Ron Burgundy: The Lost Movie Brian Fantana Adam McKay Direct-to-DVD 2005 Dan Abbott Michael Showalter David Judd Apatow Tennis, Anyone...? Lance Rockwood Donal Logue 2006 Jack Chase Billy Kent Diggers Hunt Katherine Dieckmann Night at the Museum Don Shawn Levy 2007 Reno 911!: Miami Ethan Robert Ben Garant I Could Never Be Your Woman Adam Pearl Amy Heckerling Leon Jesse Peretz Knocked Up Pete Judd Apatow Jeff Reigert David Wain Also producer Walk Hard: The Dewey Cox Story John Lennon Jake Kasdan Uncredited cameo 2008 Over Her Dead Body Dr. Henry Mills Jeff Lowell Forgetting Sarah Marshall Chuck Nicholas Stoller Role Models Danny Donahue David Wain Also writer 2009 I Love You, Man Peter Klaven John Hamburg Monsters vs. Aliens Derek Dietl (voice) Conrad Vernon Rob Letterman Year One Abel Harold Ramis Uncredited 2010 Dinner for Schmucks Tim Conrad Jay Roach How Do You Know George Madison James L. Brooks 2011 Our Idiot Brother Ned Jesse Peretz 2012 Wanderlust George David Wain Also producer Bill Anderson Stephen Chbosky This Is 40 Pete Judd Apatow 2013 Admission John Paul Weitz Prince Avalanche Alvin David Gordon Green This Is the End Himself Seth Rogen Evan Goldberg Cameo All Is Bright Rene Phil Morrison Anchorman 2: The Legend Continues Brian Fantana Adam McKay 2014 They Came Together Joel David Wain 2015 The Little Prince Mr. Prince (voice) Mark Osborne Ant-Man Scott Lang / Ant-Man Peyton Reed Also writer 2016 The Fundamentals of Caring Ben Rob Burnett Sausage Party Darren (voice) Greg Tiernan Conrad Vernon Captain America: Civil War Scott Lang / Ant-Man Anthony Russo Joe Russo Nerdland John (voice) Chris Prynoski Narrator Dale Heslip 2017 Fun Mom Dinner Brady Alethea Jones Also executive producer 2018 The Catcher Was a Spy Moe Berg Ben Lewin A Futile and Stupid Gesture Lawrence “Larry” Kroger David Wain Cameo Ideal Home Paul Andrew Fleming Mute Cactus Bill Duncan Jones Ant-Man and the Wasp Scott Lang / Ant-Man Peyton Reed Also writer 2019 Scott Lang / Ant-Man Avengers: Endgame Anthony Russo Joe Russo == References == ==Other websites== * * *Interview with Paul Rudd about Knocked Up Category:1969 births Category:Living people Category:Actors from New Jersey Category:American movie actors Category:American stage actors Category:American television actors Category:American voice actors Category:People from Passaic, New Jersey",
 "title": "Paul Rudd"
}