{
 "id": "886733",
 "text": "On the afternoon of Wednesday, January 6, 2021, thousands of supporters of then-U.S. President Donald Trump were in Washington, D.C. to protest against the results of the 2020 presidential election. They went in to support Trump's demand for Vice President Mike Pence and Congress to reject President-elect Joe Biden's victory. The protests soon became riots as thousands of Trump supporters broke into the United States Capitol, damaging the building. Presidential historian Michael Beschloss called the attacks an attempted coup d'etat by the President. The attack of the United States Capitol building was the worst at that place since the War of 1812. On January 20, 2025, upon taking office, Trump (gave or) granted clemency to all January 6 rioters. ==Rally== First, protesters came to the Ellipse for a planned rally. There, Rudy Giuliani called for \"trial by combat,\" then later, Donald Trump told his supporters to march to the United States Capitol \"to peacefully and patriotically make your voices heard today,\" while also asking them to \"show strength\" and to \"fight like hell\" for Republicans to \"take back our country.\" ==Storming of the Capitol== The Trump supporters broke into the Capitol. Congress was in session at the time. All congressmen, lobbyists, news reporters, visitors and Vice President Mike Pence were evacuated to a secure location. A Trump-supporting female rioter was shot by Capitol Police during the storming. At that time, she was climbing through a barricaded door near the entrance to the hall for the House of Representatives; she died later that day. Three people also died from medical emergencies that day, said the Washington D.C. police. The New York Times said that attackers hit a police officer with a fire extinguisher until he died, but that was later proven not true; it did not really happen. The attack on the Capitol has been referred to as domestic terrorism. During the attack, several rioters carried Confederate battle flags or Nazi symbols. For the first time in U.S. history, a Confederate battle flag was flying inside the U.S. Capitol building. ==Aftermath== Trump responded to the storming by writing messages on Twitter. In a video, he told protesters: \"This was a fraudulent election, but we can't play into the hands of these people. We have to have peace. So go home. We love you. You're very special. You've seen what happens. You see the way others are treated that are so bad and so evil. I know how you feel. But go home and go home in peace.\" In another message, he wrote: \"These are the things and events that happen when a sacred landslide election victory is so unceremoniously & viciously stripped away from great patriots who have been badly & unfairly treated for so long.\" He continued: \"Go home with love & in peace. Remember this day forever!\" 5 people died during or shortly after the event: four rioters and one police officer. Fifteen police officers were sent to the hospital, and more than 50 were injured. Members of the mob hit Capitol police officers in the head with lead pipes and other weapons, including flag poles. Howard Liebengood was a Capitol Police officer on duty during the attack. He died by suicide three days later. Jeffrey Smith defended the capitol as part of the Metro Police Department. He killed himself soon after. ==Reactions== Trump was impeached for a second time because of this attack. Some people even wanted Vice President Pence to use the twenty-fifth amendment to remove Trump from office. The House of Representatives formed a committee, the United States House Select Committee on the January 6 Attack, to investigate the attack and recommend changes that would prevent such an event from happening in the future. In 2024, the U.S. supreme court decided \"that the federal obstruction charges faced by about 350 ... defendants must be dropped if prosecutors cannot prove rioters intended to impede the [counting or] tallying of ... vote certificates\", during the attack.https://www.politico.com/news/2024/06/28/trump-jan-6-attack-free- arrested-00165900. Retrieved 2024-06-29 === Prison sentences for protesters === More than 750 people were charged with crimes because of the Capitol attack. More than 200 of these people pleaded guilty, meaning that they agreed not to have trials in exchange for smaller punishments. Prison sentences have been as long as 22 years (in prison).https://www.vg.no/nyheter/utenriks/i/8JkW0G/proud-boys-leder-doemt- til-22-aars-fengsel-for-kongresstorming. VG.no. Retrieved 2023-09-06 On July 20, 2021, one protester was sentenced to 8 months in prison; the trial was held in federal court. One protester was sentenced to 3 years and 5 months in prison;https://www.vg.no/nyheter/utenriks/i/pW9Kzo/tre-aar-og-fem-maaneders- fengsel-for-capitol-stormingen. Retrieved 11 November 2021 Jacob Chansley, also known as Jake Angeli also got a 3 years 5 months sentence; However, after 2 years and 3 months in prison, he was released.https://e24.no/teknologi/i/0VWArg/jeg-lever-ikke-med- anger?referer=https%3A%2F%2Fwww.vg.no. Retrieved 2024-11-02https://www.newsnetnebraska.org/jacob-chansley-better-known-as-jake- angeli-sentenced-to-3-years-and-5-months-in-prison-for-assaulting-the-united- states-congress/. Retrieved 23 November 2021 One protester was sentenced to 5 years and 3 months in prison. Sentences since 2023: *18 years in prison; Stewart Rhodes is one of the founders of Oath Keepers.https://www.vg.no/nyheter/utenriks/i/Q7Oqmq/stormet-kongressen-doemt- til-18-aar-i- fengsel?utm_source=vgfront&utm;_content=hovedlopet_row17_pos1&utm;_medium=dre-646fa47f868247a3090eec89. VG.no. Retrieved 2023-05-25 *17 years in prison; Joe Biggs was a leader of the Proud Boys [a group of activists].https://yle.fi/a/74-20048017. Yle.fi. Retrieved 2023-09-01 *22 years in prison; Enrique Tarrio was a leader of the Proud Boys. His indictment said that he had a role as a coordinator (or someone helping) the attack in 2021; Tarrio was not at the Capitol during the attack. ===Trials=== On March 8, 2022, a jury said Guy Wesley Reffitt was guilty of five crimes, including trying to stop Congress from doing its job (counting the votes) and bringing an illegal weapon (a pistol) into the Capitol. Prosecutors showed the jury a video that Reffitt had made of himself breaking into the Capitol and telling other rioters to hurt Speaker of the House Nancy Pelosi. Reffitt's son testified against him.https://yle.fi/a/74-20112059. Retrieved 2024-09-19 A 14-day prison sentence was handed down for Couy Griffin, a local politician. Earlier (March 22, 2022), a judge said Couy Griffin was guilty of one crime: Illegally going inside the Capitol. Griffin had asked to be tried by only a judge instead of a judge and jury. ==Related pages== * 2023 invasion of the Brazilian Congress (inspired by the Capitol attack) ==References== Category:2020 United States presidential election Category:2021 riots Category:2020s in Washington, D.C. Category:Attacks on buildings and structures in 2021 Category:Attacks on buildings and structures in the United States Category:Crime in Washington, D.C. Category:Donald Trump Category:January 2021 events Category:Joe Biden Category:Riots in the United States *",
 "title": "January 6 United States Capitol attack"
}