{
 "id": "886704",
 "text": "The People's Republic of Bulgaria was the official name of Bulgaria, when it was a socialist republic from 1946 to 1990. ==Background== It was ruled by the Bulgarian Communist Party (BCP) together with the Bulgarian Agrarian People's Union. Bulgaria was closely allied with the Soviet Union during the Cold War, being part of Comecon and member of the Warsaw Pact. The Bulgarian resistance movement during World War II deposed the Kingdom of Bulgaria administration in the Bulgarian coup d'état of 1944 which ended the country's alliance with the Axis powers and led to the People's Republic in 1946. ==Society== The BCP modelled its policies after those of the Soviet Union. They transformed the country over the course of a decade from an agrarian peasant society into an industrialized socialist society. ===In the 1950s=== In the mid-1950s after the death of Stalin, the party's hardliners lost influence and a period of social liberalization and stability followed under Todor Zhivkov. ===Since 1960s=== After a new energy and transportation infrastructure was made, by 1960 manufacturing became the dominant sector of the economy and Bulgaria became a major exporter of household goods and later of computer technologies. It earned the nickname of \"Silicon Valley of the Eastern Bloc\". The country's high productivity levels and high scores for social development made it a model for other socialist countries' policies. ==Disestablishment== In 1989, political reforms were started. Todor Zhivkov, who had served as head of the party since 1954, was removed from office in a BCP congress. In 1990, under the leadership of Aleksandar Lilov, the BCP changed its name to the Bulgarian Socialist Party (BSP) and adopted social democracy and democratic socialism in place of Marxism–Leninism. Following the BSP victory in the 1990 election, which was the first openly contested multi-party election since 1931, the name of the state was changed to the Republic of Bulgaria. Geographically, the People's Republic of Bulgaria had the same borders as present-day Bulgaria. It bordered the Black Sea to the east; Romania to the north; Yugoslavia (via SRs Serbia and Macedonia) to the west and Greece and Turkey to the south. ==References== Category:1946 establishments in Europe Category:1940s establishments in Bulgaria Category:1990 disestablishments in Europe Category:Former socialist republics Category:Former dictatorships",
 "title": "People's Republic of Bulgaria"
}