{
 "id": "886740",
 "text": "The Lion of Al-lāt (Arabic أسد اللات) is an old statue. It is a decoration of the Temple of Al-Lat in Palmyra, Syria. On 27 June 2015, it was badly damaged by the Islamic State of Iraq and the Levant (ISIL). The damage took place after the ISIL had captured Palmyra. The statue was kept at the National Museum of Damascus for repairing. Presently, it is standing again. == Description == The statue of the lion is shown as holding a gazelle. It was made from limestone ashlars in the early first century A.D. It measured in height. It weights 15 tonnes. The lion was regarded as the husband of goddess Al-lāt. The gazelle depicts Al-lāt's tender and loving traits. Bloodshed was not allowed under punishment of Al-lāt's revenge. The lion's left paw had a partially damaged Palmyrene inscription. The inscription (PAT 1122) reads like this: tbrk ʾ[lt] (Al-lāt will bless) mn dy lʾyšd (whoever will not shed) dm ʿl ḥgbʾ (blood in the sanctuary).Van Baaren (1982), p. 65 and Reinhard G. Lehmann: “Kein Blutvergießen!” Die Löweninschrift der ʾAllāt von Palmyra, in: ḤBL Tadmor. Studies in Palmyrene Script and Language. KUSATU 23 (2018), pp. 3-8. == History == In 1977, the statue was discovered by some Polish archeologists from the Polish Centre of Mediterranean Archaeology of the University of Warsaw (PCMA UW). They were working under Prof. Michał Gawlikowski. The PCMA UW logo design was based on the lion of Al-lāt. The statue was found in pieces. It had been reused in old times for the temple's foundation. Later, the pieces were collected in front of the gate of the Palmyra Museum. The work was done by restorer Józef Gazy. In 2005, it was restored to prevent problems from collection. Finally, the piece was restored. It was made like its original looks – a relief art jumping out from a wall. During the Syrian Civil War, the statue was covered with a metal plate and sandbags. It is to protect the statue from destruction. On 27 June 2015, it was badly damaged by the Islamic State of Iraq and the Levant. It was after they had captured Palmyra. After the freedom of Palmyra by the Syrian army, Maamoun Abdulkarim announced that the pieces were still in place. Further, he said that it was possible to put them back together. He was giving hopes for reconstruction. The statue was moved to Damascus in 2016. There, it was completely restored. On 1 October 2017, it was fully restored. Presently, it is placed in the National Museum of Damascus. This is for its safety. Later, it will be moved to Palmyra again. == References == Category:History of Syria Category:Statues Category:Monuments and memorials Category:1st-century works",
 "title": "Lion of Al-lāt"
}