{
 "id": "886743",
 "text": "Pixiu (; Old Chinese (ZS) *bi-qʰu) is a Chinese mythical creature. Pixiu are considered powerful protectors of feng shui practitioners. They look like strong, winged lions. A Pixiu is a special creature for wealth. It is said to have a want for gold, silver, and jewels. So, Pixiu are always regarded as special creatures that have sacred powers of drawing cai qi ( wealth) from all directions. According to the Chinese zodiac, it is helpful for unlucky people. == Gender == There are two kinds of Pixiu based on their antlers. The one with two antlers is the female. She is called a Bìxié. The one with one antler is the male. He is called a Tiānlù. *Bìxié (; lit. \"to ward off evil spirits\"): The female wards off evil. They can help any sufferers from bad feng shui. *Tiānlù (): The male takes care of wealth. He searches for gold and other wealth. When he returns to his master's house, the Bìxié guards the riches. Displaying Tiānlù at home or in the office is said to stop wealth from flowing away. Pixiu can smell gold and silver. They bring their masters money in their mouth. Statues of this creature are often used to attract wealth in feng shui. Today, Pixiu are a popular design on jade necklaces. It was also shown as a design on the sword of Fa Mulan's character in the 1998 Disney animated feature movie, Mulan. ==Mythology== Once Pixiu broke the rules of Heaven by discharging faeces on the floor of Heaven. When it was found out, it was punished by the Jade Emperor. The punishment of spanking was hard enough to cause its anus to be permanently sealed. The Jade Emperor further announced that the food of the Pixiu would be restricted to gold, silver, and jewels. Another story describes the Pixiu as the well-behaved youngest son of the Dragon King. He was spoiled by his parents. One day, Pixiu played on the Dragon King's desk and broke a seal by mistake. The seal showed the power of the Dragon King. The Dragon King became very angry. He used magic to turn Pixiu into an animal. He then sealed his rectum. He announced that from then on, Pixiu could only eat things representing wealth. Pixiu have a fame of being wild animals. The large fangs can be seen in their mouths. These are used to attack demons and evil spirits. It could convert them to wealth. Pixiu also guard against disease caused by these evil spirits. Pixiu patrols the Heavens to keep demons away and to protect their owners from all harms. Pixiu would always and constantly guard its master, even after he passed from this life onto the next world. Pixiu would help their masters to go to Heaven by flying them up to Heaven on their backs. == References == Category:Chinese mythology Category:Dragons Category:Legendary creatures",
 "title": "Pixiu"
}