{
 "id": "886927",
 "text": "Critical race theory (CRT) is a way that scholars study and teach civil rights and the history of race, especially in the United States. Critical race theory shows another way of thinking and doing things than mainstream American liberal racial justice. CRT looks at social, cultural, and legal things and the way they affect race and racism. CRT says that the reason white people ended up and stayed richer and more politically powerful than people of other races was not only because of people acting racist on purpose. It was also because of complicated, changing social rules that people didn't always know were there. American legal scholars started CRT in the mid-1970s. Derrick Bell, Alan Freeman, Kimberlé Crenshaw, Richard Delgado, Cheryl Harris, Charles R. Lawrence III, Mari Matsuda, and Patricia J. Williams wrote about it. It became a movement by the 1980s. Critical race theory included some theories of critical legal studies (CLS) but it put more focus on race. CRT uses critical theory and scholars Antonio Gramsci, Sojourner Truth, Frederick Douglass, and W. E. B. DuBois are in it, as well as the Black Power, Chicano, and radical feminist movements from the 1960s and 1970s. CRT scholars think about race as an intersectional social construct. \"Social construct\" means that it comes from society's rules and not from the physical world. For example, money is a social construct. A piece of paper is worth money because the society agrees that it is. For example, which continent someone's ancestors came from is a real thing. However, whether or not that is important is a social construct. When CRT says that race is not \"biologically grounded and natural,\" it does not mean that human beings from different parts of Earth do not look different. It means that the rules around looking different are made up. Instead, they think of race as an idea that makes life easier for white people by making it worse for people in other races. In legal studies, CRT says that even laws that are color blind, meaning laws that look like they are not about race, can still have racist effects. CRT focuses on intersectionality, which means that race affects other identities, for example gender and social class, to produce complicated effects on power and advantage. Scholars who do not think CRT is good say that CRT acts as if storytelling is more important than evidence and logic, that it does not treat truth and merit as important enough, and that it does not value liberalism enough. Since 2020, conservative U.S. lawmakers have tried to keep CRT and other antiracism education out of primary and secondary schools. CRT is only taught at the university level, though some lower-level curricula do teach some CRT without calling it that. Supporters of CRT say these lawmakers don't talk honestly about CRT and that what they really want is for people to stop talking about racism, equality, social justice, and the history of race in America. ==Definitions== In his introduction to the comprehensive 1995 publication of critical race theory's key writings, Cornel West describes CRT as \"an intellectual movement that is both particular to our postmodern (and conservative) times and part of a long tradition of human resistance and liberation.\" Law professor Roy L. Brooks defines critical race theory in 1994 as \"a collection of critical stances against the existing legal order from a race-based point of view\". Education Week describes the core of CRT as the idea that that race is a social construct and racism is neither an individual bias nor prejudiceit is \"embedded in the legal system\" and supplemented with policies and procedures. University of Alabama School of Law professor Richard Delgado, a co-founder of critical race theory, defines it in 2017 as \"a collection of activists and scholars interested in studying and transforming the relationship among race, racism, and power\". Gloria Ladson-Billings, a pedagogical theorist who introduced CRT to the field of education in 1994, describes CRT as an \"interdisciplinary approach that seeks to understand and combat race inequity in society.\" ==Early years== Delgado and legal writer Jean Stefancic wrote an article in 1998 called \"Critical Race Theory: Past, Present, and Future.\" According to that article, CRT began with Derrick Bell in his 1976 Yale Law Journal article, \"Serving Two Masters\" and his 1980 Harvard Law Review article \"Brown v. Board of Education and the Interest-Convergence Dilemma.\" Bell started out as a civil rights lawyer. He won 300 civil rights cases for the NAACP in Mississippi. Later, he worked as a professor at Harvard Law School. There, Bell made new classes about American law and how it worked with race. In 2001, Delgado and Stefancic also wrote Critical Race Theory: a Introduction. That book talked about Bell's \"interest convergence\" as a \"means of understanding Western racial history.\" The focus on desegregation after the 1954 Supreme Court decision in Brown v. Board of Educationdeclaring school segregation unconstitutionalleft \"civil-rights lawyers compromised between their clients' interests and the law.\" Many Black parents wanted better schools for their children but the lawyers wanted a \"breakthrough,\" a famous case that would change things for the whole country. In 1995, Cornel West said that Bell was \"virtually the lone dissenter\" because he wrote articles in famous law review publications challenging the ways people thought about the law and people of color. Bell wrote his own material for the classes he taught. In 1970, he turned them into a book called Race, racism, and American law. He became Harvard Law School's first Black tenured professor in 1971. In 1980, Bell resigned from the university because he thought it was doing racist things, and he became the dean at University of Oregon School of Law. Later, he went back to Harvard as a visiting professor. While he was away from Harvard, his supporters organized protests against Harvard's lack of racial diversity in the classes, student body, and teachers. In 1981, one student protest started a new class based on Bell's course and textbook. In that class, students brought in visiting professors, such as Charles Lawrence, Linda Greene, Neil Gotanda, and Richard Delgado, to teach Race, racism, and American law. The students asked faculty members who were people of color to teach the new courses. The university said no to the things the students wanted. They said there was no black instructor who was qualified to teach the course. Legal scholar Randall Kennedy wrote that some students had \"felt affronted\" by Harvard's choice to hire an \"archetypal white liberal... in a way that precludes the development of black leadership.\" Delgado and Stefancic said Alan Freeman, who wrote in the 1970s, was also part of the beginning of critical race theory. In his 1978 Minnesota Law Review article, Freeman wrote about the Supreme Court and civil rights laws from 1953 to 1969. He said their interpretation of the law was too narrow to stop racial discrimination. In his article, Freeman said there were two ways to look at racial discrimination: victim and perpetrator. To the victim, racial discrimination was about real- world conditions and about the \"consciousness associated with those objective conditions.\" To the perpetrator, racial discrimination was only about being able to perform actions without thining about the real-world conditions of the victims, such as the \"lack of jobs, lack of money, lack of housing.\" In 1989, Kimberlé Crenshaw, Neil Gotanda, and Stephanie Phillips did a workshop at the University of Wisconsin-Madison. They called it \"New Developments in Critical Race Theory.\" This was when people started calling it \"Critical Race Theory.\" They said it would be an \"intersection of critical theory and race, racism, and the law.\" Crenshaw chose Harvard to study under Bell because she had learned about him at Cornell. Crenshaw organized the alternative course using Bell's course materials. She was part of a group of students who considered themselves part of the \"post-civil rights generation\". After this meeting, legal scholars started writing more articles with critical race theory in them, including over \"300 leading law review articles\" and books. In 1990, Duncan Kennedy published an article about affirmative action in law schools in the Duke Law Journal, and Anthony E. Cook published his article \"Beyond Critical Legal Studies\" in the Harvard Law Review. In 1991, Patricia Williams published The Alchemy of Race and Rights, while Derrick Bell published Faces at the Bottom of the Well in 1992. Cheryl I. Harris published her 1993 Harvard Law Review article \"Whiteness as Property\" in which she described how looking like a white person led to benefits similar to owning property. In 1995, 24 legal scholars contributed to a major compilation of key writings on critical race theory. Although CLS criticized the way the legal system had made and protected social structures that allowed racism or made it worse, CLS did not talk about how to solve this problems. Derrick Bell and Alan Freeman said that CLS could not provide solutions unless it talked about race and racism. CRT criticized CLS for focusing too much on class and economic structures and not enough on race. ===Growth and expansion=== In 1995, Gloria Ladson-Billings and William F. Tate started using critical race theory in education. In an article they wrote in 1995, Ladson-Billings and Tate talked about why education focused on what white people think of as normal. They looked at how schooling was not always fair and equal. Other scholars have since spread this to school segregation in the U.S.; relations between race, gender, and academic achievement; pedagogy; and ways of studying social problems. According to University of Edinburgh philosophy professor, Tommy J. Curry, by 2009, many agreed with CRT's idea that race was socially constructed, not \"biologically grounded and natural.\" \"Social construct\" means that even though how much dark pigment different people have in their skin is a real thing, and which continent their ancestors came from is a real thing, whether or not those facts are important is made up by society. For example, money is a social construct. A round piece of metal is real. A piece of paper with ink on it is real. But societies decide whether the metal is a coin and whether the paper is paper money. , over 20 American law schools and at least three non-American law schools offered critical race theory courses or classes. Critical race theory is also used in education, political science, women's studies, ethnic studies, communication, sociology, and American studies. Critical race theory also works with specific groups, for example Latino-critical (LatCrit), queer- critical, and Asian-critical movements. These groups work with with the main body of critical theory research. Over time, they found their own goals and ways of finding information. CRT has also been taught outside the United States, including in the United Kingdom and Australia. == Common themes == Richard Delgado and Jean Stefancic say that critical race theory has several themes: * Critique of liberalism: Critical race theory asks whether regular liberalism is right or wrong about Enlightenment rationalism, legal equality and constitutional neutrality. Critical race theory says the incrementalist approach of traditional civil-rights discourse is not so good. The incrementalist approach is about taking small steps at a time. Increments are steps. Critical race theory favors a race-conscious approach to social transformation. Critical race theory asks people to check whether affirmative action, color blindness, role modeling, and the merit principle really are good or bad and how much preferring political organizing over liberalism's reliance on rights-based remedies. * Storytelling, counter-storytelling, and \"naming one's own reality\": Critical race theory says it is good to use storytelling to talk about how racial oppression affects people's real lives. Bryan Brayboy talks about the importance of storytelling in Indigenous American communities and he proposed a Tribal Critical Race Theory (TribCrit). * Revisionist interpretations of American civil rights law and progress: Criticism of civil-rights scholarship and anti-discrimination law, such as Brown v. Board of Education. Derrick Bell, one of CRT's founders, argues that civil-rights advances for black people coincided with the self-interest of white elitists, which Bell termed interest convergence. Mary L. Dudziak searched through records in the U.S. Department of State and Department of Justice and found that U.S. government support for civil-rights legislation \"was motivated in part by the concern that racial discrimination harmed the United States' foreign relations.\" * Intersectional theory: This is the study of how race works with and against other things that affect people's lives, for example sex, social class, national origin, and sexual orientation. For example, studying how the needs of a Latina female are different from those of a black male. * Standpoint epistemology: This is the idea that someone who is a member of a specific minority group has more authority to talk about that group that people outside that group do not have. For example, a Korean person has more authority to talk about being Korean than a white or black person does. Critical race theory also says that this can show where the law does not really treat people equally. * Essentialism vs. anti-essentialism: This is about how important race is and whether it is more important than other things. Delgado and Stefancic write, \"Scholars who write about these issues are concerned with the appropriate unit for analysis: Is the black community one, or many, communities? Do middle- and working-class African-Americans have different interests and needs? Do all oppressed peoples have something in common?\" This talks about how even people who are in the same group or look like they are in the same group might need different things. This is because their lives are not only about being in that one group. They may be in more than one group. * Structural determinism: Exploration of how \"the structure of legal thought or culture influences its content\" in a way that determines social outcomes. * Empathetic fallacy: This is the idea that people can change other people's minds by telling a story to try to get them to understand how other people suffer or are harmed. This is called empathy. According to CRT, empathy is not enough to change racism because most people do not meet enough people who are different from themselves and most people do not look for stories about people in other groups. * Non-white cultural nationalism/separatism: This is the most radical idea. It is that people in different racial groups should think about living in different countries or other structures. This is connected to separatism and reparations, both for foreign aid and black nationalism. === Internalization === Scholar Karen Pyke studied and wrote papers about internalized racism or internalized racial oppression. This is when people who suffer from racism start to believe that they are not as good as whites or that their culture is not as good as white culture. They think this not because they are less intelligent or easier to trick than other people are. Instead, it is because this is how authority and power in society make people feel. === Institutional racism === Camara Phyllis Jones defines institutionalized racism like this: In other words, institutionalized racism is when the society is set up to help some people more than others and hurt some people more than others and it isn't always easy to see this happening. With institutionalized racism, a white person does not need to do anything racist to a non-white person. The rules of the society do it for them. For example, the schools in white neighborhoods might have more and newer computers than the schools in black neighborhoods, which means the white schoolchildren will get better grades even if the black schoolchildren work just as hard. The people at the white school might not know that the people at the black school have worse computers. In English, we say this as, \"this is not a level playing field.\" === Influence of critical legal studies === Critical race theory is like critical theory, critical legal studies, feminist jurisprudence, and postcolonial theory. Tommy J. Curry wrote that the epistemic ways in which these ways of thinking are similar come from idealism. Idealism is about discourse (i.e., how individuals speak about race) and the theories of white Continental philosophers and the way they talk about structural and institutional stories about white supremacy. These ways of speaking and thinking are important to realist analysis of racism from Derrick Bell's early writing,. Black thinkers, for example, W. E. B. Du Bois, Paul Robeson, and Judge Robert L. Carter wrote about them even more. Critical race theory uses the things critical legal studies says are important. It also uses ways of looking at things from critical legal studies and civil rights scholarship, but it also argues with them. Critical race theory takes its theory from many places. Angela P. Harris says critical race theory has the same \"commitment to a vision of liberation from racism through right reason\" as civil rights tradition. It deconstructs some premises and arguments of legal theory and simultaneously holds that legally constructed rights are incredibly important. Derrick Bell says that Harris thinks critical race theory is committed to \"radical critique of the law (which is normatively deconstructionist) and... radical emancipation by the law (which is normatively reconstructionist).\" == Applications == Scholars of critical race theory have used it to look at hate crime and hate speech. The U.S. Supreme Court made a ruling on hate speech in R.A.V. v. City of St. Paul in 1992. In that ruling, the Court struck down an anti-bias ordinance. In that case, a teenager who had burned a cross. Mari Matsuda and Charles Lawrence argued that the Court had not looked closely at the history of racist speech and the actual injury that racist speech can cause.Matsuda, Mari J., and Charles R. Lawrence. 1993. \"Epilogue: Burning Crosses and the R.A.V. Case.\" In Words That Wound: Critical Race Theory, Assaultive Speech and the First Amendment, edited by M. J. Matsuda et al. Critical race theorists also say affirmative action is good. They say that rules for whom to fire or whom to let into a good school that are officially based only on \"merit,\" for example grades alone, are not really race-neutral. == Criticism == ===Academics and jurists=== According to the Encyclopedia Britannica, \"aspects of CRT have been criticized by legal scholars and jurists from across the political spectrum.\" Critics say it has a \"postmodern way of looking at the truth. It also says critical race theory opposes \"the traditional liberal ideals of neutrality, equality, and fairness in the law and legal procedures and of unreasonably spurning the notion of objective standards of merit in academia and in public and private employment, instead interpreting any racial inequity or imbalance in legal, academic, or economic outcomes as proof of institutional racism and as grounds for directly imposing racially equitable outcomes in those realms.\" People who want to use CRT have also been accused of calling criticism of CRT racist. In 1997, law professors Daniel A. Farber and Suzanna Sherry said that critical race theory did not have enough evidence to support it. Instead, they said, it was based on the belief that reality was a socially construct, that it pushed away evidence to use storytelling instead, rejected truth and merit as ways of looking at political dominance, and rejected the rule of law. In 1995, Farber and Sherry wrote that anti-meritocratic tenets in critical race theory, critical feminism, and critical legal studies may unintentionally lead to antisemitic and anti-Asian implications. They wrote in 1997 that if the system really is unfair in its structure the way critical race theorists say it is, then the success of Jews and Asians might make people say they cheated. In 2017, Delgado and Stefancic wrote a response: They said that there was a difference between criticizing an unfair system and criticizing individuals who do well inside that system. In a 1999 Boston College Law Review article called Race, Equality and the Rule of Law: Critical Race Theory's Attack on the Promises of Liberalism, First Amendment lawyer Jeffrey J. Pyle said that critical race theory undermined confidence in the rule of law. He wrote that \"critical race theorists attack the very foundations of the liberal legal order, including equality theory, legal reasoning, Enlightenment rationalism and neutral principles of constitutional law.\" === Political controversies === Critical race theory inspired many arguments in the United States. The first were in the 1980s. People argued about the way critical race theory questioned color blindness. Color blindness, in this article, means the idea that one person can completely ignore another person's race and treat them fairly no matter what. People also argued about how critical race theory used narrative in legal studies, advocating \"legal instrumentalism\" instead of ideal-driven uses of the law. People also argued about how critical race theory looked at the U.S. Constitution and other laws and they way they hleped white people keep power over other people. People also argued about how critical race theory encourages legal scholars to work for racial equity. One example of an instrumentalist approach is when lawyer Johnnie Cochran's defended O. J. Simpson in the O. J. Simpson murder case. Cochran told the jury to say Simpson was not guilty of killing his ex wife and her friend, even though there was evidence against him as payback for the way the United States and the Los Angeles Police department had treated black people. This was a form of jury nullification. Before and after the 2020 U.S. presidential election, Donald Trump opposed the teaching of critical race theory in schools as part of his platform. Other conservative politicians did so too on Fox News and right-wing radio shows. ==== 1990s ==== When Bill Clinton nominated Lani Guinier for Assistant Attorney General, Republicans said she should not get the job. One of their reasons was that she supported CRT. Clinton withdrew the nomination due to disagreements with her legal philosophy. ==== 2010s ==== In 2010, a state law stopped a Mexican-American studies university program in Tucson, Arizona because it said public schools could not teach race-conscious education by \"advocat[ing] ethnic solidarity instead of the treatment of pupils as individuals.\" The law banned books, including a book about CRT, from the school. State officials banned Matt de la Peña's young-adult novel Mexican WhiteBoy because they said it contained critical race theory. The rules against ethnic-studies programs were later declared unconstitutional because lawyers were able to prove that the state had meant to discriminate against some groups of people on purpose: \"Both enactment and enforcement were motivated by racial animus,\" federal Judge A. Wallace Tashima ruled. ==== 2020s ==== ===== Australia ===== In June 2021, the media reported that the proposed lessons for Australia's schools was \"preoccupied with the oppression, discrimination and struggles of Indigenous Australians.\" The Australian Senate approved a motion from right-wing senator Pauline Hanson asking the federal government to not use CRT, even though there was no CRT in in the lessons. ===== United Kingdom ===== Conservatives in the government of the United Kingdom began to criticize CRT in late 2020. Equalities Minister Kemi Badenoch, who is of Nigerian descent, said during a parliamentary debate to mark Black History Month: In an interview in The Spectator, Badenoch said, \"many of these booksand, in fact, some of the authors and proponents of critical race theoryactually want a segregated society.\" 101 writers from the Black Writers' Guild responded in an open letter, telling Badenoch she was wrong to criticize books like White Fragility and Why I'm No Longer Talking to White People About Race. ===== United States ===== The Washington Post says that conservative lawmakers and other conservatives have used the term \"critical race theory\" as a \"catchall phrase for nearly any examination of systemic racism.\" In September 2020, conservative activist Christopher Rufo denounced CRT on Fox News, and then Donald Trump issued an executive order saying the United States federal government must cancel funding for programs that talk about \"white privilege\" or \"critical race theory.\" President Trump said that this was because critical race theory was \"divisive, un-American propaganda\" and \"racist.\" Rufo wrote on Twitter, \"The goal is to have the public read something crazy in the newspaper and immediately think 'critical race theory,'\" meaning that conservatives were trying to trick the public into thinking critical race theory was bad. In a speech on September 17, 2020, Trump said critical race theory was bad. He said he had formed the 1776 Commission to promote \"patriotic education.\" On January 20, 2021, Joe Biden took back Trump's order and ended the 1776 Commission. Conservative think tanks and other conservative groups continued to work on opposition to both actual critical race theory and what they mistakenly thought was critical race theory. These groups include the Heritage Foundation, the Idaho Freedom Foundation, and the American Legislative Exchange Council. In early 2021, potential laws were started. These laws would limit the teaching of critical race theory in public schools in Idaho, Iowa, Oklahoma, Tennessee, and Texas. Several of these bills used the words \"critical race theory\" or talked about the New York Times 1619 Project. In mid-April 2021, a bill was introduced to the Idaho legislature that would have banned any educational entity in the state (schools and other things like schools) from teaching or advocating sectarianism, including critical race theory and other social justice programs. On May 4, 2021, the bill was signed into law by Governor Brad Little. On June 10, 2021, every member of the Florida State Board of Education voted to stop public schools from teaching critical race theory. They did this because governor Ron DeSantis asked them to. As of July 2021, 10 U.S. states have introduced bills or done other things that would limit teaching critical race theory, and 26 others were in the process of doing so. In June 2021, the American Association of University Professors, the American Historical Association, the Association of American Colleges and Universities, and PEN America released a joint paper saying that these laws were bad. By August 2021, 167 professional organizations had signed the statement. In August 2021, the Brookings Institution recorded that eight statesIdaho, Oklahoma, Tennessee, Texas, Iowa, New Hampshire, Arizona, and South Carolinahad passed laws on the critical race theory, though they also noted that none of the bills had passed, with the exception of Idaho's, actually contained the words \"critical race theory.\" Brookings also noted that these laws often also stop teaching about gender. Critics called the state laws a memory law and said that the law banning critical race theory was proof that critical race theory was right: that racism is part of the law in the United States. == Subfields == There are smaller groups in critical race theory for different communities of people. These groups look at race and the way it affects disability, ethnicity, gender, sexuality, class, and religion. For example, disability critical race studies (DisCrit), critical race feminism (CRF), Hebrew Crit (HebCrit), Black Critical Race Theory (Black Crit), Latino critical race studies (LatCrit), Asian American critical race studies (AsianCrit), South Asian American critical race studies (DesiCrit), and American Indian critical race studies, which is sometimes called TribalCrit. The methods developed for CRT have also been used to studying groups of white immigrants. In response to CRT, some scholars have asked for a second wave of whiteness studies. It is called Second Wave Whiteness (SWW). Critical race theory has also inspired scholars to study race outside the United States.See, e.g., . === Disability critical race theory === Disability critical race studies (DisCrit) combines disability studies and CRT to look at the intersection of disability and race. This means the way race and disability affect each other. === Latino critical race theory === Latino critical race theory (LatCRT or LatCrit) is a research framework that talks about the way society defines race. Latino critical race theory says this is important to how people of color are oppressed in society. Race scholars developed LatCRT as a critical response to the \"problem of the color line\" first explained by W. E. B. Du Bois. While CRT focuses on the Black–White paradigm, LatCRT has moved to consider other racial groups, mainly Chicana/Chicanos, as well as Latinos/as, Asians, Native Americans/First Nations, and women of color. In Critical Race Counterstories along the Chicana/Chicano Educational Pipeline, Tara J. Yosso discusses how the limits placed on POC can be defined. The tenets that separate such individuals are the intercentricity of race and racism, the problem of dominant ideology, the commitment to social justice, the centrality of experience knowledge, and the way of looking at things that uses many types of scholarship. LatCRT's main focus is to work for social justice for people living in communities that have been pushed to the edges of society (specifically Chicana/os). Chicanos are Mexican-Americans. Society has placed limits on them that put them at a disadvantage, like with other people of color. Social institutions act to dispossess Chicanos, stop them from voting, and discriminate against them. LatCRT seeks to give voice to those who are victimized. In order to do so, LatCRT has created two common themes: First, CRT says society keeps white supremacy and racial power in place; they do not stay there on their own. The law is a big part of keeping them where they are. Some racial groups do not have the voice to speak in this civil society. Because of this, CRT introduced a new form of expression, called the voice of color. The voice of color is narratives and storytelling monologues used as devices for conveying personal racial experiences. These are also used to counter metanarratives that continue to maintain racial inequality. In this way, the experiences of the oppressed are important parts of developing a LatCRT analytical approach. Second, LatCRT investigates the possibility of transforming the relationship between law enforcement and racial power and working for racial emancipation and an end to some groups being pushed around. LatCRT is different from general critical race theory in that it talks more about immigration theory and policy, language rights, and the way people are discriminated against for having accents or ancestors from other countries. CRT finds the experiential knowledge of people of color and works with their lived experience using data. LatCRT shows its research using many kinds of stories. === Asian critical race theory === Asian critical race theory looks at the way race and racism affect Asian Americans and their experiences in the U.S. education system. Like Latino critical race theory, Asian critical race theory is distinct from the main body of CRT in its emphasis on immigration theory and policy. == Related pages == * Judicial aspects of race in the United States == Notes== == References == * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * == Further reading == * * * * * * * Category:1970s establishments in the United States Category:Race Category:Racism Category:Academic disciplines Category:Critical theory",
 "title": "Critical race theory"
}