{
 "id": "88696",
 "text": "| misc6 = | owner = Steve Cohen (95%) Several others (5%) | manager = Carlos Mendoza | gm = Billy Eppler | presbo = Sandy Alderson }} The New York Mets are a professional baseball team based in New York City, New York in Citi Field. They compete in Major League Baseball (MLB) as part of the National League (NL) east division. The team started in 1962. The Mets won the World Series in the years 1969 and 1986. They play in Corona, New York and play in their stadium Citi Field, completed in 2009. Their colors are blue and orange. Their retired numbers are 42 (Jackie Robinson), 41 (Tom Seaver), 14 (Gil Hodges), 37 (Casey Stengel), 31 (Mike Piazza), 36 (Mike Piazza), 16 (Doc Gooden), and 24 (Willie Mays). The name \"Mets\" is short for \"Metropolitans\". There was an old team in the 1880s called the New York Metropolitans. The words \"Metropolis\" and \"Metropolitan\" are often used to describe very large cities. The Metropolitan Museum of Art, Metropolitan Opera, and Metropolitan Transportation Authority are among the other New York users of that word. The Mets first played their home games at the Polo Grounds. They opened Shea Stadium in 1964. After 45 seasons at Shea, they opened Citi Field in 2009, nextdoor to Shea. Shea was torn down during the 2009 season. The Mets have won the World series two times, in 1969 and 1986. In 1973, 2000, and 2015, the Mets went to the World Series, but lost to the Oakland Athletics, New York Yankees, and Kansas City Royals, respectively. ==Rivalries== ===Atlanta Braves=== The Braves–Mets rivalry is a rivalry between two teams in the National League East, featuring the Atlanta Braves and the Mets. ===Philadelphia Phillies=== The rivalry between the Mets and the Philadelphia Phillies from 2006 to 2008 was said to be among the \"hottest\" rivalries in the National League. ===New York Yankees=== The first regular season non-exhibition game between the Mets and the New York Yankees took place in 1997. Three years later, the teams met in the 2000 World Series. A series of games between the two New York City teams is called a Subway Series. ==New York Mets Foundation== A registered 501(c)(3) charity, the New York Mets Foundation is the philanthropic organization of the New York Mets. Founded in 1963, it funds and promotes charitable causes in the Mets community. One of these causes is Tuesday's Children, is a non-profit family service organization that \"has made a long term commitment to meet the needs of every family who lost a loved one in the terrorist attacks on September 11, 2001\". ==References== ==Other websites== * Official Website * History of the New York Mets * New York Mets Team Index * Ultimate Mets Database Category:1962 establishments in the United States Category:1960s establishments in New York (state)",
 "title": "New York Mets"
}