{
 "id": "887270",
 "text": "Yang Yuhuan () or Yang Guifei ( ) or Taizhen ()Old Book of Tang, vol. 51 was the wife of Emperor Xuanzong of Tang during his later years. She is known as one of the Four Beauties of ancient China. During the An Lushan Rebellion, Emperor Xuanzong and his men were moving from the capital Chang'an to Chengdu. At that time, the emperor's guards demanded that he should kill Yang. It was because they blamed the rebellion on her cousin Yang Guozhong and the rest of her family. The emperor tried to stop this but he failed. So, he ordered his attendant Gao Lishi to kill Yang by strangling. == Background == Yang was born in 719 during the reign of the Tang Dynasty. It was early in the time of Emperor Xuanzong. Yang's father Yang Xuanyan () served as a census official at Shu Prefecture (; in modern Chengdu, Sichuan). His family went there with him. He had no sons, but had four daughters. These daughters were known to history as Yang Yuhuan and three older sisters. Yang's father died when she was very young. So, she was raised by her uncle Yang Xuanjiao (). Her uncle was a low- ranking official at Henan Municipality (; modern Luoyang). == Princess and Taoist nun == In 733, fourteen-year-old Yang Yuhuan married Li Mao. Li Mao was the Prince of Shou and the son of Emperor Xuanzong and Consort Wu. Yang had the title of Princess of Shou. Consort Wu died in 737. So, Emperor Xuanzong was very sad by the death. Some time later, Princess Yang came into Xuanzong's favor. So, the Emperor decided to take her as his wife. But Princess Yang was already the wife of his son. So, Emperor Xuanzong arranged her to become a Taoist nun. The name Taizhen was given to her to avoid bad fame from the people. He planned of making her his wife. Yang stayed for a some time as a Taoist nun in the palace itself. Emperor Xuanzong married his son with a new bride. After that, he made Yang his imperial consort. == Imperial consort == In 745, Emperor Xuanzong officially made Taizhen an imperial consort. She was given the rank of Guifei. Guifei was greater than the previously highest rank of Huifei. He gave honors on her dead father Yang Xuanyan. He also granted her mother the title of Lady of Liang. He also gave high offices to her uncle Yang Xuangui () and cousins, Yang Xian () and Yang Qi (). Her three elder sisters were given the ranks of Ladies of Han, Guo, and Qin. The five Yang family members - Yang Xian, Yang Qi, and the Ladies of Han, Guo, and Qin were said to be honored very much. All of the officials tried to praise them. At the same time, Consort Yang introduced her second cousin Yang Zhao (whose name was later changed to Yang Guozhong) to Emperor Xuanzong. Yang Zhao praised the emperor very much. So, his position rose quickly. Consort Yang was so favored by the Emperor. Whenever she rode a horse, the eunuch Gao Lishi would take her care. 700 workers were engaged to sew clothes for her. Officials and generals praised her by offering many tributes. In 746, she made Emperor Xuanzong angry by being jealous. She was rude to him. So, he had sent her to Yang Xian's house. Gao knew that the emperor missed Consort Yang. So, he requested the Emperor to send all the treasures in Consort Yang's palace to her. Emperor Xuanzong agreed with that. He sent imperial meals to her as well. That night, Gao requested the Emperor Xuanzong to welcome Consort Yang back to the palace. It was readily accepted by Emperor Xuanzong. After that, she was even more favored. No other imperial consorts could have his favor. In 747, the military governor (jiedushi) An Lushan came to the capital Chang'an to meet Emperor Xuanzong. Emperor Xuanzong showed him much favor. He allowed him to enter into his palace. An had an honor from Consort Yang as a mother. In 750, Consort Yang again made Emperor Xuanzong angry with her words. He sent her back to her clan. The official Ji Wen () told Emperor Xuanzong that he had overreacted. Emperor Xuanzong fell sorry for his actions. He again sent imperial meals to her. She wept to the eunuchs bringing the meal. She cut off some of her hair. She sent the hair back to Emperor Xuanzong. Emperor Xuanzong sent Gao to bring her back to the palace. After this, he even loved her more than ever. In 751, An Lushan again visited Chang'an. On An's birthday on 20 February, 751, Emperor Xuanzong and Consort Yang gave award to him. On 23 February, An was called to the palace. At this time, Consort Yang pleased Emperor Xuanzong. She had an very big child wrapping. She wrapped the fat An in it. This caused much laughter among the ladies in waiting and eunuchs. Emperor Xuanzong asked what was going on. Consort Yang's attendants joked that Consort Yang gave birth to a baby, Lushan. Emperor Xuanzong was very happy with the funny situation. So, he rewarded both Consort Yang and An greatly. After that, An was allowed freedom to enter into the palace. False news about the affairs between An and Consort Yang was spread. But Emperor Xuanzong stopped the false news. == An Lushan's rebellion and Consort Yang's death == Yang Guozhong and An Lushan soon were in conflict. Yang Guozhong repeatedly acted badly. For example, he captured and killed many staff members from An's house in Chang'an. In 755, An finally rebelled. He marched his armies toward the capital. The emperor wanted to control the public. Emperor Xuanzong thought of passing the throne to his crown prince, Li Heng. Yang Guozhong was not on having good relationship with the prince. So, he feared this development. He requested Consort Yang and her sisters, the Ladies of Han, Guo, and Qin, to speak against it. They did so. So, Emperor Xuanzong did not leave the throne. In 756, Yang Guozhong forced General Geshu Han to engage An Lushan. General Geshu Han was defeated. Tong Pass was the last major imperial defense. It fell to An's forces. Yang Guozhong suggested the emperor to escape to Chengdu. On 14 July, Emperor Xuanzong secretly left Chang'an for Chengdu. He was accompanied by Consort Yang, her family, and his close family members. He was also accompanied by Yang Guozhong, his fellow chancellor Wei Jiansu and the official Wei Fangjin (), the general Chen Xuanli. On 15 July, Emperor Xuanzong's team reached Mawei Courier Station (, in modern Xianyang, Shaanxi). The imperial guards were hungry and angry at Yang Guozhong. General Chen Xuanli believed that Yang Guozhong's actions had started this bad events. The imperial guards declared that Yang Guozhong was planning something with the Tibetans. They killed Yang Guozhong, his son Yang Xuan (), Consort Yang's sisters, the ladies of Han and Qin and Wei Fangjin. The soldiers then surrounded Emperor Xuanzong's place. The Emperor came out to comfort them. He even ordered them to go. But they refused to leave. Emperor Xuanzong sent Gao Lishi to ask General Chen Xuanli for his advice. Chen replied that the Emperor should kill Consort Yang. At first, the Emperor refused. But Wei E (, Wei Jiansu's son) and Gao Lishi got agreed with Chen. So, the Emperor also agreed. Gao took Consort Yang to a Buddhist shrine and killed her. Consort Yang's body was shown to Chen and the other imperial guard generals. After that, the soldiers went away and continued the journey. Consort Yang was buried at Mawei, without a coffin. In 757, Prince Li Heng had taken the throne as Emperor Suzong. He recaptured Chang'an and welcomed ex-Emperor Xuanzong. Xuanzong wanted to rebury Consort Yang's body with honor. The official Li Kui spoke against it. He pointed out that the imperial guard might again stand against it. However, Xuanzong secretly sent men to rebury her with a coffin. When he returned to Chang'an, a painter created a picture of Consort Yang in a secondary palace. He often went there to see the portrait. == Personal characteristics == Yang was known for having a larger figure. In the time of Tang dynasty, such body types were wanted so much. Because of that, Yang is often compared and contrasted with Empress Zhao Feiyan. The latter is known for being a slender person. This led to the four-character idiom huanfei yanshou (). This describes the physical range of the types of beauties between Zhao and Yang. == References == Category:Chinese royalty Category:710s births Category:756 deaths Category:People from Shanxi",
 "title": "Yang Guifei"
}