{
 "id": "887278",
 "text": "The Asia Cooperation Dialogue (ACD) is an intergovernmental organization created on 18 June 2002. It was created to promote Asian cooperation. The organization covers all of Asia. Its secretariat is in Kuwait. == History == The idea of an Asia Cooperation Dialogue was talked about at the First International Conference of Asian Political Parties (held in Manila between 17–20 September 2000) by Surakiart Sathirathai. People thought that Asia as a continent should have its own forum to discuss Asia-wide cooperation. The idea was formally put forward during the 34th ASEAN Foreign Ministers Meeting in Hanoi, 23–24 July 2001, and at the ASEAN Foreign Ministers Retreat in Phuket, 20–21 February 2002. === Ministerial meetings === Meeting Location Date(s) 1st Cha-am 18–19 June 2002 2nd Chiang Mai 21–22 June 2003 3rd Qingdao 21–22 June 2004 4th Islamabad 4–6 April 2005 5th Doha 23–24 May 2006 6th Seoul 5–6 June 2007 7th Astana 16–17 October 2008 8th Colombo 15–16 October 2009 9th Tehran 8–9 November 2010 10th Kuwait City 10–11 October 2012 11th Dushanbe 29 March 2013 12th Manama 26 November 2013 13th Riyadh 25 November 2014 14th Bangkok 9–10 March 2016 15th Abu Dhabi 16–17 January 2017 16th Doha 30 April 2019 === Summits === Summit Location Dates I Kuwait City 15–17 October 2012 II Bangkok 8–10 October 2016 III Tehran 2018 == Member states == The ACD was founded by 18 members. The organization currently has 34 states, listed below (it includes all current members of the ASEAN and the GCC). Overlapping regional organization membership in italics. Name Accession date Regional organization SAARC, ECO GCC, AL SAARC, BIMSTEC One more membership request was finally confirmed at the ACD Breakfast Meeting of 27 September 2004 SAARC, BIMSTEC ASEAN ASEAN, MGC SCO SAARC, BIMSTEC, MGC, SCO ASEAN ECO — CIS, ECO, SCO — GCC, AL CIS, ECO, SCO ASEAN, MGC ASEAN — ASEAN, BIMSTEC, MGC SAARC, BIMSTEC GCC, AL SAARC, SCO, ECO ASEAN, GCC, AL Located partially in Europe. CIS, CoE, SCO GCC, AL ASEAN SAARC, BIMSTEC CIS, ECO, SCO ASEAN, BIMSTEC, MGC CoE,Turkey is a European Union candidate since 1999. ECO, NATO GCC, AL CIS, ECO, SCO ASEAN, MGC == References == Category:Organizations based in Kuwait",
 "title": "Asia Cooperation Dialogue"
}