{
 "id": "887261",
 "text": "The Four Beauties or the Four Great Beauties are the four popular and beautiful Chinese women. They are Xi Shi, Wang Zhaojun, Diaochan and Yang Guifei.Big5.ce.cn. \"Big5.ce.cn .\" 昭君出塞——落雁. Retrieved on 2010-02-20.Big5.ce.cn. \"Big5.ce.cn .\" 貂蟬拜月——閉月. Retrieved on 2010-02-20. They all drew the attention of a ruling king or emperor in their respective times. They became famous by influencing the kings and emperors. Their actions impacted the Chinese history. Three of the Four Beauties controlled the kingdoms. Their lives ended in bad luck. == The Four Beauties of China == The Four Great Beauties lived in the time of four different dynasties. Each of them live hundreds of years apart. In chronological order, they are the following: === Xi Shi (c. 7th to 6th century BC, Spring and Autumn period) === Legend says that Xi Shi was so beautiful. When fish look at her, they forget to swim and sink below the water surface.Big5.ce.cn. \"Big5.ce.cn .\" 西施浣紗——沉魚. Retrieved on 2010-02-20. Xi Shi is from Zhuji, Zhejiang Province. Zhuji was the capital of the Ancient Yue Kingdom. Goujian was the King of Yue Kingdom. He went through ten years of hardship. He wanted to defeat Fuchai. Fuchai was the King of Wu Kingdom. Xi Shi was part of his plan. Xi Shi loved Fan Li. But Goujian gifted beautiful Xi Shi to Fuchai. It was done to attract him. Fuchai fell in love with her. Fuchai lost his fighting will after he met Xi Shi. He was making Xi Shi happy all the time. Due to this, Goujian was able to defeat Fuchai. Fuchai fell sad for accepting the gift. He killed himself. There are two stories of Xi Shi. In one story, Goujian killed her by drowning her. It was because he was afraid of being charmed by her like that of Fuchai. In another story, she came to Fan Li. They lived happily ever after. === Wang Zhaojun (c. 1st century BC, Western Han dynasty) === According to literature, the beauty of Wang Zhaojun would charm flying birds to fall from the sky. Wang Zhaojun had entered the harem of Emperor Yun at a young age. She remained as a lady-in-waiting. She was never visited by the emperor. At that time, the concubines of the emperor were chosen through the portraits. So, most women secretly gave money to the painters. It was done to make their portraits look more beautiful. Wang Zhaojun refused to do this. So, her portrait was painted as an ugly one. In 33 B.C., Hu Hanye visited the Imperial Court. He asked for a beautiful Han lady to be his wife. Therefore, he was presented with Wang Zhaojun. She was asked to appear before the court. The Emperor saw her in real life. Emperor Yun was shocked. The painter of her portrait was later killed for cheating the emperor. === Diaochan (c. 3rd century, Late Eastern Han/Three Kingdoms period) === Diaochan is said to be so bright and lovely. Literature says that the moon itself would shy away when compared to her face. Her father presented her to the warrior Lu Bu. He said that some day he could marry her. He then brought her to Dong Zhuo and did the same. He asked on taking her as a mistress immediately. Lu Bu found this out. He killed and burned Dong Zhuo. He took Diaochan as his own wife. === Yang Guifei (719–756, Tang dynasty) === According to literature, Yang Guifei's look puts all flowers to shame. She was known for having a larger body figure. During her time, such body types were considered beautiful. She was the imperial consort of Emperor Xuanzong of the Tang dynasty. During the An Lushan Rebellion, Emperor Xuanzong and his men were moving from the capital Chang'an to Chengdu. On the way, the emperor's guards demanded that the emperor should kill Yang. It was because they blamed the rebellion's cause on her cousin Yang Guozhong and her family members. The emperor tried to stop this but he failed. So, he ordered his attendant Gao Lishi to kill Yang. At first, she was buried without a coffin. Later, Emperor Xuanzong secretly sent men to rebury her with a coffin. When they found the body, it was already decomposed. When the Emperor returned to Chang'an, an artist painted a picture of Consort Yang in a secondary palace. He frequently went there to see her portrait. == References == Category:Chinese culture Category:Lists of women",
 "title": "Four Beauties"
}