{
 "id": "887248",
 "text": "Sir Edward Rosling (4 December 1863 - 19 January 1946) was a Ceylonese tea planter and politician. Edward Rosling was born 4 December 1863 in Barnes, Surrey, England. He was the eldest son of his parents. His father Joseph Rosling (1830 - 1890) was a timber merchant in Nutfield. His mother's name was Julia Victoria née Black (1838 - 1927). He had two half siblings: Mary (b.1858) and Katherine (b.1859) from his father's first marriage. He had three sisters: Margaret (b. 1866), Ethel (b.1869) and Josephine (b.1872) and one brother, Percy (b.1867). Rosling was educated at Queenwood College, Hampshire. In 1886, at the age of 23, he travelled to Ceylon. He was apprenticed as a \"creeper\" in Ceylon on a tea plantation in Ambagamuwa. In late 1888 he took up a position as a manager on a tea estate in Nanu Oya. He worked as a tea planter for 27 years. He served as the chairman of the Anglo-Ceylon and General Estates Company Limited. In 1899, he was elected as the president of the Hill Club in Nuwara Eliya. In 1900, he was elected as the chairman of the Planter's Association. After serving for a year, he was re-elected as chairman between 1909 and 1911. In November 1902, Rosling was appointed as an unofficial member of the Legislative Council of Ceylon and a Justice of the Peace. He served on the Council for ten years. He was retired from the Council in 1913. His position on the Council was later filled by William Duff Gibbon. He married to Isabella Graham White (1866-1958) on 28 June 1888 at Duncairn Church in Belfast, Ireland. They had seven children: Josephine (b.1890), Alfred (b.1892), Edward (b.1895), Isobel Phyllis (b.1898), Percy Campbell (b.1902), Edward (b.1904) and Hugh Patrick (b.1910). Rosling was knighted in June 1913 for his services on the Legislative Council of Ceylon.The London Gazette, 1 July 1913 (issue 28733), p. 4638. After retirement, he returned to England and became the chairman of the Ceylon Association in London between 1914 and 1915. He died on 19 January 1946 in Weybridge, Surrey, England. He is buried in the cemetery at St. Peter's church in Hersham, Surrey. ==Notes== ==References== Category:1863 births Category:1946 deaths Category:People from Surrey",
 "title": "Edward Rosling"
}