{
 "id": "887344",
 "text": "Jewel Changi Airport (also known as Jewel or Jewel Changi) is a nature-themed entertainment and retail complex on the inside of Changi Airport, Singapore, linked to three of its passenger terminals. Its highlight is the world's tallest indoor waterfall, known as the Rain Vortex, which is surrounded by a lot of plants. Jewel includes gardens, entertainment, a hotel, about 300 dining places, as well as early baggage check-in facilities before flying a plane. It covers a total size of , about 10 storeys – five aboveground and five underground levels. Its attractions include the Shiseido Forest Valley, an indoor garden which is about five storeys, and the Canopy Park at the highest level, featuring more gardens and places for relaxation. Jewel receives about 300,000 people a day. In October 2019, six months after its soft opening, it had welcomed 50 million people, exceeding its first target for the whole year. The complex and airport is located in Changi, at the eastern end of Singapore, approximately northeast from Singapore's Downtown Core. ==Conception== Jewel was made to maintain Changi Airport's status as a major flying hub in the Asia-Pacific. It was first mentioned by Prime Minister Lee Hsien Loong in his National Day Rally speech in 2013 as part of Changi Airport's long-term plans to double its capacity by the mid-2020s and \"create more opportunities for Singapore and Singaporeans\". Built over the former open-air car park in front of Changi Airport Terminal 1, Jewel expanded Terminal 1's arrival hall and baggage claim areas by 70%, and its handling capacity is also expected to increase from 21 to 24 million passengers a year. Jewel was officially opened on 18 October 2019 by Lee Hsien Loong, six months after its soft opening. During this time, it had received 50 million people – about 300,000 people a day – exceeding its initial target of 40-50 million people for the first year. Jewel was developed by Jewel Changi Airport Trustee Pte Ltd, a partnership between Changi Airport Group (CAG) and CapitaLand, through its own shopping mall business, CapitaLand Mall Asia. The project cost S$1.7 billion, and did not involve any government funds or taxpayers’ money. ==Design and development== Jewel's circle glass-and-steel façade was designed by a lot of architects, led by Moshe Safdie, who also designed Singapore's Marina Bay Sands. Renowned local firm RSP Architects Planners & Engineers were the executive architect and structural engineers. The landscape architect was Peter Walker and Partners, who co-designed the National 9/11 Memorial and worked with Safdie on the landscaping of Marina Bay Sands. Benoy were the interior designers; BuroHappold Engineering were responsible for the façade and Lighting Planners Associates handled the lighting.Jewel Changi Airport 6 May 2019 The Rain Vortex was engineered by water design firm WET Design. It has a 360-degree light and sound show projected onto it.World's tallest indoor waterfall inside Safdie Architects' Singapore airport building Dezeen, 12 March 2019 Jewel was imagined to put together a marketplace and an urban park. \"The component of the traditional mall is combined with the experience of nature, culture, education and recreation, aiming to provide an uplifting experience. By drawing both people and locals, we aim to create a place where the people of Singapore interact with the people of the world,\" said Safdie. The glass panels of the dome are framed in steel which rests on a complex frame. At night, the glowing dome can be seen from all surrounding areas. ==Attractions== ===Shiseido Forest Valley=== A partnership of Shiseido and art collective teamLab, the is one of Asia's largest indoor gardens, spanning five stories and approximately located in the heart of Jewel Changi Airport. It houses around 3,000 trees and 60,000 smaller plants of 120 different that live in high-altitude tropical forests from around the world. ===The Rain Vortex=== The Rain Vortex, sponsored as the HSBC Rain Vortex, is the world's largest and tallest indoor waterfall, standing at high. Recirculating rain water is pumped to the roof to free fall through a round hole at up to per minute to a basement-level pool. An acrylic funnel at the bottom prevents splashing and insulates the sound of the cascade. The toroid-shaped roof has more than 9,000 pieces of glass spanning with a sloped oculus as the mouth of the waterfall acting as \"a continuation of the building...completed in a liquid form.\" At night, the circular walls of the waterfall becomes a 360-degree stage for a light-and-sound show. To prevent excess humidity in the Jewel, the waterfall's flow changes direction often to reduce air turbulence. The design process by WET Design engineers included testing a one-fifth-scale model and a full-size partial sample. The Changi Airport Skytrain connecting the terminals passes above ground near the waterfall, allowing passengers remaining airside to see the Vortex and Jewel itself. ===Canopy Park=== At the highest level of Jewel, the Canopy Park houses recreation and leisure attractions. About half of the total landscaping is hosted at Canopy Park, including two gardens: Topiary Walk and Petal Garden. The Topiary Walk features animal-shaped topiaries at every corner, while the Petal Garden has seasonal floral displays. The park includes a suspension bridge called the Canopy Bridge that is located above the ground which offers a panoramic view of the Rain Vortex. At long, the Canopy Bridge also has a glass panel flooring at the centre section that offers a view through to level 1 of Jewel. The park also consists of two mazes, situated at the eastern end of the Jewel called the Hedge Maze and Mirror Maze. The Hedge Maze is Singapore's largest with hedge walls standing at high. The maze features gates that can be pushed within that will change the path of the maze. It ends at an elevated watchtower that offers a bird's-eye view of the entire maze. The Mirror Maze is located under the dome with plants branching across the top of the maze. The maze makes use of mirrors and various reflections. *Sky Nets The Sky Nets, also called the Manulife Sky Nets for sponsorship reasons, provide children's play facilities, including a Bouncing Net and a Walking Net. The Bouncing Net is long, suspended 8 metres above ground at its highest point. A separate long Walking Net lets people to look down s to Jewel's Level 1. *Discovery Slides The Discovery Slides feature four integrated slides: two tube slides and two sliding surfaces. The entire structure sits at an incline, high on one end, and close to on the other, and lets people to view the Forest Valley and the Rain Vortex. The Discovery Slides were designed by Carve and built by Playpoint in Singapore. *Foggy Bowls The Foggy Bowls are four concave bowls with depths of between and for people to jump in while mist is released to create an illusion of playing among clouds. === Changi Experience Studio === The Changi Experience Studio is a space with games and displays relating to Changi Airport's history and lets people a behind-the-scenes look of how the airport is run. ==Facilities== ===Hotel=== A hotel within Jewel, with about 130 rooms, operated by the international hotel brand, YOTEL, opened on 12 April 2019. It is YOTEL's second hotel in Singapore after the 2017 opening of the YOTEL on Orchard Road. ===Aviation facilities=== An ‘integrated multi- modal transport lounge’ provides ticketing, boarding pass collection and baggage transfer service in a single location. Early check-in facilities allows passengers to check-in and drop off luggage up to 24-hours ahead of regular check-in times. There are dedicated facilities for fly-cruise and fly- ferry passengers. ===Retail=== Jewel houses both local and international brands. Tenants include the largest Nike store in Southeast Asia, the first and only Apple Store located inside an airport complex, Marks & Spencer, Muji, Zara, Uniqlo, Singapore's second basement cinema operated by Shaw Theatres with 11 screens including an IMAX theatre with a seating capacity of 828 and Five Spice, a food court by Food Junction with 19 unique stalls and supermarket chain NTUC FairPrice Finest. Jewel also includes American burger places such as A&W; Restaurants and Shake Shack, Norwegian fast-casual restaurant Pink Fish, Swiss artisanal chocolatier Läderach, Sichuan restaurants Xiao Bin Lou and Yu's Kitchen, Boston-based ice cream parlour chain Emack & Bolio's, British casual eatery Burger & Lobster, Peruvian restaurant TONITO, Japan's Tokyo Milk Cheese Factory and the first permanent Pokémon Centre in East Asia outside of Japan. ==Awards== *Jewel Changi Airport was awarded the 2016 International Architecture Award by The Chicago Athenaeum, an international museum of architecture and design. *In November 2019, Jewel Changi Airport was awarded the Special Jury Award at the year's Mapic Awards. ==In popular culture== The song \"The Right Time\" by Singaporean singer JJ Lin was motivated by Jewel, which was shown in its music video. ==References== ==Other websites== * Official website * Emporis.com - Changi Airport Category:Buildings and structures in Singapore Category:Buildings and structures completed in the 21st century",
 "title": "Jewel Changi Airport"
}