{
 "id": "887643",
 "text": "The vice-chancellor of Germany, inofficially the vice-chancellor of the Federal Republic of Germany (), officially the deputy to the federal chancellor (), is the second highest ranking German cabinet member. The chancellor is the head of government and, according to the constitution, gives this title of deputy to one of the federal ministers. It is common that the title is given to the major minister provided by the (smaller) coalition partner. In everyday politics, being a vice chancellor is more an honorary title. The vice-chancellor may head cabinet meetings when the chancellor is abroad. The function of vice chancellor is to use the specific constitutional powers of the chancellor in case that the chancellor is unable to perform his or her duties. This kind of substitution has never been made use of in the history of the Federal Republic. Should a chancellor resign, die or be permanently unable to perform his or her duties, the vice chancellor does not automatically become the next chancellor. In such a case the Federal President assigns a minister to serve as acting chancellor until the Bundestag (parliament) elects a new chancellor.Ute Mager, in: von Münch/Kunig: Grundgesetz-Kommentar II, 5. Auflage 2001, Rn. 10/11 zu Art. 69.). Although is the constitutional term, most Germans know the deputy by the expression Vice- Chancellor (). Chancellor () is the traditional term for the German head of government since 1867/71. A general deputy has been introduced only in 1878 by law (). In the Weimar Republic of 1919-1933, the office of was mentioned in the internal reglement of the government. The current office or title has existed since the constitution of 1949. Lars Klingbeil (Social Democratic Party) is the current officeholder since 6 May 2025. == List of Vice Chancellors == ===German Empire (Allgemeiner Stellvertreter des Reichskanzlers)=== Political Party: Portrait Name Birth Death Term start Age start Term end Age end Days Party Portfolio Cabinet 1 30 October 1837 19 November 1896 1 June 1878 20 June 1881 FKP Bismarck 2 6 January 1833 6 March 1907 20 June 1881 1 July 1897 FKP Secretary of State for the Interior Bismarck 2 6 January 1833 6 March 1907 20 June 1881 1 July 1897 FKP Secretary of State for the Interior Caprivi 2 6 January 1833 6 March 1907 20 June 1881 1 July 1897 FKP Secretary of State for the Interior Hohenlohe-Schillingsfürst 3 3 June 1845 23 October 1932 1 July 1897 24 June 1907 FKP Secretary of State for the Interior Hohenlohe-Schillingsfürst 3 3 June 1845 23 October 1932 1 July 1897 24 June 1907 FKP Secretary of State for the Interior Bülow 4 29 November 1856 1 January 1921 24 June 1907 14 July 1909 Independent Secretary of State for the Interior Bülow 5 19 January 1856 17 December 1921 14 July 1909 22 May 1916 Independent Secretary of State for the Interior Bethmann-Hollweg 7 22 July 1872 23 April 1924 22 May 1916 9 November 1917 Independent Secretary of State for the Interior (until 23 October 1917) Bethmann-Hollweg 7 22 July 1872 23 April 1924 22 May 1916 9 November 1917 Independent Secretary of State for the Interior (until 23 October 1917) Michaelis 7 22 July 1872 23 April 1924 22 May 1916 9 November 1917 Independent Secretary of State for the Interior (until 23 October 1917) Hertling 8 12 June 1847 14 July 1931 9 November 1917 10 November 1918 FVP Hertling 8 12 June 1847 14 July 1931 9 November 1917 10 November 1918 FVP Baden 8 12 June 1847 14 July 1931 9 November 1917 10 November 1918 FVP Ebert ===Weimar Republic (Allgemeiner Stellvertreter des Reichskanzlers)=== Political Party: Portrait Name Birth Death Term start Age start Term end Age end Days Party Portfolio Cabinet 1 14 February 1860 5 September 1954 13 February 1919 19 April 1919 DDP Deputy Minister-President / Minister of Finance Scheidemann 2 17 July 1865 14 October 1937 30 April 1919 20 June 1919 DDP Deputy Minister-President / Minister of Finance Scheidemann 3 20 September 1875 26 August 1921 21 June 1919 3 October 1919 Centre Deputy Minister-President (until 14 August 1919) / Minister of Finance Bauer 4 14 February 1860 5 September 1954 3 October 1919 27 March 1920 DDP Minister of Justice Bauer 5 26 February 1875 19 October 1944 27 March 1920 21 June 1920 DDP Minister of the Interior Müller I 6 22 July 1865 26 May 1928 25 June 1920 4 May 1921 DVP Minister of Justice Fehrenbach 7 6 January 1870 16 September 1944 10 May 1921 14 November 1922 SPD Minister of Finance Wirth I 7 6 January 1870 16 September 1944 10 May 1921 14 November 1922 SPD Minister of Finance Wirth II 8 15 May 1864 16 September 1943 13 August 1923 3 November 1923 SPD Minister for Reconstruction Stresemann I 9 21 September 1874 20 October 1951 30 November 1923 15 December 1924 DVP Minister of the Interior Marx I 9 21 September 1874 20 October 1951 30 November 1923 15 December 1924 DVP Minister of the Interior Marx II 10 22 October 1869 9 May 1967 28 January 1927 12 June 1928 DNVP Minister of Justice Marx IV 11 14 December 1879 6 March 1954 30 March 1930 30 May 1932 DDP Minister of Finance (from 26 June 1930) Brüning I 11 14 December 1879 6 March 1954 30 March 1930 30 May 1932 DDP Minister of Finance (from 26 June 1930) Brüning II ===Nazi Germany=== Portrait Name Birth Death Term start Age start Term end Age end Days Party Portfolio Other positions Cabinet 1 29 October 1879 2 May 1969 30 January 1933 7 August 1934 Non-partisan Minister President of Prussia (until 10 April 1933) Hitler === Federal Republic of Germany (1949–present) === Political party: Portrait Name Term start Term end Days Party Portfolio Cabinet 1 Franz Blücher 20 September 1949 29 October 1957 FDP FVP DP Marshall Plan Adenauer I • II 2 Ludwig Erhard 29 October 1957 16 October 1963 CDU Economic Affairs Adenauer III • IV 3 Erich Mende 17 October 1963 28 October 1966 FDP Intra-German Relations Erhard I • II The office was vacant from 28 October to 8 November 1966. The office was vacant from 28 October to 8 November 1966. The office was vacant from 28 October to 8 November 1966. The office was vacant from 28 October to 8 November 1966. The office was vacant from 28 October to 8 November 1966. The office was vacant from 28 October to 8 November 1966. The office was vacant from 28 October to 8 November 1966. The office was vacant from 28 October to 8 November 1966. The office was vacant from 28 October to 8 November 1966. The office was vacant from 28 October to 8 November 1966. 4 Hans-Christoph Seebohm 8 November 1966 1 December 1966 CDU Transport Erhard II 5 Willy Brandt 1 December 1966 22 October 1969 SPD Foreign Affairs Kiesinger 6 Walter Scheel 22 October 1969 16 May 1974 FDP Foreign Affairs Brandt I • II 7 Hans-Dietrich Genscher 17 May 1974 17 September 1982 FDP Foreign Affairs Schmidt I • II • III 8 Egon Franke 17 September 1982 1 October 1982 SPD Intra-German Relations Schmidt III The office was vacant from 1 October to 4 October 1982. The office was vacant from 1 October to 4 October 1982. The office was vacant from 1 October to 4 October 1982. The office was vacant from 1 October to 4 October 1982. The office was vacant from 1 October to 4 October 1982. The office was vacant from 1 October to 4 October 1982. The office was vacant from 1 October to 4 October 1982. The office was vacant from 1 October to 4 October 1982. The office was vacant from 1 October to 4 October 1982. The office was vacant from 1 October to 4 October 1982. 9 Hans-Dietrich Genscher 4 October 1982 18 May 1992 FDP Foreign Affairs Kohl I • II • III • IV 10 Jürgen Möllemann 18 May 1992 21 January 1993 FDP Economic Affairs Kohl IV 11 Klaus Kinkel 21 January 1993 27 October 1998 FDP Foreign Affairs Kohl IV • V 12 Joschka Fischer 27 October 1998 22 November 2005 Green Foreign Affairs Schröder I • II 13 Franz Müntefering 22 November 2005 21 November 2007 SPD Labour and Social Affairs Merkel I 14 Frank-Walter Steinmeier 21 November 2007 27 October 2009 SPD Foreign Affairs Merkel I 15 Guido Westerwelle 27 October 2009 16 May 2011 FDP Foreign Affairs Merkel II 16 Philipp Rösler 16 May 2011 17 December 2013 FDP Economic Affairs Merkel II 17 Sigmar Gabriel 17 December 2013 14 March 2018 SPD Economic Affairs (2013–17) Foreign Affairs (2017–18) Merkel III 18 Olaf Scholz 14 March 2018 8 December 2021 SPD Finance Merkel IV 19 Robert Habeck 8 December 2021 6 May 2025 Green Economic Affairs and Climate Protection Scholz 20 Lars Klingbeil 6 May 2025 Incumbent SPD Finance Merz ==References==",
 "title": "Vice-Chancellor of Germany"
}