{
 "id": "88784",
 "text": "Vajrayana is one of the major schools of Buddhism. It is sometimes called esoteric Buddhism. It later spread to Mongolia and Bhutan. Since the annexation of Tibet by the People's Republic of China in 1959, the Tibetan form of Vajrayana has spread to many Western countries and has gained great popularity. Vajrayana is a third and separate major school of Buddhism, the other two being Theravada and Mahayana. Vajrayana Buddhism comes from Mahayana Buddhism. Tibetan Vajrayana Buddhism has its own texts in the Tibetan and Sanskrit languages. It also contains the older Mahayana texts in Sanskrit and Theravada texts in the Pali language. Vajrayana is sometimes known as Tantric Buddhism in the west. Tantric practice is one kind of Vajrayana Buddhism, but there are also other forms. Vajrayana Buddhism is also known as \"The Diamond Vehicle\". == Features of Vajrayana == The main features of Vajrayana are: *The use of mantras, a form of chanting *Strong focus on the guru, or teacher *The importance of meditation, including concentration techniques such as the visualization of bodhisattvas. Followers are introduced to these practices through initiation which is also called empowerment. == Tibetan Vajrayana == There are four main schools of Tibetan Buddhism: Nyingma, Sakya, Kagyu, and Geluk. All four schools identify themselves as belonging to the Mahayana or \"Great Vehicle\" tradition, which is the most popular form of Buddhism in China, Korea and Japan. === Levels of practice === In the ancient or Nyingma school, the teachings are divided into six levels: *Outer Tantras **Kriyayoga **Charyayoga **Yogatantra *Inner Tantras (Anuttarayogatantra) **Mahayoga **Anuyoga **Atiyoga (also known as Dzogchen) The new schools (Sakya, Kagyu, and Geluk) divide the teachings into only four levels. The first three are the same as in the Nyingma school. The last level is simply called Anuttarayogatantra (\"Highest Yoga Tantra\"). These Highest Yoga Tantras are divided into \"mother\", \"father\" and \"non-dual\" tantras. The new schools use a practice called Mahamudra in place of Dzogchen. == Other websites == * The Berzin archive, Archive on texts and teachings of Vajrayana, Tibetan Buddhism, Islam and Bon * Himalayan Art Resources, an online educational resource with over 30,000 images of Vajrayana art and ritual implements Category:Tibetan Buddhism Category:Buddhist denominations",
 "title": "Vajrayana"
}