{
 "id": "887970",
 "text": "Tragic Alcove (also known as La Culla Tragica) was painted in oil by the italian painter Giuseppe Amisani, in 1910. It is kept in the Pinacoteca do Estado de São Paulo of São Paulo in Brazil from 1913.Google Arts and culture, \"La Culla Tragica\", Giuseppe Amisani, 1910, Pinacoteca dello stato di San Paolo == Description == The Alcova Tragica painting represents a female figure with a naked body with sinuous features and a twisted shape. Under the right breast a hand, from which flows a blue-silver veil, he with the bowed head meets the fiery red hair, which covers the eyes of this majestic and fatal creature in the dark fatally. A being, in the presence of this impassive woman, raises his hands in an act of prayer. Under your feet, other men. Former victims, once devoured, and now in agony ready to die. But even if they are torn apart, they come back, as if bewitched, to beg her for a last kiss. And little by little, they partially converge on this amazing backdrop. It is the pleasure of a sex witch, whose desire is never satisfied, consumes men one by one, enchants them and devours them. Now they are no longer needed, as she has already used the blood that bathes her hair. His lips sucked all their strength, they took their own life. She is a femme fatale: a vampire, a man- eater. Everything about the painting is suggestive because it is not yet known what could initiate this massacre, the motive that makes women hurl women against these men. We only know that she appears, touches them and wreaks havoc. “In Alcova Tragica – this daring, almost reckless creation of the superhuman figure of mermaid woman, who, amidst the prayers, the curses, the moans, the gasps, it is always reborn, like an enchanted phoenix, pomping over this sacrificial bunches human, to rise more and more beautiful and promising and offer on red lips of an immortal lust, the evil fruit of infinite suffering...” (The Correio Paulistano. Art Registration. Amisani Exhibition. Brasil, 12/09/1913) == Exhibitions == * 1911, Milan, Italia * 1988, São Paulo, Brasil, São Paulo State Government, State Secretariat for Culture, Department of Museums and Archives, Pinacoteca do Estado de São Paulo * 1913, São Paulo, Brasil == Related pages == * Giuseppe Amisani ==References== == Bibliography == * Eros e Thanatos, São Paulo State Government, State Secretariat for Culture, Department of Museums and Archives, Pinacoteca do Estado de São Paulo, 1988 * Ruth Sprung Tarasantchi, Pintores paisagistas: São Paulo, 1890 a 1920, 2002 ==Other websites== * * Google Arts and culture, \"La Culla Tragica\", Giuseppe Amisani, 1910, Pinacoteca do Estado de São Paulo Category:1910s paintings Category:São Paulo Category:Paintings by Giuseppe Amisani",
 "title": "Tragic Alcove (Amisani)"
}