{
 "id": "888078",
 "text": "Batticaloa (Tamil: மட்டக்களப்பு, Maṭṭakkaḷappu; Sinhala: මඩකලපුව, Madakalapuwa) is a city of the Eastern province of Sri Lanka. It is the administrative capital of the Batticaloa District. The Eastern University of Sri Lanka is in Batticaloa and it is a major commercial centre. It is on the east coast, 111 kilometres (69 miles) south of Trincomalee. It is on an island. Pasikudah is a popular tourist destination in Batticaloa. It is 35 km (22 miles) northwest with beaches and lagoons. == Origin of the name 'Batticaloa' (Etymology) == 'Batticaloa' is a name that comes from the portuguese language. Batticaloa has a nickname - \"Land of the singing fish\" (Tamil: மீன் பாடும் தேன் நாடு) due to musical sounds that related to fish or aquatic creatures in the Batticaloa Lagoon near the Kallady Bridge. BBC Radio 4 was able to record the mysterious sound in Batticaloa Lagoon. The sound was broadcast by Sri Lanka Broadcasting Corporation in 1960s with the help of Rev. Fr. Lang, a Catholic priest. == Geography == Batticaloa is in the eastern coast of Sri Lanka. It occupies the central part of eastern Sri Lanka. Its average elevation (height from sea level) is around 5 meters. Batticaloa district has three main lagoons - Batticaloa Lagoon, Valaichchenai Lagoon, and Vakari (Panichchankerni) Lagoon. Among these lagoons, Batticaloa Lagoon is the largest lagoon. It is 56 km long and has an area of 162 square kilometres, extending from Pankudaweli in North and Kalmunai in South. There are several islands within the Batticaloa Lagoon such as Puliayantheevu, Buffaloa Island and Bone Island. Many bridges are built across the lagoon which connect the mainland and the islands. Puliayantheevu is the metropolitan place of the city. The biggest bridge of all is the Lady Manning bridge at Kallady. This bridge is the main access path to the city from the southern places of the district. This bridge is also famous for Singing fishes which were considered as musical sounds heard in the Kallady lagoon on a full moon day. A priest named Father Lang recorded this musical charm and broadcast it in the 1960s over the Sri Lanka Broadcasting Cooperation. Batticaloa beaches are sandy. Some beaches in Batticaloa are Kallady beach, Pasikudah, and Kalkudah. Pasikudah is a bay protected from the ocean, with a flat and sandy bed extending 150 to 200 meters from the shore. === Climate === Batticaloa has a tropical wet and dry climate under the Köppen climate classification, also known as 'dry-monsoonal climate'. Batticaloa's climate is temperate throughout the year. From March to May, the warmest time of the year, the maximum temperature is around 32 degrees Celsius (88 degrees Fahrenheit). During the monsoon season from November to February, heavy rains are recorded, with average temperature of 25 °C. Average annual rainfall in Batticaloa is 1,650.9 mm (65.00 in). == References == Category:Cities in Sri Lanka",
 "title": "Batticaloa"
}