{
 "id": "888102",
 "text": "Housefull is a 2010 Indian Hindi-language comedy film directed by Sajid Khan and produced by Sajid Nadiadwala. The movie is partly adapted from the 1998 Tamil drama Kaathala Kaathala. The dialogues were done by Anvita Dutt, while Nadiadwala wrote the storyline and Rameshwar S. Bhagat served as the editor. It became the first installment of the Housefull franchise. ==Cast== * Akshay Kumar as Aarush Avasthi, Sandy's boyfriend, Pooja's ex-boyfriend and Devika’s ex-husband * Riteish Deshmukh as Babu Rao \"Bob\", Hetal’s husband, Aarush’s best friend * Lara Dutta as Hetal Rao (nee Patel), Bob’s wife * Arjun Rampal as Major Krishna Rao \"Anna\", Sandy’s brother * Deepika Padukone as Soundarya Venkateshwari Bhagyalakshmi Basappa Rao, \"Sandy\" * Jiah Khan as Devika Avasthi (Nee'Samtani), Kishore’s daughter, Aarush’s ex-wife * Boman Irani as Batuk Patel, Hetal’s father * Chunky Pandey as Aakhri Pasta * Aastha Gill as Chindi * Randhir Kapoor as Kishore Samtani, Devika’s father * Lillete Dubey as Zulekha Ji * Malaika Arora Khan as Pooja Rao, Aarush’s ex-girlfriend, Sandy and Major's Elder Sister * Manoj Pahwa as Santa Singh * Suresh Menon as Banta Singh * Daisy Irani as Batuk's mother * Jacqueline Fernandez as Dhanno (cameo appearance in song \"Aapka Kya Hoga\") *Rajesh Kava as voice of a talking parrot ==Awards and nominations== ;6th Apsara Film & Television Producers Guild Awards *Nominated – Apsara Award for Best Performance in a Comic Role – Riteish Deshmukh ;2011 Zee Cine Awards Nominated *Best Director – Sajid Khan *Best Actor – Akshay Kumar *Best Music – Shankar Ehsaan Loy *Best Supporting Actress – Lara Dutta *Best Comedian – Riteish Deshmukh *Zee Cine Award for Best Track of the Year – \"Aapka Kya Hoga (Dhanno)\" ;IIFA Awards Won *Best Performance in a Comic Role – Riteish Deshmukh ;Stardust Awards Won *Star of the Year – Male – Akshay Kumar *Best Supporting Actor – Arjun Rampal ;3rd Mirchi Music Awards Nominated *Best Item Song of the Year - \"Aapka Kya Hoga (Dhanno)\" *Best Song Recording - Abhay Rumde, Sameer Khan and Ashish Saksena - \"Oh Girl You're Mine\" ==Soundtrack== The film's soundtrack is composed by Shankar-Ehsaan-Loy. The lyrics are penned by Sameer and Amitabh Bhattacharya. The song \"Aapka Kya Hoga\" was a remake of the song \"Apni Toh Jaise Taise\" from the 1981 movie Lawaaris. ===Track list=== ==References== ==Other websites== * * * * * * Category:2010 movies Category:2010s Indian movies Category:2010s Hindi-language movies Category:2010 comedy movies Category:Movies set in England Category:Movies set in Italy",
 "title": "Housefull"
}