{
 "id": "888103",
 "text": "Housefull 4 is a 2019 Indian Hindi-language romantic fantasy comedy film directed by Farhad Samji and produced by Nadiadwala Grandson Entertainment and Fox Star Studios. The film is the fourth installment of the Housefull franchise. It stars Akshay Kumar, Riteish Deshmukh, Bobby Deol, Kriti Sanon, Pooja Hegde and Kriti Kharbanda in the lead roles. The film was half directed by Sajid Khan, who had also directed the first two installments, but was replaced by Farhad Samji midway during the shooting, due to Me Too allegations. Nadiadwala claimed the film to be the highest-budgeted Indian comedy film. The film was theatrically released in India on 25 October 2019 during the occasion of Diwali to received mixed to negative reviews, who appreciated performances of ensemble cast, and production values, but criticized for screenplay, writing, humor, cliches, and direction, but became a box-office success. == Plot == Harry, Max, and Roy are three brothers who live in London. Harry, a barber gets frequent bizarre flashes of a past era. His forgetful nature causes him to misplace a don Michael's bag of 5 million pounds whose henchman demands them to return the money. To fulfill this, Harry, Roy, and Max get engaged to Pooja, Neha, and Kriti, the 3 respective daughters of rich businessman Manraj Thakral. But soon all of the 3 trios fall in love, and their wedding preparations begin. Soon circumstances cause the wedding to be in Sitamgarh. There, all of them meet Aakhri Pasta, a bellboy at their hotel who recognizes them as reincarnated people from 600 years ago in 1419. Harry realizes his flashes have a connection with Pasta's claims and gets to know the past from him in Madhavgarh. In 1419, Madhavgarh's Rajkumar Bala was banished by his father Maharaj Parikshitap for trying to kill him to become king. His servant Pehla Pasta took him to Sitamgarh (then a kingdom) whose king Surya Singh Rana wanted grooms for his daughters. Bala planned to marry the eldest Madhu to become Maharaj and meets Bangdu, an effeminate dance teacher who's dating the second daughter Mala. Meena, the youngest loves her brave bodyguard Dharamputra. Bala helps them to be together and also they get him and Madhu united. The plan works as Surya announces their weddings, but his nephew Suryabhan who wants the throne kills Sitamgarh's enemy clan leader and frames the couples for it. The leader's brother Gama fights for revenge. Bala realizes he truly loves Madhu. The wedding mandap collapses and kills the couples and Gama. Back in present, Harry realizes the grooms are set to marry the wrong brides. Pasta helps Harry remind Roy and Max of their previous lives. Pappu Rangeela, a qawwali singer and Gama's reincarnation, enters but has no recollection of his past. Pasta finds a painting of their past lives' wedding day, which shows Madhu-Bala, Mala-Bangdu, and Meena-Dharamputra to make the girls remember their past. Before they can show the painting to the girls, it is caught by Pappu, who remembers his life as Gama and crashes the wedding, leading Pooja and Neha to remember everything. Michael, in fact, Suryabhan's reincarnation, shows up at the wedding for his money and shoots Gama. Kriti remembers everything when she sees Michael and also reveals the mandap hadn't collapsed - Suryabhan broke it down to kill everyone so he could be the Maharaj. Michael recounts his past and boasts about how he killed Gama's brother. Pappu hears this and pushes Michael into the collapsing mandap, thus bringing his revenge. The film ends on a happy note as Harry, Kriti, Roy, Pooja, and Max and Neha get married, thus completing their 600-year-old love story. ==Cast== * Akshay Kumar as Rajkumar Bala Dev Singh and Harish \"Harry\" Sinha * Bobby Deol as Dharamputra Mahabali and Max Sinha * Riteish Deshmukh as Bangdu Pratap Singh a.k.a Bangdu Maharaj and Roy Sinha * Kriti Sanon as Rajkumari Madhu Rana and Kriti Thakral * Pooja Hegde as Rajkumari Mala Rana and Pooja Thakral * Kriti Kharbanda as Rajkumari Meena Rana and Neha Thakral * Chunky Pandey as Pehla Pasta and Aakhri Pasta * Rana Daggubati as Raja Gama Chandrendar and Ashish \"Pappu\" Rangeela * Ranjeet Bedi as Maharaja Suryadev \"Surya\" Singh Rana and Manraj Thakral * Sharad Kelkar as Suryabhan Singh Rana and Gangster Michael D'Costa * Johnny Lever as Winston Churchgate and Giggly * Jamie Lever as Giggly: Madhu, Mala and Meena's servant * Nawazuddin Siddiqui as Dharmesh Ramsey a.k.a Ramsey Baba (special appearance) * Manoj Pahwa as Viraj Sehni a.k.a Big Bhai (special appearance) * Parikshit Sahni as Maharaja Parikshitap Dev Singh (special appearance) * Archana Puran Singh as Varsha Sinha (photo only) * Shakti Kapoor as Prabhakar Sinha (photo only) * Sham Mashalkar as Darbari * Prithvi Zutshi as Shekhar Siskeria * Saurabh Sachdeva as Raazdaar * Saurabh Srivastava as Lakhan * Jitendra Bamgude as a Goon ==References== Category:2010s Indian movies Category:Movies set in London Category:2010s sequel movies Category:2019 comedy movies Category:20th Century Fox movies",
 "title": "Housefull 4"
}