{
 "id": "888271",
 "text": "The 2002 UEFA European Under-19 Championship was the first tournament of the UEFA European Under-19 Championship, after the previous Under-18 competition was changed. The tournament was held in Norway, between 21 July and 28 July 2002. The top three teams from each group qualified for the 2003 FIFA World Youth Championship. Players born on or after 1 January 1983 were available to participate in this competition. The final tournament took place in seven venues located in seven cities — Bærum, Drammen, Hønefoss, Kongsvinger, Lillestrøm, Moss and Oslo. The winners were Spain, who beat Germany to secure their fourth title, and the top scorer was Fernando Torres, with four goals. This edition is also notable for Nelly Viennot becoming the first female official who took part in an UEFA-organised men's football event, after acting as assistant referee at Norway's 1–5 defeat of Slovakia on 21 July 2002. ==Qualification== The qualification format consisted of two rounds. In the preliminary round, which took place between August and November 2001, 50 national teams were drawn into 14 groups (six groups of three teams and eight groups of four teams) contested as round-robin mini-tournaments hosted by one of the group teams. The group winners then progressed to the intermediary round, where they were paired and played two-legged ties between March and May 2002. The winners secured qualification for the final tournament, joining Norway who qualified automatically as hosts. ===Qualified teams=== The following eight teams qualified to the final tournament: Country Qualified as Hosts Intermediary round play-off winner Intermediary round play-off winner Intermediary round play-off winner Intermediary round play-off winner Intermediary round play-off winner Intermediary round play-off winner Intermediary round play-off winner ==Venues== The final tournament was held in seven stadiums located in seven Norwegian cities. Stadium City Tenant club(s) Capacity Gjemselund Stadion Kongsvinger Kongsvinger 2,750 Melløs Stadion Moss Moss 10,000 Hønefoss idrettspark Hønefoss Hønefoss 4,000 Åråsen Stadion Lillestrøm Lillestrøm 11,637 Nadderud Stadion Bærum Stabæk 7,000 Marienlyst Stadion Drammen Strømsgodset 7,500 Ullevaal Stadion Oslo Lyn and Vålerenga 25,572 ==Match officials== UEFA named six referees for the final tournament: Country Referee Croatia Estonia Greece Macedonia Portugal Slovenia ==Squads== ==Results== ===Group stage=== ====Group A==== Teams 3 2 1 0 7 2 +5 7 3 2 0 1 11 6 +5 6 3 1 1 1 4 6 −2 4 3 0 0 3 1 9 −8 0 \\---- \\---- ====Group B==== Teams 3 2 1 0 8 4 +4 7 3 2 0 1 5 6 −1 6 3 0 2 1 6 7 −1 2 3 0 1 2 3 5 −2 1 \\---- \\---- ===Third place play-off=== ===Final=== ==Goalscorers== ;4 goals * Fernando Torres ;3 goals * Dean Ashton * Jon Daly * Filip Šebo ;2 goals * Mike Hanke * Moritz Volz * Roman Jurko * José Antonio Reyes ;1 goal * Jonathan Blondel * Styn Janssens * Kevin Vandenbergh * Radek Dosoudil * Pavel Fořt * Tomáš Rada * Václav Svěrkoš * Darren Carter * Carlton Cole * Jerome Thomas * Philipp Lahm * David Odonkor * Sascha Riether * Piotr Trochowski * Stephen Brennan * Stephen Kelly * Stephen Paisley * Christian Grindheim * Tomáš Bruško * Marek Čech * Juraj Halenár * Roman Konečný * Marián Kurty * Tomáš Labun * Tomás Sloboda * Igor Žofčák * Andrés Iniesta * Sergio García ==Qualification to World Youth Championship== The six best performing teams qualified for the 2003 FIFA World Youth Championship: * * * * * * ==References== ==Other websites== *Official website at UEFA.com *Match list at rsssf.com Category:2002 in European football Category:Sport in Norway Category:July 2002 events Category:UEFA European Under-19 Championship",
 "title": "2002 UEFA European Under-19 Championship"
}