{
 "id": "888210",
 "text": "Ek Villain: There's One in Every Love Story (also known as simply just Ek Villain) is a 2014 Indian Hindi-language action thriller film directed by Mohit Suri and produced by Shobha Kapoor and Ekta Kapoor under Balaji Motion Pictures. Based on a script written by Tushar Hiranandani and Milap Milan Zaveri, it stars Riteish Deshmukh, Sidharth Malhotra, Shraddha Kapoor, Kamaal Rashid Khan, and Aamna Sharif. The film tells about a ruthless criminal who is going on a killing spree, when his terminally ill wife is murdered by a sadistic serial killer. This marked the first time Deshmukh portraying a negative role. It was released worldwide on 27 June 2014 and received positive reviews from critics, garnering praise for the theme, direction, screenplay and performances. Made on a budget of million, the film became a major box- office success with earnings of over billion domestically and a worldwide gross of billion. The song \"Galliyan\", \"Zaroorat\", \"Hamdard\" declared chartbusters of its realised. Malhotra and Deshmukh later reunited for the 2019 masala actioner Marjaavaan, in which Deshmukh's entry as the antagonist was accompanied by him singing the award-winning song \"Galliyan\" from the Ek Villain soundtrack. A sequel, Ek Villain Returns, starring Arjun Kapoor and John Abraham as replacements in the male leads, along with Disha Patani and Tara Sutaria as the female leads was released on July 8, 2022. ==Plot== A young woman Aisha Verma, tries to leave behind a message for her husband, Guru Divekar, who calls her, but the call is disrupted when a masked man enters Aisha's house and kills her by throwing her off the window. At her funeral, CBI officer Aditya Rathore points out that it is vital to track down the murderer or else Guru will go on a killing spree. Flashback: Guru was a ruthless hitman working for mob boss Caeser, who raised and trained him so that Guru could have a chance to murder the goons who killed his parents. Guru is arrested for killing Debu, but is bailed, as Debu's mother refuses to testify against him. She warns Guru that she did not testify because one day, God will make him pay for his crimes, and he will also lose a loved one. Guru meets and falls for Aisha, an optimistic girl dying from a terminal illness. They get married and Guru leaves behind his old life and gets a job while Aisha receives treatment in Mumbai and recovers. She discovers she is pregnant and decides to tell Guru in person when he returns from his interview, but is murdered before she can. Present: Rakesh Mahadkar is an unsuccessful man who is constantly insulted and ridiculed by his wife Sulochana for his shortcomings, yet he loves her. He vents out his frustration by murdering other women who speak rudely to him, and Aisha turns out to be one of them. Guru hunts down Rakesh and brutally beats him, then admits him to a hospital and pays for the expenses, intending to punish him by repeatedly bringing him to the brink of death, saving him, then doing it over again. At the hospital, Guru learns that Aisha was pregnant, which breaks him even more. While assaulting a nurse, Rakesh is again intercepted by Guru, who kills him, then revives him with an injection. The police discovers Rakesh's murders and takes Sulochana in for questioning. Rakesh realizes that Guru is Aisha's husband and is seeking vengeance. Upon the suggestion of his friend Brijesh, He taunts Guru over the phone before killing Aisha's father. Rakesh expects Guru to kill him so that he can die as a Hero in the eyes of Sulochana and everyone else while Guru will be tarnished. However, Caesar calls Guru and says that he has killed Sulochana to avenge Aisha for Guru, and left Rakesh's little son Manish for Guru to kill. Enraged, Rakesh fiercely fights Guru and tackles him off the building. He defeats Guru in the battle, stabs him with a screw driver and takes up a boulder to kill him, but a car hits him and Rakesh putatively dies from his injuries. Guru adopts Manish instead of killing him and completes the remaining wishes on Aisha's bucket list. ==Cast== * Riteish Deshmukh as Rakesh Mahadkar * Sidharth Malhotra as Guru Divaker * Shraddha Kapoor as Aisha Verma * Kamaal Rashid Khan as Brijesh Yadav * Aamna Sharif as Sulochana Mahadkar * Remo Fernandes as Caesar * Shaad Randhawa as ACP Aditya Rathore * Asif Basra as Aadesh Verma * Rishina Kandhari as Jia Shinde * Prachi Desai (special appearance in song \"Awari\") * Vidyadhar Karmakar as Chotu from mental asylum * Rumana Molla as Nidhi Sharma ==Notes== ==References== Category:2010s Indian movies",
 "title": "Ek Villain"
}