{
 "id": "888432",
 "text": "The 2021–22 UEFA Champions League group stage began on 14 September 2021 and ended on 9 December 2021. A total of 32 teams played in the group stage to decide the 16 spots in the knockout phase of the 2021–22 UEFA Champions League. Sheriff Tiraspol made their first appearance in the group stage. They were also the first team from Moldova to play in the Champions League group stage. ==Draw== The draw for the group stage was held on 26 August 2021, 18:00 CEST (19:00 TRT), in Istanbul, Turkey. The 32 teams were drawn into eight groups of four. The teams were seeded into four pots, with eight teams in each, based on: *Pot 1 contained the Champions League and Europa League title holders, and the champions of the top six associations based on their 2020 UEFA country coefficients. *Pot 2, 3 and 4 contained the remaining teams, seeded based on their 2021 UEFA club coefficients. Teams from the same association, and due to political reasons, teams from Ukraine and Russia, could not be drawn into the same group. The following pairings were announced by UEFA after the group stage teams were confirmed: * A Chelsea and Manchester City * B Atlético Madrid and Sevilla * C Inter Milan and Juventus * D Bayern Munich and Borussia Dortmund * E Lille and Paris Saint-Germain * F Real Madrid and Barcelona * G Manchester United and Liverpool * H Porto and Benfica * I Shakhtar Donetsk and Dynamo Kyiv * J RB Leipzig and VfL Wolfsburg * K Atalanta and Milan On each matchday, one set of four groups played their matches on Tuesday, while the other set of four groups played their matches on Wednesday, with the two sets of groups alternating between each matchday. The fixtures were decided after the draw, using a computer draw not shown to public. Each team would not play more than two home matches or two away matches in a row, and would play one home match and one away match on the first and last matchdays (Regulations Article 16.02). This arrangement was different from previous seasons, where the same two teams would play at home on the first and last matchdays. ==Teams== Below are the participating teams (with their 2021 UEFA club coefficients), grouped by their seeding pot. They include: *26 teams which entered in this stage *6 winners of the play-off round (4 from Champions Path, 2 from League Path) Key to colours Group winners and runners-up advance to round of 16 Third-placed teams enter Europa League knockout round play-offs {| class=\"wikitable\" Team TH Chelsea 98.000 EL Villarreal 63.000 1 Atlético Madrid 115.000 2 Manchester City 125.000 3 Bayern Munich 134.000 4 Inter Milan 53.000 5 Lille 14.000 6 Sporting CP 45.500 Notes ==Format== In each group, teams played against each other home-and-away in a round-robin format. The top two teams of each group advanced to the round of 16. The third-placed teams were transferred to the Europa League knockout round play-offs, while the fourth-placed teams were eliminated from European competitions for the season. ===Tiebreakers=== Teams were ranked according to points (3 points for a win, 1 point for a draw, 0 points for a loss). If two or more teams were tied on points, the following tiebreaking criteria were applied, in the order given, to determine the rankings (see Article 17 Equality of points – group stage, Regulations of the UEFA Champions League): #Points in head-to-head matches among the tied teams; #Goal difference in head-to-head matches among the tied teams; #Goals scored in head-to-head matches among the tied teams; #If more than two teams were tied, and after applying all head-to-head criteria above, a subset of teams were still tied, all head-to-head criteria above were reapplied exclusively to this subset of teams; #Goal difference in all group matches; #Goals scored in all group matches; #Away goals scored in all group matches; #Wins in all group matches; #Away wins in all group matches; #Disciplinary points (direct red card = 3 points; double yellow card = 3 points; single yellow card = 1 point); #UEFA club coefficient. Due to the abolition of the away goals rule, head-to-head away goals were no longer applied as a tiebreaker starting from this season. However, total away goals were still applied as a tiebreaker. ==Groups== The fixtures were announced on 27 August 2021, the day after the draw. The matches were played on 14–15 September, 28–29 September, 19–20 October, 2–3 November, 23–24 November, and 7–8 December 2021. The scheduled kick-off times were 18:45 (two matches on each day) and 21:00 (remaining six matches) CET/CEST. Times were CET/CEST, as listed by UEFA (local times, if different, are in parentheses). ===Group A=== \\---- \\---- \\---- \\---- \\---- ===Group B=== \\---- \\---- \\---- \\---- \\---- ===Group C=== \\---- \\---- \\---- \\---- \\---- ===Group D=== \\---- \\---- \\---- \\---- \\---- ===Group E=== \\---- \\---- \\---- \\---- \\---- ===Group F=== \\---- \\---- \\---- \\---- \\---- ===Group G=== \\---- \\---- \\---- \\---- \\---- ===Group H=== \\---- \\---- \\---- \\---- \\---- ==Notes== ==References== ==Other websites== * *Fixtures and Results, 2021–22, UEFA.com group stage Category:UEFA Champions League group stages Category:September 2021 events Category:October 2021 events Category:November 2021 events Category:December 2021 events",
 "title": "2021–22 UEFA Champions League group stage"
}