{
 "id": "888439",
 "text": "The Arab Belt () was the Syrian Baath government's project of Arabization of the north of the Al-Hasakah Governorate to change the demographics of the Kurdish regions of Syria in favor of the Arabs. The process was meant to increase the Arab population in those lands that were once Arab majority, before the Kurdish influx into the region after the collapse of the Ottoman empire in the 1920s. ==Background== The regions in the \"Arab Belt\" are rich in oil deposits and good agricultural land. About 50 to 60 percent of the Syrian petroleum caves are estimated to be located in the district of Al-Malikiyah. ==Planning== The Baath party came to power in 1963 in Syria and decided in 1965 to build the 350 km long and 10-15 km wide Arabian belt along the Syria–Turkey border. The Belt stretched from the Iraqi border in the east to Ras al-Ayn (Kurdish: Serê Kaniyê) in the west. After another coup within the Baath party, Hafez al-Assad succeeded in becoming the head of Syria in 1970 and began to act on the plan in 1973. The project's name was officially changed to \"Plan for the establishment of state model farms in the Jazira province\". ==Displacement== 41 Arab villages were built during the project, and all the Kurdish village names of the area were replaced by Arabic names. About 4,000 Arab families from the provinces of Al-Raqqa and Aleppo, where they had previously lost their houses by the construction of the Tabqa dam, were housed in the new villages. These Arabs are named Maghmurin (مغمورين Maġmūrīn, which is affected by flooding). As a result, about of Kurdish cultivated land were taken away and given to the newly settled Arabs. The original plan would also forcibly send about 140,000 Kurds to the southern deserts at Al-Raad. Although the government took away the Kurds' right to live in the area, the Kurds refused to move away and give up their houses. Those Kurds who had been declared foreigners were not allowed to have property, to repair houses, or to build new houses. ==References== Category:20th century in Syria Category:Ethnic groups in Syria",
 "title": "Arab Belt"
}