{
 "id": "888429",
 "text": "The 2022 FIFA World Cup qualification is the qualifying tournament that decides 31 out of the 32 teams that will play in the 2022 FIFA World Cup, with the hosts who qualified automatically, Qatar. Different tournaments were held by each of FIFA's six confederations. The qualifiers started on 6 June 2019 and is planned to end in June 2022. The qualifiers has had many delays due to the COVID-19 pandemic. ==Qualified teams== Team Qualified as Qualified on Hosts UEFA Group J winners UEFA Group F winners CONMEBOL winners UEFA Group D winners UEFA Group E winners UEFA Group H winners UEFA Group B winners UEFA Group A winners UEFA Group I winners UEFA Group C winners UEFA Group G winners CONMEBOL second place AFC third round Group A winners AFC third round Group A second place AFC third round Group B winners AFC third round Group B second place CONMEBOL third place CONMEBOL fourth place CONCACAF third round winners CAF third round winners CAF third round winners UEFA play-offs Path B winners UEFA play-offs Path C winners CAF third round winners CAF third round winners CAF third round winners CONCACAF third round third place CONCACAF third round second place UEFA play-offs Path A winners AFC v CONMEBOL play-off winners CONCACAF v OFC play-off winners ==Confederation qualification== ===AFC=== The opening two rounds was also qualification for the 2023 AFC Asian Cup. That means, Qatar, only plays in the first two rounds of qualifying. The qualification format is: *First round: 12 teams (ranked 35–46) played home- and-away over two legs. The six winners advanced to the second round. *Second round: 40 teams (ranked 1–34, including Qatar the hosts, and the six winners from the first round) were divided into eight groups of five teams to play home-and-away round-robin matches. The seven group winners and the five best group runners-up advanced to the third round and also qualified for the 2023 AFC Asian Cup. Qatar finished as winners in their group, so the fifth-best runners-up advanced to the third round instead. *Third round: The 12 teams that advanced from the second round were divided into two groups of 6 teams to play home-and-away round-robin matches. The top two teams of each group will qualify for the World Cup. The third-placed teams of each group will advance to the fourth round. *Fourth round: The two third-placed teams in each group from the third round will play against each other in a single match to decide which team advances to the inter-confederation play-offs. ===CAF=== The qualification format is: *First round: 28 teams (ranked 27–54) played home- and-away over two legs. The fourteen winners advanced to the second round. *Second round: 40 teams (teams ranked 1–26 and fourteen first round winners) were divided into ten groups of four teams to play home-and-away round-robin matches. The ten group winners advanced to the third round. *Third round: The ten teams that advanced from the second round will play home-and-away over two legs. The five winners will qualify for the World Cup. ====Current stage (third round)==== ;Qualified teams * * * * * * * * * * ===CONCACAF=== The qualification format is: *First round: CONCACAF teams ranked 6 to 35 in the July 2020 FIFA Rankings were drawn into six groups with five teams in each group and played single round-robin matches (two home and two away), the six group winners advanced to the second round. *Second round: The six first-round group winners played in two-legged home-and-away games. The three winners advanced to the final round. *Third round: The three second round winners joined the top five CONCACAF teams (Mexico, United States, Costa Rica, Jamaica and Honduras) The top three teams qualify for the World Cup, and the fourth- placed team advances to the inter-confederation play-offs. ====Current stage (third round)==== ===CONMEBOL=== The qualification format is: All ten CONMEBOL teams will play in a league of home-and-away round-robin matches. The top four teams qualify for the World Cup, and the fifth-placed team advances to the inter-confederation play-offs. ====Current stage==== ===OFC=== The qualification format is: *Qualification match: A single-legged match between the two lowest-ranked OFC teams. The winner will advance to the group stage. *Group stage: 8 teams (teams ranked 1–7 and one qualification match winner) was divided into two groups of four teams to play round-robin matches in one venue. Each team will play each other once. First and second place from each group advanced the final stage. *Final stage: 4 teams will play in a semi- finals. The 2 winners play against each other in the final. The winner advances to the inter-confederation play-offs. ====Current stage (qualification match)==== ===UEFA=== The qualification format is: * First round (group stage): Ten groups of either five or six teams with group winners qualifying for the World Cup finals. The four teams in the 2021 UEFA Nations League Finals (France, Belgium, Italy, and Spain) were put into the smaller groups. * Second round (play-off stage): The ten group runners-up are joined by the best two Nations League group winners, based on the Nations League overall ranking, that finished outside the top two of their qualifying group. These twelve teams were drawn into three play-off paths, playing two rounds of single-match play-offs (semi-finals with the seeded teams to host, followed by finals, with the home teams to be drawn), with the three path winners qualifying for the World Cup. * First round (group stage): Ten groups of either five or six teams. The 10 group winners qualify for the World Cup. * Second round (play-off stage): The ten group runners-up are joined by the best two Nations League group winners, that did not finish top two of their group in the first round. These twelve teams were drawn into three play-off paths, playing two rounds of single-match play-offs (semi-finals and finals). The three path winners qualify for the World Cup. ====Final positions (first round)==== Group A Group B Group C Group D Group E Group F Group G Group H Group I Group J ====Second round==== ==Inter-confederation play-offs== There will be two inter-confederation play-offs to determine the final two qualification spots for the World Cup. They are scheduled to be played in Qatar on 13–14 June 2022. ===AFC v CONMEBOL=== ===CONCACAF v OFC=== ==Goalscorers== Below are goalscorer lists for each confederations and the inter-confederation play-offs: *AFC *CAF *CONCACAF *CONMEBOL *OFC *UEFA *Inter-confederation play-offs ==Notes== ==References== Category:2022 FIFA World Cup",
 "title": "2022 FIFA World Cup qualification"
}