{
 "id": "888419",
 "text": "Bruce Hornsby is an American singer and songwriter. In 1986 Bruce Hornsby and the Range had a number one song on music charts in the United States, Canada and the Netherlands.Canada Top Singles peaks RPM MagazineDutch Top 40 peaks ==Early life== Hornsby was born on November 23, 1954 in Williamsburg, Virginia. ==Awards and nominations== Award Year Nominee(s) Category Result ASCAP Pop Music Awards 1988 \"The Way It Is\" Most Performed Songs ASCAP Pop Music Awards 1990 \"The End of the Innocence\" Most Performed Songs https://worldradiohistory.com/Archive-All-Music/Cash- Box/90s/1990/CB-1990-06-23.pdf ASCAP Pop Music Awards 1991 \"The End of the Innocence\" Most Performed Songs https://worldradiohistory.com/Archive-All- Music/Billboard/90s/1991/BB-1991-05-25.pdf#page=113 Grammy Awards 1987 Bruce Hornsby & the Range Best New Artist Grammy Awards 1990 \"The Valley Road\" Best Bluegrass Recording Grammy Awards 1990 \"The End of the Innocence\" Song of the Year Grammy Awards 1990 \"The End of the Innocence\" Record of the Year Grammy Awards 1991 \"Across the River\" Best Pop Performance by a Duo or Group with Vocal Grammy Awards 1994 \"Barcelona Mona\" Best Pop Instrumental Performance Grammy Awards 1995 \"The Star Spangled Banner\" Best Pop Instrumental Performance Grammy Awards 1996 \"Song B\" Best Pop Instrumental Performance Grammy Awards 1996 \"Love Me Still\" Best Song Written for Visual Media Grammy Awards 2000 \"Song C\" Best Pop Instrumental Performance Grammy Awards 2005 \"Song F\" Best Pop Instrumental Performance Grammy Awards 2007 \"Song H\" Best Pop Instrumental Performance Grammy Awards 2009 \"Is This America?\" Best Country Instrumental Performance MTV Video Music Awards 1987 \"The Way It Is\" Best New Artist in a Video Pollstar Concert Industry Awards 1987 Bruce Hornsby & the Range Next Major Arena Headliner Pollstar Concert Industry Awards 1988 Bruce Hornsby & the Range Next Major Arena Headliner Pollstar Concert Industry Awards 1988 Tour Small Hall Tour Of The Year ==Sources== Category:Living people Category:1954 births Category:Singers from Virginia",
 "title": "Bruce Hornsby"
}