{
 "id": "88867",
 "text": "La Dessalinienne (, ; \"The Dessalines Song\") is the national anthem of Haiti, honoring Jean-Jacques Dessalines. The lyrics (words of the song) were written by Justin Lhérisson and its music composed by Nicolas Geffrard; it was adopted in 1904. == Lyrics == === French version === French lyrics (The original) English translation Pour le Pays, Pour les ancêtres, Marchons unis, Marchons unis. Dans nos rangs point de traîtres! Du sol soyons seuls maîtres. Marchons unis, Marchons unis Pour le Pays, Pour les ancêtres, Marchons, marchons, marchons unis, Pour le Pays, Pour les ancêtres. Pour les Aïeux, pour la Patrie Bêchons joyeux, bêchons joyeux Quand le champ fructifie L'âme se fortifie Bêchons joyeux, bêchons joyeux Pour les Aïeux, pour la Patrie Bêchons, bêchons, bêchons joyeux Pour les Aïeux, pour la Patrie. Pour le Pays et pour nos Pères Formons des Fils, formons des Fils Libres, forts et prospères Toujours nous serons frères Formons des Fils, formons des Fils Pour le Pays et pour nos Pères Formons, formons, formons des Fils Pour le Pays et pour nos Pères. Pour les Aïeux, pour la Patrie O Dieu des Preux, O Dieu des Preux! Sous ta garde infinie Prends nos droits, notre vie O Dieu des Preux, O Dieu des Preux! Pour les Aïeux, pour la Patrie O Dieu, O Dieu, O Dieu des Preux Pour les Aïeux, pour la Patrie. Pour le Drapeau, pour la Patrie Mourir est beau, mourir est beau! Notre passé nous crie: Ayez l'âme aguerrie! Mourir est beau, mourir est beau Pour le Drapeau, pour la Patrie Mourir, mourir, mourir est beau Pour le Drapeau, pour la Patrie. For our country, For our ancestors, United let us march. Let there be no traitors in our ranks! Let us be masters of our soil. United let us march For our country, For our ancestors. For our forebears, For our country Let us toil joyfully. May the fields be fertile And our souls take courage. Let us toil joyfully For our forebears, For our country. For our country And for our forefathers, Let us train our sons. Free, strong, and prosperous, We shall always be as brothers. Let us train our sons For our country And for our forefathers. For our forebears, For our country, Oh God of the valiant! Take our rights and our life Under your infinite protection, Oh God of the valiant! For our forebears, For our country. For the flag, For our country To die is a fine thing! Our past cries out to us Have a strong soul! To die is a fine thing, For the flag, For our country. ===Haitian Creole version=== Creole version lyrics English translation IPA transcription Pou Ayiti peyi Zansèt yo Se pou nou mache men nan lamen Nan mitan nou pa fèt pou gen trèt Nou fèt pou nou sèl mèt tèt nou. Annou mache men nan lamen Pou Ayiti ka vin pi bèl Annou, annou, met tèt ansanm Pou Ayiti onon tout Zansèt yo. Pou Ayiti onon Zansèt yo Se pou nou sekle se pou nou plante Se nan tè tout fòs nou chita Se li ki ba nou manje An bite tè, an voye wou Ak kè kontan, fòk tè a bay Sekle, wouze, fanm tankou gason Pou nou rive viv ak sèl fòs ponyèt nou. Pou Ayiti ak pou Zansèt yo Fò nou kapab vanyan gason Moun pa fèt pou ret ak moun Se sa ki fè tout manman ak tout papa Dwe pou voye timoun yo lekòl Pou yo aprann, pou yo konnen Sa Tousen, Desalin, Kristòf, Petyon Te fè pou wet Ayisyen anba kòd blan. Pou Ayiti onon Zansèt yo Ann leve tèt nou gad anlè Pou tout moun mande Granmèt la Pou li ba nou pwoteksyon Pou move zanj pa detounen n Pou nou ka mache nan bon chimen Pou libète ka libète Fòk lajistis blayi sou peyi a! Nou gen drapo tankou tout pèp Se pou nou renmen li mouri pou li Se pa kado blan te fè nou Se san Zansèt nou yo ki te koule Pou nou kenbe drapo nou wo Se pou nou travay met tèt ansanm. Pou lòt peyi ka respekte li Drapo sila a se nanm tout Ayisyen. For Haiti, the Country's Ancestors We must walk hand in hand There must not be traitors among us We must be ourselves's unique master. Let's walk hand in hand For Haiti can be more beautiful. Let us put our heads together To Haiti on behalf of all its ancestors. For Haiti on the behalf of the Ancestors Let us mow, let us sow Let us sit in the soil's strength It has given us food In stumbled ground sends wheels With joy must provide ground Mow, water, women and men Must we come to live only by our arms' strength. For Haiti and for the Ancestors We must be courageous People are not born to serve others That is why all mothers and all fathers Need to send children to school To learn to know What Toussaint, Dessalines, Christophe, Petion Made for bouncing Haitians under the white code. For Haiti on the behalf of the Ancestors Let us raise our head and look above For everyone to ask the Lord To grant us protection For bad angels we diverted For we will march in the right path For liberty be liberty May justice spread over the country! We have a flag like all people Let us love it, die for it It was not a gift from the whites It was our Ancestors blood that was shed To hold our flag high Let us work together and focus For other countries to respect it This flag is the soul of every Haitian. [pu a.ji.ti pe.ji zã.sɛt jo] [se pun ma.ʃe mɛ̃ nã la.mɛ̃] [nã mi.tãn pa fɛt pu gɛ̃ tɣɛt] [nu fɛt pun sɛl mɛt tɛt nu] [ã.nu ma.ʃe mɛ̃ nã la.mɛ̃] [pu a.ji.ti ka vin pi bɛl] [ã.nu ã.nu met tɛt ã.sãm] [pu a.ji.ti o.nɔ̃ tut zã.sɛt jo] [pu a.ji.ti o.nɔ̃ zã.sɛt jo] [se pun se.kle se pun plã.te] [se nã tɛ tut fɔs nu ʃi.ta] [se lik ba nu mã.ʒe] [ãn bi.te tɛ ãn vo.je wu] [ak kɛ kɔ̃.tã fɔk tɛ a baj] [se.kle wu.ze fãm tã.ku ga.sɔ̃] [pun ɣi.ve viv ak sɛl fɔs pɔ̃.jɛt nu] [pu a.ji.ti ak pu zã.sɛt jo] [fo nu ka.pab vã.jã ga.sɔ̃] [mun pa fɛt pu ɣet a.vɛk mun] [se sak fɛ tut mã.mã ak tut pa.pa] [dwe pu vo.je ti.mũ le.kɔl] [pu jo a.pɣãn pu jo kɔ̃.nɛ̃] [sa tu.sɛ̃ de.sa.lin kɣis.tɔf pe.tjɔ̃] [te fɛ pu wet a.ji.sjɛ̃ ã.ba kɔd blã] [pu a.ji.ti o.nɔ̃ zã.sɛt jo] [ãn le.ve tɛt nu gad ã.lɛ] [pu tut mun mã.de gɣã.mɛt la] [pul ba nu pwo.tek.sjɔ̃] [pu mo.ve zãʒ pa de.tu.nɛ̃n] [pun ka ma.ʃe nã bɔ̃ ʃi.mɛ̃] [pu li.bɛ.te ka li.bɛ.te] [fɔk la.ʒis.tis bla.ji su pe.ji a] [nu gɛ̃ dɣa.po tã.ku tut pɛp] [se pun rɛ̃.mɛ̃l mu.ɣi pu li] [se pa ka.do blã te fɛ nu] [se sã zã.sɛt nu jo ki te ku.le] [pu nu kɛ̃.be dɣa.po nu wo] [se pun tɣa.vaj met tɛt ã.sãm] [pu lɔt pe.ji ka ɣes.pek.tel] [dɣa.po si.la a se nãm tut a.ji.sjɛ̃] ==References== == Other websites == * La Dessalinienne (mp3) Category:1904 works Category:North American anthems Category:National symbols of Haiti",
 "title": "La Dessalinienne"
}