{
 "id": "88879",
 "text": "Aixinjueluo Yuhuan (; ) (October 1929 – 23 June 2003) was a recent Chinese traditional artist in both traditional Chinese paintings and traditional Chinese music. He is also one of the few descendants of the royal family of the Qing Dynasty. He is the great-great-grandson of the Daoguang Emperor. He was born in the Prince Gong Mansion in Beijing, China. ==Art career== In 1957, he joined the China Artists' Association, and in 1981 he was added into The Chinese Great Artists' Dictionary. He has won many art prizes in China dealing with Chinese traditional art, his pieces are mostly landscapes, people, and close-up pictures of flowers and bamboo. ===Early art career=== YuHuan was an only son of Aixinjueluo Pu Shu Ming who has lived in the Prince Gong Mansion for some time after the Qing Dynasty was overruled. Good links to his uncle Pu Xin-Yu, who was a famous traditional artist of China, provided him with art lessons which set his appetite for painting Chinesetraditional art. In Junior High School, he has already started publishing his own comics on the newspapers, he became more and more interested in the arts, he eventually applied and was accepted by the Arts Department of the Beijing Normal University. The art he was taught at the Beijing Normal University was Western art although he was used to Chinese paintings. ==Music career== Artist YuHuan was also a sanxian musician, his lessons with traditional Chinese instruments started when he was a child, and still living in the Prince Gong Mansion. At his death, he had already mastered many difficult pieces and he played until his late 60s. ===The Song of Qing Dynasty=== At the age of eight, he started to learn the sanxian, a 500-year-old Chinese three-string, plucked instrument. The song he learned was a song from the Qing Dynasty (the dynasty of his great-great-grandfather), it consisted of 13 pieces, with each piece about 20–45 minutes long. He did not learn all of the pieces of the song because his tutor only knew 13 of them (there were more that his tutor did not know). Even so, it took him 2 years to master it, with courses of one 2-hour lesson per week. He had already passed on the song to a lecturer in the Central Conservatoire of Music in Beijing, his student also took two years to master it. ==Influences== The leaders of many countries and foreign ministers have met with Yuhuan and either bought or received his paintings as donations or presents, the countries include: Hungary, Germany, the US, Canada, Japan, and many more. He has also lectured in many universities Japan, Singapore and Indonesia. Galleries and exhibitions of his work were also presented to and hosted at many of the above countries. ==Family== Mr. Aixinjueluo has three sons. All of them are successful. Their names are Aixinjueluo Hengyue (a writer), Aixinjuelo Hengkai (artist), and Aixinjueluo Hengjun (IT specialist). ==References== * Zhang, Hu. \"A Developed Era with a Beautiful Sound: Mr. YuHuan Discusses Music at Prince Gong Mansion\". Beijing Morning News 16 July 1988. * Xia, Jun. \"The Knowledgeable and Talented Ai Xin Jue Luo YuHuan\". Renmin Ribao of Hong Kong 13 July 1988. * Xia, Jun. \"Ai Xin Jue Luo YuHuan and the Music of Prince Gong Mansion\". Renmin Ribao of China 24 February 1989. * \"Royal Painting\". The Indonesia Times: an Independent Newspaper 16 September 1992. * \"The Last Emperor's Nephew: My two Grueling Years to Master Qing Song\". The Strait Times 30 January 1992. Category:1929 births Category:2003 deaths Category:20th-century Chinese painters Category:Chinese musicians Category:21st-century Chinese painters",
 "title": "Aisin Gioro Yuhuan"
}