{
 "id": "889052",
 "text": "Margaret Phyllis Lose (November 15, 1925-September 30, 2019)\"Obituary for Dr. Margaret Phyllis Lose\". Obituary for Dr. Margaret Phyllis Lose | Marianna Chapel Funeral Home. Retrieved 2021-12-16. was the first woman equine (horse) vet in the United States.Rossi, F. (1989, Oct 10). A GALLOPING HEALER: PHYLLIS LOSE HAS ALWAYS BEEN AHEAD OF THE PACK, FROM THE MAIN LINE TO THE BACKSTRETCH AT PHILADELPHIA PARK. THE PIONEERING FEMALE HORSE SURGEON SOMEHOW FOUND TIME TO WRITE FOUR BOOKS - WHEN SHE WASN'T RIDING HER HARLEY. Philadelphia Inquirer.\"A Life of Abundant \"Firsts\"\". Brandon Equine Medical Center. Retrieved 2022-01-29. She opened many equine surgical hospitals, and was extremely successful in her surgeries. She never had a client with a postoperative (after operation) infection. She was the third woman to get a horse trainer license in the United States. \"First Woman Equine Veterinarian Reflects On Her Career\". Veterinary Practice News. 2013-03-20. Retrieved 2021-12-16. https://www.veterinarypracticenews.com/first-woman-equine-veterinarian-reflects-on-her-career/ == Early life == Phyllis Lose’s parents taught her to be tough, and always keep on moving forward in her life. They motivated her to work hard if she wants to make something happen. When she was younger, she once convinced her parents to let her keep a horse in their garage! Lose has always had a love of horses. She graduated from the University of Pennsylvania Veterinary School in 1957. She was one of three women in her graduating class.Rossi, F. (1989, Oct 10). A GALLOPING HEALER: PHYLLIS LOSE HAS ALWAYS BEEN AHEAD OF THE PACK, FROM THE MAIN LINE TO THE BACKSTRETCH AT PHILADELPHIA PARK. THE PIONEERING FEMALE HORSE SURGEON SOMEHOW FOUND TIME TO WRITE FOUR BOOKS - WHEN SHE WASN'T RIDING HER HARLEY. Philadelphia Inquirer. She was the only woman who studied large animals.Rossi, F. (1989, Oct 10). A GALLOPING HEALER: PHYLLIS LOSE HAS ALWAYS BEEN AHEAD OF THE PACK, FROM THE MAIN LINE TO THE BACKSTRETCH AT PHILADELPHIA PARK. THE PIONEERING FEMALE HORSE SURGEON SOMEHOW FOUND TIME TO WRITE FOUR BOOKS - WHEN SHE WASN'T RIDING HER HARLEY. Philadelphia Inquirer. Lose was the first certified female equine veterinarian in the United States.Rossi, F. (1989, Oct 10). A GALLOPING HEALER: PHYLLIS LOSE HAS ALWAYS BEEN AHEAD OF THE PACK, FROM THE MAIN LINE TO THE BACKSTRETCH AT PHILADELPHIA PARK. THE PIONEERING FEMALE HORSE SURGEON SOMEHOW FOUND TIME TO WRITE FOUR BOOKS - WHEN SHE WASN'T RIDING HER HARLEY. Philadelphia Inquirer. == Career == First Lose was a horse trainer.WOMEN RIDERS LED BY EXERCISE GIRL: JOYCE GOLDSCHMIDT, 18, BEATS PHYLLIS LOSE, A TRAINER, IN ANNUAL RACE AT PIMLICO. (1947, May 08). New York Times (1923-) When she graduated Lose opened the first woman-owned and woman-run horse veterinary clinic.\"A Life of Abundant \"Firsts\"\". Brandon Equine Medical Center. Retrieved 2022-01-29. Lose was the first woman to build an equine surgical hospital. She is also the first woman horse doctor in the United States. She was the third woman to have a horse trainer license in the United States as well. She developed many different methods and new types of medicines to help perform more successful surgeries on horses. For example, Lose Lose doesn’t like to use steroids to relax muscles in hurt horses, which is a very common thing to do with other vets.Rossi, F. (1989, Oct 10). A GALLOPING HEALER: PHYLLIS LOSE HAS ALWAYS BEEN AHEAD OF THE PACK, FROM THE MAIN LINE TO THE BACKSTRETCH AT PHILADELPHIA PARK. THE PIONEERING FEMALE HORSE SURGEON SOMEHOW FOUND TIME TO WRITE FOUR BOOKS - WHEN SHE WASN'T RIDING HER HARLEY. Philadelphia Inquirer. Lose opened two equine hospitals in Pennsylvania. During Lose’s busiest years, she treated up to 1,000 horses a week!Rossi, F. (1989, Oct 10). A GALLOPING HEALER: PHYLLIS LOSE HAS ALWAYS BEEN AHEAD OF THE PACK, FROM THE MAIN LINE TO THE BACKSTRETCH AT PHILADELPHIA PARK. THE PIONEERING FEMALE HORSE SURGEON SOMEHOW FOUND TIME TO WRITE FOUR BOOKS - WHEN SHE WASN'T RIDING HER HARLEY. Philadelphia Inquirer. Retrieved 2021-12-08 - from ProQuest. Lose won some money off of her dog, when she entered him in a dog food contest. She closed her hospital, to pursue her dog, Oscar’s, movie career in Florida. Lose wrote many books. Her autobiography is called, \"No Job for a Lady.”Rossi, F. (1989, Oct 10). A GALLOPING HEALER: PHYLLIS LOSE HAS ALWAYS BEEN AHEAD OF THE PACK, FROM THE MAIN LINE TO THE BACKSTRETCH AT PHILADELPHIA PARK. THE PIONEERING FEMALE HORSE SURGEON SOMEHOW FOUND TIME TO WRITE FOUR BOOKS - WHEN SHE WASN'T RIDING HER HARLEY. Philadelphia Inquirer. == Personal life == In both her career, as well as her personal life. She never married. Her work was too busy. She slept about three or four hours a night.Rossi, F. (1989, Oct 10). A GALLOPING HEALER: PHYLLIS LOSE HAS ALWAYS BEEN AHEAD OF THE PACK, FROM THE MAIN LINE TO THE BACKSTRETCH AT PHILADELPHIA PARK. THE PIONEERING FEMALE HORSE SURGEON SOMEHOW FOUND TIME TO WRITE FOUR BOOKS - WHEN SHE WASN'T RIDING HER HARLEY. Philadelphia Inquirer. One of her dogs, Oscar, was a movie star at Universal Studios, Orlando, Florida. She died in 2019. == References == Category:Veterinarians",
 "title": "Phyllis Lose"
}