{
 "id": "889082",
 "text": "Bisa Butler (born Mailissa Yamba Butler in 1973) is an American artist. She makes quilts. Her quilts are a new style that no one has made before.Scott, Chadd. \"Bisa Butler Exhibition At Art Institute Of Chicago Headlines National Recognition Of Quilting\". Forbes. Retrieved 2022-01-08. They look like paintings. Her method is changing how other people make quilts.\"Bisa Butler's Quilts Feature Designs So Realistic That They're Compared To Paintings\". NPR.org. Retrieved 2022-01-08. The Smithsonian, the Art Institute of Chicago, The Museum of Fine Art, and many other museums have Butler’s quilts.\"Positively Black: Bisa Butler's 'The Warmth of Other Suns'\". NBC New York. Retrieved 2022-01-08. She is now making a new group of quilts for the Smithsonian Museums. Magazine and book publishers also hired Butler to make quilts for their covers. Butler made quilts for the fronts of Time magazine, Essence, Juxtapoz, and Tarana Burke's memoir. Many other newspapers and magazines have written stories about Butler. Forbes, Vogue,Edquist, Grace (2020-03-03). \"Depth, History, and Reverence: The Intricacies of Bisa Butler's Quilted Portraits\". Vogue. Retrieved 2022-01-10. The Wall Street Journal, Smithsonian Magazine,Logan, Liz (July 2020) \"Artist Bisa Butler Stitches Together the African American Experience\". Smithsonian Magazine. Retrieved January 10, 2022. CBS, NBC, and National Public Radio have all written about her. Oprah Winfrey Network (OWN) also showed her quilts.\"10 Breakthrough Women Artists As Polled By Black-Owned Art Galleries\" . BLACK ART IN AMERICA. 2020-02-27. Retrieved 2021-12-16. == Early life == Butler was born in 1973, to a Ghanan father and a mother from New Orleans. Her mother was raised in Morocco. Butler learned about quilting and fabric from her mother and grandmother. == Education == Butler attended Howard University.\"Black Lives Are Celebrated In Bisa Butler's Extraordinary, Technicolor Quilts\". NPR.org. Retrieved 2021-12-16. She studied painting. Butler discovered that painting was not her favorite art. She then got her graduate degree from Montclair State University in New Jersey. Her first quilted portrait was of her grandparents. == Career == Butler's quilts are portraits of Black Americans. Butler finds old photographs and makes quilts based on them. She quilts both famous people and unknown people. She wants to tell the experience of Twentieth Century Black Americans. Her quilts are very colorful. She uses colours to describe the personalities of the people she is quilting. Many of the fabrics Butler uses come from Ghana. The quilts are also very complex. Butler spends hundreds of hours making one quilt. === Teacher === Butler taught high school art in Elizabeth, New Jersey until 2018.White, Katie (2021-04-07). \"How Bisa Butler Went From Being a High School Art Teacher to an In-Demand Quilter With a Show at the Art Institute of Chicago\". Artnet News. Retrieved 2021-12-19. Butler rejected an invitation to exhibit her quilts in Switzerland. She did not want to leave her students during their school year. She made quilts to sell at art fairs. === Professional artist === While she was teaching Butler created her famous quilt: “Safety Patrol”. “Safety Patrol” was based on a photo by Charles “Teenie” Harris. Butler sold quilts through the Claire Oliver Gallery in New York. In 2018, Butler participated in art fairs which included Expo Chicago.\"Artist Bisa Butler's \"portrait quilts\" celebrate Black life and history\". www.cbsnews.com. Retrieved 2021-12-19. For the Expo Chicago she made a special quilt titled “Southside Sunday Morning”. \"Southside Sunday Morning\" was based on Russell Lee's 1941 photograph called \"Negro Boys on Easter Morning.\" Erica Warren, from the Art Institute of Chicago, saw Butler's quilts at the Expo Chicago. Warren decided to exhibit Butler's work at the Art Institute of Chicago Museum. Warren bought \"Saftey Patrol.\" Her first solo museum exhibit was the Katonah Museum of Art. It was supposed to open in early 2020. \"Bisa Butler: Portraits\" was postponed by the COVID-19 Pandemic. It finally opened on July 26, 2020.Croke, K. (2020, July 25). NYC, HUDSON VALLEY ATTRACTIONS BEGIN TO OPEN THEIR DOORS. Record, The (Hackensack, NJ), p. LF3. Available from NewsBank: Access World News – Historical and Current. Retrieved January 13, 2022. Most of the quilts for that exhibit were based on photos from the 1930s and 1940s. \"Bisa Butler: Portraits\" moved to the Art Institute of Chicago in February, 2021. Her exhibit was extended to last until September 6th, 2021. ==== Influences ==== Butler admires the work of Romare Bearden, Gordon Parks, Faith Ringgold, Barbara Jones Hogu, and the AfriCOBRA movement. Their art inspires her art. == Personal life == Butler lives in New Jersey with her husband, John Butler. John Butler is a professional deejay. He helps Butler pick songs that go with her quilts. They have used songs from many musicians, including Tupac Shakur, Muddy Waters, Mahalia Jackson, and Jill Scott. == References == Category:American artists Category:Textile artists Category:Living people Category:20th-century artists Category:21st-century artists",
 "title": "Bisa Butler"
}