{
 "id": "889083",
 "text": "Katy Pyle is an American ballet dancer.Wren, C. (2021, Jun 06). Troupe's 'giselle' puts the spotlight on non-inclusiveness in classical ballet. The Washington Post. Retrieved 2021-12-07.Kourlas, G. (2016, Apr 24). A choreographer and her 'misfits of ballet': Katy pyle's troupe, ballez, focuses on questions of gender. New York Times (1923-) Retrieved 2021-12-07.Wren, C. (2021). This LGBTQ ‘Giselle’ celebrates individuality, putting a spotlight on non-inclusiveness in classical ballet: For “Giselle of loneliness,” ballez founder katy pyle cast dancers who have their own complicated relationships with ballet. Retrieved on 2021-12-07. As a child, Pyle was told they were too strong to dance as a girl.Kourlas, G. (2021, Jun 12). Finding their way back to ballet: [review]. New York Times Retrieved 2021-12-07. They also never met a lesbian ballet dancer.Burke, S. (2021, Jun 06). Breaking away to be yourself: [arts and leisure desk]. New York Times Retrieved 2021-12-07. Pyle wants more people to feel welcome in dance. They want to help people find happiness in dance. They created the dance company Ballez. Ballez is a place for people who are underrepresented in ballet. They are also the creator and choreographer of Sleeping Beauty and the Beast, and Giselle of Loneliness. == Early life == Pyle was a ballet student in 1990. They identify as a genderqueer lesbian. They use they/them pronouns. A Ballet teacher told them that they would have a better career if they were a boy. Because they wanted to dance in a way that was “more masculine.” Ballet is often divided by gender. Pyle felt a lack of representation. They felt confused about their identity. == Career == Pyle researched queer ballet dancers. Pyle was inspired by the people they learned about. Bronislava Nijinska was a ballet choreographer. Nijinska created the ballet Les Bitches. Pyle felt happy and mad. They were happy because there were people like them. They were sad because these people were made invisible. == References == Category:Living people Category:Year of birth missing (living people) Category:Ballet dancers Category:American dancers",
 "title": "Katy Pyle"
}