{
 "id": "889084",
 "text": "Sarah Thomas ( Bailey; born September 21, 1973) is an American football referee for the National Football League (NFL). Thomas is the first woman to be a permanent NFL official. Thomas is breaking gender barriers around her career. Thomas was the first woman to officiate the Super Bowl.\"Sarah Thomas Recalls Road To Being First Woman To Officiate Super Bowl\". www.baynews9.com. Retrieved 2022-01-29. She refereed the Super Bowl in Tampa, Florida, in 2021.Swinton, Elizabeth. \"Five Things to Know About Sarah Thomas\". Sports Illustrated. Retrieved 2021-02-10. == Early Life == Sarah Thomas was raised in Pascagoula Mississippi. She and her brother played sports. She received a scholarship for basketball at the University of Mobile.Swinton, Elizabeth. \"Five Things to Know About Sarah Thomas\". Sports Illustrated. Retrieved 2021-02-10. Thomas was recorded 5th best in the school for her excellence in basketball. Her statistics over five seasons: 779 points, 411 rebounds, 108 assists, and 192 steals. Thomas was titled Academic All-American at Mobile. She aided her team get to the National Association of Intercollegiate Athletics Tournament. Thomas got a degree in communications and graduated Mobile in 1995. == First Jobs == Thomas was interested in becoming a Football official after college. She went with her older brother to his officiating meeting. She started being an official for grade school, and then high schools in 1999. Thomas officiated a high school state championship game in Mississippi, 2007. Joe Henes, who is a retired official told Gerry Austin, a supervisor of Conference USA’s officials about Thomas and her ability to officiate.Swinton, Elizabeth. \"Five Things to Know About Sarah Thomas\". Sports Illustrated. Retrieved 2021-02-10. Joe Henes recommended she start officiating college football. Austin looked into her skill set and hired Thomas. This made her the first woman to officiate a major college game.Swinton, Elizabeth. \"Five Things to Know About Sarah Thomas\". Sports Illustrated. Retrieved 2021-02-10. She started working for the NFL in 2015. == Skills == Thomas has good communication skills. She can talk to coaches. She listens to the coach when they are questioning the call. She calms them down. Coaches are confident about her abilities. == References == Category:Living people Category:1973 births Category:American referees Category:Sportspeople from Mississippi",
 "title": "Sarah Thomas"
}