{
 "id": "889057",
 "text": "Dawn Michelle Staley (born May 4, 1970) is an American women's basketball coach and player.\"South Carolina awards Staley 7-year, $22.4 million contract\". AP NEWS. 2021-10-15. Retrieved 2022-01-30. She is a four-time Southeastern Conference (SEC) Coach of the Year winner and the 2020 Associated Press Coach of the Year.Hurd, Sean (2020-03-23). \"Dawn Staley and the sting of losing a championship season\". The Undefeated. Retrieved 2022-01-30. She was hired at University of South Carolina in the 2008-2009 season. Before, she had coached at Temple University.Associated Press. (2021-10-15). \"South Carolina awards Dawn Staley 7-year, $22.4 million contract\". College Basketball | NBC Sports. Retrieved 2022-01-30. In 2017 they won the national title. She has five SEC regular titles and six league tournament crowns. She also coached the USA women's olympic basketball team at the Tokyo Olympics in 2020 where they won the gold medal.Drumwright, Steven (August 16, 2021). \"DAWN STALEY LEAVES WOMEN'S OLYMPIC TEAM IN FAMILIAR PLACE ATOP PODIUM\". Team USA. == Education == Staley went to high school at Dobbins Tech High school.Jim Brady Special to The,Washington Post. (1991, Mar 28). Staley quietly emerges as nation's best player: COLLEGES WOMEN'S FINAL FOUR DAWN STALEY'S VIRGINIA STATISTICS. The Washington Post (1974-) Retrieved from https://www.proquest.com/docview/140518968 She led them to 3 league championships. She won high school player of the year as a senior. She decided to go to University of Virginia because she could play immediately and for their reputation for developing point guards. She was one of six children the first person in her family to go to college. == Career == Staley was a basketball coach at Temple University. Her team at Temple won many games and got to play in the NCAA tournaments for eight years. Staley came to coach at the University of South Carolina in the 2007-2008 season. The South Carolina women's basketball team was not very popular. Staley helped them win their first national championship in 2017. The team's really good season in 2020 was ended by the COVID-19 Pandemic. In 2021, Staley signed a seven-year contract with the South Carolina Gamecocks. She earns a $1 million US base salary. She will also receive $1.9 million US every subsequent year which will grow by $100,000 every year. She can also get up to $680,000 in incentive bonuses. If Staley leaves without reason, she would pay the school 5 million. If the school fired her without reason, they would owe her 3 million dollars. Staley believes that the 22.4 million dollars will help equalize women's and men's pay in basketball. She is now the highest paid black women's basketball coach, and one of the highest paid basketball coaches. Staley also passed Louisiana State University coach Kim Mulkey making her the highest paid coach in the Southeastern Conference. == References == Category:1970 births Category:Living people Category:African-American basketball players Category:American basketball players Category:Basketball coaches Category:College basketball coaches Category:Medalists at the 1996 Summer Olympics Category:Medalists at the 2000 Summer Olympics Category:Medalists at the 2004 Summer Olympics Category:Medalists at the 2008 Summer Olympics Category:Naismith Memorial Basketball Hall of Fame inductees Category:Olympic gold medalists for the United States Category:Point guards Category:Sportspeople from Philadelphia",
 "title": "Dawn Staley"
}