{
 "id": "889059",
 "text": "Sayyida al-Hurra (Arabic: السيدة الحرة), real name Lalla Aicha bint Ali ibn Rashid al-Alami, Hakimat Titwan (Arabic: عائشة بنت علي بن رشيد العلمي) (1485 – 14 July 1561) was a pirate queen. == Biography == Al-Hurra lived in the early 1500’s. She managed to control the Western half of the Mediterranean for well over 30 years. She was born into a wealthy Muslim family. Her birth name was believed to be Aicha.\"Pirate Profile: Sayyida al Hurra | Queen Anne's Revenge Project\". www.qaronline.org. Retrieved 2021-12-18. Her family was chased out of Granada to Morocco during the Spanish Reconquista.\"Sayyida al-Hurra\". WISE Muslim Women. 2010-01-12. Retrieved 2021-12-16. She and her family then settled in Tetouán. Her first husband was the Sultan Al-Mandri. She had herself immediately named governer of Tetouán, after he died. She was bestowed the title Al-Hurra. This was a symbol of respect and power. She then married the King of Morocco. This was the only time in Islamic history a king traveled outside his country for his wedding. Spain and Portugal were worried about this. It seemed like a threat, as this alliance would be extremely strong. Iberians attacked Al-Hurra’s land. She became a pirate to defend her country and stop them. She made an alliance with the dreaded pirate Barabarossa, or Red Beard. He used his fleet to ferry refugees away from the fighting.\"Malika VI: Sayyida Al-Hurra\". AramcoWorld. Retrieved 29 January 2018. Al-Hurra terrorized Spanish and Portuguese ships. She became known and feared across the Mediterranean. She was known for taking hostages and being extremely merciless. The Spanish feared her and prayed for a miracle. The Portuguese “prayed for God to allow them to see her hanged from a ship’s mast”.Foster, S. (2020, Mar). Brave and bold? believe it! New Moon Girls, 27, 16-17. She was categorized as aggressive and bad-tempered. Al-Hurra became one of the richer pirates of her time. She still managed to maintain a consistent alliance with Red Beard. Her demise came after over 30 years of sailing. Her son-in-law usurped her power and throne. He also stole her wealth. She lived in her childhood home in Morocco until her death. She died at age 75. Sayyida Al-Hurra’s legacy lives on today. In European writing she is known as the fearsome Pirate Queen of the Mediterranean. == References == Category:Pirates Category:1485 births Category:1561 deaths Category:History of Morocco Category:Kings and Queens consort Category:Moroccan politicians Category:Slavers",
 "title": "Sayyida al-Hurra"
}