{
 "id": "889277",
 "text": "A city block is a block of houses, in a built up area. Usually, it is delimited by roads, pathways, or by geographical features, such as a railway line or a river. It consists of several land lots which are directly next to each other, and usually privately owned. A city block is a typical form of inner-city design. Commonly, multi-storey apartment buildings, semi-detatched houses, office blocks, or mixed-use houses make up the elements of a city block. As all the houses touch each other, this is known as a closed form. In the suburbs, there is more space, and the buildings don't usually touch each other. This is known as an open form. In Europe, cities have grown over centuries, and their layout is different from that of a planned city. As a result, the city block in a planned city also looks different. == Origin == The design of city blocks started with the emergence of cities, in the Middle Ages. Medieval Hanseatic cities already used city blocks. The design can also be found in baroque inner cities, such as the Dutch Quarter in Potsdam. It is typical of absolutist urban development and the tenement districts of major German cities that were built after 1870 during the Wilhelminian era. In response to the housing shortage of the 1920s, housing associations built apartment blocks with large courtyards and small apartments. At the same time, however, city planners were also looking for alternatives to the perimeter block development that was common at the time. What they did was build blocks perpendicular to the road; they would then build footpaths as access. This has the benefit that all apartments get the same amount of sunshine. It has the drawback, that larger arrangements look monontonus.This kind of city planning was widespread during the reconstruction of Germany after the Second World War, in the 1950s and 1960s. Another benefit of this model is that neighborhoods have a better airflow. During the Middle Ages, city blocks were often simply chaining buildings, in an unplanned way. Even in antiquity , there were planned cities. Examples of this are the city of Miletus, or the model of a Roman city, which both used a regular grid layout. During the Baroque era, citty planning was common: Cities were planned with big geometric layouts, later they were divided into different land lots, before being built. City blocks are also used for collecting statistical data on the population structure . When visualizing 3D city models, people oftenuse simplified solid bodies that are supposed to correspond to the real building blocks. Category:Urban design",
 "title": "City block"
}