{
 "id": "889287",
 "text": "This is a list of feature length movies were based on of the Tom and Jerry franchise, a comedy movie franchise based on the short series of the same name. All of the movies were ongoing produced for 1-18 to upcoming related of future direct-to-video and theatrical feature length entries was since 1992. outsourced from traditional/digital ink and paint, flash-animation as well computer animated featured both the 2021 and 2027. ==Theatrical films== # Title Release date Directed by Written by Produced by Studio Distributed by Notes 1 Tom and Jerry: The Movie (Germany) (United States) Phil Roman Dennis Marks Phil Roman Live Entertainment Turner Entertainment Co. WMG Film Film Roman Miramax 2 Tom & Jerry Tim Story Kevin Costello Chris DeFaria Warner Animation Group The Story Company Turner Entertainment Co. Warner Bros. Pictures Live-action/animated film. 3 untitled Tom and Jerry Computer-animated film 2028 Rashida Jones, Will Michael Govier Warner Bros. Pictures Animation, Turner Entertainment Co. Ingenious Media Warner Bros. Pictures Computer-animated film ==Direct-to-video films== All direct-to-video films are produced by Turner Entertainment Co. and Warner Bros. Animation. # Title Year Directed by Written by Produced by 1 Tom and Jerry: The Magic Ring (United Kingdom) (United States) James Tim Walker Tim Cahill and Julie McNally Tom Minton 2 Tom and Jerry: Blast Off to Mars Bill Kopp Bill Kopp 3 Tom and Jerry: The Fast and the Furry Screenplay by: Bill Kopp Story by: Joseph Barbera Stephen Fossati 4 Tom and Jerry: Shiver Me Whiskers Scott Jeralds Christopher Painter Tom Minton and Scott Jeralds 5 Tom and Jerry: A Nutcracker Tale Spike Brandt and Tony Cervone Screenplay by: Spike Brandt Story by: Joseph Barbera Spike Brandt and Tony Cervone 6 Tom and Jerry Meet Sherlock Holmes Spike Brandt and Jeff Siergey Earl Kress Bobbie Page 7 Tom and Jerry & the Wizard of Oz Spike Brandt and Tony Cervone Gene Grillo Bobbie Page and Judge Plummer 8 Tom and Jerry: Robin Hood and His Merry Mouse Story by: Earl Kress Screenplay by: Earl Kress and Michael F. Ryan Spike Brandt and Tony Cervone 9 Tom and Jerry's Giant Adventure Paul Dini 10 Tom and Jerry: The Lost Dragon Brian Swenlin 11 Tom and Jerry: Spy Quest Story by: Jim Krieg Teleplay by: Jim Krieg and Heath Corson 12 Tom and Jerry: Back to Oz Paul Dini align=\"center\" 13 Tom and Jerry: Willy Wonka and the Chocolate Factory Spike Brandt Gene Grillo Spike Brandt 14 Tom and Jerry: Cowboy Up! Darrell Van Citters Story by: Will Finn Teleplay by: William Waldner Kimberly S. Moreau, Ashley Postlewaite and Darrell Van Citters 15 Tom and Jerry: Snowman's Land Story by: Jase Ricci Teleplay by: Will Finn and Jase Ricci 16 The Tuffy Mouse Movie 2026 Nick Jennings Kath Soucie Sam Register, Kath Soucie ===Tom and Jerry: The Magic Ring=== ===Tom and Jerry: Blast Off to Mars=== ===Tom and Jerry: The Fast and the Furry=== ===Tom and Jerry: Shiver Me Whiskers=== ===Tom and Jerry: A Nutcracker Tale=== ===Tom and Jerry Meet Sherlock Holmes=== In London, Tom and Jerry work together with Sherlock Holmes to stop Professor Moriarty from stealing the Crown Jewels during a solar eclipse. ; Voice cast * Spike Brandt (uncredited) as Tom Cat and Jerry Mouse * Michael York as Sherlock Holmes * Malcolm McDowell as Professor Moriarty * John Rhys-Davies as Dr. Watson * Grey DeLisle as Red * Kath Soucie as Tuffy * Jeff Bergman as Butch and Droopy * Phil LaMarr as Spike and Policeman * Greg Ellis as Tin and Sergeant * Jess Harnell as Pan and Brett Jeremy * Richard McGonagle as Alley and First Policeman ===Tom and Jerry & the Wizard of Oz=== Tom and Jerry & the Wizard of Oz is an animated adaptation of the 1939 Metro-Goldwyn-Mayer film The Wizard of Oz (which in turn is based on the 1900 novel The Wonderful Wizard of Oz by L. Frank Baum), with the addition of Tom and Jerry as characters and told through their point of view. The film was released on DVD and Blu-ray on August 23, 2011, by Warner Home Video. Common Sense Media rated the film 3 out of 5 stars. ; Voice cast * Spike Brandt (uncredited) as Tom Cat, Jerry Mouse * Grey DeLisle as Dorothy Gale (Nikki Yanofsky provides Dorothy's singing voice) * Joe Alaskey as Professor Marvel / The Wizard (the former having only a cameo at the end of the film), Butch, Droopy * Michael Gough as Hunk / The Scarecrow * Rob Paulsen as Hickory / The Tin Man * Todd Stashwick as Zeke / The Cowardly Lion * Frances Conroy as Aunt Em, Glinda * Laraine Newman as Miss Almira Gulch / The Wicked Witch of the West * Stephen Root as Uncle Henry, Crows * Kath Soucie as Tuffy the Munchkin Mouse / Tuffy the Country Mouse ===Tom and Jerry: Robin Hood and His Merry Mouse=== ===Tom and Jerry's Giant Adventure=== ===Tom and Jerry: The Lost Dragon=== ===Tom and Jerry: Spy Quest=== ===Tom and Jerry: Back to Oz=== Tom and Jerry: Back to Oz is a 2016 fantasy comedy direct-to- video sequel to Tom and Jerry and the Wizard of Oz. In the film, Tom and Jerry team up with Dorothy and her friends as they return to the Land of Oz to stop a new villain, the Nome King, from taking over Emerald City. This movie was dedicated to voice artist Joe Alaskey who appears in his final film role after his death in February 2016. ; Voice cast * Grey Griffin as Dorothy Gale * Jason Alexander as The Nome King (Mr. Bibb) * Amy Pemberton as Dorothy's singing voice and The Mouse Queen * Joe Alaskey as The Wizard of Oz, Butch, Droopy * Michael Gough as The Scarecrow (Hunk) * Rob Paulsen as The Tin Man (Hickory) * Todd Stashwick as The Cowardly Lion (Zeke) * Frances Conroy as Auntie Em and Glinda * Laraine Newman as The Wicked Witch of the West * Stephen Root as Uncle Henry * Kath Soucie as Tuffy the Munchkin Mouse, Tractor * Andrea Martin as The Hungry Tiger * James Monroe Iglehart as Jitterbug (Calvin Carney) * Spike Brandt as Tom Cat, Jerry Mouse (uncredited), Spike ; Reception Renee Schonfeld of Common Sense Media rated it 3 out of 5 stars, saying \"By blending solid new musical numbers with the old Oz favorites and including inventive new characters, Spike Brandt, Tony Cerone, and company have made this sequel funny and original.\" ===Tom and Jerry: Willy Wonka and the Chocolate Factory=== ===Tom and Jerry: Cowboy Up!=== === Tom and Jerry: Snowman's Land === == The Tuffy Mouse Movie == Tuffy Mouse Movie is a upcoming 2026 comedy musical direct-to-video film. features voices Kath Soucie, Jill Talley, Morla Gorronda, Ben Diskin and Roger Craig Smith. == Voice cast == * Kath Soucie - Tuffy * Jill Talley - TBA * Eric Bauza - Tom, Jerry, Droopy * Ben Diskin - TBA * Morla Gorronda - TBA * Roger Craig Smith * Cristina Pucelli * Susan Silo * Pamela Adlon * Laura Bailey * Nolan North ===Tom and Jerry: Welcome To the Vacation=== ===Tom and Jerry: Nightmare Ensues === === untitled Tom and Jerry computer-animated film (2027) === Unititled Tom and Jerry computer-animated film is a 2027/2028 upcoming British-American computer- animated slapstick comedy film produced by Warner Bros. Pictures Animation. in 2024, during production by writers Rashida Jones, Will McCormack, and Michael Govier. == Appearances in other films == Title Year Notes Anchors Aweigh 1945 Tom appears as a servant and Jerry performs a dance number with Gene Kelly. Animation supervised by William Hanna and Joseph Barbera. Dangerous When Wet 1953 Tom and Jerry appear in a dream sequence swimming with Esther Williams. == References == Category:1992 establishments Category:Tom and Jerry movies Category:Warner Bros. Animation movies",
 "title": "List of Tom and Jerry feature movies"
}