{
 "id": "889280",
 "text": "The Poeciliidae are a family of fish of the order Cyprinodontiformes, the tooth-carps. They live in fresh water. Many live-bearing aquarium fish, such as the guppy, molly, platy, and swordtail are in Poeciliidae. These fish are from the United States to north of Río de la Plata, Argentina, and Africa, including Madagascar. Human beings took these fish to many other parts of the world and set them free there, so they have become invasive species. Today, poeciliid fish live in all tropical and subtropical parts of planet Earth. People have seen fish in the genuses Poecilia and Gambusia in hot spring pools as far north as Banff, Alberta in Canada. == Live-bearing == Although all fish in Poeciliidae are called \"live bearers\" (viviparous), some species do lay eggs with external fertilization. All African fish in Poeciliidae lay eggs. Almost all the American Poeciliidae bear live young (except for fish in the genus Tomeurus). Poeciliidae has three subfamilies. The fish in subfamily Aplocheilichthyinae live only in Africa. Most Poeciliinae live in the Americas (except for Rhexipanchax, which lives in Africa). Most fish in Procatopodinae live in Africa (Fluviphylax and Pseudopoecilia live in South America). Scientists say this means the ancestors of Poeciliidae fish the split between Africa and South America 100 million years ago, and that fish that went to South America evolved to bear live young after they got there. Poeciliids came to North America through the Antilles. They were able to do this because the Antilles and North America were connected 44 million years ago. Poeciliids then moved to Central America by the Aves land bridge on the Caribbean Plate. When South America connected to Central America three million years ago, some of the fish moved further south, but South American species did not move north into Central America.Hrbek, T., J. Seekinger, and A. Meyer. 2007. A phylogenetic and biogeographic perspective on the evolution of poeciliid fishes. Molecular Phylogenetics and Evolution 43:986-998. The live-bearing species fish can be different from each other depending on how much the mother fish does for the developing larvae. Many fish in the family Poeciliidae are lecithotrophic (the mother provisions the oocyte with all the resources it needs prior to fertilization, so the egg is independent of the mother), but others are matrotrophic (\"mother feeding\": the mother provides the majority of resources to the developing offspring after fertilization). Lecithotrophy and matrotrophy are not always completely separate. Most scientific studies use a matrotrophy index (MI) to say how matrotrophic an animal is. This uses the dry mass of fully developed offspring (how much they weigh when they are not wet) divided by the dry mass of a fertilized egg. Fish in the genus Poeciliopsis, for example, have many different adaptations. Poeciliopsis monacha, P. lucida, and P. prolifica are part of the same group in that genus. However, they have three different ways of helping baby fish: P. monacha is lecithotrophic because it does not give its babies any resources after fertilization. The mother fish swims around with her eggs in a sac but that is all. P. lucida shows a middle level of matrotrophy. This means that the eggs's metabolism can change the mother's metabolism, so some food chemicals go back and forth. P. prolifica is very matrotrophic. The mother fish gives the eggs almost all of the food chemicals they need after fertilization. This level of matrotrophy allows Poeciliopsis to carry several groups of eggs that were start at different times. This is called superfetation. Because the mother fish only has so much space in her body for developing embryos, viviparity reduces brood size. Superfetation can compensate for this loss by keeping embryos at various stages and sizes during development.Thibault, R. E., and R. J. Schultz. 1978. Reproductive adaptations among viviparous fishes (Cyprinodontiformes Poeciliidae). Evolution 32:320-333. P. elongata, P. turneri, and P. presidionis form an outgroup to the P. monacha, P.lucida, and P. prolifica group. These three fish are very matrotrophic. In 1947, C. L. Turner said the follicular cells of P. turneri were \"pseudo-placenta, pseudo-chorion, and pseudo-allantois.\" The greater degree of matrotrophy in a species is linked with a higher degree of placentation, including \"a thicker maternal follicle, higher degree of vascularization, and greater number of villi in the placenta.\" Scientists argue about why Poeciliid fish developed to give their young eggs food chemicals inside their bodies. There are two groups of ideas, adaptive hypotheses and conflict hypotheses. Adaptive ideas, including the locomotor hypothesis, Trexler-DeAngelis Model (reproductive allotment), and life-history facilitation, say that the fish's placenta evolved to help another advantage to evolve. The conflict hypothesis says the placenta is a nonadaptive byproduct of genetic tug-of-war between the mother and the eggs. ==Subfamilies and tribes== The family has the following subfamilies and tribes: * Subfamily Aplocheilichythinae Myers, 1928 (Banded lampeyes) **Genus Aplocheilichthys Bleeker, 1863 * Subfamily Procatopodinae Fowler, 1916 (Lampeyes) ** Tribe Fluviphylacini Roberts, 1970 *** Genus Fluviphylax Whitley, 1920 ** Tribe Procatopodini Fowler, 1916 *** Genus Laciris Huber, 1981 *** Genus Micropanchax Myers, 1924 *** Genus Lacustricola Myers, 1924 *** Genus Poropanchax Clausen, 1967 *** Genus Platypanchax Ahl, 1928 *** Genus Lamprichthys Regan 1911 *** Genus Pantanodon Myers, 1955 *** Genus Hypsopanchax Myers, 1924 *** Genus Procatopus Boulenger, 1904 *** Genus Plataplochilus Ahl, 1928 *** Genus Rhexipanchax Huber, 1999 * Subfamily Poeciliinae Bonaparte, 1831 (Livebearers) ** Tribe Alfarini Hubbs, 1924 ***Genus Alfaro Meek, 1912 ** Tribe Gambusini Gill, 1889 ***Genus Belonesox Kner, 1860 ***Genus Brachyrhaphis Regan, 1913 ***Genus Gambusia Poey, 1854 ***Genus Heterophallus Regan, 1914 ** Tribe Heterandriini Hubbs, 1924 ***Genus Heterandria Agassiz, 1853 ***Genus Neoheterandria Henn 1916 ***Genus Poeciliopsis Regan 1913 ***Genus Priapichthys Regan 1913 ***Genus Pseudopoecilia Regan 1913 ***Genus Xenophallus Hubbs, 1924 ** Tribe Poeciliini Bonaparte, 1831 *** Genus Limia Poey, 1854 *** Genus Micropoecilia Hubbs, 1926 *** Genus Pamphorichthys Regan, 1913 *** Genus Phallichthys Hubbs, 1924 *** Genus Poecilia Bloch & Schneider, 1801 *** Genus Xiphophorus Heckel, 1848 ** Tribe Cnesterodontini Hubbs, 1924 *** Genus Cnesterodon Garman, 1895 *** Genus Phalloceros Eigenmann, 1907 *** Genus Phalloptychus Eigenmann, 1907 *** Genus Phallotorynus Henn, 1916 *** Genus Tomeurus Eigenmann, 1909 ** Tribe Scolichthyini Rosen, 1967 *** Genus Scolichthys Rosen, 1967 ** Tribe Xenodexini Hubbs, 1950 ***Genus Xenodexia Hubbs, 1950 == References == * * Category:Cyprinodontiformes",
 "title": "Poeciliidae"
}