{
 "id": "889295",
 "text": "Tini \"Whetu\" Marama Tirikatene-Sullivan was a New Zealand politician.\"Whetu Tirikatene-Sullivan dies.\" RNZ. 2011-7-23. Retrieved 2021-12-15 New Zealand Ministry for Culture and Heritage. \"Tirikatene-Sullivan, Tini Whetu Marama\". Dictionary of New Zealand Biography. Retrieved 2021-12-20. She was the longest serving MP in New Zealand's Parliament. Tirikatene-Sullivan was one of few women to give an oration at Ratana Pa. She won the Fellow of the Royal Anthropological Institute of Great Britain and Ireland. Tirikatene-Sullivan was one of the top fencers in New Zealand. She was also a national ballroom dancing champion. == Early life == Tirikatene-Sullivan’s father was a former Member of Parliament. When Tirikatene-Sullivan was young, she was cared for by her grandmother. Tirikatene-Sullivan had English and Ngati ancestry. Tirikatene-Sullivan started her education at Rangiora High School. She was considered a leader in Rangiora High School. She attended Wellington East Girls College. Tirikatene-Sullivan got her BA and a diploma at Victoria University in Wellington. She completed her thesis but was did not present it. Tirikatene-Sullivan got a Ph.D. in political science. Tirikatene-Sullivan was a ballroom dancing champion in New Zealand. She also was a legendary female fencer in the 1960s. Tirikatene-Sullivan was a titleholder for Ballroom dancing and American dancing. Tirikatene-Sullivan owned a boutique. Her boutique sold traditional Maori clothes and Polynesian inspired clothing. She was a role model for young people into fashion. When Tirikatene-Sullivan was 20, she was told that she had tuberculosis. The doctors thought that it was caused by exposure to too many people, a busy schedule, and stress. Tirikatene-Sullivan advocated for other patients while she was in the hospital. == Career == Working for her father as an unofficial assistant laid much of the foundation for Tirikatene-Sullivan's political career. She worked as secretary and research officer for the Labour Party's Maori Advisory Council and Maori Policy Committee for 10 years, accompanying her father to various official tribal hui events. In 1949, Tirikatene-Sullivan began working as a stenographer (a person trained to type or write in shorthand words) at the Royal New Zealand Air Force (RNZAF) Headquarters in Wellington. Shortly after, in 1951, the RNZAF Headquarters assigned her to be the secretary to the assistant director of a planned royal tour. Tirikatene-Sullivan traveled as a member of New Zealand's official party during Queen Elizabeth II's royal tour of the country in 1953 and 1954. Tirikatene-Sullivan was employed as a Maori welfare officer by the Department of Māori Affairs in 1958. She eventually also served as a child welfare officer in Rotorua and as a social security welfare officer in Lower Hutt and Wellington. She continued to volunteer for the Maori MPs as she had done, and studied part-time at Victoria University College. Tirikatene-Sullivan was named the Women’s Vice-President on the Executive of the Victoria University Students’ Association and and inaugural president of the Federation of Māori University Students in 1959. During her time in those positions, she advocated for the teaching of Maori studies in New Zealand universities. Tirikatene-Sullivan's studies ended abruptly in 1967 when her father died. == Personal life == She had a husband named Denis Sullivan who was a nuclear physicist. They both had three children named May- Ana (born in 1970), Lisa Marie (born in 1972), and Tirikatene (1974). Tirikatene-Sullivan’s second child, Lisa Marie, died three months after she was born. Tirikatene-Sullivan gave birth while holding her position in office and believed strongly in combining her career with good parenting. == References == Category:New Zealand politicians",
 "title": "Whetu Tirikatene-Sullivan"
}