{
 "id": "889348",
 "text": "Liebe Sokol Diamond (born January 10, 1931)\"Liebe Sokol Diamond, MSA SC 3520-14531\". msa.maryland.gov. Retrieved 2021-12-16. was an American pediatric orthopedic surgeon. Diamond was the first female resident at the Hospital of the University of Pennsylvania. She was the 14th woman certified by the American Board of Orthopedic Surgery. She was the president of the Maryland Orthopedic Society from 1971-1972. Diamond was the founder of the Ruth Jackson Society of Female Orthopedic Surgeons. She was also their first president. She was a part of the board of the Baltimore Hebrew University. Diamond was admitted to the Maryland Women's Hall of Fame in 2006. == Early life == Diamond was born in Baltimore, Maryland. Her birthday is January 10, 1931. Her parents were Max and Anne Sokol. Her father was a lawyer. Her mother was a Hebrew teacher at a college. When she was a child her parents helped a lot of Jewish people move to the United States. They helped Jewish people get away from Nazi Germany. Diamond was born with fewer fingers and toes than most people. She had ring constrictive syndrome. She was also born with club feet. She would not be able to walk. She lived at the hospital after she was born. She needed a lot of surgery. She had more than 20 surgeries before she turned 13. Her doctor, Dr. Moses Gelman, was a role model for Diamond. Diamon's body was different than most people's bodies. At that time, people believed that if your body looked differently then you mind could not work well. You could not be smart. Her family treated her equally to other people. She got a good education. She loved science. In 1947 she graduated from Western High School. She was 16 years old when she went to Smith College. She studied chemistry and also minored in physics and zoology. She graduated in 1951. Then she went to the University of Pennsylvania's Medical School. Diamond was the first female resident at the Hospital of the University of Pennsylvania. == Career == Diamond worked at Sinai Hospital after medical school in Baltimore. She had summer jobs there when she was younger. She did her internship and residency there. She worked as a pediatrician. Then she decided to become a surgeon. Dr. Gelman, who was still her friend, thought that orthopedics for children needed to get better. Diamond studied orthopedic surgery, or how surgery can help people's bodies be the right shape to help them move. She focused on pediatrics, or medicine for children. In 1955 she completed her degree in orthopedic surgery at University of Pennsylvania. Her own physical differences were not too hard. Being a woman made many people doubt her. She was the fourteenth woman ever certified by the American Board of Orthopedic Surgery. At that time, there were over 7,000 men certified by the same group. She opened a private practice. She became one of the top doctors in orthopedic surgery. Her specialty was children with hands and feet shaped differently than other people's. She liked helping children and their families. She liked it that every patient had different needs so her work was always new. She helped found the Pediatric Orthopedic society of North America. She was the only woman on the panel of eight people. Now, the society has over 400 members. She was the president of the Maryland Orthopedic Society from 1971-1972. Diamond was the founder of the Ruth Jackson Society of Female Orthopedic Surgeons. She was also their first president. She was a part of the board of the Baltimore Hebrew University. She retired from surgery in 1995. She retired from medical practice in 1997. Diamond was admitted to the Maryland Women's Hall of Fame in 2006. == Personal life == She married Dr. Earl L. Diamond. He was an epidemiologist and biostatistician. They had a son. The whole family practiced Judaism. She died in 2017. == References == Category:American physicians Category:1931 births Category:2017 deaths",
 "title": "Liebe Sokol Diamond"
}