{
 "id": "889314",
 "text": "Elizabeth E. Wein is an award winning American-British author. Wein, Elizabeth Bibliography Wein, Elizabeth. . Her most famous book is Code Name Verity. Code Name Verity is a New York Times Bestseller, a Michael Printz Award Honor Book, a Boston Globe/Horn Book Awards Honor Book, and an SCBWI Golden Kite Honor Book. == Early life == Wein was born in New York City in 1964. Wein's parents are Carol Flocken and Norman Wein. Her family moved to England when she was 3, because of her father's work. They lived near Alderley Edge. Wein went to school near Alderley Edge as well. They moved again to Jamaica when she was 6. However, after 3 years her parents separated. Wein, her siblings, and her mother moved to Harrisburg, Pennsylvania. Unfortunately, her mother was killed in a car accident when she was 14. After, Wein was raised by her grandparents. == Education == Wein graduated from Yale University in 1986. She holds a Bachelor of Arts in English from Yale. While at Yale, she attended a study abroad program in England. She went to graduate school at the University of Pennsylvania after graduating from Yale. She earned a PHD in folklore in 1994. Wein learned to fly airplanes at the Scottish Aero Club in 2003. \"Author: Elizabeth Wein\". Scottish Book Trust. Retrieved 2021-12-16. https://www.scottishbooktrust.com/authors/elizabeth-wein/She was 37.Baker, Deirdre F. \"An interview with Elizabeth Wein.\" The Horn Book Magazine, vol. 90, no. 3, May-June 2014, pp. 23+. https://link.gale.com/apps/doc/A369064342/SUIC?u=palo88030&sid;=bookmark- SUIC&xid;=78475aa3. Accessed 10 Dec. 2021. Many of her novels include people who fly airplanes. == Career == === Arthurian Novels === Wein wrote a series of novels that retell the King Arthur legend. These are The Winter Prince, A Coalition of Lions, The Sunbird, The Mark of Solomon: The Lion Hunter, and The Mark of Solomon: The Empty Kingdom. These were published between 1993 and 2008. === World War II Novels === Wein's biggest success was Code Name Verity, published in 2012. Code Name Verity is a story about two young female pilots. They worked for the Allies during WWII. They were caught by the Nazis. Wein also released three other novels that add to the story. === Awards === Wein has received many awards for her work. These include the Edgar Award for Best Novel. Code Name Verity is a New York Times Bestseller, a Michael Printz Award Honor Book, a Boston Globe/Horn Book Awards Honor Book, and an SCBWI Golden Kite Honor Book.\"Elizabeth Wein\". Worlds Without End. Retrieved 2021-12-16. https://www.worldswithoutend.com/author.asp?ID=2874 Her books have been shortlisted for the CLIP Carnegie Medal and the Andre Norton Nebula Award. == Personal life == Her husband is named Tim. She met him in Philadelphia. They were at a dance for people who ring bells for a hobby.Ingall, Marjorie (2012-05-11). \"The Pilot and the Spy\". The New York Times. ISSN 0362-4331. Retrieved 2022-01-30. They have two children. The family lives in Scotland. They lived in England briefly for a few years before that. Wein is an American and British citizen. == References == Category:Living people Category:1964 births Category:Writers from New York City Category:Yale University alumni",
 "title": "Elizabeth E. Wein"
}