{
 "id": "889345",
 "text": "Katherine Dunham (born June 22, 1909)\"Katherine Dunham Biography\" . kdcah.org. Retrieved 2022-02-03 was an American dancer, choreographer, and anthropologist. She is best known for bringing African and Caribbean dance styles to the US. Dunham also created the Dunham Technique. The Dunham Technique is still taught today. She created many all-black dance groups. She was awarded the Presidential Medal of the Arts, the Albert Schweitzer prize, Kennedy Center Honors and membership in the French Legion of Honor. == Early Life == Katherine Dunham was born on June 22, 1909, in Chicago. Her father Albert was a descendant of enslaved people taken from Madagascar and West Africa. Her mother, Fanny June, was French Canadian. She had an older brother named Albert Jr. Her mother died when Dunham was four years old. She and her brother went to go live with their aunt, Lulu. Her father married Annette Poindexter in 1915. Dunham and her brother returned to live with their father and stepmother. Dunham later went to the University of Chicago. == Dance == Katherine Dunham was best known for her work as a dancer. Her church ran out of money when she was eight years old. She performed a cabaret to raise money. Dunham was a student of Ludmilla Speranzeva. She later founded one of the first all-black ballet companies “Ballet Négre”. In 1933 she ran her first school, the Negro Dance Group. While performing with her company, she was found by dance teacher Ms. Alfred. Ms. Alfred saw her talent. She gave her the money to go to the Caribbean in 1935. When Dunham returned, she brought back the Afro-Caribbean style of dancing. She mixed the Afro-Caribbean style with European styles to make the Dunham Technique. People of all races found her work to be inspiring. Katherine Dunham worked with George Balanchine for the production of “Cabin in the Sky” in 1940. In 1944 she founded the “Dunham School”. There, she taught the Dunham Technique and anthropology to students. The “Dunham School” was later named the “Katherine Dunham School of Arts and Research.” She later creates a new dance group called “Katherine Dunham Dance Group”. They toured 57 different countries for 2 decades. In 1971 Dunham won the “Dance Division Heritage Award”. She continued to perform her ballets and teach. == Broadway, Movies, Books, and Shows == Katherine Dunham wrote many books. She began her writing career at 13. Her first story was “Come Back to Arizona”. It was published in W.E.B. Du Buois' magazine, The Brownies' Book. She later wrote magazines from the Caribbean. Dunahm also wrote “Kasanabce: A Fantasy”. She also choreographed for many shows. These shows included “Tropics”, “Le Jazz ‘Hot’”, “Cabin in the Sky”, “Windy city” and “Aida.” Her movies included “Mambo” and “Carnival of Rhythm.” Katherine Dunham also choreographed for Broadway. She choreographed for Pins and Needles. == Anthropology == Dunham was an Anthropologist. She began by going to a talk by Robert Redfield. She found it interesting. Her major was anthropology. Dunham then went to the Caribbean. She loved it there. When she returned, she changed her major to dance anthropology. Katherine Dunham then started a dance anthropology school called “Dunham School of Arts and Cultural Studies”. == Advocate for Justice == Katherine Dunham fought for what she thought was right. She refused to preform at segregated theaters. In 1992 she went on a hunger strike. She was fighting for Haitian immigrants. She went on hunger strike for 47 days when Hatian refugees to the United States were sent back to Haiti. In 1993 Katherine Dunham got a Haitian citizenship. == Death == Katherine Dunham died on May 12 2006 == References == Category:American dancers",
 "title": "Katherine Dunham"
}