{
 "id": "889333",
 "text": "Tanya Selene Saracho is a Mexican-American actress, playwright and screenwriter.\"HBO's 'Looking' Writer Tanya Saracho on Creating Latina Roles and Taking on Twitter Haters | Film | Remezcla\". web.archive.org. 2015-02-18. Retrieved 2021-12-16. She co-founded Teatro Luna, an all Latina theater company in Chicago, Illinois.\"theINTERVAL | Tanya Saracho\". web.archive.org. 2015-09-28. Retrieved 2021-12-16. She is the co-founder of the Untitled Latinx Program.Sperling, Nicole (2020-11-24). \"Latinos, Long Dismissed in Hollywood, Push to Make Voices Heard\". The New York Times. ISSN 0362-4331. Retrieved 2021-12-20. The Untitled Latinx Program tries to make television more diverse. Saracho has written many episodes for television programs. These include How To Get Away With Murder, Looking, Devious Maids, Girls, and Vida.\"Tanya Saracho\". IMDb. Retrieved 2021-12-16. Saracho is also a Spanish voice-over artist. == Early life == Saracho was born in Los Mochis, Mexico. She moved to Chicago, Illinois. == Career == She started out as a playwright. She wrote many plays. These plays include Lunaticas, Our Lady of the Underpass, and Kita y Fernanda. Saracho was named “Best new playwright” by Chicago Magazine. Her plays have been staged many places, including the Oregon Shakespeare Festival, NEXT Theater, Teatro Vists, Teatro Luna, and more. Saracho then started writing for television. Her first show was Devious Maids. Then she wrote for Looking and Girls. She also wrote episodes for How To Get Away With Murder. She created and produced Vida. Vida got a lot of positive recognition. Saracho found the Untitled Latinx Project Universal Studios hired her to find and share LatinX people in entertainment. === Awards === * “Best new playwright” by Chicago Magazine * \"TV Scribes to watch\" Variety (2018) * \"Pride month honoree\" LGBTQ California Legislative Caucus (2020) * \"Rising Star Award\" Outfest Legacy Awards * \"New Voice Award\" Final Draft * \"Outstanding Comedy Series\" GLAAD Media Award (for Vida) * \"2019 Impact Award\" National Hispanic Media Coalition (for Vida) * \"Audience Award\" SXSW Film Festival * \"Official Selection\" Tribeca Film Festival (2019) == References == Category:1970s births Category:Living people Category:American screenwriters Category:Mexican screenwriters Category:Writers from Chicago",
 "title": "Tanya Saracho"
}