{
 "id": "889331",
 "text": "Sana Amanat is an American comic book editor and the Director of Content and Character Development at Marvel.\"Be The Hero: Get to Know Sana Amanat's Story\". We Are Wakanda. Retrieved 2021-12-16. She is a Pakistani-American Muslim. She worked on comics like Captain Marvel, Hawkeye and Ms. Marvel. Ms. Marvel is the first Muslim-American superhero.\"Learn Sana Amanat's Name Now — The Future Of Marvel Might Just Be In Her Hands\". Bustle. Retrieved 2021-12-16. Amanat runs the annual Women of Marvel panel at Comic Con.Abad- Santos, Alex (2015-11-19). \"Meet Sana Amanat, the Shonda Rhimes of Marvel comics\". Vox. Retrieved 2021-12-16. She does work to make Marvel characters more diverse. She had a TED talk about diversity in comic books. == Early life == Amanat grew up in New Jersey. Her parents immigrated to the United States from Pakistan. She lived in the suburbs. There were not many other Muslim families in her town. She felt different from other people. The comic X-Men had lots of different kinds of people in it. Reading X-Men made her feel more normal. Amanat went to Barnard College. She studied political science. She wanted to be a journalist. The Barnard class of 2019 awarded Amanat the Barnard Medal of Distinction. == Career == Amanat worked at a magazine. Amanat started editing comic books in 2007. She edited comic books for a small, independent publishing company called Virgin Comics. Mackenzie Cadenhead was her mentor. Amanat joined Marvel in 2009. Amanat co-created the character of Ms. Marvel, the first Muslim-American Superhero. She worked with Steve Wacker, G. Willow Wilson, Adrian Alphona to create Ms. Marvel. The first volume has been printed seven times. That is a lot of times for one volume of comics. === Major editing credits === * Hawkeye * Ms. Marvel * Captain Marvel * Miles Morales === Character development === In 2015, Amanat became Marvel's Director of Content and Character Development. When she introduced President Barack Obama at a Women's History Month celebration in 2016, she noted that \"being different is being American.\" Amanat helps Marvel create more characters of different genders, races, religions, and other identities. She knows that most people who work in comics are white men. Most superheroes are also white men. Amanat wants to help everyone imagine more kinds of superheroes. She helped create the Women of Marvel platform. As a result of Amanat's work, there are about twenty female superheroes in the Marvel universe. She wants people from many backgrounds to work at Marvel. For example, she got Ta-Nehisi Coates to work with Marvel. He helped write the new Black Panther series. She was executive producer on Marvel Rising. === Awards and recognition === * Marie Claire’s New Guard of America’s 50 most influential women (2016) * Vogue’s American Women special (2018) * White House's Women's History Month celebration (2016), introduced President Obama. Obama called Sana a “real life super hero.” == Personal life == Amanat has been a Young Leaders Committee board member for Seeds of Peace. == References == Category:American comics writers Category:1982 births Category:Living people",
 "title": "Sana Amanat"
}