{
 "id": "889324",
 "text": "Eliza Burton (Lyda) Conley (1869-1946Kansas City Public Library. \"Eliza 'Lyda Burton CONLEY\". Missouri Valley Special Collections. KCHISTORY.ORG. Retrieved 2021-12-17. ) was the first female lawyer of Indian descent. She was the first Native American to argue in front of the Supreme Court. She was known as the \"Guardian of the Huron Cemetery.\" == Early Life == Lyda Conley was born in 1869. She was a member of the Wayandotte Tribe. She lived in Wyandotte County, Kansas. Her mother, Eliza Burton Zane Conley, was a member of the Wyandotte Tribe. Her mother was a descendant of Chief Andrew Conley. Her mother and her grandmother, Hannah Zane, were buried in the Huron cemetery. Her father, Andrew Serenes Conley, was from New York. He met and married Conley's mother in Ohio. They moved to Kansas with the Wyandotte Tribe. The Wyandotte Tribe was from Ohio. The US government forced the Wyandotte to give up their land in 1842. They were forced to move to Kansas. They were forced to a reservation on land bought from the Lenape peoples. The new Wyandot land was protected by treaty with the federal government. Eliza Burton Conley had three sisters. Two of her sisters were Helena (Lena) Gros Conley and Ida Conley. They helped her defend the graves of their family and ancestors at Huron Cemetery in Kansas City. == Career == Eliza Burton Conley graduated from the Kansas City School of Law in 1902. She went to law school because the government threatened to sell her tribe's cemetery. Conley was admitted into the Missouri Bar Association in 1902. and Kansas Bar Association in 1910. She became the first female lawyer of Indian descent. She was the first Native American to argue in front of the Supreme Court. She argued that the federal government had a duty to protect Native American burial sites. === Huron cemetery case === The United States government guaranteed the protection of the Wyandotte Tribe's Huron Cemetery in a treaty. The treaty was written in 1855. In 1890 the government broke the treaty. The government was going to sell the land to businesses. The government also wanted to remove the bodies from the cemetery. Congress approved the sale of the land in 1906. Conley asked the court to stop the government from selling the land. Conley and two of her sisters defended the Huron Cemetery from 1907 to 1910. They built a shack to live in. Her sister guarded the fort while Conley fought off intruders. Conley studied law books to prepare herself for cases while defending the cemetery. In 1910 the Supreme Court decided Congress could sell the land. The public was mad. They scared away anyone who wanted to buy the land. Conley and her sisters stopped the sale of the land. She kept fighting to save it until she died. It is now protected. The cemetery is on the National Register of Historic Places. == Death == Eliza Burton Conley died when she was 72, on May 28th, 1946. Her burial was on May 31, 1946. == References == Category:1869 births Category:1946 deaths Category:Lawyers from Kansas City, Missouri",
 "title": "Lyda Conley"
}