{
 "id": "889383",
 "text": "Nzingha Prescod (born August 14, 1992) is an American foil fencer. She is a two-time Olympian.\"Nzingha Prescod\". USA Fencing. Retrieved 2021-12-16. She is a consultant at a financial accounting services company in New York. She started Fencing in the Park.LeBlanc, Jacqueline. \"Nzingha Prescod Pushing to Make Fencing More Accessible\". Sports Illustrated. Retrieved 2021-12-20. Fencing in the Park teaches fencing to children. Prescod helps children experience fencing. She also helps them develop life skills through fencing. == Early Life == Prescod was born in Brooklyn, New York. She is the daughter of Homer Richardson and Marva Prescod. She has a sister named Tekeya. Tekeya is also a fencer. Prescod is named after Nzinga Mbande. Nzinga was a warrior queen in Angola. Prescod went to high school at Stuyvesant High School. She went to college at Columbia University. She has a Bachelor’s degree in Political Science. She focused on race and ethnicity. == Fencing Career == Prescod started fencing at 9 years old. She started at the Peter Westbrook Foundation. Westbrook is a six-time Olympian and U.S. champion. He has a reputation for training top-level athletes. The foundation teaches fencing and life skills to children. He wants to make fencing visible to people of color and poorer communities. Prescod, her sister, and her best friend got a scholarship to train there. She is right-handed. She had potential, perseverance, and would put in extra practice. She liked thinking about strategy. Prescod won her first Youth 10 national competition when she was 10 years old. She on the Under-17 Cadet World Championship wen she was fourteen. From 2009-2018, Prescod competed in the Senior Word Championships every year but 2012. She ranked in the top five when she was 15 years old. In 2015, Prescod won a Bronze medal. She was the first Black American woman to win an individual medal at that competition. Her team won Silver in 2017 and Gold in 2018. She also got a Silver individual medal and a Gold team medal at the 2011 Pan American Games. Prescod medaled many times in the Junior World Championships and the Cadet World Championships. She has more awards than almost any fencer in the United States. In 2013, Prescod won the Grand Prix title in Marseille, France. She was the first US female foil fencer to win Gold at that competition.Prescod, Ningha. INTERNATIONAL FENCING FEDERATION - The International Fencing Federation official website. Retrieved 2022-02-03. Prescod fenced in two Olympics, 2012 and 2016. She was 19 when she qualified for the first time. In 2008 she placed fifth and just missed being on the team. She was training for the 2020 Olympics. She hurt her hip and retired from fencing. She had hip replacement surgery in March 2020. === Activism === Prescod wants fencing to be more accessible so that more people can try it. She especially wants people of color to be able to try fencing. She started Fencing in the Park to help. On July 10, 2020, Prescod published \"An Open Letter to the USOPC & NGBS,\" a letter to national fencing associations talking about racist incidents that happened on a Zoom call hosted by USA Fencing. She argued that fencing organizations need to stand up to inequalities and treat Black athletes better.\"An Open Letter To The USOPC & NGBs\". (2020-07-10) Team USA. Retrieved 12/12/2021. == Personal life == Prescod enjoys reading and baking. She also likes shopping and swimming. Serena Williams is her idol. == References == Category:American fencers Category:1992 births Category:Living people",
 "title": "Nzingha Prescod"
}