{
 "id": "889351",
 "text": "Lauren Esposito is the world's only female scorpion expert.Schultz, K. \"World's only female scorpion expert on lookout for new species\". San Francisco Chronicle. Retrieved: Dec. 25, 2015 6:20 p.m. Fimrite, P. (2018, November 24). The Tribune (San Luis Obispo, CA), p. 7. Available from NewsBank: Access World News – Historical and Current. Retrieved 2021-12-10. She studies arachnology at the California Academy of Sciences.\"Lauren Esposito\". Sea and Learn. Retrieved 2021-12-10. She one of less than a dozen scorpion specialists in the world. She identifies new types of scorpions that have not been seen before. She teaches a field biology course at Columbia University. She has the nickname “The Scorpion Queen.” She is the co-founder of the network 500 Queer Scientists. Now, Esposito is also an arachnologist and assistant curator at the California Academy of Sciences.\"Science Heroes: Lauren Esposito\". California Academy of Sciences. Retrieved 2021-12-16. Esposito also pushed for more women to be included as biologists.\"Arachnologist Lauren Esposito Is On A Misson To Empower Queer Scientists\". Bustle Zoë Beery. Retrieved 2020-11-30 == Early Life == Lauren Esposito grew up in El Paso, Texas. Her parents were biologists. She enjoyed exploring the bugs in the dirt near her home. She also liked looking at bugs in the sand at her grandparents’ house in the Bahamas. She grew up fascinated by bugs and never lost that passion. She graduated from the University of Texas in 2003. While she was a student Esposito interned in arachnology at the American Museum of Natural History.\"Lauren Esposito\". American Museum of Natural History. She also volunteered doing research in the Chihuahuan Desert. She holds a Ph.D. in Ecology and Evolutionary Biology from the City University of New York. Her Ph.D. program was taught by the City University of New York and the American Museum of Natural History. == Career == Esposito co-founded Islands & Seas. Islands & Seas is a science and education nonprofit. It builds field stations where scientists, tourists, and locals can work together to conserve natural resources. The first field station was in a small fishing village, San Juanico, in Baja California Sur. The English name for the town is Scorpion Bay, the name of Esposito’s favorite animal. Esposito is now at the California Academy of Sciences. She studies scorpion taxonomy, or what different kinds of scorpions exist. She tests and compares different scorpion's DNA. She \"milks\" scorpion venom for study. She studies their behavior before they sting. She also studies using their venom to cure cancer. She travels and searches for news kinds of scorpions. Esposito and a postdoctoral fellow, Dr. Sarah Crews, have collected arachnids on nearly every island in the Caribbean, and completed a number of ecological and evolutionary research projects. New species comprise approximately 30 to 50% of the animals they collect there. She and Aaron Goodman have identified six species of scorpions that live in treetops.Randall, I. (2021, December 31). Enriching the tree of life: Five fiery sea stars, a blue-spotted guitarfish and a well- camouflaged pygmy pipehorse are among 70 new plant and animal species discovered in 2021. MailOnline (London, England). NewsBank: Access World News – Historical and Current. Retrieved 2022-02-04. == Advocacy == Esposito advocates for the importance of scientific research. She also wants science to be inclusive. She the co-founder of the network 500 Queer Scientists. 500 Queer Scientists is a website showing that LGBTQ+ people work in the sciences. == Reference == Category:Living people Category:American zoologists",
 "title": "Lauren Esposito"
}