{
 "id": "889367",
 "text": "Margaret Jessie Chung (or “Mom” Chung; Chinese: 張瑪珠; October 2, 1889 – January 5, 1959) was the first Chinese-American doctor that was a woman.\"Dr. Margaret \"Mom\" Chung (U.S. National Park Service)\". www.nps.gov. Retrieved 2021-12-17. She created the first Western Medicine clinic in San Francisco’s Chinatown. Chung was also recruited for a secret mission to enlist American pilots. They became known as the Flying Tigers. She created WAVES, a reserve force for women in the U.S Navy. Chung also worked in the Allied war effort. She used her fame to influence others to join. == Early Life == Margaret Chung was born in 1889, in Santa Barbara.Rasmussen, Cecilia (24 June 2001). \"Chinese American Was 'Mom' to 1,000 Servicemen\". Los Angeles Times. Retrieved 10 March 2017. Chung was the daughter of immigrants and the oldest of eleven children. She grew up in a 24,000 acre ranch located in Ventura County. Chung decided that she wanted to be a doctor at a young age. She needed money to go to school. Chung sold newspapers to make money. Her newspaper, the Los Angeles Times, gave her a scholarship to go to school. Chung was rejected from all hospitals (as a doctor) after she graduated from medical school. She was forced to take a spot at the Santa Fe Railroad Hospital as a surgical nurse. Chung worked at the Mary Thompson Women’s and Children’s Hospital in Chicago. She worked as a state resident at the State Hospital for Criminally Insane in Illinois. Chung moved back to Los Angeles and built a small practice for those that could not pay when she heard about her father’s death. == Chinatown & Beyond == Chung moved to San Francisco’s Chinatown and started the first Western Medicine clinic there. She continued to work in her L.A clinic. Chung conducted medical exams on seven Navy pilots at the beginning of the Great Depression. These pilots became the first of her “sons”. Chung slowly built out a network of connections. She was a patron of the arts and dined with the L.A Philharmonic. Sometimes, she would make home-cooked meals for them. She would also invite them to her house to provide late meals. Another group, the “Kiwis, were started by famous stars like Ronald Reagan and Robert Wang. The “Kiwis” could not fly. == World War II == Chung gifted all her “sons” a jade Buddha at the beginning of World War II. The “Golden Dolphins” were a group of submarine and naval officers. She also gave them special leather notebooks. Chung worked for the Allied war effort during World War II. She used her fame to influence others to join. Chung supported her “sons” on the front-line with gifts and letters. These gifts and letters connected them with each other. == War with Japan == Chung volunteered to work as a front-line doctor when the Japanese invaded China. She was rejected and given a secret mission. This mission was to recruit American pilots. They became known as the Flying Tigers because of the stripes on their planes. Chung lost some of her “sons” due to the series of wars. She still served home-cooked meals and regularly entertained her remaining “sons”. == WAVES == Chung also rallied for more women in the U.S military. She created WAVES. This stands for the Women Accepted for Volunteer Emergency Service. WAVES was established in 1942. It was a reserve corps for women in the U.S Navy. == Retirement == Chung retired and moved to Marin County after these wars. She died of cancer in 1959. She was 69 years old. == References == Category:1889 births Category:1959 deaths Category:American surgeons Category:LGBT people from California Category:Scientists from California",
 "title": "Margaret Chung"
}