{
 "id": "889338",
 "text": "Haben Girma (born in 1988) is an American lawyer, writer and disability rights advocate. She is deaf and blind.Appelbaum, Lauren (2019-03-05). \"Deafblind Lawyer Haben Girma Advocates for Disability Rights\". Respect Ability. Retrieved 2021-12-16. She uses the word \"deafblind\" to describe herself. Girma was the first person who is deafblind to graduate from law school in the United States. President Barack Obama recognized her as a 2013 White House Champion of Change. She was recognized by Forbes Magazine as a 2016 \"30 Under 30.\" In 2018, the American Foundation for the Blind awarded her the Helen Keller Achievement Award. Her work was recognized by both Justin Tredeau and Angela Merkel. == Early Life == Haben Girma was born in 1988 in California. Girma’s mother, Saba Gebreyesus, Came to the United States from Eritrea. Her father is Ethiopian. Girma also had a brother who was deafblind. She attended school in Oakland, California. When she was in elementary school, she communicated with a keyboard that was linked to a braille reader. The Oakland schools acknowledged disability rights and made sure she had the tools she needed to learn. Girma did not start advocating for ability rights until she attended college. She studied at Lewis and Clark College located in Portland, OR, USA. The menu in the cafeteria was only in print. The manager would not help her. She had to eat whatever someone put on her plate. This experience made her realize that she also had a right to make choices like other people do. She learned that the Americans with Disabilities Act required the cafeteria to give her a menu she could read. Girma earned her Juris Doctor degree from Harvard Law School. To help herself study and learn, Girma invented a new machine to make communicating easier. People can type into the machine and it gives her Braille to read. She speaks in response. == Career == Girma is a civil rights attorney. Much of her work focuses on fighting for equal access to educational opportunities. She wants strong schools for Black American children. She also argues that people with disabilities can contribute in the workplace and also buy useful products. They are productive members of the economy. She helped fight a legal case against Scribd, a digital library, for the National Federation for the Blind (NFB). NFB wanted Scribd to make their collection accessible to people who are blind. Scribd did not want to. The court ruled that Scribd had to make its work accessible. Girma often travels around the world to give speeches about experiences with disability. She wants to change people's opinions about ability. She thinks of her disability as “an opportunity for innovation”. Portrayals of disabled people in television and movies is also important to Girma. She gives talks to media organizations about opportunities to create realistic stories about people with different abilities. She also wants actors with disabilities cast in roles that do not specify that the character has a disability. She also published a memoir: Haben: The Deafblind Woman Who Conquered Harvard Law. == Personal life == Girma enjoys kayaking, skiing, river rafting, rock climbing, ice skating, and surfing.\"Disability Rights Activist Haben Girma to Deliver Closing General Session Keynote | Conference Content | Parks and Recreation Magazine | NRPA\". www.nrpa.org. Retrieved 2021-12-16. She appreciates curiosity. == References == Category:Living people Category:Disability activists Category:American lawyers Category:1988 births Category:American people with disabilities",
 "title": "Haben Girma"
}