{
 "id": "889308",
 "text": "Rebecca Hui is an American activist and the CEO of Roots Studio.\"Rebecca Hui\". Forbes. Retrieved 2021-12-20. Hui fights against cultural appropriation in fashion, or when fashion businesses stealing patterns and designs from other cultures. Many famous businesses believe her work is important. She is a Forbes 30 Under 30 member, Chanel Foundation recipient, Cartier Women's Initiative Laureate, and an Echoing Green Fellow.\"Rebecca Hui\". Cartier Women's Initiative. 2021-04-15. Retrieved 2021-12-16. Her work has also been written about in many magazines like Teen Vogue, VogueBusiness, and Business of Fashion. == Childhood == Rebecca Hui’s father was a professor.\"A Pattern Searcher from Cal: Rebecca Hui Connects Art, Cows, and Urban Development\". Blum Center. 2015-04-17. Retrieved 2021-12-16. His work caused their family to move to new places. They moved about nine times during Hui’s childhood around the areas Hong Kong, New Jersey, and Arizona. Because there was a lot of moving around, she gained the ability to be able to adapt quickly to fit in. She also believed that her skill to pick up tiny differences between different communities came from her childhood. == Following Cows in Gujarat, India == In her sophomore year at University of California, Berkeley, she was feeling bad about not attending art school. A friend helped her get an internship at an architecture company in Gujarat, India. Her boss encouraged her to study Indian culture so she followed cows. Hui was surprised to learn that cows are very important in India. She became interested in the relationship between humans and animals because of her roommate. Her roommate was a Jain. Jainism believes in being kind and respectful to animals. Because of her roommate's kindness towards animals, Hui felt the same. While following cows she noticed that the relationship between cows and humans were very different in different areas. In rural areas, cows are common and are important for milk and farms. In cities they are used for commercial activity and sometimes are harmed by humans. Hui believes that protection of animals can help public policy. She has also tried studying elephants and leopards. During this time, she discovered that buildings were considered more important than wildlife was. She started to believe that animals were very important to keeping ecosystems alive that humans depend on. == Roots Studio == Roots Studio is a New York based startup created by Rebecca Hui.(2021-09-30). \"Fashion carves out space for Indigenous artists\". Vogue Business. Retrieved 2021-12-16. It designs things influenced by Indigenous artists with two goals in mind. Their first goal is to give back the appreciation, credit and respect that the Indigenous artists deserve. Their second goal is to stop the cycle of cultural appropriation. Rebecca has been working with minority and Indigenous artists for the last ten years.\"With Roots Studio, Rebecca Hui Is Reimagining the Cultural Marketplace\". www.culturedmag.com. Retrieved 2021-12-20. She discovered that because of the lack of money and education, these artists were becoming laborers in cities. They could not make art. So Hui decided to create Roots Studio to form connections between communities and fashion to stop cultural loss and create more beauty in the world. == Toto Express == Hui is also working to found Toto Express. Toto Express is a design-licensing agency. Toto Express has projects where they look for artisans. In the Secret Life Project, Hui met many artists who were not able to make enough money because there was not enough marketing and connections. Hui wants a place where people can recognize the villagers' skills. She said she is dedicated to these projects because she “relates to these artists whose reasons for leaving their art spoke back to my reasons for pursuing a more respected career path within the often risk-adverse Chinese American community.” == References == Category:Living people",
 "title": "Rebecca Hui"
}