{
 "id": "889350",
 "text": "Davey Alba is a Filipino American technology reporter for The New York Times. She covers the topic of disinformation. She has won several awards, such as the Livingston and Mirror awards. She has worked for several well known companies, such as BuzzFeed News. She is a Filipino immigrant. == Early life == Alba moved to the US in 2010 from the Philippines. She comes from a family of high achievers. Her dad is in academia. Her mom is an economic consultant. Her sister is a vice president in an international investment bank. Her dad would read advanced, classic novels to her and her sister when she was eight years old. One of her favorites was The Hobbit, by J. R. R. Tolkien. She and her sister kept stopping their dad to ask what certain words meant. That’s when Alba’s fondness for literature began. == Education == Alba is a graduate of De La Salle University of Manila. She got a degree in communication. She also has a Master’s degree in science journalism from Columbia University.\"Davey Alba, M.A. Program Alumna, Wins 2019 Livingston and Mirror Awards\". apply.jrn.columbia.edu. Retrieved 2021-12-16. Alba believes the education she received in Manila contributed to her success. She is a self- confessed nerd. She had a 3.7 GPA. She was also on the Dean’s List throughout college. Alba says there were two professors who helped refine her writing. Their names were Glenn Omanio and Ronald Baytan. Omanio taught reporting. Bayton taught Philippine Poetry in English class. They were both professors at De La Salle University. Alba says they were both willing to share their time, knowledge, and encouragement. == Awards and achievements == Alba’s standout piece was on how President Rodrigo Duterte (Philippines) used Facebook to fuel his war on drugs. This piece won her the Livingston Award for excellence in international reporting. Livingston is known as the Pulitzer for journalists under 35. She also won the 2019 Mirror Awards for best story on journalism in dangerous situations. Alba was most recently hired by the New York Times to cover the subject of disinformation. == References == Category:Living people",
 "title": "Davey Alba"
}