{
 "id": "889335",
 "text": "Carina Curto is an American mathematician. She studies neuroscience and math. She explores how neurons in the human brain understand the world. She is a professor and co-Associate Head for Graduate Studies at the Department of Mathematics at Pennsylvania State University.Roberts, Siobhan (2018-06-19). \"Her Key to Modeling Brains: Ignore the Right Details\". Quanta Magazine. Retrieved 2021-12-16. The Alfred P. Sloan Foundation awarded Curto the Sloan Research Fellowship in 2011, an award that is given annually to the best scholars across the US and Canada.UNIVERSITY OF NEBRASKA-LINCOLN'S CURTO SELECTED FOR SLOAN RESEARCH FELLOWSHIP. (2011, Feb 16). US Fed News Service, Including US State News - from ProQuest == Early life and education == Curto was raised in Iowa City, IA.\"Iowa City West junior Carina Curto.\" (1995, March 30). The Gazette (Cedar Rapids-Iowa City), p. 6. Retrieved from NewsBank: Access World News – Historical and Current. Retrieved 2021-12-10. Her father was a mathematician. As a child, Curto though studying math was too ordinary. Her parents are from Argentina. She spoke Spanish at home. She graduated from Iowa City West High School. She loved to learn. Curto took many classes at University of Iowa while she was in high school. She was on the debate team. Curto was also a high-ranked tennis player for the state of Iowa.Palmer, L. (1996, April 18). Talented trio leads West. The Gazette (Cedar Rapids-Iowa City), p. 7. Retrieved from NewsBank: Access World News – Historical and Current. Retrieved 2021-12-10. Curto received a Bachelor of Arts degree from Harvard University in 2000. In high school she planned to study physics. She studied math and physics. Curto went to Duke University for graduate school. She planed to study string theory. Instead, she got interested in neuroscience. She earned her Ph.D in 2005. == Career == Curto studied mathematics in graduate school. She started studying the math for physics. Curto learned about neurology in her fourth year of graduate school. She became interested in neuroscience and switched her research. After earning her Ph.D., Curto spent three years as Rutgers University doing more research at the Center for Molecular and Behavioral Neuroscience. She was an instructor at New York University's Courant Institute of Mathematical Studies. She then joined the Math Department at the University of Nebraska-Lincoln. In 2014, Curto joined the Pennsylvania State University math faculty. She got tenure in 2019.PENN STATE ANNOUNCES 2020 UNIVERSITY-WIDE FACULTY AND STAFF AWARDS. (2020, Mar 27). US Fed News Service, Including US State News. Retrieved 2021-12-10. She uses math to improve neuroscience. She builds mathematical models for understanding how neurons work. Curto also finds new ways to use math to understand biology. As a part of her research, Curto created network songs based on firing rates of neurons, which showed the rhythmic activity of neurons. Curto's research has been funded by the National Science Foundation and the National Institutes of Health for the past 13 years. She is a 2021 Simons Fellow in Mathematics. She won the Faculty Scholar Medal from Penn State in 2020. In 2012 she earned a Woodrow Wilson Career Enhancement Fellowship for Junior Faculty. She also earned a 2011 Sloan Research Fellowship from the Alfred P. Sloan Foundation. == References == Category:Living people",
 "title": "Carina Curto"
}