{
 "id": "889311",
 "text": "Tao Chunxiao (born 1937) is one of the most important clarinet players in China.\"Chunxiao Tao\". vandoren.fr. Retrieved 2021-12-15.Zhu, Shuang (December 2017). \"A Chinese Clarinet Legend\" . The Clarinet. 45.1: 36–41.\"Young musician applauded by audience and scholars\". www.chinadaily.com.cn. Retrieved 2022-02-14. Tao has been central to developing clarinet playing in China. She was the first female clarinet player in China.Beijing Review. (1991). China: Beijing Review. She was also the first female clarinetist from China to win an award in an international competition.\"中国单簧管泰斗 —— 陶纯孝教授大师班(厦门站)即将来袭,厦门西洋乐器网社区\". www.fjabo.com. Retrieved 2022-02-14. She is a professor at the Central Conservatory of Music in Beijing, China. She used to perform the clarinet all over the world and became well known. She has been to many famous clarinet competitions and festivals. She is also a very successful clarinet teacher. Many of her students have become professors, won awards, or are important members of orchestras. == Early Life and Education == Tao Chunxiao was born in 1937 in Chongqing, China. The Military Band of the Chinese People's Liberation Army hired her.Zhu, Shuang. The Role of the Clarinet in China. Retrieved 2021-12-15 They assigned her the clarinet. She went to the Southwest Conservatory of Music in 1953 (now called the Sichuan Conservatory of Music).\"陶纯孝 简历 - 名人简历\". m.gerenjianli.com. Retrieved 2022-02-14.\"陶纯孝\". (1993). 新中国留学归国学人大词典. China: 湖北教育出版社. p.528. Retrieved 2022-02-13. In 1956 Tao moved to the Czech Republic to study at the Prague Conservatory of Music. She graduated in 1961. She returned to China after graduation. == Career == Tao won the third place in the Seventh World Youth Festival Wind Music Competition in 1959. This award made her the first Chinese woman to win an international clarinet prize. === Jobs === Tao is a professor at the Central Conservatory of Music in Beijing, China. The Ministry of Education awarded Tao the \"Baosteel Excellent Teacher Award\" in 2002. She has held many jobs that promote music in China. She was the Director of the Orchestral Instruments Department at Central Conservatory of Music, the President of the Chinese Clarinet Association, a Member of the Committee on Arts Education at Ministry of Education of China, and the Director of the Education and Technology Department at Ministry of Culture of China. Tao helps check the quality of the orchestra for the Chinese National Opera House each year.\"中央歌剧院交响乐团年度考核连日举行_中央歌剧院\". www.chinaopera.com.cn. Retrieved 2022-02-14. === Judging === Tao judges competitions in China and internationally. She was a judge for the 36th International Clarinet Competition in 1987 in Munich, Germany. She was also the clarinet judge 43rd Czech \"Prague Spring\" International Music Competition. She was the chair of the organizing committee and judges for the \"98th International Clarinet Music Festival.\" In China, she was chair of the judges for the first and second \"National Youth Clarinet Playing Competitions.\" === Major publications === Tao edited \"Clarinet Playing Course\", \"Classic Clarinet Songs\", \"Learn Clarinet with Me\", \"Clarinet Playing and Teaching\", \"European Music Art History\". She co-authored \"Introduction to the Physics of Music\". In 2003 she published a book entitled: Clarinet Fundamentals Tutorial. She also has many recordings. === Famous students === She taught influential clarinetist who have won awards, become professors, and performed with orchestras worldwide. She taught Ma Yue, Yuan Yuanis, Huang Yuanfu, Yin Bo, Fan Lei, and Yuan Yuan.\"Yuan Yuanis\". www.buffet-crampon.com. Retrieved 2022-02-14.\"Yin Bo\" . Backun Global. Retrieved 2022-02-14.\"FAN Lei\" . Página web de zhongxiqiao. Retrieved 2022-02-14. In 2017, the International Clarinet Association published a special article called \"A Chinese Clarinet Legend,\" to recognize Tao's contribution to the development of clarinet in China and worldwide. == References == Category:Living people",
 "title": "Tao Chunxiao"
}