{
 "id": "889381",
 "text": "Schuyler Bailar is Korean American and the first openly transgender swimmer in NCAA Division I History.Mineo, Liz (May 15, 2019). \"NCAA's first openly transgender swimmer Schuyler Bailar finds his real self and flourishes at Harvard\". Harvard Gazette. Retrieved February 28, 2022. Bailar and Katie Ledecky set the U.S. record for the high school women's 400 yard relay. Harvard women’s swimming and diving coach asked Bailar to study and swim at Harvard University. Bailar decided to swim on the men’s team. He graduated from Harvard in May, 2019. == Early life == Bailar was born in Virginia, USA. He started swimming by himself when he was one year old He joined a summer swim team when he was four. === Elementary and Middle === Bailar was called a tomboy. He acted and dressed like a boy. He challenged his male classmates in fifth grade to arm wrestling. He won against all but one of the boys.Merrill, Emma (2015-06-17). \"Schuyler Bailar To Be First Openly Transgender D1 NCAA Swimmer\". Swimming World News. Retrieved 2021-12-16. === High school === Bailar attended Georgetown Day School in Washington, D.C. He had a lot of pressure in high school to look feminine and a girl. Bailar did not feel comfortable presenting himself as a girl. He was bullied throughout the entirety of high school for his difference between him and the other girls. He graduated in 2014. He made the physical gender transition from female to male in a gap year between high school and college. Bailar gave up his high rank as a female swimmer. He chose to be true to himself. Bailar’s Korean identity is important to him. Telling some family members that he is transgender was scary. But his family supported him. === College === Bailar was recruited by Harvard University. He was recruited for the women's team. Both the women's coach and the men's coach supported Bailar's transition. They let him pick which Harvard swim team to join. Bailar swam on the men's team. Bailar studied psychology and cognitive neuroscience at Harvard. He graduated on May 30, 2019. At graduation he won the Harvard Director’s Award, given only when a student who is an athlete does something very important. He was the seventh person to ever receive this award. After graduating, Bailar went on a speaking tour to fifteen states. Bailar now works at a financial services company in Seattle, WA. He teaches the employees interpersonal skills. == Swimming == Bailar started swimming in competitive meets at age seven. First, he swam with the Sea Devil Swimming team. A few years later he competed in the Junior Olympics. Bailar qualified for his first national meet when he was 13. During freshman year of high school Bailar joined the Nation’s Capital Swim Club. He ranked in the top 20 breastrokers in the U.S. in the age group of 15. He had the first back to back All American finishes in the 100-yard breaststroke in 2012. Bailar qualified for his first national meet when he was 13. He qualified for the U.S. Open Swimming Championships in 2013. He qualified for the U.S. Open swimming championships (the top U.S. meet when it is not an Olympics year) that year. He was part of a relay team that set the National Age Group Record in the women’s 400 yard medley relay. Bailar’s relay team, consisting of Janet Hu (NCAA Champion), Kylie Jordan (NCAA Qualifier), Katie Ledecky (Gold Medalist Olympian) and himself. They set a U.S. national record for the 400 yard medley relay. They were all aged 15-18. \"Harvard Graduate and Transgender Swimmer Schuyler Bailar Looks to the Future\". Univeristy Atheletic Association. Retrieved 2021-12-16. == References == Category:American swimmers Category:Transgender men Category:1996 births Category:Living people",
 "title": "Schuyler Bailar"
}