{
 "id": "889823",
 "text": "The Uttarakhand Fire and Emergency Services is the public service department of the Government of Uttarakhand whose function is to fire fighting and emergency serices in Uttarakhand. It is responsible for the provision of fire protection and life safety as well as responding to building collapses, drownings, gas leakage, oil spillage, road and rail accidents, bird and animal rescues, fallen trees and taking appropriate action during natural disasters. The department has now 46 Fire stations consisting of nearly 1400 executive personnel and nearly 98 ministerial staff. The Headquarters the department is situated at Dehradun. == History == Uttarakhand Fire department came into existence with the formation of Uttarakhand state i.e. on 9 November 2000. Earlier it has 22 fire stations. Today, Uttarakhand Fire and Emergency service has 34 fire station and 12 fire units including 4 fire stations and 1 fire unit dedicated to industrial area. == Organization structure == The head of the Department is the Director General (D.G.) who is the rank of the D.G.P., I.P.S. rank and under him there is a Inspector General who is the rank of the I.G., I.P.S. and Deputy Inspector General who is the rank of the D.I.G., I.P.S. and at the Headquarters, and a Deputy Director (Technical) at the Uttarakhand Fire and Emergency Services Headquarters, Dehradun. There are 13 districts, located in Almora, Bageshwar, Chamoli, Champawat, Dehradun, Haridwar, Nainital, Pauri Garhwal, Rudraprayag, Tehri Garhwal, Udham Singh Nagar and Uttarkashi where Chief Fire Officers are in charge. Each district has a Chief Fire Office and under each Chief Fire Officer there are Fire Stations where a Station Officer as the station in charge. At each station, in addition to Fire Station Officer there are Fire Station Second Officer, Leading Firemen, Fire Service Driver, and Firemen. == Hierarchy == Officers * Director General of Police (DGP) (IPS) * Inspector General of Police (IG) (IPS) - Fire and Emergency Services * Deputy Inspector General of Police (DIG) (IPS) - Fire and Emergency Services * Deputy Director Technical - Fire and Emergency Services Sub-ordinates * Fire Station Officer (FSO) * Fire Station Second Officer (FSSO) * Leading Fireman (LFM) and Fire Service Driver (FsDVR) * Fireman (FM) == Mission == * To protect people’s life & property from fire and other accidents. * To protect our community from all possible hazards by providing progressive high quality emergency services and preventive measures. * To carry out effective and timely fire fighting, rescue and life saving operations and Disaster Management activities and thereby ensure maximum performance and render remarkable service to the public. * Develop well organized and trained Fire & Rescue Services so that human resources of the department measure up to multiple challenges of a Fire & Rescue Service. == Vision == * Dedicated and best community focused Fire & Rescue Services ensuring a safe and secure environment for all. * To honor the trust of the society by demonstrating commitment to deliver professional Fire Fighting & Rescue Services activities with compassion, respect and utmost courtesy. * To ensure community safety by creating basic awareness regarding fire safety, life safety and Disaster Management among the people and thereby mitigate the fire loss and improve effective and timely rescue and life saving activities. * Minimize the response time in urban and rural areas by increasing the number of Fire & Rescue Stations and mobility profile of the Department. == Services == * 24 hour emergency support * Consultation in case of fire and life safety * Fire safety Certificate * Public awareness program/Mock drills * Fire safety to all sensitive places of state * Fire safety in all VIP/VVIP program * Training programs * Disaster search, rescue and relief work == References == *Official website - Uttarakhand Fire and Emergency Services Category:Organizations based in Uttarakhand",
 "title": "Uttarakhand Fire and Emergency Services"
}