{
 "id": "889862",
 "text": "The Gila topminnow or charalito (Poeciliopsis occidentalis) is a fish in the family Poeciliidae. It lives in North America and Mexico. ==Home== This fish lives in the southern United States and northern Mexico. It lives as far south as the Gila River. ==Threats== The mosquitofish killed so many Gila topminnows that the Gila topminnow became endangered. People put it on the Endangered Species List in 1973. Since then, human beings brought the fish to many new places where it could live. This fish is still in some danger because human beings change the places where it lives, because invasive species kill it or eat all the food, and because human beings have changed the water table. When human beings take water from wells for farming and other things, the water sinks lower down in the earth. This can make streams and ponds dry up. Because this fish now lives in so many places, it is officially not endangered any more. However, scientists are still studying it. ==Size== This fish looks like a guppy, but it has no spots on its fins. It is about 2.5 to 5 cm in size. Male fish are black with yellow fins. This fish lives about 1 year. ==Subspecies== There are two subspecies: *The Gila topminnow (P. occidentalis occidentalis), which lives in the Gila River basin. *The Yaqui topminnow (P. occidentalis sonoriensis), which lives in the Rio Yaqui. ==Food== This fish eats many different kinds of things: dead things, plants, insect larvae, and crustaceans. Sometimes they eat their own babies. ==Young== Topminnows keep their eggs inside their bodies until they hatch. There are 1-20 eggs in each brood. Sometimes the mother fish carries two broods at a time. The eggs take 24-28 days to hatch. Young fish hide from the adults so the adults won't eat them. ==Threats== It is endangered because people brought other fish to the places where it lives. The mosquitofish is the most important of these animals. It is also endangered because human beings take water out of their streams and ponds. ==References== Category:Freshwater fish Category:Animals of North America Category:Cyprinodontiformes",
 "title": "Gila topminnow"
}