{
 "id": "889902",
 "text": "Roger Arliner Young (August 20, 1899-November 9, 1964) was a zoologist, biologist, and marine biologist.\"About | RAY Diversity Fellowship\". rayfellowship.org. Retrieved 2022-01-30. She was the first Black American woman to get a Ph.D. in zoology.Lee, DN \"Roger Arliner Young, Zoologist\" The Urban Scientist, Scientific American blog. 2012-14-2 Retrieved 2021-12-15 She is best known for her groundbreaking research in fertilization and her revolutionary article published in Science in 1924, “On the Excretory Apparatus in Paramecium.”\"Roger A. Young, Zoologist born\". African American Registry. Retrieved 2021-12-19. She was the first Black woman to publish in Science magazine or any other biology publication. She was the first Black woman to do research at Woods Hole, in Massachusetts. In fact, in 2005, a Congressional Resolution said she had “broken through many barriers to achieve greatness in science.\"Felder, D. G. (2020). \"Roger Arliner Young (1889-1964): Biologist, Zoologist.\" The American Women's Almanac: 500 Years of Making History. United States: Visible Ink Press. Via Google Books. She also was a co-founder of the Omega Psi Phi fraternity. == Early life and education == Young was born in Clifton Forge, Virginia. She grew up in Burgettstown, Pennsylvania. Young had to take care of her mother. Her mother could not work. Young also had health problems. Young attended Howard University. She began when she was twenty-seven years old. She planned to study music.\"Roger Arliner Young (1889-1964)\". 2007-03-07. BlackPast. Retrieved 2022-01-30. In 1921, she met Ernest Everett Just. She took a biology class from him. He became her mentor. She decided to study zoology. It took Young from 1916-1923 to complete college. Young started studying for her Ph.D. at the University of Chicago in 1924. The same year, she published her article in Science magazine. She completed her Master's degree. Her advisor was Frank Lillie. She was invited to join Sigma Xi, an honors research society, a group that honors good work in science.Roo News (2018-02-01). \"Celebrating Women in STEM: Dr. Roger Arliner Young\" . info.umkc.edu. Retrieved 2022-01-30. Usually, Sigma Xi did not offer membership to people with only Master's degrees. She did not pass her exams for her doctoral degree. In January of 1930 she left the university. She felt embarrassed and did not continue trying. In 1937, she began studying under L. V. Heilbrunn at the University of Pennsylvania. In 1940, she finally completed her Ph.D. == Research == Young's research focused on ocean life. Usually she focused on reproduction. She studied how radiation affected sea urchin eggs. She researched salt and water in paramecia. She studied fertilization in paramecia. == Career == Young worked in Just's lab at the Marine Biological Laboratory in Woods Hole, Massachusetts in the summer of 1926. She taught as head of the Howard University zoology department when Just worked on research in Europe. After Young left the University of Chicago, she still did research at Woods Hole. She taught at Howard University until 1937. Between 1935 and 1938, Young published four articles. Young became an assistant professor at the North Carolina College for Negroes in Raleigh after she got her Ph.D. She was the head of the Biology department at Shaw University. She then taught for a while in Texas and at Jackson State College in Mississippi. In 1962 she taught at Southern University. == Personal life == Young suffered from mental health problems her whole life. That is why she changed jobs a lot. She died in New Orleans on November 9, 1964. == References == Category:1899 births Category:1964 deaths Category:American zoologists Category:African-American scientist Category:Marine biologists",
 "title": "Roger A. Young"
}