{
 "id": "89007",
 "text": "Mu can be: *Mu, Μ or μ, a letter in the Greek alphabet. μ is used as a symbol for: **The SI prefix micro, meaning a factor of 10-6 (one millionth). ***μ by itself is often used as the \"unit\" of strain, though in this context it retains its SI prefix meaning, which is interchangeable with \"x 10-6\" or \"ppm\" (parts per million). ***μ by itself is an abbreviation for the unit micron. Both the term and the abbreviation should not be used. The preferred terms are µm and micrometre **In mathematics, ***The arithmetic mean of a statistical population ***The Möbius function ***The least-fixed-point-operator ***A degree of membership from a fuzzy set. **In chemistry, ***The chemical potential **In physics, ***The coefficient of friction ***The mobility coefficient ***The permeability (electromagnetism) coefficient ***The muon, an elementary particle ***The standard gravitational parameter ***The magnetic dipole moment ***The linear density ***Viscosity ***Reduced mass **µTorrent, a freeware BitTorrent client for Microsoft Windows written in C++. **μZiq, An alias of Mike Paradinas. In Asian languages: *Mù, (穆), a Chinese surname *Mu (unit of area) (亩/畝), a Chinese unit of area *Mu (kana), represented by the Japanese kana む or ム *Mu (negative) (無), a Japanese word important in Zen koan practice Mu may also refer to: *Muonium's atomic symbol *Mu-metal, an alloy used for screening magnetic fields *Mu (lost continent), a mythical continent in the Pacific Ocean subsequently appearing in several books, films, and games *Mu (rocket), a Japanese rocket *Mu Dan, Chinese poet and translator *Mu Online, an online role-playing game *Mu La Flaga, a character from the anime Mobile Suit Gundam SEED *Aries Mu, a character from the cartoon Saint Seiya *Groupe Mu, an interdisciplinary Belgian group focusing on linguistics and rhetoric *Lemuria, a hypothetical lost continent MU may stand for: *Mauritius' ISO 3166-1 alpha-2 country code *China Eastern Airlines's IATA code *Manchester United Football club *The Mothers' Union, global Anglican women's organisation *Monitor unit, a unit used in radiation therapy *Centimorgan or \"map unit\", a unit of recombinant frequency in genetics *Multiple unit, such as a rail diesel car *MU puzzle, a puzzle in Gödel, Escher, Bach *University of Mumbai, formerly called the University of Bombay *Marquette University *Marshall University *Miami University, a public university in Oxford, Ohio *Millersville University of Pennsylvania *Miskatonic University *University of Missouri, a public university in Columbia, Missouri *Mahidol University, a University in Thailand *Manipal University, a university in Karnataka, India *MU (70's band), an early 1970s psychedelic group led by Merrell Fankhauser and Jeff Cotton *MU (00's band), a 00's electro-punk group made up of producer Maurice Fulton and his wife Mutsumi Kanamori. *Mirror Universe (Star Trek), fictional parallel universe in which the plots of several Star Trek television episodes take place *Magic-User, a class type in D&D;, HackMaster, and many fantasy RPGs * Musician, an enlisted rating in the United States Navy * Isuzu MU Wizard * Micron Technology",
 "title": "Mu"
}