{
 "id": "890275",
 "text": "During the afternoon and evening of Wednesday, December 15, 2021, a low pressure system brought strong, violent winds (both thunderstorm-involved and non-thunderstorm). Non-thunderstorm winds and gusts led to rapidly moving fires across Colorado and western Kansas. Dust and debris spread eastward from there. A powerful derecho (intense and very dangerous showers and thunderstorms having straight line winds and often varying levels of rain) led to several hundred damaging wind reports. That started from central Kansas northeast to east-central Wisconsin. The United States' National Weather Service got fifty-five hurricane force wind reports. The derecho was considered the most prolific (meaning productive) such event dating back to 2004, although a derecho five months later would become even more prolific.May 12th, 2022, Significant Severe Event - Midwest Derecho, National Weather Service Grand Forks, ND ==Weather synopsis== On December 15, the Storm Prediction Center (SPC) warned of the potential (possibility) of severe, widespread and intense wind events from the eastern Great Plains to the western Great Lakes region. Along with strong winds, dry lines and a very strong cold front were forecast to be supported with a strong low pressure area southward into northeastern Missouri. Right ahead of these components, out-of-season air masses were predicted to take shape across several states. In Iowa, Minnesota and Wisconsin, temperatures were from between 30°F and 45°F higher than December averages. Dew points reached into the lower 60s Fahrenheit. Given these ingredients, along with a weakening cap inversion, forecasters called for severe thunderstorms to get started and become widespread over the Upper Mississippi and Mid-Missouri valleys. Strong, damaging winds were the most predicted threat. Tornadoes, though, were also possible. One to two EF2 and greater were not ruled out. ==Severe weather probability and notices== On Monday, December 13 just before 2:30 am Central Standard Time (0830 UTC), forecasters stated a level 1/5 marginal risk for severe weather between 60 and 78 hours from there. The original severe likelihood was focused on areas from eastern Nebraska, across Iowa and south central Minnesota. Two days following that, just before midnight on December 14 (0600 UTC December 15), the level was upgraded towards moderate in north central and western Iowa. The same level of probability extended into southeastern Minnesota and west-central Wisconsin near La Crosse, Winona and nearby Rochester. Slight or enhanced chances involved other areas of the same states. Included in the slight or enhanced risk area were Eau Claire, the Minneapolis–Saint Paul Metropolitan Area and the Cedar Rapids–Iowa City metropolitan regions of eastern Iowa. That was the first moderate risk ever called across Iowa, Wisconsin and Minnesota in December of any year. The first tornado watch for December 15 was called into effect at 1:20 pm CST (1920 UTC). The watch involved sections of eastern Nebraska, northeastern Kansas, northwestern Missouri, large sections of Iowa and south-central Minnesota. That was right after a quick-traveling thunderstorm line got into progress. ==Wind storm and derecho events== Along with the severe thunderstorms' damaging winds, the similar unrelated winds also became widespread that day. Many National Weather Service offices had almost 84 million people in the high wind warning notice alone. The intensity and scope with the dry wind led to very dangerous fire weather situations across the Central Plains. Within that region, SPC officials outlined an important critical region from the Texas Panhandle to central Kansas. Extreme regions also included eastern Colorado and northeastern New Mexico. In Colorado, particularly across the central and eastern sections of the state, an Air Quality alert was activated in anticipation of the combined air and dust over the area. There were rolling road closures across Interstates 25 and 70. On the earlier, six tractor trailers (semi trucks) turned over or flipped in strong winds in Colorado Springs. In Pueblo city bus services were suspended for more than three hours. Some trees in the area were damaged. Roofs were ripped from homes. Fences and lots of vehicles were blown over during the winds. Power lines were downed all over the area. In advance of the dangerous weather, several school and education districts in southwestern Kansas had to close classes. Strong, powerful winds stirred dust all over Kansas. State Departments of Transportation closed several highways. In particular, Interstate 70 from the Colorado-Kansas state border east to Salina for crashes blocking the road. Two separate crashes from poor visibility led to the deaths of three people in the state. In nearby Nebraska, winds of just below 85 mph were reported at Grand Island. There, several rail cars were blown over. Local authorities were notified of blown out vehicles' windows, felled trees, downed power lines and flipped over semi-trucks. Across Iowa, similarly violent winds happened. Hurricane-force wind gusts took place. Near Audubon, winds gusted to 88 mph. One man was killed when a gust blew down his semi-tractor-trailer. In Minnesota just north, another man was killed when a tree landed onto him. ==Tornado event== Almost eight dozen tornadoes were caused related to the storm. One in particular was later established for the first tornado in Minnesota in December. According to the National Weather Service, there were twenty tornadoes in that state. ==References== Category:Tornadoes in the United States Category:Natural disasters in North America Category:History of Wisconsin Category:2020s in Minnesota Category:2020s in Iowa Category:2020s in Colorado Category:Derechos Category:December 2021 events Category:2021 in weather Category:2021 in Texas Category:2020s in Oklahoma Category:2020s in Nebraska Category:2020s in Missouri Category:2020s in Illinois",
 "title": "December 2021 North American storm complex and derecho"
}