{
 "id": "890210",
 "text": "Hollow Knight is a 2017 Metroidvania action-adventure game developed and published by Team Cherry. It was released on Microsoft Windows, macOS, and Linux in 2017, and on the Nintendo Switch, PlayStation 4, and Xbox One in 2018. Development was partially funded through a Kickstarter crowdfunding campaign, raising over 57,000 by the end of 2014. The player is the Knight, a nameless warrior not knowing who they are or where they came from, who wanders and explores the ruined kingdom of Hallownest to figure out its mysteries, finds many friendly or enemy bugs, fighting bosses, and unlocking new powers and abilities to progress. Hollow Knight was well received by critics and has sold over 3 million copies as of December 2020. A sequel, Hollow Knight: Silksong, is in development. == Gameplay == Hollow Knight is a 2D Metroidvania action-adventure game, that takes place in Hallownest, a fictional ancient kingdom. The player controls an insect-like, silent, and nameless character while exploring the underground world. The knight wields a \"nail\", which represents various blades in the story (excluding pins and needles), used both in combat and environmental interaction. In most areas of the game, players encounter enemy bugs and other creatures. Melee combat involves using the nail to hit enemies from a short distance. The player can learn spells, which give the knight more range. Defeated enemies drop currency called Geo. The knight starts with 5 masks, which represent the hit points of the character. \"Mask shards\" can be collected throughout the game to increase the player's maximum health. When the knight takes damage from an enemy or from the environment, a mask is reduced. By striking enemies, the knight gains Soul, which is stored in the Soul Vessel. If all masks are lost, the knight dies and a Shade appears where they died. The player loses all Geo and can hold a reduced amount of Soul. Players need to defeat the Shade to recover the lost currency and to carry the normal amount of Soul. The game continues from the last visited bench they sat on which are scattered throughout the game world and act as save points. Initially the player can only use Soul to \"Focus\" and regenerate masks, but as the game progresses players unlock several offensive spells, which consume Soul. Many areas feature more challenging enemies and bosses which the player may need to defeat in order to progress further. Defeating some bosses grants the player new abilities. Later in the game, players acquire a \"dream nail\", a special blade that can \"cut through the veil between dreams and waking\". It enables the player to face more challenging versions of a few bosses, and to break what is sealing the path to the final boss. If the player defeats the final boss of the game, called \"The Hollow Knight\", they are given access to a mode called \"Steel Soul\". In this mode, dying is permanent, and if the knight loses all of their masks, the save slot will be reset. During the game, the player encounters non-player characters (NPCs) with whom they can interact. These characters give information about the game's plot or lore, sometimes help, and sell items or services. The player can upgrade the knight's nail to deal more damage or find Soul Vessels to carry more Soul. During the game, players acquire items that give new movement abilities which are an additional mid-air jump (Monarch Wings), sticking to walls and jumping off them (Mantis Claw), a brief dash (Mothwing Cloak), and an acid resistance buff (Isma's Tear). The player can learn other combat abilities, such as nail arts, and the spells. To further customize the knight, players can use different Charms, which can be found or bought from NPCs. Some of their effects include better combat abilities or skills, more masks or their regeneration, better movement skills, easier collecting of Geo or of Soul, and transformation. Equipping a Charm takes up a certain number of limited slots, called notches. Wearing a Charm that requires more than the available number of notches is possible, but it results in being \"overcharmed\", causing the knight to take double damage. Hallownest consists of several large, connected areas with unique themes. With its nonlinear gameplay design, Hollow Knight does not force the player to one path through the game nor make them explore the whole game, though there are obstacles that stop the player's access to an area. The player may need to progress in the story of the game, or get a specific movement ability, skill, or item to progress further. To fast travel through the game's world, the player can use Stag Stations, terminals of a network of tunnels; players can only travel to previously visited and unlocked stations. Other fast travel methods, such as trams, lifts, and the \"Dreamgate\", are encountered later in the game. As the player enters a new area, they do not have access to the map of the area. They must find Cornifer, the cartographer, in order to buy a rough map. As the player explores an area, the map becomes more accurate and complete, although it is updated only when sitting on a bench. The player will need to buy specific items to complete maps, to see points of interest, and to place markers. The knight's position on the map can only be seen if the player is carrying the Wayward Compass Charm. == Development == The idea that made the creators want to create Hollow Knight started in a game jam, Ludum Dare 2013, in which two of the game's developers, Ari Gibson and William Pellen, made a game called Hungry Knight, in which the character that would later become the Knight kills bugs to stave off starvation. The game, thought to be \"not very good\", used to hold a 1/5 star rating on Newgrounds but has since increased to 4/5. The developers decided to work on another game jam with the theme \"Beneath the Surface\", but could not complete on time. However, this gave them the idea to create a game with an underground setting, a \"deep, old kingdom\", and insects. Influences for the game include Faxanadu, Metroid, Zelda II, and Mega Man X. Team Cherry noted that Hallownest was in some ways the inverse of the world tree setting in Faxanadu. The team also said that they wanted to create the sense of wonder and discovery of games from their childhood from such games, in which \"there could be any crazy secret or weird creature.\" Believing that control of the character was most important for the player's enjoyment of the game, the developers based the Knight's movement on Mega Man X. They gave the character no acceleration or deceleration when moving horizontally, as well as a large amount of aerial control and the ability to interrupt one's jump with a dash. This was meant to make the player feel that any hit they took could have been avoided right up until the last moment. To create the game's art, Gibson's hand-drawn sketches were scanned directly into the game engine, creating a \"vivid sense of place\". The developers decided to \"keep it simple\" in order to stop the development time from becoming very long. The complexity of the world was based on Metroid, which allows players to become lost, focusing on the enjoyment of finding one's way. Only basic signs are placed throughout the world to direct players to important locations. The biggest design challenge for the game was creating the mapping system and finding a balance between not divulging the world's secrets while not being too player-unfriendly. Hollow Knight was revealed on Kickstarter in November 2014, the developers needing 35,000. The game passed this goal, raising more than 57,000 from 2,158 backers, allowing more content to be added and another developer to be hired—technical director David Kazi—as well as composer Christopher Larkin. The game reached a beta state in September 2015 and continued to achieve many unreasonable goals to add in more content after an engine switch from Stencyl to Unity. Some of the goal content, such as The Abyss, still made it into the game even though those goals not having been achieved, although with a lot of content was cut. === Release === The Nintendo Switch version of Hollow Knight was announced in January 2017 and released on 12 June 2018. Team Cherry originally planned to make their game available on the Wii U. Development of the Wii U version began in 2016, alongside the PC version, and it eventually shifted to Switch. The creators of Hollow Knight worked with another Australian developer, Shark Jump Studios, to speed up the porting process. Initially, Team Cherry planned the Switch version to arrive \"not too long after the platform's launch\"; subsequently they delayed it to early 2018. A release date was not announced until the Nintendo Direct presentation at E3 2018 on 12 June 2018, when it was unveiled the game would be available later that day via Nintendo eShop. On 3 August 2017, the \"Hidden Dreams\" DLC was released, featuring two new optional boss encounters, two new songs, a new fast travel system, and a new Stag Station. On 26 October 2017, \"The Grimm Troupe\" was released, adding new quests, new boss fights, new charms, new enemies, and other content. The update also added support for Russian, Portuguese, and Japanese translations of the game. On 20 April 2018, \"Lifeblood\" was released, bringing many optimizations, changes to the colors, bug fixes, minor additions and a new boss fight. On 23 August 2018, the final DLC, \"Godmaster\" was released, containing new characters, boss fights, music, a new game mode as well as two new endings. It was renamed from its former title of \"Gods and Glory\" due to trademark issues. == Reception == Hollow Knights PC and PlayStation 4 versions received \"generally favorable\" reviews and the Nintendo Switch and Xbox One versions received \"universal acclaim\", according to review aggregator Metacritic. Jed Whitaker of Destructoid talked about it as a \"masterpiece of gaming ..., and certainly art worthy of being in a museum\" and, on PC Gamer, Tom Marks called it a \"new classic\". Reviewers talked of Hollow Knights good atmosphere, visuals, sound and music, noting the vastness of the game's world. Critics thought the combat system as simple, unsurprising or nuanced; they talked about its responsiveness positively, or \"tightness\", like the movement system. On IGN, Tom Marks said: \"The combat in Hollow Knight is relatively straightforward, but starts out tricky ... It rewards patience and skill massively\". In his review on PC Gamer, Marks said he liked the \"brilliant\" charm system: \"What's so impressive about these charms is that I could never find a 'right' answer when equipping them. There were no wrong choices.\" NintendoWorldReport said: \"Charms offer a huge variety of upgrades ... Some charms ... were so essential that removing them felt like trading a part of myself for a better chance at an upcoming battle.\" The difficulty of Hollow Knight got attention from reviewers and was talked about as challenging; Vikki Blake of Eurogamer called the game \"ruthlessly tough, even occasionally unfair\". For Nintendo World Reports Adam Abou-Nasr it also seemed unfair—he had \"so frustratingly hard that I cannot recommend this game\" angrily scrawled in his notes—but \"it eventually clicked\". Destructoid \"never found any of the bosses to be unfair\". Destructoid and Nintendo World Report reviewers felt a sense of accomplishment after hard fights. Critics compared it to Dark Souls, noting the mechanic of losing currency on death and having to defeat a Shade to regain it. Destructoid liked this feature, as well as the holding down of a button to heal, because \"they circumvent a couple of issues games have always had, namely appropriate punishment for failing, and a risk- reward system\". === Sales === Hollow Knight had sold over 500,000 copies by November 2017 and passed 1,000,000 in sales on PC platforms on 11 June 2018, one day before releasing on Nintendo Switch, where it had sold over 250,000 copies in the two weeks after its launch. By July 2018 it had sold over 1,250,000 copies. As of February 2019, Hollow Knight has sold over 2,800,000 copies. === Awards === The game was nominated for \"Best PC Game\" in Destructoids Game of the Year Awards 2017, and for \"Best Platformer\" in IGN's Best of 2017 Awards. It won the award for \"Best Platformer\" in PC Gamers 2017 Game of the Year Awards. Polygon later named the game among the decade's best. Year Award Category Result Ref 2017 SXSW Gamer's Voice Awards 2017 The Game Awards 2017 2018 Game Developers Choice Awards 14th British Academy Games Awards Golden Joystick Awards Australian Games Awards 2019 National Academy of Video Game Trade Reviewers Awards == Sequel == A sequel, Hollow Knight: Silksong, is in development and is set to be released on Microsoft Windows, Mac, Linux, and Nintendo Switch, with Team Cherry stating that \"more platforms may happen in the future\". Team Cherry had previously planned this game as a piece of downloadable content. Kickstarter backers of Hollow Knight will get Silksong for free when it is released. This sequel will be about Hornet exploring the kingdom of Pharloom. The game was announced in February 2019 but does not have a release date yet. == References == == Other websites == * Category:2017 video games Category:Action-adventure games Category:Dark fantasy video games Category:Fantasy video games Category:Indie video games Category:Linux games Category:MacOS games Category:Metroidvania games Category:Nintendo Switch games Category:PlayStation 4 games Category:Side- scrolling platform games Category:Single-player video games Category:Soulslike video games Category:Xbox One games Category:Windows games",
 "title": "Hollow Knight"
}