{
 "id": "890269",
 "text": "Miss Meetei Chanu or Miss Meitei Chanu is an annual beauty pageant that is run by the Manipur based Lainingthou Sanamahi Sana Pung (LSSP). The event aims to make Meitei women understand the culture and tradition of Sanamahism (Meitei religion). It is one of the most watched beauty pageants in North East India. It co-exists with Miss Manipur, Femina Miss India Manipur and Miss Kangleipak. == Background == The Miss Meetei Chanu beauty pageant was first held in 2016. It was organised by the Lainingthou Sanamahi Sana Pung (LSSP), a socio- religious group, based in Manipur, India. The event is organised under the guidance of Leishemba Sanajaoba, His Highness, the present king of Manipur. Besides being a beauty pageant, the event also includes cultural activities like cooking dishes, cleaning courtyards and serving elders in traditional ways. > \"Our objective of the event is to preserve the age of traditions of the > Meiteis and to make the younger generations aware of the culture and way of > life so the earth preserved. The pageant is not to select only the beautiful > girl, but to make them aware of the Meitei way of life, culture, tradition > and religion and select the one who can present best the Meitei tradition as > Meitei Chanu.\" _ Tampak Puba, general publicity secretary of the organising committee said. Many elements of the Meitei culture are included in the contest. The contestants are to prepare indigenous dishes in traditional way. The cooking utensils are earthen ones, following the old practices. Other than this, cleaning of courtyard and service to the old people are also the parts of the event. > \"Our aim is to make Meitei girls and married women aware of our forefathers' > religious way, culture and tradition.\" _ Ishorjit Chandam, an organizer of the event said. == Special Awards == Besides the overall top 3 awards, the following are the special awards. Special awards Latin-Roman transliterations English translation/equivalent terms ꯅꯤꯡꯊꯤꯕꯤ ꯁꯝꯂꯥꯡ Ningthibi Samlang Best hair ꯅꯤꯡꯊꯤꯕꯤ ꯃꯤꯅꯣꯛ Ningthibi Minok Best smile ꯅꯤꯡꯊꯤꯕꯤ ꯈꯣꯡꯊꯥꯡ Ningthibi Khongthang Best walk ꯊꯧꯒꯟꯂꯣꯟ ꯆꯪꯈꯣꯟꯕꯤ/ꯊꯧꯒꯜ ꯂꯣꯟꯆꯠ ꯐꯖꯕꯤ Thouganlon Changkhonbi/Thougal Lonchat Phajabi Best manners ꯃꯃꯤꯗ ꯃꯁꯛ ꯐꯖꯕꯤ Mami Da Masak Phajabi Miss Photogenic ꯍꯦꯟꯗꯣꯛꯅ ꯃꯇꯤꯛ ꯃꯌꯥꯢ ꯆꯦꯟꯕꯤ Hendokna Matik Mayai Chenbi Miss Outstanding Quality == Challenge Events == The contest has both non-costume based as well as costume based events. Generally, the costume based events are performed later. === Non-costume based events === The non-costume based events include the following rounds. Event names Latin-Roman transliterations English translation/description ꯅꯥꯆꯣꯝ ꯁꯦꯝꯕ Nachom Semba making flower bunch to wear ꯆꯦꯡ ꯈꯩꯕ-ꯈꯞꯄ Cheng Kheiba-Khappa husking paddy ꯁꯨꯃꯥꯡ ꯋꯥꯢ ꯇꯩꯕ Shumang Wai Teiba courtyard mop contest ꯐꯨ ꯍꯧꯕ/ꯃꯊꯦꯜ ꯂꯨꯀꯣꯢ ꯊꯣꯡꯕ Phu Houba/Mathel Lukoi Thongba traditional kitchen service ꯂꯥꯢꯐꯝꯗ ꯎ ꯊꯥꯕ Laiphamda oo thaaba visiting Meetei places of worship for tree plantation === Costume-based events === The costume based events include three rounds. Event names Latin-Roman transliterations English translation/equivalent terms Description ꯑꯌꯨꯛꯀꯤ ꯌꯦꯟꯗꯥ Ayukki Yenda Introductory Round Contest for daily costumes of Meetei women worn at the dawn during the morning activities like praying to the God. ꯂꯥꯢ ꯍꯔꯥꯎꯕ Lai Haraoba traditional round Lai Haraoba traditional round Contest for costumes of Meetei women worn during Lai Haraoba. ꯑꯀꯦ-ꯑꯃꯧ Ake-Amou round Last round Contest for costumes of Meetei women worn during socio-cultural ceremonies. == Recent Titleholders == Edition Meitei year (as bestowed during the contest) Titleholders Venue of Competition Number of Entrants 2019 3417 Leiphrakpam Suchona Chanu Imphal 30 2018 3416 Oinam Merina Chanu Imphal 2017 3415 Laishram Shilla Chanu Imphal 35 == References == == Other websites == * Meetei_Chanu_pothashang.in * Meetei_Chanu_e-pao.net * Meetei_Chanu_enaat.net Category:Meitei festivals Category:Beauty pageants",
 "title": "Meetei Chanu"
}