{
 "id": "890310",
 "text": "The Football Association of Bosnia and Herzegovina is the governing body of football in Bosnia and Herzegovina. The Bosnian football association was founded as the sub-association of Yugoslavia in 1920. In 1992 the association was re-founded as the football association of Bosnia and Herzegovina. In May 2002 the Football Federation of Bosnia and Herzegovina was unified with the Football Association of Republika Srpska and the Football Federation of Herzeg-Bosnia. In April 2011 it changed its name from Football Federation of Bosnia and Herzegovina to Football Association of Bosnia and Herzegovina. Due to the difficult political situation in Bosnia-Herzegowina the Association had since they became member of the FIFA in 1996 three presidents. One was a Bosniak, one a Croat and one a Serb. This was tolereted by the FIFA till April 2011. Then Bosnia- Herzegowina was banned from all competitions because this was against FIFA-laws. On December 13, 2012 Elvedin Begić was elected as the new first single president of the BiH football organization . ==Management== Position Name President Vico Zeljković Honorary President Ivica Osim Honorary President Elvedin Begić General Secretary Adnan Džemidžić Board executive Milorad Sofrenić Board executive Ivan Beus Board executive Muris Jabandžić Board executive Irfan Durić Board executive Mato Jozić Board executive Fuad Čolpa Board executive Milorad O. Lale Board executive Ivan Perić Board executive Azmir Husić Board executive Muhidin Raščić Board executive Midhet Sarajčić Board executive Dragan Soldo Board executive Miloš Brkić Board executive Žarko Laketa Position Name Head of Appeals Commission Zdenko Vidović Head of Discipline Commission Josip Roso Head of Committee for competition Milorad O. Lale Head of Referee commission Dragan Banjac Head of Committee for stadiums and security Željko Pušić Head of Players' Status Committee Vitomir Ćošković Head of Legal department Enes Hašić Head of sports medicine department Adnan Šatrović Head of Youth football commission Mensur Dogan Head of Women's football commission Dane Bevanda Head of Futsal commission Marko Brčić Head of media department Emir Delić Head of International relations Branko Ivković Head of finances Momir Tošić Head of the Technical committee Munir Talović Head of marketing Mladen Jelača Head of First Instance Licensing committee Suad Zeljković Head of Second Instance Licensing committee Ivica Đogić ===Committee for mediation and consulting=== Position Name President Ivica Osim Member Dušan Bajević Member Sead Kajtaz ==Current head coaches== Men's Team Name National team Ivaylo Petev Under-21 team Slobodan Starčević Under-19 team Ivica Barbarić Under-18 team Slaven Musa Under-17 team Nermin Šabić Under-15 team Igor Janković Futsal team Ivo Krezo Women's Team Name National team Samira Hurem Under-19 team Dragan Jevtić Under-17 team Ilija Lucić ==Teams ruled by the association== *Premier League of Bosnia and Herzegovina *Bosnia and Herzegovina Football Cup, *Bosnia and Herzegovina Women's Football Cup *Bosnia and Herzegovina national futsal team *Bosnia and Herzegovina national under-15, under-17, under-19 and under-21 football team, *Bosnia and Herzegovina men's national football team *Bosnia and Herzegovina women's national under-17 and under-19 national team *Bosnia and Herzegovina women's national football team ==References== Category:Football in Bosnia and Herzegovina Category:Sports organizations of Bosnia and Herzegovina Bos",
 "title": "Football Association of Bosnia and Herzegovina"
}