{
 "id": "890515",
 "text": "Kulmbach is the capital of the district of Kulmbach in Bavaria in Germany. The town is famous for Plassenburg Castle, which houses the largest tin soldier museum in the world, and for its sausages, or Bratwürste. ==Geography== ===Place=== Kulmbach is in the middle of the Bavarian province of Upper Franconia, about northwest of the city of Bayreuth. To the south of Kulmbach, the River Main begins at the convergence of its headstreams, the White Main and Red Main. ===Town districts === Kulmbach is divided into the following districts (with population in brackets): *Innenstadt (\"town center\", 8,655) *Am Galgenberg (4,224) *Industriegebiet (\"industrial park\", 123) *Pörbitsch (754) *Blaich (2,029) *Kauernburg (584) *Weiher (639) *Herlas (526) *Forstlahm (622) *Leuchau (459) *Wickenreuth (68) *Mangersreuth (904) *Donnersreuth/Gössmannsreuth (103) *Ober-/Unterzettlitz (172) *Windischenhaig/Hitzmain/Affalterhof (320) *Katschenreuth (887) *Melkendorf (730) *Seidenhof (451) *Burghaig (1,717) *Petzmannsberg (1,898) *Metzdorf (723) *Ziegelhütten (1,369) *Niederndobrach (214) *Höferänger (219) *Lehenthal (284) *Baumgarten (133) *Grafendobrach (167) *Lösau (126) *Kirchleus (288) *Ober-/Unterdornlach (194) *Altenreuth/Höfstetten (59) ==References== == Sources == * Deutscher Städteatlas (1989). Band: IV; 9 Teilband. Acta Collegii Historiae Urbanae Societatis Historicorum Internationalis - Serie C. Im Auftrag des Kuratoriums für vergleichende Städtegeschichte e.V. und mit Unterstützung der Deutschen Forschungsgemeinschaft, hrsg. von Heinz Stoob †, Wilfried Ehbrecht, Jürgen Lafrenz und Peter Johannek. Stadtmappe Kulmbach, Author: Friedrich Bernward Fahlbusch. , Dortmund-Altenbeken 1989. * Bogner, Franz X. (2006). Der Obermain. Ein Luftbildporträt von Bayreuth bis Bamberg. Ellwanger-Verlag, Bayreuth, . == Other websites == * * From the History of Kulmbach (Upper Main Landscape Museum) * Live webcam with view of the market square * * History of Kulmbach: Category:Kulmbach (district)",
 "title": "Kulmbach"
}