{
 "id": "890649",
 "text": "On April 4, 2013, Rehtaeh Parsons (, ; December 9, 1995 – April 7, 2013), a 17-year-old student at Cole Harbor District High School, attempted suicide by hanging herself \"Rehtaeh Parsons Video Tribute Marks Life Of 'Angel' (VIDEO),\" The Huffington Post Canada, April 9, 2013, URL accessed April 14, 2013. at her home in Dartmouth, Nova Scotia, Canada, leading to a coma and decision to shut down medical support machinery on April 7, 2013 . Her death was attributed to online photo distribution of a gang rape that occurred 17 months before the suicide, in November 2011 . On the Facebook page raised in tribute to her daughter, her mother blamed the young men who had raped her. \"Stephen Harper 'sickened' by Rehtaeh Parsons story,\" CBC News, April 11, 2013, URL accessed April 13, 2013. \"Friends, family, dignitaries attend Rehtaeh Parsons funeral,\" CBC News, April 13, 2013, URL accessed April 13, 2013. In November 2011, then aged 15, she was sexually abused at a friend's house during a party. She doesn't remember what happened that day, only remembers throwing up. \"Rehtaeh Parsons case to be reopened by police,\" CBC News, April 12, 2013, URL accessed April 13, 2013. \"Rehtaeh Parsons' mom calls for vigilantes to stop,\" CBC News, April 10, 2013, URL accessed April 13, 2013. The photos of the November 2011 sexual abuse that took place were made public in just three days. Since then, several colleagues started calling her a prostitute and began sending her text messages asking for sex. She told her family and police what happened several days later. \"Rape, bullying led to N.S. teen's death, says mom,\" CBC News, April 9, 2013, URL accessed April 13, 2013. \"Rehtaeh Parsons Case Connected To Stabbing?,\" The Huffington Post Canada, April 16, 2013, URL accessed April 16, 2013. Allison Cross, \"‘It’s always about the victim’: Rehtaeh Parsons’ father responds to Christie Blatchford’s column,\" National Post, April 26, 2013, URL accessed April 26, 2013. == Related pages == * Bullying == References == Category:Rape Category:Suicides by hanging Category:Suicides in Canada",
 "title": "Suicide of Rehtaeh Parsons"
}