{
 "id": "890768",
 "text": "Doge ( , , ) was an Internet meme that became popular in 2013. The meme usually is of a picture of a Shiba Inu dog with multicolored text in Comic Sans font in the foreground. The text, representing a kind of internal monologue, is written in a form of broken English. == Structure == The Doge meme uses simple phrases with words like \"so,\" \"such,\" \"many,\" \"much,\" and \"very,\" used in funny ways. It often ends with words like \"wow,\" \"amaze,\" or \"excite.\" Variations include \"liquified Doge,\" where the dog's shape changes, and \"ironic Doge,\" where Doge is in weird situations. Other characters, like Cheems and Walter, show up too. Walter is a Bull Terrier who likes trucks. These memes are popular on places like r/dogelore on Reddit. One famous meme is \"Swole Doge vs. Cheems,\" comparing a strong Doge to a baby Cheems. == Origin == Kabosu, a Shiba Inu born around November 2, 2005, was the original dog in the meme. She was sent to an animal shelter when her puppy mill closed down. In 2008, a kindergarten teacher named Atsuko Sato adopted her and named her after a fruit because of her round face. Another dog in the meme is Suki, owned by a photographer named Jonathan Fleming. Suki wore a shrunken scarf in a photo taken in February 2010. Kabosu's first picture appeared in a 2010 blog post by Sato. Later, variations of her pictures with Comic Sans text became popular on Tumblr. The misspelled word \"Doge\" was used intentionally in 2005 in a puppet series. The meme became more popular after being used on Reddit in 2010. Other characters in the meme are based on real dogs. Cheems is based on a dog named Balltze from Hong Kong, who passed away in 2023. Walter is based on a bull terrier named Nelson. Kabosu was reported to be ill with leukemia in December 2022, but her health improved afterward. The word \"Doge\" is pronounced in different ways, such as DOHJ or DOHG. In some countries, it's pronounced as \"dodge.\" People unfamiliar with the meme might say \"doggie\" or other variations like DOG-ay or DOH-gay. Kabosu died on May 24, 2024 in Sakura, Chiba, Japan from leukemia at the age of 18. ==References== == Other websites == * Original blog post featuring Kabosu (moved from post on old blog) * Category:Internet culture Category:Internet memes Category:Individual dogs",
 "title": "Doge (meme)"
}