{
 "id": "89082",
 "text": "The Republic of Lakotah is a proposed enclave nation inside the United States. It was created by a Native American group called the Lakotah Freedom Delegation. The group believes that the Republic of Lakotah should be treated as a separate country. At the moment, no other country agrees that it is. The area includes parts of North and South Dakota, Nebraska, Wyoming and Montana. ==Background== When European settlers first came to North America, the Lakotah people had been living there for thousands of years. The Lakotah are a Native American tribe that lives in the north central part of the United States. The Lakotah first signed treaties with the United States in the 1800s. Since that time, the Lakotah have been citizens of the United States. The Lakotah Freedom Delegation espouses principles aligned with that of the global Land Back movements, and has stated several reasons for its assertion of sovereignty, all a result of what they refer to as the \"colonial apartheid\" of the reservation system in the United States. The group claims that control by the United States has led to massive unemployment, poverty, and disease among the Lakota peoples and alleges that 150 years of U.S. administration is responsible for the statistical poverty of Lakota lands. The group claims that withdrawal from the United States will reverse these problems, and help re- establish the Lakota language and culture. The group claims there have been persistent violations by the United States of their treaties with the Lakota. On December 17, 2007, the Lakotah Freedom Delegation, consisting of Russell Means, Tegheya Kte (also known as Garry Rowland), Duane \"Canupa Gluha Mani\" Martin, and Phyllis Young, traveled to Washington D.C. and delivered a statement declaring that Lakotah tribe should no longer be a part of the United States. They wanted to return to the way things were before they signed the treaties. They drew up borders for the Republic. The area included parts of North and South Dakota, Nebraska, Wyoming and Montana. No other country has supported them. Most people feel these are to still belong to the United States. ==Reasons for wanting independence== In December 2007, the Lakotah Freedom Delegation traveled to Washington, D.C. to speak with the State Department. They said that the Lakota were withdrawing from several treaties that had been signed with the United States citing violations by the federal government. For example, the US and the Lakotah made an agreement called the Treaty of Fort Laramie. It said that the Lakotah could keep the Black Hills. The Black Hills are a very sacred place for the Lakotah. The US broke the agreement and invaded the Black Hills when gold was found there. Today, the Black Hills is home to the National monument of Mount Rushmore. The group does not think that the Republic of Lakotah is a new country but that it is an old country that has been revived. None of the existing, recognized, Lakota tribal governments support the proposed republic, and they were not consulted about the proposal. Traditionally, a vote is needed to change a treaty. Seventy-five percent of the Lakotah males need to vote to approve the change. There was no vote on the plans to create the Republic of Lakotah. The group argues that it is legal for the Lakotah to be its own country. They have referenced the Vienna Convention on the Law of Treaties, Article Six of the United States Constitution and the United Nations Declaration on the Rights of Indigenous Peoples to support their plans. In a news release on January 15, 2008, the Republic of Lakotah proposed that independence from the United States might follow a Compact of Free Association, and suggested that the independence process could resemble that of the Philippines, Palau, the Federated States of Micronesia, or the Marshall Islands. ==Government== === Proposed boundaries === The proposed boundaries of Lakotah would be the Yellowstone River to the north, the North Platte River to the south, the Missouri River to the east and an irregular line marking the west. These borders coincide with those set by the 1851 Treaty of Fort Laramie. The Republic of Lakotah announced its provisional capital as Porcupine, South Dakota, with hopes in the long run to move the administration closer to Rapid City, South Dakota. === Proposed governmental structure === Citizenship in the proposed republic would be open to people of all races and to any resident of the land Lakotah claims. The group said they planned to issue their own passports and driver licenses in the name of the proposed nation. The group proposed that the nation be organized as a confederation that would respect the libertarian principles of posse comitatus and caveat emptor; would offer \"individual liberty through community rule;\" and would collect no nationwide taxes. Individual communities within the proposed nation, however, would be allowed to levy taxes with the consent of the taxed. Means suggested that the proposed nation should not use fiat currency but instead adopt a gold standard.Russell Means interview from December 26, 2007 on Free Talk Live Means stated that this system of government is derived from the traditional Lakota government system, saying, \"...we are going to implement how we lived prior to the Invasion. Each community will be a mini-state unto itself... They will form the federation known as Lakotah.\" Leaders of communities would be informally chosen by elders of the community. On January 1, 2008, the republic announced that it would begin to file the liens on all U.S. government-held lands within their claimed borders; however, the first round of liens, in an unnamed county in South Dakota, were rejected. In July 2008, Means announced that the Republic of Lakotah would be creating an all-Lakota \"grand jury\" to investigate corruption by U.S. government officials on the seven reservations in the republic's claimed territory. In early 2008, Means stated that he intended to treat the result of the upcoming 2008 Pine Ridge Reservation presidential election, in which he was a candidate, as a \"plebiscite/referendum\" on Lakota independence. He lost that election 1,918 to 2,277. At the moment, supporters of the Lakotah Freedom Delegation are in discussion over the name of the country. Some people like the name Republic of Lakotah. Others prefer Lakotah Oyate where \"Oyate\" is the Lakotah word meaning \"nation\". ==Response== === Federal government === The United States Department of State referred queries on the subject of Lakotah to the United States Department of the Interior, which oversees the Bureau of Indian Affairs.\"For your query, we will refer you to the Department of the Interior. This is not a State Department issue.\" Kirsten Petree, Director, Office of Media Affairs, U.S. Department of State, private communication with Wikinews (December 21, 2007) Gary Garrison of the BIA said that the group's withdrawal \"doesn't mean anything.\" He went on to say, \"These are not legitimate tribal governments elected by the people ... when they begin the process of violating other people's rights, breaking the law, they're going to end up like all the other groups that have declared themselves independent—usually getting arrested and being put in jail.\" Regarding the government response, or lack thereof, Russell Means stated that, \"I don't expect the federal government to do anything. I don't believe they even know what to do.\" === Lakota tribes === Contrary to Means' claims, none of the existing Lakota tribal governments supported the proposed republic, and they were not consulted about the proposal. Rapid City Journal reporter Bill Harlan reported on his blog that \"...most folks I talk to hadn't heard about the declaration. The ones who had heard the news, to a person, did not want to talk about it on the record.\" The Journal noted that \"...there were no tribal presidents in the group which made the announcement, no one from the top ranks of any of the Lakota Sioux tribes...\" Nanwica Kciji, an Oglala Lakota and first president of the Native American Journalists Association, has discredited the December 2007 developments, arguing that the Lakotah Freedom Delegation \"never considered that treaties are made between nations and not individuals.\" According to scholar Hiroshi Fukurai, \"...the declaration of independence by the Republic of Lakotah in 2007 has been largely ignored by the US, as well as by the UN and its Member States.\" === Other tribal governments and domestic groups === Rodney Bordeaux, chairman of the Rosebud Sioux, said that Rosebud Indian Reservation has no interest in joining the Republic of Lakotah and said that the Lakota Freedom Delegation never presented their plan to the tribal council. Bordeaux stated that the group does not represent the Lakota people nor the support of the elected tribal governments. He did say, however, that Means \"...made some good points\". Joseph Brings Plenty, chairman of the Cheyenne River Lakota, agreed that the Lakota Freedom Delegation \"...are not representative of the nation I represent...\" but would not say whether he agreed or disagreed with their goals and message, noting there was some value in the group's actions in raising awareness for the history of the Lakota people. The Alaskan Independence Party, in an announcement dated December 21, 2007, \"applauded\" the independent Lakota nation and granted it \"full recognition\". The secessionist movement Second Vermont Republic has also announced its support, and encouraged other American Indian groups to similarly declare independence from the United States. === International contacts === In February 2008, the Lakotah Freedom Delegation handed over a formal petition, asking for recognition of the Republic of Lakotah, to the embassies of Russia, Serbia, Bolivia, Venezuela, the Republic of South Africa, Ireland, France, Nicaragua, East Timor, Chile, Turkey, India, Finland, Iceland and Uruguay. According to Means, Venezuela's ambassador to the United States stated to the group that his country would not recognize Lakotah's independence based on Venezuela's interpretation of what the Lakotah Freedom Delegation is doing. ==Notes== == References == Category:United States Category:Native Americans Category:Nationalism",
 "title": "Republic of Lakotah"
}