{
 "id": "891296",
 "text": "The 1925 serum run to Nome was when dog sled teams transported medicine to the sick children of Nome. It is also called the Great Race of Mercy and The Serum Run. Leonhard Seppala and his dog Togo travelled the longest and most dangerous part of the journey. But a musher named Gunnar Kaasen and Balto became the most famous because they did the last part. An epidemic of diphtheria started in Nome, Alaska. It threatened the lives of many, mostly children. The medicine to treat the disease was called diphtheria antitoxin. Doctor Curtis Welch only had a supply of expired medicine. He had ordered more medicine in Juneau, but it did not arrive before the Bering Sea froze. Shortly after the last ship had left Nome before winter, a native American girl from the nearby village, Holy Cross, showed signes of diphtheria. The doctor ruled out diphtheria, and instead said the child has tonsillitis. The child died about a day later. During the next weeks, three more children died. On January 20,1925, a three year old boy wa diagnosed with diphteria. Dr. welch didn't give the boy antitoxin, because the dose had expired, and he feared that it would weaken the boy too much. The boy died a day later. The next day, January, 21st, a seven year old girl was diagnosed. The doctor injected her 6.000 of the 8.000 units of antidote he had, even though they were past the expiration date. It did not help, the girl died the same day. The weather conditions made it very hard to deliver any new medicine. It was decided that dog sled teams were need to bring it to Nome. Twenty mushers, and about 150 sled dogs travelled a distance of in five and a half days. With this, they could save the town of Nome, and the areas around it from a diphtheria epidemic. On January 21st, the town was placed under quarantine. There was a new popular medium, radio. It showed both the mushers and their dogs as heroes. Newspapers also reported on the run. Balto, the lead sled dog on the final stretch into Nome became the most famous dog, of the era, after Rin Tin Tin. Statues of him in both New York City's Central Park and downtown Anchorage, Alaska are popular tourist attractions. But it was Togo's team which covered much of the most dangerous parts of the route. It also ran the farthest: Togo's team covered while Balto's team ran . The publicity also helped an inoculation campaign in the U.S. This dramatically reduced the threat of the disease,diphtheria. Conditions were very harsh: Often, temperatures were below . At first, the idea was to fly the serum to Nome, but there were no aircraft or pilots, that could fly in this bad weather. The aircraft available could only fly about half the distance, and there was no way to refill them. == References == Category:1925 Category:Dogs Category:History of Alaska",
 "title": "1925 serum run to Nome"
}