{
 "id": "891523",
 "text": "Peter Pacult (born 28 October 1959) is an Austrian former professional footballer and current football manager. He is manager of Austria Klagenfurt in the Austrian Bundesliga. ==Club career== Pacult started his career at Floridsdorfer AC before turning professional with Wiener Sportklub. His next team was the Austrian top club Rapid Wien. With the team he played in the UEFA Cup Winners Cup Final in 1985 against Everton. He moved on to Swarowski Tirol and won two league titles with FC Tirol Innsbruck. With Tirol he was top goal scorer in the 1990–91 European Cup alongside Jean-Pierre Papin. In 1993 he went to TSV 1860 Munich. His last club was the other big Vienna club FK Austria Wien in 1996. ==International career== He made his debut for Austria in October 1982 against Northern Ireland. He was not part of the squad for the 1990 FIFA World Cup. He played 24 matches and scored one goal. In November he played his last match against Sweden. ==Coaching career== Pacult was head coach of 1860 Munich II from April 2001 to June 2001,Kicker.de (German) after one year with FC Kärnten and Dynamo Dresden he became coach of Rapid Wien from 2006 till 2011. In this time fell the last title Rapid reached (2008). In 2011 he went on to RB Leipzig for one year. After short time with Dynamo Dresden and Floridsdorfer AC he spent the next years with clubs from former Yugoslavia. In 2020 he became coach of SK Austria Klagenfurt and was promoted with his team to Austrian Bundesliga.Austria Klagenfurt:Official Homepage (German) ==Honours== Rapid Wien *Austrian Cup: 1985 Swarovski Tirol *Austrian Bundesliga: 1989, 1990 *Austrian Cup: 1989 ===Manager=== Rapid Wien *Austrian Bundesliga: 2008 ===Individual=== *Top scorer Austrian Bundesliga: 1989 (26 goals) ==References== Category:1959 births Category:Living people Category:Austrian footballers Category:Austrian football managers Category:Players of the Austrian national football team Category:RB Leipzig managers Category:Floridsdorfer AC managers Category:SK Rapid Wien managers Category:TSV 1860 Munich managers Category:Austrian football forwards Category:Austrian Football Bundesliga top scorers Category:Bundesliga players Category:Bundesliga managers Category:FK Austria Wien players Category:SK Rapid Wien players",
 "title": "Peter Pacult"
}