{
 "id": "89177",
 "text": "The Democracy in Ancient Athens was very different from modern democracy. Citizens had the right to help govern but most people were not citizens. To be classed as a citizen in fifth-century Athens you had to be male, born from two Athenian parents, over eighteen years old, and completed your military service. Women, slaves, metics and children under the age of 20 were not allowed to become citizens. Citizens could be involved in the running of Athens and could be chosen for important positions. They were also allowed to own land. Citizens were between 10% and 20% of the total population at various times in the 5th and 4th centuries. == The Ecclesia (Assembly of Men) == Ancient Athens had a direct democracy. This meant that each citizen had an equal say and opportunity in the governing of Athens. The citizens of Athens would meet on a hillside (the Pnyx) 30 to 40 times a year to discuss how to run the city better. Facaros, Dana & Theodorou, Linda 2020. Peloponnese and Athens. New Holland Publishers, p98. ISBN 978-1-86011-396-3 Usually a few thousand actually came to the meeting. All citizens could attend the meetings. People would stand on a raised platform called the bema to speak. Speakers wore a garland whilst speaking. Any citizen could speak. All major decisions concerning the running of Athens were decided here – taxes, war, policy, etc. Any decisions were made by a show of hands. A black pig would be sacrificed to the gods at the start of the meeting to make sure the meeting went well. All democratic countries now have an indirect democracy. This means members of parliament are elected to make decisions concerning government. There are now too many people in countries for them to meet on a hillside, and many people are too busy to be able to go many times each year. == The Boule (Council of 500) == Cleisthenes, a democratic reformer, divided Attica into ten tribes in 510 BC. The Boule was made up of 50 male Athenian citizens chosen at random from each of the ten tribes (all over 30 years old). This meant that 500 men were elected, but only 50 served at any one time. ==References== Category:Ancient Athens Category:Democracy",
 "title": "Democracy in Athens"
}