{
 "id": "891872",
 "text": "Minnal Murali () is a 2021 Indian Malayalam-language superhero film directed by Basil Joseph and produced by Sophia Paul, under the banner of Weekend Blockbusters. The script was written by Arun Anirudhan and Justin Mathew. The film starred Tovino Thomas, Guru Somasundaram and Aju Varghese in lead roles. It was released on December 24, 2021. The film has been released in Malayalam, Tamil, Telugu, Kannada, Hindi and English languages. The film received positive response from critics and audiences, with praise directed at Tovino and Guru's performances, Joseph's direction, screenplay, execution and technical aspects. ==Plot== A tailor gains special powers after being struck by lightning, but must take down an unexpected foe if he is to become the superhero his hometown needs. ==Cast== * Tovino Thomas in dual roles as: ** Jaison, a tailor who gets struck by lightning and gains superpowers. His superhero alter ego goes by the name Minnal Murali ** Martin, a theatre artist and Jaison's father * Guru Somasundaram as Shibu, a social outcast, who works in a teashop who also gets struck by lightning and gains superpowers * Femina George as \"Bruce Lee\" Biji, a travel agent and a karate instructor, who is Aneesh's ex-girlfriend * Aju Varghese as P.C. Siby Pothan, Jaison's brother- in-law * Shelly Kishore as Usha, Daasan's sister whom Shibu harbors feelings for * Baiju Santhosh as S.I Saajan, the head sub-inspector of Kurukanmoola and Bincy's father * Harisree Ashokan as Daasan, a tailor who works along with Jaison and is Usha's brother * Vasisht Umesh as Josemon, Jaison's nephew * Arya Salim as Jaison's sister * Sneha Babu as Bincy, Jaison's ex-girlfriend who later gets married to Aneesh * P. Balachandran as Varkey, Jaison's adoptive father * Jude Anthany Joseph as Aneesh, Biji's ex-boyfriend who later marries Bincy * Mamukkoya as Doctor Sambhashivan * Sudheesh as himself (cameo) * Bijukuttan as Kunjan * Azees Nedumangad as Chandran * Rajesh Madhavan as P.C. Titto * Benzi Mathews as a young Varkey * Gibin Gopinath as P.C. Dasan * Harish Pengan as Varieth * Devi Chandana as Girija * Syam Cargoz as Panchayat Member * Basil Joseph as a young politician (cameo appearance) ==References== Category:2021 movies Category:Netflix movies",
 "title": "Minnal Murali"
}