{
 "id": "892016",
 "text": "Mathilde Radiguet (born 1984) is a French geophysicist, specializing in the mechanics of faults and the study of transient deformations. In 2019, she won a French National Centre for Scientific Research (CNRS) bronze medal. She studied geophysics at École Normale Supérieure. She studied on the relationship between soil movements and fault characteristics at the Institute of Earth Sciences (ISTerre) with F. Cotton, I. Manighetti and M. Campillo. She obtained her PhD in geophysics from the Grenoble Alpes University. She was a post-doctoral fellow at École Polytechnique Fédérale de Lausanne, where she worked on modelling the dynamics of rupture. She is a professor at Grenoble Observatory for Sciences of the Universe. Her work has appeared in Physical Research Letters, Journal of Geophysical Research. == Works == * Radiguet de La Bastaie, Mathilde, Study of Slow Earthquakes and Interseismic Loading in the Guerrero Region of Mexico * Radiguet, Mathilde; Campillo, Michel (2010). \"A new perspective on the Guerrero gap: Slow slip events and tremors\". EGU General Assembly Conference Abstracts: 3563. Bibcode:2010EGUGA..12.3563R. * \"19th General Assembly of WEGENER\" . Sciencesconf.org. 2017-03-29. * Rivet, Diane; Campillo, Michel; Shapiro, Nikolai M.; Cruz-atienza, Victor; Radiguet, Mathilde; Cotte, Nathalie; Kostoglodov, Vladimir. \"DOI: 10.1029/2011GL047151 Seismic evidence of nonlinear crustal deformation during a large slow slip event in Mexico\". CiteSeerX. CiteSeerX 10.1.1.393.1182. doi:10.1029/2011GL047151. * Cotte, Nathalie; Walpersdorf, Andrea; Kostoglodov, Vladimir; Vergnolle, Mathilde; Santiago, Jose-Antonio; Campillo, Michel (2009-05-26). \"Anticipating the Next Large Silent Earthquake in Mexico\". Eos, Transactions American Geophysical Union. American Geophysical Union (AGU). 90 (21): 181–182. doi:10.1029/2009eo210002. ISSN 0096-3941 == References == Category:1984 births Category:Living people Category:French physicists",
 "title": "Mathilde Radiguet"
}