{
 "id": "892048",
 "text": "The Bad Guys is a book series of graphic novels written by Aaron B. ==Plot== The \"Bad Guys\" are a group of anthropomorphic criminals who try to do good things to change peoples' perception on them, despite their efforts usually going wrong. ==Characters== In the following table: * A dark grey cell indicates that the character was not in the property or that the character's presence in the property has yet to be announced. * \"Main\" indicates a character had a starring role in the property. * \"Recurring\" indicates the character appeared in two or more times within the property. * \"Guest\" indicates the character appeared once in the property. Character Book series Film Short Netflix Special 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 Heroes Mr. Wolf colspan=\"20\" Mr. Snake colspan=\"20\" Mr. Piranha colspan=\"20\" Mr. Shark colspan=\"20\" Mr./Ms. Tarantula colspan=\"19\" Agent Fox/Diane Foxington colspan=\"2\" colspan=\"4\" colspan=\"11\" Villains Professor Marmalade colspan=\"4\" colspan=\"3\" colspan=\"4\" colspan=\"2\" Dread Overlord Splaarghön colspan=\"9\" colspan=\"7\" colspan=\"3\" Underlord Shaård/Dickie colspan=\"11\" colspan=\"3\" colspan=\"5\" Underlord Onsàáy colspan=\"11\" colspan=\"3\" colspan=\"4\" Underlord Drilllaärgh colspan=\"14\" colspan=\"2\" colspan=\"4\" Underlord Esmeralda Ghaāstly colspan=\"15\" colspan=\"5\" Others Tiffany Fluffit/Delores Gristlewurst colspan=\"9\" colspan=\"7\" Granny Gumbo colspan=\"3\" colspan=\"7\" colspan=\"3\" colspan=\"3\" Agent Kitty Kat colspan=\"6\" colspan=\"10\" colspan=\"3\" Agent Hogwild colspan=\"6\" colspan=\"10\" colspan=\"3\" Agent Doom colspan=\"6\" colspan=\"10\" colspan=\"3\" Agent Shortfuse colspan=\"7\" colspan=\"10\" colspan=\"3\" Milton colspan=\"6\" colspan=\"10\" colspan=\"3\" Nathan colspan=\"9\" colspan=\"2\" colspan=\"6\" colspan=\"3\" Papa Piranha colspan=\"9\" colspan=\"2\" colspan=\"6\" colspan=\"3\" Buck Thunders colspan=\"12\" colspan=\"4\" colspan=\"3\" Abe colspan=\"14\" colspan=\"3\" Zee colspan=\"15\" colspan=\"4\" Chief Misty Luggins colspan=\"17\" colspan=\"2\" Cuddles colspan=\"17\" colspan=\"3\" Officer Bob colspan=\"18\" ===Main=== ====Heroes==== * Mr. Moe Wolf – a gray wolf who is the leader of the Good Guys Club/Shadow Squad G. Tired of being seen as the villain, he recruited his friends in order to do good deeds and clear their reputation. Despite his good intentions, his enthusiasm gets in the way of the success of their missions. * Mr. Snake – a Eastern brown snake, who works on stealth tactics of the team. Being very self-centered and shady, he often diverts from the Good Guys Club's goals of being good by doing whatever he wants, and most of the time can't stay away from doing misdeeds, but he can be selfless when he wants to. During the second arc of the books, he is possessed by an otherworldly entity and becomes the antagonist known as \"The Underlord\". * Mr. Pepe Piranha – a Bolivian red-bellied piranha, who works on being the muscle of the film. With a temper as short as his size, he goes berserk when he is mistaken for a sardine. He also has flatulence problems which in the film, he has the same problems if he gets nervous. His family forms a mafia- like operation in which his father is the leader. * Mr. Lou Shark – a great white shark, who works as a master-of-disguise of the film. Despite his large size and intimidating appearance, he is usually the most serene of the group. At first, he took a dislike for Mr. Tarantula due to his arachnophobia, but eventually he got over it. In the film, he gets aggressive when he doesn't get a Push Pop from Mr. Snake's non-sharing habits. * Mr./Ms. Tarantula – a sharp- tongued expert hacking redknee tarantula also known as \"Legs\". Often speaking in jive, he prefers not to wear clothing, which causes confusion for the rest of the team. In the film, his character was changed to being a female also known as \"Webs\". ====Villains==== * Doctor Rupert Marmalade/Professor Rupert Marmalade IV – a hamster mad scientist who wants to take over the world and hates being called cute. In the book series, he is found by the Bad Guys after they rob his chicken farm, taking notice and swearing vengeance over them until later on. He is later revealed to be an alien being named Kdjfloerhgcoinwerucgleirwfheklwjfhxalhw. In the film, he is a guinea pig and famous genius who supposedly \"stops wars, feeds the hungry, and saved countless pandas\". He is in charge of reforming the Bad Guys as a philanthropist, but secretly uses them as a cover-up to his own criminal plot: mind-controlling other guinea pigs into stealing his own charity donations, but his plan is foiled by Mr. Snake, who pretends to ally with him after an argument with Mr. Wolf while secretly replacing his source of power (a heart- shaped meteorite) with a fixture resembling it, destroying the power to blow up his mansion and is finally arrested after being framed as The Crimson Paw when taking the Zumpango Diamond. * Dread Overlord Splaarghön – The primary antagonist of the latter books. He is an evil centipede-shaped demon who seeks to conquer the multiverse. His main methods involve granting powers to evil characters to act as his underlords in fulfilling his will. He convinces Mr. Snake to go against his friends in return for making him an underlord. When anyone says his name, a heavy metal guitar riff plays. * Underlord Shaård/Dickie – One of Splaarghön's minions who rules a universe full of sharp blades and broken glass. Later it is revealed that he is a baby spoon named Dickie, who sought help from Splaarghön, thus giving him power like other underlords. * Underlord Onsàáy – Another underlord. Her full name is Queen Bee Onsàáy. She rules a universe that looks like a beehive full of giant bees. * Underlord Doctor David Drilllaärgh – Another underlord. He is a psychotic jackal dentist who rules a dental clinic universe. * Underlord Esmeralda Ghaāstly - Another underlord. She rules a universe that looks like a forest. She is also said to bring bad luck, bad moods, and bad hair. ====Others==== * Agent Ellen Fox/Diane Foxington – A fox who was hunted and hated for her species at a young age and a member of the International League of Heroes. In books 3-7, she helps the Good Guys club stop Professor Marmalade from turning every cute animal in the world into zombies. In The Baddest Day Ever, it is revealed that her name is Ellen, During the second arc, she is revealed to have supernatural abilities and is known as \"The One\" a being meant to defeat Lord Splaarghön. In the movie, she is a red fox governor named Diane Foxington, later revealed to be a former lady thief known as The Crimson Paw and later on became Mr. Wolf's love interest. * Tiffany Fluffit/Delores Gristlewurst - an anchorwoman who reports about The Bad Guys' behavior. While she's a cat in the books, she is human in the movie. Later in the books, it was revealed that her real name is Delores Gristlewurst. * Granny Gumbo - An alligator who helped Mr. Wolf, Mr. Snake, Mr. Tarantula, and Agent Fox in The Attack Of The Zittens to turn the Zittens back into normal kittens. In the second arc, she is revealed to be a part of an intergalactic team called The Others. * Agent Pam Kitty Kat – A black cat and member of the International League of Heroes, she is at first angered at Fox for having kept her powers secret but later forgives her. * Agent Emmylou Hogwild – A pig and member of the International League of Heroes who has a crush on Piranha. * Agent Joy Doom – A bird and member of the International League of Heroes. * Agent Rhonda Shortfuse – A small dog but powerful member of the International League of Heroes. * Milton – A Velociraptor from the Jurassic period who is accidentally sent to the present and given high intelligence in the second arc he is revild to be part of an intergalactic team called The Others. * Nathan – One of Marmalade's guards who defects to help the main protagonists. * Papa Piranha – The father of Mr. Piranha. * Buck Thunders – A bull who helps the B Team (Agent Doom, Mr. Tarantula, Milton, Papa Piranha, Nathan) to find The Others. Later it is revealed that Buck Thunders is one of The Others. However, it is revealed that Buck Thunders is a spy of Dread Overlord Splaarghön. * Abe – A bat who is a part of an intergalactic team called The Others. He always speaks the truth but he can't help it. * Zee - A lizard who is a part of an intergalactic team called The Others. * Mr. Wolf's Father - Father of Moe Wolf (Mr. Wolf). * Chief Misty Luggins – The strong chief of police who always tries to arrest the Bad Guys in the film and the short Maraschino Ruby. * Cuddles – Professor Marmalade's silent henchman who only appeared in the film. * Officer Bob – One of the human officers shown from the short Maraschino Ruby. ==Books== *The Bad Guys (2015) *The Bad Guys: Episode 2: Mission Unpluckable (2016) *The Bad Guys: Episode 3: The Furball Strikes Back (2016) *The Bad Guys: Episode 4: Attack of the Zittens (2016) *The Bad Guys: Episode 5: Intergalactic Gas (2017) *The Bad Guys: Episode 6: Alien vs. Bad Guys (2017) *The Bad Guys: Episode 7: Do-You-Think-He-Sarus? (2018) *The Bad Guys: Episode 8: Superbad (2018) *The Bad Guys: Episode 9: The Big Bad Wolf (2019) *The Bad Guys: Episode 10: The Baddest Day Ever (2019) *The Bad Guys: Episode 11: Dawn of the Underlord (2020) *The Bad Guys: Episode 12: The One?! (2020) *The Bad Guys: Episode 13: Cut to the Chase! (2021) *The Bad Guys: Episode 14: They're Bee-Hind You! (2021) *The Bad Guys: Episode 15: Open Wide and Say Arrrgh! (2022) *The Bad Guys: Episode 16: The Others?! (2022) *The Bad Guys: Episode 17 (2023) ==Film adaptation== On July 22, 2017, Australia's The Daily Telegraph reported that several studios had expressed interest in adapting the series into a film. In March 2018, Variety reported that DreamWorks Animation would develop a film based on the book series, with Etan Cohen writing the screenplay. The following year, in October, it was reported that the film would be directed by Pierre Perifel in his feature directorial debut. The film was described as having \"a similar twist on the heist genre that Shrek did on fairy tales, and what Kung Fu Panda did for the kung fu genre\". The crew worked remotely during the COVID-19 pandemic. On July 28, 2021, the cast was announced with Etan Cohen, Patrick Hughes, and author Aaron Blabey set to serve as executive producers for the film. On October 7, 2019, it was reported that the film would be theatrically released on September 17, 2021, taking over the release date of Spooky Jack. In December 2020, the film was delayed with The Boss Baby: Family Business taking its original slot, though it was confirmed that it would get a new date \"within the coming weeks\" due to the COVID-19 pandemic. In March 2021, the release date was scheduled to April 15, 2022. In October 2021, it was pushed back again by one week to April 22. The film is slated to stream in the United States on the Peacock streaming service 45 days after its theatrical release, followed by its Netflix debut after Peacock's 4-month exclusive window. On March 1, 2022, Universal pulled the release in Russia in response to the Russian invasion of Ukraine. A CG sequel short based on the film, The Bad Guys in Maraschino Ruby, was announced in the Blu-ray and Digital release with a story made and directed by head of story Nelson Yokota and produced by Angie Howard while executive produced by Pierre Perifel, Damon Ross, Rebecca Huntley and Michael Vollman. ===Untitled Netflix holiday special (2023)=== A holiday special inspired by the characters from the film is being produced by DreamWorks Animation Television and will be directed by Bret Haaland from Fast & Furious Spy Racers and executive produced by Haaland and Katherina Nolfi from Abominable and the Invisible City and Spirit Riding Free. The holiday special will be aired in 2023 on Netflix. ==References== Category:Series of books",
 "title": "The Bad Guys (book series)"
}