{
 "id": "892116",
 "text": "The following is a list of deaths that happened in 2022\\. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known), and a source. == November == === 1 === *Mbazulike Amaechi, 93, Nigerian politician, minister of aviation (1963–1966).Mbazulike Amechi, First Nigerian Aviation Minister Passes Away *Filep Karma, 63, Indonesian Papuan independence activist, diving accident.Aktivis Filep Karma Ditemukan Meninggal di Pantai Jayapura *, 66, Chinese actor (A Terra-Cotta Warrior).“关羽”陆树铭突然去世，享年66岁，不久前还为女篮加油 *, 80, Taiwanese actress (Silk).快訊／《昨夜星辰》視后馬之秦病逝！享壽80歲 息影6年致力公益 *Jan Snoeks, 90, Dutch football player (Ajax).Familieberichten Jan Snoeks (31-03-1932 – 01-11-2022) *Takeoff, 28, American rapper (Migos), gunshot wounds.US rapper Takeoff, 28, shot dead in Houston, Texas *Keith Taylor, 69, British politician, MEP (2010–2019).Tributes flood social media following death of Green Party pioneer and MEP Keith Taylor === 2 === *, 65, Turkish actor (In Darkness, Hükümet Kadın, Aile Arasında) and journalist.Japon eşi aldığı acı haberle yıkıldı... Usta oyuncu Rıza Akın 65 yaşında hayatını kaybetti! *Ela Bhatt, 89, Indian cooperative organiser, activist and Gandhian.Ela Bhatt, The Face Of Gentle Revolution, Dies Aged 89 *Alan Chui Chung-San, 70, Hong Kong actor (The Rebellious Reign, Kung Fu vs. Yoga, Two Fists Against the Law).70岁“笑面虎”徐忠信因病身亡 曾说“李小龙比李连杰成龙能打” *Mauro Forghieri, 87, Italian mechanical engineer.Morto Mauro Forghieri, storico direttore tecnico della Ferrari *Nicholas Harding, 66, English-born Australian painter, Archibald Prize winner (2001), cancer.Archibald, Wynne winner Nicholas Harding dies (death announced on this date) *Jambey Tashi, 44, Indian politician, Arunachal Pradesh MLA (since 2009).Arunachal: Lumla MLA Jambey Tashi Passes Away in Guwahati === 3 === *Fatima Bernawi, 83, Palestinian militant (Palestinian Freedom Movement).Afro-Palestinian Fatima Bernawi, first of Israel's women prisoners, dies *Peter Danckert, 82, German politician, MP (1998–2013).Brandenburger SPD: Trauer um Ex-Bundestagsabgeordneten Peter Danckert *Ray Guy, 72, American Hall of Fame football player (Oakland/Los Angeles Raiders).Ray Guy dies at 72: Raiders legend, first punter inducted into Pro Football Hall of Fame, passes away *Yocheved Kashi, 93, Israeli military officer.יוכבד מילשטיין ז\"ל *Will van Sambeek, 87, Dutch graphic designer.Grafisch ontwerper Will van Sambeek, die ooit het 'Friesch Dagblad' een nieuw uiterlijk gaf, is op 87-jarige leeftijd overleden: 'Hij was een pietje precies bij wie een afwijking van een millimeter al opviel' === 4 === *Fazil Mammadov, 58, Azerbaijani politician, minister of taxes (2000–2017), pancreatitis.Fazil Məmmədov vəfat etdi - Yenilənib *Toralv Maurstad, 95, Norwegian actor (Song of Norway, The Pinchcliffe Grand Prix), director of the National Theatre (1978–1986).Toralv Maurstad er død *Ibrahim Munir, 85, Egyptian Islamic activist.Ibrahim Munir: Muslim Brotherhood acting leader dies in London === 5 === *Aaron Carter, 34, American singer (\"Crush on You\", \"Aaron's Party (Come Get It)\", \"Leave It Up to Me\"), drowned.Aaron Carter, Singer and Brother of Backstreet Boys’ Nick Carter, Dies at 34 *Carmelo La Bionda, 73, Italian musician (La Bionda) and songwriter (\"There for Me\", \"One for You, One for Me\"), cancer.Morto Carmelo La Bionda, con fratello inventò la disco italiana *Bill Treacher, 92, British actor (EastEnders, The Musketeer, Dixon of Dock Green).Bill Treacher: EastEnders star dies aged 92 *Hein van Nievelt, 80, Dutch television presenter.Oud-TROS-presentator Hein van Nievelt (80) overleden === 6 === *John Alderson, 93, New Zealand cricketer (Canterbury).John Dalton Alderson *Breido Graf zu Rantzau, 73, German equestrian and sport administrator, cancer.Breido Graf zu Rantzau (73) overleden === 7 === *Leslie Phillips, 98, British actor (Carry On, The Navy Lark, Harry Potter and the Philosopher's Stone) and author.Leslie Phillips: Carry On and Harry Potter star dies aged 98 *Jan Vermaat, 83, Dutch sculptor.Woerdense beeldhouwer Jan Vermaat (83) overleden === 8 === *Will Ferdy, 95, Belgian singer, parkinson's disease.Will Ferdy overleden op 95-jarige leeftijd, eerste bekende Vlaming die zich outte als homoseksueel *Tom Owen, 73, British actor (Last of the Summer Wine, Tottering Towers).Last Of The Summer Wine star Tom Owen dies aged 73 (death announced on this date) === 9 === *Keith Farmer, 35, Northern Irish motorcycle racer.Keith Farmer: Northern Ireland's four-time British motorcycling champion dies aged 35 === 10 === *Chris Koerts, 74, Dutch guitarist (Earth and Fire).Gitarist Chris Koerts (1947-2022) maakte met zijn tweelingbroer rockband Earth & Fire groot === 11 === *John Aniston, 89, Greek-born American actor (Days of Our Lives, Love of Life, Search for Tomorrow).John Aniston Dies: ‘Days Of Our Lives’ Actor, Father Of Jennifer Aniston Was 89 *Ian Campbell, 94, Chilean Hall of Fame rugby union player (national team).Falleció Ian Campbell unos de los máximos referentes del rugby chileno *Jacques De Coster, 77, Belgian politician.Jacques DE COSTER *Sven-Bertil Taube, 87, Swedish singer and actor (The Eagle Has Landed, Puppet on a Chain, The Girl with the Dragon Tattoo).Artisten och skådespelaren Sven-Bertil Taube död *Klaas Samplonius, 75, Dutch journalist and radio presenter.Oud-radiopresentator Met het Oog op Morgen Klaas Samplonius (75) overleden === 12 === *David English, 76, British actor (A Bridge Too Far, Lisztomania), cricketer (Marylebone) and writer, heart attack.David English, founder of Bunbury schools festival, dies aged 76 === 13 === *Constantin Codrescu, 91, Romanian actor (The Bugler's Grandsons, The Sun Rises, The Mill of Good Luck).Actorul Constantin Codrescu a murit *Willie Donald, 69, Scottish cricketer (Aberdeenshire, national team).Willie Donald: Former Scotland international cricketer dies age 69 *Rudi Hemmes, 99, Dutch resistance hero (Engelandvaarder).Verzetsheld Rudi Hemmes (99) overleden *Theo Kleindijk, 84, Dutch football player (ADO Den Haag).Oud- speler van ADO Theo Kleindijk (84) overleden === 14 === *Sue Baker, 67, British television presenter (Top Gear), motor neurone disease.Former Top Gear presenter and motoring journalist Sue Baker dies aged 67 *Kevin Beardmore, 62, English rugby league player (Castleford, Great Britain, national team).Castleford and Great Britain hero Kevin Beardmore passes away aged 62 (death announced on this date) *Geoff Cochrane, 71, New Zealand poet, novelist and short story writer.Remembering Geoff Cochrane, 1951–2022 (death announced on this date) *Werner Franke, 82, German molecular biologist, cerebral haemorrhage.Provokant und kompromisslos: Werner Franke ist tot *Karel Hille, 77, Dutch journalist and songwriter.Karel Hille overleden *Virginia McLaurin, 113, American social worker.DC's Virginia McLaurin, woman who danced with the Obamas, dies at 113 *Kay Meredith, 86, American equestrian, writer and novelist.Kay Frances (Huggins) Meredith Obituary *Tommy Murphy, 79, Irish hurler (Rower-Inistioge, Kilkenny).Kilkenny hurling legend Fr Tom Murphy passes away *Jan Nekovář, 59, Czech mathematician.Décès de Jan Nekovar (1963 - 2022) *Carolina Ödman-Govender, 48, Swiss physicist and academic, pancreatic cancer.Remembering Prof. Carolina Ödman-Govender *Jean-Philippe Omotunde, 55, French-Cameroonian writer, heart attack.Jean-Philippe Kalala Omotunde s'est éteint *Pappu, 44, Indian cinematographer (Second Show, Koothara, Ayaal Sassi), amyloidosis.Noted cinematographer Sudheesh Pappu passes away *Vicky Phelan, 48, Irish cancer campaigner and malpractice suit plaintiff (CervicalCheck cancer scandal), cervical cancer.CervicalCheck campaigner Vicky Phelan passes away aged 48 *Jerzy Połomski, 89, Polish singer and actor.Nie żyje Jerzy Połomski. Artysta zmarł w wieku 89 lat *Pál Révész, 88, Hungarian mathematician.Meghalt Révész Pál matematikus *Mohammed Al-Sanousi, 84, Kuwaiti politician, minister of information (2006).أسباب وفاة وزير الإعلام الكويتي الأسبق محمد السنعوسي *Sunil Shende, 75, Indian actor (Gandhi, Nivdung, Khal Nayak).Sarfarosh fame Sunil Shende passes away, last rites to be performed today *Aleksandr Sloboda, 102, Belarusian politician, member of the Supreme Council (1991–1994).Ушел из жизни советский партийный и государственный деятель Александр Слобода *, 47, Jordanian actor. *Yun Kwan, 87, South Korean lawyer and jurist, chief justice (1993–1999).故 윤관 전 대법원장 16일 영결식…법원장으로 치러진다 *Adam Zieliński, 91, Polish lawyer and politician, president of the Supreme Administrative Court (1982–1992), MP (1989–1991) and ombudsman (1996–2000).Adam Zieliński nie żyje. „Prawdziwy erudyta, znakomity cywilista, człowiek wielkiej kultury i honoru” === 15 === *Leen Droppert, 92, Dutch visual artist.Beeldend kunstenaar Leen Droppert overleden, bekend als maker van het Geuzenmonument *Johan Hamel, 42, French football referee (Ligue 1), heart attack.LIGUE 1 REFEREE JOHAN HAMEL PASSES AWAY === 16 === *Stanley Brown, 84, Curaçao political activist (1969 Curaçao uprising) and politician (Workers' Liberation Front, C93).Stanley Brown passes away *Johannes Mendlik, 87, Dutch jurist.death announcement, NRC Handelsblad, 19 November 2022 === 17 === *Piet Buijnsters, 89, Dutch professor and book historian.Overleden: P. J. Buijnsters (18 oktober 1933-17 november 2022) === 18 === *Youssou Diagne, 84, Senegalese politician, president of the National Assembly (2001–2002).Décès de Youssou Diagne, ancien président de l’Assemblée nationale *Dwight Garner, 58, American football player (California Golden Bears, Washington Redskins), prostate cancer.Dwight Garner, Who Was Part of THE PLAY, Passes Away *Richard Johnstone, 86, New Zealand Olympic cyclist (1964).Dick Johnstone *Francis Joseph, 62, English footballer (Wimbledon, Brentford, Reading).Reading FC 1980s forward passes away aged 62 *Jean Lapointe, 86, Canadian actor (Orders, The Last Tunnel), singer and politician, senator (2001–2010).Jean Lapointe s'éteint à 86 ans *George Lois, 91, American art director (Esquire) and advertising executive, co-founder of Papert Koenig Lois.George Lois, 91, Who Brought the Counterculture to Advertising, Dies *, 36, Polish martial artist.Nie żyje Rafał Moks, znany wojownik KSW *Per Arne Olsen, 61, Norwegian politician, governor of Vestfold og Telemark (since 2019) and mayor of Tønsberg (2003–2009), cancer.Statsforvalter Per Arne Olsen er død *Ned Rorem, 99, American composer (Miss Julie, Bertha, Air Music), Pulitzer Prize winner (1976).Ned Rorem, major American composer and diarist, has died at age 99 *Paul Ssemogerere, 90, Ugandan politician, MP (1962–1971), minister of internal affairs (1985–1988) and foreign affairs (1988–1994). *Tabassum, 78, Indian actress (Manjhdhar, Pyaar Ke Do Naam: Ek Raadha, Ek Shyaam) and television host (Phool Khile Hain Gulshan Gulshan), cardiac arrest.Veteran actor Tabassum dies due to cardiac arrest *Hadar Tadmor, 41, Israeli radio broadcaster and screenwriter, cancer.Radio broadcaster Hadar Tadmor died at the age of 41 after a battle with cancer *Muhammad Rafi Usmani, 86, Pakistani Islamic scholar, mufti (since 1976) and president (since 1986) of Darul Uloom Karachi. === 19 === *Raymond Blanco, 87, American football coach and academic administrator.Raymond Blanco, former coach, dean of students, husband of Gov. Kathleen Blanco, dies at 87 *Kwesi Botchwey, 78, Ghanaian politician, minister for finance and economic planning (1982–1995). *Nico Fidenco, 89, Italian singer and composer (Bury Them Deep, Supermen Against the Orient, Black Emanuelle).Nico Fidenco, morto a Roma il compositore e cantautore: aveva 89 anni, sue sigle storiche dei cartoni *Danny Kalb, 80, American blues guitarist (The Blues Project).Danny Kalb, Lead Guitarist of NYC’s Influential Blues Project, Dies at 80 *Neil MacLean, New Zealand judge, District Court judge (1993–2014), chief coroner (2007–2015).Allan MacLean obituary (death announced on this date) *Madan, Indian film director (Aa Naluguru, Pellaina Kothalo, Gunde Jhallumandi), stroke.Tollywood: టాలీవుడ్‌లో మరో విషాదం.. సినీ దర్శకుడు మదన్ కన్నుమూత *Simon Stock Palathara, 87, Indian Syro-Malabar Catholic prelate, bishop of Jagdalpur (1993–2013).Bishop Simon Stock Palathara, C.M.I. † *Tariq Teddy, 46, Pakistani comedian and actor (Salakhain).Comedian Tariq Teddy passes away in Lahore *Daisy Tourné, 71, Uruguayan politician, MP (1995–2007, 2009–2020) and minister of the interior (2007–2009), pancreatic cancer.Murió Daisy Tourné *Tuan Tuan, 18, Chinese giant panda, euthanized.Giant Panda Tuan Tuan passes away at Taipei Zoo === 20 === *Mickey Kuhn, 90, American actor (Gone with the Wind, Red River, Broken Arrow).Mickey Kuhn, Child Actor in ‘Gone With the Wind,’ Dies at 90 *Lyudmila Storozhkova, 67, Russian athlete.Скончалась чемпионка Европы 1978 года в эстафете легкоатлетка Сторожкова === 21 === *Wilko Johnson, 75, English guitarist (Dr. Feelgood), songwriter (\"Roxette\"), and actor (Game of Thrones).Wilko Johnson dies aged 75 *Jeremy Lloyds, 68, English cricket player (Somerset, Orange Free State, Gloucestershire) and umpire.Jeremy Lloyds: Gloucestershire saddened by the death of former all-rounder and international umpire === 24 === *Klaas Justus de Vries, 62, Dutch footballer (SC Heerenveen).Voormalig speler SC Heerenveen op 62-jarige leeftijd overleden === 25 === *Héctor Bonilla, 83, Mexican actor (Rojo Amanecer, Mina, Wind of Freedom) and director.Muere el actor Héctor Bonilla, a los 83 años *Irene Cara, 63, American singer (\"Flashdance... What a Feeling\") and actress (Sparkle, Fame), Oscar winner (1983).Irene Cara, Oscar-winning singer of title tracks to 'Flashdance,' 'Fame' dies at 63, rep says *Lorg, 66, Belgian cartoonist.Disparition de Laurent Gillain alias Lorg === 26 === *Henrie Adams, 68, Dutch conductor.Fallece el director de la Orquesta Sinfónica de Castelló, Henrie Adams *David Murray, 72, Barbadian cricketer (West Indies, national team).Former Caribbean wicketkeeper-batter David Murray passes away *Frank Decerf, 64, Belgian writer and poet.Dichter Frank Decerf (64) overleden *Emiel Meeus, 93, Belgian politician.Looise ereburgemeester Emiel Meeus overleden: “Politiek was zijn passie” *Albert Pyun, 69, American film director (The Sword and the Sorcerer, Cyborg, Captain America), complicatioms from dementia.Albert Pyun, Cult Filmmaker Behind ‘Cyborg,’ ‘Nemesis’ and ‘Captain America,’ Dies at 69 *Doddie Weir, 52, Scottish rugby union player (Newcastle Falcons, Border Reivers, national team), complications from amyotrophic lateral sclerosis.Doddie Weir: Former Scotland lock dies at 52 after motor neurone disease battle === 27 === *Richard Baawobr, 63, Ghanaian Roman Catholic cardinal, bishop of Wa (since 2016) and superior general of the White Fathers (2010–2016).Morto all'improvviso nel pomeriggio a Roma il Cardinale ghanese Richard Baawobr *Gábor Csapó, 72, Hungarian water polo player, Olympic champion (1976), respiratory failure.Meghalt Csapó Gábor olimpiai bajnok vízilabdázó *Gerwin Hoekstra, 30, Dutch organist.Organist Gerwin Hoekstra (30) overleden *Brian Hogan, 74, English rugby league player (St Helens, Wigan, national team).Former Wigan Warriors and St Helens Brian Hogan legend passes away at 74 *Dame Clare Marx, 68, British surgeon, president of the Royal College of Surgeons of England (2014–2017), pancreatic cancer.Former RCS England President Dame Clare Marx has passed away (death announced on this date) *Mick Meagan, 88, Irish football player (Everton, Huddersfield Town, national team) and manager.RIP, Mick Meagan *Monty's Pass, 29, Irish racehorse.Monty's Pass, the oldest living Grand National winner, dies aged 29 (death announced on this date) *Maurice Norman, 88, English footballer (Tottenham Hotspur, Norwich City, national team).Obituary: Maurice Norman *Yoichi Sai, 73, Japanese film director (A Sign Days, All Under the Moon, Blood and Bones) and screenwriter, bladder cancer.映画監督の崔洋一さんが死去 在日コリアン作品、「血と骨」 *Sir Allan Wright, 93, New Zealand farming leader, businessman and sports administrator, president of Federated Farmers (1977–1981), chancellor of Lincoln University (1990–1994). === 28 === *Nawawi Ahmad, 61, Malaysian politician, MP (2013–2018) and Kedah MLA (2004–2013).Former Langkawi MP Nawawi Ahmad passes away *Rajko Petrov Nogo, 77, Serbian poet and essayist.Preminuo Rajko Petrov Nogo *Frank Rankmore, 83, Welsh footballer (Peterborough United, Northampton Town, national team).Cobblers pay tribute as former player Frank Rankmore dies (death announced on this date) *Dragan Samardžić, 76, Yugoslavian football goalkeeper (Willem II).Oud-Willem II- keeper Samardzic overleden: ‘Een charmante man met wat showwerk’ === 29 === *Peter Diepenhorst, 80, Dutch politician, mayor of Domburg (1975-1987) and Maartensdijk (1987-2001).death announcement *Lout Donders, 68, Dutch journalist and television program creator.Journalist Lout Donders (68) onverwacht overleden: 'Brabant gaat hem missen' *, 87, German architect (Berlin Tegel Airport, Berlin Hauptbahnhof).German architect von Gerkan, who designed Berlin airport, dies at 87 *Derek Granger, 101, British film and television producer, and screenwriter (Brideshead Revisited, A Handful of Dust, Where Angels Fear to Tread).Derek Granger, ‘Brideshead Revisited’ Writer and Producer, Dies at 101 *Hilkka Hakola, 88, Finnish basketball player (national team), Hall of Fame, Player of the Year (1956).EM-korikuningatar Hilkka Hakola on poissa *Jos Huypens, 74, Belgian journalist, editor-in-chief of Gazet van Antwerpen (1991-1996).Oud-hoofdredacteur Jos Huypens (74) overleden *Toon Pfaff, 70, Belgian footballer (K.S.K. Beveren).Toon Pfaff, gewezen speler van Beveren en broer van Jean-Marie, overleden op 70-jarige leeftijd: “Supersub die cruciale doelpunten scoorde” === 30 === *Sir Murray Halberg, 89, New Zealand Olympic athlete. *Christiane Hörbiger, 84, Austrian actress (The Major and the Bulls, Das Erbe der Guldenburgs, Julia – Eine ungewöhnliche Frau).Schauspiellegende Christiane Hörbiger gestorben *Jiang Zemin, 96, Chinese politician, general secretary of the Communist Party (1989–2002) and president (1993–2003), mayor of Shanghai (1985–1988), leukemia and multiple organ failure.Former Chinese president Jiang Zemin dies at 96 *Christine McVie, 79, English musician (Fleetwood Mac).Christine McVie, Fleetwood Mac singer-songwriter, dies aged 79 ==References== *11 Category:November 2022 events",
 "title": "Deaths in November 2022"
}