{
 "id": "892109",
 "text": "The following is a list of deaths that happened in April 2022. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known), and a source. ==April== ===1=== *Andrei Babitsky, 57, Russian journalist (RFE/RL), cardiac arrest. *Alberto Estella Goytre, 81, Spanish politician, Deputy (1977–1982).Fallece a los 81 años el abogado, político y escritor Alberto Estella *Petre Ivănescu, 85, Romanian handball player (Dinamo București, national team) and manager (TUSEM Essen), colon cancer.Petre Ivănescu ist tot *Maks Levin, 40, Ukrainian photojournalist (Reuters, BBC), shot. (body discovered on this date) *Jolanta Lothe, 79, Polish actress (Hunting Flies, The Cruise, The Deluge).Nie żyje aktorka Jolanta Lothe. Znana z serialu \"Barwy szczęścia\" i filmu \"Potop\" *C. W. McCall, 93, American country singer-songwriter (\"Convoy\", \"'Round the World with the Rubber Duck\", \"Roses for Mama\"), activist and politician, Mayor of Ouray, Colorado (1986–1992), lung cancer. *Gerhard J. Woeginger, 57, Austrian mathematician. *Aleksandra Yakovleva, 64, Russian actress (Air Crew, Charodei, A Man from the Boulevard des Capucines) and businesswoman, breast cancer.Умерла актриса Александра Яковлева ===2=== *Vance Amory, 72, Saint Kitts and Nevis politician and cricketer (Leeward Islands, Combined Islands), Premier of Nevis (1992–2006, 2013–2017). *Joseph A. Diclerico Jr., 81, American politician and lawyer, Judge (since 1992) and Chief Judge (1992–1997) for the U.S. District Court for New Hampshire. *Sir Robin Gray, 90, New Zealand politician, member (1978–1996) and Speaker of the House of Representatives (1990–1993). *Estelle Harris, 93, American actress (Seinfeld, Toy Story, The Suite Life of Zack & Cody). *Javier Imbroda, 61, Spanish basketball coach (Liga ACB) and politician, member of the Andalusian Parliament (since 2018) and Regional Minister of Culture and Sports (since 2019), prostate cancer.Muere Javier Imbroda a los 61 años: consejero de Educación de Andalucía e histórico del baloncesto *Silvio Longobucco, 70, Italian footballer (Ternana, Juventus, Cagliari).Addio a Longobucco, ex difensore della Juve e del Cagliari *Mıgırdiç Margosyan, 83, Turkish-Armenian writer.Mıgırdiç Margosyan hayatını kaybetti *Leonel Sánchez, 85, Chilean footballer (Universidad de Chile, Colo-Colo, national team) and manager, pulmonary fibrosis.Muere Leonel Sánchez, leyenda de la Roja e ícono del 'Ballet Azul' ===3=== *June Brown, 95, English actress (EastEnders, The Duchess of Duke Street, Bean) and writer. *Tommy Davis, 83, American baseball player (Los Angeles Dodgers, Baltimore Orioles, Oakland Athletics) and coach, World Series champion (1963). *Lygia Fagundes Telles, 103, Brazilian writer, member of the Brazilian Academy of Letters (since 1985).Escritora Lygia Fagundes Telles morre aos 98 anos em SP *Einar Østby, 86, Norwegian cross- country skier, Olympic silver medalist (1960).Einar Østby, sørfylkets beste skiløper er død *Stan Parrish, 75, American football coach (Tampa Bay Buccaneers, Ball State Cardinals, Michigan Wolverines). *Pamela Rooke, 66, British model and actress, bile duct cancer. *Gerda Weissmann Klein, 97, Polish-American Holocaust survivor, writer and human rights activist. ===4=== *Eric Boehlert, 57, American media critic and writer (Salon, Rolling Stone, Billboard), bicycle hit by train. *Madeline Cain, 72, American politician, member of the Ohio House of Representatives (1989–1995) and Mayor of Lakewood, Ohio (1996–2003). *Karine Danielyan, 74, Armenian politician and environmentalist, Minister of Nature and Environment Protection (1991–1994).Скончалась Карине Даниелян (death announced on this date) *Francisco González, 68, American rock musician (Los Lobos), cancer. (death announced on this date) *John McNally, 89, Irish boxer, Olympic silver medalist (1952). *Joe Messina, 93, American Hall of Fame soul guitarist (The Funk Brothers). *Django Sissoko, 74, Malian politician, Minister of Justice (1984–1988) and Acting Prime Minister (2012–2013).Le Mali en deuil: L’ancien premier ministre Diango Cissoko n’est plus! *Gene Shue, 90, American basketball player (Fort Wayne/Detroit Pistons, New York Knicks) and coach (Baltimore/Washington Bullets), melanoma. *Petar Skansi, 78, Croatian basketball player (Jugoplastika, Yugoslavia national team) and coach (Benetton Treviso), Olympic silver medalist (1968).Preminuo Petar Skansi *Branislav Šoškić, 99, Montenegrin politician and economist, President (1985–1986).Preminuo akademik Branislav Šoškić *Jerry Uelsmann, 87, American photographer. *Jennifer Wilson, 89, British actress (The Brothers, Casualty, Coronation Street). (death announced on this date) ===5=== *Sidney Altman, 82, Canadian-American molecular biologist, Nobel Prize winner (1989). *Boris Brott, 78, Canadian conductor, composer and motivational speaker, founder of the National Academy Orchestra of Canada, hit by a car. *Joaquim Carvalho, 84, Portuguese footballer (Sporting CP, Atlético, national team).Sporting de luto por Joaquim Carvalho *John Ellis, 73, American baseball player (New York Yankees, Cleveland Indians, Texas Rangers), cancer. *Graciela Giannettasio, 71, Argentine politician, Minister of Education (2002–2003), Vice Governor of Buenos Aires (2003–2007) and Deputy (2007–2015).Murió la ex vicegobernadora bonaerense Graciela Giannettasio *David Kilgour, 81, Canadian politician, political writer and human rights activist, MP (1979–2006), Deputy Speaker of the House of Commons (1994–1997) and Secretary of State (1997–2003), lung disease. *Stanisław Kowalski, 111, Polish masters athlete and supercentenarian, nation's oldest living man (since 2018).Stanisław Kowalski nie żyje. Najstarszy mężczyzna w Polsce za kilka dni skończyłby 112 lat *Josef Panáček, 84, Czech sport shooter, Olympic champion (1976).Zemřel Josef Panáček, olympijský vítěz z Montrealu 1976 *Nehemiah Persoff, 102, American actor (Some Like It Hot, An American Tail, Yentl) and artist, heart failure. *Bobby Rydell, 79, American rock singer (\"Wild One\", \"Wildwood Days\") and actor (Bye Bye Birdie), pneumonia. *Yefrem Sokolov, 95, Belarusian politician, First Secretary of the Communist Party (1987–1990).Умер один из последних глав БССР (death announced on this date) *Bjarni Tryggvason, 76, Icelandic-born Canadian astronaut. *Jimmy Wang Yu, 79, Taiwanese actor (Golden Swallow, One- Armed Swordsman, The Chinese Boxer), martial artist and filmmaker, problems caused by a stroke.“独臂刀王”王羽今晨病逝享寿80岁 ===6=== *Rae Allen, 95, American actress (And Miss Reardon Drinks a Little, A League of Their Own, Stargate), Tony winner (1971). *John Creighton, 85, New Zealand rugby union player (Canterbury, national team). *Reinhilde Decleir, 73, Belgian actress (Doctor Vlimmen, Whitey, Love Belongs to Everyone), euthanasia.Reinhilde Decleir (73) overleden: bekijk haar grootste rollen, van \"Van vlees en bloed\" tot bezieler Tutti Fratelli *Karol Divín, 86, Hungarian-born Slovak-Czech figure skater, Olympic silver medalist (1960).Zemřel elegán na ledě! Stříbrnému olympionikovi Divínovi bylo 86 let *Ana Derșidan-Ene-Pascu, 77, Romanian fencer, Olympic bronze medalist (1968, 1972).Fosta mare scrimeră Ana Pascu a încetat din viață la vârsta de 77 de ani *Jill Knight, 98, British politician, MP (1966–1997) and member of the House of Lords (1997–2016). *David McKee, 87, British children's writer and illustrator (Elmer the Patchwork Elephant, Not Now, Bernard). *Domingo Romera, 85, Spanish politician, Senator (1984–1986) and MEP (1986–1994). Excm Sr Domènec Romera I Alcázar *Tom Smith, 50, Scottish rugby union player (Northampton Saints, national team, British & Irish Lions), colorectal cancer. *Vladimir Zhirinovsky, 75, Russian politician, Leader of the Liberal Democratic Party (since 1992) and MP (since 1993), problems caused by COVID-19. ===7=== *Garibaldi Alves, 98, Brazilian politician, Rio Grande do Norte MLA (1957–1969) and Senator (2011–2014).Morre Garibaldi Alves, pai do ex-governador Garibaldi Filho *Carlos Barrera Sánchez, 71, Spanish politician, Síndic d'Aran (1995–2007, 2015–2019), cancer.Muere el exsíndic de la Val d'Aran (Lleida) Carlos Barrera a los 71 años *Shamsha Berkimbayeva, 79, Kazakh academic and politician, Minister of Education and Science (2002–2003).Ғалым Шәмшә Беркімбаева дүние салды *Dušan Čkrebić, 94, Serbian politician, Prime Minister (1974–1978) and President (1984–1986).Preminuo Dušan Čkrebić, nekadašnji predsednik Predsedništva Srbije *Ludwik Dorn, 67, Polish politician, MP (1997–2015), Deputy Prime Minister (2005–2007) and Marshal of the Sejm (2007).Ludwik Dorn nie żyje. Były wicepremier i marszałek Sejmu miał 67 lat *Miguel Ángel Estrella, 81, Argentine pianist and human rights activist, Ambassador to the UNESCO (2003–2015) and member of the Russell Tribunal.Murió en Francia el gran pianista argentino Miguel Ángel Estrella, exembajador en la Unesco *Fujiko A. Fujio, 88, Japanese manga artist (Doraemon, Ninja Hattori-kun, The Monster Kid). *Michael Neidorff, 79, American businessman, CEO of Centene Corporation (since 1996). *Jürgen Reents, 72, German politician and journalist, member of the Bundestag (1983–1985).Langjähriger \"nd\"-Chefredakteur und Ex-Grünen-Politiker Jürgen Reents gestorben *Arliss Sturgulewski, 94, American politician, member of the Alaska Senate (1979–1993). *Rayfield Wright, 76, American Hall of Fame football player (Dallas Cowboys), Super Bowl champion (1972, 1978), problems caused by dementia. ===8=== *Minori Matsushima, 81, Japanese actress (Candy Candy, Dororo, Mazinger Z), pancreatic cancer. *Peng Ming-min, 98, Taiwanese independence activist and politician, Presidential Senior Advisor (2000–2006), 1996 presidential candidate. *José Vilariño, 60, Argentine engineer and politician, Deputy (1995–1999, 2003–2015), cardiac arrest.José Vilariño: el adiós a un destacado político y armador salteño ===9=== *Chris Bailey, 65, Kenyan-born Australian singer-songwriter (\"(I'm) Stranded\", \"Just Like Fire Would\"), punk rock guitarist (The Saints) and record producer.Chris Bailey, lead singer of The Saints, dies *Uwe Bohm, 60, German actor (Moritz, Dear Moritz, Yasemin, Herzlich willkommen), possible heart attack.»Tatort«-Schauspieler Uwe Bohm »plötzlich und unerwartet« gestorben *Michael Degen, 90, German-Israeli actor (Supermarket, Beyond Good and Evil, Dr. M) and Holocaust survivor.Schauspieler Michael Degen gestorben *Michel Delebarre, 75, French politician, Mayor of Dunkirk (1989–2014) and Senator (2011–2017), problems caused by diabetes.Mort de Michel Delebarre, ancien maire de Dunkerque et ministre à plusieurs reprises *Dwayne Haskins, 24, American football player (Pittsburgh Steelers, Washington Football Team), hit by a car. *Jack Higgins, 92, British writer (The Eagle Has Landed, Thunder Point, Angel of Death). *Romà Mas, 70, Andorran politician, Deputy Mayor of Escaldes-Engordany (1995–2003).L'excònsol menor d'Escaldes Romà Mas mor als 70 anys ===10=== *Philippe Boesmans, 85, Belgian composer.Le compositeur Philippe Boesmans est mort *John Drew, 67, American basketball player (Atlanta Hawks, Utah Jazz), bone cancer. *Chiara Frugoni, 82, Italian historian and academic.Morta Chiara Frugoni, indagatrice del Medioevo *Hazem Nuseibeh, 99, Jordanian politician, Minister of Foreign Affairs (1962–1965) and Permanent Representative to the United Nations (1976–1985). *Estela Rodríguez, 54, Cuban judoka, Olympic silver medalist (1992, 1996), cardiac arrest.Falleció la destacada judoca cubana Estela Rodríguez ===11=== *Oleksandr Bakumenko, 62, Ukrainian politician, Deputy (2014–2019).Помер колишній нардеп Олександр Бакуменко *Garrett Burnett, 46, Canadian ice hockey player (Mighty Ducks of Anaheim). *Mohammad Feyz Sarabi, 93, Iranian Islamic cleric and politician, member of the Assembly of Experts (since 2006).نماینده آذربایجان شرقی در مجلس خبرگان رهبری درگذشت *Eduardo Guardia, 56, Brazilian economist, businessman and politician, Minister of Finance (2018–2019). (death announced on this date) *Gábor Görgey, 92, Hungarian politician, novelist and poet, Minister of Culture (2002–2003).Meghalt Görgey Gábor *Joe Horlen, 84, American baseball player (Chicago White Sox, Oakland Athletics), World Series champion (1972), problems caused by Alzheimer's disease. *Mohammad Hussain, 45, Pakistani cricketer (national team), problems caused by kidney disease. *Hans Junkermann, 87, German racing cyclist.Trauer um Hennes Junkermann *Charnett Moffett, 54, American jazz bassist, heart attack. ===12=== *Sonny Caldinez, 89, Trinidadian actor (Doctor Who, The Fifth Element, Raiders of the Lost Ark). *Gilbert Gottfried, 67, American comedian and actor (Aladdin, Cyberchase, Problem Child), ventricular tachycardia caused by myotonic dystrophy. *Larysa Khorolets, 73, Ukrainian actress and politician, Minister of Culture (1991–1992).Умерла первая министр культуры независимой Украины Лариса Хоролец *Shirley Spork, 94, American professional golfer, co-founder of the LPGA. *Irina Vorobieva, 63, Russian Olympic pair skater (1976).Ушла из жизни прославленная советская фигуристка Ирина Воробьева *Sergei Yashin, 60, Russian ice hockey player (Dynamo Moscow, EC Wilhelmshaven-Stickhausen, national team), Olympic champion (1988).Умер Сергей Яшин ===13=== *Letizia Battaglia, 87, Italian photographer and photojournalist.Morta fotoreporter Letizia Battaglia *Michel Bouquet, 96, French actor (The Unfaithful Wife, The Bride Wore Black, Toto the Hero).Légende du théâtre et du cinéma français, Michel Bouquet est mort à l'âge de 96 ans *Wolfgang Fahrian, 80, German footballer (Hertha BSC, Fortuna Köln, West Germany national team), pneumonia.Torhüter und Spielerberater Wolfgang Fahrian gestorben *Alex Gilady, 79, Iranian-born Israeli sports journalist and IOC official, cancer. *Josef Göppel, 71, German politician, member of the Bundestag (2002–2017), problems caused by kidney disease.CSU-Umweltpolitiker Josef Göppel gestorben *Lennart Hegland, 79, Swedish musician (Hep Stars).Legendaren Lennart ”Lelle” Hegland är död *Maurice Lévy, 99, French physicist and educator, President of the CNES (1973–1976).Le physicien français Maurice Lévy est décédé à l'âge de 99 ans *Freddy Rincón, 55, Colombian footballer (Corinthians, Real Madrid, national team), head injuries from car crash. *Desai Williams, 62, Saint Kitts and Nevis-born Canadian sprinter, Olympic bronze medalist (1984). (death announced on this date) ===14=== *Roberto Bendini, 76, Argentine Army general, Chief of the General Staff of the Army (2003–2008), pancreatic cancer. *Mike Bossy, 65, Canadian Hall of Fame ice hockey player (New York Islanders), four- time Stanley Cup champion, lung cancer. *Ilkka Kanerva, 74, Finnish politician, MP (since 1975), Minister of Labour (1991–1995) and Deputy Prime Minister (1991).Ilkka Kanerva on kuollut *Kōji Omi, 89, Japanese politician, MP (1983–2009) and Minister of Finance (2006–2007), pneumonia.尾身幸次さん死去 元財務相、群馬1区 ===15=== *Newton Cruz, 97, Brazilian Army general and politician.General Newton Cruz, ex-chefe do SNI na ditadura militar, morre no Rio aos 97 anos *Earl Devaney, 74, American police officer and politician, Inspector General of the U.S. Department of the Interior (1999–2011). *Bilquis Edhi, 74, Pakistani nurse and humanitarian, heart failure. *Jean-Paul Fitoussi, 79, French economist, academic and sociologist.Addio all’economista Jean-Paul Fitoussi: avrebbe compiuto 80 anni il 19 agosto *Bernhard Germeshausen, 70, German bobsledder, Olympic champion (1976, 1980). *Eunice Muñoz, 93, Portuguese actress (A Morgadinha dos Canaviais, Hard Times, Ilha dos Amores), problems caused by thyroid cancer.Morreu Eunice Muñoz. A estrela maior do teatro português tinha 93 anos *Michael O'Kennedy, 86, Irish politician, TD (1965–2002), Minister for Foreign Affairs (1977–1979) and Finance (1979–1980). *Henry Plumb, Baron Plumb, 97, British politician, Member (1979–1999) and President (1987–1989) of the European Parliament and member of the House of Lords (1987–2017). *Art Rupe, 104, American Hall of Fame music executive and record producer (Specialty Records). *Liz Sheridan, 93, American actress (Seinfeld, ALF, Play the Game) and dancer. *Kantoku Teruya, 76, Japanese politician, MP (1995–2001, 2003–2021), stomach cancer.前衆院議員の照屋寛徳さん死去 76歳、衆参合わせ国会議員24年 ===16=== *Rosario Ibarra, 95, Mexican social activist and politician, Deputy (1985–1988, 1994–1997) and Senator (2006–2012).Fallece Rosario Ibarra de Piedra, fundadora del Comité ¡Eureka! *Gloria Sevilla, 90, Filipino actress (Bida si Mister, Bida si Misis, Once Upon a Time in Manila, Boy Golden: Shoot to Kill). *Joachim Streich, 71, German footballer (Hansa Rostock, 1. FC Magdeburg, East Germany national team) and manager, Olympic bronze medalist (1972), myelodysplastic syndrome.Trauer in MV: Fußball-Legende Joachim Streich aus Wismar ist tot *Sir Ray Tindle, 95, British businessman, founder of Tindle. *Jon Wefald, 84, American academic administrator, President of Kansas State University (1986–2009), heart attack. ===17=== *Mireya Baltra, 90, Chilean sociologist, journalist and politician, Deputy (1969–1973) and Minister of Labor (1972).Fallece Mireya Baltra, ex ministra del Trabajo del gobierno de Salvador Allende *Radu Lupu, 76, Romanian pianist, Grammy winner (1996).Radu Lupu pianist l'indicible s'est tu *Kevin Meates, 92, New Zealand rugby union player (Canterbury, national team). *Catherine Spaak, 77, Belgian- Italian actress (Kiss the Other Sheik, Il Sorpasso, Adultery Italian Style), model and singer, problems caused by a cerebral hemorrhage.Morta Catherine Spaak, aveva 77 anni ===18=== *Lidiya Alfeyeva, 76, Russian long jumper, Olympic bronze medalist (1976).Умерла призёрка Олимпийских игр 1976 года Лидия Алфеева *Sir Harrison Birtwistle, 87, British composer (The Triumph of Time, The Mask of Orpheus, The Minotaur), problems caused by a stroke. *Valerio Evangelisti, 69, Italian novelist (Il castello di Eymerich).Addio a Valerio Evangelisti, la penna del fantasy italiano *Michel Goma, 90, French fashion designer, Director of Balenciaga (1987–1992).Lot-et-Garonne : Michel Goma, couturier célèbre et enfant du pays, s’est éteint *Andrzej Korzyński, 82, Polish composer (Man of Marble, The Birch Wood, Possession) and pianist.Nie żyje Andrzej Korzyński. Słynny kompozytor, twórca muzyki filmowej. Miał 82 lata *Hermann Nitsch, 83, Austrian artist (Viennese Actionism).È morto Hermann Nitsch, padre dell'Azionismo viennese *Pedro Pinto Rubianes, 91, Ecuadorian politician, Minister of Finance (1982–1984), MP (1998–2000) and Vice President (2000–2003).Pedro Pinto Rubianes falleció a los 91 años *Rein Ratas, 83, Estonian politician, MP (2007–2011, 2015–2018).Suri endine riigikogu liige Rein Ratas *Norman Surplus, 59, Northern Irish adventurer, first person to travel around the world in an autogyro. *Vyacheslav Trubnikov, 77, Russian intelligence officer and politician, Director of the Foreign Intelligence Service (1996–2000) and Ambassador to India (2004–2009).Умер бывший директор СВР Вячеслав Трубников ===19=== *Brad Ashford, 72, American politician and lawyer, member of the Nebraska Legislature (1987–1995, 2007–2015) and U.S. House of Representatives from Nebraska's 2nd congressional district (2015–2017), brain cancer. *Gert Hekma, 70, Dutch anthropologist and sociologist.In Memoriam: Gert Hekma *Rolando Hinojosa-Smith, 93, American novelist, essayist and poet. *Mosharraf Hossain, 40, Bangladeshi cricketer (Dhaka Division, Khulna Tigers, national team), brain cancer. *Carlos Lucas, 91, Chilean boxer, Olympic bronze medalist (1956).Fallece Carlos Lucas Manríquez, ex medallista olímpico en Melbourne 1956 *Sandra Pisani, 63, Australian field hockey player (women's national team), Olympic champion (1988), cancer. *Kane Tanaka, 119, Japanese supercentenarian, world's oldest person (since 2018).「世界最高齢」の田中カ子さん死去 1903年生まれ、119歳 *Freeman Williams, 65, American basketball player (San Diego Clippers, Atlanta Hawks, Utah Jazz). ===20=== *Hilda Bernard, 101, Argentine actress (Vení conmigo, Rebelde Way, Floricienta).Murió la actriz Hilda Bernard *Ian Brooks, 93, New Zealand politician, MP (1970–1975). *Gloria Gervitz, 79, Mexican poet and translator.la poeta y traductora, Gloria Gervitz *Guitar Shorty, 87, American blues guitarist. *Antonín Kachlík, 99, Czech movie director (Já, truchlivý bůh, Princ Bajaja) and screenwriter.Zemřel režisér Antonín Kachlík, natočil trezorové i prorežimní filmy *Javier Lozano Barragán, 89, Mexican Roman Catholic cardinal, Bishop of Zacatecas (1984–1997) and President of the PCHCW (1996–2009), problems caused by a bowel obstruction.El cardenal Javier Lozano Barragán ha fallecido esta mañana en Roma *Robert Morse, 90, American actor (How to Succeed in Business Without Really Trying, Where Were You When the Lights Went Out?, Mad Men) and singer, Tony (1962, 1990) and Emmy (1993) winner, heart failure. *Erwina Ryś-Ferens, 67, Polish Olympic speed skater (1976, 1980, 1984, 1988) and politician.Nie żyje Erwina Ryś-Ferens. Miała 67 lat ===21=== *Renate Holm, 90, German-Austrian actress (The Big Star Parade, Love, Girls and Soldiers, The Count of Luxemburg) and operatic soprano.Opernstar Renate Holm mit 90 Jahren gestorben *Mwai Kibaki, 90, Kenyan politician, MP (1974–2013), Vice President (1978–1988) and President (2002–2013). *Jacques Perrin, 80, French actor (The Sleeping Car Murders, Z) and filmmaker (Black and White in Color).Mort de Jacques Perrin, comédien et chevalier blanc de la production indépendante *Cynthia Plaster Caster, 74, American artist. *Jack Rutherford, 92, Australian cricketer (Western Australia, national team). *J. D. Rymbai, 87, Indian politician, Meghalaya MLA (1983–1988, 1993–2008) and Chief Minister of Meghalaya (2006–2007). *Ronald J. Zlatoper, 80, American Navy officer, Commander, U.S. Pacific Fleet (1994–1996). ===22=== *Guy Lafleur, 70, Canadian Hall of Fame ice hockey player (Montreal Canadiens, Quebec Nordiques, New York Rangers), five-time Stanley Cup champion, lung cancer. *Michelle Suárez Bértora, 39, Uruguayan lawyer, politician and trans activist, Senator (2014–2017), heart attack.Falleció Michelle Suárez, la primera senadora trans en la historia del Uruguay *Pedrie Wannenburg, 41, South African rugby union player (Ulster, Oyonnax, national team), car crash. *Viktor Zvyahintsev, 71, Ukrainian footballer (Shakhtar Donetsk, Soviet Union national team), Olympic bronze medalist (1976). ===23=== *Arno, 72, Belgian rock singer-songwriter (TC Matic) and actor (Camping Cosmos), pancreatic cancer.Arno Hintjens overleden op 72-jarige leeftijd: “Hij zal bij ons blijven door de muziek die hem tot het einde in leven hield” *Carmelo Borobia, 86, Spanish Roman Catholic prelate, Auxiliary Bishop of Zaragoza (1990–1996) and Toledo (2004–2010) and Bishop of Tarazona (1996–2004).Muere Carmelo Borobia, el que fuera obispo auxiliar de Zaragoza e impulsor de las obras de la catedral de Tarazona *Enoch Kelly Haney, 81, American sculptor, painter, and politician, member of the Oklahoma House of Representatives (1980–1986), State Senate (1986–2002) and Chief of the Seminole Nation of Oklahoma (2005–2009). *Orrin Hatch, 88, American lawyer and politician, U.S. Senator from Utah (1977–2019) and President pro tempore of the U.S. Senate (2015–2019), 2000 presidential candidate, problems caused by a stroke. ===24=== *Freddy Hall, 37, Bermudian footballer (Telford United, Limerick, national team), car crash. *Dimpal Kumari Jha, 42, Nepalese politician, MP (2013–2017) and Madhesh Province MPA (since 2018), colon cancer. *Josep Massot, 80, Spanish monk, historian and philologist.Mor Josep Massot i Muntaner, filòleg, historiador i activista de la cultura catalana *K. Sankaranarayanan, 89, Indian politician, Governor of Nagaland (2007–2008), Jharkhand (2009–2010) and Maharashtra (2010–2014), problems caused by a stroke. *Ronald R. Van Stockum, 105, American Marine Corps brigadier general. *Collin Williams, 60, Zimbabwean cricketer (Matabeleland). ===25=== *Hannes Adomeit, 79, German political scientist.Nachruf: Hannes Adomeit, PhD *Ursula Lehr, 91, German researcher, academic and politician, Minister of Family Affairs (1989–1991) and member of the Bundestag (1990–1991).Ursula Lehr ist gestorben *Hossein Mollaghasemi, 89, Iranian Olympic wrestler (1960, 1964), World Championship silver medalist (1957). *J. Roy Rowland, 96, American politician, member of the Georgia House of Representatives (1976–1982) and member of the U.S. House of Representatives from the 8th congressional district (1983–1995). *Henny Vrienten, 73, Dutch ska singer-songwriter, bassist and composer (Doe Maar).Henny Vrienten overleden *Andrew Woolfolk, 71, American Hall of Fame saxophonist (Earth, Wind & Fire). *Shane Yellowbird, 42, Canadian country singer-songwriter, problems caused by epilepsy. ===26=== *Daniel Dolan, 70, American Catholic sedevacantist prelate, Bishop of West Chester Township, Ohio (since 1993). *İsmail Ogan, 89, Turkish freestyle wrestler, Olympic champion (1964), multiple organ failure. *Klaus Schulze, 74, German electronic musician (Tangerine Dream, Ash Ra Tempel, The Cosmic Jokers), composer and record producer. ===27=== *Carlos Amigo Vallejo, 87, Spanish Roman Catholic cardinal, Archbishop of Tanger (1973–1982) and Seville (1982–2009), heart failure caused by pulmonary edema-related surgery.Muere el cardenal Carlos Amigo Vallejo *Carlos García Cambón, 73, Argentine footballer (Chacarita Juniors, Boca Juniors, Unión de Santa Fe), problems caused by a ruptured abdominal aortic aneurysm. *Judy Henske, 85, American folk singer- songwriter (\"High Flying Bird\"). *Nikolai Leonov, 93, Russian KGB officer and politician, Deputy (2003–2007).Умер экс-начальник аналитического управления КГБ разведчик Николай Леонов *Liao Guoxun, 59, Chinese politician, delegate to the NPC (2008–2013, since 2017) and Mayor of Tianjin (since 2020).廖国勋同志因突发疾病离世 *Bernard Pons, 95, French politician and physician, Minister of Transport (1995–1997) and MP (1997–2002).Bernard Pons, ancien ministre et secrétaire général du RPR, est mort *Kenneth Tsang, 86, Hong Kong actor (A Better Tomorrow, The Killer, Once a Thief).演员曾江在酒店突然去世 死因有待确定 ===28=== *Neal Adams, 80, American comics artist (Batman, Superman vs. Muhammad Ali, Green Lantern), problems caused by sepsis. *Juan Diego, 79, Spanish actor (The Dumbfounded King, Go Away from Me, Los hombres de Paco), Goya winner (1991, 1999, 2006).Muere el actor Juan Diego a los 79 años *Jean- Claude Fruteau, 74, French politician, MEP (1999–2007), Deputy (2007–2017) and Mayor of Saint-Benoît, Réunion (since 2008).Figure de la politique locale, Jean-Claude Fruteau, ancien maire de Saint-Benoît est décédé *Fernando Sáenz Lacalle, 89, Spanish Roman Catholic prelate, Archbishop of San Salvador (1995–2008).Muere arzobispo emérito Fernando Sáenz Lacalle *Zoran Sretenović, 57, Serbian basketball player (Jugoplastika, Borovica, Stal Ostrów Wielkopolski) and coach, heart attack. ===29=== *Erich Barnes, 86, American football player (Chicago Bears, New York Giants, Cleveland Browns). *Joanna Barnes, 87, American actress (Auntie Mame, Tarzan, the Ape Man, The Parent Trap) and writer. *Georgia Benkart, 74, American mathematician, lung cancer. *David Birney, 83, American actor (St. Elsewhere, Bridget Loves Bernie, Oh, God! Book II) and stage director, problems caused by Alzheimer's disease. *Peter Moore, 78, American graphic designer and shoe designer (Air Jordan). *Indira Rajan, 78, Indian dancer. *Nader Talebzadeh, 68, Iranian movie director (The Messiah), producer and researcher, heart failure.نادر طالب‌زاده درگذشت ===30=== *Allister Adel, 45, American lawyer and politician, County Attorney of Maricopa County, Arizona (2019–2022), problems caused by a thrombus. *Ricardo Alarcón, 84, Cuban politician, Minister of Foreign Affairs (1992–1993) and President of the National Assembly of People's Power (1993–2013).Falleció en Cuba Ricardo Alarcón *Frank J. Anderson, 83–84, American police officer, Sheriff of Marion County, Indiana (2003–2011). *Ron Galella, 91, American paparazzo, congestive heart failure.Ron Galella, Celebrity-Hounding Photographer, Dies at 91 *Naomi Judd, 76, American Hall of Fame country singer-songwriter (The Judds) and actress (A Holiday Romance, The Killing Game), suicide. *Bob Krueger, 86, American politician, member of the U.S. House of Representatives from Texas's 21st congressional district (1975–1979), U.S. Senator (1993) and Ambassador to Botswana (1996–1999). *Abul Maal Abdul Muhith, 88, Bangladeshi writer, economist and politician, Minister of Finance (2009–2019) and MP (2009–2018). *Mino Raiola, 54, Italian football agent, problems caused by lung disease. *Ülo Tulik, 64, Estonian agronomist and politician, Governor of Võru County (2005–2010) and Mayor of Võru (2010–2011).Suri Ülo Tulik ==Months== * January * February * March ==Related pages== * List of deaths due to COVID-19 * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 * Deaths in 2020 * Deaths in 2021 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *04 Category:April 2022 events",
 "title": "Deaths in April 2022"
}