{
 "id": "892166",
 "text": "Each of the 14 regions of Namibia is divided into electoral constituencies. The size of the constituencies changes with the size and population of each region. There are currently 121 constituencies in Namibia. The most populous constituency was Rundu Urban in the Kavango West region with 63,431 people; the least populous was Okatyali in the Oshana region with 3,187 people. Local councillors are directly elected through regional elections by residents of the constituencies. Councillors occupy a constituency office in the main settlement of their region. Councillors keep their full-time job and are expected to run their constituencies. Councillors receive allowances similar to a mid-range salary. Regional councillors are indirectly elected from and by the constituency councillors in each region. Each region sends three of their local councillors to represent their region in the National Council of Namibia. == List of constituencies by region == Zambezi Judea Lyaboloma Kabbe North Kabbe South Katima Mulilo Rural Katima Mulilo Urban Kongola Linyanti Sibbinda Erongo Arandis Dâures Karibib Omaruru Swakopmund Walvis Bay Rural Walvis Bay Urban Hardap Aranos Daweb Gibeon Mariental Rural Mariental Urban Rehoboth Rural Rehoboth Urban East Rehoboth Urban West ǁKaras Berseba Karasburg East Karasburg West Keetmanshoop Rural Keetmanshoop Urban ǃNamiǂNûs Oranjemund Kavango West Kapako Mankumpi Mpungu Musese Ncamangoro Ncuncuni Nkurenkuru Tondoro Kavango East Mashare Mukwe Ndiyona Ndonga Linena Rundu Rural Rundu Urban Khomas John Pandeni Katutura Central Katutura East Khomasdal North Moses ǁGaroëb Samora Machel Tobias Hainyeko Windhoek East Windhoek Rural Windhoek West Kunene Epupa Kamanjab Khorixas Opuwo Rural Opuwo Urban Outjo Sesfontein Ohangwena Eenhana Endola Engela Epembe Ohangwena Okongo Omulonga Omundaungilo Ondobe Ongenga Oshikango Oshikunde Omaheke Aminuis Epukiro Gobabis Kalahari Otjinene Otjombinde Okorukambe Omusati Anamulenge Elim Etayi Ogongo Okahao Okalongo Onesi Oshikuku Otamanzi Outapi Ruacana Tsandi Oshana Okaku Okatana Okatyali Ompundja Ondangwa Rural Ondangwa Urban Ongwediva Oshakati East Oshakati West Uukwiyu Uuvudhiya Oshikoto Eengodi Guinas Nehale lyaMpingana Okankolo Olukonda Omuntele Omuthiyagwiipundi Onayena Oniipa Onyaanya Tsumeb Otjozondjupa Grootfontein Okahandja Okakarara Omatako Otavi Otjiwarongo Tsumkwe *",
 "title": "Constituencies of Namibia"
}