{
 "id": "892110",
 "text": "The following is a list of deaths that happened in May 2022. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known), and a source. ==May== ===1=== *James A. Andersen, 97, American politician and lawyer, member of the Washington House of Representatives (1959–1967), State Senator (1967–1973) and Justice of the State Supreme Court (1984–1995).James A. Andersen *Millie Bailey, 104, American WAC first lieutenant and civil servant. *Naftali Blumenthal, 100, Polish-born Israeli politician, MK (1981–1984).נפתלי בלומנטל נפטר *Kathy Boudin, 78, American political activist and convicted murderer, cancer.Kathy Boudin, radical leftist, educator and mother of Chesa Boudin, dies at 78 *Carmen Costa Cerezuela, 51, Spanish politician, Mayor of Fraga (since 2019), lung cancer.Muere la alcaldesa de Fraga, la 'popular' Carmen Costa, por un cáncer de pulmón *Ilan Gilon, 65, Israeli politician, MK (1999–2003, 2009–2021), problems caused by a stroke.Former Meretz MK Ilan Gilon passes away at 65 *Dominique Lecourt, 78, French philosopher.The philosopher Dominique Lecourt is dead *Carlos Eduardo Moreira Ferreira, 83, Brazilian businessman and politician, Deputy (1999–2003).Morre Carlos Eduardo Moreira Ferreira, ex-presidente da CNI e da Fiesp, aos 83 anos *Henry Coke Morgan Jr., 87, American politician and lawyer, Judge of the U.S. District Court for the Eastern District of Virginia (since 1992).Judge Henry Coke Morgan, Jr. *Takuya Miyamoto, 38, Japanese footballer (Cerezo Osaka, Montedio Yamagata, Avispa Fukuoka).U-15コーチ宮本卓也氏ご逝去のお知らせ *Ivica Osim, 80, Bosnian footballer (Sedan) and manager (Yugoslavia national team, Partizan), problems caused by a stroke.Legend of BiH Football Ivica Osim passed away *Ric Parnell, 70, English rock drummer (Atomic Rooster, Spinal Tap) and actor (This Is Spinal Tap). *Régine Zylberberg, 92, Belgian-born French singer and nightclub owner.Regine, disco pioneer and nightclub queen, dies at 92 ===2=== *Ursula Braun-Moser, 84, German politician, MEP (1984–1989, 1990–1994).Aktuelles *Biancamaria Frabotta, 75, Italian feminist writer and academic.Morta la poetessa Biancamaria Frabotta: \"Un inferno nucleare scuote la stella\" *Joseph Raz, 83, Israeli philosopher and academic. *John Richard Smoak Jr., 78, American politician and lawyer, Judge of the U.S. District Court for Northern Florida (since 2005).John Richard Smoak, Jr. *James V. Stanton, 90, American politician and lawyer, member (1959–1970) and President (1964–1970) of the Cleveland City Council and U.S. House of Representatives from Ohio's 20th congressional district (1971–1977).Longtime Cleveland politician James V. Stanton to be laid to rest this weekend in Maryland *Radim Uzel, 82, Czech politician, sexologist and academic, problems caused by stomach cancer.Zemřel sexuolog Radim Uzel, bojoval s rakovinou žaludku *Yuri Vasenin, 73, Russian footballer (Zaria Voroshilovgrad, Soviet Union national team) and manager (Baltika Kaliningrad).Невосполнимая утрата ===3=== *Egidio Alagna, 86, Italian politician and lawyer, Deputy (1983–1992).Marsala, è morto l'ex deputato e Sindaco Egidio Alagna *Tony Brooks, 90, British Formula One racing driver.Morto a 90 anni Tony Brooks, gareggiò anche in Ferrari *Lino Capolicchio, 78, Italian actor (The Garden of the Finzi-Continis, The House with Laughing Windows, The Bloodstained Shadow), screenwriter and director.Cinema, è morto a 78 anni l'attore Lino Capolicchio *George Horvath, 62, Swedish pentathlete, Olympic bronze medalist (1980).George Horvath *Andra Martin, 86, American actress (The Thing That Couldn't Die, Up Periscope, Yellowstone Kelly).Andra Martin Stein *Norman Mineta, 90, American politician, member of the U.S. House of Representatives from California (1975–1995), Secretary of Commerce (2000–2001) and Transportation (2001–2006), heart disease.Norman Mineta, transportation secretary who helped create TSA, dies at 90 *Stanislav Shushkevich, 87, Belarusian politician, Chairman of the Supreme Council of the Republic of Belarus (1991–1994), problems caused by COVID-19.Ex-Belarus leader Stanislav Shushkevich, who helped dissolve USSR, dies at 87 *Mieke Wijaya, 83, Indonesian actress (Tiga Dara, Badai Pasti Berlalu, Verses of Love) and model, problems caused by diabetes and leukaemia.Aktris Senior Mieke Wijaya Meninggal Dunia di Usia 82 Tahun ===4=== *Józef Leśniak, 54, Polish politician, MP (2015–2019).Zmarł wicewojewoda i były poseł - limanowianin Józef Leśniak *Kenny Moore, 78, American Olympic runner (1968, 1972) and writer.Kenny Moore *Harm Ottenbros, 78, Dutch road bicycle racer.Oud-wereldkampioen wielrennen Harm Ottenbros (78) overleden *Lalli Partinen, 80, Finnish ice hockey player (SaiPa, HIFK, men's national team), COVID-19.Etelä-Saimaa: Lalli Partinen on kuollut *Odir Rocha, 81, Brazilian politician, Deputy (1995) and Mayor of Palmas (1997–2000).Ex- prefeito de Palmas Odir Rocha morre aos 81 anos *Géza Varasdi, 94, Hungarian athlete, Olympic bronze medalist (1952).Meghalt Varasdi Géza ===5=== *Mike Hagerty, 67, American actor (The George Carlin Show, Lucky Louie, Friends), problems caused by a seizure.Mike Hagerty Dies: ‘Friends’ & ‘Somebody Somewhere’ Actor Was 67 *Du'Vonta Lampkin, 25, American football player (Tennessee Titans, Massachusetts Pirates), shot.Former Oklahoma DT Found Shot, Killed Thursday Night in Texas *José Manuel Liaño Flores, 100, Spanish lawyer and politician, member of Cortes Españolas (1967–1977) and Mayor of A Coruña (1976–1979).Fallece José Manuel Liaño Flores, el centenario exalcalde de A Coruña *Ronald Lopatni, 77, Croatian professional water polo player, Olympic champion (1968).Umro legendarni hrvatski vaterpolist i olimpijski pobjednik Ronald Lopatny *Théodore Nzue Nguema, 48, Gabonese footballer (Angers, national team) and manager (Estrellas del Futuro).Théodore Zué Nguéma est mort à Mongomo à 48 ans *Regina Reyes Mandanas, 57, Filipino politician, member of the House of Representatives (2013–2016), problems caused by sepsis.Anakalusugan nominee Regina Reyes Mandanas passes away *José Luis Violeta, 81, Spanish footballer (Zaragoza, national team).Fallece José Luis Violeta, mito del Real Zaragoza *Kenneth Welsh, 80, Canadian actor (Twin Peaks, The Aviator, The Day After Tomorrow), cancer.Prolific Canadian actor Kenneth Welsh dead at 80 *Leo Wilden, 85, German footballer (1. FC Köln, Bayer Leverkusen, West Germany national team).Der FC trauert um Leo Wilden ===6=== *Gabriel Garran, 93, French theater actor and director (Paulette, Lulu Kreutz's Picnic, See You Tomorrow).Death of Gabriel Garran, founder of the Théâtre de la Commune d'Aubervilliers *Alan Gillis, 85, Irish farmer and politician, President of the IFA (1990–1994) and MEP (1994–1999).Gillis, Alan Leslie : Death *Patricia A. McKillip, 74, American writer (The Forgotten Beasts of Eld, Harpist in the Wind, Ombria in Shadow).Patricia A. McKillip (1948-2022) *George Pérez, 67, American comic book artist (The Avengers, Crisis on Infinite Earths, New Teen Titans) and writer, problems caused by pancreatic cancer.Comics Legend George Pérez Died Yesterday, Aged 67 *Mieczysław Pietrewicz, 81, Polish economist and politician, Minister of State Treasury and Deputy Prime Minister (1996–1997), MP (1997–2001) and member of Monetary Policy Council (2004–2010).Nie żyje prof. dr hab. Mirosław Pietrewicz, wieloletni wykładowca SGH w Warszawie (death announced on this day) *Marian van der Meer, 85, Dutch politician, Senator (1983–1995).Oud- senator Van der Meer (PvdA) overleden ===7=== *Antón Arieta, 76, Spanish footballer (Athletic Bilbao, Hércules, national team).Official Announcement: Antón Arieta passes away *Yuri Averbakh, 100, Russian chess grandmaster and author, Chairman of the USSR Chess Federation (1973–1978).World’s oldest grandmaster Yuri Averbakh dies *Fisseha Desta, 81, Ethiopian military officer and politician, Vice President (1987–1991), heart disease.ኣብ እዋን ደርግ ምኽትል ፕረዚደንት ዝነበሩ ሌ/ኮሎኔል ፍስሃ ደስታ ዓሪፎም *Mickey Gilley, 86, American country singer- songwriter (\"Room Full of Roses\", \"Don't the Girls All Get Prettier at Closing Time\", \"Stand by Me\") and musician.American country music singer, songwriter Mickey Gilley dies at 86, according to Mayor of Pasadena *Kang Soo-yeon, 55, South Korean actress (The Surrogate Woman, Come Come Come Upward, All That Falls Has Wings), problems caused by a cerebral hemorrhage.Actress Kang Soo Yeon Passes Away *Francis J. Meehan, 98, American diplomat, Ambassador to Czechoslovakia (1979–1980), Poland (1980–1983) and East Germany (1985–1988).Frank Meehan: Bridge of Spies cold warrior dies *Amadou Soumahoro, 68, Ivorian politician, member (since 2011) and President of the National Assembly (since 2019).Côte d'Ivoire: décès du Président de l'Assemblée nationale Amadou Soumahoro ===8=== *André Arthur, 78, Canadian radio host and politician, MP (2006–2011).Former radio host, MP André Arthur dies at 78 *John R. Cherry III, 73, American movie director and screenwriter (Ernest Saves Christmas, Ernest Scared Stupid, Ernest Goes to Jail), problems caused by Parkinson's disease.John Cherry, Creator of Jim Varney's Ernest, Dies at 73 *Harry Dornbrand, 99, American aerospace engineer. *Robert Gillmor, 85, British wildlife artist and illustrator.Robert Gillmor – 1936 – 2022 *Maria Gusakova, 91, Russian cross-country skier, Olympic champion (1960).Олимпийская чемпионка по лыжным гонкам Мария Гусакова умерла в Петербурге *Bengt Johansson, 79, Swedish handball player (national team) and coach, problems caused by Parkinson's disease.Legendärer schwedischer Trainer Bengt Johansson gestorben *Kim Chi-ha, 81, South Korean activist, poet and playwright.Poet and democracy activist Kim Ji-ha dies at 81 *Antonio Salazar, 33, Mexican footballer (Guadalajara, Chiapas, Santos de Guápiles), burned.El 'Hulk' murió calcinado y sus restos hallados en un maletero: Fiscalía *Fred Ward, 79, American actor (Escape from Alcatraz, The Right Stuff, Tremors).Fred Ward, Star of ‘The Right Stuff,’ ‘Tremors,’ Dies at 79 *Dennis Waterman, 74, English actor (Minder, The Sweeney, New Tricks) and singer.Dennis Waterman: Minder and New Tricks star dies aged 74 ===9=== *Robert Brom, 83, American Roman Catholic prelate, Bishop of Duluth (1983–1989) and San Diego (1990–2013).Robert Brom Dies at 83; San Diego Catholic Bishop Oversaw Diocese Bankruptcy *John L. Canley, 84, American soldier, Medal of Honor recipient (2018), cancer.Marine Sgt Maj John Canley, Medal of Honor hero of the Battle of Hue, has died *John H. Coates, 77, Australian mathematician.Professor John Coates *Midge Decter, 94, American journalist and political writer.Midge Decter, leading neo- conservative, dead at 94 *Denys Dubrov, 33, Ukrainian swimmer, Paralympic champion (2016, 2020).Умер паралимпийский призер Токио-2020 Денис Дубров *Gerald Hannon, 77, Canadian journalist, assisted suicide.\"Gifted magazine writer Gerald Hannon was no stranger to controversy\" *Tim Johnson, 75, American lawyer and politician, member of the Illinois House of Representatives (1977–2001) and U.S. House of Representatives from Illinois's 15th congressional district (2001–2013).Former U.S. Rep. Tim Johnson dies *Linda Lê, 58, Vietnamese-born French writer.Novelist Linda Lê dies aged 58 *John Leo, 86, American journalist (The New York Times), problems caused by COVID-19 and Parkinson's disease.In Memoriam: John Leo *Jody Lukoki, 29, Congolese-Dutch footballer (Ajax, PFC Ludogorets Razgrad, DR Congo national football team), cardiac arrest caused by beating-related injuries.Former Ajax Star Jody Lukoki Has Died, Aged 29 *Adreian Payne, 31, American basketball player (Atlanta Hawks, Minnesota Timberwolves, Orlando Magic), shot.Adreian Payne, former Michigan State basketball star, dies at 31 *Qin Yi, 100, Chinese actress (Far Away Love, Woman Basketball Player No. 5, Troubled Laughter).人民艺术家秦怡今天凌晨逝世，享年一百岁 *Davyd Zhvania, 54, Ukrainian politician, Deputy (2002–2014) and Minister of Emergency (2005), shot.Экс-нардеп Жвания погиб во время обстрела — Геращенко ===10=== *Richard Benson, 67, British- Italian rock guitarist, singer, and television personality.Morto Richard Benson, il musicista aveva 67 anni *María Duval, 95, Argentine actress (Story of a Bad Woman, Cita en las estrellas, Historia de una mala mujer).Murió a los 95 años la actriz María Duval, ícono del cine argentino *Leonid Kravchuk, 88, Ukrainian politician, member (1990–1991, 1994–2006) and Chairman (1991) of Verkhovna Rada and President (1991–1994).Leonid Kravchuk Died. First President Of Ukraine Passed Away At Age Of 88 *Bob Lanier, 73, American Hall of Fame basketball player (Detroit Pistons, Milwaukee Bucks) and coach (Golden State Warriors).NBA Commissioner Adam Silver's statement regarding the passing of Bob Lanier *Kjell Lönnå, 85, Swedish musician and television host.Folkkäre och tv-kände körledaren Kjell Lönnå från Sundsvall är död: ”Vi älskade honom så” *Enrique Metinides, 88, Mexican photographer.Muere Enrique Metinides: el hombre que miraba sereno a la muerte *Shivkumar Sharma, 84, Indian santoor player (Shiv–Hari) and composer (Chandni, Lamhe), cardiac arrest.Santoor maestro Pandit Shivkumar Sharma passes away *Richard Worth, 73, New Zealand lawyer and politician, MP (1999–2009) and Minister of Internal Affairs (2008–2009).Richard Worth obituary ===11=== *Shireen Abu Akleh, 51, Palestinian journalist (Al Jazeera), shot.Al Jazeera journalist Shireen Abu Akleh shot and killed in West Bank *Juan Amat, 75, Spanish field hockey player, Olympic silver medalist (1980).Muere Joan Amat, leyenda del hockey hierba español *Sam Basil, 52, Papua New Guinean politician, MP (since 2007) and Minister of Finance (2019), car crash.Papua New Guinea's Deputy Prime Minister Sam Basil dies on eve of election nominations *Jeroen Brouwers, 82, Dutch writer.Schrijver Jeroen Brouwers (82) overleden *Henk Groot, 84, Dutch footballer (Ajax Amsterdam, Feyenoord, national team).Oud-voetbalinternational Henk Groot (84) overleden *June Preston, 93, American child actress (Anne of Green Gables, Have a Heart, Our Gang Follies of 1938) and opera singer, problems caused by dementia.June Preston, Child Actor Turned Celebrated Opera Singer, Dies at 93 *Trevor Strnad, 41, American melodic death metal singer (The Black Dahlia Murder), suicide.Trevor Strnad Of The Black Dahlia Murder Has Passed Away *Randy Weaver, 74, American survivalist and activist (Ruby Ridge). ===12=== *Haleh Afshar, Baroness Afshar, 77, British politician, academic and feminist writer, member of the House of Lords (since 2007).درگذشت بارونس هاله افشار؛ نگاهی به کارنامۀ او *Gino Cappelletti, 89, American football player (Boston Patriots) and broadcaster.Patriots Hall of Famer Gino Cappelletti dies at age 89 *Robert McFarlane, 84, American Marine Corps lieutenant colonel and politician, National Security Advisor (1983–1985), problems caused by lung disease.Former Reagan national security adviser McFarlane dies -Washington Post *Francesco Nucara, 82, Italian politician, Deputy (1983–1994, 2006–2013).Pri: morto Francesco Nucara, segretario dal 2001 al 2017 *Giorgio Pasetto, 80, Italian politician, President of Lazio (1992–1994), Deputy (1996–2006) and Senator (2006–2008).È morto Giorgio Pasetto, già sindaco di Anzio *Maria Pańczyk-Pozdziej, 80, Polish politician and journalist, Senator (2005–2019).Maria Pańczyk-Pozdziej nie żyje *Arnold Walker, 70, English rugby league player (Whitehaven, Workington Town, Cumbria), cancer. ===13=== *Lil Keed, 24, American rapper.Lil Keed dead at age 24 *Ben Roy Mottelson, 95, American-Danish nuclear physicist, Nobel Prize winner (1975).Ben Roy Mottelson er død *Khalifa bin Zayed Al Nahyan, 73, Emirati royal and politician, President (since 2004).UAE President Sheikh Khalifa bin Zayed passes away *Teresa Berganza, 89, Spanish mezzo-soprano, educator and actress (Don Giovanni).Muere la mezzosoprano Teresa Berganza *Karim Djoudi, 63, Algerian politician, Minister of Finance (2007–2014).President Tebboune extends condolences *Simon Preston, 83, English organist, conductor, and composer.The organist and conductor Simon Preston has died *João Rendeiro, 69, Portuguese banker, founder of Banco Privado Português, suicide by hanging.João Rendeiro encontrado morto na cadeia *Richard Wald, 92, American television businessman (NBC News, ABC News) and journalist (New York Herald Tribune), problems caused by a stroke.Richard C. Wald, TV Veteran at NBC and ABC News, Dies at 92 *Yang Hyong-sop, 96, North Korean politician, Chairman of the Supreme People's Assembly (1983–1998), stroke.Yang Hyong-sop Passes Away ===14=== *Andrei Babushkin, 58, Russian human rights activist, politician and publicist, member of the PCCSHR (since 2012), pancreatitis.Умер член СПЧ Андрей Бабушкин *Bernard Bigot, 72, French physicist and civil servant, Director General of ITER (since 2015).Le directeur général d'Iter Organization Bernard Bigot est mort *François Blais, 49, Canadian children's writer (Lac Adélard).L’écrivain François Blais n’est plus *James Francis Edwards, 100, Canadian Air Force fighter pilot.B.C.’s ‘Stocky’ Edwards, top Canadian ace of WWII’s Western Desert campaign dies *Valerio Onida, 86, Italian politician and lawyer, Judge (1996–2005) and President (2004–2005) of the Constitutional Court.Morto a 86 anni Valerio Onida, ex presidente della Corte Costituzionale *Maxi Rolón, 27, Argentine footballer (FC Barcelona B, Coquimbo Unido, Fuerza Amarilla), car crash.Fallece Maxi Rolón en un accidente de circulación *Uri Savir, 69, Israeli politician, MK (1999–2001) and Ambassador to Eritrea (2001–2005).Uri Savir, chief peace negotiator of Oslo Accords, dies at 69 *Andrew Symonds, 46, Australian cricketer (Queensland, Deccan Chargers, national team), car crash.Andrew Symonds dies in car crash *Urvashi Vaid, 63, Indian-American LGBT rights activist, problems caused by breast and thyroid cancer.Urvashi Vaid, Legendary Activist for LGBTQ+ Civil Rights, Dies at 63 *David West, 57, American baseball player (Minnesota Twins, Philadelphia Phillies, New York Mets), World Series champion (1991), glioblastoma.David West, who pitched for the 1993 Phillies, dies ===15=== *Rainer Basedow, 83, German actor (My Daughter, Your Daughter, Three Men in the Snow, Lina Braake), heart attack.Rainer Basedow ist tot *Robert Cogoi, 82, Belgian singer, Eurovision contestant (1964).Robert Cogoi avait participé à l'Eurovision il y a 58 ans, il s'en est allé au lendemain de la 66e édition du concours *Jim Ferlo, 70, American politician, member (1988–2003) and President (1994–1998) of the Pittsburgh City Council and member of the Pennsylvania Senate (2003–2015).Former State Sen. Jim Ferlo dies at age 70 (death announced on this date) *Ignacy Gogolewski, 90, Polish actor (Three Stories, Tonight a City Will Die, The Codes).Zmarł aktor Ignacy Gogolewski *Klara Höfels, 73, German actress (Toni Erdmann, SOKO, Cut Off), theatre director and producer.Schauspielerin Klara Höfels gestorben *Knox Martin, 99, Colombian- born American painter and sculptor.Knox Martin *Kay Mellor, 71, British actress and television writer (Children's Ward, Families, Fat Friends) *Stevan Ostojić, 80, Serbian footballer (Radnički Niš, Red Star Belgrade, Yugoslavia national team).Preminuo Stevan Ostojić, nekadašnji reprezentativac i golgeter Crvene zvezde *Maggie Peterson, 81, American actress (The Andy Griffith Show, The Bill Dana Show), singer and location manager (Casino).Maggie Peterson, known to ‘Andy Griffith Show’ fans as Charlene Darling, has died *Jerzy Trela, 80, Polish actor (Man of Iron, Danton, Ida).Jerzy Trela nie żyje. O aktorstwie mówił: Trzeba balansować między męką a przyjemnością ===16=== *Josef Abrhám, 82, Czech actor (Transport from Paradise, Courage for Every Day, Morgiana), problems caused by Parkinson's disease.Zemřel Josef Abrhám *John Aylward, 75, American actor (ER, The West Wing, A Million Ways to Die in the West).John Aylward Dies: ‘ER’, ‘West Wing’ Actor Was 75 *Hilarion Kapral, 74, Canadian- born American Orthodox prelate, Bishop of the ROCOR (since 2008).\\+ Metropolitan Hilarion (1948 — 2022) *Sidney Kramer, 96, American politician and businessman, Maryland State Senator (1978–1986) and Montgomery County Executive (1986–1990).Former Montgomery County Executive Sid Kramer Dies at Age 96 *Ademola Okulaja, 46, Nigerian-born German basketball player (Girona, Brose Bamberg, men's national team), FIBA bronze medalist (2002).Former UNC basketball player Ademola Okulaja dies at 46 *Epaminondas Stassinopoulos, 101, German-born American astrophysicist, writer and World War II resistance member.Epaminondas George Stassinopoulos ===17=== *E. Gerald Corrigan, 80, American banker and politician, President of the Federal Reserve Bank of New York (1985–1993), problems caused by Alzheimer's disease.People: former New York Fed chief Corrigan dies *Kristine Gebbie, 78, American academic and politician, White House AIDS Policy Coordinator (1993–1994), cancer.Kristine Gebbie, the First U.S. AIDS Czar, Dies at 78 *Jeong Rae-hyuk, 96, South Korean military officer and politician, Minister of Commerce and Industry (1961–1962) and Defense (1970–1971) and MP (1973–1985).상공·국방 장관에 당 대표 지낸 정래혁 전 국회의장 별세 *Rolands Kalniņš, 100, Latvian movie director (I Remember Everything, Richard, Four White Shirts), screenwriter and producer (Cilvēka bērns).Latvian film director Rolands Kalniņš dies aged 100 *Eliseo Mendoza Berrueto, 91, Mexican politician and economist, member (1985–1987) and President (1985) of the Chamber of Deputies and Governor of Coahuila (1987–1993).Falleció el político Eliseo Mendoza Berrueto *Mohamed Rabbae, 81, Moroccan-born Dutch politician and activist, member of the House of Representatives (1994–2002).Oud- GroenLinks-Kamerlid en minderhedenwoordvoerder Mohamed Rabbae overleden *Rodri, 88, Spanish footballer (Condal, Barcelona, national team).Legendary defender from the 1960s 'Rodri' passes away *Vangelis, 79, Greek electronic rock musician (Aphrodite's Child) and composer (Blade Runner, Chariots of Fire), Oscar winner (1981), heart failure caused by COVID-19.Vangelis Papathanasiou: Oscar-winning composer passes away at the age of 79 ===18=== *Werner Israel, 90, German-born South African-Canadian physicist (No-hair theorem), academic and researcher.Werner Israel *Faouzi Mansouri, 66, Algerian footballer (Nîmes, Montpellier, national team).Football : l'ancien Croco et Montpelliérain Faouzi Mansouri s'est éteint à l'âge de 66 ans *Marnie Schulenburg, 37, American actress (As the World Turns, One Life to Live, Tainted Dreams), breast cancer.As the World Turns alum passes away at 37 *Domingo Villar, 51, Spanish writer (Death on a Galician Shore), problems caused by a stroke.Muere con 51 años Domingo Villar, autor de novelas negras psicológicas, musicales y nostálgicas ===19=== *Jean-Louis Comolli, 80, French movie critic (Cahiers du Cinéma) and director. *Aseff Ahmad Daula, 81, Pakistani politician, MNA (1990–1993, 2008–2013), Minister of Foreign Affairs (1993–1996) and Education (2008–2010).Former Foreign Minister Sardar Asif Ali passes away *Chete Lera, 72, Spanish actor (The Red Squirrel, Secrets of the Heart, Open Your Eyes), car crash.Muere el actor Chete Lera a los 72 años en un accidente de tráfico *Pamela Sharples, Baroness Sharples, 99, British life peer, member of the House of Lords (1973–2017). *Michael Sze, 76, Hong Kong politician, Secretary for Constitutional Affairs (1991–1994) and Executive Director of the HKTDC (1996–2004).前宪制事务司施祖祥清晨离世 终年76岁 *Lucio Valle, 86, Italian politician, Mayor of Frosinone (1990–1992).Lucio Valle, il fanfaniano che spiazzò gli andreottiani ===20=== *Roger Angell, 101, American editor, sportswriter and essayist (Season Ticket: A Baseball Companion), congestive heart failure. *Sir Colin Campbell, 77, Scottish lawyer and academic, Vice- Chancellor of the University of Nottingham (1988–2008).University of Nottingham, \"Tributes paid following death of Nottingham’s former Vice- Chancellor\", 24 May 2022. Retrieved 31 May 2022. *Glenn Hackney, 97, American politician, member of the Alaska House of Representatives (1973–1977) and State Senate (1977–1981), car crash.Glenn Hackney, friend to the needy, former legislator, community volunteer, has passed *Dame Aroha Reriti-Crofts, 83, New Zealand community activist, President of the MWWL (1990–1993).Mana wahine Dame Aroha Reriti-Crofts dies at 83 *Susan Roces, 80, Filipino actress (Ang Daigdig Ko'y Ikaw, Patayin Mo Sa Sindak Si Barbara, Ang Probinsyano), heart attack.Movie queen Susan Roces passes away *Kirill Teiter, 69, Estonian politician, MP (1992–1995).Suri Torgu kuningas Kirill I ===21=== *Marco Cornez, 64, Chilean footballer (Club Deportivo Palestino, Antofagasta, national team), stomach cancer.Fallece Marco Cornez, ex arquero de la selección chilena y figura de la UC *Fon Angwafo III of Mankon, 97, Cameroonian traditional ruler and politician, MP (1962–1988).Nécrologie : décès de Fon San Angwafo III après 63 ans de règne sur le trône de Mankon, région du Nord-Ouest *Rosemary Radford Ruether, 85, American feminist theologian and scholar. *Tania Tinoco, 58, Ecuadorian journalist, television presenter and producer (Ecuavisa), cardiopulmonary arrest caused by arrhythmia.Falleció la periodista Tania Tinoco *Jiří Zídek Sr., 78, Czech Hall of Fame basketball player (USK Praha, men's national team) and coach (Sparta Praha).Odešel opravdový velikán basketbalových palubovek ===22=== *József Duró, 55, Hungarian footballer (Debreceni VSC, national team) and manager (Vecsési).Meghalt Dúró József *Joe Hawke, 82, New Zealand Māori activist and politician, MP (1996–2002).Ngāti Whātua Bastion Point protest leader Joe Hawke dies, aged 82 *Duberildo Jaque, 101, Chilean lawyer and politician, Deputy (1961–1973).Fallece a los 101 años Duberildo Jaque, ex diputado y docente de Concepción *Minute Alapati Taupo, 60, Tuvaluan politician, Ambassador to Taiwan (2013–2017), MP (since 2019) and Deputy Prime Minister (since 2019), heart attack.Tuvalu mourns deputy prime minister ===23=== *Jamie Bartlett, 55, British-born South African actor (American Ninja 2: The Confrontation, Ernest Goes to Africa, Mandela: Long Walk to Freedom). *Anita Gradin, 88, Swedish politician, MP (1969–1992) and member of the European Commission (1995–1999).Sveriges första EU-kommissionär har dött *Maja Lidia Kossakowska, 50, Polish fantasy writer, journalist and archaeologist, house fire.Maja Lidia Kossakowska nie żyje. Tragiczna śmierć pisarki *Joe Pignatano, 92, American baseball player (Los Angeles Dodgers) and coach (New York Mets), World Series champion (1959, 1969), problems caused by dementia.Joe Pignatano passed away this morning *Ilkka Suominen, 83, Finnish politician, member (1970–1975, 1983–1995) and speaker of the Parliament (1987, 1991–1993), President of the Nordic Council (1992) and MEP (1999–2004).Kokoomuksen entinen puheenjohtaja Ilkka Suominen on kuollut *Wendell, 74, Brazilian footballer (Santa Cruz, Botafogo, national team) and coach.Morre Wendell, ex-preparador de goleiros campeão do mundo com a seleção brasileira *Zaw Htay, 48, Burmese politician, Spokesman of the President Office (2011–2016), heart attack.NLD အစိုးရလက်ထက် သမ္မတရုံး ပြောရေးဆိုခွင့်ရှိသူဟောင်း ဦးဇော်ဌေး နှလုံးရောဂါဖြင့် ကွယ်လွန် ===24=== *Fred Aftalion, 100, French chemical engineer.Avis de décès de Monsieur Fred Aftalion *Vladimir Averchev, 75, Russian politician, Deputy (1993–2000). Умер бывший депутат Госдумы Аверчев *Gennaro Cannavacciuolo, 60, Italian actor (Un'estate al mare, La vita è una cosa meravigliosa), singer and comedian, heart attack.E' morto l'attore Gennaro Cannavacciuolo *David Datuna, 48, Georgian-born American artist, lung cancer. *Ouka Leele, 64, Spanish photographer. *Salvador Ramos, 18, American mass murderer (Robb Elementary School shooting), shot.15 killed in shooting at Uvalde elementary school, active shooter killed, officials say *Khyongla Rato, 98–99, Tibetan Buddhist monk, scholar and writer (My Life and Lives), founder of The Tibet Center. *Thomas Ulsrud, 50, Norwegian curler, Olympic silver medalist (2010), cancer.Curling-legenden Thomas Ulsrud er død ===25=== *Dick Conway, 87, New Zealand rugby union player (Bay of Plenty, national team).Former All Black Richard 'Red' Conway dies at 87 *Wies van Dongen, 90, Dutch Tour de France racing cyclist. Wies van Dongen overleden, was de oudste nog levende Nederlandse Tourrenner *Luis Guillermo Eichhorn, 79, Argentine Roman Catholic prelate, Bishop of Gualeguaychú (1996–2004) and Morón (2004–2017), cardiac arrest.Falleció Monseñor Luis Eichhorn *Lívia Gyarmathy, 90, Hungarian movie director and screenwriter (Recsk 1950-1953, Escape from Recsk).Elhunyt Gyarmathy Lívia filmrendező *Thomas S. Murphy, 96, American broadcasting businessman, Chair and CEO of ABC (1986–1996).Thomas S. Murphy, Broadcasting ‘Minnow’ Who Swallowed ABC, Dies at 96 ===26=== *Ciriaco De Mita, 94, Italian politician, Deputy (1963–1994, 1996–2008), Minister of Industry (1973–1974) and Prime Minister (1988–1989), problems caused by a fall. *Andy Fletcher, 60, English Hall of Fame rock keyboard player (Depeche Mode) and DJ.Morto Andy Fletcher, il tastierista dei Depeche Mode *Ray Liotta, 67, American actor (Goodfellas, Field of Dreams, Marriage Story) and movie producer, Emmy winner (2005).‘Goodfellas’ Star Ray Liotta Dies at 67 *Sergei Romanovtsev, 96, Russian Soviet Armed Forces colonel and intelligence officer.О кончине С.Д.Романовцева *George Shapiro, 91, American talent manager (Carl Reiner, Andy Kaufman) and television producer (Seinfeld).George Shapiro Dead: Legendary Talent Manager & ‘Seinfeld’ Producer Was 91 *Enyu Todorov, 79, Bulgarian freestyle wrestler, Olympic silver medalist (1968).Почина Еньо Тодоров - олимпийски вицешампион по борба *Alan White, 72, English Hall of Fame rock drummer (Yes, Plastic Ono Band).Yes drummer Alan White dead at 72 ===27=== *Fayez Sarofim, 93, Egyptian-American businessman and sports team owner (Houston Texans).Houston billionaire philanthropist Fayez Sarofim reportedly dies at 93 *Michael Sela, 98, Polish-born Israeli immunologist and academic, President of the Weizmann Institute of Science (1975–1985), co- discovered copaxone, Wolf Prize winner (1998).לעולמו פרופ' מיכאל סלע, לשעבר נשיא מכון ויצמן למדע ומעמודי התווך של המדע הישראלי והבינלאומי *Angelo Sodano, 94, Italian Roman Catholic cardinal, Vatican Secretary of State (1991–2006) and Dean of the College of Cardinals (2005–2019), COVID-19.Vaticano, è morto a 94 anni il cardinale Angelo Sodano *Ahmad Syafi'i Maarif, 86, Indonesian Islamic scholar and philanthropist, Leader of Muhammadiyah (1998–2005), heart disease.Indonesia’s pluralism icon Ahmad Syafii Maarif dies at 86 ===28=== *Walter Abish, 90, Austrian-born American writer (Alphabetical Africa, How German Is It). *Patricia Brake, 79, English actress (Porridge, Going Straight, Midsomer Murders). *Evaristo Carvalho, 80, São Toméan politician, Prime Minister (1994, 2001–2002) and President (2016–2021).Former Sao Tome President Carvalho Dies In Lisbon *Péter Haumann, 81, Hungarian actor (Ten Thousand Days, Sound Eroticism, Kalandorok).Elhunyt Haumann Péter *Bo Hopkins, 80, American actor (The Wild Bunch, American Graffiti, White Lightning), problems caused by a heart attack.Bo Hopkins, ‘Wild Bunch’ and ‘American Graffiti’ Actor, Dies at 84 *Bob Hydrick, 83, American politician, Mayor of Columbus, Georgia (1973–1975), cancer.Former Columbus Mayor Bob Hydrick, who helped create city’s modern government, dies *Ivandro Cunha Lima, 92, Brazilian lawyer and politician, Senator (1977–1982).Políticos lamentam morte de Ivandro Cunha Lima, ex-senador da Paraíba *Marino Masé, 83, Italian actor (Tenebrae, The Godfather Part III, The Eighteenth Angel), heart attack.Addio all’attore triestino Marino Masè, il bello del cinema dai “Pugni in tasca” a “Portiere di notte” *Bujar Nishani, 55, Albanian politician, Minister of Justice (2009–2011) and Interior (2007–2009, 2011–2012) and President (2012–2017), problems caused by COVID-19. *Yves Piétrasanta, 82, French politician and academic, Mayor of Mèze (1977–2001) and MEP (1999–2004).Yves Pietrasanta nous a quittés ===29=== *Antônio Augusto Cançado Trindade, 74, Brazilian politician and lawyer, Judge of the International Court of Justice (since 2009).Falecimento do professor Antonio Augusto Cançado Trindade *Virgil Dridea, 81, Romanian footballer (Petrolul Ploieşti) and manager (Plopeni, Dacia Unirea Brăila).A murit Virgil Dridea, gloria Petrolului: două titluri și o confruntare legendară cu Liverpool în palmares *Tarzan Goto, 58, Japanese professional wrestler (FMW, CWA, AJPW), liver cancer.FMW Alumni Tarzan Goto Passes Away *Ronnie Hawkins, 87, American-Canadian rock singer-songwriter and musician, pancreatic cancer.Rockabilly artist Ronnie Hawkins dies at 87 after long illness *Ausma Kantāne-Ziedone, 80, Latvian actress and politician, MP (2002–2010).Скончалась актриса Аусма Кантане, вдова Иманта Зиедониса *Maria Mirecka-Loryś, 106, Polish World War II Resistance member.Zmarła Maria Mirecka-Loryś. Działaczka podziemia miała 106 lat *Sidhu Moose Wala, 28, Indian hip hop singer (\"47\"), actor (Moosa Jatt, Yes I Am Student) and politician, shot.Sidhu Moose Wala Firing Updates: Punjabi Singer Shot Dead In Mansa *Lester Piggott, 86, English jockey.Lester Piggott, legendary jockey and nine-time Derby winner, dies aged 86 *Stan Rodger, 82, New Zealand politician, MP (1978–1990) and Minister of Labour and State Services (1984–1989).Former Labour minister Stan Rodger dies aged 82 ===30=== *Friedrich Christian Delius, 79, German writer.Autor Friedrich Christian Delius gestorben *Craig Farrell, 39, English footballer (Carlisle United, York City, Whitby Town).Club: A great lad to have in our group *Jeff Gladney, 25, American football player (Minnesota Vikings, Arizona Cardinals, TCU Horned Frogs), car crash.Jeff Gladney passes away following automobile accident *Milton Gonçalves, 88, Brazilian actor (Kiss of the Spider Woman, Subway to the Stars, Moon over Parador), political activist and television director, problems caused by a stroke.Milton Gonçalves, ícone da TV brasileira, morre aos 88 anos *David Holford, 82, Barbadian cricketer (West Indies).David Holford passes at 82 *William Lucas, 93, American politician, Sheriff (1969–1983) and Executive (1983–1987) of Wayne County, Michigan.William Lucas, the 1st Wayne County Executive and onetime candidate for governor, dies *Boris Pahor, 108, Slovenian-Italian writer (Necropolis) and Holocaust survivor, member of the Slovenian Academy of Sciences and Arts (since 2009).Boris Pahor, Trieste-based Slovenian writer, dies *Charles A. Rose, 91, American politician, Mayor of Chattanooga (1975–1983).Charles Allen \"Pat\" Rose *Vincent Ryan, 84, Australian Catholic priest and convicted sex offender.Paedophile priest Vincent Gerard Ryan dead at 84 *Carlo Smuraglia, 98, Italian politician, Senator (1992–2001) and President of ANPI (2011–2017).È morto Carlo Smuraglia, presidente onorario dell'Anpi ===31=== *Ahn Byong-man, 81, South Korean academic, President of Hankuk University of Foreign Studies (1994–2004).안병만 전 교과부 장관 별세 *Larry Hillman, 85, Canadian ice hockey player (Toronto Maple Leafs, Boston Bruins, Detroit Red Wings).Four-time Leaf Cup winner Larry Hillman dies *KK, 53, Indian playback singer (Hum Dil De Chuke Sanam, Humraaz, Om Shanti Om), cardiac arrest.Singer KK dies at 53 during live performance in Kolkata *Jacques N'Guea, 66, Cameroonian footballer (Canon Yaoundé, national team).Nécrologie : Nguea Jacques n’est plus *Jim Parks, 90, English cricketer (Sussex, Somerset, national team), problems caused by a fall.Remembering Jim Parks 1931 - 2022 *Gilberto Rodríguez Orejuela, 83, Colombian drug lord (Cali Cartel), colon and prostate cancer.Muere Gilberto Rodríguez Orejuela en cárcel de Estados Unidos *Bhim Singh, 80, Indian politician, lawyer and activist, Jammu and Kashmir MLA (1977–1987), Chairman of the Jammu and Kashmir NPP (1982–2012) and MP (1988).Panthers party chief Prof Bhim Singh passes away at 80 ==Months== * January * February * March * April ==Related pages== * List of deaths due to COVID-19 * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 * Deaths in 2020 * Deaths in 2021 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *05 Category:May 2022 events",
 "title": "Deaths in May 2022"
}