{
 "id": "892199",
 "text": "Sir Anish Kapoor (born 12 March 1954) is a British-Indian sculptor. He was born in Mumbai. He works in London. His most famous sculpture is the Cloud Gate, a bean-shaped sculpture in Grant Park, Chicago. ==Honors== Kapoor won the Turner Prize and Premio Duemilia. In 2013, Queen Elizabeth II knighted Anish Kapoor. ==Black paint fights== Anish Kapoor is also famous for a fight with other artists about black paint. When scientists invented a material called \"Vantablack\", Kapoor made a deal with them: He bought exclusive rights. This means he paid the company that owned Vantablack to let him be the only artist allowed to use Vantablack in art. Vantablack could be used to paint something so black that a flat circle would look like a deep hole. Other artists were angry with Kapoor because they wanted to use this paint too. One artist, Stuart Semple, made other paints, for example \"Pinkest Pink\" and \"Better Black\", and wrote on his website that Kapoor could not have any. Anyone buying the paint had to promise not to give any to Kapoor. Kapoor got some Pinkest Pink anyway and put a picture of himself on Instagram. == Artwork == File:El gran árbol y el ojo (Anish Kapoor).jpg|El gran árbol y el ojo File:Anish Kapoor 4188.JPG|Anish Kapoor 4188 File:Anish Kapoor 4199.jpg|Anish Kapoor / Istanbul File:Sky Mirror (for Hendrik) 2017, Anish Kapoor, photo Peter Cox (2019).jpg|Sky Mirror (for Hendrik) 2017 File:'Sky Mirror' by Anish Kapoor - geograph.org.uk - 2329829.jpg|'Sky Mirror' by Anish Kapoor File:Anish Kapoor sculpture.jpg|Anish Kapoor sculpture File:Bilbao - Museo Guggenheim - Tall Tree and the Eye (Anish Kapoor) 5.JPG|Bilbao - Museo Guggenheim - Tall Tree and the Eye (close up) File:Bilbao - Museo Guggenheim, Tall Tree and the Eye (Anish Kapoor) 3.jpg|Bilbao - Museo Guggenheim, Tall Tree and the Eye ==References== Category:1954 births Category:Living people Category:Indian sculptors Category:British sculptors Category:People from Bombay Category:Artists from London",
 "title": "Anish Kapoor"
}