{
 "id": "892113",
 "text": "The following is a list of deaths that happened in August 2022. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known), and a source. ==August== ===1=== *Lennart Back, 89, Swedish Olympic race walker (1960).Lennart Back död *Carlos Blixen, 85, Uruguayan basketball player, Olympic bronze medalist (1956).Murió el Inglés Blixen, un emblema de Trouville y medallista olímpico de 1956 *Rosa de Castilla, 91, Mexican singer and actress (The Unknown Mariachi, Yo... el aventurero, Héroe a la fuerza).Fallece la actriz del cine de oro Rosa de Castilla *Hugo Fernández, 77, Uruguayan footballer (Nacional, Puebla) and manager (Consadole Sapporo).LIGA MX: Fallece Hugo Fernández, ex jugador de Puebla *John Hughes, 79, Scottish football player (Celtic, national team) and manager (Stranraer).Lisbon Lion John 'Yogi' Hughes dies at 79 *Ilinka Mitreva, 72, Macedonian politician, Minister of Foreign Affairs (2001, 2002–2006).Тажна вест: Почина поранешната Министерка за надворешни работи Илинка Митрева *Joseph Mondello, 84, American politician and lawyer, Town Supervisor of Hempstead, New York (1987–1993) and Ambassador to Trinidad and Tobago (2018–2021).Former US Ambassador to T&T; Joseph Mondello dies *Hiroshi Ōtake, 90, Japanese actor (Perman, The Kabocha Wine, Akira), heart failure.Hiroshi Otake, Hunter x Hunter Star, Dies at 90 *Andrejs Rubins, 43, Latvian footballer (Skonto, Crystal Palace, national team).Pāragri mūžībā aizsaukts Andrejs Rubins *Robert E. Simanek, 92, American Marine officer, Medal of Honor recipient (1953).Congressional Medal of Honor Society Announces Passing of Medal of Honor Recipient Robert E. Simanek at 92 ===2=== *Buddy Arrington, 84, American NASCAR racing driver.Buddy Arrington, Former NASCAR Cup Series Driver, Passes Away at Age 84 *Hans Bangerter, 98, Swiss football administrator, General Secretary of UEFA (1960–1989).UEFA mourns former General Secretary Hans Bangerter (death announced on this date) *Luis Augusto Castro Quiroga, 80, Colombian Roman Catholic prelate, Apostolic Vicar of San Vicente del Caguán (1986–1998), Archbishop of Tunja (1998–2020) and President of Episcopal Conference of Colombia (2005–2008, 2015–2017), COVID-19.Falleció monseñor Luis Augusto Castro Quiroga, un líder de la paz en Colombia *Friedrich-Wilhelm von Herrmann, 87, German philosopher and academic, heart attack.La morte di Friedrich-Wilhelm von Herrmann *Adolfo Navajas Artaza, 97, Argentine businessman and politician, Governor of Corrientes Province (1969–1973) and Minister of Social Action (1982–1983).A los 97 años murió Adolfo “Toco” Navajas Artaza, ex gobernador de Corrientes y presidente honorario de Establecimiento Las Marías *Zbyszko Piwoński, 93, Polish politician, Voivode of the Zielona Góra Voivodeship (1984–1990) and Senator (1993–2005).Nie żyje Zbyszko Piwoński *Vin Scully, 94, American Hall of Fame sportscaster (Brooklyn/Los Angeles Dodgers).Legendary Dodgers announcer Vin Scully, 94, dies ===3=== *Raymond Damadian, 86, American physician, inventor of magnetic resonance imaging.Le médecin, scientifique et inventeur américano-arménien de l’imagerie par résonance magnétique (IRM) Raymond Damadian est décédé *Jack Deloplaine, 68, American football player (Pittsburgh Steelers, Washington Redskins, Chicago Bears), Super Bowl champion (1979, 1980).Former Super Bowl-Winning Steelers RB Jack \"Hydroplane\" Deloplaine Dead at 68 *Ton Frinking, 91, Dutch politician, MP (1977–1993).A.B.M. (Ton) Frinking *Imdaad Hamid, 78, Indonesian politician, Mayor of Balikpapan (2001–2011).Profil Imdaad Hamid, Mantan Walikota yang Tolak Tambang di Balikpapan, Memulai Karier di Unmul *Petro Kravchuk, 60, Ukrainian politician, Deputy (2006–2008).Помер волинянин Петро Кравчук: двічі нардеп, екскерівник Укравтодору *Ng Boon Bee, 84, Malaysian badminton player, Olympic silver medalist (1972). *Paul X. Rinn, 75, American Navy captain, heart attack.Capt. Paul Xavier Rinn, U.S. Navy (retired) *Ilya Tsipursky, 87, Russian sambist and judoka.Ушёл из жизни Илья Лазаревич Ципурский *Villiam Vecchi, 73, Italian footballer (Milan, Como, SPAL).Villiam Vecchi morto: portiere del Milan e preparatore con Ancelotti *Jackie Walorski, 58, American politician, member of the Indiana House of Representatives (2005–2010) and U.S. House of Representatives from Indiana's 2nd congressional district (since 2013), car crash.Rep. Jackie Walorski, three others killed in crash ===4=== *Akin Mabogunje, 90, Nigerian geographer, President of the International Geographical Union (1980–1984).Ace geographer, Akin Mabogunje, dies at 90 *Edir Oliveira, 72, Brazilian politician, Mayor of Gravataí (1993–1997).Morre aos 72 anos Edir Oliveira, presidente do PTB no RS *Adriana Roel, 88, Mexican actress (Viva Maria!, Autumn Days, Chucho el Roto).Falleció la primera actriz Adriana Roel ===5=== *Ana Luísa Amaral, 66, Portuguese poet, translator and academic.Morreu a escritora Ana Luísa Amaral, aos 66 anos *Dean Carlson, 72, American football player (Kansas City Chiefs, Green Bay Packers).Dean Paul Carlson *Judith Durham, 79, Australian folk jazz singer-songwriter and musician (The Seekers), bronchiectasis.Judith Durham, Australian singer and vocalist of The Seekers, dies at 79 *Cherie Gil, 59, Filipino actress (Manila By Night, Oro, Plata, Mata, Bituing Walang Ningning), endometrial cancer.Cherie Gil passes away *Clu Gulager, 93, American actor (The Return of the Living Dead, The Tall Man, The Last Picture Show).Clu Gulager, Actor in ‘The Virginian,’ ‘The Last Picture Show’ and ‘Return of the Living Dead,’ Dies at 93 *Ali Haydar, 90, Syrian Army general.رفض توريث بشار الأسد الحكم في سورية وسخر منه.. وفاة اللواء علي حيدر بعد نحو ثلاثة عقود من إزاحته *Tayseer Jabari, 50, Palestinian Islamic militant, Military Leader of the Palestinian Islamic Jihad (since 2019), airstrike.Who was Tayseer al-Jabari, the top Islamic Jihad commander killed by Israel? *Bob Lay, 78, Australian Olympic sprinter (1964).Vale: Bob Lay OAM *Luciano Macías, 87, Ecuadorian footballer (Barcelona, Miami Toros, national team).Falleció Luciano Macías, leyenda de Barcelona *Issey Miyake, 84, Japanese fashion designer (L'eau d'Issey), liver cancer.Issey Miyake, Japan's prince of pleats, dies of cancer aged 84 - media *Peter Schowtka, 77, German politician, Mayor of Wittichenau (1990–1994) and member of the Landtag of Saxony (1991–2014).Peter Schowtka verstorben *Jô Soares, 84, Brazilian comedian and talk show host (Programa do Jô).Jô Soares morre em São Paulo aos 84 anos *Susan Whelchel, 77, American politician, Mayor of Boca Raton, Florida (2008–2014).Former Boca Raton mayor Susan Whelchel dies at 77 - a closer look at her legacy ===6=== *Carlo Bonomi, 85, Italian actor (Pingu, La Linea) and clown.Addio al grande doppiatore Carlo Bonomi: la voce come una tecnica di animazione *Buddy Leach, 88, American businessman, lawyer and politician, member of the Louisiana House of Representatives (1968–1979, 1984–1988) and U.S. House of Representatives from Louisiana's 4th congressional district (1979–1981), heart failure.Former congressman Buddy Leach passes away *Daniel Lévi, 60, French pop singer-songwriter (\"L'envie d'aimer\") and pianist, colon cancer.Le chanteur Daniel Lévi, qui luttait contre un cancer, est mort à 60 ans *David Muse, 73, American pop rock singer-songwriter and musician (Firefall, The Marshall Tucker Band), non-Hodgkin lymphoma.David Muse, Multi-Instrumentalist for Firefall, Dead at 73 *Gene Visscher, 81, American college basketball coach (Weber State, Northern Arizona).Former Weber State basketball player, coach Gene Visscher dies at 81 *John Yanta, 90, American Roman Catholic prelate, Bishop of Amarillo (1997–2008), problems caused by pneumonia. ===7=== *Ezekiel Alebua, 75, Solomon Islands politician, MP (1980–1987) and Prime Minister (1986–1989).Former Prime Minister Ezekiel Alebua Dies *Biyi Bandele, 54, Nigerian novelist, playwright and movie director (Elesin Oba, The King's Horseman, Half of a Yellow Sun).Blood Sisters director, Biyi Bandele, is dead *Henryk Dziewior, 74, Polish businessman and politician, Mayor of Katowice (1994–1998).Henryk Dziewior nie żyje. Był prezydentem Katowic do 1998 roku *Anatoly Filipchenko, 94, Russian cosmonaut (Soyuz 7, Soyuz 16).Умер советский космонавт Анатолий Филипченко *Bill Graham, 83, Canadian politician, MP (1993–2007), Minister of National Defence (2004–2006) and Foreign Affairs (2002–2004).Bill Graham, a former defence and foreign affairs minister, has died *Eike Christian Hirsch, 85, Dutch-born German journalist and writer.Hannover: Publizist Eike Christian Hirsch mit 85 Jahren verstorben *David McCullough, 89, American historian and writer (Truman, John Adams), Pulitzer Prize winner (1993, 2002).David McCullough, Pulitzer-winning historian, dies at 89 *Roger E. Mosley, 83, American actor (Magnum, P.I., Leadbelly, Terminal Island), injuries caused by a car crash.'Magnum P.I.' Star Roger E. Mosley Dead at 83 *Rostislav Václavíček, 75, Czech footballer (Zbrojovka Brno, K.S.C. Hasselt), Olympic champion (1980).Zemřel fotbalista Václavíček, olympijský vítěz a kapitán mistrovského Brna ===8=== *Lamont Dozier, 81, American Hall of Fame R&B; singer-songwriter (\"You Can't Hurry Love\", \"Reach Out I'll Be There\") and record producer (Holland–Dozier–Holland).Lamont Dozier obituary *Darryl Hunt, 72, English folk rock musician (The Pogues).Pogues pay tribute following death of bassist Darryl Hunt *Dame Olivia Newton-John, 73, British-Australian pop singer (\"I Honestly Love You\", \"Physical\") and actress (Grease), Grammy winner (1974, 1975, 1982), breast cancer.Olivia Newton-John, Australian Songstress and ‘Grease’ Star, Dies at 73 *Luis Enrique Oberto, 93, Venezuelan banker and politician, Minister of Finance (1972–1974), member (1979–1999) and President (1990–1994) of the Chamber of Deputies.Falleció el exministro Luis Enrique Oberto González *Zofia Posmysz, 98, Polish journalist, novelist (Passenger) and Holocaust survivor.Odeszła Zofia Posmysz *Jozef Tomko, 98, Slovak Roman Catholic cardinal, Secretary General of the Synod of Bishops (1979–1985) and Prefect for Evangelization of Peoples (1985–2001), problems caused by a fall.Zomrel kardinál Jozef Tomko, patril k najvplyvnejším ľuďom vo Vatikáne ===9=== *Ken Boles, 89, American politician and real estate developer, member of the Florida House of Representatives (1978–1982).Kenneth Eugene Boles *Raymond Briggs, 88, British children's writer and illustrator (Father Christmas, The Snowman, When the Wind Blows), pneumonia.Snowman author Raymond Briggs dies aged 88 *Ingemar Erlandsson, 64, Swedish footballer (Malmö FF, national team).Heartbreak as Malmo FF legend Ingemar Erlandsson dies after short illness aged 64 *Nicholas Evans, 72, English writer (The Horse Whisperer), heart attack.Nicholas Evans, author of The Horse Whisperer, dies aged 72 *Mario Fiorentini, 103, Italian partisan, spy and mathematician.Addio a Mario Fiorentini, il professore-partigiano simbolo della Resistenza *Willi O. Hoffmann, 92, German football shareholder, President of Bayern Munich (1979–1985).FC Bayern trauert um Willi O. Hoffmann *Mick Jones, 75, English footballer (Notts County) and manager (Peterborough United, Plymouth Argyle).Former Plymouth Argyle manager Mick Jones has passed away aged 75 (death announced on this date) *Rudi Koertzen, 73, South African cricket umpire, car crash.Umpire Rudi Koertzen passes away aged 73 *Gene LeBell, 89, American wrestler, martial artist and stunt performer (Darkman, L.A. Confidential, Total Recall).Wrestling Legend, Stuntman Gene Lebell Passes Away At 89 *Luigi Lucherini, 92, Italian politician, Mayor of Arezzo (1999–2006).È morto Luigi Lucherini: addio all'ex sindaco di Arezzo *Donald Machholz, 69, American astronomer.Don Machholz, 1952-2022 *Ibrahim al-Nabulsi, 18, Palestinian militant, Commander of the al-Aqsa Martyrs' Brigades, shot. *Alberto Orzan, 91, Italian footballer (Udinese, Fiorentina, national team).Lutto, è scomparso l’ex difensore Alberto Orzan *Nikolay Slyunkov, 93, Belarusian politician, First Secretary of the Communist Party (1983–1987).Умер бывший глава БССР Николай Слюньков *Maya Thevar, 87, Indian politician, MP (1973–1984), cardiac arrest.AIADMK’s first MP Maya Thevar passes away at the age of 88 *Sir Miles Warren, 93, New Zealand architect (Christchurch Town Hall).Sir Miles Warren ===10=== *Peter Byrne, 86, Irish sportswriter (The Irish Times).The death has occurred of Peter Byrne *Fernando Chalana, 63, Portuguese footballer (Benfica, Bordeaux, national team) and manager.Morreu Fernando Chalana *Lydia de Vega, 57, Filipino Olympic sprinter (1984, 1988), breast cancer.Lydia De Vega, 57, passes away *Kiril Dojčinovski, 78, Macedonian footballer (Vardar Skopje, Red Star Belgrade, Yugoslavia national team).Preminuo legendarni fudbaler Zvezde Kiril Dojčinovski *Hushang Ebtehaj, 94, Iranian-German poet.Iranian poet Houshang Ebtehaj passes away at 94 *Vesa-Matti Loiri, 77, Finnish actor (Uuno Turhapuro, The Boys, Sign of the Beast), musician and comedian, Eurovision contestant (1980), pancreatic and stomach cancer.Vesa-Matti Loiri on kuollut *Yi-Fu Tuan, 91, Chinese-American geographer.段義孚：為避免幽閉恐懼症，人類需要將整個宇宙當成遊樂場 *José Ángel Zalba, 80, Spanish sports executive, President of Real Zaragoza (1971–1977, 1988–1992).Muere José Ángel Zalba, expresidente del Zaragoza ===11=== *Michael Badnarik, 68, American software engineer, political activist and radio talk show host, 2004 presidential candidate.RIP Michael Badnarik *Darius Campbell, 41, Scottish pop singer-songwriter (\"Colourblind\", \"Rushes\", \"Incredible (What I Meant to Say)\") and opera performer.Darius Danesh: Pop idol and West End star dies aged 41 (body discovered on this date) *Paul Green, 49, Australian rugby league player (Cronulla-Sutherland, Queensland) and coach (North Queensland), Rothmans Medal winner (1995), suicide.Premiership-winning NRL coach Paul Green dies aged 49 *Anne Heche, 53, American actress (Another World, Volcano, Donnie Brasco), Emmy winner (1991), injuries caused by a car crash.Actor Anne Heche dies a week after car crash, aged 53 *Hanae Mori, 96, Japanese fashion designer, cardiopulmonary arrest.【独自】世界的なファッションデザイナー、森英恵さん死去…９６歳 *Manuel Ojeda, 81, Mexican actor (Romancing the Stone, Laberintos de pasión, Alborada).Fallece Manuel Ojeda, primer actor mexicano, a los 81 años *Bill Pitman, 102, American actor, guitarist and session musician (The Wrecking Crew), problems caused by a fall.Bill Pitman, Wrecking Crew Guitarist, Dies at 102 *Jean-Jacques Sempé, 89, French cartoonist (Le Petit Nicolas).Le dessinateur Jean-Jacques Sempé est mort *David Tomassoni, 69, American Olympic ice hockey player (1984) and politician, member of the Minnesota House of Representatives (1993–2001), State Senator (since 2001) and State Senate President (2020–2021), problems caused by ALS.Long Time Range Legislator Passes Away *József Tóth, 70, Hungarian footballer (Pécsi Dózsa, Újpesti Dózsa, national team) and manager. ===12=== *Lyle Bradley, 79, Canadian ice hockey player (California Golden Seals, Cleveland Barons).Walter \"Lyle\" Bradley *Claudio Garella, 67, Italian footballer (Sampdoria, Hellas Verona, Napoli), problems caused by heart surgery.L'ultima parata di Claudio Garella, il portiere dello scudetto è morto a 67 anni *Anshu Jain, 59, Indian-British banker, co-CEO of Deutsche Bank (2012–2015), stomach cancer.Former Deutsche Bank co-CEO Anshu Jain dies *Natalia LL, 85, Polish artist.Natalia LL nie żyje *Togo Palazzi, 90, American basketball player (Boston Celtics, Syracuse Nationals) and coach (Holy Cross Crusaders).Per the Celtics, Boston alumnus Togo Palazzi has passed away at the age of 90 *Wolfgang Petersen, 81, German movie director (Das Boot, The NeverEnding Story, Troy), screenwriter and producer, pancreatic cancer.Director Wolfgang Petersen Dies At 81; Hollywood Star Rose After ‘Das Boot’ To Include Hollywood Blockbusters ‘The Perfect Storm,’ ‘Air Force One’ & ‘In The Line Of Fire’ *Vyacheslav Semyonov, 74, Ukrainian footballer (Zorya Voroshilovhrad, Dnipro, Soviet Union national team), Olympic bronze medalist (1972).Помер динамовець В'ячеслав Семенов. Від імені клубу співчуття рідним та близьким висловив Ігор Суркіс *Diego Uribe Vargas, 90, Colombian politician, lawyer and academic, member of the Chamber of Representatives (1972–1974), Senator (1974–1990) and Minister of Foreign Affairs (1978–1981).Falleció el excanciller Diego Uribe Vargas *Aharon Yadlin, 96, Israeli educator and politician, MK (1959–1981) and Minister of Education (1974–1977), Israel Prize winner (2010).Умер бывший министр образования, лауреат премии Израиля Аарон Ядлин ===13=== *Piero Angela, 93, Italian television host, science journalist and writer.Morto Piero Angela, l’annuncio del figlio Alberto: “Buon viaggio papà” *Rossana Di Lorenzo, 84, Italian actress (Le coppie, Il comune senso del pudore, Le Bal).Morta l'attrice Rossana Di Lorenzo. Aveva 84 anni *Denise Dowse, 64, American actress (Beverly Hills, 90210, The Guardian, Coach Carter), problems caused by meningitis.Denise Dowse, From Insecure and Beverly Hills, 90210, Dead at 64 *David Kay, 82, American weapons inspector (Iraq Survey Group), cancer.David Kay, inspector who did not find nuclear weapons in Iraq, dies at 82 ===14=== *Rodolfo Bebán, 84, Argentine actor (Arm in Arm Down the Street, Juan Moreira, El Fantástico mundo de María Montiel).Murió el actor Rodolfo Bebán *Kristaq Dhamo, 89, Albanian actor and movie director (Tana, Botë e padukshme, Nga mesi i errësirës).Lamtumirë kineastit Dhamo, shuhet në SHBA ‘babai’ i filmit të parë! Nga meraku i tij për ‘Tanën’ e restauruar, te mesazhi për të mos u vënë kryq filmave shqiptarë *Robert E. Finnigan, 95, American chemist.Robert E. Finnigan *Nina Garsoïan, 99, French-born American Armenologist and academic, Dean of Princeton University Graduate School (1977–1979).Eminent Armenologist Nina Garsoïan Passes Away *Yosiwo George, 81, Micronesian politician, Governor of Kosrae (1983–1991) and Vice President (since 2015), COVID-19.FSM Vice President Yosiwo P. George dies at age 81 *Déwé Gorodey, 73, New Caledonian writer and politician, Vice President (2001–2009).Mort de Déwé Gorodey, figure de la littérature et de l'indépendantisme de Nouvelle-Calédonie *George Kernek, 82, American baseball player (St. Louis Cardinals).George Boyd Kernek *Ambrose Lee, 73, Hong Kong politician, Director of Immigration (1998–2002), Commissioner of the ICAC (2002–2003) and Secretary for Security (2003–2010), problems caused by a fall.Ex-security minister, NPC delegate Ambrose Lee dies *Arne Legernes, 91, Norwegian footballer (SK Freidig, Larvik Turn, national team).Arne Legernes *Svika Pick, 72, Polish-born Israeli pop singer-songwriter (\"Diva\") and television personality (Kokhav Nolad), cardiac arrest.1949-2022 | Zvika Pick, Israeli Composer and Pop Legend, Dies at 72 *Butch Thompson, 78, American jazz pianist and clarinetist.Butch Thompson, jazz pianist with 'A Prairie Home Companion' dies *Dmitri Vrubel, 62, Russian painter (My God, Help Me to Survive This Deadly Love), problems caused by COVID-19.Умер художник Дмитрий Врубель ===15=== *Frederick Buechner, 96, American novelist (A Long Day's Dying, Godric), theologian (Secrets in the Dark) and Presbyterian minister.Frederick Buechner, popular Christian ‘writer’s writer’ and ‘minister’s minister,’ dies at 96 *Richard Dujardin, 77, American journalist (The Providence Journal), fall.Rhode Island man clung to Kilbourn Avenue Bridge railing before losing grip, falling to death, report says *John Engen, 57, American politician, Mayor of Missoula (since 2006), pancreatic cancer.Missoula Mayor John Engen dies *Lenny Johnrose, 52, English footballer (Bury, Blackburn Rovers, Burnley), problems caused by motor neurone disease.Lenny Johnrose (1969-2022) *Bob Locker, 84, American baseball player (Chicago White Sox, Oakland Athletics, Chicago Cubs), World Series champion (1972).Robert Awtry Locker *Hans Magnusson, 73, Swedish dansband saxophonist (Thorleifs), bone cancer.Hasse Magnusson från Thorleifs är död *Tsuneko Sasamoto, 107, Japanese photojournalist.Pioneering Japanese woman photojournalist dies, aged 107 *Reiji Suzuki, 93, Japanese politician, Governor of Aichi Prefecture (1987–1993).鈴木礼治さん死去 元愛知県知事、９３歳 ===16=== *Duggie Brown, 82, English comedian and actor (Coronation Street, The Final Cut, Kes).Coronation Street star and comedian Duggie Brown dies aged 82 *Kal David, 79, American blues singer-songwriter and guitarist.Kal David, Musician, Voice of Disney World’s Sonny Eclipse Passes Away *Joseph Delaney, 77, British writer (Spook's).Joseph Delaney, creator of The Wardstone Chronicles, dies aged 77 *Eva-Maria Hagen, 87, German actress (Don't Forget My Little Traudel, Goods for Catalonia, Meine Freundin Sybille) and singer.Eva-Maria Hagen ist tot *Narayan, 81, Indian writer (Kocharethi), COVID-19.പ്രശസ്ത നോവലിസ്റ്റ് നാരായൻ അന്തരിച്ചു *Hans Peterson, 99, Swedish children's writer, suicide.Författaren Hans Peterson död *Odd Reinsfelt, 80, Norwegian meteorologist and politician, Mayor of Bærum (1992–2011).Tidligere ordfører Odd Reinsfelt er død *Wayne Yates, 84, American basketball player (Los Angeles Lakers) and coach (Memphis Tigers, Northwestern State Demons).Former Memphis basketball player, head coach Wayne Yates dies at 84 *Viktor Zozulin, 77, Russian actor (Operation Y and Shurik's Other Adventures, I Loved You, King Stag).Умер народный артист России Виктор Зозулин ===17=== *Sir Toby Curtis, 82, New Zealand educator and Māori leader (Te Arawa).Sir Toby Curtis, education giant, dies aged 82 *Jan De Crem, 94, Belgian politician, Mayor of Aalter (1959–1994).Ex-burgemeester van Aalter Jan De Crem (94) overleden *Niccolò Ghedini, 62, Italian lawyer and politician, Deputy (2001–2013) and Senator (since 2006), leukemia.E’ morto l’avvocato padovano Niccolò Ghedini, uno dei fedelissimi di Berlusconi *Motomu Kiyokawa, 87, Japanese actor (Neon Genesis Evangelion, Hellsing, By the Grace of the Gods), pneumonia.Evangelion Voice Actor Motomu Kiyokawa Passes Away *Zdeněk Mraček, 92, Czech neurosurgeon and politician, Mayor of Plzeň (1990–1994).prof. MUDr., DrSc. Zdeněk Mraček * 1930 †︎ 2022 *Mehdi Mujahid, 33–34, Afghan Hazara militia commander and Taliban commander.Taliban ‘Disgruntled’ Commander Killed in Western Afghanistan ===18=== *Ermano De Col, 79, Italian politician, Mayor of Belluno (2001–2006).E’ morto Ermano De Col, sindaco di Belluno all’inizio degli anni Duemila *Hadrawi, 79, Somali poet, philosopher and songwriter.Great Somali poet Hadrawi passed away in Hargeisa *Clayton Jacobson II, 88, American businessman, inventor of the jet ski.Jet Ski inventor Clayton Jacobson dies at 88 *Rolf Kühn, 92, German jazz clarinetist.Jazzklarinettist Rolf Kühn ist tot *Sombat Metanee, 85, Thai actor (Sugar Is Not Sweet, Tears of the Black Tiger, The Legend of Suriyothai) and politician, member of the House of Representatives (2006–2007).วงการบันเทิงสูญเสียครั้งใหญ่ สิ้น ‘สมบัติ เมทะนี’ พระเอกตลอดกาล วัย 85 ปี *Herbert Mullin, 75, American serial killer.California inmate who admitted 13 murders dies natural death *Virginia Patton, 97, American actress (It's a Wonderful Life, Black Eagle, The Lucky Stiff). *John Powell, 75, American discus thrower, Olympic bronze medalist (1976, 1984).John Powell *Milt Ramírez, 72, Puerto Rican baseball player (St. Louis Cardinals, Oakland Athletics).Fallece el expelotero Milton Ramírez *Josephine Tewson, 91, British actress (Keeping Up Appearances, Last of the Summer Wine, Gabrielle and the Doodleman).Josephine Tewson: Last Of The Summer Wine and Keeping Up Appearances actress dies aged 91 ===19=== *Tekla Juniewicz, 116, Polish supercentenarian, oldest living person in Poland (since 2017), stroke.Tekla Juniewicz, najstarsza Polka i druga najstarsza osoba na świecie, nie żyje *Ted Kirkpatrick, 62, American Christian metal musician (Tourniquet) and songwriter, idiopathic pulmonary fibrosis.Tourniquet Founder Ted Kirkpatrick Dead At 62 *Mildred Kornman, 97, American actress (Our Gang) and model. *David Marsh, 88, British amateur golfer and football administrator, Chairman of Everton F.C. (1991–1994).Former Everton Chairman Dr David Marsh Passes Away (death announced on this date) *Leon Vitali, 74, English actor (Barry Lyndon, Eyes Wide Shut, The Fenn Street Gang).Stanley Kubick collaborator and actor Leon Vitali dies aged 74 *John Wockenfuss, 73, American baseball player (Detroit Tigers, Philadelphia Phillies), problems caused by dementia.Longtime Detroit Tigers utilityman John Wockenfuss dies at 73 ===20=== *Barry Boehm, 87, American computer scientist and software engineer.Barry Boehm, a “Living Legend” in Systems and Software Engineering, Dies at 87 *Civan Canova, 67, Turkish actor (Home Coming, Üç Kuruş, Fatmagül'ün Suçu Ne?), playwright and theatre director, lung cancer.Civan Canova hayatını kaybetti *Darya Dugina, 29, Russian political activist, car bomb.Darya Dugina: Daughter of Putin ally killed in Moscow bomb *Helen Grayco, 97, American singer (The Spike Jones Show) and actress (That Certain Age, A Night at the Opera).Helen Grayco, R.I.P. *Cláudia Jimenez, 63, Brazilian actress (O Corpo, Escolinha do Professor Raimundo, Sai de Baixo) and comedian, heart failure caused by lung cancer.Claudia Jimenez morre no Rio aos 63 anos *Bram Peper, 82, Dutch sociologist and politician, Mayor of Rotterdam (1982–1998) and Minister of the Interior and Kingdom Relations (1998–2000).Oud-burgemeester van Rotterdam Bram Peper (82) overleden *Syed Sibtey Razi, 83, Indian politician, MP (1980–1985, 1988–1998) and Governor of Jharkhand (2004–2009) and Assam (2009), heart disease.Syed Sibtey Razi: पूर्व राज्यपाल सैयद सिब्ते रजी का लखनऊ में निधन, ट्रामा सेंटर में ली अंतिम सांस *Tom Weiskopf, 79, American golfer (PGA Tour) and golf course architect, pancreatic cancer.Tom Weiskopf, major champion and golf course architect, dies ===21=== *Vincent Gil, 83, Australian actor (Mad Max, Stone, Prisoner).Mad Max star Vincent Gil – aka The Nightrider – dies as co-star pays tribute *Anabel Gutiérrez, 90, Mexican actress (School for Tramps, Little Trapeze Angels) and comedian (Chespirito).Muere la actriz Anabel Gutiérrez, figura del Cine Mexicano *Sela Molisa, 72, Vanuatuan politician, MP (1982–2012) and Minister of Finance and Economic Management (2008–2010). *Alexei Panshin, 82, American novelist (Rite of Passage, The World Beyond the Hill) and science fiction critic, Nebula (1968) and Hugo Award (1990) winner.Alexei Panshin (1940-2022) *Jamey Rootes, 55, American sports executive, President of the Houston Texans (2005–2020).Jamey Rootes, former Texans and Dynamo exec, has died, wife announces ===22=== *Abolfazal Alijani, Iranian IRGC brigadier general, shot.Senior IRGC officer killed in Syria *Jerry Allison, 82, American Hall of Fame rock singer-songwriter (\"That'll Be the Day\", \"Peggy Sue\") and musician (The Crickets).Jerry Allison, drummer of Buddy Holly’s band The Crickets, dead at 82 *Stuart Anstis, 48, British extreme metal guitarist (Cradle of Filth).Ex-Cradle Of Filth guitarist Stuart Anstis dead at 48 (death announced on this date) *Shalom Cohen, 91, Israeli rabbi, Rosh yeshiva of Porat Yosef Yeshiva (since 1966).Rabbi Shalom Cohen, spiritual leader of the Shas party, dies at 91 *Gary Gaines, 73, American football coach (Abilene Christian, Texas Tech University), subject of Friday Night Lights, problems caused by Alzheimer's disease. *David Douglas-Home, 15th Earl of Home, 78, British businessman and politician, member of the House of Lords (since 1996).Deceased members *Rahimuddin Khan, 96, Pakistani Army general and politician, Governor of Balochistan (1978–1984) and Sindh (1988) and Chairman Joint Chiefs of Staff Committee (1984–1987).Balochistan peacemaker Rahimuddin Khan passes away *Theo Sommer, 92, German newspaper editor (Die Zeit) and academic.Theo Sommer ist tot *Margaret Urlich, 57, New Zealand pop rock singer (\"Escaping\", \"Number One (Remember When We Danced All Night)\", \"Boy in the Moon\"), cancer.Margaret Urlich - who sang The Horses with Daryl Braithwaite - dies aged 57 *Gérard Vignoble, 76, French technician and politician, MP (1988–1997, 2002–2007).Nord: Gérard Vignoble, ancien maire de Wasquehal est mort *Rembert Weakland, 95, American Roman Catholic prelate and Benedictine monk, Archbishop of Milwaukee (1977–2002).Former Archbishop of Milwaukee Rembert Weakland passes away at age 95 ===23=== *Rolando Cubela Secades, 90, Cuban revolutionary and physician, co-founder of Directorio Revolucionario Estudiantil.Falleció en Miami el excomandante cubano Rolando Cubela, quien intentó matar a Fidel Castro *Sandra Deal, 80, American education activist and teacher, First Lady of Georgia (2011–2019), breast cancer. *Božidar Delić, 66, Serbian Army general and politician, member (since 2007) and Vice President (2007–2012, since 2022) of the National Assembly.Преминуо Божидар Делић *Steven Hoffenberg, 77, American businessman, convicted of the Towers Financial Corporation ponzi scheme, owner of the New York Post (1993).Steven Hoffenberg, who worked with Jeffrey Epstein, found dead (body discovered on this date) *Esther Cooper Jackson, 105, American civil rights activist and social worker.Esther Jackson, 105: Life reflected the 20th century struggle for equality *Luiz Mancilha Vilela, 80, Brazilian Roman Catholic prelate, Bishop of Cachoeiro de Itapemirim (1985–2002) and Archbishop of Vitória (2002–2018).Morre arcebispo emérito de Vitória *Vytjie Mentor, 58, South African politician, MNA (2002–2014).State capture whistle-blower Vytjie Mentor passes away after battling a long illness *Lev Pitaevskii, 89, Russian theoretical physicist (Gross–Pitaevskii equation).E' morto a Rovereto il grande fisico russo Lev Petrovič Pitaevskij *Gerald Potterton, 91, British-Canadian movie director (Heavy Metal, Yellow Submarine, The Smoggies) and animator.Gerald Potterton, ‘Heavy Metal’ Director, Dies at 91 *Creed Taylor, 93, American jazz trumpeter and record producer, founder of Impulse! Records and CTI Records.Creed Taylor, Jazz Giant And Impulse! Founder Has Passed Away At The Age of 93 ===24=== *Len Dawson, 87, American Hall of Fame football player (Pittsburgh Steelers, Dallas Texans/Kansas City Chiefs) and broadcaster (Inside the NFL), Super Bowl champion (1970). *Jorge Domínguez, 77, Argentine politician, Mayor of Buenos Aires (1994–1996) and Minister of Defense (1996–1999), pneumonia.Murió Jorge Domínguez, ex ministro de Defensa y último intendente de la ciudad de Buenos Aires *Kazuo Inamori, 90, Japanese businessman, founder of Kyocera and KDDI and chairman of Japan Airlines (since 2010).Charismatic business leader Kazuo Inamori, founder of Kyocera, dies at 90 *Kallistos, 87, English Orthodox prelate and theologian, Metropolitan of Dioclea in Phrygia (since 2007).Metropolitan Kallistos Ware of Diokleia fell asleep in the Lord *Paul Knox, 88, Canadian ice hockey player (Toronto Maple Leafs), Olympic bronze medalist (1956).Paul Knox *Man of the Hole, 60s, Brazilian indigenous person.Last of his tribe, Amazon's 'man of the hole' dies (body discovered on this date) *Nicola Materazzi, 83, Italian mechanical engineer (Ferrari 288 GTO, Ferrari F40, Bugatti EB 110).L’Ingegner Nicola Materazzi ci ha lasciato – il papà della F40 si è spento a 83 anni *Tim Page, 78, English-born Australian photojournalist and war correspondent (Rolling Stone), liver cancer.Tim Page, Gonzo Photographer of Vietnam War, Is Dead at 78 *Lily Renée, 101, Austrian-born American comics artist.Lily Renée – RIP *William Reynolds, 90, American actor (The F.B.I., The Gallant Men, The Islanders), pneumonia.William Reynolds Dies: ‘The F.B.I.’ Actor Was 90 *Orlando de la Torre, 78, Peruvian footballer (Sporting Cristal, national team).Mundialista con Perú e ídolo de Cristal, Orlando ‘Chito’ La Torre, falleció a los 78 años ===25=== *Joey DeFrancesco, 51, American jazz musician.Joey DeFrancesco, driving force on the Hammond organ, dies at 51 *Graziella Galvani, 91, Italian actress (Shivers in Summer, Seduction, Miracles Still Happen).Graziella Galvani, la leggerezza del palcoscenico *Enzo Garinei, 96, Italian actor (Toto, Peppino and the Fanatics, No, the Case Is Happily Resolved, Banana Joe).Morto Enzo Garinei, una vita tra teatro, cinema e tv *Roger Jouet, 77, French writer and politician, member of the Regional Council of Normandy (1986–1992) and Mayor of Trévières (1971–1994).Historien, élu local et passionné par la Normandie, Roger Jouet est décédé *Saawan Kumar Tak, 86, Indian movie director (Saajan Bina Suhagan, Souten, Sanam Bewafa), producer and lyricist, lung disease.Filmmaker Sawan Kumar Tak Passes Away At The Age Of 86 After Prolonged Illness *Nel Noddings, 93, American feminist, educator, and philosopher.In Memoriam: Nel Noddings *Giles Radice, Baron Radice, 85, British politician, MP (1973–2001) and member of the House of Lords (2001–2022), cancer.‘Wise and kind’ Labour peer Giles Radice dies at 85 *Joe E. Tata, 85, American actor (Beverly Hills, 90210, Unholy Rollers, The Rockford Files), problems caused by Alzheimer's disease.'90210' Joe E. Tata Played Peach Pit Owner Nat Dead at 85 *Herman Van Springel, 79, Belgian road racing cyclist.Wielerwereld rouwt om \"Monsieur Bordeaux-Paris\" Herman Vanspringel ===26=== *Roland Mesnier, 78, French-born American chef and writer, White House Executive Pastry Chef (1980–2004), problems caused by cancer.Roland Mesnier, pastry chef for five presidents, dies at 78 *Aldo Mirate, 79, Italian politician, Deputy (1972–1979).Asti in lutto: è morto Aldo Mirate, principe del Foro ed ex parlamentare del Pci *Espen Skjønberg, 98, Norwegian actor (One Day in the Life of Ivan Denisovich, A Handful of Time, The Last Lieutenant).Skuespiller Espen Skjønberg er død *Hana Zagorová, 75, Czech pop singer-songwriter and actress (The Hit, Hrubeš a Mareš jsou kamarádi do deště) .Zemřela zpěvačka Hana Zagorová. Celý život bojovala s krutou nemocí ===27=== *Tadeusz Ferenc, 82, Polish economist and politician, Deputy (2001–2002) and Mayor of Rzeszów (2002–2021).Nie żyje Tadeusz Ferenc. Był wieloletnim prezydentem Rzeszowa *Robert LuPone, 76, American actor (Jesus Christ Superstar, The Sopranos, A Chorus Line) and artistic director, pancreatic cancer.Robert LuPone, Actor and Artistic Director, Dies at 76 *Mogens Palle, 88, Danish Hall of Fame boxing promoter and manager, melanoma.Mogens Palle er død *Manolo Sanlúcar, 78, Spanish flamenco composer and guitarist.Muere el guitarrista Manolo Sanlúcar *Milutin Šoškić, 84, Serbian footballer (Partizan, Yugoslavia national team) and manager (OFK Beograd), Olympic champion (1960).Velika tuga: Preminuo legendarni Milutin Šoškić *Emilio Trivini, 84, Italian rower, Olympic silver medalist (1964).Emilio Trivini ci ha lasciati === 28 === *Stefan Arczyński, 106, German-born Polish photographer.Zmarł Stefan Arczyński. Legendarny fotograf nie tylko Wrocławia *Ralph Eggleston, 56, American animator (The Lion King, WALL·E) and movie director (For the Birds), Oscar winner (2001), pancreatic cancer.Disney and Pixar Animator Ralph Eggleston Passes Away at 56 *Manzoor Hussain, 63, Pakistani field hockey player, Olympic champion (1984).National hockey legend Olympian Manzoor Hussain Jr passes away *Gastone Simoni, 85, Italian Roman Catholic prelate, Bishop of Prato (1992–2012).È morto mons. Gastone Simoni, per venti anni vescovo di Prato *Peter Stephan Zurbriggen, 79, Swiss Roman Catholic prelate, Apostolic Nuncio to Austria (2009–2018).Österreichs Kirche trauert um früheren Nuntius Zurbriggen ===29=== *Mick Bates, 74, Welsh politician, AM (1999–2011), cancer.Former Welsh Assembly Member Mick Bates dies after battle with cancer *Charlbi Dean, 32, South African actress (Triangle of Sadness, Spud, Black Lightning) and model.Charlbi Dean Dies: ‘Triangle Of Sadness’ Actor Was 32 *Vladimir Gusev, 90, Russian politician, Deputy Premier (1985–1990), Deputy (1994–2000) and Senator (2001–2012).На 91-м году жизни умер первый секретарь Саратовского обкома КПСС Владимир Гусев *Gwendolyn Midlo Hall, 93, American historian.Gwendolyn Midlo Hall, historian renowned for research into Louisiana slavery, dies at 93 *Hans-Christian Ströbele, 83, German lawyer and politician, MP (1985–1987, 1998–2017).Grünen-Politiker Hans-Christian Ströbele gestorben ===30=== *Gheorghe Berceanu, 72, Romanian wrestler, Olympic champion (1972).Doliu în sportul românesc. A murit Gheorghe Berceanu, campion olimpic la lupte greco-romane *Mikhail Gorbachev, 91, Russian politician, General Secretary of the Communist Party (1985–1991) and President of the Soviet Union (1990–1991), Nobel Prize (1990) and Grammy winner (2004).Mikhail Gorbachev, who ended the Cold War, dies aged 91 -agencies *Don L. Lind, 92, American astronaut.Decorated Utah astronaut Don Lind dies at 92 ===31=== *Domingo Liotta, 97, Argentine heart surgeon.Diamante pierde a un eximio representante ante el mundo *Lee Thomas, 86, American baseball player (Boston Red Sox, Los Angeles Angels) and executive (Philadelphia Phillies).Lee Thomas passes away *Bill Turnbull, 66, British journalist and presenter (BBC Breakfast, Songs of Praise, Think Tank), prostate cancer.Former BBC Breakfast host Bill Turnbull dies aged 66 ==Months== * January * February * March * April * May * June * July ==Related pages== * List of deaths due to COVID-19 * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 * Deaths in 2020 * Deaths in 2021 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *08 Category:August 2022 events",
 "title": "Deaths in August 2022"
}