{
 "id": "892115",
 "text": "The following is a list of deaths that happened in October 2022. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known), and a source. == October == ===1=== *Antonio Inoki, 79, Japanese professional wrestler (NJPW) and politician.アントニオ猪木さん死去 79歳 *Toab Khan, 88, Bangladeshi journalist (Janakantha). *Max Baer, 74, American jurist, chief justice of the Supreme Court of Pennsylvania (since 2021).Pa. Supreme Court Chief Justice Max Baer dies at 74 *Àngel Casas, 76, Spanish journalist, television talk show host and writer.Mor als 76 anys el mític periodista Àngel Casas, pioner del talk show a Catalunya ===2=== *Darshan Dharmaraj, 41, Sri Lankan actor (Prabhakaran, Ini Avan, Address Na), heart attack.Veteran actor Dharshan Dharmaraj passes away *Bjarne Mørk Eidem, 85, Norwegian politician, MP (1969–1993), minister of fisheries (1986–1989) and auditor general (1990–2005).Tidligere fiskeriminister Bjarne Mørk-Eidem er død *Éder Jofre, 86, Brazilian boxer, bantamweight (1960–1965) and WBC featherweight (1973–1974) champion, complications from pneumonia.Éder Jofre, ex-pugilista, morre aos 86 anos em SP *Rosetta Loy, 91, Italian writer, cardiac arrest.E' morta la scrittrice Rosetta Loy === 3 === *Ekow Blankson, 50, Ghanaian actor (Checkmate, Sun City).Veteran actor Ekow Blankson has passed on *Per Bredesen, 91, Norwegian footballer (Lazio, Ørn Horten, national team).Per Bredesen er død *David Huerta, 73, Mexican poet.Muere el poeta mexicano David Huerta *Jesús Quintero, 82, Spanish journalist, respiratory failure.Muere Jesús Quintero, el 'loco de la colina', a los 82 años *Pandurang Raut, 76, Indian politician, Goa MLA (1989–1994, 1999–2002).गोव्याचे माजी मंत्री पांडुरंग राऊत यांचे निधन *Jerzy Urban, 89, Polish journalist (Polityka, Nie) and writer.Jerzy Urban nie żyje. Miał 89 lat *Florin Zalomir, 41, Romanian fencer, Olympic silver medallist (2012).Florin Zalomir === 4 === *Ian Hamilton, 97, Scottish lawyer and independence activist (1950 removal of the Stone of Scone).Tributes paid to Ian Hamilton, advocate and 'liberator' of the Stone of Destiny *Loretta Lynn, 90, American Hall of Fame country singer-songwriter (\"Coal Miner's Daughter\", \"You Ain't Woman Enough (To Take My Man)\", \"The Pill\"), Grammy winner (1972, 2004).Loretta Lynn, Feisty First Lady of Country Music, Dies at 90 === 5 === *Wolfgang Kohlhaase, 91, German screenwriter (I Was Nineteen, Mama, I'm Alive) and film director (Solo Sunny).Filmlegende Wolfgang Kohlhaase gestorben ===6=== *Tekeste Baire, 69, Eritrean trade union activist (NCEW). *Ivy Jo Hunter, 82, American songwriter.Motown great Ivy Joe Hunter dies at age 82 *Noé Jitrik, 94, Argentine literary critic, stroke.Tenía 94 años. Falleció el ensayista y escritor Noé Jitrik *Sara Lee, 30, American professional wrestler (WWE).WWE Tough Enough winner Sara Lee has passed away *Jody Miller, 80, American country singer, Grammy winner (1966), Parkinson's disease.'Queen of the House' music artist Jody Miller dies *Phil Read, 83, English motorcycle racer, seven-time F.I.M. Road Racing champion.British great Phil Read dies aged 83 *Judy Tenuta, 72, American comedian, actress (The Weird Al Show), and musician, ovarian cancer.Judy Tenuta Dies: “Love Goddess” Comic & Actress Was 72 *Ankica Tuđman, 96, Croatian socialite.Ankica Tuđman, wife of the first Croatian president passes away === 7 === *Warren J. Baker, 84, American academic administrator, president of Cal Poly San Luis Obispo (1979–2010).President Emeritus Warren J. Baker Passes Away on Friday at Age 84 *Arun Bali, 79, Indian actor (Chanakya, Swabhimaan, Hey Ram).Veteran actor Arun Bali dies at 79 *Ronnie Cuber, 80, American jazz saxophonist.Addio a Ronnie Cuber (1941/2022) *Paul-Mounged El-Hachem, 88, Lebanese Maronite Catholic prelate, eparch of Baalbek-Deir El Ahmar (1995–2005).La morte dell’arcivescovo El-Hachem nunzio apostolico *Fernando González Gortázar, 79, Mexican architect, sculptor and writer.Fernando González Gortázar: se va un prolífico y apreciado artista *Winston Henry, 74, Trinidadian calypso artist.Veteran calypsonian Explainer dies *Horst Hülß, 84, German football player (Viktoria Köln, 1. FSV Mainz 05) and manager (SV Wiesbaden).Früherer Mainz-05-Trainer und -Spieler Horst Hülß gestorben *Toshi Ichiyanagi, 89, Japanese composer and pianist.現代音楽界をリード、作曲家の一柳慧さん８９歳で死去…オノ・ヨーコさんと一時期結婚 *Shoshana Netanyahu, 99, Israeli lawyer, justice of the Supreme Court (1981–1993).Retired High Court judge Shoshana Netanyahu dies at 99 *Toru Ohno, 87, Japanese literary scholar.大野徹さん死去 *Cheryl Roberts, 60, South African Olympic table tennis player (1992), cancer.Icon Cheryl Roberts loses her battle with cancer *Jure Robežnik, 89, Slovenian pianist and composer.Umrl je Jure Robežnik, velikan zlate dobe slovenske popevke *Robert I. Toll, 81, American homebuilder, co-founder of Toll Brothers, complications from Parkinson's disease.Toll Brothers Co-Founder Robert I. Toll Passes Away, Leaving Unmatched Legacy of Excellence in the Home Building Industry *Anna Wahlgren, 80, Swedish author.Författaren Anna Wahlgren död *Ivan Wolffers, 74, Dutch writer and physician, prostate cancer.Arts en schrijver Ivan Wolffers deelde zijn kennis graag, ook als het om zijn eigen toestand ging === 8 === *Jan Alma, 88, Dutch handball coach (women's national team).Voormalig succestrainer en bondscoach Jan Alma (88) overleden === 9 === *Wim de Jongh, 94, Dutch footballer (Elinkwijk, Vitesse).Voormalige topscorer Wim de Jongh (94) overleden *Bruce Pairaudeau, 91, Guyanese-New Zealand cricketer.Bruce Hamilton Pairaudeau *Bruno Latour, 75, French philosopher and sociologist (Laboratory Life, Science in Action, We Have Never Been Modern), pancreatic cancer.Bruno Latour, French philosopher and anthropologist, dies aged 75 *Wendy Smits, 39, Dutch handball player (national team).Oud- handbalinternational Wendy Smits (39) overleden === 10 === *Felix Hess, 81, Dutch artist and physician.Kunstenaar en natuurkundige Felix Hess (81) in Haren overleden === 11 === *, 76, Algerian da'i.Cheikh Abou Abdessalam s'éteint a l'age de 76 ans *Doru Ana, 68, Romanian actor (The Man of the Day, Next Stop Paradise, Stuff and Dough).Actorul Doru Ana a murit la vârsta de 68 de ani *Ken Barcus, 67, American journalist and editor (NPR), cancer.Remembering NPR's Ken Barcus, a tough editor with a big heart *, 68, Italian footballer (Taranto, Pisa, Parma).Si spegne una leggenda crociata: addio ad Enrico Cannata, ex giocatore e allenatore del Parma *, 86, Czech dancer, mime and actor.Odešel Jaroslav Čejka *A. Gopalakrishnan, 85, Indian nuclear engineer.Gopalakrishnan, a no-nonsense technocrat and nuclear safety expert passes away *Dame Angela Lansbury, 96, British-American actress (The Manchurian Candidate, Sweeney Todd, Murder, She Wrote) and singer, five-time Tony winner.Angela Lansbury, 'Murder, She Wrote' and 'Beauty and the Beast' star, dies at 96 *Roger Mergeay, 79, Belgian footballer (K.V. Mechelen).Oud- KV-Mechelen-speler Roger Mergeay overleden: “Papa was een echt voetbaldier” *Bill Nieder, 89, American shot putter, Olympic champion (1960).Former Kansas Legend Bill Nieder Passes Away (death announced on this date) *Sheikh Anne Rahman, 62, Bangladeshi politician, MP (since 2018).Lawmaker Sheikh Anne Rahman passes away *Reza Roosta Azad, 60, Iranian academic, chancellor of Sharif University of Technology (2010–2014).رضا روستا آزاد درگذشت *Altaf Ahmad Shah, 66, Indian Kashmiri separatist, renal cancer.Kashmir pro-freedom leader Altaf Ahmad Shah dies in India custody *Hilaire Schoonjans, 89, Belgian politician.Oud-CVP-burgemeester Hilaire Schoonjans (89) overleden, *Victor Steeman, 22, Dutch motorcycle racer, race crash injuries.World Supersport 300 rider Steeman passes away after crash *Angus Trumble, 58, Australian art curator and historian, director of the National Portrait Gallery of Australia (2014–2018).Former National Portrait Gallery director Angus Trumble dies (death announced on this date) === 12 === *Peter Gumpel, 98, German Jesuit priest and historian.È morto il gesuita tedesco Peter Gumpel, studioso e sostenitore di Pio XII *N. Kovaithangam, 73, Indian politician, Tamil Nadu MLA (2001–2011).Former MLA Coimbatore Thangam passed away due to ill health *Konstantin Landa, 50, Russian chess grandmaster.Ушел из жизни Константин Ланда (death announced on this date) *Nikolay Petrunin, 46, Russian politician, deputy (since 2016).Вячеслав Володин выразил соболезнования в связи с уходом из жизни депутата ГД Николая Петрунина *Karen Poniachik, 57, Chilean journalist and politician.Muere Karen Poniachik, exministra de Minería en la administración de Michelle Bachelet *Jef Turf, 90, Belgian politician and journalist.Jef Turf (90) overleden: ”Hij was de bekendste communist van Vlaanderen.” === 13 === *Jeff Barnaby, 46, Canadian film director (Rhymes for Young Ghouls, Blood Quantum), cancer.Jeff Barnaby, Canadian Indigenous Director of ‘Rhymes for Young Ghouls’, Dies at 46 *, 67, Italian journalist.Il motorsport perde una sua voce storica: è morto Giovanni Di Pillo *Fuzzy, 83, Danish composer (Eight Hours Don't Make a Day).Den folkekære komponist Fuzzy er død *Katsuya Kitamura, 36, Japanese professional wrestler (NJPW).Former NJPW young lion Katsuya Kitamura passes away *Verckys Kiamuangana Mateta, 78, Congolese saxophonist and composer.RDC : décès du musicien Verckys Kiamuangana Mateta *Mohamed Latiff Mohamed, 72, Singaporean poet and writer.Mohamed Latiff Mohamed, acclaimed Malay-language poet and novelist, dies at 72 *Susanna Mildonian, 82, Belgian harpist.La harpiste belge Susanna Mildonian est décédée (death announced on this date) *, 70, Swiss singer and composer (Krisma).È morta Christina Moser dei Krisma *Stavros Sarafis, 72, Greek football player (PAOK, national team) and manager, stroke.Πέθανε ο Σταύρος Σαράφης, παλαίμαχος ποδοσφαιριστής του ΠΑΟΚ *Kenneth M. Sayre, 94, American philosopher.In memoriam: Kenneth M. Sayre, professor emeritus of philosophy (death announced on this date) *Mike Schank, 56, American musician and actor (American Movie, Storytelling, Hamlet A.D.D.).Mike Schank, Milwaukee musician and co-star of the 1999 documentary 'American Movie,' dies at age 56 *Lennart Söderberg, 81, Swedish football player (AIK) and manager (Gefle, Västerås).Lennart ”Liston” Söderberg är död *John Spender, 86, Australian politician and diplomat.Independent MP Allegra Spender pays tribute to her late father John Spender remembering him as 'warm and generous' === 14 === *Robbie Coltrane, 72, Scottish actor (Harry Potter, Cracker, GoldenEye) and comedian.Actor Robbie Coltrane dies aged 72 *Jan van der Graaf, 85, Dutch church administrator, general secretary of the Reformed Association in the Protestant Church in the Netherlands (1973-2001).Dr. ir. Jan van der Graaf overleden *Feliks W. Kres, 56, Polish fantasy writer.Nie żyje Feliks W. Kres *Pim van de Meent, 84, Dutch football player and coach (PEC, De Graafschap, NEC Nijmegen). *Alexandros Nikolaidis, 42, Greek taekwondo athlete, Olympic silver medalist (2004, 2008), cancer.The Olympic medallist Alexandros Nikolaidis died of cancer *, 75, Spanish microbiologist and academic.Muere el prestigioso microbiólogo César Nombela Cano *Kedar Singh Phonia, 92, Indian politician, Uttar Pradesh (1991–2002) and Uttarakhand (2007–2012) MLA.उत्तराखंड की सियासत से दुखद खबर, नहीं रहे पूर्व कैबिनेट मंत्री Kedar Singh Phonia *Roberto Vencato, 70, Italian yacht racer.Mondo della vela in lutto: è morto l’olimpionico Roberto Vencato *Jurrit Visser, 70, Dutch politician.Oud- burgemeester Jurrit Visser van Terschelling overleden *Julien Vrebos, 75, Belgian movie director, Joseph Plateau Awards 1998 winner.Julien Vrebos, door en door Brussels regisseur *Ralf Wolter, 95, German actor (One, Two, Three, Cabaret, What Is the Matter with Willi?).Ralf Wolter ist tot (death announced on this date) === 15 === *Fons van Bastelaar, 100, Dutch politician.Oud- burgemeester Fons van Bastelaar overleden op 100-jarige leeftijd: ‘Zullen hem herinneren als warme persoonlijkheid’ *Khadija El Bidaouia, 69, Moroccan singer.Pioneer of Aita, Khadija El Bidaouia bids the world farewell *Theo Kley, 85, Dutch visual artist.De grondlegger van Ruigoord, Theo Kley, overleden *Jitendra Shastri, 65, Indian actor (Daud, Black Friday, Rajma Chawal).Jitendra Shastri Dies: Black Friday actor who also appeared in Mirzapur as Usman passes away === 16 === *Jüri Arrak, 85, Estonian painter.Suri kunstnik Jüri Arrak *Lodewijk van den Berg, 90, Dutch-born American chemical engineer and astronaut (STS-51-B).'Zeeuwse' astronaut Lodewijk van den Berg (90) overleden *Satya Mohan Joshi, 102, Nepali literary scholar (Hamro Lok Sanskriti).Culture expert and historian Satya Mohan Joshi passes away *Dilip Mahalanabis, 87, Indian pediatrician.Dilip Mahalanabis: নীরবেই চলে গেলেন ডাঃ দিলীপ মহলানবিশ, যাঁর দৌলতে স্বীকৃতি পায় ORS *Manoj Singh Mandavi, 58, Indian politician, Chhattisgarh MLA (since 2013), heart attack.Chhattisgarh Deputy Speaker Manoj Singh Mandavi passes away, CM Baghel expresses grief *Josef Somr, 88, Czech actor (Closely Watched Trains, The Joke, How the World Is Losing Poets).Popular theatre and film actor Josef Somr dies at 88 *Vaishali Takkar, 30, Indian actress (Sasural Simar Ka, Super Sisters - Chalega Pyar Ka Jaadu, Vish Ya Amrit: Sitara), suicide by hanging.Vaishali Takkar Passes Away: YRKKH Actress' Last Instagram Posts Were Comedy Reels and Navratri Bashes === 17 === *Ahmad Akbari, 75, Iranian Olympic fencer (1976).احمد اکبری جاوید درگذشت *Masum Aziz, 70, Bangladeshi actor (Ghani, Rabeya, Eito Prem), cancer.Actor Masum Aziz passes away *, 69, Ukrainian politician, MP (1998–2007).Помер екснардеп Борис Беспалий *Josef Fales, 84, Czechoslovak-born Ukrainian footballer (Karpaty Lviv).Умер легенда Карпат – он был причастен к успешному выступлению африканской сборной на чемпионате мира *Alan Halsey, 73, British poet.Halsey, Alan (death announced on this date) *Yury Klimov, 82, Russian handball player and coach, Olympic champion (1976).Не стало Юрия Климова *Rajes Perumal, 37, Malaysian footballer (PKNS, Kedah Darul Aman, Petaling Jaya City), traffic collision. *Ashot Sarkisov, 98, Russian nuclear physicist, member of the Russian Academy of Sciences.СКОРБНАЯ ВЕСТЬ... *Younoussi Touré, 80, Malian politician, prime minister (1992–1993) and president of the National Assembly (2012–2013).Mali: décès à Paris de Younoussi Touré, ex-premier ministre et ex-Président de l’Assemblée nationale *Jan de Winter, 83, Dutch sculptor, glazier and painter.Beeldend kunstenaar Jan de Winter (83) overleden === 18 === *Robert Arrigo, 67, Maltese politician, MP (since 2003) and mayor of Sliema (1994–2003), cancer.Nationalist MP Robert Arrigo dies, aged 67 *Charles Duncan Jr., 96, American businessman and politician, secretary of Energy (1979–1981), complications from a fall.Charles W. Duncan Jr., Energy Secretary in Oil Crisis, Is Dead at 96 *Ole Ellefsæter, 83, Norwegian cross-country skier, world champion (1966), Olympic champion (1968), and singer, cardiac arrest.OL- helten Ole Ellefsæter (83) er død *Franco Gatti, 80, Italian singer and musician (Ricchi e Poveri).Morto Franco Gatti dei Ricchi e Poveri *Robert Gordon, 75, American rockabilly singer, acute myeloid leukemia. *Horst Metz, 77, German politician, member of the Landtag of Saxony (1990–2009).Ehemaliger sächsischer Finanzminister Horst Metz verstorben *Bülend Özveren, 79, Turkish television presenter and sports commentator.Sunucu Bülent Özveren hayatını kaybetti *, 63, Ukrainian painter.Померла головна художниця Схід Опера Надія Швець *, 89, Romanian essayist and historian.A murit academicianul Eugen Simion. Fostul președinte al Academiei Române avea 89 de ani *Charlie Smithgall, 77, American politician, mayor of Lancaster, Pennsylvania (1998–2006), heart disease.Charlie Smithgall, Businessman and Former Lancaster Mayor, Dies *, 78, Russian politician.О кончине Ю.А.Зубакова === 19 === *Noureddine Farihi, 65, Moroccon-Belgian movie and television actor (Thuis, Yummy, Gansta), cancer.Acteur Noureddine Farihi overleden op 65-jarige leeftijd *Omar Borrás, 93, Uruguayan football manager (national team).Muere Omar Borrás, entrenador mundialista y campeón de América con Uruguay *, 83, Polish politician, deputy (1972–1985).Nie żyje Stanisław Ciosek *Kōji Nakamoto, 81, Japanese actor (Yawara!, Asako I & II), comedian, and guitarist (The Drifters), traffic collision.「ドリフ」仲本工事さん死去 18日横浜市で車にはねられる 81歳 *Eugene Bill Pryor, 84, Surinamese politician, co-founder and first president (1973-1987) of Broederschap en Eenheid in de Politiek, member of the National Assembly (1991-1996).Mede-oprichter BEP Eugene Bill Pryor overleden op 84-jarige leeftijd *Charley Trippi, 100, American Hall of Fame football player (Chicago Cardinals).Georgia football legend Charley Trippi dies at 100 *Ibrahim Zukanović, 64, Bosnian football player (Čelik Zenica) and manager (Sloga Uskoplje, Iskra Bugojno).Preminuo legendarni fudbaler i trener Ibro Zukanović === 20 === *Ron Masak, 86, American actor (Murder, She Wrote, Tora! Tora! Tora!, Evel Knievel).Ron Masak, Sheriff Mort Metzger on ‘Murder, She Wrote,’ Dies at 86 *Josephine Melville, 61, British actress (EastEnders, The Bill).Josephine Melville: Ex-EastEnders actress dies backstage after play *Charles Vanhoutte, 92, Belgian cyclo-cross cyclist.Veldritgrootheid Charles Vanhoutte (92) overleden === 21 === *Anneke Staring, Dutch field hockey player (Bloemendaal, national team), world champion (1971).Lid van Verdienste en oud-international Anneke Staring overleden (death announced on this date) *May Blood, Baroness Blood, 84, Northern Irish peer, member of the House of Lords (1999–2018).Former Labour peer Baroness May Blood passes away aged 84 *Masato Kudo, 32, Japanese footballer (Kashiwa Reysol, Sanfrecce Hiroshima, national team), complications from brain surgery.元日本代表FW工藤壮人が32歳で死去。水頭症の診断で手術、17日からICUで治療も帰らぬ人に *, 96, Czech screenwriter and dramaturge.Zemřel scenárista a dramatik Gustav Oplustil, nestor televizní zábavy *Yoshimi Osawa, 96, Japanese judoka, pneumonia.訃報 大澤慶己十段 *Harry White, 78, Australian jockey.Melbourne Cup-winning jockey Harry White dies, aged 78 *Xu Guangchun, 77, Chinese politician, CPC secretary of Henan (2004–2009).讣闻｜河南省委原书记徐光春逝世，曾为河南形象提升做出巨大贡献 === 22 === *Bernard Atha, 94, English actor (Kes, Coronation Street) and politician, mayor of Leeds (2000–2001).Hands-on former Leeds councillor and lord mayor Bernard Atha who had acting roles in Kes and Coronation Street has died === 24 === *Ken Fairweather, 77, New Zealand politician, MP (2007–2017).Former Sumkar MP and businessman Fairweather passes on *Leslie Jordan, 67, American actor (Will & Grace, Hearts Afire, Call Me Kat), Emmy winner (2006).Leslie Jordan, ‘Will & Grace’ and ‘American Horror Story’ Star, Dies at 67 in Car Accident *Gregg Philbin, American rock bassist (REO Speedwagon).Former REO Speedwagon Bassist Gregg Philbin Has Died *Anne van Gent, 96, Dutch politician.Oud-burgemeester Anne van Gent (96) van Zevenhuizen overleden (death announced on this date) === 25 === *Mohammad Abbas Ansari, 86, Indian Islamic cleric and political activist.Maulana Abbas Ansari Is No More *Husnija Arapović, 78, Bosnian football player (Čelik Zenica, Borac Banja Luka) and manager (Schaffhausen).Preminuo Husnija Arapović *Jules Bass, 87, American animator and television producer (Rudolph the Red-Nosed Reindeer, Frosty the Snowman, The Last Unicorn), co-founder of Rankin/Bass Productions.Jules Bass, Producer Behind the ‘Rudolph the Red-Nosed Reindeer’ and ‘Frosty the Snowman’ TV Specials, Dies at 87 *Othman Battikh, 81, Tunisian Islamic scholar.Décès du mufti de la République tunisienne Othman Battikh *, 75, Czech singer and actress (Hospital at the End of the City, My Sweet Little Village, Návštěvníci).Nemocnice a Vesnička pláčou: Zemřela kráska 60. let! (death announced on this date) *Mike Davis, 76, American author (City of Quartz, Late Victorian Holocausts, Set the Night on Fire) and activist, esophageal cancer.Mike Davis: 1946–2022 *Leonie Forbes, 85, Jamaican actress (Milk and Honey, Soul Survivor, Shattered Image), broadcaster and producer.Veteran broadcaster and actress Leonie Forbes has died *Jim Halligan, 86, American academic administrator (Oklahoma State University) and politician, member of the Oklahoma Senate (2008–2016).Former OSU President, state Senator Jim Halligan dies at 86 *Kim Keum-soo, 84, South Korean labor activist.'노동운동 원로' 김금수 한국노동사회연구소 명예이사장 별세 *Halit Kıvanç, 97, Turkish journalist (Milliyet, Tercüman, Hürriyet), television and radio presenter.Sunucu ve gazeteci Halit Kıvanç 97 yaşında vefat etti *, 87, Czech linguist and translator, director of the Institute of the Czech Language (1994–2002).Announcement of the loss of Prof. Jiří Kraus (death announced on this date) *Aristotelis Pavlidis, 78, Greek politician, minister for the Aegean (2004–2007).Πέθανε ο πρώην υπουργός Αριστοτέλης Παυλίδης *Paul Stoddard, American singer (Diecast).Diecast vocalist Paul Stoddard has passed away *Franco Stradella, 81, Italian businessman and politician, deputy (1996–2013).Alessandria piange Franco Stradella: la sua vita spesa per la politica e il territorio === 26 === *Mashallah Abdullayev, 72, Azerbaijan military officer, National Hero.Скончался Национальный герой Азербайджана *Barbara Cooper, 93, American politician, member of the Tennessee House of Representatives (since 1996).TN State Representative Barbara Cooper dies at 93 (death announced on this date) * Hans Galjaard, 87, Dutch professor.Hans Galjaard (87), vader van Erland Galjaard, overleden *Lia Origoni, 103, Italian singer and stage actress.Addio a Lia Origoni: la leggendaria cantante e attrice maddalenina è morta a 103 anni *Brian Robinson, 91, English road bicycle racer.British cycling pioneer Brian Robinson dies aged 91 *Mark Vanmoerkerke, 70, Belgian senator (1994–1995) and businessman (Sunparks owner).Mark Vanmoerkerke (1952-2022): Oostendse selfmade man van de tweede generatie === 27 === *Nipon Goswami, 80, Indian actor (Shakuntala Aru Sankar Joseph Ali, Hiya Diya Niya, Jonaki Mon).Veteran Assamese Actor Nippon Goswami Passes Away *Irakli Khakhubia, 51, Georgian economist, engineer and politician.В Тбилиси нашли мертвым депутата правящей партии *Satheeshan Pacheni, 54, Indian politician, stroke.Congress leader Satheesan Pacheni passes away === 28 === *Jerry Lee Lewis, 87, American Hall of Fame singer (\"Great Balls of Fire\", \"Whole Lotta Shakin' Going On\", \"High School Confidential\").Jerry Lee Lewis, Rock Pioneer and ‘Great Balls of Fire’ Singer, Dies at 87 *D. H. Peligro, 63, American drummer (Dead Kennedys, Red Hot Chili Peppers), head trauma.Dead Kennedys drummer D. H. Peligro dead at 63 === 29 === *Hugo Camps, 79, Belgian journalist, columnist and writer.Belgische schrijver en columnist Hugo Camps (79) overleden *François Chesnais, 88, French economist.Morreu o economista François Chesnais *Ryan Karazija, 40, American-Icelandic musician (Low Roar).Low Roar front man and Death Stranding contributor Ryan Karazija passes away at 40 (death announced on this date) *Donal Moynihan, 81, Irish politician, TD (1982–1989, 1992–2007).Former Cork North West TD Donal Moynihan passes away *Lukas Nola, 58, Croatian film director (Russian Meat, Celestial Body, Alone), cancer. *, 83, South Korean journalist and politician.한국일보 출신 박실 전 국회의원 별세 *Hava Pinhas- Cohen, 67, Israeli poet and writer.Elhunyt Hava Pinhas-Cohen izraeli költő *Robin Sylvester, 71–72, British bassist (RatDog).RatDog bassist Robin Sylvester: 1950-2022 === 30 === *Rien van Haaften, 72, Dutch football referee.Oud-profscheidsrechter met olifantenhuid Rien van Haaften overleden *Rosemarie Köhn, 83, German-born Norwegian Church of Norway clergywoman, bishop of Hamar (1993–2006).Rosemarie Köhn (83) er død === 31 === *T. J. Chandrachoodan, 82, Indian politician.Former RSP general secretary and a stalwart of the left movement in Kerala, Prof. T. J. Chandrachoodan, passes away *Danny Javier, 75, Filipino musician (APO Hiking Society).Danny Javier of APO Hiking Society passes away *Jeremy Mansfield, 59, South African radio presenter (Radio 702, 947), liver cancer. *Humphrey Bamisebi Olumakaiye, 53, Nigerian archbishop, bishop of Lagos (since 2018).Most Reverend Olumakaiye, Anglican Archbishop Of Lagos Province, Dies At 53 *Alan Thomson, 76, Australian cricketer (Victoria, national team).‘A very different action’: Fast bowler Alan ‘Froggy’ Thomson dies ==Months== * January * February * March * April * May * June * July * August * September ==Related pages== * List of deaths due to COVID-19 * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 * Deaths in 2020 * Deaths in 2021 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *10 Category:October 2022 events",
 "title": "Deaths in October 2022"
}