{
 "id": "892117",
 "text": "The following is a list of deaths that happened in December 2022. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known), and a source. == December == === 1 === *Albert Bruschke, 87, Dutch cardiologist, professor at Leiden University Medical Center (1984-2000).In memoriam: Albert Bruschke *Mylène Demongeot, 87, French actress (The Crucible, French California, 36 Quai des Orfèvres), primary peritoneal carcinoma.Mort de Mylène Demongeot : l'actrice est décédée à l'âge de 87 ans *Sylvia La Torre, 89, Filipino actress (One Two Bato, Three Four Bapor) and singer.Sylvia La Torre, Queen of Kundiman, dies at 89 *Quentin Oliver Lee, 34, American baritone and actor (The Phantom of the Opera), colon cancer.Broadway actor Quentin Oliver Lee dies of cancer at 34 *Gaylord Perry, 84, American Hall of Fame baseball player (San Francisco Giants, Cleveland Indians, San Diego Padres).Gaylord Perry, two-time Cy Young winner, dies at 84 === 2 === *Hans Bassant, 79, Dutch footballer (Excelsior Rotterdam).OUD-SPELER HANS BASSANT OVERLEDEN *Frans de Haan, 84, Dutch basketball player (The Wolves Amsterdam, national team) and golfer.death announcement *Floris Maljers, 89, Dutch business executive.Oud-Unilevertopman Maljers (89) overleden === 4 === *Jack van Poll, 88, Dutch jazz musician, music arranger and composer.Muzikant Jack van Poll (1934-2022) kon geen noot lezen: 'Je hoorde wat en dat deden we na’ *Ludo Van Thillo, 91, Belgian businessman.Ludo Van Thillo, erevoorzitter van DPG Media, overleden === 5 === *Kirstie Alley, 71, American actress (Cheers, Veronica's Closet, Star Trek II: The Wrath of Khan), Emmy winner (1991, 1994), cancer.Kirstie Alley, ‘Cheers’ and ‘Look Who’s Talking’ Star, Dies at 71 *Claude C. Krijgelmans, 88, Belgian writer, translator and painter.OBITUARY Claude Krijgelmans *Jim Stewart, 92, American Hall of Fame record producer, co-founder of Stax Records.Stax Records co-founder, Rock 'n' Roll Hall of Famer Jim Stewart dies at 92 *Pascale Vandegeerde, 64, Belgian activist.Enige vrouwelijke CCC-lid Pascal Vandegeerde overleden (death announced on this date) === 6 === *Miha Baloh, 94, Slovenian actor (And Love Has Vanished, Among Vultures, Winnetou and the Crossbreed).Poslovil se je igralec Miha Baloh *Jet Black, 84, English drummer (The Stranglers).Jet Black: 'Inspirational' drummer for the Stranglers dies aged 84 *Mills Lane, 85, American boxing referee and television personality (Judge Mills Lane, Celebrity Deathmatch).Beloved Reno icon Mills Lane dies at age 85 *Bart de Vries, 57, Dutch stage and television actor (Soldier of Orange, 3 Musketiers), COVID-19.Acteur Bart de Vries (57) overleden === 7 === *Johan de Jong, 81, Dutch biologist and barn owl expert.Bioloog en uilendeskundige Johan de Jong overleden *Helen Knopper, 88, Dutch writer and translator.Nieuws: Helen Knopper (1934-2022) overleden *Ton Sprangers, 65, Dutch footballer (NAC Breda).Oud NAC-speler Ton Sprangers op 65-jarige leeftijd overleden (death announced on this date) === 8 === *Patrick Delsemme, 48, Belgian snooker player.Snookerwereld in diepe rouw: ex-Belgisch kampioen Patrick Delsemme (48) plots overleden *Max van Rooy, 65, Dutch writer and journalist.Max van Rooy (1942-2022), 44 jaar de biograaf van zijn opa, architect H.P. Berlage *René Snelders, 85, Belgian footballer and businessman.René Snelders, gewezen sterke man van Germinal Ekeren en vader van Eddy, is overleden === 9 === *Ruth Madoc, 79, British actress (Hi-de-Hi!, Fiddler on the Roof, Little Britain), and singer.Ruth Madoc: Hi-de-Hi! actress dies aged 79 *Thiemo Meertens, 76, Dutch footballer and football manager.Voormalig voetbaltrainer Thiemo Meertens (76) overleden === 10 === *Georgia Holt, 96, American singer and actress (Watch the Birdie, Grounds for Marriage), subject of Dear Mom, Love Cher.Cher confirms her mother Georgia Holt death at 96 === 11 === *Chris Boucher, 79, British television screenwriter (Doctor Who, Blakes 7, Shoestring) and novelist.Chris Boucher 1943 - 2022 *Peter Ester, 69, Dutch sociologist and politician, senator (since 2011).ChristenUnie-Eerste Kamerlid Peter Ester (1953) overleden *Pieter ter Veer, 77, Dutch politician, MP (1981-1982; 1989-2002).Melkveehouder en Oud- Kamerlid D66 Pieter ter Veer uit Zuidhorn overleden === 12 === *Joke Folmer, 99, Dutch resistance member.Verzetsstrijder Joke Folmer (99) overleden (death announced on this date) === 13 === *Sol Amarfio, 84, Ghanaian drummer (Osibisa).Sol Amarfio, a founding member of the Osibisa band has died *Al De Boeck, 79, Belgian poet.Dichter Al De Boeck is overleden *Johanna Diepeveen- Speekenbrink, 86, Dutch nurse.Johanna Diepeveen-Speekenbrink (1936-2022): ‘Voorvechter van de emancipatie van de verpleegkunde’ *Han Peekel, 75, Dutch television presenter.Televisiemaker Han Peekel, die Peter R. de Vries als laatste interviewde, overlijdt tijdens vakantie *Curt Simmons, 93, American baseball player (Philadelphia Phillies, St. Louis Cardinals, Chicago Cubs).Curt Simmons, member of 1950 'Whiz Kids,' dies at 93 === 14 === *Karel van Eerd, 84, Dutch businessman (Jumbo).Grondlegger Karel van Eerd (84) van supermarktketen Jumbo overleden *Jacob Luitjens, 103, Dutch Nazi collaborator.Oud-NSB'er Jacob Luitjens, de Schrik van Roden, overleden === 15 === *Karel Anthierens, 87, Belgian journalist (Humo, Het Laatste Nieuws, Knack, Panorama).Oud-journalist Karel Anthierens (87) overleden *Dino Danelli, 78, American drummer (The Rascals).Dino Danelli, The Rascals’ Drummer, Dies at 78 *Joop Dikmans, 92, Dutch actor (Bassie & Adriaan).Acteur Joop Dikmans, slechthorende boef B2 van Bassie en Adriaan, overleden *Shirley Eikhard, 67, Canadian singer-songwriter (\"Something to Talk About\", \"It Takes Time\", \"Smiling Wine\").Grammy Winning Canadian Songwriter Shirley Eikhard Dead at 67: Publicist Eric Alper === 16 === *Janine Delruelle-Ghobert, 91, Belgian politician and judge. *Robin Dowell, 40, Swiss rowing coach, boat accident.Robin Dowell *Jane Sherwin, 88, British actress (Doctor Who, Blakes 7).Jane Sherwin === 17 === *Mike Hodges, 90, British screenwriter and director (Get Carter, Pulp, Flash Gordon).Mike Hodges, British Director of ‘Get Carter,’ ‘Croupier,’ Dies at 90 *Jacky Jakoba, 61, Dutch baseball player (Neptunus, national team), European champion (1985, 1987), Olympian (1988).Voormalig Quick-honkballer Jacoba overleden *Bas Kuijlenburg, 60, Dutch opera singer (Dutch National Opera), traffic accident.Culemborg rouwt om verlies muzikale ‘omnivoor’ Bas Kuijlenburg na frontale botsing met ambulance *Wolfgang von Hacht, 65, German businessman, founder of .Stevens-oprichter Wolfgang von Hacht overleden (death announced on this date) *Hedwig Selles, 54, Dutch writer and poet.Overleden Zwolse poëet Hedwig Selles (54) was ‘mentaal wereldkampioen’ === 18 === *Maurice Ferares, 100, Dutch resistance member, politician, writer and violist.Netherlands – Maurice Ferares (1922-2022) always in resistance *Hans Grosheide, 92, Dutch politician, MP (1971), state secretary for education (1963–1971) and justice (1971–1973).Oud- ARP- en CDA-politicus Hans Grosheide overleden *Greetje den Ouden-Dekkers, 82, Dutch politician, MP (1982–1986).Oud-Kamerlid Greetje den Ouden-Dekkers (VVD) overleden *Marc van der Poel, 65, Dutch linguist, professor of Latin language and Philology (Radboud University Nijmegen).In Memoriam M.G.M. van der Poel (1957-2022) *Terry Hall, 63, English singer (The Specials, Fun Boy Three) and songwriter (\"Our Lips Are Sealed\").Terry Hall: lead singer of the Specials dies aged 63 === 19 === *Max Brito, 51, Ivorian rugby union player (national team).Max Brito, who was paralysed at the 1995 Rugby World Cup, has died *Tom Browning, 62, American baseball player (Cincinnati Reds, Kansas City Royals), World Series champion (1990).Reds pitching legend Tom Browning dead at 62 *Luc De Schepper, 65, Belgian physicist and professor, rector of the Hasselt University.Voormalig rector UHasselt Luc De Schepper overleden *Ger Luijten, 66, Dutch art historian (Rijksmuseum, Fondation Custodia).Ger Luijten: een zeldzaam begeesterde kenner van de teken- en prentkunst === 20 === *Nasser Abu Hamid, 50, Palestinian militant, Cancer and medical negligence by Israel. === 21 === *Doug Baker, 93, English rugby union player (Barbarian F.C., British & Irish Lions, national team).1955 Lion Baker passed away *Tony Barry, 81, Australian actor (Australia, Goodbye Pork Pie, The Time of Our Lives), melanoma.Tony Barry *Aminah Cendrakasih, 84, Indonesian actress (Si Doel Anak Sekolahan, Tjambuk Api, Mustika Ibu).Aminah Cendrakasih, Pemeran Mak Nyak di Si Doel Anak Sekolahan Meninggal Dunia === 22 === *Thom Bell, 79, Jamaican-born American songwriter (\"The Rubberband Man\", \"La-La (Means I Love You)\", \"Mama Can't Buy You Love\"), arranger and record producer.Philly Legendary Producer and Songwriter Thom Bell Dead At 79 *Stephan Bonnar, 45, American mixed martial artist (UFC) and professional wrestler (Impact Wrestling).UFC Hall of Famer Stephan Bonnar dies at age 45 *Herman Plugge, 83, Dutch mountaineer.Nestor Nederlandse bergsport Herman Plugge (83) overleden: 'Het zweet gutst niet meer' *Ronan Vibert, 58, British actor (Saving Mr. Banks, The Scarlet Pimpernel, The Snowman).Ronan Vibert Dies: Actor In ‘Saving Mr. Banks’ And ‘The Pianist’ Was 58 === 23 === *Stephen Greif, 78, British actor (Blakes 7, Casanova, Nicholas and Alexandra).The Crown actor Stephen Greif dies aged 78 *Maxi Jazz, 65, English musician (Faithless).Faithless singer Maxi Jazz dies aged 65 *Ward Smets, 93, Belgian puppeteer.Legendarische poppenspeler Ward Smets (93) overleden === 24 === *John Bird, 86, English actor (Red, White and Zero, A Dandy in Aspic) and comedian (Not So Much a Programme, More a Way of Life).Satirist John Bird dies on Christmas Eve – Rory Bremner calls him ‘one of the greatest’ *Arthur Boni, 88, Belgian-Dutch actor.Acteur Arthur Boni overleden op 88-jarige leeftijd *Hub van Laar, 58, Dutch musical instruments maker.TRUMPET WORLD MOURNS ITS HUB === 25 === *Joep Geraedts, 74, Dutch academic.In memoriam Joep Geraedts *Joop Glimmerveen, 94, Dutch political activist.Neonazi en oud-leider NVU Joop Glimmerveen (94) overleden *John Leddy, 92, Dutch actor (Zeg 'ns Aaa).Zeg 'ns Aaa-acteur John Leddy (92) overleden *Loekie Roeg-Rogge, 81, Dutch field hockey referee.Oud- internationaal scheidsrechter Loekie Rogge overleden *Jan Slomp, 90, Dutch preacher and Islam expert, bacterial infection.Islamkenner dr. Jan Slomp overleden === 26 === *Blasco Giurato, 81, Italian cinematographer (Cinema Paradiso, A Pure Formality, The Game Bag).E' morto il dop Blasco Giurato *Lars Lönndahl, 94, Swedish singer and actor (Swinging at the Castle).Lasse Lönndahl är död - blev 94 år gammal *Christian Roberts, 78, British actor (To Sir, with Love, The Anniversary, The Mind of Mr. Soames). === 27 === *Frans B. Van Zaelen, 92, Belgian artist.Kunstenaar Frans B. Van Zaelen overleden: “In het buitenland op handen gedragen, in eigen stad vergeten” === 28 === *Draga Ahačič, 98, Slovenian actress, movie director and translator.Umrla je Draga Ahačič (1924–2023) *Fernand Devestel, 92, Belgian nurse, Superior General of Brothers of Charity (1976-2000).Gewezen topman Broeders van Liefde, Waldebert Devestel in Zelzaats rusthuis overleden *Rien van den Heuvel, 84, Dutch monk.Dom Rien van den Heuvel van de Willibrordsabdij in Doetinchem overleden *Gerard Schuurman, 82, Dutch footballer (FC Den Bosch).Voormalig FC Den Bosch- voetballer Gerard Schuurman, eerste speler die rood kreeg in de eredivisie, op 82-jarige leeftijd overleden === 29 === *Eduard Artemyev, 85, Russian composer (At Home Among Strangers, Siberiade, Burnt by the Sun), People's Artist of Russia (1999), problems caused by pneumonia.Умер Эдуард Артемьев *Keenan Cahill, 27, American internet celebrity, problems caused by heart surgery.YouTube Star Keenan Cahill Dead at 27 *Ruggero Deodato, 83, Italian movie director (Cannibal Holocaust, Ultimo mondo cannibale, Live Like a Cop, Die Like a Man).È morto Ruggero Deodato, regista di Cannibal Holocaust che ha influenzato anche Tarantino *Patrick Dik, 57, Dutch footballer (Ajax, FC Utrecht, NAC Breda).NAC Breda rouwt om overlijden van oud-speler Patrick Dik (57) *Margriet Eshuijs, 70, Dutch singer.Zangeres Margriet Eshuijs (70) overleden *Pelé, 82, Brazilian footballer (Santos, national team), minister of sports (1995–1998) and three-time World Cup champion, colon cancer.Brazilian football star Pele has died at the age of 82 *Prakash Poddar, 82, Indian cricketer (Bengal, Rajasthan).Prakash Poddar, former Indian cricketer who first recommended MS Dhoni to BCCI, dies *Dame Vivienne Westwood, 81, British fashion designer.Fashion designer Vivienne Westwood dies *Baukje Wytsma, 76, Dutch writer and poet.Baukje Wytsma (76), schrijfster 'Bonkefeartliet' en 'Simmer 2000' overleden === 30 === *Vladimer Barkaia, 85, Georgian footballer (Dinamo Tbilisi, Soviet Union national team).ვლადიმერ ბარქაია 85 წლის ასაკში გარდაიცვალა (in Georgian) *Robert Dowling, 83, American magazine publisher (The Hollywood Reporter).Robert Dowling Dies: The Hollywood Reporter's Former Publisher Was 83 *Miklós Duray, 77, Slovak politician, Hungarian minority political representative in Slovakia, MP (1992–2010).Zomrel politik a signatár Charty 77 Miklós Duray *Brian Glencross, 81, Australian Olympic field hockey player, bronze medallist (1964), silver medallist (1968) and coach.Vale Brian Glencross 1941-2022 *Uche Nwaneri, 38, American football player (Jacksonville Jaguars).Former Purdue, NFL player dies in West Lafayette home *Terence O'Brien, 86, English-born New Zealand diplomat, ambassador to Belgium (1983–1986).Top NZ diplomat Terence O'Brien dies *Shmuel Toledano, 101, Israeli intelligence officer and politician, MK (1977–1981).הלך לעולמו בכיר המוסד לשעבר שמואל טולידאנו *Barbara Walters, 93, American Hall of Fame television journalist (Today, 20/20) and talk show host (The View).Barbara Walters, pioneering TV journalist who began on 'TODAY,' dies at 93 *Don West, 59, American commentator (Impact Wrestling) and pitchman (Shop at Home Network), lymphoma.Former TNA/IMPACT Announcer Don West Passes Away *Janez Zemljarič, 94, Slovenian politician, prime minister of the Socialist Republic (1980–1984).Umrl je Janez Zemljarič === 31 === *Benedict XVI, 95, German Roman Catholic prelate and theologian (Introduction to Christianity), Pope (2005–2013) and archbishop of Munich and Freising (1977–1982).Former Pope Benedict XVI dies at 95 *Jeremiah Green, 45, American indie rock drummer (Modest Mouse), cancer.Jeremiah Green, Modest Mouse Drummer, Dead at 45 *Anita Pointer, 74, American singer (The Pointer Sisters).Anita Pointer, founding member of the Pointer Sisters, dies at age 74 ==Months== * January * February * March * April * May * June * July * August * September * October * November ==Related pages== * List of deaths due to COVID-19 * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 * Deaths in 2020 * Deaths in 2021 ==References== *12 Category:December 2022 events",
 "title": "Deaths in December 2022"
}