{
 "id": "892107",
 "text": "The following is a list of deaths that happened in 2022\\. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known), and a source. ==March== ===1=== *Brahim Boutaleb, 84, Moroccan historian, academic and politician, Deputy (1977–1983).Décès de l'historien marocain Brahim Boutaleb *Conrad Janis, 94, American musician and actor (Mork & Mindy, Margie, That Hagen Girl).Conrad Janis, Father on ‘Mork & Mindy’ and Much More, Dies at 94 *Alevtina Kolchina, 91, Russian cross-country skier, Olympic champion (1964), silver (1956) and bronze (1964, 1968) medalist.Умерла олимпийская чемпионка по лыжным гонкам Алевтина Колчина *Warner Mack, 86, American country blues singer-songwriter (\"Is It Wrong (For Loving You)\", \"The Bridge Washed Out\") and guitarist. *Yevhen Malyshev, 19, Ukrainian biathlete and soldier, shot.Загинув Євгеній Малишев (death announced on this date) *Alfred Mayer, 85, Austrian politician, Landesrat of Vorarlberg (1974–1993).Vorarlberg trauert um Alt-Landesrat Fredy Mayer ===2=== *Alan Anderson, 82, Scottish footballer (Millwall, Hearts, national team). (death announced on this date) *Israel Beltrán Montes, 74, Mexican businessman and politician, Deputy (1991–1994, 2006–2009), problems caused by COVID-19.Fallece Israel Beltrán, empresario radiofónico y destacado político cuauhtemense *Johnny Brown, 84, American actor (Good Times, Rowan & Martin's Laugh-In, The Plastic Man Comedy/Adventure Show), comedian and singer. *Yosef Carmon, 88, Israeli actor (Alila, Sweet Mud, The Farewell Party) and stage director, problems caused by dementia.Yosef Carmon, one of Israel's top theatre actors, passes at 88 *Clement Crisp, 90, British dance critic (Financial Times). *Kenneth Duberstein, 77, American lobbyist, White House Chief of Staff (1988–1989). *Eberhard Goldhahn, 94, German politician, East Germany MP (1990) and MP (1990).Eberhard Goldhahn *Alan Ladd Jr., 84, American movie producer (Braveheart, Gone Baby Gone) and studio businessman, President of 20th Century Fox (1976–1979), Oscar winner (1996). *Autherine Lucy, 92, American civil rights activist and academic, first African-American student to attend the University of Alabama. *Jean-Pierre Pernaut, 71, French news presenter and broadcaster (TF1), lung cancer. *Robert John Rose, 92, American Roman Catholic prelate, Bishop of Gaylord (1981–1989) and Grand Rapids (1989–2003). *Volodymyr Struk, 57, Ukrainian politician, Deputy (2012–2014) and Mayor of Kreminna (since 2020), shot.На Луганщині знайшли застреленим мера-сепаратиста Струка *Frédérick Tristan, 90, French writer, essayist and poet.Le romancier et poète Frédérick Tristan, lauréat du prix Goncourt 1983, est mort à l'âge de 90 ans *Tony Walton, 87, British set and costume designer (Pippin, All That Jazz, Mary Poppins), Tony (1973, 1986, 1992), Oscar (1979) and Emmy (1986) winner, problems caused by a stroke. ===3=== *Şenol Birol, 86, Turkish footballer (Beşiktaş, Fenerbahçe, national team) and manager.Efsane futbolcu Şenol Birol hayatını kaybetti *Valeriy Chybineyev, 34, Ukrainian Air Assault Forces major and sniper, shot.Пам'яті загиблого 3 березня в бою за Гостомель Героя України Валерія Чибінєєва *Thomas B. Hayward, 97, American Navy admiral, Chief of Naval Operations (1978–1982). *Tim Considine, 81, American actor (Spin and Marty, Hardy Boys, My Three Sons), photographer and historian. *Bruce Johnstone, 85, South African racing driver. *Walter Mears, 87, American journalist (Associated Press) and educator, subject of The Boys on the Bus, Pulitzer Prize winner (1977), cancer. *Abune Merkorios, 83, Ethiopian Orthodox prelate, Patriarch of the Ethiopian Orthodox Tewahedo Church (1988–1991, since 2018). *Jun Misawa, 69, Japanese baseball player (Chunichi Dragons, Hokkaido Nippon-Ham Fighters) and politician, MP (1996–2000), problems caused by mesothelioma.中日などで投手として活躍した三沢淳さんが死去 69歳・中皮腫 1996年から衆院議員も1期務める *Shane Olivea, 40, American football player (Ohio State Buckeyes, San Diego Chargers, New York Giants). *Albert Pobor, 65, Croatian football manager (Cerezo Osaka, Hrvatski Dragovoljac, Brežice 1919). *Luiz Pinguelli Rosa, 80, Brazilian nuclear physicist, researcher and academic.Morre o físico Luiz Pinguelli Rosa, ex-diretor da Coppe e ex-presidente da Eletrobrás *Andrey Sukhovetsky, 47, Russian Airborne Forces general, shot. *Dean Woods, 55, Australian cyclist, Olympic champion (1984), silver (1988) and bronze (1988, 1996) medalist, cancer. *Indra Yasin, 67, Indonesian politician, Regent of North Gorontalo (since 2012).Bupati Gorontalo Utara Indra Yasin Meninggal, Sempat 6 Hari Dirawat karena Flu dan Sakit Kepala ===4=== *Anne Beaumanoir, 98, French neurophysiologist and Resistance member, Righteous Among the Nations (1996).Côtes-d’Armor. Ancienne résistante, Anne Beaumanoir est décédée à l’âge de 98 ans *Tadeusz Borowski, 80, Polish actor (Remember Your Name, Sekret Enigmy, Chopin: Desire for Love).Żegnamy Tadeusza Borowskiego *Juan Pablo de Laiglesia, 73, Spanish politician, Secretary of State for Foreign Affairs (2010) and International Cooperation (2018–2020) and President of AECID (2018–2020).Muere el ex secretario de Estado y exdirector de AECID Juan Pablo de Laiglesia *Peter Marcuse, 93, German-American lawyer, academic and urban planner. *Paula Marosi, 85, Hungarian fencer, Olympic champion (1964) and silver medalist (1968). *Rod Marsh, 74, Australian Hall of Fame cricketer (Western Australia, national team), problems caused by a heart attack. *Bill Phipps, 79, Canadian religious leader, lawyer and political activist, Moderator of the United Church of Canada (1997–2000). *Sunith Francis Rodrigues, 88, Indian military officer, Chief of the Army Staff (1990–1993), Chairman of the Chiefs of Staff Committee (1991–1993) and Governor of Punjab (2004–2010). *Mitchell Ryan, 88, American actor (Dark Shadows, Dharma & Greg, Lethal Weapon), congestive heart failure. *Shane Warne, 52, Australian Hall of Fame cricketer (Victoria, Hampshire, national team), possible heart attack. *Maryan Wisniewski, 85, French footballer (Lens, Sochaux, national team).Disparition de Maryan Wisniewski ===5=== *Agostino Cacciavillan, 95, Italian Roman Catholic cardinal, President of the Administration of the Patrimony of the Apostolic See (1998–2002).È morto il cardinale Agostino Cacciavillan: aveva 95 anni *Jeff Howell, 60, American rock bassist (Foghat, Outlaws). *Antonio Martino, 79, Italian politician and economist, Deputy (1994–2018) and Minister of Foreign Affairs (1994–1995) and Defence (2001–2006), co-founder of Forza Italia.Morto l'ex ministro e fondatore di Forza Italia Antonio Martino *Immanuel Ngatjizeko, 69, Namibian politician, MP (2000–2018) and Minister of Labour and Social Welfare (2008–2012) and Safety and Security (2012–2015). *Roberto Rivas Reyes, 67, Nicaraguan politician and lawyer, President of the Supreme Electoral Council (2000–2018), sepsis caused by COVID-19.Muere Roberto Rivas, el exmagistrado que entronizó al régimen Ortega-Murillo mediante fraudes electoralesa *Shōichi Washizawa, 81, Japanese politician, Mayor of Nagano (2001–2013).長野市長３期１２年 鷲沢正一氏死去 ８１歳 ===6=== *Frank Fleming, 68, American politician, member of the Montana House of Representatives (since 2018). *Berty Gunathilake, 97, Sri Lankan actor (Cheriyo Captain, Somy Boys, Vala In London) and comedian. *Wilhelm Huberts, 84, Austrian footballer (Grazer AK, Eintracht Frankfurt, national team) and manager.Fußballlegende Willi Huberts gestorben *Pavlo Lee, 33, Ukrainian actor and television presenter, bombing. *Geraldo Melo, 86, Brazilian businessman and politician, Governor of Rio Grande do Norte (1987–1991) and Senator (1995–2003), lung cancer.Ex-governador do RN, Geraldo Melo morre aos 86 anos *Frank O'Farrell, 94, Irish footballer (West Ham, national team) and manager (Manchester United). *Pau Riba, 73, Spanish folk rock guitarist, pancreatic cancer.Muere el cantautor Pau Riba i Romeva a los 73 años *Giuseppe Wilson, 76, Italian footballer (Internapoli, Lazio, national team), stroke.Lazio, addio a Pino Wilson, il capitano dello scudetto nel 1974 ===7=== *Vasily Astafyev, 102, Russian Soviet Army colonel.В Перми скончался 102-летний ветеран Великой Отечественной войны Василий Михайлович Астафьев *Lynda Baron, 82, English actress (Open All Hours, Come Outside, EastEnders), singer and comedian. *Sir Jeremy Child, 77, British actor (Privilege, The Stud, Darkest Hour). *Renny Cushing, 69, American politician, member of the New Hampshire House of Representatives (1986–1988, 1996–1998, 2008–2010, since 2012), prostate cancer. *John F. Dunlap, 99, American politician, member of the California State Assembly (1967–1974) and State Senate (1974–1978). *Avraham Hirschson, 81, Israeli politician, MK (1983–1984, 1992–2009) and Minister of Tourism (2005–2006) and Finance (2006–2007). *Oleksandr Marchenko, 57, Ukrainian politician, Deputy (2014–2019), killed in battle.У війні з окупантом загинув народний депутат VIII скликання свободівець Олександр Марченко *Jean Mouchel, 93, French politician, MEP (1982–1983, 1984–1989).Nécrologie. Noyers-Bocage : Jean Mouchel, ardent défenseur du monde agricole, s'est éteint *Nadungamuwa Raja, 68, Sri Lankan elephant, heart attack. *Benjamín Prado Casas, 96, Chilean politician, Senator (1965–1973) and President of the Christian Democratic Party (1970–1971).Fallece exsenador y exintendente de Valparaíso, Benjamín Prado Casas *Yuriy Prylypko, 61, Ukrainian politician, Mayor of Hostomel (since 2015), shot. *Donna Scheeder, 74, American librarian, President of IFLA (2015–2017), cancer. *Shahnawaz Tanai, 72, Afghan Army general and politician, Chief of General Staff (1988–1990) and Minister of Defence (1988–1990).شهنواز تنی، وزیر دفاع پیشین افغانستان درگذشت *Muhammad Rafiq Tarar, 92, Pakistani lawyer and politician, Justice of the Supreme Court (1991–1994), Senator (1997–1998) and President (1998–2001), heart attack. *Héctor Vargas Bastidas, 70, Chilean Roman Catholic prelate, Bishop of Arica (2003–2013) and Temuco (since 2013).Confirman fallecimiento de obispo de Temuco, Héctor Vargas, criticado por encubrimiento en casos de abuso *Jesús Zúñiga, 74, Mexican politician and farmer, Mayor of Unión de Tula (1987–1998), Deputy (2015–2018) and member of the Congress of Jalisco (2018–2021), shot.Asesinaron al ex diputado del PRI, Jesús Zúñiga Mendoza, al interior de su rancho ===8=== *David Bennett Sr., 57, American patient, first person to have a genetically-modified heart xenotransplantation. *Joseph R. Bowen, 71, American politician and businessman, member of the Kentucky House of Representatives (2005–2007) and State Senate (2011–2019), heart attack. (death announced on this date) *Tomás Boy, 70, Mexican footballer (Tigres UANL, Atlético Español, national team) and manager, problems caused by a pulmonary embolism. *Desislav Chukolov, 47, Bulgarian politician, MEP (2007–2009).На 47 г. почина Десислав Чуколов (death announced on this date) *René Clemencic, 94, Austrian composer.Komponist Rene Clemencic ist tot *Margaret Farrow, 87, American politician, member of the Wisconsin State Assembly (1986–1989), State Senator (1989–2001) and Lieutenant Governor (2001–2003). *Grandpa Elliott, 77, American street singer and harmonicist, problems caused by a skin infection. *Ad Havermans, 87, Dutch politician, Mayor of The Hague (1985–1996).Oud-burgemeester Ad Havermans (87) overleden: 'Hij was een harde werker en bruggenbouwer' *Gordon Lee, 87, English footballer (Aston Villa) and manager (Newcastle United, Everton). *Fernando Carlos Maletti, 72, Argentine Roman Catholic prelate, Bishop of San Carlos de Barlioche (2001–2013) and Merlo–Moreno (since 2013).Murió el exobispo de Bariloche Fernando Maletti *Sergei Mandreko, 50, Russian-Tajik footballer (Rapid Wien, VfL Bochum, Russia national team) and manager, problems caused by ALS.Умер бывший тренер футбольного клуба \"Локомотив\" Сергей Мандреко *Ron Miles, 58, American jazz musician and composer, problems caused by polycythemia vera. *Gyo Obata, 99, American architect. *Ron Pember, 87, British actor (Secret Army, Oh! What a Lovely War, Murder by Decree), stage director, and dramatist. *Valeriy Petrov, 67, Ukrainian footballer (Sevastopol, SC Tavriya) and manager, COVID-19.Умер Валерий Павлович Петров… *Maria Simon, 103, Austrian sociologist, psychologist and academic.Simon, Maria Dorothea *Yuriko, 102, American dancer and choreographer. ===9=== *Justice Christopher, 40, Nigerian footballer (Antwerp, national team). *Inge Deutschkron, 99, German-Israeli journalist, author and Holocaust survivor.Die Berliner Ehrenbürgerin Inge Deutschkron ist tot *John Korty, 85, American movie director (The Autobiography of Miss Jane Pittman, Who Are the DeBolts? And Where Did They Get Nineteen Kids?, Twice Upon a Time) and animator, Emmy (1974, 1979) and Oscar winner (1979). *Jimmy Lydon, 98, American actor (Twice Blessed, Life with Father, The First Hundred Years). *Robert McLendon, 85, American politician, member of the Arizona House of Representatives (1983–2001). *Donald Pinkel, 95, American pediatrician, Director of St. Jude Children's Research Hospital (1962–1973). *David Wheeler, 72, American businessman (Alabama Power) and politician, member of the Alabama House of Representatives (since 2018). ===10=== *Robert Cardenas, 102, Mexican-born American Air Force brigadier general. *Sorapong Chatree, 71, Thai actor (Out of the Darkness, Plae Kao, The Legend of Suriyothai), lung cancer.สิ้นพระเอกตลอดกาล \"สรพงษ์ ชาตรี\" เสียชีวิตด้วยมะเร็งปอด *Yevhen Deidei, 34, Ukrainian politician, Deputy (2014–2019), killed in battle.Колишній нардеп з Одещини Євген Дейдей загинув під час війни *Emilio Delgado, 81, American actor (I Will Fight No More Forever, Sesame Street, A Case of You), multiple myeloma. *Sir John Elliott, 91, British historian and Hispanist, pneumonia caused by kidney failure.Muere el historiador e hispanista británico John Elliott *Mario Gigante, 98, American mobster (Genovese crime family). (death announced on this date) *Jürgen Grabowski, 77, German footballer (Eintracht Frankfurt, West German national team).Jürgen Grabowski ist tot *Kimberley Kitching, 52, Australian politician, trade unionist and lawyer, Senator (since 2016), possible heart attack. *Magne Landrø, 84, Norwegian Olympic sport shooter (1960, 1964). *Bobbie Nelson, 91, American country singer and pianist (Willie Nelson, The Family, The Strangers). *Alvard Petrossyan, 75, Armenian writer, philologist and politician, Deputy (1999–2012).Cкончалась Алвард Петросян *Mario Terán, 80, Bolivian military warrant officer, executioner of Che Guevara.Fallece Mario Terán Salazar, el militar boliviano que asesinó al «Che» Guevara *Odalis Pérez, 44, Dominican baseball player (Atlanta Braves, Los Angeles Dodgers, Kansas City Royals), fall.Muere Odalis Pérez, ex lanzador dominicano de las Grandes Ligas ===11=== *Rupiah Banda, 85, Zambian politician, Vice-President (2006–2008) and President (2008–2011), colon cancer. *Sandra Cavalcanti, 96, Brazilian politician, linguist and academic, Deputy (1987–1995).Morre aos 96 anos a ex-deputada Sandra Cavalcanti *Paul Genevay, 83, French sprinter, Olympic bronze medalist (1964). *Giovanni Giuliano, 72, Italian politician, President of the Province of Imperia (2001–2010).È morto l'ex presidente della Provincia di Imperia Gianni Giuliano *Rustam Ibragimbekov, 83, Azerbaijani filmmaker (White Sun of the Desert, Burnt by the Sun, The Barber of Siberia).Скончался известный кинорежиссер Рустам Ибрагимбеков *Jun Kondō, 92, Japanese theoretical physicist (Kondo effect), pneumonia.物理学者の近藤淳さん死去 92歳 文化勲章受章 *Gerardo Rozín, 51, Argentinian journalist and television host (Telefe).Murió Gerardo Rozín, un conductor improbable, cálido y eficaz que, principalmente, sabía escuchar *João Evangelista Martins Terra, 97, Brazilian Roman Catholic prelate, Auxiliary bishop of Brasília (1994–2004).Morre Dom João Evangelista Martins Terra, aos 97 anos *Timmy Thomas, 77, American R&B; singer-songwriter (\"Why Can't We Live Together\") and musician. *Laurent Vimont, 61, French businessman (Century 21 Real Estate), heart attack.Laurent Vimont, président de Century 21 France, est mort à 61 ans *Martha Vonk-van Kalker, 78, Dutch politician, Senator (1977–1981).Oud-senator Vonk-van Kalker (PvdA) overleden *Cora Faith Walker, 37, American politician, member of the Missouri House of Representatives (2017–2019). ===12=== *Barry Bailey, 73, American rock guitarist (Atlanta Rhythm Section), problems caused by multiple sclerosis. *Traci Braxton, 50, American R&B; singer (The Braxtons) and television personality (Braxton Family Values), esophageal cancer. *Eliezer Goldberg, 90, Israeli politician and lawyer, Judge of the Supreme Court (1983–1998) and State Comptroller (1998–2005). *Pentti Karvonen, 90, Finnish Olympic steeplechase runner (1960).Uusimaa: Yleisurheilun entinen ME-mies Pentti Karvonen on kuollut *Alain Krivine, 80, French politician, MEP (1999–2004).Alain Krivine, ancien leader de la Ligue communiste révolutionnaire, est mort à l’âge de 80 ans *Karl Offmann, 81, Mauritian politician, President (2002–2003).Karl Offmann n’est plus *Jessica Williams, 73, American jazz pianist and composer. ===13=== *Quinn H. Becker, 91, American Army lieutenant general and orthopedic surgeon, Surgeon General of the Army (1985–1988). *Erhard Busek, 80, Austrian politician, Minister of Education and Cultural Affairs (1989–1995) and Vice-Chancellor (1991–1995). *Vic Elford, 86, British racing driver, cancer. *William Hurt, 71, American actor (Kiss of the Spider Woman, Children of a Lesser God, The Incredible Hulk), Oscar winner (1986), prostate cancer. *Ajdar Ismailov, 83, Azerbaijani philologist, academic and politician, co-founder of New Azerbaijan Party.Professor Əjdər İsmayılov vəfat edib *Harue Kitamura, 93, Japanese politician, Mayor of Ashiya, Hyōgo (1991–2003), pneumonia.全国初の女性市長 元兵庫・芦屋市長の北村春江さん死去 *Igor Mandić, 82, Croatian literary critic, columnist and essayist.Umro je Igor Mandić *Sam Massell, 94, American businessman and politician, Mayor of Atlanta (1970–1974). *Micaela, Countess of Paris, 83, Chilean-Spanish aristocrat, Consort of the Head of the House of Orléans (1999–2019).Décès de la princesse Micaela : la belle-mère du comte de Paris avait 83 ans *Antonio Nachura, 80, Filipino politician and lawyer, member of the House of Representatives (1998–2004), Solicitor General (2006–2007) and Associate Justice of the Supreme Court (2007–2011). *Bernard Nussbaum, 84, American politician and lawyer, White House Counsel (1993–1994). *Adam Odzimek, 77, Polish Roman Catholic prelate, Auxiliary Bishop of Sandomierz (1985–1992) and Radom (1992–2019).Zmarł bp Adam Odzimek *Brent Renaud, 50, American photojournalist, writer (The New York Times), and filmmaker (Warrior Champions: From Baghdad to Beijing), shot. ===14=== *Charles Greene, 76, American sprinter, Olympic champion and bronze medalist (1968). *Scott Hall, 63, American Hall of Fame professional wrestler (WWE, WCW, TNA), heart attack caused by hip surgery. *Kumudben Joshi, 88, Indian politician, MP (1973–1985) and Governor of Andhra Pradesh (1985–1990). *Jorge Silva Melo, 73, Portuguese critic, theatre director and playwright, co-founder of Teatro da Cornucópia, pancreatic cancer.Morreu o encenador, cineasta, ator e autor Jorge Silva Melo *José Ramiro Pellecer Samayoa, 92, Guatemalan Roman Catholic prelate, Auxiliary Bishop of Guatemala (1967–2010). *Ľubomír Roman, 77, Slovak actor (St. Peter's Umbrella, The Sun in a Net, Soul at Peace) and politician, member of the National Council (1994–1998) and Minister of Culture (1994), heart attack.Zomrel herec a exminister Ľubo Roman *Akira Takarada, 87, Japanese actor (Godzilla, Life of an Expert Swordsman, A-Ge-Man: Tales of a Golden Geisha), problems caused by pneumonia.宝田明さん急逝、87歳 10日舞台あいさつに登壇も13日容体急変 映画「ゴジラ」など出演 *Steve Wilhite, 74, American computer scientist (CompuServe), helped invent GIFs, problems caused by COVID-19. *Pierre Zakrzewski, 55, Irish war photojournalist (Fox News), shot. ===15=== *Cabo Anselmo, 80, Brazilian Navy corporal and informant, Leader of 1964 Sailors' Revolt, problems caused by a kidney infection.Cabo Anselmo, ex-agente duplo da ditadura, morre aos 80 anos *Arturo Bonín, 78, Argentine actor (Asesinato en el Senado de la Nación, Bairoletto, la aventura de un rebelde, Amor mío), lung cancer.Murió el actor Arturo Bonín *Arnold W. Braswell, 96, American Air Force lieutenant general. *Mohammad Alavi Gorgani, 82, Iraqi-born Iranian Grand Ayatollah. *Piet Bukman, 88, Dutch politician and economist, MP (1968–1980, 1981–1986, 1989, 1994–1998), Chairman of the Christian Democratic Appeal (1980–1986) and Speaker of the House of Representatives (1994–1998).Oud-minister en Kamervoorzitter Piet Bukman (88) overleden *Lauro Cavazos, 95, American politician and educator, Secretary of Education (1988–1990). *Jürgen W. Heike, 73, German politician, member of the Landtag of Bavaria (1994–2018).Jürgen W. Heike verstorben *Marilyn Miglin, 83, American businesswoman, inventor and television host (Home Shopping Network), problems caused by a stroke. *Eugene Parker, 94, American solar physicist (Parker Solar Probe) and academic, problems caused by Parkinson's disease. *Jean Potvin, 72, Canadian ice hockey player (New York Islanders, Philadelphia Flyers, Minnesota North Stars) and radio broadcaster, Stanley Cup champion (1980, 1981). *Anneli Sauli, 89, Finnish actress (Miriam, Doctor Sibelius, The Man Without a Past).Näyttelijä Anneli Sauli on kuollut *Bob Williams, 80, American politician, member of the Washington House of Representatives (1979–1983, 1983–1989). ===16=== *Egidius Braun, 97, German football administrator, President of the German Football Association (1992–2001).Egidius Braun ist tot *Dzintars Jaundžeikars, 66, Latvian politician, MP (2002–2010) and Minister of the Interior (2005–2006).Mūžībā devies eksministrs Dzintars Jaundžeikars *Merri Dee, 85, American journalist (WGN-TV). *Vic Fazio, 79, American politician, member of the California State Assembly (1975–1978), U.S. House of Representatives (1979–1999) and Chair of the House Democratic Caucus (1995–1999), melanoma. *Tony Marchi, 89, English footballer (Tottenham Hotspur, Vicenza) and manager (Northampton Town). *Barbara Morrison, 72, American jazz singer, heart disease. *Kunimitsu Takahashi, 82, Japanese racing driver, motorcyclist, and team owner, four-time All-Japan Sports Prototype champion, lymphoma. *Ralph Terry, 86, American baseball player (New York Yankees, Kansas City Athletics, New York Mets), World Series champion (1961, 1962), head injury caused by a fall. *Helene Vannari, 73, Estonian actress (Rahu tänav, All My Lenins, Mindless).Suri näitleja Helene Vannari *Pete Ward, 84, Canadian-born American baseball player (Chicago White Sox). ===17=== *Christopher Alexander, 85, British-American architect, design theorist and writer (Notes on the Synthesis of Form, A City Is Not a Tree, The Nature of Order). *Pascal Beaudet, 65, French politician, Mayor of Aubervilliers (2003–2008, 2014–2016).Aubervilliers : l’ancien maire (PCF) Pascal Beaudet est décédé *Peter Bowles, 85, English actor (Rumpole of the Bailey, To the Manor Born, The Bounder), cancer. *Emmett C. Burns Jr., 81, American politician, member of the Maryland House of Delegates (1995–2015). *Clemens Cornielje, 63, Dutch politician, MP (1994–2005) and King's Commissioner of Gelderland (2005–2019), brain cancer.Rutte eert overleden oud-commissaris Clemens Cornielje (63): ‘Hij blijft in mijn herinnering als een integer en aimabel mens’ *Jean-Pierre Demailly, 64, French mathematician and editor (Annales de l'Institut Fourier, Comptes rendus de l'Académie des Sciences, Inventiones Mathematicae), member of the French Academy of Sciences (since 2007).Décès de Jean-Pierre Demailly *Sir Wira Gardiner, 78, New Zealand soldier, politician and writer. *Tony Nash, 85, British bobsledder, Olympic champion (1964). *Martha Palafox Gutiérrez, 73, Mexican politician, Deputy (1997–2000, 2003–2006) and Senator (2012–2018).Fallece la política tlaxcalteca Martha Palafox Gutiérrez *Elsa Papadimitriou, 80, Greek politician, MP (1993–2011). *Alan Rees, 84, Welsh rugby player (national team) and cricketer (Glamorgan). *Hisanori Takada, 40, Japanese footballer (Lillehammer, Persitara, Pegasus), injuries caused by a skiing accident.岐阜・継子岳で滑落死か 長野の男性、スキーで入山 *Yuri Vechkasov, 73, Russian politician, Senator (1996–2001).Умер Почётный гражданин Пензенской области Юрий Вечкасов ===18=== *Aleksei Bakharev, 45, Russian-Ukrainian footballer (Shakhtar Donetsk, Russian national team, Ukrainian national team).Умер бывший футболист «Спартака» и «Шахтера» Алексей Бахарев *John Clayton, 67, American Hall of Fame sportswriter (The Pittsburgh Press, The News Tribune) and reporter (ESPN). *Oddrun Hokland, 79, Norwegian Olympic athlete (1964).Oddrun Helene Hokland er død *Chaim Kanievsky, 94, Polish-born Israeli rabbi, heart attack. *Bernabé Martí, 93, Spanish operatic tenor.Muere el tenor Bernabé Martí, viudo de Montserrat Caballé *Don Young, 88, American politician and educator, member of the Alaska House of Representatives (1967–1971), State Senate (1971–1973) and U.S. House of Representatives from Alaska's at-large congressional district (since 1973). ===19=== *Shahabuddin Ahmed, 92, Bangladeshi lawyer and politician, President (1990–1991, 1996–2001) and Chief Justice (1990–1995). *Lyell Cresswell, 77, New Zealand composer. *Federico Martín Aramburú, 42, Argentine rugby union player (US Dax, Glasgow Warriors, national team), shot.Mort de Federico Aramburu, ex-international argentin, tué par balles à Paris *Linda Garrou, 79, American politician and educator, member of the North Carolina Senate (1999–2013). *Joel Hasse Ferreira, 77, Portuguese politician, Deputy (1983–1985, 1992–2001, 2002–2005) and MEP (2004–2009).Morreu antigo deputado e eurodeputado socialista Joel Hasse Ferreira *Alan Hopgood, 87, Australian actor (Bellbird, Prisoner, Neighbours), producer and writer, cancer. *Roberts Ķīlis, 54, Latvian politician and social anthropologist, Minister for Education and Science (2011–2013).Mūžībā devies bijušais izglītības ministrs Roberts Ķīlis *Scoey Mitchell, 92, American actor (Barefoot in the Park, Rhoda), comedian, and director. *Winfield W. Scott Jr., 94, American Air Force lieutenant general, Superintendent of the Air Force (1983–1987). *Marian Zembala, 72, Polish cardiac surgeon, academic and politician, Deputy (2015–2019) and Minister of Health (2015).Nie żyje profesor Marian Zembala. \"Nie wykluczamy, że mamy do czynienia z samobójstwem\" ===20=== *Raimon Carrasco, 98, Spanish football executive, President of FC Barcelona (1977–1978).Mor l'expresident Raimon Carrasco *Adriana Hoffmann, 82, Chilean botanist, environmentalist and writer.Fallece la bióloga y botánica chilena Adriana Hoffmann *Jacob Oulanyah, 56, Ugandan agricultural economist, lawyer and politician, member (2001–2006, since 2011) and Speaker of the Parliament (since 2021), cardiopulmonary arrest. *Arnaldo Rosa Prata, 94, Brazilian politician, Mayor of Uberaba (1971–1973).Morre o ex-prefeito Arnaldo Rosa Prata *Reine Wisell, 80, Swedish Formula One racing driver, heart attack.Racinglegendaren Reine Wisell död *John V. Roach, 83, American microcomputer pioneer, led development of the TRS-80. *Tom Young, 89, American college basketball coach (Catholic University, Rutgers, Old Dominion). (death announced on this date) ===21=== *Shinji Aoyama, 57, Japanese movie director, screenwriter and composer (EM Embalming, Eureka, Tokyo Park), esophageal cancer.Mort de Shinji Aoyama, Nouvelle Vague à l’âme *Yuz Aleshkovsky, 92, Russian-American playwright, poet, and singer-songwriter. *Yvan Colonna, 61, French Corsican nationalist and convicted murderer, problems caused by stab wounds. *Lawrence Dane, 84, Canadian actor (Running, For the Record, Scanners), pancreatic cancer. *Rosa Gómez de Mejía, 82, Dominican socialite, First Lady (2000–2004), heart attack.Fallece la exprimera dama Rosa Gómez de Mejía *Kip Hawley, 68, American businessman and politician, Administrator of the Transportation Security Administration (2005–2009), lung cancer. *Gérard Istace, 86, French politician, Deputy (1981–1986, 1988–1993).L’ancien maire de Revin et député des Ardennes Gérard Istace s’est éteint *Soumeylou Boubèye Maïga, 67, Malian politician, Minister of Foreign Affairs (2011–2012) and Prime Minister (2017–2019).Mali : l’ancien Premier ministre Soumeylou Boubèye Maïga est mort *Nikolai Osyanin, 80, Russian footballer (Krylia Sovetov Samara, Spartak Moscow, Soviet Union national team) and manager.Не стало бывшего игрока «Спартака» Николая Осянина *John Purvis, 83, British politician, MEP (1979–1984, 1999–2009), cancer. (death announced on this date) *Eva Ingeborg Scholz, 94, German actress (1-2-3 Corona, The Time with You, The Lost One).Eva-Ingeborg Scholz ist gestorben *Raymond Séguy, 92, French Roman Catholic prelate, Bishop of Gap (1981–1987) and Autun (1987–2006). *Fevzi Zemzem, 80, Turkish footballer (Göztepe, national team) and manager.Fevzi Zemzem kimdir? Neden öldü, kaç yaşındaydı? İşte oynadığı takımlar ===22=== *Dame Miriam Dell, 97, New Zealand women's rights activist, botanist and educator, President of the NCWNZ (1970–1974) and ICW (1979–1984). *Elspeth Howe, Baroness Howe of Idlicote, 90, British peer, member of the House of Lords (2001–2020), cancer. *Barrington Patterson, 56, English kickboxer and mixed martial artist, heart attack. *Mohammad Reyshahri, 75, Iranian politician and cleric, Minister of Intelligence (1984–1989), Prosecutor-General (1991–1993) and member of the Assembly of Experts (since 2016). ===23=== *Madeleine Albright, 84, Czechoslovakian-born American politician, Ambassador to the United Nations (1993–1997) and Secretary of State (1997–2001), cancer. *Oksana Baulina, 42, Russian journalist (The Insider), bombing. *Charles G. Boyd, 83, American Air Force general, lung cancer. *Kaneaster Hodges Jr., 83, American politician and lawyer, U.S. Senator from Arkansas (1977–1979), aortic aneurysm. *Ramesh Chandra Lahoti, 81, Indian politician and lawyer, Chief Justice (2004–2005). *Edmund Michał Piszcz, 92, Polish Roman Catholic prelate, Bishop of Warmia (1988–2006).Zmarł arcybiskup senior Edmund Piszcz ===24=== *Kirk Baptiste, 59, American sprinter, Olympic silver medalist (1984). *Dagny Carlsson, 109, Swedish blogger and influencer.Bloggaren Dagny Carlsson är död – blev 109 år gammal *Denise Coffey, 85, British actress (Waltz of the Toreadors, Georgy Girl, Sir Henry at Rawlinson End), comedian and writer. *Johnny Fripp, 101, Canadian skier and football player (Ottawa Rough Riders). *Arcadio Poveda, 91, Mexican astronomer and academic, member of the El Colegio Nacional (since 1989).Fallece a los 91 años el astrónomo mexicano Arcadio Poveda Ricalde *Luis Roldán, 78, Spanish politician and convicted fraudster, Director General of the Civil Guard (1986–1993).Muere Luis Roldán, el director de la Guardia Civil que saqueó los fondos reservados *G. Kendall Sharp, 87, American politician and lawyer, Judge for the U.S. District Court for Middle Florida (since 1983). ===25=== *Sir John Chapple, 90, British Army general, Commander-in-Chief, Land Forces (1987–1988), Chief of the General Staff (1988–1992) and Governor of Gibraltar (1993–1995). *Taylor Hawkins, 50, American Hall of Fame rock singer-songwriter and musician (Foo Fighters, Taylor Hawkins and the Coattail Riders, The Birds of Satan). *Kathryn Hays, 88, American actress (Ride Beyond Vengeance, Counterpoint, As the World Turns). *Philip Jeck, 69, English composer. *Kenny McFadden, 61, American-born New Zealand basketball player (Washington State Cougars) and coach (Wellington Saints), kidney disease. (death announced on this date) ===26=== *Claudette Bradshaw, 72, Canadian politician and activist, MP (1997–2006) and Minister of Labour (1998–2004), lung cancer. *Jeff Carson, 58, American country singer and musician (\"Not on Your Love\", \"The Car\", \"Holdin' Onto Somethin'\"), heart attack. *Gianni Cavina, 81, Italian actor (The House with Laughing Windows, House of Pleasure for Women, Christmas Present).È morto l'attore Gianni Cavina, aveva 81 anni *Teofil Wilski, 86, Polish Roman Catholic prelate, Auxiliary Bishop of Kalisz (1995–2011). ===27=== *Titus Buberník, 88, Slovak footballer (Inter Bratislava, LASK Linz, Czechoslovakia national team).Smutná nedeľa nášho futbalu, na večnosť odišiel Titus Buberník *Shakir Hasanov, 74, Azerbaijani engineer and politician, member of the Sumgait City Council (1990–1995).Скончался лауреат Международной премии «Сократ» *Ayaz Mutallibov, 83, Azerbaijani politician, Prime Minister (1989–1990) and President (1990–1992). *Enrique Pinti, 82, Argentine actor (Sentimental, Tango, Angel Face) and comedian, problems caused by diabetes.Murió Enrique Pinti *Martin Pope, 103, American physical chemist, researcher and academic, Davy Medalist (2006). *James Vaupel, 76, American scientist. *Alexandra Zabelina, 85, Russian fencer, Olympic champion (1960, 1968, 1972).Ушла из жизни прославленная динамовская фехтовальщица — Александра Ивановна Забелина ===28=== *Naci Erdem, 91, Turkish footballer (Fenerbahçe, Galatasaray, national team) and manager.Başımız Sağ Olsun | Naci Erdem’i Kaybettik *Dame June Jackson, 82, New Zealand Māori activist and public servant. *Eugene Melnyk, 62, Canadian businessman and philanthropist, owner of the Ottawa Senators (since 2003) and founder of Biovail. *Antonios Naguib, 87, Egyptian Coptic Catholic cardinal, Bishop of Minya (1977–2002) and Patriarch of Alexandria (2006–2013).الكنيسة الكاثوليكية بمصر تودع الأنبا أنطونيوس نجيب ===29=== *Joyce Fairbairn, 82, Canadian politician, Senator (1984–2013), problems caused by Alzheimer's disease. *Paul Herman, 76, American actor (The Sopranos, Silver Linings Playbook, The Irishman). *John T. Richardson, 98, American academic and priest, President of DePaul University (1981–1993). ===30=== *Juan Carlos Cárdenas, 76, Argentine footballer (Racing Club, Veracruz, national team) and manager.Murió Juan Carlos “Chango” Cárdenas, el autor del gol más importante de la historia de Racing *Mathew Cheriankunnel, 91, Indian Roman Catholic prelate, Bishop of Nalgonda (1976–1986) and Kurnool (1988–1991).Morto mons. Cheriankunnel, l'omaggio di Nalgonda al suo primo vescovo *Egon Franke, 86, Polish fencer, Olympic champion (1964).Zmarł Egon Franke. Wspaniały szermierz z Gliwic miał 86 lat *David Irvine, 75, Australian politician, Director of ASIS (2003–2009) and ASIO (2009–2014). *Tom Parker, 33, English pop singer (The Wanted), glioblastoma. ===31=== *Georgi Atanasov, 88, Bulgarian politician, Prime Minister (1986–1990). *Vladimir Bochkov, 75, Russian politician, Senator (2013–2018).Скончался бывший сенатор от Ивановской области Владимир Бочков (death announced on this date) *Rıdvan Bolatlı, 93, Turkish footballer (Ankaragücü, national team). *Günter Deckert, 82, German far-right political activist and politician, Leader of the NPD (1991–1996).Weinheim: Rechtsradikaler Politiker Günter Deckert verstorben *Patrick Demarchelier, 78, French fashion photographer (Elle, Vogue, Harper's Bazaar).Patrick Demarchelier : le célèbre photographe proche de Lady Diana est mort *Richard Howard, 92, American critic, poet and translator, problems caused by dementia.Richard Howard, Acclaimed Poet and Translator, Dies at 92 *Moana Jackson, 76, New Zealand Māori lawyer and academic. *Sven Melander, 74, Swedish journalist, television presenter (Snacka om nyheter) and actor (Sällskapsresan, Jönssonligan och Dynamit-Harry), cancer.Sven Melander är död *Patricia Poblete, 75, Chilean economist and politician, Minister of Housing and Urbanism (2006–2010).A los 75 años fallece Patricia Poblete, militante DC y exministra de Vivienda durante el primer gobierno de Bachelet ==Months== * January * February ==Related pages== * List of deaths due to COVID-19 * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 * Deaths in 2020 * Deaths in 2021 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *03 Category:March 2022 events",
 "title": "Deaths in March 2022"
}