{
 "id": "892244",
 "text": "Minecraft Dungeons is a video game released in 2020 by Mojang Studios. The title is a spin-off of the 2011 video game Minecraft. On September 28, 2023, it was officially announced that there would be no more updates to the game, making 1.17 the last version of the game. == Gameplay == This game focuses on attacking mobs. An object called the Orb of Dominance is a pink circled object which sounds like an enderman. This ender object was from the End dimension, and created monsters and bosses. Players explore an open world with lots of dungeons containing monsters, bosses, blocks, puzzles, and secret areas in the game. This game player limit is 4 players, and has an online game. == Downloadable content (DLC) == This game has 6 downloadable contents, and also contains mobs, puzzles, blocks, and secrets. The downloadable contents are: *\"Jungle Awakens\" - takes place in a jungle. *\"Creeping Winter\" - takes place in a snowy tundra. *\" Howling Peaks\" - takes place in the mountains. *\" Flames of the Nether - takes place in the Nether dimension, and the only Minecraft Dungeons DLC without a final boss fight. *\" Hidden Depths\" - takes place in an ocean. *\" Echoing Void\" - takes place in the End dimension. Jungle Awakens, Creeping Winter, Howling Peaks, Hidden Depths, and Echoing Void has final bosses. The Flames of the Nether is the only DLC in the game without a final boss, because of a lack of the Orb of Dominance. The final boss in the Echoing Void DLC is the true final boss of Minecraft Dungeons, because it is the true final victim of the Orb of Dominance. Category:2020 video games Category:Minecraft Category:Action role-playing video games Category:Arcade games Category:Dungeon crawler video games Category:Fantasy video games Category:Hack and slash role-playing games Category:Microsoft video games Category:Multiplayer and single-player video games Category:Nintendo Switch games Category:PlayStation 4 games Category:Video games developed in Sweden Category:Windows games Category:Xbox One games Category:Xbox Series X and Series S games",
 "title": "Minecraft Dungeons"
}