{
 "id": "892375",
 "text": "Admiral Sir James Stirling (28 January 179122 April 1865) was a Scottish naval officer. He is also reponsible for the creation of the Swan River Colony. He was the first Governor of Western Australia.National Archives of Australia Stirling's commission In 1854, as Commander-in-Chief of theEast Indies and China Station, Stirling signed Britain's first Anglo-Japanese Friendship Treaty.Dictionary of Australian Biography James Stirling Stirling showed diplomatic skill and was selected for many important missions. Stirling also led the attack in Western Australia on a group of about seventy Bindjareb men, women and children. This is now known as the Pinjarra massacre. ==Life== Stirling entered the Royal Navy at age 12, As a midshipman, he saw action in the Napoleonic Wars. When he was 21, he was given command of the 28-gun sloop . In the War of 1812 between the US and the UK, The Brazen carried the news of the end of that war to Fort Bowyer. It also took the British troops that had captured the fort back to England. When he ruturned to the West Indies, Stirling made two surveys of the Venezuelan coast. He reported on the information about of the Spanish government and local revolutionary factions. this information was later used by the British when dealing with these groups. In his second command, , he carried supplies and coinage to Australia. He also we to secretly learn about other nations' interest in the region and explore locations for British settlements. He is remembered for his exploration of the Swan River. On 30 December 1828, he was made Lieutenant-Governor of the colony-to-be. He founded the city of Perth and the port of Fremantle. He also was in charge of the development of the surrounding area. On 4 March 1831m he was made Governor and Commander-in-Chief of the new territory, Western Australia. He remained at that post until in 1838 he returned to his naval career. In October 1834 Stirling led a group of twenty-five police, soldiers and settlers against about seventy Bindjareb men, women and children on the Murray River. This was done partly because of several murders and thefts. This attack used rifles and bayonets against spears. Itis known as the Pinjarra Massacre and sometimes the Battle of Pinjarra. An uncertain number of Aboriginal men, women and children were killed during this attack. Stirling said 15 males killed. John Septimus Roe siad it was 15–20. An unidentified eyewitness said it was 25–30 including 1 woman and several children with probably more floating down with the stream. From 1840 to 1844, Stirling commanded the 80-gun . The ship he patrolled the Mediterranean. They were told to 'show the flag' and keep an eye on the French. In 1847, he was given command of the 120-gun ship . His first mission was to tale Her Majesty, Queen Adelaide on trips to Lisbon and Madeira and then back to Osborne House on the Isle of Wight. After that, the Howe was assigned to the eastern Mediterranean. Stirling's fifth and final command was as Commander in Chief of the China and the East Indies Station. His flag was flown on on 11 May 1854. Shortly afterwards news arrived that war had been declared on Russia. Stirling wanted to prevent Russian ships from using Japanese ports and causing trouble for allied shipping. After negotiations through the Nagasaki Magistrate, he signed a Treaty of Friendship with the Japanese. The treaty was endorsed by the British Government, but Stirling was criticised in the popular press for not finding and engaging with the Russian fleet. == References == Category:1791 births Category:1865 deaths Category:Governors of Western Australia Category:Royal Navy officers Category:People from North Lanarkshire Category:Scottish explorers",
 "title": "James Stirling (Royal Navy officer)"
}