{
 "id": "89240",
 "text": "Most Haunted is a British paranormal television program based on investigating possible paranormal activity. It is shown on the satellite and cable channels Living, Living2 and Virgin 1 (Formerly Ftn), mainly for the UK market. It is also shown in the United States on the Travel Channel and on the W Channel in Australia. It is made by Antix Productions, and is led by Yvette Fielding and her husband Karl Beattie. The show started their 10th series on February 19, 2008. ==Production== The team travel around the UK, and also Ireland, the Netherlands and the United States, investigating possible paranormal 'hotspots' for 24 hours. ==Sister shows== *Most Haunted Extra: runs directly after premiere episodes, documenting behind-the-scenes antics of the cast and crew on that night's location. *Most Haunted Unseen: re-release of complete series one but with added footage bringing the duration of the programme from half an hour to an hour. *Most Haunted Live! *Most Haunted Live: Access All Areas: similar to Most Haunted Extra. Features behind-the-scenes footage and interviews with the team. *Most Haunted Midsummer Murders: Seven part series where Most Haunted investigators try to solve murder mysteries in normal English villages. Hosted by Most Haunted Live historian Lesley Smith. The series started on a weekly broadcast from 2007-06-19 to 2007-07-31 and the team visited (in order of broadcast) Stoney Middleton, Nantwich, Castleton, Pluckley, Ruthin, Tutbury and Tarvin. *Most Haunted: Recurring Nightmares: Series in which the presenters tell and recall their most feared visits. ==The Most Haunted team== Most Haunted has a main presenter, a psychic medium and a parapsychologist. The parapsychologist's role is to be the skeptic, and to give possible scientific suggestions for the paranormal activity that happens during the night. These are supported by some of the production crew, who appear in the show and generally have some involvement with many parts of the investigation as they are performing their normal crew role. Most of these on- screen crew members also take part in séances. Name Show role Crew role Started Yvette Fielding Presenter / Investigator Executive producer Series 1 David Wells Medium Spiritual Advisor Series 4 Dr Ciarán O'Keeffe Parapsychologist None Series 2 Karl Beattie Investigator Producer, Director Series 1 Stuart Torevell Investigator Rigger, Camera operator Series 1 Catherine Howe Investigator Hair and Make-up Series 2 Iain Cash Investigator Camera Operator Series 6 Geoff Adams None Director of Photography Series 9 The show has also featured guest mediums. So far these have been Ian Lawman, Ian Shillito, Gordon Smith, Uri Geller and Kevin Wade. Some episodes have also included at least one celebrity. So far celebrities have included Vic Reeves, Nancy Sorrell, Gaby Roslin, Scott Mills, Mark Chapman, Simon Gregson, Sue Cleaver, Carol Thatcher, Paul O'Grady and Lee Ryan. ===Former team members=== The following is a list of former team and crew members who have given a lot of their time to the show. Name Role Duration Derek Acorah Spiritualist Medium Series 1-6 Phil Whyman Paranormal Investigator Series 2-4 Jason Karl Paranormal Investigator Series 1 Steve Parsons Paranormal Investigator Series 8 Matthew Smith Parapsychologist Series 2-8 Louie Savva Parapsychologist Series 7 Richard Felix Historian Series 2-8 Rick Fielding Cameraman Series 1-4 Craig Harman Steadicam Operator Series 1-3 John Dibley Director of photography, Camera Operator Series 2-8 Neil Haggerty Editor Series 1-4 Warren Baxter Editor Series 5 Stefan Petecki Editor Series 5-7 Paul Harrison Post- production Sound Series 1-4 Martin Huntley Location Sound Series 1 Tom O'Carrol Location Sound Series 3-5 John Baldwin Online Editor Series 1-4 Rachel Phillips Script Writer Series 5-6 Jon Gilbert Sound Series 6-8 (Some of Series 9) ==Controversy== Many times, former \"psychic medium\" Derek Acorah was possessed by a spirit, sometimes evil or sometimes \"lost and confused\". One such case that exposed Acorah was at Bodmin Gaol, Cornwall. Before the filming, Acorah had been fed misinformation about a non-existent ghost of Kreed Kafer by the show parapsychologist Dr. Ciaran O' Keeffe. During the investigation, which was later broadcast, he presented the information as fact and even behaved as though he was possessed by the fictional ghost. O'Keeffe later revealed Kreed Kafer is an anagram of 'Derek Faker' in the Daily Mirror. O' Keeffe exposed Acorah. The paper also claimed that O' Keeffe had exposed the rest of the Most Haunted team. O'Keeffe later reported that he had been grossly misquoted and misrepresented in the article, and produced a response outlining his version of the show based on his observations and findings, saying he had exposed Derek Acorah and NOT Most Haunted. The show's presenter and executive producer, Yvette Fielding said in an interview that she believes it was a fake possession.Metro UK, \"60 SECONDS: Yvette Fielding\" by James Ellis, The UK Metro, October 30, 2006, retrieved November 2, 2006. Although not mentioned by O'Keeffe, the Mirror article also brought into question unedited footage which appeared to show Fielding and Karl Beattie faking 'paranormal' occurrences such as ghostly bumps and knocks. Fielding denied the claims. Thus far none of this footage has come to light, leading to the belief that the Mirror's claims were false. Videos purporting to show the team faking paranormal activity have often popped up on the web but show no proof. Further controversy centred on Derek Acorah in Devon. On the first night filming \"Terror in Torbay\", Acorah mentioned a woman incarcerated by her jealous sister in the cellar of Lupton House, even coming up with the names Margaret and Eleanor. In this case, the facts were right, but the location was wrong. This is the well-known legend of Berry Pomeroy Castle which was to be the last night's location. On the final night, at Berry Pomeroy, Fielding reminded Acorah that he had mentioned the incarcerated sister two nights prior. Acorah glossed over his mistake and changed the subject. ==Related pages== *List of Most Haunted episodes == References and notes== ==Other websites== * The Official Most Haunted Homepage * Antix Productions - Production company for Most Haunted * The Official Site and Forum for Karl Beattie * The Official Fansite and Forum for David Wells * Most Haunted blog Offers an alternative view on Most Haunted Category:2002 British television series debuts Category:2000s British television series Category:2010s British television series Category:British reality television series Category:Occult Category:Travel Channel shows Category:English-language television programs",
 "title": "Most Haunted"
}