{
 "id": "892586",
 "text": "The University of Vigo is a public university included in the University System of Galicia (NW Spain) based in the city of Vigo. It has campuses in three cities: Vigo, Pontevedra and Ourense. In 2010, the University of Vigo became the center of the Campus do Mar international interuniversity excellence campus, in which the three Galician and several universities in the north of Portugal, as well as CSIC and Spanish Institute of Oceanography participate. Since 2018, Manuel Reigosa, a plant physiologist, has been the Rector. == History == The direct antecedent of the institution was the so- called University College of Vigo, created after the approval in 1972 of the construction of the aforementioned in the Lagoas, in Marcosende, in the parish of Zamáns, and under the sponsorship of Caixa de Aforros de Vigo. In the course 1977 - 78 began classes in the degrees that time were offered: Chemistry and Biology, Economics and Philology. Two years after the start of teaching at the institution, the University of Santiago de Compostela, founded in the 15th century, integrated the studies taught in Vigo under its administrative and academic tutelage. Law 11/1989 of 20 July on the organization of the Galician university system reorganized the university landscape of the Autonomous Community. The University of Vigo was established as such in 1990 after its segregation from the University of Compostela. The first president ( 1990 - 1994 ) was the chemical engineer Luis Espada Recarey would be replaced in office by Professor José Antonio Vázquez (1994-1998). Between 1998 and 2006 the post was held by professor Domingo Docampo, between 2006 and 2010 Alberto Gago , and between 2010 and 2018 Salustiano Mato. The University achieved the highest number of enrollments in the 1999-2000 academic year (29000 students), since then there has been a continuous decline in students. In 2006 it had 21263 enrolled (12820 on the Vigo Campus, 4991 in Ourense and 3452 in Pontevedra). In the 2016-17 academic year, the total number of students amounted to 21235. == Campus == The Vigo Campus, or Vigo Technological Campus, is distributed in various locations. The main one is the University Town of As Lagoas-Marcosende located in the parish of Zamáns. However, in the center of Vigo is the so-called Urban Campus, located in a building from the 1930s designed by the architect Jenaro de la Fuente. This building, located in Conde Torrecedeira Street and still known today as the School of Industrial Experts, is now part of the University's School of Industrial Engineering. Attached to this building is a university library. Just across the street is the University School of Business Studies. Toralla Island, in the Filomena Dato Building, is home to the Toralla Marine Science Station (ECIMAT), on the southern shore of the Ría de Vigo. The Pontevedra Campus has several spaces within the city of the same name. It has a central campus known as A Xunqueira, in the northern part of the town, as well as several faculties in the city center. The headquarters of the Vice-Rectorate are located in the Casa das Campas, a historic building owned by the municipality for use by the University of Vigo. The Ourense Campus Campus da Agua is fully integrated into the city center, in the neighborhood of As Lagoas. It occupies the facilities of the old Hospital da Lonia. It also has other infrastructures, such as the Iron Building (headquarters of the Faculties of Education and Social Work and History), or the Polytechnic Building, which houses the Faculty of Science and the School of Computer Engineering. In the new part, known as Campur Sur, are the Faculties of Business and Tourism Sciences and the Faculty of Law, both in the same building, and the School of Aeronautical and Space Engineering. Other facilities include the Rosalía de Castro University Library, the university swimming pool, the sports court and different outdoor sports areas, including a synthetic grass field. == Teaching centers == === Vigo Campus ( As Lagoas - Marcosende ) === * School of Industrial Engineering * ETS of Mining Engineering * School of Telecommunication Engineering * Faculty of Biology * Faculty of Chemistry * Faculty of Economics and Business * Faculty of Marine Sciences * Faculty of Legal and Labor Sciences * Faculty of Philology and Translation * Scientific and Technological Research Support Center (CACTI) * Biomedical Research Center (CINBIO) * Industrial Technological Research Center (MTI) === Vigo Campus (Center) === * School of Industrial Engineering Faculty which is commonly called \"City Headquarters\" (Sede Cidade) as can be read in * US Business Studies * Toralla Marine Science Station (ECIMAT) ==== Assigned centers ==== * US Nursing (Meixoeiro) * US Nursing (Povisa) * US Teaching \"Maria Sedes Sapientiae\" * Afundación Business School === Pontevedra Campus === * School of Forestry Engineering * Faculty of Physiotherapy * Faculty of Fine Arts * Faculty of Education and Sports Sciences * Faculty of Social Sciences and Communication * Faculty of Management and Public Administration ==== Assigned centers ==== * University School of Nursing * University Center of the Defense ( Naval military school of Marin ) === Ourense Campus === * School of Computer Engineering * Faculty of Science * Faculty of Education Sciences * Faculty of Business Studies and Tourism * Faculty of Law * Faculty of History * School of Aeronautical and Space Engineering * Center for Research, Transfer and Innovation (CITI) ==== Assigned Centers ==== * University School of Nursing == Government structure == On May 20, 2010, elections for the rectory were held with two candidates: Nova Universidade, led by Jaime Cabeza Pereiro, and Alternativa Universitaria, led by Salustiano Mato. The latter was the winner in the election, reaching 52.6% of votes.\"Salustiano Mato será o reitor da Universidade de Vigo\", Vieiros, 21 de maio de 2010. In 2014, Mato ran for New University and was re-elected by 751 votes in an election he ran as the sole candidate. From July 4, 2014 to 2018, the university's governing board was composed of: * Rector: Salustiano Mato de la Iglesia * Vice-rectorship of Planning and Economy: José Manuel García Vázquez * Vice-rectorship for Research and Transfer: María Asunción Longo González * Vice-rectorship of Academic Organization and Teaching Staff: Ana María Graña Rodríguez * Vice-rectorship of Students: Dolores González Álvarez * Vice-rectorship for University Extension and International Relations: Manuel Fernández Iglesias * Vice-rectorship of the Ourense Campus: Virxilio Rodríguez Vázquez * Vice-rectorship of the Campus of Pontevedra: Juan Manuel Corbacho Valencia * General Secretariat: Gloria Pena Uris == Degrees, master's degrees, student and other data of interest == Since its segregation from the University of Santiago de Compostela (USC), the University of Vigo (UdV or UdVigo) has been gradually increasing both the number of degrees and the number of teachers and students. The university has in its three fields 22 own university centers, 7 affiliated centers and 5 technological centers, and that cover 140 areas of the knowledge. In them predominates degrees in social and legal sciences and engineering companies In 2017 the university has trained 21235 students: 17237 pursuing degrees, 2,048 master's and doctoral degrees in 1365. It also had 1376 people dedicated to research and teaching, 434 researchers in training or technicians and 484 people linked to projects. The administration and service staff were 702 people. In addition, it went from an investment in research of 0.51 million euros in 1991 to 5.23 million in 2001. The total budget of the institution for 2016 amounts to €160,586,524 . Most of the expenditure corresponds to staff and current expenditure and is mostly distributed in technological, legal and social research groups. == Image gallery == == Notes == ==Other websites== * Category:Galicia Category:Colleges and universities in Spain",
 "title": "Universidade de Vigo"
}