{
 "id": "892656",
 "text": "Grand Duke Michael Alexandrovich of Russia (; 13 June 1918) was the youngest son and fifth child of Emperor Alexander III, Empress Maria Feodorovna and the youngest brother of Nicholas II. He was designated Emperor of Russia after his brother abdicated in 1917 and proclaimed him \"Emperor Michael II\", but Michael declined to take power a day later. Michael was born during the reign of his paternal grandfather, Alexander II. He was then fourth in line to the throne after his father and elder brothers Nicholas and George. After the assassination of his grandfather in 1881, he became third in line and, in 1894, after the death of his father, second in line. George died in 1899, leaving Michael as heir apparent to Nicholas II. The birth of Nicholas's son Alexei in 1904 moved Michael back to second in line, but Alexei was gravely ill with hemophilia and Michael suspected the boy would die, leaving him as heir. Michael caused a scandal at the imperial court when he took Natalia Sergeyevna Wulfert, a married woman, as a lover. Nicholas sent Michael to Orel to avoid scandal but this did not stop Michael, who continued to travel to see her. After the couple's only child, George, was born in 1910, Michael brought Natalia to Saint Petersburg, where she was shunned by society. In 1912, Michael married Natalia hoping that he would be removed from the line of succession. Michael and Natalia left Russia to live in exile abroad in France, Switzerland and England. After the outbreak of World War I, Michael returned to Russia, assuming command of a cavalry division. When Nicholas abdicated on , Michael was named as his successor instead of Alexei, but he never accepted the throne. He was never confirmed as emperor and, following the Russian Revolution of 1917, he was imprisoned and murdered. == Honours == ; Russian ordersRussian Imperial Army – Grand Duke Michael Alexandrovich of Russia (In Russian) * Knight of St. Andrew, 12 October 1878 * Knight of St. Alexander Nevsky, 12 October 1878 (by statute of the Order of St. Andrew) * Knight of the White Eagle, 12 October 1878 (by statute of the Order of St. Andrew) * Knight of St. Anna, 1st Class, 12 October 1878 (by statute of the Order of St. Andrew) * Knight of St. Stanislaus, 1st Class, 12 October 1878 (by statute of the Order of St. Andrew) * Alexander III Commemorative Medal, 17 March 1896 * Nicholas II Coronation Medal, 26 May 1896 * Knight of St. Vladimir, 4th Class (civil), 22 November 1905; with Swords (for actions during the Brusilov Offensive, while in command of the 2nd Cavalry Corps), 1916 * Knight of St. George, 4th Class (for actions in the Carpathian Mountains, while in command of the Caucasian Native Cavalry Division), January 1915Crawford and Crawford, p. 179 * St. George Sword, 27 June 1915 == Ancestry == == References == Category:Russian grand dukes and duchesses Category:Assassinations in the Russian Revolution Category:1878 births Category:1918 deaths",
 "title": "Grand Duke Michael Alexandrovich of Russia"
}