{
 "id": "892787",
 "text": "Certain women will submit to their partner. In this case the woman will allow her partner to use her body for his sexual pleasure. Very often, the activity is associated with BDSM. The S in BDSM can stand for submission. This practice is known as female submission or femsub. The submission is consensual, the woman wants to submit, and also gets sexual pleasure from doing so. Usually, submission requires a degree of trust. The partner the woman submits to (called 'dominant') is a man, most of the time. There are setups where there may be more than one dominant partner. The woman may also get emotional gratification from submitting and giving control to her trusted partner. A 1985 study suggested that about three out of ten people taking part in BDSM activities were women. A 2015 study indicates that 61.7% of females who are active in BDSM preferred a submissive role, 25.7% consider themselves a switch (they take both roles), while 12.6% prefer the dominant role. In contrast, 46.6% of men prefer the submissive role, 24% consider themselves to be switches and 29.5% prefer the dominant role. == Eroticism == Submission can take different forms. One form is to be passive and to do what the partner wants. This may mean that the partner is able to start all sexual activities, and to control the sex positions used. It can also be about the type of sexual activities the partners do: Not all foreplay leads to coitus (anal sex, sexual roleplay or BDSM doesn't). In some cases, the woman needs to be passive, while the man performs a sex act on her. Letting the partner do that can also be seen as a form of submission. Doing what the partner says may be a part of a sexual roleplay or activity, and can also be in the relation to the style of dress, if any, or behavior or any other manner. Anything, where the woman is passive can be seen as submissive behaviour. As an example, the woman will let her lover undress her. Submission can show in different ways: In all cases, the woman gives up sexual or personal control to another person. Examples are acts of servitude, submission to humiliation or punishment such as erotic spanking, or other activities, at times in association with bondage. Female submission can take the form of engaging in sexual activity with a person other than her normal partner, as in the case of swinging, non-monogamy or prostitution. Some women choose to include occasional sexual submission in an otherwise conventional sex life. For example, a woman may adopt a submissive role during a sexual activity to overcome a sexual inhibition she may have. A woman may choose to submit full-time, becoming a lifestyle slave. Some people get erotic pleasure from their sex partner acting in a submissive manner. For them i is a turn-on. Other people regard obvious passivity as a form of feminine flirting or seduction. Some women submit to the sexual wishes of their partner for the pleasure of the partner, which may itself result in sexual pleasure for the submissive woman. == In literature == Female submission and conquest are very common themes in traditional literature. When they are married, many man see their wives as subordinate; in that view, a woman is defenseless in society, and has to submit to men. Story of O, published in 1954 in French, is an erotic tale of female submission involving a beautiful Parisian fashion photographer named O, who is taught to be constantly available for all forms of sex, offering herself to any male. Wonder Woman's original key weakness was permitting herself to be bound by a man. While this exploitable weakness has since been retconned out of continuity by DC comics, it was absolutely key to the character Dr. Marston, an ardent feminist and practicing psychologist, was creating. His point was that women are not actually inferior to men, they are oppressed. The only reason they are \"weaker\" is because they allow men to make them so. == Related pages == * Domination & submission (BDSM) * Dominatrix * Fifty Shades of Grey (movie) == References == == Further reading == * Submissive Women - Tales of Female Submission by Monique Lassen. ASIN: B006WBRN9C. * Henryson, Dean (2014). ″Girl Fighting Exposed.″ Createspace. . * Category:Pages with unreviewed translations Category:BDSM",
 "title": "Female submission"
}