{
 "id": "892806",
 "text": "The Pine Barrens or Pinelands are a place in New Jersey in the eastern United States. They are in the southern part of the state. Sometimes the word \"Pinelands\" only means the Pinelands Natural Reserve. ==Size== The Pinelands Natural Reserve is a large part of the Pine Barrens. It is 1.1 million acres in size. They are 22 percent of all New Jersey's area. Not all of the Pine Barrens are in the Pinelands Natural Reserve. ==Ecology== The United States Congress made the Pine Barrens Natural Reserve in 1988. Because there is so much sand and acid in the soil, people did not want to make farms in the Pine Barrens. But the water in the Pine Barrens was very pure. Sea captains liked to take water from the Pine Barrens with them on long trips because it did not go bad quickly. The iron in the soil and tannin chemicals from the cedar trees kept bacteria from turning the water bad. Sometimes the Atlantic white cedar trees die. This is because salt water rises into the Pine Barrens. It has happened many times, but the trees eventually come back. Scientists think that climate change might mean the trees will die and not grow back. ==History== Some of the people who moved to the Pine Barrens in the 1700s were Quakers who had fought in the American Revolution. The other Quakers had thrown them out because Quakers are not supposed to kill other human beings. British loyalists also came to the Pine Barrens in the 1700s. Outlaws and other criminals came too. In 1913, Elizabeth Kite wrote about the pine barrens, saying the people there were uneducated and many were criminals. Later, she said she regretted writing this because instead of helping the people in the pine barrens, newspapers made things worse. In 1954, the Chatsworth Fire burned 19,500 acres of the Pine Barrens. ==Industry== People in the Pine Barrens made charcoal, glass, cabinets, paper, and bricks. In the 1800s and 1900s, people came to the Pine Barrens to find jobs. ==Legends== Legends say that a creature called the Jersey Devil lives in the Pine Barrens. == References == Category:Geography of New Jersey",
 "title": "Pine Barrens (New Jersey)"
}