{
 "id": "892881",
 "text": "Paramount Music is an American music publisher popular music publishing company owned by Paramount Pictures. The company specialized in movie songs, but published other popular music as well. Songs published by Paramount Music's Fox Music include \"God Bless the U.S.A.\", \"Together Forever\" by Rick Astley, \"Mr. Brightside\" by The Killers and many others. ==Soundtracks== Artist Album Details Franz Waxman Sunset Boulevard (Music from the Motion Picture) * Released: April 4, 2016 Lorne Balfe Mission: Impossible – Fallout: Music from the Motion Picture * Released: July 14, 2018 Dan Romer Maniac (Music from the Netflix Limited Series) * Released: September 21, 2018 The Newton Brothers The Haunting of Hill House (Music from the Netflix Horror Series) * Released: October 12, 2018 Ramin Djawadi Tom Clancy’s Jack Ryan: Season 1 (Music from the Prime Original Series) * Released: October 31, 2018 Jed Kurzel Overlord (Music from the Motion Picture) * Released: November 9, 2018 Michael Andrews Instant Family (Original Motion Picture Score) * Released: November 16, 2018 Dario Marianelli Bumblebee (Motion Picture Score) * Released: December 21, 2018 Christopher Young Pet Sematary (Music From the Motion Picture) * Released: April 5, 2019 Max Aruj and Steffen Thum Crawl (Music from the Motion Picture) * Released: July 12, 2019 John Debney and Germaine Franco Dora and the Lost City of Gold (Music from the Motion Picture) * Released: August 9, 2019 Eskmo 13 Reasons Why: Season 3 (A Netflix Original Score) * Released: August 23, 2019 Lorne Balfe Gemini Man (Music From the Motion Picture) * Released: October 11, 2019 Siddhartha Khosla Looking For Alaska (Original Series Score) * Released: October 18, 2019 Tom Holkenborg Terminator: Dark Fate (Music From the Motion Picture) * Released: November 1, 2019 Nathan Wang Playing With Fire (Music From the Motion Picture) * Released: November 8, 2019 Christophe Beck & Jake Monaco Like a Boss (Music from the Motion Picture) * Released: January 10, 2020 Tom Holkenborg Sonic the Hedgehog (Music from the Motion Picture) * Released: February 14, 2020 Nathan Lanier Home Before Dark: Season 1 (Apple TV+ Original Series Soundtrack) * Released: April 3, 2020 Atli Örvarsson, Theme by Ólafur Arnalds Defending Jacob (Apple TV+ Limited Series Soundtrack) * Released: April 24, 2020 Joseph Bishara Body Cam (Music from the Motion Picture) * Released: June 19, 2020 Joseph Trapanese Spontaneous (Music from the Motion Picture) * Released: September 25, 2020 The Newton Brothers The Haunting of Bly Manor (Music from the Netflix Horror Series) * Released: October 9, 2020 Marco Beltrami & Marcus Trumpp Love and Monsters (Music from the Motion Picture) * Released: October 16, 2020 Quincy G. Ledbetter Alieu the Dreamer (Music from the Motion Picture) * Released: October 23, 2020 Ben Onono Spell (Music from the Motion Picture) * Released: October 30, 2020 George Fenton We’re No Angels (Music from the Motion Picture) * Released: December 4, 2020 Keefus Ciancia Made For Love: Vol. 1 (Music from the Max Original Series) * Released: April 2, 2021 Hans Zimmer & Steve Mazzaro The SpongeBob Movie: Sponge On the Run (Music from the Motion Picture) * Released: April 9, 2021 Keefus Ciancia Made For Love: Vol. 2 (Music from the Max Original Series) * Released April 16, 2021 Jónsi Without Remorse (Music from the Motion Picture) * Released: April 30, 2021 Nathan Lanier Home Before Dark: Season 2 (AppleTV+ Original Series Soundtrack) * Released: June 11, 2021 Harry Gregson-Williams Infinite (Music from the Motion Picture) * Released: June 11, 2021 First Wives Club (Music from the BET+ Original Series) * Released: June 15, 2021 Martin Todsharow Snake Eyes: G.I. Joe Origins (Music from the Motion Picture) * Released: July 23, 2021 John Debney Clifford: The Big Red Dog (Music from the Motion Picture) * Released: November 12, 2021 Dimitri Tiomkin It’s a Wonderful Life (Music from the Motion Picture: 75th Anniversary Edition) * Released: December 3, 2021 Lorne Balfe Rumble (Music from the Motion Picture) * Released: December 17, 2021 Dan Romer Station Eleven (Music from the HBO Max Limited Series) * Released: January 13, 2022 J.J. Pfeifer The In Between (Music from the Motion Picture) * Released: February 11, 2022 Tony Morales Reacher (Music from the Amazon Original Series) * Released: February 11, 2022 Pinar Toprak The Lost City (Music from the Motion Picture) * Released: March 25, 2022 Jerry Goldsmith Star Trek: The Motion Picture – The Director’s Edition (Music from the Motion Picture) * Released: April 4, 2022 Tom Holkenborg Sonic the Hedgehog 2 (Music from the Motion Picture) * Released: April 8, 2022 Cheche Alara The Lost City (EP) (Music from the Motion Picture) * Released: April 15, 2022 Jermaine Stegall Senior Year (Original Score from the Netflix Film) * Released May 13, 2022 The Newton Brothers Joe Pickett: Season 1 (Music from the Original Series) * Released May 16, 2022 Keefus Ciancia Made For Love: Season 2 (Music from the Max Original Series) * Released May 19, 2022 John Frizzell Mike Judge's Beavis and Butt-Head Do the Universe (Music from the Motion Picture) * Released July 8, 2022 == References == Category:American record labels Category:2015 establishments in California",
 "title": "Paramount Music"
}