{
 "id": "892808",
 "text": "Pine barrens are a type of habitat. It is a place where a few pine trees grow. A pine barren does not have enough trees to be a forest. A pine barren is one type of savannah. There are pine barrens in the eastern half of North America, in the United States and Canada. ==Soil and plants== The soil in a pine barren has a lot of acid and sand in it. Water flows through the soil instead of staying in it. Pine barren soil does not make good farms. Because pine barrens have fires, droughts, and frost during the growing season, the trees never grow enough to form a canopy. They never form a \"roof\" that stops the sunlight. That means that sunlight can touch the ground in a pine barren. That means that small plants that need a lot of light can grow there. The trees in pine barrens can be jack pine, pitch pine, red pine, and some white pine. Northern pin oak, black cherry, and aspen can grow in pine barrens, but these trees do not grow as tall as they do in other places. Many shrubs, grasses, and ferns also grow in pine barrens. For example, there can be blueberries, bracken fern, and reindeer lichen. Most of the plants in the pine barren have some special thing or ability that helps them with fire. For example, the pitch pine has thick bark. Its cones open when they are near fire. ==Animals== Many animals without bones live in pine barrens. For example, there are butterflies and grasshoppers. Birds that eat these animals live there too. ==Geology== Pine barrens form where the ground is not too steep. For example, they form in glacial plains, outwash plains, and lakeplains. ==Damage== Human beings can hurt pine barrens by cutting down the pine trees for wood, by bringing plants from other parts of the world there, and by stopping the natural fires. When human beings stop fires, other types of trees can grow in the pine barren, and it becomes a forest instead. Then, the small plants that need a lot of sunlight die. ==Related pages== *Pine Barrens (New Jersey) == References == Category:Habitats",
 "title": "Pine barrens"
}