{
 "id": "893059",
 "text": "Evangelis or Evangelos Zappas (; ; 23 August 1800 – 19 June 1865) was a Greek patriot, philanthropist and businessman who established the modern Olympic Games.; ; . ==Biography== ===Early life=== Evangelis Zappas was born to a Greek family on August 23, 1800 in the village of Labovo in the Ottoman Empire....... His parents were Vasileios and Sotira Zappas.. Zappas received no education during his youth.. At 13, he left his village and worked as a mercenary in the Ottoman militia of Ali Pasha... Zappas was involved in the Filiki Eteria, a Greek patriotic organization, and served in the Greek War of Independence when it started in 1821.. He claimed to have been wounded five times during the war.. Zappas later moved to Wallachia in 1831 and made a fortune in land and agriculture. In the 1850s, Zappas became one of the wealthiest businessmen in Eastern Europe.. The value of his whole fortune was calculated at six million gold drachmas. ===Revival of the Olympic Games=== Zappas was a nationalist inspired to revive the Olympic Games by Panagiotis Soutsos, a Greek poet.; . He sent a letter in 1856 to King Otto of Greece offering to pay to restore the Olympics. The first modern Olympic Games were held on November 15, 1859 in Athens, Greece. And just like in the ancient Olympics, the athletes competed in running, discus throwing, javelin throwing, wrestling, jumping, and pole-climbing. Zappas died on June 19, 1865 with no children.. His money was used for developing athletic buildings in Athens, as well as for continuing the Olympic Games.. He left instructions for the building of the Zappeion Exhibition and Conference Center named in both his honour and in the honour of his cousin, Konstantinos Zappas. ===Legacy=== Evangelos Zappas made several donations to Greek schools, libraries and scholarships... He also financed the Romanian Academy where he has a statue there today. Zappas also funded a Romanian dictionary, a newspaper and books in the Albanian language, and research on the history of the Romanian people. ==References== ===Citations=== ===Sources=== * * * * * * * * * * * * * * * * * * * ==Further reading== * ==Other websites== *University of Florida (Gainesville) - Professor David C. Young Lifetime Achievement Award (includes long list of useful source references concerning the revival of the Olympic Games in modern times) *Testaments of Evangelis and Konstantinos Zappas. (Greek) Category:1800 births Category:1865 deaths Category:Greek people Category:Olympic Games",
 "title": "Evangelos Zappas"
}