{
 "id": "893178",
 "text": "In certain societies there are groups of people, who think that certain people should not be part of that society. These people who are seen as \"undesirable\" are then either killed, or they are driven away. This is known as social cleansing. Examples of such groups seen as undesirable are homeless people, street children, criminals,the elderly, and people with disabilities. Very often, these ideas also touch sex workers, people who are homosexual, or who have a gender identity outside the clearly defined male, or clearly defined female spectrum.Ordoñez 1996, p. 18.Schwartz 1995, p. 384.Sanford 2008, p. 110. Wanting to do social cleansing is caused by a combination of economic and social factors, but killings are mostly present in regions with high levels of poverty or were there are very few very rich, and the rest of the poulation is poor.Federici 2010, p. 12. Perpetrators are usually of the same community as the victims. Very often, they think that the victims are a drain on the resources of society.Federici 2010, p. 18. Efforts by national and local governments to stop these killings have been largely ineffective. The government and police forces are often involved in the killings, especially in South America.Abrahams 1987, p. 187.Miguel 2005, p. 1155. == Examples == === Colombia === According to the National Center of Historic Memory the city of Cali in Colombia is most affected by these massacres. Between 1998 and 2013, about 5.000 people have been killed in social cleansing operations; 77% of the cillings were done by special groups doing the cleansing, 18% were killed by paramilitary groups, and 5% were killed by unidentified groups. A report by Vice News states that the police is often involved, and leads to the homeless seeking shelter in the most remote areas of the canalisation: \"They come here all the time. they get you and take you to the police station. There they beat youu up, and they sprinkle you with a strong water jet. They tell you you are good for social cleansing, but they don't tell you when it will happen.Living in the Sewers of Colombia, reference occurs at position 9minutes 25 seconds When the aggressors cannot reach them, they have another stategy: they put gasoline in the sewers, and put it on fire. \"Six month ago, paramilitary forces came, and put a small girl on fire. They poured gasoline on her and lit her.\"Living in the Sewers of Colombia, reference occurs around mnute 8 === Guatemala === After the civil war in Guatemala, many soldiers formed criminal organizations. That way, they could avoid that a efficient transition government would be put in place, which would persecute people who had committed war crimes.. The process of transition towards a democratic government also threatened these groups, who then executed people who were politically active. A very notable example is the assasination of the bishop Juan José Gerardi Conedera. A commander of a military base ordered his assassination. Edgar Gutierrez, a political commentator, noted that these groups were motivated by a higer ambition. According zo Guiterrez, they wanted contorl of the state and the economy. Most of the information officers of the military dictatorship were infiltrated into orgaised crime, either part of the state, or close to it. A report of the International commission against impunity in Guatemala, published in 2010, accuses the government of Óscar Berger (2004-2008?=), of having donee \"social cleansing operations\", and of having ordered extra-judicial killings. Philip Alston, of the United Nations, had already pointed out that goverment of Guatemala had taken part in social cleansing operations. Erwin Sperisen, director of national police, said that the use of legal and extra-legal force against \"socially undesirable individuals\" was a necessary means to be able to guarantee economic prosperity. Since 2013, different associations point out that the level of social cleansing is increasing again: Most of the time, it is Maya officeholders, and Maya communities fighting for their land, and natural resources, which also interest big companies.In 2013, people defendimg human rights have been attacked 169 times, according to the Unit of protection of defenders of Guatemala. ==Books== * Abrahams, Ray. \"Sungusungu: Village Vigilante Groups in Tanzania.\" African Affairs 86, no. 343 (April 1, 1987): 179–96. * Federici, Silvia. \"Women, Witch-Hunting and Enclosures in Africa Today.\" Sozial Geschichte Online 3 (2010): 10–27. * Koonings, Kees. \"Armed Actors, Violence and Democracy in Latin America in the 1990s: Introductory Notes.\" Bulletin of Latin American Research 20, no. 4 (October 1, 2001): 401–08. * Johnson, Lyman L.; Lipsett-Rivera, Sonya. The Faces of Honor: Sex, Shame, and Violence in Colonial Latin America. Albuquerque: University of New Mexico Press. (1998). . * McIlwaine, Cathy, and Caroline O. N. Moser. \"Violence and Social Capital in Urban Poor Communities: Perspectives from Colombia and Guatemala.\" Journal of International Development 13, no. 7 (October 2001): 965–84. * Miguel, Edward. \"Poverty and Witch Killing.\" The Review of Economic Studies 72, no. 4 (October 1, 2005): 1153–72. * Ordoñez, Juan Pablo. No Human Being Is Disposable: Social Cleansing, Human Rights, and Sexual Orientation in Colombia. Reports on Human Rights in Colombia. International Gay and Lesbian Human Rights Commission, January 1996. * Sanford, Victoria. \"From Genocide to Feminicide: Impunity and Human Rights in Twenty-First Century Guatemala.\" Journal of Human Rights 7, no. 2 (April 2008): 104–22. * Schwartz, Elizabeth F. \"Getting Away with Murder: Social Cleansing in Colombia and the Role of the United States.\" The University of Miami Inter-American Law Review 27, no. 2 (December 1, 1995): 381–420. * Wilding, Polly. \"'New Violence': Silencing Women's Experiences in the Favelas of Brazil.\" Journal of Latin American Studies 42, no. 04 (November 2010): 719–47. * Zachrisson, Per. \"Witchcraft and Witchcraft Cleansing in Southern Zimbabwe.\" Anthropos 102, no. 1 (January 1, 2007): 33–45. ==Videos== * == References == Category:Discrimination",
 "title": "Social cleansing"
}