{
 "id": "89328",
 "text": "This is a list of all current champions in WWE (World Wrestling Entertainment), a big company that produces professional wrestling shows. It is now the most popular company in the wrestling business. It is owned by TKO Group Holdings. Vincent J. McMahon started the company in 1963. His son, Vince K. McMahon ran the company as the chairman and CEO from 1982 to 2024. The company used to be known as the World Wrestling Federation or the WWF. They changed their name to World Wrestling Entertainment after a lawsuit filed by the World Wide Fund for Nature, formerly known as the World Wildlife Fund, which uses the \"WWF\" initials in the United States. In 2011, the company rebranded itself as WWE, although its legal name is still World Wrestling Entertainment. == Current champions == Tables with a \"Days recognized\" column means that WWE officially lists a different number of days that a wrestler has held a title because an event aired on tape delay. In some cases the actual date an event took place is unknown. === Main roster === Raw Championship Current champion(s) Reign Date won Days held Location Notes Ref. World Heavyweight Championship Jey Uso 1 April 19, 2025 Paradise, Nevada Defeated Gunther at WrestleMania 41 Night 1. Women's World Championship Iyo Sky 1 March 3, 2025 Buffalo, New York Defeated Rhea Ripley on Raw. WWE Intercontinental Championship Dominik Mysterio 1 April 20, 2025 Paradise, Nevada Defeated previous champion Bron Breakker, Penta, and Finn Bálor, who he pinned, in a Fatal four-way match at WrestleMania 41 Night 2. WWE Women's Intercontinental Championship Lyra Valkyria 1 January 13, 2025 San Jose, California Defeated Dakota Kai in a tournament final to become the first champion on Raw. World Tag Team Championship The New Day 5 April 19, 2025 Paradise, Nevada Defeated The War Raiders (Erik and Ivar) at WrestleMania 41 Night 1. SmackDown Championship Current champion(s) Reign Date won Days held Location Notes Ref. Undisputed WWE Championship John Cena 14 April 20, 2025 Paradise, Nevada Defeated Cody Rhodes at WrestleMania 41 Night 2. WWE Women's Championship Tiffany Stratton 1 January 3, 2025 Phoenix, Arizona Defeated Nia Jax in Stratton's Money in the Bank cash-in match on SmackDown. WWE United States Championship Jacob Fatu 1 April 19, 2025 Paradise, Nevada Defeated LA Knight at WrestleMania 41 Night 1. WWE Women's United States Championship Zelina Vega 1 April 25, 2025 Fort Worth, Texas Defeated Chelsea Green on SmackDown. WWE Tag Team Championship The Street Profits 2 March 14, 2025 Barcelona, Spain Defeated #DIY (Johnny Gargano and Tommaso Ciampa) on SmackDown. Open (available to all three brands: Raw, SmackDown, and NXT.) {| class=\"wikitable\" style=\"margin: auto\" Raw SmackDown NXT === Developmental === NXT Championship Current champion(s) Reign Date won Days held Location Notes NXT Championship Oba Femi 1 January 7, 2025 Los Angeles, California Defeated Trick Williams in a Triple Threat match also involving Eddy Thorpe at New Year's Evil NXT Women's Championship Jacy Jayne 1 May 27, 2025 Orlando, Florida Defeated Stephanie Vaquer on NXT. NXT North American Championship Ethan Page 1 May 27, 2025 Orlando, Florida Defeated Ricky Saints on NXT. NXT Women's North American Championship Sol Ruca 1 April 19, 2025 Paradise, Nevada Defeated Izzi Dame, Kelani Jordan, Lola Vice, Thea Hail, and Zaria in a six-woman ladder match to win the vacant championship at Stand & Deliver. NXT Heritage Cup Noam Dar 4 April 22, 2025 Defeated Lexis King on NXT. NXT Tag Team Championship Hank and Tank 1 April 19, 2025 Defeated Nathan Frazer and Axiom at Stand & Deliver. Evolve Championship Current champion(s) Reign Date Won Days held Days rec. Location Notes WWE Evolve Championship TBD 1 June 4, 2025 TBD TBD Orlando, Florida The first champion will be crowned in a Fatal four-way elimination match. WWE Evolve Women's Championship TBD 1 May 28, 2025 TBD TBD Orlando, Florida The first champion will be crowned in a Fatal four-way elimination match. WWE ID Championship Current champion(s) Reign Date won Days held Days rec. Location Notes WWE ID Championship — 1 TBD — — TBD The first champion will be crowned in a tournament. WWE Women's ID Championship ==Related pages== * List of WWE personnel ==References== Category:WWE wrestlers Category:Lists of professional wrestlers",
 "title": "List of current champions in WWE"
}