{
 "id": "893455",
 "text": "Thor Odinson is a fictional character portrayed by Chris Hemsworth in the Marvel Cinematic Universe (MCU) media franchise, based on the Marvel Comics character of the same name and the Norse mythological god of thunder. He is the Asgardian God of Thunder, the former king of both Asgard and New Asgard, a founding member of the Avengers, and a former member of the Guardians of the Galaxy. When his irresponsible and impetuous behavior reignited an ancient war between Asgard and Jotunheim, Thor was denied the right to become king, stripped of his power and hammer Mjølnir, he was banished to Earth by Odin. While exiled on Earth, Thor found love with Jane Foster, and learned humility by saving his new friends from the Destroyer sent by Loki. Due to his selfless act of sacrifice, Thor redeemed himself in his father's eyes and was granted his power once more, which he then used to defeat Loki's schemes of genocide. Thor is a central figure of the MCU, having appeared in nine movies as of 2023. Thor's characterization and early films received mixed reception, however his storyline following Thor: Ragnarok (2017) was received much more favorably, with that film often being credited as revitalizing the character and his arc. Alternate versions of Thor appear in the animated series What If...? (2021), with Hemsworth reprising the role. One version in particular, which depicts an alternate Thor raised without Loki who is recruited into the Guardians of the Multiverse by the Watcher in the battle against an alternate version of Ultron. == Appearances == === Movie appearances === Year Movie Portrayed by 2011 Thor Chris Hemsworth 2012 The Avengers 2013 Thor: The Dark World 2015 Avengers: Age of Ultron 2016 Doctor Strange (post-credits cameo) 2017 Thor: Ragnarok 2018 Avengers: Infinity War 2019 Avengers: Endgame 2022 Thor: Love and Thunder === Television appearances === Year Television series Seasons Episodes Portrayed by 2021-2023 Loki (Archival footage) 2 12 Chris Hemsworth 2021-2024 What If...? 3 26 Category:Marvel Cinematic Universe characters Category:Marvel Comics movie characters",
 "title": "Thor (Marvel Cinematic Universe)"
}