{
 "id": "8935",
 "text": "Cornish (Cornish: Kernewek) is a very old language from Cornwall, in the south-west of Great Britain. A Celtic language, Cornish is very similar to Welsh and also is related to Gaelic, all three of which Brythonic languages. Cornish is less closely related to the Goidelic languages: Irish, Manx and Scottish Gaelic. == History == The words 'Cornwall' and 'Cornish' are derived from the Celtic Cornovii tribe, which inhabited modern-day Cornwall prior to the Roman conquest. Cornish started to diverge from Welsh towards the end of the 7th century AD. and the earliest known examples of written Cornish date from the end of the 9th century. They were in the form of glosses that were scribbled in the margins of a Latin text A long time ago, Cornish was the only language spoken in Cornwall, but more and more people began to speak English instead. In 1550, when the Book of Common Prayer was written in English, instead of Latin, the Cornish people got angry, and there was a rebellion. By 1800, only a few people could speak Cornish. People say that a woman called Dolly Pentreath was the last person who could speak Cornish and not English. That is not quite true since she was one of the last people. == Revival == Some people relearned Cornish by travelling around talking to people who could still speak it and by reading old plays and books. Some people wanted to learn the language and speak it and so in 1904, a learned man, Henry Jenner, wrote a book to help people. Some people then began to learn the language and to speak it again. No one knows how many Cornish-speakers there are now. It is estimated that about 300 people speak Cornish. Some young people have grown up speaking it. Most people in Cornwall know a few sentences or words in Cornish. In 100 years, Cornish has grown from having almost no speakers to having many thousands == Sample phrases == * Kernowek: Cornish * Kernow: Cornwall * Den: Man * Benyn: Woman * Gorthugher da: Good afternoon * Dydh da!: Good day! * Duw genes!: Goodbye! * Onen hag oll: One and all. * Fatla genes!: How's it going with you == References == == Other websites == * Ferdinand, Siarl (2013). Brief History of the Cornish language, its revival and its current situation. E-Keltoi, 2, 199–227 Category:Celtic languages Category:Cornwall",
 "title": "Cornish language"
}