{
 "id": "893693",
 "text": "Alaska Airlines Flight 261 was an international passenger flight from Puerto Vallarta to a stopover in San Francisco International Airport, to its destination in Seattle–Tacoma International Airport. The McDonnell Douglas MD-83 aircraft was carrying 83 passengers and 5 crew members aboard. It suffered a serious mechanical failure caused by a jackscrew on January 31, 2000, while flying over the Pacific Ocean, and crashed into 4.3 km north of Anacapa Island in California. There were no survivors. Flight 261 left Puerto Vallarta at 14:30 PST. While en-route to San Francisco, the crew became aware of a horizontal stabilizer jam and kept Alaska Airlines maintenance informed of the issue while airborne at FL310. Captain Tansky tried a solution to unjam the stabilizer. The stabilizer unjammed and the aircraft assumed an extreme nose down attitude. Both pilots applied back pressure to their controls and recovered from the dive at FL260. The flight crew contact Los Angeles ARTCC to tell them that they are descending through FL260. == Accident == At 16:11, ARTCC asked Flight 261 about their condition, and the flight crew notified them that they were trying to troubleshoot a jammed horizontal stabilizer. The crew then requested, and were granted an altitude block between 20,000 and 25,000 feet. They were then handed off to Los Angeles Center 5 minutes later, who they notified of their intentions to divert to Los Angeles International Airport and their troubles in maintaining their altitude. Flight 261 was then cleared to FL170 and the crew then requested another block of altitude. This was the last transmission from the plane. Captain Tansky then commented on the plane's tendency to want to pitch down. There were metallic thumping sounds and finally, the stabilizer gave way and the MD-83 pitched over violently, to which Captain Tansky replied, \"this is a b*tch\". The aircraft rapidly begins to descend, and the MD-83 was seen 'tumbling, spinning, nose down, continuous roll, corkscrewing and inverted'. A pilot commented that \"that plane has just started to do a big huge plunge\". While inverted, the engines experience multiple compressor stalls and likely failed, causing the aircraft's rapid final descent. Just before 16:22 PST, Alaska Airlines Flight 261 crashed inverted into the Pacific Ocean. None of 88 passengers and crew members aboard survived. == Memorial == The aircraft, manufactured in 1992, had more than 26,000 flight hours at the time of the accident. Among the 88 passengers were 12 employees of Alaska Airlines and Horizon Air, which led to a mourning on the part of the airline for those killed in this accident. Alaska Airlines stated that it was common for employees to occupy places that would otherwise go empty. Bouquets of flowers arrived at the airline's headquarters in Seattle - Tacoma, Washington the next day. Due to the extreme efforts of the pilots to regain control of the aircraft, their quick reaction to the emergency and the decision to avoid flying over populated areas, the international association of airline pilots awarded both the gold medal posthumously. ==Identification of the bodies== The following indicators were used to identify the bodies of the victims of Alaska Airlines Flight 261: * Fingerprints. * Dental records * Tattoos * Personal items. * Anthropological examinations. ==Maps== ==Other websites== * NTSB Final Report *Alaska Airlines news reports about 261 (Archive) * Cockpit voice recorder transcript and accident summary * Families of Alaska Airlines Flight 261 *\"Navy expands search for debris at Alaska Airlines Flight 261 crash scene\", United States Navy (Archive) *Applying Lessons Learned from Accidents, Alaska Airlines Flight 261 – Informative analysis at faa.gov, with technical diagrams and photos (Archive) * Federal Aviation Administration – Lessons Learned Home: Alaska Airlines Flight 261 *Seattle Post-Intelligencer special report (Archive) *Short Bios of Flight 261 Passengers Category:2000 in the United States Category:Aviation accidents and incidents in the United States Category:2000s in California Category:January events Category:2000 events",
 "title": "Alaska Airlines Flight 261"
}