{
 "id": "893724",
 "text": "Karlstadt is a town in Main-Spessart in the Regierungsbezirk of Lower Franconia (Unterfranken) in Bavaria, Germany. It is the administrative centre of Main-Spessart (Kreisstadt), and has a population of around 15,000. ==Geography== Karlstadt is on the River Main in Main-Spessart, about 25 km north of the city of Würzburg. It belongs to the Main-Franconian wine-growing region. The town itself is on the right edge of the river, but the municipal territory extends to the left edge. Since the combinations in 1978, Karlstadt's Stadtteile have been Gambach, Heßlar, Karlburg, Karlstadt, Laudenbach, Mühlbach, Rohrbach, Stadelhofen, Stetten, and Wiesenfeld. ==Notable people== * Johannes Schöner (b. 1477, d. 1547 in Nuremberg), mathematician, geographer, cartographer, astronomer, and astrologist * Andreas Bodenstein (b. about 1482, d. 1541 in Basel), also named after his birthplace Karlstadt, or in Latinized form Carolstadius, reformer * (b. about 1494, d. 1566 in Wittenberg), theologian, humanistic philosopher, and reformer * (b. 1522, d. 1587 in Strasbourg), historian, poet, jurist, and official * Johann Rudolph Glauber (b. 1604 in Karlstadt; d. 1670 in Amsterdam), apothecary and chemist * Franz Sperr (b. 1878, d. 23 January 1945 executed in Berlin- Plötzensee), jurist and member of the Widerstand in the Third Reich * (b. 1887, d. 1915 near Soldau in Masuria), painter * (b. 1894 in Wiesenfeld- Erlenbach, d. 1971), writer, poet * Ruth Westheimer (b. Karola Ruth Siegel and known as \"Dr. Ruth,\" 4 June 1928 in Wiesenfeld), sex therapist, talk show host, author, professor, Holocaust survivor, and former Haganah sniper; later, U.S. citizen. * (b. 1948 in Aschaffenburg, d. 2007 in Karlstadt), carnevalist * Roland Büchner (b. 1954), Regensburg cathedral choirmaster, conductor, leader of the Regensburger Domspatzen ==Gallery== File:Karlburg-Karlstadt- PIC00010.JPG|Karlsburg, Karlstadt, on the west bank of the Main File:Stadtmauer-Karlstadt-PIC00014.JPG|Main gate with flood gauge, Karlstadt File:Stadttor-Karlstadt-PIC00016.JPG| Main gate tower and main gate, Karlstadt File:Stadt Karlstadt 1888.jpg| Bond of the town of Karlstadt am Main, issued 1 September 1888 ==References== ==Other websites== * Town’s official webpage * Category:Main-Spessart",
 "title": "Karlstadt am Main"
}