{
 "id": "893732",
 "text": "Lohr am Main (officially: Lohr a. Main) is a town in Main-Spessart in the Regierungsbezirk of Lower Franconia (Unterfranken) in Bavaria, Germany and the seat (but not a member) of the Verwaltungsgemeinschaft (municipal association) of Lohr am Main. It has a population of about 15,000. ==Etymology== The town takes its name from the famous river that flows into the Main in the municipality. Wolf-Armin Frhr. v. Reitzenstein: Lexikon fränkischer Ortsnamen. Herkunft und Bedeutung. C.H.Beck, München 2009, , p. 133.Theodor Ruf: Quellen und Erläuterungen zur Geschichte der Stadt Lohr am Main bis zum Jahr 1559. Lohr am Main 2011, , pp. 46–47. The addition \"am Main\" distinguishes it from other towns also named Lohr. Past ways of spelling the name include: * 1296 Lare * 1331 Lore * 1342 Lor * 1526 Lohr * 1573 Loarn * 1747 Lahr * 1831 Lohr * 1946 Lohr am Main == Geography == === Location === The municipal territory extends on both sides of the Main about halfway between Würzburg and Aschaffenburg in Lower Franconia. The town of Lohr is on the eastern slope of the Spessart at a bend in the river Main, which twirls towards the south here, forming the beginning of the Mainviereck (\"Main Square\" – the southern part of the Spessart). In Lohr, the river Lohr releases into the Main. Perhaps for its geographical location or the fact that two major valleys lead into the inside of the range, the town is known as the \"Gateway to the Spessart\" (Tor zum Spessart). The Main river valley is steep with an elevation change from 160 m above sea level at Gemünden dropping to 100 m above sea level at Hanau. The river Main in its natural state is a fast-moving stream unsuitable for shipping. ===Subdivisions=== Lohr am Main's Stadtteile are , Lindig, , , , , , and . The town has the following Gemarkungen (traditional rural cadastral areas): Halsbach, Lohr a. Main, Pflochsbach, Rodenbach, Ruppertshütten, Sackenbach, Sendelbach, Steinbach, Wombach. Also, the town of Lohr am Main also owns plots of land within other municipalities, namely Partenstein, Gemünden am Main and Rechtenbach. === Neighbouring communities === Clockwise from the north, these are Partenstein, Frammersbach, Flörsbachtal, Fellen, Burgsinn, Rieneck, Neuendorf, Gemünden am Main, Karlstadt, Steinfeld, Neustadt am Main and Rechtenbach. == Further reading == * Christ, Günter: Lohr am Main. Der ehemalige Landkreis. Hrsg. von der Kommission für Bayerische Landesgeschichte bei der Bayerischen Akademie der Wissenschaften. Laßleben, Kallmünz 2007, * Loibl, Werner: Die kurmainzische Spiegelmanufaktur Lohr am Main (1698–1806) und die Nachfolgebetriebe im Spessart, 3 Volumes. Geschichts- und Kunstverein Aschaffenburg, Aschaffenburg 2012. , , * Ruf, Alfons, Die Pfarrkirche St. Michael in Lohr und ihre Baugeschichte. Lohr a. Main, 1983. * Ruf, Theodor, Quellen und Erläuterungen zur Geschichte der Lohr am Main bis zum Jahre 1559, Lohr a. Main, 2011. * Ruf, Theodor: Die Grafen von Rieneck. Genealogie und Territorienbildung. Würzburg 1984 (town history) == References == == Other websites == * * Town’s official webpage * * Handball in Lohr Category:Main-Spessart Category:11th-century establishments in Germany",
 "title": "Lohr am Main"
}