{
 "id": "893829",
 "text": "The Anglophone Crisis (), also known as the Ambazonia War,‘Ambazonia War’ drowns SDF 28th Anniversary , Journal du Cameroun, 28 May 2018. Accessed 25 October 2018. or the Cameroonian Civil War,Cameroon on Brink of Civil War as English Speakers Recount ‘Unbearable’ Horrors, The New York Times, 6 October 2018. Accessed 27 April 2019. is an ongoing armed conflict in the Northwest and Southwest regions of Cameroon. It is a part of the long-standing Anglophone problem. After the crackdown of the 2016–17 Cameroonian protests, Ambazonian separatists in the English-speaking Northwest and Southwest regions of Cameroon (formerly known as Southern Cameroons) started a guerilla warfare against Cameroonian armed forces. The later said that independence has occurred. In November 2017, the government of Cameroon declared war on the separatists. It sent its army into the regions.. ==Beginning== The conflict started as a small insurgency. It spread to most parts of the area within a year. By the summer of 2019, the government controlled the major cities and parts of the countryside. The separatists controlled parts of the countryside. They were also seen often in the major cities. A year later, clearly-defined frontlines had formed. Cameroonian army would raid separatist-controlled towns and villages, but it would not try to recapture them. Its main concern was securing the major urban areas. The Cameroonian government is supported by Nigeria. Some separatist groups are supported by Biafran separatists. ==Damages== Thousands of people have been killed in the war. More than half a million people have had to leave their homes. In 2019, talk took place between Cameroon and the separatists for the first time.Cameroon: Ambazonia leaders endorse Swiss-led dialogue to solve Anglophone crisis, Journal du Cameroun, 28 June 2019. Accessed 28 June 2019. special status was given to the Anglophone regions.Cameroon grants special status to Anglophone regions, Reuters, 20 December 2019. Accessed 22 December 2019. Despite this the war continued to intensify in late 2019. Cameroon's Separatists Intensify Attacks to Protest Dialogue, Voice of America, 24 September 2019. Accessed 26 September 2019. The 2020 Cameroonian parliamentary election cause more problems. The separatists became more assertive while Cameroon sent more forces. The COVID-19 pandemic saw one group declare a ceasefire to fight the spread of the virus. other groups and the Cameroonian government ignored this and kept fighting. ==Negotiations== There has been very few tries at negotiating. Switzerland tried in 2019 but they failed. Separatist leaders who were returned to Cameroon from Nigeria in 2018 were sent to prison for life. There was growing international pressure for an end to the conflict. In July 2020 Cameroon began talking with these imprisoned leaders. The talks were held between Sisiku Julius Ayuk Tabe and other imprisoned leaders and representatives of the Cameroonian government. The situation is still taking place. ==Related pages== *List of ongoing armed conflicts ==References== Category:2017 in Africa Category:2018 Category:2019 in Africa Category:2020 in Africa Category:2021 in Africa Category:Wars of independence Category:Civil wars involving Africa Category:Ambazonia Category:Rebellions in Africa Category:2010s conflicts Category:2020s conflicts",
 "title": "Anglophone Crisis"
}