{
 "id": "894095",
 "text": "Anne Fausto-Sterling (née Sterling; born July 30, 1944) is an American sexologist and geneticists. She is a professor at Brown University. Her works focuses on biology of gender, sexual identity, gender identity, gender roles, and intersexuality. Her research has has an impact on multiple fields such as biology, women's studies, feminist anthropology, and many more. Fausto- Sterling has a Bachelor of Science degree in Zoology from the University of Wisconsin and a Ph.D. in developmental genetics from Brown University. She taught at Brown University for 40 years and taught courses in biology and gender studies. She was also the director and founder of the Science & Technology Studies Program at Brown University. Fausto-Sterling retired from Brown University in 2014. == Research == Fausto-Sterling explains biological ideas using a feminist point of view. The topics she speaks on most of the time include sex, gender, and human genetics. Fausto-Sterling uses Dynamic Systems theory, which comes from developmental psychology, to describe how people’s infancy and early childhood affect them in adulthood. A dynamic systems model is based on development and done over a long period of time. The gender/sex theory states that the infant and their caregiver, through their way of life, will give the infant a sense of gender/sex in their world. This can impact them later in life and could have an influence on their sexuality or gender identity. === Other Research Interests === * Feminism & Feminist Theory * Feminist Sexology * Construction of Sexuality * Intersex Activism: Through her work, Fausto-Sterling has been an advocate for intersex people. These are people born with sexual anatomy that does not fit into the typical category of male and female. Her work has come to the conclusion that 1.7% of births are of an intersex child. She proposes a spectrum of sex that is not limited to male or female. * Gender/Sex Model: Fausto-Sterling describes sex and gender as two concepts that are connected but are not the same thing. Gender is made at both the cultural and individual level, but sex is also affected by culture and the individual. Fausto-Sterling proposes the Gender/Sex model that shows the connection of the two and how it is not best to treat them as completely different concepts. Fausto-Sterling’s work on Gender/Sex has not always been well received. == Publications == Fausto- Sterling has written three books, the first book was published in 1985 and is titled Myths of Gender: Biological Theories About Women and Men. Myths of Gender as well as Sexing the Body, were written for a general audience. Through these books Fausto-Sterling deals with the topics of gender, sex, and sexuality in new light than most biological writing. Fausto-Sterling’s work connects biological concepts with feminist theory. === Books === * Myths of Gender: Biological Theories About Women and Men (1985) * Sexing the Body: Gender Politics and the Construction of Sexuality (2000) * Sex/Gender: Biology in a Social World (2012) === Book Chapters === * Nature in Critical Terms for the Study of Gender (2014). Edited by Catherine R. Stimpson and Gilbert Herdt. She has also written other works like journal and online articles. ==References== Category:1944 births Category:Living people Category:American geneticists Category:Brown University faculty Category:American sexologists Category:Scientists from New York City Category:Writers from New York City Category:LGBT scientists Category:American LGBT writers Category:LGBT people from New York City Category:Lesbians Category:Intersex",
 "title": "Anne Fausto-Sterling"
}