{
 "id": "894022",
 "text": "Mohamed Camara (born 6 January 2000) is a Malian professional footballer. He plays as a midfielder for French Ligue 1 club AS Monaco and the Mali national team. ==Career== He started his career with AS Real Bamako. 2018 he went to FC Red Bull Salzburg in the Austrian Bundesliga. FC Red Bull Salzburg Official Homepage (German) He then played for the farmteam FC Liefering. In February 2018 he debuted versus FC Blau-Weiß Linz. Camara scored his first goal in March 2018 versus TSV Hartberg. In January 2019 he went on loan to TSV Hartberg in the Bundesliga. He made his debut in March 2019 versus FC Wacker Innsbruck. After the end of the loan he became part of the FC Red Bull Salzburg squad. In August 2022 Camara went to the French club AS Monaco.Homepagse RB Salzburg (German) ==National team== Camara played for Mali U17, U20 and U23. With the U20 he won 2019 the U-20 Africa Cup of Nations. On 13 October 2019 he played his first match for the Mali national football team versus South Africa. ==Doping ban== In November 2020 Mohamed Camara and Sekou Koita were suspended for three months. The team doctor gave them a medicine against altitude sickness which included forbidden components.FC Red Bull Salzburg Official Homepage ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National cup Europe Total Division Apps Goals Apps Goals Apps Goals Apps Goals Liefering 2017–18 2. Liga 15 1 — — 15 1 2018–19 2. Liga 14 2 — — 14 2 2019–20 2. Liga 6 1 — — 6 1 Total 35 4 — — 35 4 TSV Hartberg (loan) 2018–19 Austrian Bundesliga 7 0 0 0 — 7 0 Red Bull Salzburg 2019–20 Austrian Bundesliga 13 1 1 0 2 0 16 1 2020–21 Austrian Bundesliga 15 0 4 2 7 0 26 2 2021–22 Austrian Bundesliga 25 1 2 0 10 0 37 1 Total 53 2 7 2 19 0 79 4 Monaco 2022–23 Ligue 1 29 0 0 0 8 0 37 0 2023–24 Ligue 1 18 0 0 0 — 18 0 Total 47 0 0 0 8 0 55 0 Career total 142 6 7 2 27 0 176 8 ===International=== Appearances and goals by national team and year National team Year Apps Goals Mali 2019 2 1 2020 2 0 2021 6 0 2022 6 2 2023 6 0 2024 2 0 Total 24 3 :Scores and results list Mali's goal tally first. List of international goals scored by Mohamed Camara No. Date Venue Opponent Score Result Competition 1\\. 17 November 2019 Stade Omnisports, N'Djamena, Chad 2–0 2–0 2021 Africa Cup of Nations qualification 2 4 June 2022 Stade du 26 Mars, Bamako, Mali 1–0 4–0 2023 Africa Cup of Nations qualification 3 9 June 2022 St. Mary's Stadium-Kitende, Entebbe, Uganda 1–1 3–1 2023 Africa Cup of Nations qualification ==Honours== Mali U20 * Africa U-20 Cup of Nations: 2019 FC Red Bull Salzburg *Austrian Bundesliga: 2020-21, 2021-22 *Austrian Cup: 2020-21, 2021-22 ===Individual=== * Austrian Bundesliga Team of the Year: 2021–22 ==References== Category:2000 births Category:Living people Category:Malian footballers Category:FC Liefering players Category:FC Red Bull Salzburg players Category:Austrian football champions",
 "title": "Mohamed Camara (footballer, born January 2000)"
}