{
 "id": "894072",
 "text": "Sonic the Hedgehog 2 is a 2022 science fiction action-adventure movie based on the Sonic the Hedgehog video game franchise published by Sega. The movie is the sequel to Sonic the Hedgehog (2020), with Jeff Fowler directing from a script that was written by Patrick Casey, Josh Miller, and John Whittington and a story by Casey and Miller. The movie stars Ben Schwartz, Colleen O'Shaughnessey, Idris Elba, James Marsden, Tika Sumpter, Natasha Rothwell, Adam Pally, Shemar Moore, and Jim Carrey. Sonic the Hedgehog 2 follows Sonic and Tails as they try to stop Doctor Eggman and Knuckles the Echidna from finding the Master Emerald. It was released in France on March 30, 2022 and on April 8, 2022 in the United States. A third movie and a spin-off series focusing on Knuckles both came out in 2024. A spinoff movie focusing on Shadow the Hedgehog and season 2 of Knuckles will come out in 2026 while a spinoff movie focusing on Tails and a fourth movie will come out in 2027. A fifth movie will come out in 2030. ==Plot== Eight months after the events of the first movie, Sonic decides to help out his city as a vigilante hero with little success. Tom tells Sonic to remain patient for the day his powers will be needed before he and Maddie depart for Rachel's wedding in Hawaii. Sonic plans to have fun while home alone but is attacked by Robotnik, who has escaped the mushroom planet with the help of a powerful anthropomorphic echidna named Knuckles. To honor his ancestors, Knuckles demands the location of the legendary Master Emerald, an ancient relic that grants its user immense power and the ability to change reality to their will. Sonic is rescued by Miles \"Tails\" Prower, an anthropomorphic two-tailed fox who idolizes him and comes to warn him about Knuckles. Sonic convinces Tails to help him find the Master Emerald, while Robotnik reunites with his assistant Stone and, scheming to steal the emerald, offers to help Knuckles. Sonic and Tails follow clues to a Siberian cave on a map Longclaw gave Sonic before sending him to Earth, where they find a compass within a temple. Robotnik and Knuckles track them and chase Sonic and Tails down a mountain. Knuckles reveals that he lost his father and his whole tribe the same day Sonic lost Longclaw. Despite this brief moment of sympathy, Knuckles and Robotnik steal the compass, though Knuckles begins to question Robotnik's sense of loyalty and honor when he mocks Sonic for choosing to save a wounded Tails instead of the compass. Tom saves Sonic and Tails by using a ring to teleport them to the wedding. Rachel's fiancé Randall and his wedding guests reveal themselves as undercover agents of the Guardian Units of Nations (G.U.N. for short) and arrest Sonic, Tails, and Tom, who are then saved by Maddie and a vengeful Rachel, who reconciles with Randall. Meanwhile, Robotnik and Knuckles find an underwater temple containing the Master Emerald. Blaming himself for Tails' injuries, Sonic decides to face Robotnik and Knuckles alone and goes to the temple, where he fights with Knuckles to keep him from taking the Master Emerald. Seeing this as an opportunity, Robotnik uses the distraction to seize and fuse himself with the emerald, which explodes and sinks the temple into the water. With no use left for Knuckles, Robotnik betrays him and leaves him along with Sonic behind for dead. Working together, Sonic and Knuckles are able to escape just as Tails rescues them in a biplane. In Green Hills, Robotnik uses his new abilities to create a giant robot resembling himself. Sonic, Tails, and Knuckles work together to fight the robot and its accompanying drones and to reclaim the Master Emerald; however, it breaks, splitting into the seven Chaos Emeralds. Tom and Maddie save Sonic, who uses the Chaos Emeralds to transform into Super Sonic. He destroys the robot before dispersing the Emeralds and reverting to normal. In the aftermath, Robotnik is presumed dead and Knuckles fixes the Master Emerald from the remaining shards, before making a pact to protect it from evil with Sonic and Tails, and they start an idyllic life with the Wachowskis. In a mid-credits scene, G.U.N.'s forces have arrived at the site where the Giant Eggman Robot was destroyed. At the site, Walters is informed by his agent that they have been unable to find Robotnik. While Walters is sure that Robotnik could not have survived and bids him \"good riddance\", he does not notice Stone, who has disguised himself as a G.U.N. soldier, having survived himself to sneak away undetected. Walters is then informed by his agent that as they were removing Robotnik from their databases, they found a file dating back to over fifty years ago. This file contains coordinates to a well-hidden black site, and Walters realizes, much to his dread, that it concerns \"Project Shadow\". Meanwhile, in a remote research facility, a capsule slips out, inside of which a black hedgehog named Shadow awakens, his eyes crackling with chaos energy. ==Cast== * Ben Schwartz as Sonic the Hedgehog: An anthropomorphic blue hedgehog who can run at supersonic speeds. * Colleen O'Shaughnessey as Miles \"Tails\" Prower: An 8-year old anthropomorphic fox who can fly with his two tails. O'Shaughnessey is the only voice cast member from the Sonic the Hedgehog games to play the same role for the movie. * Idris Elba as Knuckles the Echidna: A brutish yet silly red echidna with super strength who collaborates with Doctor Eggman to find the Master Emerald, but later joins Sonic and Tails in trying to stop him. * James Marsden as Tom Wachowski: The sheriff of Green Hills, Montana and Sonic's friend. *Jim Carrey as Doctor Ivo Julian \"Eggman\" Robotnik: A mad scientist and Sonic's archenemy. * Tika Sumpter as Maddie Wachowski: Tom's veterinarian wife. * Adam Pally as Wade Whipple: Tom's chief deputy. * Natasha Rothwell as Rachel: Maddie's older sister who dislikes Tom. * Lee Majdoub as Agent Stone: Eggman's assistant. * Shemar Moore as Randall: Rachel's fiancé. * Lee Majdoub as Stone: Robotnik's former assistant who now works as a barista at the Mean Bean coffee shop. *Tom Butler as Commander Walters: The former Vice Chairman of the Joint Chiefs of Staff who is now the founder and leader of GUN. * Elfina Luk as the Secretary of Homeland Security who works for GUN under Commander Walters. * Melody Nosipho Niemann as Jojo: Rachel's daughter and the niece of Maddie and Tom. * Donna Jay Fulks as Longclaw, an anthropomorphic brown owl and Sonic's former mentor and caretaker. In February 2022, Sega of America and Paramount Pictures said they will be making a third Sonic movie, as well as a Knuckles spin-off series for Paramount+. ==References== ==Other websites== * Category:2022 movies Category:2022 action movies Category:2022 comedy movies Category:2020s American action movies Category:2022 adventure movies Category:2020s family movies Category:American adventure movies Category:American family movies Category:Japanese action movies Category:Japanese adventure movies Category:Movies set in Russia Category:Paramount Pictures movies Category:Sonic the Hedgehog movies Category:Sonic the Hedgehog",
 "title": "Sonic the Hedgehog 2 (movie)"
}