{
 "id": "894034",
 "text": "Elaeis (from Greek 'oil') is a genus of palms with two species, called oil palms. They are used in commercial agriculture in the production of palm oil. The African oil palm Elaeis guineensis (the species name guineensis refers to its country of origin) is the main source of palm oil. It is native to west and southwest Africa. It can be found between Angola and Gambia. The American oil palm Elaeis oleifera (from Latin oleifer 'oil-producing') is native to tropical Central and South America,Collins Guide to Tropical Plants, and is used locally for oil production. == Description == Mature palms are single- stemmed, and can grow well over tall. The leaves are pinnate, and reach between long. The flowers are produced in dense clusters; each individual flower is small, with three sepals and three petals. The palm fruit is reddish, about the size of a large plum, and grows in large bunches. Each fruit is made up of an oily, fleshy outer layer (the pericarp), with a single seed (the palm kernel), also rich in oil. == Species == The two species, E. guineensis and E. oleifera can produce fertile hybrids. The genome of E. guineensis has been sequenced, which has important implications for breeding improved strains of the crop plants. Image Name Common name Distribution Elaeis guineensis Jacq. African oil palm or macaw-fat west and southwest Africa, specifically the area between Angola and The Gambia Elaeis oleifera (Kunth) Cortés American oil palm South and Central America from Honduras to northern Brazil == Human use == These palms are grown commercially, mainly for three reasons: * The production of palm oil. Palm oil contains more Saturated fats than most other vegetable oils. It can withstand deep-frying heat and resists oxidation. It also contains no trans fat. * Oil from the African oil palm is used as biofuel. * These palms can be used to produce fiber. In coastal West Africa, the use of these palms may date back about 5.000 years. Palm oil was discovered in a tomb at Abydos, dating back to 3.000 BCE. Especially the African oil palm is widely cultivated in tropical countries outside Africa. Today, most of the commercially produced palm oil comes from Malaysia and Indonesia. == Controversy == Palm oil is controversial. This controversy is not based on palm oil itself, but on the conditions how it is produced. Very often, rainforest, with a high biodiversity is destroyed to make room for palm oil plantations. The companies producing the palm oil also often force people to move away and change their way of life. Especially in Indonesia, there is growing pressure for palm oil producers to prove that they are not harming rare animals in the cultivation process. In 2018 a Christmas TV advertisement by UK supermarket chain Iceland Foods Ltd, produced by Greenpeace, was banned by the UK advertising watchdog Clearcast, as it was deemed too political. Iceland Foods had committed to banning palm oil from its own-brand products by the end of 2018. == References == == Other websites == * Category:Articles with 'species' microformats Category:Pages with unreviewed translations Category:Arecaceae Category:Trees",
 "title": "Elaeis"
}