{
 "id": "894144",
 "text": "The Nutri-Score is a rating system that shows how healthy a piece of food is. In 2017, the French government selected it over several other, similar systems. The idea is to put the label on the front of products, so that consumers can easily compare. It is based on the calculation of a nutrient profiling system derived from the United Kingdom Food Standards Agency nutrient profiling system (FSA score). It has also been recommended by Belgian, Spanish, German and Dutch authorities as well as the European Commission and the World Health Organization. It was created by Santé Publique France, the French public health agency, based on the work of Serge Hercberg from Sorbonne Paris North University. Nutri-Score was also chosen because it is the most efficient label that tells about the nutritional quality of foods. == Calculation == A Nutri-Score for a particular food item is given in one of five classification letters: 'A' is the best, and 'E' the worst score. The calculation of the score involves seven different parameters of nutrient information per 100g of food which are usually available on food packagings. High content of fruits and vegetables, fibers, protein and healthy oils (rapeseed, walnut and olive oils, rule added in 2019) promote a better score, while high content of energy, sugar, saturated fatty acids, and sodium promote a worse score. In addition to the general calculation rules applied to most types of food, there are special rules for cheese, for “added fats” (fats that are meant as ingredients, such as vegetable oils or butter), and for beverages. == Adoption == EU laws do not allow countries to impose their own food labelling system, therefore they can only give recommendations. The Nutri-Score has been officially recommended by health authorities in France, Germany, Belgium, Netherlands, Luxembourg, Spain and Switzerland. In Portugal, Slovenia and Austria, some food companies such as Nestlé, Auchan or Danone announced that they would use the Nutri-Score although it was not officially recommended by the authorities. Opposition to Nutri-Score is coming from a coalition of countries including Italy, the Czech Republic, Cyprus, Greece, Hungary, Latvia, and Romania. The Italian government has proposed a competing food label system. Southern EU countries say Nutri-score puts the traditional Mediterranean diet at a disadvantage. The score is also used by Open Food Facts to allow people to compare the nutritional value of products. == References == == Other websites == * Development of a new front-of-pack nutrition label in France: the five-colour Nutri-Score , article in the WHO's Public Health Panorama (vol. 3, issue 4) which describes the Nutri-Score in detail * Official website at Santé Publique France Category:Food and drink Category:Pages with unreviewed translations",
 "title": "Nutri-Score"
}