{
 "id": "894224",
 "text": "\"How Do I Live\" is an American country pop song. The musician and songwriter Diane Warren recorded this song. It was first performed under LeAnn Rimes when she was age 14 (almost 15). A more advanced version of \"How Do I Live\" by Trisha Yearwood, however, was the real Grammy and Golden Raspberry Award nominated song. ==Background for the song== Both Yearwood and Rimes had their songs released on May 23, 1997. Warren first met Rimes inside a restaurant right after she (Rimes) won a Grammy Award for Best New Artist. Warren recorded the song when having Rimes in mind. When Rimes made her recording of the song the next day, however, Walt Disney Pictures (then called Buena vista Pictures Distribution), under which Touchstone Pictures was an operating label, decided she, then 14, was too young for singing of the song's subject matter. They also said then the recording by Rimes had too much \"pop\" sound. The violent plot of the movie Con Air (a 1997 action thriller) made the Touchstone Pictures skeptical to have the Rimes version in the movie. They then contacted older singer Yearwood. The latter recorded her cover of \"How Do I Live\". Her (Yearwood's) re-recording of the song was shown during Con Air. The version by Yearwood had a far more country vibe and style. The Yearwood and Rimes cuts had involvements in the United States' Billboard Hot 100. Rimes' version, though, was very strong on that chart. It was there for 69 weeks, the longest at that time. The Rimes cut was tagged onto compact disc and cassette. A longer version was later put on several studio albums, one being You Light Up My Life: An Inspirational. ==Chart performance== Rimes was more strong with the pop charts. Yearwood's version, however, was very strong in the country charts. The earlier's recording hit #2 on the U.S. Billboard Hot 100 charts. The latter's version hit #23 on the same chart. For almost two months, Rimes' version of the song was #1 on the Billboard Adult Contemporary chart. ==Awards== At the 1998 Grammy Awards, both songs were nominated for the Grammy Award for Best Female Country Vocal Performance. Yearwood was given that award. She also won a 1997 Academy of Country Music Award for the Top Female Vocalist. ==References== Category:Pop songs Category:Country music Category:1997 songs Category:Trisha Yearwood songs Category:LeAnn Rimes songs",
 "title": "How Do I Live"
}