{
 "id": "894492",
 "text": "The North Circular Road (officially the A406 and sometimes known as simply the North Circular) is a ring road around Central London in England. It runs from Chiswick in the west to Woolwich in the east via suburban North London. It connects lots of suburbs and other trunk roads in the region. Together with the South Circular Road, it forms a ring road around central London. This ring road does not make a full circuit of the city. Instead, it is C-shaped. This is because the crossing over the River Thames in the east is made on the Woolwich Ferry. == Route == The North Circular Road is the northern part of a ring-road around Central London. It has seen much more investment than the South Circular Road, and it runs on much wider roads. Existing houses were demolished for the North Circular Road. The route has other names at some points. However, it is mostly called the North Circular for route planning purposes. The route is mostly grade-separated dual carriageway from the A40 at Hanger Lane to the A13 in Beckton except for the Drury Way/Brentfield Road junction, the Golders Green Road/Brent Street junction, Henlys Corner and the section from Bounds Green to Green Lanes. In worse sections, the original names such as Gunnersbury Avenue and Bowes Road are used. ==Junctions== The North Circular Road has a lots of different junctions that connect to other roads. Some are complex and grade-separated, like at Charlie Brown's Roundabout near Woodford. Some are at-grade junctions with traffic lights. The original road only had at-grade junctions. Many of these were improved and grade separated in the late 1970s and early 1980s. ===Current junctions=== Name Destinations Notes Chiswick flyover , Hounslow Gunnersbury Park , Acton , Acton The historic London – Oxford postal route at Ealing Common Hanger Lane Gyratory , Acton Northolt Near Stonebridge Park station Brent Park, Superstores, Wembley Stadium, Industrial Estate Staples Corner , Kilburn, Cricklewood, Edgware, West Hendon A5 is the historic Watling Street from London to Wroxeter Brent Cross – Kilburn, Cricklewood, Hendon, Hatfield Henlys Corner West end of merge with the A1 Henlys Corner A special pedestrian crossing for Jews to use on the Sabbath is located here Henlys Corner East end of merge with A1 The historic Great North Road Colney Hatch Junction , Retail Park Hobart Corner , Whetstone, Southgate Bounds Green interchange , Southgate A regular congestion hotspot where traffic must narrow to single carriageway and perform a 90 degree turn. Transport for London have earmarked the junction for improvement. Clockhouse Junction Great Cambridge Road Roundabout , Enfield, Potters Bar, Ware, Royston, Cambridge Crooked Billet Roundabout Waterworks – Woodford, Leytonstone, Walthamstow Charlie Brown's Restricted access; eastbound exit and westbound entrance. The original Charlie Brown's was the roundabout underneath this junction. It was named after a pub next to the roundabout, which was demolished in 1972. Charlie Brown's Redbridge Roundabout , Stratford, Chelmsford, Romford Also the location of Redbridge tube station The historic Roman Road from London to Colchester Beckton Roundabout , Blackwall Tunnel ===Former junctions=== Name Destinations Notes Waterworks Corner To avoid Epping Forest, the original build of the North Circular met the A104 at a different location by a water works northeast of Walthamstow. Gants Hill Gants Hill Underground station is also at this location. ==Public transport== There are three bus routes where most of the route is on the North Circular Road: *London Buses route 34: between Bounds Green and Walthamstow/South Chingford (Crooked Billet) *London Buses route 112: between Ealing (Hanger Lane) and Finchley (Henlys Corner) *London Buses route 232: in Brent Park/Neasden and between Staples Corner/Brent Cross and Palmers Green (Green Lanes) == References == == Other websites == * A406 and Ringway 2 – North Circular on CBRD * A406 traffic updates on londontraffic.org Category:Transport in the London Borough of Barking and Dagenham Category:Transport in the London Borough of Barnet Category:Transport in the London Borough of Brent Category:Transport in the London Borough of Ealing Category:Transport in the London Borough of Enfield Category:Transport in the London Borough of Hounslow Category:Transport in the London Borough of Newham Category:Transport in the London Borough of Redbridge Category:Transport in the London Borough of Waltham Forest Category:Roads in London Category:Infobox road maps for Wikidata migration Category:Infobox road instances in the United Kingdom",
 "title": "North Circular Road"
}