{
 "id": "894575",
 "text": "Police brutality is when police use too much force against people when they do not need to. It is not okay and it is against the law. Examples of police brutality are hurting people too much, using weapons when they do not need to, racism, and arresting people in painful ways. ==Causes== Police brutality happens in many countries. This happens because the judiciary and the police fail. Sometimes the government wants the police to be very strict and punish people a lot, but this can result in police brutality. Sometimes the police do not learn how to do their job properly, and when they do something bad, they do not get in trouble. This can also make police brutality happen. Sometimes people are discriminated and this can make police brutality worse. === Campaigns to Stop Drugs === In countries with a lot of drug problems, like gang violence, drug selling, and overdosing because of drugs, the government often tries to stop the problem by working together. They try to change how people think about drugs through education, how the government works, and mostly by changing how the police do their job. Police get more money and power to fight drugs in neighborhoods. Some people think that the police should use any way necessary to stop drugs, and police might start getting trained and armed like the military. But, many studies show that these efforts do not work, and the drug problem gets worse. For example, in the United States, some people say that the government's plan to stop drugs, called the \"War on Drugs\", has not worked. They say that since the government started this plan, there have been more drug crimes and more people dying from taking drugs. === Legal System === Sometimes the government does not make sure that police officers are held responsible for hurting or mistreating people. This can make it seem normal for police to be violent. It is common for people to use their phones to record police officers, but it is up to the legal system to make sure the police are doing their job correctly. One way to make sure police officers are doing their job correctly is by having them wear body cameras on their uniforms. However, sometimes the footage from these cameras is not shown to the public, making it hard to know if the police are doing their job correctly. In some places, the law does not have rules against police being violent. This means that police officers can use violence and not get in trouble if they say they had a good reason. Police officers are allowed by the law to use force. People who work in law enforcement may become megalomaniacs if they have a lot of power. They begin to feel like they are in charge of society, especially when using old ways of policing. This can lead to the belief that they are not controlled by the law. Some people think that certain officers are more likely to be violent because they have a certain mental condition called psychopathy. Studies have shown that there are different types of officers who are more likely to use too much force. These types include officers who have personality disorders, officers who have had bad experiences on the job, young or new officers, officers who were taught the wrong way to do their job, and officers who have personal problems.Scrivner, 1994: 3–6 However, some people think that the idea that some officers are just \"bad apples\" is too simple. They say that there are bigger problems in the police system that can cause officers to be violent. These problems include the way that police officers are expected to act, the way that police officers are managed, and the way that police officers are held responsible for their actions. For example, some police departments have a culture of not telling superiours bad actions commited by other police officers. In many laws, there are no rules to control how much force police officers can use. The use of force continuum is a guide that tells police officers what level of force is appropriate for different situations. But this guide is not used in many places. The government gives police officers the power to use force, but there are not many laws that limit how much force they can use. Sometimes, even though it is legal, the police use too much violence. This is especially true when the police are trying to control or punish people for their political beliefs. Police brutality is a term used to describe when the police use violence for political reasons, when it is not acceptable according to society's values and beliefs. It means when the police use violence when it's not justified, which is different from using excessive violence but in justified circumstances. Research shows that some police officers believe that the legal system is not working well, and they feel they need to take matters into their own hands. This is called \"vigilantism\", when police officers believe that a suspect deserves more punishment than what the courts will give them.Chevigny, P. (2008). \"Police Brutality\", In Encyclopedia of Violence, Peace and Conflict. oxford: Elsevier Science and Technology, 2008. When the police chase a suspect at a high speed, the officers can become very angry and excited. This can make it hard for them to think clearly when they finally catch the suspect. This can lead to the officers using too much force. This is called \"high-speed pursuit syndrome.\" == Related pages == * Militarization of police ==References== Category:Police misconduct",
 "title": "Police brutality"
}