{
 "id": "894690",
 "text": "Indecent exposure is a term that is used that describes the act of a person deliberately showing parts of their body in a way that is not considered good behavior by local standards, called decency. These standards vary around the world. These rules are often affected by religion, morality, or tradition They can be justified as \"necessary to maintain public order\". Non-sexual exhibitionism, or public nudity, is sometimes said to be indecent exposure. If sexual acts are performed, or hinted at, it is very often considered to be indecent exposure. For this, there sometimes is a case of gross indecency. This term is usually used for a more serious offence. Many communities have ideas of what parts of the body should be overed in public. Not covering these parts may be seen as indecent exposure. For example. in many Muslim countries, a woman not wearing a veil may be seen as indecent. She may be seen as not being modest. While a woman exposing her breast seen as indecent in many countries but they are often allowed to breastfeed their children in public without punishment. == Different standards == What defines indecent varies widely. For example, it is seen as indecent for a woman show their nipples in much of the United States. In these areas is women must cover their nipples with pasties. In other areas. women are allowed to be topless. New York City is a place were it is legal for a woman to be topless in public. The standard of decency are developed in each given community. They can also say what kind of clothing should be worn. There are societies, such as those in Saudi Arabia or Afghanistan, where the standards are very strict. In these societies, modesty requires that most of the body is covered, most of the time. In other societies, such as the tribal societies of the Pirahã or theMursi, is is normal for people to be naked. == History == The standards of decency have varied over time. During the Victorian era, exposure of a woman's legs and arms was seen as indecent in much of the Western world. At formal occasions, hair was sometimes required to be covered with a hat or bonnet. As late as the 1930s, and sometimes the 1950s. both women and men were expected to bathe or swim in public places wearing bathing suits that covered above the waist. An adult woman exposing her navel was seen as indecent in parts of the West into the 1960s and 1970s. Moral values changed drastically during the 1990s and 2000s. This also changed the criteria for indecent exposure. Public exposure of the navel has been accepted in public. In the 2000s, the buttocks was often exposed while wearing a thong. For many years, however, it was quite common for women to show boobs at public beaches throughout Europe and South America and even some parts of the United States. From 2010 to 2020, the numbers of women going topless on beaches has taken a sharp drop. This is possibly explained by the rising popularity of the smartphone, combined with websites people share pictures of (partly) naked women. == References == Category:Paraphilias Category:Sex crimes Category:Nudity",
 "title": "Indecent exposure"
}