{
 "id": "894835",
 "text": "The Manipur State Museum () is an institution displaying a collection of artistic, cultural, historical and scientific artefacts and relics in Imphal, Manipur. It has galleries housing materials of natural history, ethnology and archeology. == Overview == The Manipur State Museum () houses ornaments, textiles, agricultural equipments of Ancient Manipur, Medieval Manipur and Modern Manipur. The museum conveys an all encompassing picture of the history of the life of the Manipuri people. == History == The Manipur State Museum () was inaugurated by Indira Gandhi, the then prime minister of India on the 23rd of September, 1969. It has been expanded to a multipurpose museum. It has many sections and subsections. One prominent section is the ethnological gallery. This gallery was formally reopened by Ved Marwah, the then Governor of Manipur, on the 20th of January, 2001. == Collection == The most famous piece on display is a Hiyang Hiren, used by the royalties. It is 78 feet in length and is in an open gallery. Other collection include coins, manuscripts, instruments, pottery, dresses, paintings and ornaments of Ancient Manipur, Medieval Manipur and Modern Manipur. The Museum has a publication for more than 500 species of rare orchids out of which only 472 orchids have been identified so far. Several experts opined that no one come across anywhere in India with such variety of orchid species as in Manipur. The royal Howdah (Shamu Taipot), presently on display in the Manipur State Museum, was personally used by Sir Churachand Singh KCSI (1891-1941 AD), CBE, the King of Manipur. == Exhibits == The Museum exhibits on mainly cultural themes and awareness programs. Some of the exhibits include tribal ornaments, Meitei ornaments, headgears, agricultural implements, domestic implements, hunting tools, smoking pipes and lighters, terracotta pottery, gold and silver utensils, polo saddlery, traditional water pipe, Meitei textiles, Meitei time measuring device, ancient gold mask, caskets, riderless horse statues, arms and armoury, basketry, tribal costumes, etc. The time measuring implements like the \"Tanyei Pung\" and the \"Tanyei Chei\" testify the knowledge of the ancient Meiteis in Ancient Manipur civilization. The costumes exhibited are important to study the social structure of Manipur. The royal Howdah (Shamu Taipot) of Sir Churachand Singh KCSI (1891-1941 AD), CBE, the then King of Manipur, is also displayed in the Manipur State Museum. The Manipur State Museum also organises workshops for traditional Manipuri sculptors-souvenir. == References == == Other websites == * Manipur State Museum artnculturemanipur.gov.in * Manipur State Museum www.museumsofindia.org Category:Museums in Manipur",
 "title": "Manipur State Museum"
}