{
 "id": "894987",
 "text": "The Sekta Archaeological Living Museum () is a museum in Sekta, Manipur. It is a protected archaeological site. It is one of the 6 mounds identified in the region. It is known for its secondary burial sites. This site was excavated by the Archaeological Survey of India in association with the State Archaeology Department of Manipur. The Department of History of the Manipur University also participated in the excavations in 1991. == Location == The archaeological excavation was carried out in Sekta village. Presently, it is an open air living museum. It is located about from Imphal and north of Lamlai. The place is situated at the Imphal-Ukhrul road. It is to the northeastern direction of Imphal on the left bank of the Iril River. == Features == According to the reports, the Sekta archaeological site has 6 cleanly demarcated burial mounds. One burial mound was excavated. This mound covers an area of . It is now a protected site under the Archaeological Survey of India. The excavations have unearthed many findings about the proto-Meitei people. The cultural practice of the Meiteis of Sekta, burying their dead in graves, was revealed. During the excavations, other buried essential items of social and economic life were also found. These excavations of the burial cum habitation area dated to late centuries BC. The archaeologist and historians have been able to reassess the historical link to the people of Ancient Manipur (Antique Kangleipak). According to an evaluation, more than one group of people lived within exclusive burial areas depending on their occupation in the burial mound. The excavations were divided, stratification wise, to 7 cultural periods in succession. The findings include different types of urns, containing several funerary items and a relic casket. The funerary items are made of copper, brass and iron. The relic casket is made of bell metal. == References == == Other websites == * * * * Category:Museums in Manipur Category:Archaeological sites in India",
 "title": "Sekta Archaeological Living Museum"
}