{
 "id": "894983",
 "text": "On New Year's Eve, several places (mostly in North America) mark the starts for New Years by lowering or raising an object. Many of these events have strong similarity to the Times Square New Year's celebrations that began in New York City back in December 1907 when they rang in 1908. Three years before the Ball Drop got started was when Times Square began celebrating New Year's. The Times Square Ball lowering events take place one minute before midnight their time. Between 1½ billion and 2 billion people celebrate while looking at the New York Times Square Ball Dropping. ==Atlantic and Eastern Times== Other places in the United States and Canada celebrate with other drops/object lowering and raising. These include the Miami Orange Drop, a similar New Year's Eve dropping in Orlando, a pineapple symbol lowered in Sarasota, a sardine symbol lowering for Eastport, Maine. They also drop a maple leaf symbol on the Atlantic Time celebrating when the New Year begins from there. In the city of York, Pennsylvania, white roses are lowered almost each December 31. In Buffalo, New York another ball is dropped. The drop is, though, performed by manual operation. ==Central, Mountain and Pacific Time regions== In Fort Smith, Arkansas at Garrison Avenue and 6th Street, a Ball Drop celebration almost like New York is performed. In New Orleans, fleur de lys are brought down. The fleur de lys drops are shown on Dick Clark's New Year's Rockin' Eve almost every New Years Eve Night. Tulsa, Oklahoma also performs a Central Time Area Ball Drop on New Years Eve. In Seattle, Washington, when New Year's Eve celebrations are performed, the Space Needle's elevators are raised (sent up). ==COVID-19 cancelations== In December 2020 in most places, and for some the following year, New Year's raising and lowering parties were canceled or restricted for COVID-19 reasons and scheduling interference related to the COVID-19 situation.> ==References== Category:New Year Category:Manhattan",
 "title": "List of objects dropped on New Year's Eve"
}