{
 "id": "894945",
 "text": "Choro-Q Advance (Japanese: チョロＱアドバンス Choro-kyū Adobansu) (localized as Gadget Racers in the United States and Penny Racers in Europe) is the first of two Choro-Q video games to be released on the Nintendo Game Boy Advance. == Gameplay == Choro-Q Advance is described as a \"CarPG\". The main goal of the game is to advance across five sections of a world map, completing several events along the way in several categories (such as a simple race, a speed test, a single lap dash, a drag race or a braking test). Wins earn money and parts, with the player's stats being able to be upgraded through the use of new parts, and also visual customisation of the player's car, spedometer and changing their horn. There were also other types of races - battle races where players would shoot eachother with weapons equipped to their cars, and races across water that would require floats. These two types would carry onto the sequel. The game uses a graphical system similar to other GameBoy Advance racing games at the time, with Mode-7 styled ground effects with billboarded sprites intended to give the impression of 3D graphics. This game allows players to share \"bottle racers\" with other players that would appear in the races of the players that received said bottle racers. This was included along with a traditional link-play mode via the Game Boy Advance Link Cable. == Trivia == * The Japanese version of the game featured a mail system that would inform you of specific things on your journey through the events. This was removed from all other versions of the game. == Other websites == *https://gamefaqs.gamespot.com/gba/915173-gadget-racers *https://gamefaqs.gamespot.com/gba/915173-gadget-racers/data *https://gamefaqs.gamespot.com/gba/915173-gadget-racers/images *https://gamefaqs.gamespot.com/gba/915173-gadget-racers/videos Category:2001 video games Category:Game Boy Advance-only games Category:Racing video games Category:Video games developed in Japan",
 "title": "Choro-Q Advance"
}