{
 "id": "89514",
 "text": "The WWE Championship is a professional wrestling world championship in WWE for the men of the SmackDown brand. It is the first world title of WWE. The title is said to be the biggest prize in professional wrestling and millions of people around the world watch matches for it. It is one of two world championships in WWE along with the World Heavyweight Championship from the Raw brand. ==History== ===Beginning=== The WWE World Championship was created in 1963, and Buddy Rogers became the first world champion on April 29. It may have been created because of things that happened in the National Wrestling Alliance (NWA) which is a wrestling company (or promotion) that had many \"territories\" in North America and some around the world. In the 1950s, Capitol Wrestling Corporation (CWC) was an NWA territory, and in 1963, people in CWC had a lot of control over the rest of the NWA. During this time, Buddy Rogers held the NWA World Heavyweight Championship, the world title of the NWA, until Lou Thesz defeated Rogers for the championship on January 24, 1963. After an argument over who should have won, CWC left the NWA and created a new promotion called the World Wide Wrestling Federation (WWWF). The new company then made up a story for its new title, and said that the WWWF World Heavyweight Championship was separated from the NWA World Championship, and there was a tournament in Rio de Janeiro to decide a new champion. They said that Buddy Rogers won this tournament, by beating Antonino Rocca in the finals. (The tournament actually did not happen.) The WWWF came back to the NWA once again, and the WWWF was renamed to World Wrestling Federation (WWF) in 1979. After WWF left the NWA forever in 1983, the championship was named the WWF World Heavyweight Championship, and later, the WWF World Championship or WWF Championship in the 1990s. ===Importance=== In 1991, World Championship Wrestling (WCW), another NWA territory, created the WCW World Heavyweight Championship and it was just as important as the NWA world title. WCW then left the NWA and became a rival promotion to the WWF. Both promotions became popular, and fought the \"Monday Night Wars\". This was a fight to see who could get better ratings on TV. Near the end of the ratings war, WCW started to lose money, and the Monday Night Wars ended in March 2001 with WWF buying WCW. After that, WWF had all of WCW's videos, some of their wrestlers and championships, and other things. The group of wrestlers who were in WCW joining the WWF was called \"The Invasion\". After this, the WCW World Championship was made one with the WWF World Championship, at Vengeance 2001 in December. At the show, Chris Jericho beat The Rock to win the WCW World Championship, and Stone Cold Steve Austin to win the WWF World Championship. Because of this, Chris Jericho was the last WCW World Champion and the Undisputed WWF World Champion as there was no dispute over what the most important prize in professional wrestling was anymore. ===Undisputed World Championship and going back to a normal world championship=== By 2002, the number of wrestlers in WWF was twice as big because they now had wrestlers from WWF before the end of WCW, and wrestlers who came from WCW and ECW. As a result of the increase, the WWF split its wrestler numbera with each half performing on one of WWE's two weekly TV shows - Raw and SmackDown!. Each show also had different championships and bosses. This was called the Brand Extension. In May 2002, the WWF was renamed to World Wrestling Entertainment (WWE) and the championship was called the WWE Undisputed World Championship. After these changes, the WWE Undisputed Championship was not on Raw or SmackDown and wrestlers from both brands could challenge the WWE Undisputed World Champion. When Eric Bischoff became the General Manager of Raw and Stephanie McMahon became the General Manager of SmackDown, McMahon brought the WWE Undisputed World Champion at the time, Brock Lesnar, to the SmackDown brand, and left the Raw brand without a world title. On September 2, after arguing about the brand that the Undisputed Championship should be on, Eric Bischoff announced the creation of the World Heavyweight Championship, separate from the Undisputed Championship. Then, the WWE Undisputed World Championship was called the WWE World Championship or just the WWE Championship. In 2011, there were two WWE Champions - John Cena and CM Punk. On the August 1 episode of Raw the Chief Operating Officer of WWE Triple H, announced a match to decide who would be the WWE Champion between Cena and Punk. At SummerSlam, Punk beat Cena to be the only WWE Champion, but that night Alberto Del Rio cashed in his Money in the Bank contract and became the new WWE Champion. The holders of the contract gets a world title match whenever they want (they could also fight for the ECW Championship when the ECW brand was around). On December 15, 2013, Randy Orton beat Cena for the World Heavyweight Championship at TLC: Tables, Ladders, & Chairs. He was already WWE Champion when he won the championship and made the World Heavyweight Championship into one with the WWE Championship, which from that point on was called the WWE World Heavyweight Championship. Wrestlers stopped fighting for the old World Heavyweight Championship the next day. The title was renamed the WWE World Championship shortly after the start of the second brand extension. The WWE Universal Championship was created Raw and the original title became exclusive to SmackDown Live. Soon after, it was changed back to the WWE Championship. === Undisputed WWE Universal Championship === At the second night of WrestleMania 38 on April 3, 2022, SmackDown's Universal Champion Roman Reigns defeated WWE Champion Brock Lesnar in a Winner Takes All match to win both championships and become the Undisputed WWE Universal Champion. WWE called the match a championship unification match; however, both titles's histories are still separately active with Reigns being a double champion, defending both titles together across both brands as the Undisputed WWE Universal Championship. On the April 24, 2023, episode of Raw, WWE Chief Content Officer Triple H announced that regardless of what brand Reigns was drafted to in the 2023 WWE Draft, he and his undisputed championship would become exclusive to that brand. Triple H then presented a new World Heavyweight Championship for the opposing brand, which was won by Seth \"Freakin\" Rollins at Night of Champions. Reigns was drafted to SmackDown and the World Heavyweight Championship became exclusive to Raw. On the June 2, 2023, episode of SmackDown, Triple H gave Reigns with a new singular championship belt to represent the Undisputed WWE Universal Championship. Despite this, Reigns' manager Paul Heyman continued to carry the old WWE and Universal Championship belts until the end of July. After Cody Rhodes won the championships from Reigns in a Bloodline Rules match at WrestleMania XL Night 2 on April 7, 2024, the combined championships began being simply called the Undisputed WWE Championship. == Brands == After the WWE brand extension, WWE started having drafts each year, where some wrestlers changed brands. After three years on the SmackDown brand, the WWE Championship switched brands during the 2005 draft, when the WWE Champion John Cena was sent to Raw while the World Heavyweight Champion Batista was sent to SmackDown. On June 11, 2006, Rob Van Dam used his Money in the Bank contract at ECW One Night Stand for a WWE Championship match against Cena. Van Dam beat Cena to win the WWE Championship, moving the title to the ECW brand, a brand WWE created after buying the Extreme Championship Wrestling promotion. On July 3, Edge beat Cena and Van Dam in a Triple Threat Match to win the WWE Championship and with Edge on the Raw brand at the time, Edge brought the title back to Raw. After the 2008 WWE Draft, the WWE Champion Triple H was drafted to SmackDown, moving the WWE Championship to the SmackDown brand. The following year, the title returned to Raw after Triple H was drafted back to Raw during the 2009 WWE Draft, and the championship stayed there. When SmackDown's Batista won the title from Raw's John Cena at Elimination Chamber, it still stayed on Raw because Batista was sent there. From August 2011 to July 2016, all WWE TV programming became \"Supershows\" that had wrestlers from both Raw and SmackDown. This meant that the WWE Championship matches could happen at any WWE event. The brand extension came back in 2016 and the WWE Champion at the time Dean Ambrose was drafted to SmackDown Live, making the title SmackDown- exclusive. WWE then made the Universal Championship for Raw. Date of brand change Brand Notes [[WWE SmackDown|SmackDown!]] WWE Undisputed Champion Brock Lesnar signed with SmackDown!, making the title exclusive to the brand. The title was renamed to WWE Championship after the World Heavyweight Championship (original) was established for Raw. June 6, 2005 Raw WWE Champion John Cena was drafted to Raw during the 2005 WWE Draft Lottery. June 11, 2006 ECW Following WWE's restart of Extreme Championship Wrestling as a third brand, Rob Van Dam was chosen by ECW official Paul Heyman to move to the new brand. At ECW One Night Stand, Van Dam cashed in his Money in the Bank contract and defeated John Cena to win the WWE Championship, bringing the title to ECW. The ECW World Heavyweight Championship was introduced again and awarded to Van Dam, who held both titles. July 3, 2006 Raw The WWE Championship returned to Raw after Edge defeated Rob Van Damand John Cena. June 23, 2008 SmackDown WWE Champion Triple H was drafted to SmackDown during the 2008 WWE Draft. April 13, 2009 Raw WWE Champion Triple H was drafted back to Raw during the 2009 WWE Draft. August 29, 2011 No brand End of first brand split. The WWE Champion could appear on both Raw and SmackDown. The WWE Championship and the World Heavyweight Championship were unified in December 2013, with the World Heavyweight Championship retired as a result. July 19, 2016 SmackDown Restart of the brand split. WWE Champion Dean Ambrose was drafted to SmackDown during the 2016 WWE Draft. The WWE Universal Championship was created for Raw. November 1, 2019 Raw WWE Champion Brock Lesnar quit SmackDown and went to Raw. April 28, 2023 SmackDown Undisputed WWE Universal Champion Roman Reigns was drafted toSmackDown during the 2023 WWE Draft. A new World Heavyweight Championship was created for Raw. == Custom belt designs == Special belts have been made to match the characters of some champions: *\"Superstar\" Billy Graham (red leather strap) *The Ultimate Warrior (white, blue, and purple leather straps) *Sgt. Slaughter (purple leather strap, changed to original black strap after beating The Ultimate Warrior) *\"Stone Cold\" Steve Austin (\"Smoking Skull\" belt) *John Cena (Spinner belt with a spinning WWE logo in the center) *Edge (Spinner belt with a \"Rated-R Superstar\" logo in the center) *The Miz (Spinner belt with WWE logo flipped upside down to look like the letter \"M\") *Daniel Bryan (Black leather strap replaced with wood and fabric) A much bigger version of the belt was created for André the Giant before WrestleMania III, but he never wore it as champion. The belt Brahma Bull logo in the center that was made for the Rock was lost and was never on TV. Edge had created a special belt different from the \"Rated R Spinner\" one that he used for his second reign, but the plans were scrapped because of little time. ==Reigns== == Notes == == References == == Other websites == * WWE Championship Title History Category:World Wrestling Entertainment championships Category:1963 establishments",
 "title": "WWE Championship"
}