{
 "id": "895281",
 "text": "The Imphal Peace Museum (IPM) (; ) is a World War II museum at the foothills of the Red Hills (Maibam Lokpa Ching) in Manipur. It is a living memory of the Battle of Imphal (Anglo-Japanese war) and other World War II battles (March- July 1944) fought in Manipur. It is supported by the Nippon Foundation (TNF), a non-profit grant making organization, collaborating with the Manipur Tourism Forum and the Government of Manipur. Notably, in a poll conducted by the British National Army Museum, the Battle of Imphal and Kohima was bestowed as Britain's Greatest Battle. Imphal Peace Museum is the winner of India's Best Design Award in the year 2019. The main attraction to the museum is the display of the Japanese calligraphy of the word \"Heiwa\" () by Shinzo Abe, the prime minister of Japan. == History == The Imphal Peace Museum () was founded in the year 2019. It was opened on the 75th anniversary of the Battle of Imphal. Former British and Japanese adversaries were present in the inaugural event of the museum. Dominic Asquith, the British High Commissioner to India, and Kenji Hiramatsu, Japanese ambassador to India, attended the opening of the museum. The museum's interior and exhibitions designs are one of the best works done by International Award-winning designer Suresh Huidrom. In 2019, the Imphal Peace Museum won India's Best Design Award for the creativity and innovative interior design. In 2021, the museum represented India at the Muse Design Awards 2021, New York and won silver in the field of interior design and architecture. During the same year, the museum was nominated finalist at the Society of British Interior Design and International Award 2021 for the Best Interior Design. Honorary Mention at Singapore Interior Design Award 2021, Singapore. Most Creative Interior Design of the Year 2021 by Global Architect and Builders Award 2021. == Exhibitions == The Imphal Peace Museum has three sections. === First Section === The first section exhibits a timeline of the Battle of Imphal. The names of the casualties in the war are also shown. The names of the people of Manipur who joined the Indian National Army (INA) are also featured. The displaying war artefacts include artillery shells collected by the local people. There are also photographs of personal notes and the uniform of a Japanese soldier shown. === Second Section === The second section shows the scenarios after the WWII in Manipur. It highlights the impact of the war and the process of recovery. Early television sets, photographs and cameras are also displayed. === Third Section === The third section displays the art and culture of Manipur. These are shown in the forms of photographs, audiovisual features and still models. == Awards and honours == Awards Category Results India's Best Design Award 2019 Creativity and innovative interior design Muse Design Awards 2021, New York Interior Design, Pavilions and Exhibitions Society of British Interior Design and International Award 2021 Best Public Space Interior Design Singapore Interior Design Award 2021 Best in Exhibition Design - Parmanent Honorary Mention Global Architect and Builders Award 2021 Most Creative Interior Design of the Year == References == Category:Japanese-Meitei culture Category:Museums in Manipur Category:Imphal",
 "title": "Imphal Peace Museum"
}