{
 "id": "895363",
 "text": "My Dear Bootham () is an 2022 Indian Tamil-language children fantasy comedy drama film film written and directed by N. Ragavan of Manjapai and Kadamban fame. It is produced by Ramesh P. Pillai under the banner of Abhishek Films. It stars Prabhu Deva as the title role with Ashwanth Ashokkumar. The film's music and score is composed by D. Imman, with cinematography by U. K. Senthil Kumar and editing done by San Lokesh.The film marks the third collaboration between Prabhu Deva and Remya Nambeesan after Mercury and Bagheera. The film was released in theaters on July 15, 2022 and opened to positive reviews from critics and audiences with praised the social message and Prabhu Deva and Ashwanth's performance. ==Plot == The movie starts in the genie world where the King of all, Karkimuki is sad he has no son for all these years. After praying to Lord Murugan, his wishes come true and he gets a son. He shows all of his love he supressed all these years and loves him unconditionally. One day, his son asks him to take him to the planet where Siddhars live and so Karkimuki takes him there. Accidentally, his son enters a deep burrow to hide from his father where he disturbs a Siddhar's thavam that has been continuing for a thousand years. An angry Siddhar wakes up and curses Karkimuki that he will sent to Earth as a statue and if he is released by someone, that someone has to say a mandaram for Karkimuki to return to the Genie World. Thirunavukarusu (Thiru) is an ordinary kid but he is a stammerer. Because of this, he gets bullied in school by his classmates. The teacher does not allow him to read out loud when it is his turn due to his stammering. The shopkeeper is impatient to listen to what Thiru wants to buy so asks him to write down whatever he wants. His mother does not listen either, but loves him dearly. One day on a school trip, Thiru is chased by a dog and falls in a ditch where he finds a doll and releases Karkimuki. Karkimuki refers to Thiru as Deivam and scares Thiru. Karkimuki follows Thiru home, only for Thiru to realise only he can see the genie. Eventually, they become friends and Thiru plays a joke on everyone that used to make fun of him. He asks all his wishes to Karkimuni and has fun. The teacher tells everyone there will be a speaking contest at school and Thiru wishes to participate but gets scared because of his stammer. He asks Karkimuki to get rid of his stammering and Karkimuni agrees. He starts speaking at the contest only to start stammering again. Thiru gets upset and cries on the stage, wetting his pants. His mom is helpless and comforts him. Thiru does not go to school for the next days and decides to stay at home. Thiru shouts at Karkimuki for tricking him and Karkimuki apologises saying genies have some rules they must never break such as never bringing someone from dead, never to stop time and to never to cure problems related to the mind. Karkimuki says Thiru has a problem related to his mind and not a condition. Thiru tells Karkimuki never to speak to him again. During a robbery, Karkimuki manages to save Thiru's mum so they become friends again. Karkimuki encourages him to ignore everyone and to go to school so he decides to go but promises his mom he will never do anything without telling his mom first. At school, there is another contest and Thiru manages to win first prize, shocking everyone who underestimated him. He hides this from his mom as he thinks she will get mad at him. Thiru asks Karkimuki what he wants and Karkimuki tells him everything that happened, bringing tears to Thiru. Thiru assures the genie he will say the mandaram and reunite him with his son. Day after day, he practices the mandaram but struggles. One day, as he is practicing his mom catches him and asks him what it is. He runs away but she hits him and asks him. Watching this, Karkimuki reveals himself to her and she gets scared. Karkimuki decides to go away as Thiru's mom is very scared. Later, Thiru shouts at his mom for sending the genie away as he was the only person who patiently listened to him and no one else listened including her. He runs up to the terrace to find Karkimuki slowly fading away. Thiru cries and gets angry trying to say the mandaram. He finally manages to say the mandaram and it opens a portal for him to go back to the genie world. As he is about to leave, a kite string out of nowhere flies across and slits Thiru's mom's throat, killing her. Karkimuki watches as Thiru cries over his dead mum and decides to bring her back to life which causes Karkimuki to die. Thiru and his mum hugs in tears. A final scene shows Thiru speaking on a stage without stammering. ==Cast== *Prabhu Deva as Karkimuki, the Genie *Ashwanth Ashokkumar as Thirunavukarasu *Remya Nambeesan as Thirunavukarasu's Mother *Shakthi Rithvik as Thirunavukarasu's friend *Saathvik as Thirunavukarasu's friend *Master Param Guganesh as Thirunavukarasu's friend *Aazhiya as Thirunavukarasu's friend *Samyuktha Shanmuganathan as Thirunavukarasu's Teacher *Imman Annachi as Shop Owner *Swaminathan as Thirunavukarasu's Relative *Suresh Chandra Menon as Doctor *Samyuktha Shanmuganathan as Thirunavukarasu's Teacher ==References== Category:2022 movies Category:2020s Indian movies Category:Tamil-language movies",
 "title": "My Dear Bootham"
}