{
 "id": "895311",
 "text": "To Sir, with Love is a 1967 British drama movie directed by James Clavell and was based on the 1959 novel of the same name by the author E. R. Braithwaite. It stars Sidney Poitier and features Christian Roberts, Judy Geeson, Suzy Kendall, Patricia Routledge and singer Lulu making her movie debut. James Clavell also wrote the screenplay of the story, which is quite different from the novel. A 1996 television movie sequel, To Sir, with Love II, was released nearly three decades later, with Poitier in the same starring role. == Plot == The movie is about a teacher from British Guiana who deals with social issues of problematic, undisciplined and anarchic students in a run-down school in the East End of London. ==Release== The movie was internationally very successful at the box office, and made $42,432,803 at the box office out of a movie budget of $640,000. It was the sixth highest grossing movie of 1967 in the United States. To Sir, with Love got very positive reviews, as many movie critics and moviegoers enjoyed it. To Sir, with Love holds an 89% \"Fresh\" rating on the movie review website Rotten Tomatoes based on 28 reviews. The movie ranked number 27 on Entertainment Weeklys list of the 50 Best High School Movies. Poitier especially benefited from that movie's success, considering he agreed on only $30,000 for his movie role in exchange for 10% of the box office and thus earned more than $4,200,000, which was one of the most impressive payoffs in movie history. The novel's author E. R. Braithwaite hated the movie, particularly because the novel's interracial relationships and racial issues were not included in the movie's screenplay, although the royalties from the movie made him wealthy. ==Soundtrack== The movie's title song \"To Sir with Love\", sung by Lulu, peaked at the top of the Billboard Hot 100 chart in the United States for five weeks in the autumn of 1967 and ultimately was the best-selling single in the United States of that year. ==References== ==Other websites== * * * Category:1967 movies Category:1960s drama movies Category:British drama movies Category:Columbia Pictures movies Category:Movies based on books Category:High school movies Category:Movies about educators Category:Movies about sexuality Category:Movies about bullying Category:Movies set in London Category:Movies set in the 1960s",
 "title": "To Sir, with Love"
}