{
 "id": "895492",
 "text": "Virtue ethics is an idea in philosophy. It is part of moral philosophy and normative ethics, which is ideas about right and wrong. Instead of telling people which things are good to do, virtue ethics tells people to become good on the inside. Then they will do good things because they are good people. Virtue ethics talks about virtues, or good things to be. For example, courage, kindness, wisdom, and honesty are virtues. The virtue on the inside means the person does good things on the outside. For example, an honest person tells the truth and does not lie. Virtue ethics also talks about \"practical wisdom,\" or being wise in real life. A person needs practical wisdom to use their virtues in the real world. For example, people with the virtue honesty do not want to lie, and people with the virtue kindness don't want to hurt people's feelings. Sometimes telling the truth hurts people's feelings. An honest and kind person must use practical wisdom to tell when to tell the truth and when not to. Virtue ethics says that people must practice to become virtuous. It says people can learn to be brave or wise by making good habits. Virtue ethics is different from consequentialism and deontology. Consequentialism says an action is good if it causes good things to happen or stops bad things from happening. Deontology says an action is good if it follows the right rules. ==History== In Western Civilization, Plato and Aristotle started virtue ethics. In Eastern Civilization, Confucius and Mencius did. In the West, virtue ethics was the main form of ethics for more than one thousand years. In the Enlightenment, which started in the 1700s, people began to use other types of ethics more. Then virtue ethics came back in the 1950s. Anscombe wrote \"Modern Moral Philosophy\" in 1958. ==Criticism== Philosophers in other kinds of philosophy say virtue ethics has these problems: *People can't use virtue ethics to build rules for what people should do. *Virtue ethics doesn't say what the right thing to do is clearly. *Cultural relativism: Virtue ethics might be very different for human beings from different parts of the world. For example, a Viking from the 800s would think courage is a more important virtue than kindness, and burn down a village. *Virtues sometimes tell the person to do the opposite thing. For example, honesty says \"tell the truth,\" but kindness says \"don't hurt people's feelings.\" *Self-effacement: Sometimes, virtue ethics says people must do things for a specific reason, but it is bad if that is the reason. Virtue ethics says it is good to visit a sick person because that makes the visitor good. But it is selfish to do something only because it helps the person doing it. So a person should visit the sick person and shouldn't at the same time. (Consequentialism and deontology also have self-effacement problems.) *The justification problem: Figuring out which things are virtues and which are not. (Consequentialism and deontology also have justification problems.) *Egoism: Sometimes a person wants to do virtuous things. A generous person may enjoy giving other people things. A kind person may enjoy being nice. A brave person may enjoy doing dangerous things. Critics say this means they do not count as ethical actions. *Situationist problems: Some types of social psychology say there is no such thing as a character trait (a thing to be), so there are no virtues. ==In popular culture== Virtue ethics is on the television show The Good Place. ==Related pages== *Virtue *Consequentialism *Contractualism *Deontology *Utilitarianism == References == Category:Philosophy Category:Ethics",
 "title": "Virtue ethics"
}