{
 "id": "895465",
 "text": "This is a list of the heads of state of Nigeria, from independence in 1960 to the present day. The President of Nigeria is the current head of state and government. ==Monarchy (1960–1963)== ===Monarch=== Queen Queen Queen Reign Reign Reign Royal House Prime Minister Portrait Name Start End Duration Royal House Prime Minister 1 Elizabeth II 1 October 1960 1 October 1963 years Windsor Abubakar Tafawa Balewa Governor- General Governor-General Governor-General Governor-General Term of office Term of office Term of office Monarch Prime Minister Portrait Name Took office Left office Time in office Monarch Prime Minister 1 Sir James Robertson 1 October 1960 16 November 1960 Elizabeth II Sir Abubakar Tafawa Balewa 2 Dr. Nnamdi Azikiwe 16 November 1960 1 October 1963 Elizabeth II Sir Abubakar Tafawa Balewa == Republic (1963–present) == ===First Republic (1963–1966)=== President Term of office Term of office Term of office Political party Prime Minister Portrait Name Took office Political party Prime Minister Left office Time in office 1 Nnamdi Azikiwe Dr. Nnamdi Azikiwe 1 October 1963 16 January 1966 National Council of Nigeria and the Cameroons Abubakar Tafawa Balewa ===Military Government (1966–1979)=== Head of state Head of state Head of state Term of office Term of office Term of office Military Portrait Name Took office Left office Time in office Military 2 Major General Johnson Aguiyi-Ironsi 16 January 1966 29 July 1966 Federal Military Government 3 General Yakubu Gowon 1 August 1966 29 July 1975 Federal Military Government 4 General Murtala Mohammed 29 July 1975 13 February 1976 Federal Military Government 5 Major General Olusegun Obasanjo 13 February 1976 1 October 1979 Federal Military Government ===Second Republic (1979–1983)=== President President President Elected Term of office Term of office Term of office Political party Portrait Name Took office Left office Time in office Political party 6 Alhaji Shehu Shagari 1979 1983 1 October 1979 31 December 1983 National Party of Nigeria ===Military Government (1983–1993)=== Head of state/ President Head of state/ President Head of state/ President Term of office Term of office Term of office Military Portrait Name Took office Left office Time in office Military 7 Major General Muhammadu Buhari 31 December 1983 27 August 1985 Supreme Military Council 8 General Ibrahim Babangida 27 August 1985 26 August 1993 Armed Forces Ruling Council ===Interim National Government (1993)=== Interim Head of State Term of office Political party (at time of start of term) Portrait Name Took office Left office Time in office 9 Chief Ernest Shonekan 26 August 1993 17 November 1993 Independent ===Military Government (1993–1999)=== Head of state Head of state Head of state Term of office Term of office Term of office Military Portrait Name Took office Left office Time in office Military 10 General Sani Abacha 17 November 1993 8 June 1998 Provisional Ruling Council 11 General Abdulsalami Abubakar 8 June 1998 29 May 1999 Provisional Ruling Council ===Fourth Republic (1999–present)=== President President President Elected Term of office Term of office Term of office Political party Portrait Name Took office Left office Time in office Political party 12 Chief Olusegun Obasanjo 1999 2003 29 May 1999 29 May 2007 years People's Democratic Party 13 Alhaji Umaru Musa Yar'Adua 2007 29 May 2007 5 May 2010 People's Democratic Party 14 Dr. Goodluck Jonathan 2011 5 May 2010 29 May 2015 People's Democratic Party 15 Muhammadu Buhari 2015 2019 29 May 2015 29 May 2023 years All Progressives Congress 16 Chief Bola Tinubu 2023 29 May 2023 Incumbent All Progressives Congress ==References== * Category:Nigeria-related lists",
 "title": "List of heads of state of Nigeria"
}