{
 "id": "895514",
 "text": "Summer Joy Phoenix (née Bottom; born December 10, 1978) is an American actress, model and designer. Phoenix appeared in Murder, She Wrote, Growing Pains, Swamp Thing and Airwolf. She also appeared in the movies The Laramie Project, SLC Punk!, Dinner Rush, The Believer, and The Faculty. She is the youngest sister of actors River Phoenix, Rain Phoenix, Joaquin Phoenix, and Liberty Phoenix. She became engaged to Casey Affleck in 2003 and their son was born in 2004. They were married in 2006 and had a second son born in 2008. Affleck and Phoenix had separated in November 2015 and divorced in 2017. == Siblings == Phoenix is best known for The Believer, Girl, and The Faculty. She is the youngest sibling of the famous actor Joaquin Phoenix. The other Phoenix siblings are River Phoenix, Rain Phoenix, and Liberty Phoenix. * River Phoenix: Rain Phoenix was the oldest of five siblings. He became very well known as a child actor in every house at that time. River’s career took a boost when he became a series regular on Seven Brides for Seven Brothers when he was 11. * Joaquin Phoenix: Academy Award-winning actor for Joker, Gladiator, and Her. * Rain Phoenix: River and Rain used to sing religious songs at early stages in the streets. Years later, NBC recognized the Phoenix siblings' talent and gave them television commercials and shows. River got into tap dancing. * Liberty Phoenix: Liberty had a very short acting career, she appeared in the TV movie Kate’s Secret and an episode of Seven Brides for Seven Brothers. ==References== == Other websites == * Summer Phoenix at IMDb * Summer Phoenix at Rotten Tomatoes Category:1978 births Category:Living people Category:American fashion designers Category:American child actors Category:American movie actors Category:American television actors Category:American voice actors Category:American stage actors Category:Models from Florida Category:Actors from Florida Category:People from Winter Park, Florida",
 "title": "Summer Phoenix"
}