{
 "id": "895559",
 "text": "The accident of AIRES Flight 8250 occurred on August 16, 2010 on the runway of the Gustavo Rojas Pinilla International Airport in San Andrés, Colombia. The Boeing 737-700 with registration HK-4682 of the Colombian airline AIRES took off from the El Dorado International Airport in Bogotá, Colombia and during landing under a strong electrical storm the plane lost control when it touched down meters before entering the runway. which caused the aircraft to split into three parts and remain in one of the airport's headwaters. Two people died and 114 more were injured. ==Crew== The crew consisted of 6 people, Captain Wilson Gutiérrez (43), First Officer Camilo Piñeros Rodríguez (25), and 4 flight attendants. ==Investigation== The entity that governs the Civil Aviation of Colombia (Aerocivil) sent a commission made up of its director and several investigators and those responsible for the security of Aires to determine the causes of the accident. The Colombian Minister of Transportation, Germán Cardona Gutiérrez, also traveled to San Andrés to assess the damage and attributed the accident to bad weather conditions as a result of a strong electrical storm that fell on the island when the plane landed. However, after years of investigation with personnel from the same airline, it became known that days before the AIRES accident an aircraft of the same company had faced adverse weather conditions for landing on San Andrés Island. At that time, the flight had to go to its alternative airport in Panama, an action that had a strong economic impact at the time the airline passed through, which is why the pilots were under pressure from the airline to carry out the landing. According to the International Civil Aviation Organization (ICAO), the failure of the human factor can not only come from the crew of an aircraft, but also from an external environment, as was the case with the AIRES accident. The investigation concluded that the crash was caused by the misjudgement by the crew of the aircraft's altitude during the last phase of the approach. == In popular culture == The accident is featured in the fifth episode of Season 20 of Air Crash Investigation, also known as Mayday. The episode is titled \"Runway Breakup\". ==References== Category:2010 in South America Category:2010s in Colombia Category:Aviation accidents and incidents in 2010 Category:Aviation accidents and incidents in South America Category:Airliner accidents and incidents involving controlled flight into terrain Category:Archipelago of San Andrés, Providencia and Santa Catalina Category:August 2010 events",
 "title": "AIRES Flight 8250"
}