{
 "id": "895582",
 "text": "The Loktak Folklore Museum () or the Thanga Folklore Museum () is a folk museum in Thanga Island in the Loktak lake of Manipur, India. It cares for and displays a collection of artistic, cultural and historical artefacts associated with the Loktak lake. The museum preserves the folk customs and beliefs, folk medicines, folk literature associated with the Loktak lake. == History == In 2016, the Tongbram family led by Tongbram Amarjit took initiatives to establish the Loktak Folklore Museum () at Thanga Tongbram Leikai in Thanga, Bishnupur District of Manipur. The museum was inaugurated by Tongbram Mangibabu, the then Member of Legislative Assembly (MLA) of Thanga Assembly Constituency in 2016. The inaugural event was presided by Dr. K. Sushila, Director of Art and Culture, Government of Manipur. == Collections and Features == The collections of the Loktak Folklore Museum include the fishing kits used by the fishermen of early times, literatures on the Moirang Kangleirol scattered over the Thanga and adjacent regions. It also houses the paintings of the spiritual and the mortal beings as well as traditional handloom and handicraft weaving accessories. Photography and videography are allowed inside the museum. == Exhibitions == In October 2019, the Bangla Manipuri Poetry Festival was organised for 3 days (October 3-October 5) at various locations in Manipur. On the second day of the festival, the event was conducted in the Loktak Folklore Museum. The event was organised by the Library and Information Center (LIC), Kakching and Sahitya Thoupang Lup (Sathoulup), Imphal. In 2021, the Kalen Art Exhibition was held at the Loktak Folklore Museum. The aim and the purpose of the art exhibition is to promote the cultural heritage and the significance of the Loktak lake. Tongbram Amarjit, the founder of the Loktak Folklore Museum, said: > \"Museum as we know, is the soul of human civilisation and we can't simply > abandon the things of the past.\" The Loktak Folklore Museum had planned to organize the Kalen Art Exhibition associated with the International Museum Day on May 18 of the year. However, due to the COVID pandemic, the planned event was postponed. Kalen is the Meitei lunar month in which the Umang Lais are worshipped. It is during this time that the Lai Haraoba festival is celebrated across the state. In association with this, the Kalen Art Exhibition focussed to inspire the youths to explore the cultural heritage of the Loktak lake. == References == == Other websites == * Loktak Folklore Museum www.museumsofindia.org * Loktak Folklore Museum_e-pao.net Category:Museums in Manipur",
 "title": "Loktak Folklore Museum"
}