{
 "id": "895569",
 "text": "Mukesh Khanna (born 23 July 1958) is an Indian actor and producer who works in Hindi films and television. He is known for his portrayal of Shaktimaan in Doordarshan's Shaktimaan and Bhishma in the Mahabharata. He was also the chairman of Children's Film Society, India, Children's Film Society India, from which he resigned in February 2018. He is the founder and director of MK Films. He is currently running The Mukesh Khanna Show on his own YouTube channel named Bheeshm International. ==Firoz Khan's conflict with Rahi Masoom Raza== Rahi Masoom Raza penned the script of the entire Mahabharata(TV series). Mukesh Khanna narrated an incident when Raza had to scold Firoz Khan. He said in an interview-\"There was a scene in the Mahabharata after the Vastraharan sequence, when Arjuna comes to me and asks to avenge their insult. After that scene got shooted, Arjun went to Rahi Masoom Raza's office and complained that he has got very less dialogues in that conversation between Bhishma and Arjuna. All the dialogues Bhishma is speaking of 2-3 paragraphs whereas Arjuna has only 1-2 line dialogue. Firoz also complained that while shooting scenes and scripting dialogues, his role is always given less. So he went to Rahi Masoom Raza and asked to increase his dialogues and weightage. Firoz complained to Raza that even in the entry scene of all 106 brothers in Rangbhoomi, Karna spoke almost all dialogues whereas everyone else from above Bhishma,Kripa,Drona,Kunti,Gandhari and king Dhritarashtra said nothing but saw Karna speaking 2-3 paragraph dialogues continuously. Then Rahi Masoom Raza got angry at Firoz, he yelled at Firoz-\"Who are you? You are not even the main character. He is Bhishma, the grandsire okay? The eldest of all, he will say paragraphs of dialogues and you will just stay mum. You are just a Pandava, you are not a king like Yudhisthira. You are just a warrior who is fighting for Yudhisthira's kingdom. Of your own, you don't have an identity, all is that you are the rival of Karna. Among Pandavas, only Yudhisthira speaks and all the rest Pandavas including Arjuna quietly listens, when Krishna comes then Yudhisthira also has to keep quiet and when both Karna and Krishna has to talk, then even Krishna has to listen. Karna is the ultimate hero of all, when he comes to speak, even Krishna and Yudhisthira has to listen. When Karna speaks in Rangbhoomi and like a hero enters and challenges the supremacy of Kurus, all the old leaders like Bhishma, Kripa, Drona, Dhritarasthra has to listen. So, who are you in front of these Hastinapur leaders?\" After hearing scoldings of Rahi Masoom Raza, Firoz was almost crying. After that Raza tried to console him and told him to play the actual role of Arjun and not demand for more weightage in role. After that instance maybe Raza sir might have felt bad and after then tried to give more role to Arjun. Maybe after the Vastraharan episode, Arjuna's dialogues might have increased. It was not that big conflict, Firoz is a gem of a person and nobody else but he could play the role of Arjuna. Firoz's role was on 8th number in the credits sequences. \" ==Youtube Channel== He currently runs an YouTube channel- Bheeshm International and has over 100,000 subscribers. ==References== ==Other websites== * Category:Indian television actors Category:Indian voice actors Category:Living people Category:1958 births",
 "title": "Mukesh Khanna"
}