{
 "id": "895546",
 "text": "Alexander Prass (born 26 May 2001) is an Austrian professional footballer. He plays as a midfielder for Austrian Football Bundesliga club Sturm Graz and the Austria U21 national team. ==Club career== He started his career with LASK and FC Pasching. 2012 he went to FC Red Bull Salzburg where he played in the youth and the Red Bull Salzburg Academy. 2019 he went on to FC Liefering. He debuted on March 8th, 2019 versus Young Violets Austria Wien. FC Salzburg Wiki In two and a half seasons he played 59 matches for Liefering and scored 12 goals. On 28 May 2021, he signed a three-year contract with Sturm Graz. ==International career== He debuted on October 9th 2018 for the Austrian U18 team versus Switzerland. On October, 11th he scored his first goal. October 2019 he debuted for the U19 team and in March 2021 he played his first match for the U21 team versus Saudi Arabia. Transfermarkt.at Alexander Prass Nationalmannschaft (German) ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League Cup League cup Europe Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals FC Liefering 2018–19 2. Liga 4 0 0 0 – – – 4 0 2019–20 2. Liga 27 6 0 0 – – – 27 6 2020–21 2. Liga 28 6 0 0 – – – 28 6 Total 59 12 0 0 – 0 0 – 59 12 Sturm Graz 2021–22 Austrian Bundesliga 28 0 2 0 – 6 0 – 36 0 2022–23 Austrian Bundesliga 32 3 6 0 – 8 0 – 46 3 2023–24 Austrian Bundesliga 10 2 1 0 – 5 1 – 16 3 Total 70 5 9 0 – 18 1 – 97 6 Career total 129 17 9 2 0 0 18 1 0 0 156 18 ===International=== Appearances and goals by national team and year National team Year Apps Goals Austria 2022 1 0 Total 1 0 ==Honours== Sturm Graz * Austrian Cup: 2023, 2024 * ̈Austrian Championː2024 ==References== Category:2001 births Category:Living people Category:Austrian footballers Category:FC Liefering players Category:SK Sturm Graz players Category:Association football midfielders Category:Austrian football midfielders Category:Austrian football champions",
 "title": "Alexander Prass"
}