{
 "id": "895782",
 "text": "Ethiopia–United States relations are bilateral relations between Ethiopia and the United States. Ethiopia is an important partner of the United States in the Global War on Terrorism. The United States is the largest donor to Ethiopia. In 2008 U.S. foreign aid to Ethiopia was US$969 million. The United States of America and the Federal Democratic Republic of Ethiopia diplomatic relations has gone through decades and through multiple regime changes and billions of dollars of support. Since a new Prime Minister has entered the U.S attitude towards Ethiopia has drastically changed. The U.S government during the Ethiopian Peoples' Revolutionary Democratic Front (TPLF) period supported the dictator regime and ignored its human rights violations according to reports. == TPLF Era relations == === Bush and Meles === President Bush had a strong relationship with Meles Zenawi. The Bush administration didn't care about Meles's abuses and the human rights violations nor tried to make Ethiopia a freer society but only diplomacy mattered for the horn of Africa and the Bush administration's interests. ==== Haile Mariam and Obama ==== Barack Obama visited Ethiopia in 2015 as the first sitting U.S President ever to do so. But the visit included Obama's remarks on human rights. The President praised progress made in education, infrastructure and the economy. He said the government was democratically elected. But he also criticized the lack of democracy and leaders who refuse to step off, and discrimination against minorities. Obama had stayed in the city for a 2-day state visit == Abiy Administration Era relations == The U.S under the Abiy admin has had poor U.S relations. It was from the start of receiving the Nobel Peace Prize when President Trump criticized Prime Minister Abiy Ahmed being awarded the Prize. Abiy responded and said the decisions were up to the Nobel committee and not him and he should have the problem with the Nobel committee. In 2020 the U.S president said it's a very dangerous situation because Egypt is not going to be able to live that way\". He was referring to the Grand Ethiopian Renaissance Dam on the Blue Nile. The President said Egypt would “blow up” the 5-billion- dollar dam. The Ethiopian government showed its huge disapproval. Later on, sanctions were imposed on the country for not allowing Egypt to have the upper hand on the Grand Ethiopian Renaissance Dam Project, but in 2023 these sanctions stopped. Ethiopia was allowed to get aid again. === Biden === Under Joe Biden the U.S State Department designated Ethiopia as an unsafe country. This was due to civil unrest and armed conflicts which are mostly in the north and hundreds of miles outside of the capital Addis Ababa. There were many calls for cease fire in the worn torn north of the country. The government of Ethiopia said they will not negotiate with terrorists. Biden in January the 11th made his first call with Prime Minister Abiy Ahmed and exchanged views on the war in the northern region of the country. People have also aligned Biden with supporting the TPLF. == References == == Other websites == *Office of Prime Minister, Ethiopia Category:foreign relations of the United States Category:Politics of Africa Category:Ethiopia",
 "title": "Ethiopia–United States relations"
}