{
 "id": "896281",
 "text": "The Atlantic Plain is one of eight different United States physiographic (Physical part of) regions. The Atlantic Coast of the United States comprises the coastal states of Delaware, Florida, Maine, North Carolina, Maryland, New Jersey, New York, South Carolina, and Virginia. The land next to the Atlantic coast are made up of sandy beaches, marshlands, bays, and barrier islands. This big part is made up of the Continental Shelf and Coastal Plain provinces. It is the flattest of the U.S. physiographic divisions and is over 2,200 miles (3,500 km) in length from Cape Cod to the Mexican border and goes south an additional 1,000 miles (1,600 km) to the Yucatán Peninsula. The central and southern Atlantic Coast is seen by barrier and drowned valley coasts. The coastal Atlantic plain features long barriers interrupted by inlets, large embayments with drowned river valleys, and extensive wetlands and marshes. The Atlantic plain slowly lowers to sea level from the inland highlands in a series of terraces. This continues far into the Atlantic and Gulf of Mexico, forming the continental shelf. The difference at the land-sea interface is so hard to see that the boundary between them is often indistinct(hard to see), especially along stretches of the Louisiana bayous and the Florida Everglades. == Coastal Plains == The Atlantic Coastal Plain is a region of low elevation along the East Coast of the United States. It is 2,200 miles long, from Long Island, to the Georgia/Florida part of the Eastern Continental Divide. The plain is bordered on the west by the Piedmont plateau, which is a flat area bordered by the main Appalachian mountains, and where the plateau and the plain meet is called the Atlantic Seaboard Fall Line. It is bordered to the east by the Atlantic Ocean, and to the south by the Floridian province. The Outer Lands region forms the insular northeastern extension of the Atlantic coastal plain. === Elevation === The plain is not very high, averaging around 900 or less feet from sea level. It extends about 50 to 100 kilometers inland. The coastal plain is very wet, with many rivers, marshes, and swampland. It is composed mainly of sedimentary rock and sediment, and the land is usually used for agriculture.Water table management in the eastern coastal plain The coastal plain also has the Carolina Sandhills as well. Sometimes, on maps, the coastal plain is split into two northern and southern regions. Sea levels rising is also an issue, because ocean water (Or salty water) starts to kill plants that can't use saltwater in photosynthesis. Groundwater supplies are also vulnerable along the East Coast. With industrial and urban development (like houses, factories, and roads), many inland salt (with saltwater) marshes are disappearing. == Life in the Atlantic Plain == === Plant Life === Vegetation is also experiencing issues with the rapid changes the plain is going through, too. Forests are common on this plain. In the north, there are hardwood forests that include white, black, red, chestnut and scarlet oaks. The forests in a wider area include hickory, long-leaf pines, sweet gum, magnolia and bay leaf trees. === Animal Life === Many animals also inhabit the region, like toads, salamanders and frogs. Gray foxes inhabit the whole region, while the Lower Keys marsh rabbit and manatees live in mainly the Florida Keys. Fish, including the threatened Alabama sturgeon, inhabit the area too. Waterfowl, wading birds and a variety of shorebirds make their home in the region. == References == Category:Geography of the United States",
 "title": "Atlantic Plain"
}