{
 "id": "896382",
 "text": "Mauthausen was a Nazi concentration camp in Upper Austria during World War II. It opened on 8 August 1938, and was taken over by the Allies on 5 May 1942. It is located on a hill above the market town of Mauthausen (roughly east of Linz). Mauthausen started as a single camp. However, it gradually grew into a system of many camps, which were all connected to each other. These subcamps were located throughout Austria and southern Germany. In total, about 190,000 people were imprisoned in the Mauthausen camp complex. Of these, at least 90,000 died. Mauthausen was mostly used for extermination through labour of artists and intellectuals, like scientists and professors. These were educated people and had been members of the higher social classes in countries taken over by the Nazis during World War II. Other groups were imprisoned at Mauthausen too. These included political prisoners like socialists, communists, anarchists, and Spanish Republicans. Homosexuals and alcoholics, who the Nazis called “asocial,” were also imprisoned at Mauthausen. Other groups included Romani people, Slovenes, Hungarian and Dutch Jews, and Soviet prisoners of war. The Nazis wanted to “exterminate” all of these groups of people by working them to death. The Nazis also used Mauthausen as a punishment camp. They sent prisoners to Mauthausen from other camps in order to punish them for breaking rules or trying to escape. Mauthausen was one of the first very large concentration camp complexes in Nazi Germany. It was the last to be liberated by the Allies. Today, there is a museum at the Mauthausen main camp. == Subcamps == Three of the biggest subcamps in the Mauthausen complex were Gusen I, Gusen II, and Gusen III. Many of the prisoners in the Mauthausen complex lived in the Gusen camps. Sometimes, these camps held more prisoners than the main Mauthausen main camp did. At first, prisoners from the Mauthausen and Gusen camps worked mostly in the local quarries. However, starting in 1942, they were also forced to produce things that the German military needed. As Mauthausen produced more, it needed more workers. The Nazis brought more and more prisoners to Mauthausen to work as slave laborers. To make room for more slave workers, the Nazis built additional subcamps (). By the end of World War II, there were 101 camps (including 49 major subcamps) in the Mauthausen complex. In January 1945, these camps held roughly 85,000 inmates. == Forced labor == At the Mauthausen complex, there were quarries, weapons factories, mines, and plants that assembled Me 262 fighter aircraft. The prisoners at Mauthausen and its subcamps were forced to work as slaves in these places. In fact, the Nazis decided to build a camp complex in Mauthausen because the town was close to some granite quarries. By 1942, over 3,300 prisoners were working in the quarries at Gusen and the main Mauthausen camp. === The Stairs of Death === One quarry was at the bottom of a long set of 186 stone steps. Guards forced male prisoners to carry blocks of granite up the stairs, all day and in all kinds of weather. This was a very difficult and exhausting job. The blocks of stone sometimes weighed as much as 50 kilograms (110 pounds). These slave laborers were already starving and malnourished because the Nazis gave them so little food in the camps. Then they were forced to work all day in the quarries without food or water. Often, guards beat the prisoners or forced them to race while they carried stones up the steps. When one person slipped, died, or collapsed from exhaustion, he would fall onto the people behind him, who would then fall too. Prisoners would continue to fall like dominoes, one after the other, all the way down the steps. Doing this work killed so many people that inmates at Mauthausen named the steps the \"Stairs of Death.\" Even if a prisoner survived a day's work, they might still be killed. Often, the Nazis would make everybody who survived the Stairs of Death line up at the edge of a cliff known as \"The Parachutists Wall\" (German: Fallschirmspringerwand). At gunpoint, each prisoner would have the option of being shot or pushing the prisoner in front of him off the cliff. == Conditions == Prisoners at Mauthausen had to live and work in terrible conditions, which killed many people. This was not accidental. The Nazis made camp conditions terrible on purpose. This was part of their plan to kill everyone who came to the camps. They gave the prisoners so little food that thousands starved. From 1940 to 1942, an average inmate weighed just 40 kilograms (88 pounds). Prisoners were not given adequate clothing or shelter, and many froze to death in the winter. There was no access to water or to basic sanitation. Hygiene was impossible. Contagious diseases spread quickly and killed many people. The Nazis also murdered many prisoners. They killed people who were sick or could not work any longer. They also used murder as a punishment. For example, if one person tried to escape, camp guards would kill them along with a group of innocent people. Common methods of extermination included hangings, mass shootings, beating prisoners to death, and starving them to death in bunkers. Sometimes, guards would kill a prisoner by throwing them on the 380-volt electric barbed wire fence. At other times, they would force a prisoner outside the boundaries of the camp, accuse the prisoner of trying to escape, and shoot them. The Nazis also used icy showers to kill people. Around 3,000 inmates died of hypothermia after guards forced them to take icy cold showers, then left them outside in cold weather. A large number of inmates were drowned in barrels of water at Gusen II. Starting in 1942, the Nazis also used gas chambers to kill at least 3,500 prisoners, starting with Soviet prisoners of war. The two largest camps in the Mauthasen complex (Gusen I and the main Mauthausen camp) had the worst conditions. Both were classed as \"Grade III\" (Stufe III) concentration camps. This meant they were supposed to be the toughest camps for the \"incorrigible political enemies of the Reich\". (Here, “incorrigible\" means \"impossible to correct.\") Many people were deported to Mauthausen and Gusen just to be executed. Mauthausen was still classified as Stufe III when World War II ended. People in the offices of the Reich Security Main Office (Reichssicherheitshauptamt; RSHA) called Mauthausen by the nickname Knochenmühle – the bone-grinder (literally bone-mill). == References == Category:Upper Austria Category:Nazi concentration camps",
 "title": "Mauthausen concentration camp"
}