{
 "id": "896372",
 "text": "Child sex tourism is travelling to another country or area, to be able to profit from children who prostitute themselves. Like child prostitution, child sex tourism is bad for the health of the children. It has mental and physical consequences, which include sexually transmitted infections, (unwanted) teenage pregnancies, and addiction to drugs. Child sex tourism is part of the multibillion-dollar global sex tourism industry. It is a form of child prostitution within the wider issue of commercial sexual exploitation of children. Child sex tourism affects approximately 2 million children around the world.Klain, Prostitution of Children and Child-Sex Tourism: An Analysis of Domestic and International Responses 1999, ABA Center on Children and the Law, page 33 cited in These children who perform as prostitutes have often been lured or abducted into sexual slavery. People who practice child sex tourism can be split in two broad groups: * People who prefer children; they want to build a relationship with a child, or they think that the risk of getting a sexually transmitted infection is less. * People who do not prefer children, but who will also not refuse to have sex with a child, if they get a chance. Very often, they either forget to check the age of a prostitute, or they do not care enough. These are called situational users or situational offenders. People who want to engage in child sex tourism often plan their journey using the internet. They look for places, where the most vulnerable children can be found; they often also share this information with other like- minded people. As is the case with other forms of prostitution, child prostitution is linked to poverty: the most vulnerable children are likely in regions where there are many poor people, or where there's a high population growth. As this is a global problem, some countries have adapted their laws, so that they can prosecute certain crimes, even if they are committed outside the country. ==References== Category:Child sexual abuse Category:Child prostitution Category:Child labour",
 "title": "Child sex tourism"
}