{
 "id": "896356",
 "text": "The Cleaning Lady is an American crime drama television series developed by Miranda Kwok, based on the 2017 Argentinian television series La Chica Que Limpia. It premiered on Fox on January 3, 2022. ==Premise== The Cleaning Lady is a drama that centers on Thony De La Rosa, formerly a Philippine medical doctor who's now currently working/living in the shadows of modern day Las Vegas. Her reason for being in the US, on an expired visa, is her five year old son, Luca. Luca has a rare and life-threatening medical disorder, for which he needs a cutting edge, bone marrow treatment, which is only available in Las Vegas. Until she gets treatment for her son, Thony makes a living, not as a trained doctor but as a cleaning service worker, alongside her, sister in law, Fiona. After Thony accidentally witnesses a serious crime and is discovered hiding by the perpetrator behind it, Arman Morales, she's offered a job both as a cleaner and a doctor within their criminal organization that could pay well enough to help her son and her family. Crossing into a world of moral grey, Thony begins to live a double life, keeping secrets from her family all the while cleaning up murder scenes and dodging the law. ==Cast and characters== ===Main=== * Élodie Yung as Thony De La Rosa, formerly a doctor in one of Manila's best hospitals, but now trapped in Las Vegas as an illegal immigrant due to her visa expiring. She becomes a cleaner for the mob in order to gain the connections needed to procure treatment for her sick son. * Adan Canto as Arman Morales, a gangster associated with a powerful criminal cartel operating in Las Vegas. He agrees to protect Thony and help her son in exchange for her services as a cleaner. * Oliver Hudson as Garrett Miller, an FBI agent who goes after Thony in his effort to bring down Arman * Martha Millan as Fiona De La Rosa, Thony's sister-in-law and closest friend, with whom she and her son live * Sebastien and Valentino LaSalle as Luca De La Rosa, Thony's son. He suffers from a rare autoimmune illness that forces Thony to keep him hidden from the outside world to protect him from contagion. * Sean Lew as Chris, Fiona's son * Faith Bryant as Jaz, Fiona's daughter ===Recurring=== * Eva De Dominici as Nadia Morales, Arman's wife * Ivan Shaw as Marco De La Rosa, Thony's husband and Fiona's brother * Jay Mohr as Councilman Eric Knight * Shiva Negar as Isabel Barsamian * Liza Weil as Katherine Russo Category:2022 American television series debuts",
 "title": "The Cleaning Lady"
}