{
 "id": "896488",
 "text": "Naomi is an American superhero drama television series created by Ava DuVernay and Jill Blankenship. It is based on the comic book series of the same name co-written by Brian Michael Bendis and David F. Walker and illustrated by Jamal Campbell. The show premiered on The CW on January 11, 2022. ==Plot== Naomi, a cool, confident, comic book-loving teenager pursues her hidden destiny. When a supernatural event shakes her small hometown of Port Oswego, Naomi sets out to uncover its origins, with a little help from her fiercely loyal best friend Annabelle. She also has the support of her adoptive, doting parents, veteran military officer Greg and linguist Jennifer. After an encounter with Zumbado, the mysterious owner of a used car lot, leaves her shaken, Naomi turns to tattoo shop owner Dee, who becomes her reluctant mentor. While unraveling the mystery of herself, Naomi also navigates her high school friendships with both military kids and local townies, including ex- boyfriend and high school jock Nathan; Annabelle's longtime, loyal boyfriend Jacob; proud \"townie\" Anthony; and fellow comic book enthusiast Lourdes. As Naomi journeys to the heights of the multiverse in search of answers, what she discovers challenges her beliefs about heroes. ==Cast== ===Main=== * Kaci Walfall as Naomi McDuffie, a confident comic book-loving teenager * Cranston Johnson as Zumbado, the owner of a local car lot * Alexander Wraith as Dee, a local tattoo store owner who is a Thanagarian * Mary-Charles Jones as Annabelle, Naomi's loyal best friend * Mouzam Makkar as Jennifer McDuffie, Naomi's adoptive mother who is a linguist * Daniel Puig as Nathan, a jock who is Naomi's ex-boyfriend * Camila Moreno as Lourdes, a young woman and comic book enthusiast with a sarcastic sense of humor who works in a vintage collectibles shop * Will Meyers as Anthony, a townie in Port Oswego * Aidan Gemme as Jacob, Annabelle's loyal boyfriend * Barry Watson as Greg McDuffie, Naomi's adoptive father and an active duty military officer ===Recurring=== * Stephanie March as Akira ==References== Category:2022 American television series debuts",
 "title": "Naomi (TV series)"
}