{
 "id": "896494",
 "text": "The Thundermans is an American superhero teen sitcom created by Jed Spingarn. It aired on Nickelodeon from October 14, 2013 to May 25, 2018. The series stars Kira Kosarin, Jack Griffo, Addison Riecke, Diego Velazquez, Chris Tallman, Rosa Blasi, and Maya Le Clark. It also features the voice of Dana Snyder as Dr. Colosso. == Plot == The series revolves around the Thundermans, a family with superpowers who try to live normal lives in the fictional town of Hiddenville. Phoebe dreams of being a superhero and using her powers for good, while her twin brother Max wants to be the next big supervillain and use his powers for evil. Parents Hank and Barb attempt to live normal lives and not use their superpowers – albeit not very successfully – while Nora and Billy enjoy using theirs whenever possible. A former supervillain named Dr. Colosso has been transmogrified into a rabbit and lives in Max's lair in the basement, offering him advice on becoming a villain. At the end of the second season, Chloe is introduced as the baby sister. ===3rd season=== During the third season, Phoebe starts training to become a superhero, while the master super villain, Dark Mayhem, trains Max to become a villain. At the end of the season, Dark Mayhem (Jamieson Price) asks Max to prove he is a villain by taking away Phoebe's powers. However, Max chooses his family and becomes a superhero instead by helping them take down Dark Mayhem. ===4th season=== During the fourth season, Max and Phoebe, under their Thunder Twins team-up, are selected as candidates for membership to the elite Hero League team called the Z-Force. Halfway through the season, Phoebe accidentally absorbs Dark Mayhem's powers, which turn her evil, but her family saves her. At the end, Phoebe and Max become the new Z-Force leaders and enroll the Thundermans as members. == Cast and characters == * Kira Kosarin as Phoebe Thunderman * Jack Griffo as Max Thunderman * Addison Riecke as Nora Thunderman * Diego Velazquez as Billy Thunderman * Chris Tallman as Hank Thunderman * Rosa Blasi as Barb Thunderman * Maya Le Clark as Chloe Thunderman (recurring, season 3; main, season 4) ==Series overview== Category:2013 American television series debuts",
 "title": "The Thundermans"
}