{
 "id": "896648",
 "text": "Helmuth Hübener (January 8, 1925 – October 27, 1942) was a German youth who was executed for his opposition to the Nazi Regime. Beheaded at age 17, he was the youngest person to be executed by the Nazis for resistance work. == Life == Helmuth was born on January 8, 1925, the youngest of three children. He belonged to The Church of Jesus Christ of Latter-day Saints (LDS Church). Since early childhood, Hübener had been a member of the Boy Scouts, an organization strongly supported by the LDS Church, but in 1935 the Nazis banned scouting from Germany. He then joined the Hitler Youth, as required by the government, but quit after the Kristallnacht in 1938, when the Nazis, including the Hitler Youth, destroyed Jewish businesses and homes. == Resistance Work == After Hübener finished middle school in 1941, he began an apprenticeship in administration at the Hamburg Social Authority (Sozialbehörde). He met other apprentices there, one of whom, Gerhard Düwer, he would later recruit into his resistance movement. At a bathhouse, he met new friends, one of whom had a communist family background and, as a result, he began listening to enemy radio broadcasts. Listening to foreign media was at the time strictly forbidden in Nazi Germany, being considered a form of treason. After finding out that his brother Gerhard had a shortwave radio, Helmuth began listening on his own. Using what he learned on the BBC channel, Helmuth began composing leaflets with the intent of sharing the truth about the Nazis and the war. At first the leaflets were only written and distributed by himself. Soon however, Rudi Wobbe, Karl-Heinz Schnibbe, and Gerhard Düwer began listening to the BBC broadcasts and helping him distribute his leaflets around Hamburg, leaving them on billboards, stuffing them into coat pockets, and leaving them in post boxes. == Capture and Execution == On February 5, 1942, Helmuth was captured while attempting to get one of his friends to translate the leaflets into French so they could be handed out to prisoners of war. At his trial on August 11, 1942, he was tried as an adult by the People’s Court (Volksgerichtshof) in Berlin, which had jurisdiction over matters of treason. Hübener was sentenced to death. After the sentence was read, Hübener faced the judges and said: \"Now I must die, even though I have committed no crime. So now it's my turn, but your turn will come.\" His civil rights were also stripped from him, which gave the guard’s the ability to torture and abuse him without fear of retribution. Petitions for clemency were denied. On October 27 Helmuth was told he would be executed later that day. He was told this at 1:05 pm. The execution was carried out by guillotine at 8:13 pm. == References == Category:1925 births Category:1942 deaths Category:Executed German people Category:World War II resistance members",
 "title": "Helmuth Hubener"
}