{
 "id": "896643",
 "text": "On January 15, 2022, a gunman, Malik Faisal Akram, entered a reform synagogue in Colleyville, Texas, United States. He took four people prisoner, creating a hostage situation that lasted 10 hours. It ended when the FBI hostage team went into the synagogue. The man with the gun was killed. The synagogue is called Congregation Beth Israel. ==Attack== At 10:41 in the morning, a man with a gun went inside the building and took hostages. He was dressed like a homeless person that needed shelter. The Colleyville Police Department shared a tweet at 11:30am saying the SWAT team was working in the area. The Federal Bureau of Investigation and Texas Department of Public Safety arrived a short time later. People who live around the synagogue were evacuated, or told to leave, for their safety. Some news agencies said the man was the brother of Aafia Siddiqui, who is from Pakistan, and he wanted her to be let out of prison. In 2010, Siddiqui was convicted of attempted murder of a United States Army captain while they were both in Afghanistan. Siddiqui has a brother. However, his lawyer says that the man in the synagogue was not him or anyone in their family. Later, law enforcement officials said the man had told the rabbi to make a phone call for him. In the phone call, the man said he wanted his \"sister\" Siddiqui let out of prison. It is possible the man did not really mean Siddiqui was his sister. Instead, he may have said \"sister\" as a figure of speech. The man came into the building during the synagogue's Saturday Shabbat holy day services. The people in the synagogue had put up a video camera so they could livestream the ceremony on the Internet. This video of the synagogue's service was recording when the man took Rabbi Charlie Cytron- Walker and three other people hostage. His face did not show up in the video, but people on the Internet could hear his voice. The man who took the hostages said, \"If anyone tries to enter this building, I'm telling you...everyone will die\" and \"I'm going to die. Don't cry about me...\" One of the hostages was released six hours later. At about 9 p.m., the FBI went into the building. All of the hostages came out alive. The man who took them prisoner did not. ==Perpetrator== The hostage taker was British citizen Malik Faisal Akram (1977-2022), who was from Blackburn, Lancashire, England. ==Reaction== ===US=== The White House said the President had been told what was happening. US House Representative Colin Allred who is from Texas said he was praying for the people of the synagogue.White House Press Secretary Jen Psaki said people on the National Security team were talking to federal law enforcement leaders about the attack. US Senator Ted Cruz also said that he had informed federal law enforcements, he also said he will be speaking to the Jewish community leaders throughout the evening and the situation. === World leaders === Israeli Prime Minister Naftali Bennett said he was watching the standoff between law enforcement and the gunmen. The Prime Minister also said, “We pray for the safety of the hostages and rescuers,” on his official Twitter account. Yair Lapid, the Alternate Prime Minister of Israel, said the government of Israel was in contact with law enforcement. Lapid also said Israeli Consulate General Livia Link was leaving Houston, Texas to go to the synagogue. ==Synagogue== Congregation Beth Israel was started in 1998. It became a full synagogue in 1999. It moved to the building it is in now in 2005. == References == Category:2022 crimes in the United States Category:Crime in Texas Category:Islamic terrorist incidents in the 2020s Category:January 2022 events Category:Tarrant County, Texas Category:Terrorist attacks in the United States Category:Terrorist incidents in 2022 Category:2022 in Texas",
 "title": "Colleyville synagogue hostage crisis"
}