{
 "id": "896782",
 "text": "Nazi concentration camp badges were colored pieces of fabric used by the Nazis to identify concentration camp prisoners during World War II. Prisoners had to sew these badges onto their uniform jackets and pants. The badges used a color coding system to show why each prisoner had been sent to the camp. Different colors and shapes had different meanings. The prisoners were required to wear these badges of shame. The badges helped guards assign tasks to the prisoners. If a prisoner's badge marked them as an escape suspect, the SS would not allow them to work outside the camp fence. If a prisoner had an F on their badge (meaning they were French), guards could force them to help translate instructions to new prisoners from France. If a guard looked at a prisoner and saw a green badge, the guard knew right away that the person was a convicted criminal. Guards often assigned these \"green triangles\" to be kapos. These were prisoners who were assigned to help the SS run the camps. Many kapos used abuse and violence to control other prisoners. Some historical monuments use images of these identification badges to symbolize the victims of the concentration camps. Today, some people use a pink triangle emblem to symbolize gay rights. == Badge coding system == Different camps used different systems of badges. In the later stages of World War II, the use of badges became less common in some camps. The following description is based on the badge coding system used in the Dachau concentration camp. This camp had one of the more detailed coding systems. Most badges were inverted triangles. (This meant the widest part of the triangle was at the top of the shape, not the bottom.) The Nazis chose this shape because it looked like triangular road hazard signs that are common in Germany. === Single triangles === Single triangles of different colors identified different types of prisoners. ==== Black triangles ==== The Nazis made many different types of prisoners wear black triangles. The black triangle identified people who the Nazis called 'asocial' () or 'work-shy' (). These included alcoholics, drug addicts, homeless people, beggars, people with disabilities, prostitutes,Claudia Schoppmann (1990). Nationalsozialistische Sexualpolitik und weibliche Homosexualität. Dissertation, FU Berlin. Centaurus, Pfaffenweiler 1991 (revisited 2nd edition 1997). lesbians, pacifists, and people who refused to be conscripted into the German armed forces. Black triangles also marked Roma and Sinti people. They wore the black triangle with a Z on it (for , meaning Gypsy). Romani men were later assigned a brown triangle. However, Romani women always wore black triangles. The Nazis believed many stereotypes about Romani women. They thought these women were petty criminals (prostitutes, kidnappers, and fortune tellers). For this reason, the Nazis never stopped calling Romani women \"asocial.\" Many of these women were forcibly sterilized. The Nazis also used the black triangle to identify people with mental illnesses and \"mentally disabled\" people. Written on their badges was the word , which means \"stupid.\" This category included people with autism. (At that time, autism was called Asperger's Syndrome, named after Austrian pediatrician Hans Asperger, who was involved with the Nazis). People with schizophrenia and epilepsy also wore black triangles. Instead of being sent to concentration camps, many people in this group were forcibly sterilized, shot, or gassed in psychiatric institutions as part of the T4 Euthanasia Program. Other people with disabilities, like diabetes, also had to wear the black triangle. (The Nazis thought that diabetes was a 'Jewish disease.' There was no evidence for this claim. Instead, it was a result of antisemitism in medicine, science, and culture.) ==== Red triangles ==== Red triangles identified political prisoners. These included: * Social democrats * Liberals * Socialists * Communists * Anarchists * Trade unionists * Freemasons * Non-Jews who helped Jewish people ==== Green triangles ==== Green triangles identified convicts and criminals (who often worked as kapos). ==== Blue triangles ==== Blue triangles identified foreign forced laborers and emigrants from Nazi- controlled countries.Gabriele Hammermann, Stefanie Pilzweger-Steiner (2018) KZ-Gedenk·stätte Dachau: Ein Rund·gang in Leichter Sprache. p. 72 This category included apatrides (stateless people, who were not citizens of any country). Spanish refugees from Francoist Spain belonged to this category. Because these people did not support the dictatorship of Francisco Franco, the Spanish government cancelled their citizenship. ==== Purple triangles ==== Purple triangles identified the Nazis' religious enemies. Over 99% of these people were Jehovah's Witnesses. Members of other small pacifist religious groups also wore purple triangles.Johannes S. Wrobel (June 2006). \"Jehovah's Witnesses in National Socialist Concentration Camps, 1933–45\". Religion, State & Society. Vol. 34. No. 2. pp. 89–125. \"The concentration camp prisoner category 'Bible Student' at times apparently included a few members from small Bible Student splinter groups, as well as adherents of other religious groups which played only a secondary role during the time of the National Socialist regime, such as Adventists, Baptists and the New Apostolic community (Garbe 1999, pp. 82, 406; Zeiger, 2001, p. 72). Since their numbers in the camps were quite small compared with the total number of Jehovah's Witness prisoners, I shall not consider them separately in this article. Historian Antje Zeiger (2001, p. 88) writes about Sachsenhausen camp: 'In May 1938, every tenth prisoner was a Jehovah's Witness. Less than one percent of the Witnesses included other religious nonconformists (Adventists, Baptists, pacifists), who were placed in the same prisoner classification.'\" ==== Pink triangles ==== Pink triangles usually identified homosexual men and others who the Nazis called homosexual (like bisexual men and transgender women). The Nazis also used pink triangles to identify sexual offenders, paedophiles, and zoophiles.Richard Plant (1988). The Pink Triangle: The Nazi War Against Homosexuals. Owl Books. . The Nazis forcibly sterilized many people in this group. ==== Uninverted red triangles ==== Uninverted red triangles identified several groups of people: * Enemy prisoners of war (called , meaning 'special detainee') * Spies and traitors (called , meaning 'activities detainee') * Military deserters or criminals (, meaning 'service member') File:Bundesarchiv Bild 183-78612-0007, KZ Sachsenhausen, Häftlinge bei Zählappel.jpg|Single-triangle badges in various colors visible on Sachsenhausen concentration camp prisoners File:Prisoners in the concentration camp at Sachsenhausen, Germany, December 19, 1938. Heinrich Hoffman Collection. - NARA - 540177.jpg|Single triangles visible on Sachsenhausen detainees File:Purple Triangle.JPG|This badge marked an inmate as a Jehovah's Witness File:Prisoners' Uniforms with Red Triangles of Political Prisoners - Museum Exhibit - Dachau Concentration Camp Site - Dachau - Bavaria - Germany.jpg|Red emblems on a Dachau detainee's clothing marking them as a political prisoner File:Prisoners in the concentration camp at Sachsenhausen, Germany, 12-19-1938 - NARA - 540175.jpg|More Sachsenhausen detainees with badges on their uniforms File:Bundesarchiv Bild 152-27-11A, Dachau, Konzentrationslager.jpg|Black triangles are visible on the trousers of these Romani detainees at Dachau File:Benedikt Kautsky.jpg|A United States Army photo of Austrian economist and financial specialist , a political prisoner, after he was liberated from Buchenwald File:A sick Polish survivor in the Hannover-Ahlem concentration camp receives medicine from a German Red Cross worker.jpg|The liberated Neuengamme survivor standing on the right has a triangle patch with a top-bar === Double triangles === The Nazis used double- triangle badges to identify Jewish prisoners. These badges were made of two overlapping triangles. These two triangles formed a Star of David, a Jewish symbol. * A red inverted triangle superimposed upon a yellow one represented a Jewish political prisoner. * A green inverted triangle superimposed upon a yellow one represented a Jewish habitual criminal. * A purple inverted triangle superimposed upon a yellow one represented a Jehovah's Witness of Jewish descent.Note that since Jew was defined along racial lines, such as by the Nuremberg Laws, Jews could be classified as Jehovah's Witnesses. * A pink inverted triangle superimposed upon a yellow one represented a Jewish \"sexual offender\", usually a gay or bisexual man. * A black inverted triangle superimposed upon a yellow one represented 'asocial' and 'work-shy' Jews. * A voided black inverted triangle superimposed over a yellow triangle represented a Jew convicted of miscegenation and labelled as a (race defiler). * A yellow inverted triangle superimposed over a black triangle represented an Aryan woman convicted of miscegenation and labelled as a (race defiler). People who wore inverted pink, green, voided black, and yellow double badges were usually convicted by criminal courts before they were sent to concentration camps. Some double-triangle badges identified non-Jews. For example, at Mauthausen, Spanish Republicans had to wear a blue inverted triangle superimposed upon a red one. File:Prisoners in the concentration camp at Sachsenhausen, Germany, December 19, 1938. Heinrich Hoffman Collection. - NARA - 540178.tif|A Sachsenhausen detainee (the man wearing glasses) wears a two-color identification badge File:Buchenwald Disabled Jews 13132 crop.jpg|Jewish people with disabilities at Buchenwald in 1938. They wore black triangles on a yellow triangles, marking them as 'asocial' Jews File:Bundesarchiv Bild 152-27-13A, Dachau Konzentrationslager, Häftlinge beim Appell.jpg|Part of a Dachau roll call; day badges are visible on the detainees' uniforms File:SarahEwart-066.jpg|A Sachsenhausen detainee's uniform. The red triangle atop a yellow triangle (at bottom left) marked the prisoner as a Jewish political enemy === Distinguishing marks === In addition to color-coding, non-German prisoners were marked by the first letter of the German name for their home country or ethnic group. Red triangle with a letter, for example: * B identified Belgians () * E stood for English () * F identified French people () * H stood for people from Holland () * I identified Italians () * J marked Yugoslavs () * N identified Norwegians () * P identified Poles () * S marked Spanish Republicans () * T identified Czechs () * U marked Hungarians () * Z (next to a black triangle) marked Roma people () Polish emigrant laborers originally wore a purple diamond with a yellow backing. A letter P (for Polen) was cut out of the purple cloth to show the yellow backing beneath. Furthermore, repeat offenders (, meaning recidivists) had to wear bars over their stars or triangles. Different colors represented different crimes: * A political prisoner would have a red bar over their star or triangle. * A professional criminal would have a green bar. * A foreign forced laborer would not have a blue bar (because they would be imprisoned until the end of the war. However, these people might have a different coloured bar if they belonged to another category of prisoners. * A Jehovah's Witness would have a purple bar. * A homosexual or sex offender would have a pink bar. * An asocial would have a black bar. * Roma and Sinti would usually be incarcerated in special sub-camps until they died, so they usually did not receive a repeat stripe. Later in the war (late 1944), to save cloth, Jewish prisoners wore a yellow bar over a regular point-down triangle to indicate their status. For instance, regular Jews would wear a yellow bar over a red triangle, while Jewish criminals would wear a yellow bar over a green triangle. File:13cwik.jpg|The scientist Dr. Joseph Brau had to wear this badge in Buchenwald, marking him as a French political enemy File:A1vestonf.JPG|Another photo of Dr. Joseph Brau's Buchenwald uniform File:Nazi concentration camp uniform fabric sample.jpg|This badge marked a Polish political enemy File:Numer obozowy KL Stutthof 29659.JPG|At Stutthof, Lidia Główczewska had to wear this badge. It identified her as prisoner number 29659 and marked her as a Polish political enemy File:IgnacyKwarta.png|Auschwitz detainee Ignacy Kwarta wears a red P-triangle, meaning a Polish political enemy File:Buchenwald Prisoners 83718.jpg|Dutch Jews at Mauthausen wearing a yellow star and the letter N (for ). File:SarahEwart-069.JPG|A Sachsenhausen-issued red F emblem for a French political enemy File:Kazimierkiewicz georg 1 hpk.jpg|Emblems were also used on some detainee identification cards. At Mauthausen, this card identified the scientist Jerzy Kaźmirkiewicz. The P-triangle on the card marks him as a Polish political enemy File:Toasting Polish Dachau.jpg|Dachau survivors toast their liberation as the man standing in center between the bottles wears a P-triangle. File:The Liberation of Bergen-belsen Concentration Camp, April 1945 BU4010.jpg|A liberated Bergen- Belsen survivor (left) with a late war ersatz. Instead of wearing a cloth badge, this survivor had to wear a large N on her outer clothes == Table of camp inmate markings == Politisch Political prisoner Berufsverbrecher Professional criminal Emigrant Foreign forced laborer Bibelforscher Bible Student (Jehovah's Witnesses) Homosexuell Male homosexual/sex offender Arbeitsscheu/Asozial Work-shy/Asocial Zigeuner Gypsy (Roma or Sinti male) Basic colours Markings for repeaters Inmates of Strafkompanie (punishment companies) Markings for Jews Political prisoner nationality markings The capital letter of the name of the country on a red triangle Belgier (Belgian) Tscheche (Czech) Franzose (French) Pole (Polish) Spanier (Spanish) Special markings Jüdischer Rassenschänder Jewish race defiler Rassenschänderin Female race defiler Escape suspect Häftlingsnummer Inmate number Kennzeichen für Funktionshäftlinge Special inmates' brown armband Enemy POW or deserter Example Marks were worn in descending order as follows: inmate number, repeater bar, triangle or star, member of penal battalion, escape suspect. In this example, the inmate is a Jewish convict with multiple convictions, serving in a Strafkompanie (penal unit) and who is suspected of trying to escape. == Postwar use == Triangles appear on many postwar memorials to the Nazis' victims. These shapes represent the identification patches used in the camps. Sometimes, plain or colored triangles represent all categories of inmates. Often, inverted red triangles represent all victims of the concentration camps, including also the non- Jewish victims like Slavs, Poles, communists, homosexuals, Roma and Sinti, people with disabilities, Soviet POWs, and Jehovah's Witnesses. Some Holocaust memorials use more specific triangles. An inverted pink triangle symbolizes gay victims. A yellow and/or non-inverted triangle generally stands for Jewish victims. Some monuments also include badges with nationality letters. File:KZ Sachsenhausen - zentrales Mahnmal.JPG|A memorial at Sachsenhausen decorated with red triangles File:Todesmarsch Gedenkstein Breitenfeld.JPG|A Dora Todesmarsch (death march) roadside tablet marked only with the date and a red triangle File:Holocaust Memorial in Estonia.jpg|A colorless triangle at the Klooga Jewish victims' memorial File:Crawinkel Gedenktafel.JPG|A red triangle on a historical marker. The marker shows the route prisoners were forced to take on the Buchenwald death march (Todesmarsch). File:Death March Memorial Plaque, Oranienburg.jpg|Red triangle on a historical marker for Sachsenhausen death march victims File:Belower-Damm-Wittstock-Dosse-Mahnmal.jpg|Inverted triangle on a monument for Ravensbrück death march victims, in the village of Grabow-Below File:Denkmal KZ Woebbelin4.jpg|Triangle symbol on a Wöbbelin memorial stone File:Gedenkstätte Lindenring (2).jpg|This boulder in Lindenring honors 2,000 women victims of Ravensbrück File:Cenoteph of Cap Arcona.JPG|Pink triangle on a memorial for people on the Cap Arcona prison ship. About 7,000 people died after the Royal Air Force bombed the ship File:Neustadt-Glewe VVN- Denkmal 2008-01-03.jpg|Triangle symbol at the Neustadt-Glewe concentration camp memorial File:French monument Mauthausen 1243.JPG|F-triangle at Mauthausen-Gusen, honoring French victims File:Croix du Prisonnier Politique 1940-1945.jpg|A B-triangle incorporated into the Belgian Political Prisoner's Cross File:KZ-Hinzert-Plakette-Nacht-und-Nebel.jpg|This F-triangle at Hinzert honors French victims, especially the victims killed after Hitler's Nacht und Nebel directive File:Han Seelhorst Mahnmal KZ Opfer 01.PNG|A monument to Neuengamme victims in Hamburg. The letters KZ are not nationality-letters; they are the German abbreviation for Konzentrationslager (concentration camp) File:Ludwigsfelde Friedhof Gedenkstein Widerstandskämpfer.JPG|Triangular symbol on a memorial to victims killed at Genshagen (right panel) File:Denkmal für die Opfer der NS-Konzentrationslager Zgorzelec.JPG|A P-triangle at a Zgorzelec memorial File:Krzyż Oświęcimski Szymona Klugera, MZ-326-O 02.jpg|P-triangle on the Polish medal for camp victims File:Memorial with Prisoners Triangle Badges and Star of David Badge - Dachau Concentration Camp Site - Dachau - Bavaria - Germany.jpg|Various badges on a Dachau memorial File:In memory of homosexual.JPG|Pink triangle (Rosa Winkel in German) memorial for gay men killed at Buchenwald File:Gedenktafel Rosa Winkel Nollendorfplatz.jpg|This pink triangle plaque in the Berlin Nollendorfplatz subway station honors gay male victims File:Ac.homomonument.jpg|Amsterdam's Homomonument uses pink triangles symbolically to memorialize gay men killed in the Holocaust. The pink triangles also honor victims of anti-gay violence. File:Pink triangle on Twin Peaks (19055079410).jpg|Every year, a pink triangle is erected on Twin Peaks in San Francisco during Pride weekend. === 2020 Trump campaign === In June 2020, Donald Trump was running for re-election. His campaign posted an advertisement on Facebook which said that \"Dangerous MOBS of far-left groups are running through our streets and causing absolute mayhem.\" The ads identified these groups as \"ANTIFA\" and used an image of a downward-pointing red triangle. These ads appeared on the Facebook pages of Donald Trump, the Trump campaign, and Vice President Mike Pence. Many observers compared the graphic to the symbol used by the Nazis for identifying political prisoners such as communists, social democrats and socialists. Many noted that there were 88 ads. Neo-Nazis use the number 88 as an abbreviation for the Nazi salute Heil Hitler. (The letter H is the eighth in the alphabet, so 88 stands for \"HH.\") Facebook removed the campaign ads that used the red triangle symbol, saying that its use in this context violated their policy against \"organized hate\". The Trump campaign's communications director wrote that \"The red triangle is a common Antifa symbol used in an ad about Antifa.\" However, the historian Mark Bray, who wrote Antifa: The Anti-Fascist Handbook, disagreed. He said that the symbol Antifa in the United States does not use this symbol. == References == Informational notes Citations Bibliography * Richard Plant (1988). The Pink Triangle: The Nazi War Against Homosexuals. Owl Books. . * Camp badge chart at historyplace.com. * Additional camp badge chart . == Other websites == * United States Holocaust Memorial Museum. Classification system in Nazi concentration camps. * Stars, triangles and markings. Jewish Virtual Library. * Gay Prisoners in Concentration Camps as Compared with Jehovah's Witnesses and Political Prisoners. Ruediger Lautmann. Category:The Holocaust Category:Nazi concentration camps Category:Holocaust victims",
 "title": "Nazi concentration camp badge"
}