{
 "id": "896744",
 "text": "Duje Ćaleta-Car ( born 17 September 1996) is a Croatian professional footballer He plays as a centre-back for Ligue 1 club Marseille and the Croatia national team. He was a member of the Croatian squad which ended as runners-up to France in the 2018 FIFA World Cup. ==Club career== He started with his local club HNK Šibenik. Then he went on to FC Pasching in Austria. Ćaleta-Car joined FC Liefering in 2014 on loan from Red Bull Salzburg.. He made his Austrian Football First League debut with FC Liefering on 25 July 2014 against FAC Team für Wien. ===Red Bull Salzburg=== From 2015 till 2028 he played for FC Red Bull Salzburg 84 matches with four goals in the Austrian Bundesliga. 2017-18 he was part of the team which reached the Europa-League semifinals. ===Olympique de Marseille=== On 20 July 2018 Ćaleta-Car went to Olympique de Marseille on a five-year deal for a transfer fee of €19 million. Upon his arrival, Ćaleta-Car was given the squad shirt number 15. On 29 September 2019 he scored his first goal for Marseille, the equalizer in a 1–1 draw with Rennes. ==Southampton F.C.== A year before the end of his contract he moved to Southampton FC. www.croatiaweek.com ==International career== He played for Croatia U17, U18, U19 and U21 national football team. In October 2015, Ćaleta-Car received a first call-up for the senior national team for the Euro 2016 qualifying matches against Bulgaria and Malta. He was in the first 27 players team called for the Euro 2016 but was dropped. In May 2018, he was named in Croatia's preliminary 32-man squad for the 2018 World Cup in Russia. On 3 June he made his international debut in a friendly match against Brazil, coming on as a substitute for Vedran Ćorluka in the 52nd minute. Ćaleta-Car was selected in the 23-man squad that travelled to the 2018 FIFA World Cup in Russia. He made his World Cup debut in Croatia's final group game, a 2–1 win over Iceland. Croatia finish second in the tournament. ==Personal life== He is married and father of a son. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National Cup League Cup Continental Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Šibenik 2012–13 Druga HNL 17 0 0 0 — — — 17 0 Pasching 2013–14 Austrian Regionalliga 15 3 0 0 — — — 15 3 Liefering (loan) 2014–15 Erste Liga 19 0 0 0 — — — 19 0 2015–16 Erste Liga 1 0 0 0 — — — 1 0 Total 20 0 0 0 — — — 20 0 Red Bull Salzburg 2014–15 Austrian Bundesliga 7 0 1 0 — 1 0 — 9 0 2015–16 Austrian Bundesliga 31 2 4 0 — 2 0 — 37 2 2016–17 Austrian Bundesliga 18 0 5 0 — 8 0 — 31 0 2017–18 Austrian Bundesliga 28 2 6 0 — 19 0 — 53 2 Total 84 4 16 0 — 30 0 — 130 4 Marseille 2018–19 Ligue 1 20 0 1 0 0 0 5 0 — 26 0 2019–20 Ligue 1 23 1 2 0 1 0 — — 26 1 2020–21 Ligue 1 33 2 1 0 — 4 0 1 0 39 2 2021–22 Ligue 1 26 2 3 0 — 9 0 — 38 2 2022–23 Ligue 1 1 0 0 0 — 0 0 — 1 0 Total 103 5 7 0 1 0 18 0 1 0 130 5 Southampton 2022–23 Premier League 13 1 2 1 4 0 — — 19 2 Lyon (loan) 2023–24 Ligue 1 4 0 0 0 — — — 4 0 Career total 256 13 25 1 5 0 48 0 1 0 335 14 ===International=== National team Year Apps Goals Croatia 2018 2 0 2019 3 0 2020 5 0 2021 10 1 2022 3 0 Total 23 1 :Scores and results list Croatia's goal tally first, score column indicates score after each Ćaleta-Car goal List of international goals scored by Duje Ćaleta-Car No. Date Venue Cap Opponent Score Result Competition 1 11 November 2021 National Stadium, Ta' Qali, Malta 20 2–0 7–1 2022 FIFA World Cup qualification :Scores and results list Croatia's goal tally first, score column indicates score after each Ćaleta-Car goal. List of international goals scored by Duje Ćaleta-Car No. Date Venue Cap Opponent Score Result Competition 1 11 November 2021 National Stadium, Ta' Qali, Malta 20 2–0 7–1 2022 FIFA World Cup qualification ==Honours== Red Bull Salzburg * Austrian Bundesliga: 2014–15, 2015–16, 2016–17, 2017–18 * Austrian Cup: 2014–15, 2015–16, 2016–17 Croatia * FIFA World Cup runner-up: 2018 Individual *Austrian Bundesliga Team of the Year: 2017–18 Orders * Order of Duke Branimir: 2018 ==References== Category:1996 births Category:Living people Category:Croatian footballers Category:Association football defenders Category:FC Liefering players Category:FC Red Bull Salzburg players Category:Austrian football champions Category:Premier League players Category:Southampton F.C. players Category:2018 FIFA World Cup players",
 "title": "Duje Caleta-Car"
}