{
 "id": "896761",
 "text": "Compulsive hoarding (also known as a hoarding disorder) is a psychiatric health issue (ICD-11, 2018). It refers to higher than usual difficulty discarding one's own possessions or materials, even when they're of no special value. This usually happens in residences (homes, rental property and townhouses) where there are too many items and not enough room, cabinets, or containers in which to store things. Also, those who hoard do not want to get rid of the items. That is especially true with old unneeded items. ==Hoarding vs. collections== Hoarding isn't the same as collecting. The difference between the two is collectors are more likely to get possessions and valuable material in a targeted, organized and intentional way. Those who hoard often have an obsession and hardly any active planning. The mere sight of the objects may cause this. The objects do not really have any consistent theme. Collectors of objects have narrow focus on particular (or same/similar) topics. One of the signs of hoarding problems is heavy, disorganized clutter. ==Related psychiatric health and finance problems== Hoarding is usually, though not always, connected to depression, intellectual disability (having IQ levels 70 and below), borderline intelligence (IQ levels from 71 to 85), anxiety disorders, autism spectrum disorders, attention deficit hyperactivity disorders (ADHD) and obsessive compulsive disorder. Other reasons for which someone may hoard include: * Not deciding on where (or how) to throw away materials * Social isolation from other people * Not wanting others to touch their things ==Hoarding dangers== Hoarding can sometimes lead to places being condemned. Property tenants are then removed when health department officials, building inspectors or the fire marshals become involved. Hoarding may also increase fire risk and attract insects (including cockroaches, ants, centipedes, maggots and spiders). ==References== Category:Anxiety disorders",
 "title": "Compulsive hoarding"
}