{
 "id": "896818",
 "text": "Sobibor (, Polish: ) was a German extermination camp during World War II. It opened in May 1942 and closed on 14 October 1943. The camp was part of Operation Reinhard, Adolf Hitler's secret plan to kill all of the Jews in Nazi-occupied Poland. Sobibor was located in the forest near the village of Sobibór, in the General Government region of central Poland. Sobibor was an extermination camp, not a concentration camp. This meant the camp's only purpose was to murder Jews. The vast majority of prisoners were gassed within hours of arrival. People who were not killed immediately were forced to work in the camp. Few survived more than a few months. In total, some 170,000 to 250,000 people were murdered at Sobibor. Only three other camps (Belzec, Treblinka, and Auschwitz) killed more people than Sobibor. After the revolt, the Nazis demolished the camp and planted it over with pine trees. Sobibor got little attention in the first decades after World War II. It was rarely mentioned in popular or scholarly accounts of the Holocaust. It became better known after it was portrayed in the TV miniseries Holocaust (1978) and the film Escape from Sobibor (1987). The Sobibor Museum now stands at the site of the camp. Archaeologists continue to investigate the site. ==Background== === Operation Reinhard === Sobibor was one of four extermination camps established as part of Operation Reinhard, the deadliest phase of the Holocaust. In September of 1939, the Nazis invaded and occupied Poland. After that, all across Europe, the Nazis began deporting Jews from ghettos and sending them to forced labour camps. ==== Building Sobibor ==== The first group of workers who built Sobibor were mostly local people from neighbouring villages and towns. The Nazis had ordered the Jewish council in nearby Włodawa to send 150 Jews to help build the camp. Historians do not know if these were forced labourers. Building Sobibor was a very difficult job. Workers were constantly harassed as they worked, and were shot if they showed signs of exhaustion. Most were murdered once construction was completed. However, two escaped back to Włodawa, where they tried to warn the Jewish council about the camp and its purpose. The council did not believe these warnings. By summer of 1942, Sobibor had been completely built and was ready to open. After the camp opened, a steady stream of prisoners began to arrive. The Nazis were constantly expanding and renovating Sobibor. After only a few months, the wooden walls of the camp's gas chambers had absorbed too much sweat, urine, blood, and excrement to be cleanable. Thus, the gas chambers were demolished in the summer of 1942, and new larger ones were built made out of brick. Later that summer, the SS also started a beautification project to make parts of the camp look nicer. They built new structures and landscaped part of the camp to make it look like a village in Tyrol, Austria. When Sobibor ceased operations in mid-1943, the SS were part way through the construction of a munitions depot known as Lager IV. === Experiments with poison gas === In December 1941, SS officials at Chełmno did the first experiments to find ways of killing Jews using poison gases. At first, the Nazis used carbon monoxide gas to kill prisoners in vans. To get the carbon monoxide gas, they used a gasoline engine. They would connect the engine's exhaust pipe to pipes that led to the van's gas chamber. Carbon monoxide poisoning would kill all of the prisoners in the van. At the Wansee Conference on 20 January 1942, Reinhard Heydrich announced a plan for systematically murdering the Jews through a network of extermination camps. Operation Reinhard was based on this plan. In the same month, the Nazis did the first mass gassings at Auschwitz concentration camp. In mid-April 1942, shortly before the camp opened, the Nazis did more experiments with poison gas. In one experiment, the SS murdered thirty to forty Jewish women brought from the labour camp at Krychów. Eventually, permanent gas chambers were built at Sobibor. These were similar to the ones at Belzec, but without any furnaces. ===Layout=== Sobibor was surrounded by double barbed wire fences which were thatched with pine branches in order to block the view inside. At its southeast corner, it had two side-by-side gates. One was for trains; the other was for foot traffic and vehicles. The site was divided into five compounds: the Vorlager and four Lagers numbered I-IV. ==== The Vorlager ==== The Vorlager (front compound) contained living quarters and recreational buildings for the camp personnel. The SS officers lived in cottages with colorful names such as Lustiger Floh (the Merry Flea), Schwalbennest (the Swallow's Nest), and Gottes Heimat (God's Own Home). They also had a canteen, a bowling alley, a hair salon, and a dentist's office, all staffed by Jewish prisoners. Trawniki men (Soviet prisoners of war who agreed to help the Nazis) had their own separate barracks and recreational buildings, including a hair salon and a canteen. The Nazis paid great attention to the appearance of the Vorlager. It was neatly landscaped, with lawns and gardens, outdoor terraces, gravel-lined paths, and professionally painted signs. Its beautiful appearance helped hide the camp's purpose from new prisoners, who arrived on the ramp next to the Vorlager. Survivor Jules Schelvis recalled that when he arrived at Sobibor, he felt reassured by the Vorlager's \"Tyrolean cottage-like barracks with their bright little curtains and geraniums on the windowsills\". ==== Lager I ==== Lager I contained barracks and workshops for the prisoners. There were workshops for sign-painting and carpentry; a tailor's workshop; a bakery; and a mechanics shop. A person could only reach Lager I by passing through the Vorlager. The Nazis built a water-filled trench on Lager I's western boundary to make it impossible for prisoners to escape there. ==== Lager II ==== Lager II was a larger compound with several purposes. The camp's administration building was in a subsection called the \"Erbhof\". This building was constructed before World War II; before the Nazi occupation, the local Polish forestry service had used it. The Nazis adapted this building to include living space for some SS officers; storage for things stolen from victims' luggage; and a pharmacy. The medications in the pharmacy were also taken from victims' luggage. A small farm was also located in the Erbhof. There, Jewish prisoners raised chickens, pigs, geese, fruits and vegetables for the SS officers to eat. When prisoners first arrived at Sobibor, the SS prepared them for murder in Lager II, outside the Erbhof. This part of Lager II included the sorting barracks and other buildings used for storing items taken from the victims, including clothes, food, hair, gold, and other valuables. At the east end was a yard where guards took luggage from new arrivals and forced them to undress. This area was beautified with flower beds to hide the camp's purpose from newcomers. The yard led into a narrow path called the Himmelstrasse (road to heaven) or the Schlauch (tube), which led straight to the gas chambers in Lager III. The Himmelstrasse was covered on both sides by fences woven with pine branches. ==== Lager III ==== Lager III was the extermination area. It was kept separate from the rest of the camp, set back in a clearing in the forest and surrounded by its own thatched fence. Prisoners from Lager I were not allowed near Lager III, and were killed if the Nazis suspected that they had seen inside. Because few people who saw Lager III survived, there is little eyewitness testimony about this part of the camp. Historians know little about Lager III, except that it contained gas chambers, mass graves, and special separate housing for the Sonderkommando prisoners who worked there. Lager IV was added in July 1943. Because it was north of the other camps, Lager IV was also called the Nordlager ('north camp'). It was located in a heavily wooded area. The Nazis wanted to develop the area as a munitions depot for processing weapons taken from captured Red Army soldiers. However, it was still being built when Sobibor closed after the prisoners' revolt. == Prisoner life in the camp == Because Sobibor was an extermination camp, very few prisoners actually lived there. While survivors of Auschwitz use the term \"selected\" to mean being selected for murder, at Sobibor being \"selected\" meant being selected to live, at least temporarily. Around 600 slave labourers were 'selected' to live and were forced to help the Nazis run the camp. Most of these slave labourers died within a few months because of the terrible conditions in the camp. === Work === Prisoners worked from 6:00 am to 6:00 pm, with a short lunch break in the middle. Sundays were supposed to be half days, but sometimes prisoners had to work all day. The prisoner population included many labourers with specialized skills, such as goldsmithing, painting, gardening, or tailoring. The Nazis thought these prisoners were especially valuable, so they often let them live and gave them special privileges. Officially, these prisoners were allowed to live so they could do jobs that were needed in the camps. In reality, SS officers often used the prisoners' labor to benefit themselves. For example, they let Dutch Jewish painter Max van Dam live and said he would work as a sign painter. However, the SS also forced him to paint landscapes, portraits, and hagiographic images of Hitler. Similarly, Shlomo Szmajzner was placed in charge of the machine shop in order to conceal his work making gold jewelry for SS officers. Prisoners without specialized skills did a variety of other jobs. Many worked in the Lager II sorting barracks, where they were forced to sort through luggage left behind by victims of the gas chamber. They put aside valuable items for the SS to take, and also repackaged some of these items as \"charity gifts\" for German civilians. The SS would also make these workers serve in the railway brigade which greeted new prisoners. This considered a relatively good job, because famished workers could often find food in the victims' luggage. Younger prisoners commonly worked as putzers. Their job was to do cleaning and meet the needs of SS officers and the Trawniki men. Young male prisoners were often forced to work as the \"barbers\" who cut women's hair on their way to the gas chamber. The Nazis often assigned young men to this job in order to humiliate them the naked women whose hair they were cutting. Armed Trawniki men supervised the process in order to ensure that barbers did not respond to victims' questions or pleas. When construction of Lager IV began in the summer of 1943, the Nazis assembled a forest commando who worked there cutting timber for heat, cooking, and cremation pyres. ==== The Sonderkommando ==== In Lager III, a special unit of Jewish prisoners called the Sonderkommando was forced to assist in the extermination process. They had to remove victims' dead bodies from the gas chamber, search their body cavities for valuables, and cremate their corpses. They also had to scrub blood and excrement from the gas chambers. The Sonderkommando were direct witnesses to genocide. For this reason, the Nazis did not allow them to interact with other prisoners. Regularly, the SS would kill the entire unit and replace them with a new group of Sonderkommando. Since no workers from Lager III survived, nothing is known about their lives or experiences. ==== Resistance ==== Many prisoners found symbolic ways to resist the Nazis, like praying for the dead, performing Jewish religious rites, and singing songs of resistance. Other prisoners found small ways to hurt the Nazi war effort. For example, while working in the sorting shed, Saartje Wijnberg would secretly damage fine items of clothing to prevent them from being sent to Germany. Another survivor, Esther Terner, said she would sometimes find an unattended pot of soup in the Nazis' canteen. Any time this happened, \"We spit in it and washed our hands in it… Don't ask me what else we did to that soup… And they ate it.\" Sonderkommando prisoners struggled with the fact that they had participated in mass murder, even though they were forced to do so and did not directly kill anyone. Many committed suicide. Others endured, finding ways to resist. The most successful act of solidarity in the history of the camp was a prisoner revolt that occurred on 14 October 1943. === Social relations === It was difficult for prisoners to form personal relationships. Because people died so quickly at Sobibor, the camp's population was constantly changing. Also, prisoners often distrusted each other. Differences in nationality and language worsened this distrust. Many prisoners were especially suspicious of Dutch Jews because they spoke little Yiddish and had assimilated manners. See also endnote. German Jews faced the same suspicion as the Dutch. Many prisoners also suspected that German Jews would really be loyal to Germany, not to their fellow prisoners. When social groups did form, they were generally based on family ties or shared nationality. They were completely closed off to outsiders. Chaim Engel was shunned by fellow Polish Jews after he began a romantic relationship with Dutch-born Saartje Wijnberg. Many prisoners from Western Europe were not trusted with important information about what was happening in the camp. Prisoners constantly expected death. For this reason, most of them adopted a day-at-a-time outlook. Crying was rare and prisoners often spent their evenings enjoying whatever of life was left. After the war, Leon Feldhendler, who helped organize the Sobibor revolt, said: “The Jews only had one goal: carpe diem, and in this they simply went wild.” Prisoners sang and danced in the evenings. Frequently, they had sexual or romantic relations. In some situations, prisoners may have traded sex for food or items. In other situations, especially between female prisoners and kapos, the relations were probably coerced. However, others were driven by genuine bonds. Two couples that met in Sobibor were married after the war. The Nazis allowed and even encouraged an atmosphere of merriment. They even forced prisoners to join a choir by threatening to kill them if they refused. Many prisoners thought the Nazis were trying to prevent them from resisting or thinking about escape. ==== Levels of social status ==== Prisoners had different levels of social status in the camp. A person's social status was mostly based on how useful they were to the Germans. There were three categories of prisoners. Most prisoners were regular \"drones.\" They did not do skilled jobs that were important to the Nazis, so the Nazis viewed them as expendable (easily replaced). If the SS killed one of these prisoners, they could immediately replace that person with another prisoner. They experienced no consequences for doing this. Privileged workers had special jobs. These jobs (like working in offices or sorting stolen belongings) allowed privileged workers to be a little more comfortable than regular workers. Artisans were at the top of the prisoner hierarchy. Their specialized skills made them very important to the Nazis. They got special privileges from the SS. ==== Kapos ==== Kapos also had a high social status in the camp. These were prisoners (usually criminals) chosen by the Nazis to help run the camp. Kapos did many different supervisory tasks. They also kept other prisoners under control, using whips, threats, and abuse. Prisoners were not asked if they wanted to be kapos; the Nazis simply chose them, killing anyone who refused. The kapos responded in many different ways to the pressures of their job. For example, Oberkapo Moses Sturm was nicknamed \"Mad Moisz\" for his unpredictable temperament. He would beat prisoners horrifically for no reason, and then later apologize hysterically. He talked constantly of escape. Sometimes he berated the other prisoners for not resisting the Nazis; at other times, he tried to formulate escape plans. Sturm was executed after a lower-ranking kapo named Herbert Naftaniel betrayed him. Naftaniel, nicknamed \"Berliner\", was promoted to Oberkapo and became a notorious figure in the camp. He viewed himself as German rather than Jewish. He terrorized other prisoners until just before the revolt. Then a group of prisoners beat him to death with the permission of SS-Oberscharfuhrer Karl Frenzel. ==== Mutual support ==== Although there were many divisions within the prisoner population, people found ways to support each other. Sick and injured prisoners were secretly given food, medicine and sanitary supplies stolen from the camp pharmacy. Healthy prisoners were expected to cover for sick prisoners, who would otherwise be killed. Kurt Ticho, a camp nurse, falsified his records so that sick prisoners could take more than the allowed three-day recovery period. Members of the railway brigade tried to warn new arrivals that they were going to be murdered, though few people believed them. == Prisoner revolt == Sobibor closed after a prisoner revolt, which took place on 14 October 1943. This was the most successful act of solidarity in the history of the camp. The revolt was planned so that every prisoner in the camp would have at least some chance of escape. The plan for the revolt had two phases. In the first phase, teams of prisoners were to assassinate each of the SS officers who ran the camp - without attracting attention. The second phase would begin when they were called for evening roll call. Instead of lining up as usual, all 600 prisoners would walk out the front gate to freedom. The plan was disrupted after only 11 of the SS officers had been killed. The prisoners had to escape by climbing over barbed wire fences and running through a field of landmines while the SS tried to shoot them with machine guns. About 300 prisoners made it out of the camp. Of these, 58 are known to have survived the war. ==Notes== ==References== * * * * * * * * * * * ** * * * * * * * ==Further reading== * * * * * * * * * ==Other websites== * Stichting Sobibor, the Dutch Sobibor Foundation * Collection of interviews , from NIOD * Sobibor Museum * Nooit Voltooid Verleden Archaeological and testimonial documents * Sobibor entry at the Holocaust Research Project * Kurt Ticho testimony * Toivi Blatt testimony * Esther Raab testimony Category:1943 disestablishments in Europe Category:The Holocaust",
 "title": "Sobibor extermination camp"
}