{
 "id": "896811",
 "text": "Yuri Ivanovich Zhuravlyov (; 14 January 1935 – 14 January 2022) was a Russian mathematician. Zhuravlev was a full member of the Russian Academy of Sciences since 1992. He was also the Editor-in-Chief of the international journal Pattern Recognition and Image Analysis. In 1953, under the guidance of Alexey Andreevich Lyapunov, Yuriy Ivanovich completed his first serious scientific work on minimizing partially defined Boolean functions. This work was published in the “Proceedings of the MIAN,” and in 1955, it won first prize in the All-Union Student Research Competition. His diploma work involved solving the problem of finding words in a finite set while considering the unique structure of the set. After defending his thesis in 1957, he entered graduate school at Moscow State University, where he worked with A.A. Lyapunov in the department led by Academician Sergey Lvovich Sobolev. Working on a practical problem of testing a wide class of technical devices, Zhuravlev developed a special mathematical approach that later inspired numerous studies by both Soviet and international scientists. While studying the problem of locality in discrete tasks, he introduced a topological concept of “neighborhood” in Boolean function minimization, leading to several classical results, including a theorem on the local undecidability of constructing a minimal disjunctive normal form (DNF). These results formed the basis of his Ph.D. dissertation, which he defended at the end of 1959. In 1959, Zhuravlev moved to the newly established Akademgorodok in Novosibirsk, where he began his scientific career as a junior researcher, becoming head of a department in 1961 and deputy director for research at the Institute of Mathematics in 1966. He also taught in the Department of Algebra and Mathematical Logic at Novosibirsk University, chaired by Academician A.I. Malcev. In the Computing Theory Department of the Institute of Mathematics at the Siberian Branch of the USSR Academy of Sciences, created by Yuriy Ivanovich, significant work was carried out on operations research, simulation modeling, nonlinear programming, and applied research. During this period, he achieved several notable results, including the construction of an example of a Boolean function with a “pathologically large” number of dead-end DNFs, fundamentally solving a research problem that had led to an entire research direction. The major result of this period was the general theory of local algorithms, which combined topological principles and algorithm theory. This theory formed the basis of his Doctor of Science dissertation, which Zhuravlev defended in 1965 in one of the first defenses in the field of “Mathematical Cybernetics.” His opponents included cybernetics experts Academician V.M. Glushkov and Corresponding Members A.A. Lyapunov and O.B. Lupanov, as well as algebraist Professor A.D. Taimanov, who conducted a rigorous review of the technically challenging studies on majority properties. For his achievements, Zhuravlev, together with O.B. Lupanov and Corresponding Member of the USSR Academy of Sciences S.V. Yablonsky, was awarded the Lenin Prize in Science and Technology in 1966. From 1966, Zhuravlev embarked on a new research direction: solving classification or pattern recognition problems. The first such task, solved in collaboration with geophysicists F.P. Krendelev and A.N. Dmitriev, involved analyzing information on gold deposits. The successful application of a test algorithm for this task led to an entire direction in pattern recognition based on discrete analysis methods. Yuriy Ivanovich introduced and researched the now-classic model of estimation computation algorithms (ECA), unifying most of the known recognition principles and procedures at that time. Hundreds of scientific papers have since studied ECA, many authored by Zhuravlev’s students. Today, ECA is a highly versatile language for describing recognition procedures, widely applied to solve practical tasks and inspiring new theoretical research. In 1969, Zhuravlev joined the USSR Academy of Sciences’ Computing Center (now the Computing Center of the Russian Academy of Sciences), where he led the Laboratory of Recognition Problems, later transformed into the Department of Recognition Problems and Combinatorial Analysis Methods and the Department of Computational Forecasting Methods. Zhuravlev continues to lead the Department of Recognition Problems today, also serving as Deputy Director of the Computing Center for Research. Since 1970, he has worked as a professor at the Moscow Institute of Physics and Technology (MIPT). Under Yuriy Ivanovich’s guidance, students and colleagues have solved numerous applied problems in fields such as medicine, geology, social and economic forecasting, creating software systems for decision support, recognition, classification, and prediction. These applied works are grounded in deep fundamental research in both recognition and discrete analysis. From 1976 to 1978, Zhuravlev published a series of papers on the now-famous algebraic approach to the synthesis of correct algorithms, establishing the modern framework for recognition and many related fields of applied mathematics and computer science. The core idea of the algebraic approach, derived from Galois extension theory, involved using algebraic closures of initially heuristic models, i.e., parametric families of algorithms, to synthesize high-quality algorithms. In this period’s works, Zhuravlev and his students demonstrated that even explicit constructions of high-quality algorithms are possible for a broad range of ill-defined problems. The structures of Zhuravlev’s algebraic approach were justified based on the compactness hypothesis and the hypothesis of a probabilistic nature of the subject area. These works, like his earlier studies on ECA, inspired a continuing stream of research that solidified Zhuravlev’s school’s global leadership in mathematical recognition methods. In addition to his work in recognition, in the 1980s, Zhuravlev (together with A.Yu. Kogan) achieved significant results in solving “canonically hard” problems in discrete mathematics, again reinforcing his view on complexity: even if “almost all” problems in a certain class are practically unsolvable, specific real-life problems from this class may still be solvable effectively. In 1984, Zhuravlev was elected as a Corresponding Member of the USSR Academy of Sciences and, in 1992, as an Academician of the Russian Academy of Sciences (RAN). In 1992, he also became an Academician of the Russian Academy of Natural Sciences. In 1989, he and several of his students received the USSR Council of Ministers Prize for a series of applied works. An outstanding mathematician and author of numerous scientific directions and results, Yuriy Ivanovich also devoted considerable time and effort to scientific and organizational work. Since 1989, he has been a member of the Executive Committee of the International Association for Pattern Recognition (IAPR); since 1990, a member of the Bureau of the Department of Informatics, Computer Engineering, and Automation of the RAN; and since 1991, Editor-in-Chief of the international journal “Pattern Recognition and Image Analysis.” In 1997, he founded and headed the Department of Mathematical Forecasting Methods at the Faculty of Computational Mathematics and Cybernetics of Moscow State University. In 1998, he became the Chairman of the Scientific Council on the Complex Problem of “Cybernetics” at the Presidium of the RAN. Since his presentation at the IFIP World Congress in New York in 1965, Yuriy Ivanovich has regularly given lectures abroad, including courses in universities in the USA, France, Finland, Sweden, Austria, Poland, Bulgaria, East Germany, and others. This international engagement significantly contributed to the global recognition of Soviet science in discrete mathematics and pattern recognition. Yuriy Ivanovich Zhuravlev passed away on January 14, 2022, and was buried at the Troekurovskoye Cemetery, plot 35, next to his wife, Elena Semyonovna Zhuravleva (1939-2021), who was the Deputy Director of the Center for Historical Studies of the Moscow State University, Doctor of Historical Sciences, and Professor. ==References== Category:1935 births Category:2022 deaths Category:Russian mathematicians Category:Russian educators Category:Russian editors",
 "title": "Yuri Zhuravlyov (mathematician)"
}