{
 "id": "896980",
 "text": "Linear Tape-Open (LTO) is a magnetic tape data storage technology. It stores digital data on a half-inch magnetic tape inside a removable cartridge. It is commonly used for backup and archival of data on servers and workstations. LTO can store any type of digital data, for example computer programs, databases, video, audio, images, websites, or text. It can store multiple types of data on the same tape. For example, a single tape could be used to backup a photography company's pictures and videos as well as their website, emails, and customer database. LTO tapes are read and written to with a tape drive. This is typically connected to a computer using serial attached SCSI, although some tape drives use Fibre Channel. LTO drives are very expensive, but the tapes are much cheaper than an equivalent-sized hard drive or optical disc. Unlike many other tape formats, LTO cartridges contain only a single reel of tape. The other reel is inside the drive. This means that the tape must be rewound before it can be removed from the drive. This makes the cartridge smaller because it does not need to contain an empty reel. It also makes the drives more expensive because they must contain a mechanically complex mechanism to pull the tape out of the cartridge and thread it onto the takeup reel. Unlike most other tape drives, LTO drives do not have a rotating head drum, and do not use helical scan. The head writes tracks in a straight line, like a reel-to-reel audio recorder. This is where the name comes from. The head can, however, move up and down to write multiple tracks to the tape. This is similar to the way an 8 track tape works, although since the head is much smaller, an LTO tape can have hundreds or thousands of tracks (up to 8960 tracks for LTO-9). This allows many terabytes of data (up to 18 TB for LTO-9) to be stored on a single tape. LTO tapes have an expected lifespan of about 30 years, which is longer than hard drives (5-10 years), but not as long as the best gold-plated optical discs (100-1000 years). LTO drives are only backward- compatible by two generations, whereas the latest Blu-ray drives can read the oldest CDs from the 1980s, making optical media a better solution for very long-term archival. LTO tapes should be stored at 15-25ºC and away from sources of magnetic fields, such as TVs and computer monitors, loudspeakers, or motors. LTO tapes must never be bulk-erased or degaussed. They should only be erased with an LTO drive. Category:Magnetic tape",
 "title": "Linear Tape-Open"
}