{
 "id": "897122",
 "text": "The Indo-Iranian languages or Indo-Iranic languagesRowlett, Ralph M. \"Research Directions in Early Indo-European Archaeology.\" (1990): 415-418.Heggarty, Paul. \"Europe and western Asia: Indo-European linguistic history.\" The global prehistory of human migration (2015): 157-167. are the largest group of the Indo-European language family. They include the Indo-Aryan (Indic) is the reconstructed proto-language of the Indo-Aryan languages.) and Iranic (Iranian) languages. They are mostly spoken in the Indian subcontinent and the Iranian plateau. Originally, they were spoken in Central Asia, to the east and the north of the Caspian Sea. ==Indo-Aryan languages== There are about 221 Indo-Aryan (Indic) languages, with more than 800 million speakers. Below are the most widely spoken Indo-Aryan languages. * Punjabi (regional official language in India; regional de facto co-official provincial language in Pakistan) * Bengali (official language in Bangladesh; regional official language in India) * Marathi (regional official language in India) * Hindustani (in the form of Urdu; official language in Pakistan; regional official language in India alongside Hindi, another form of Hindustani) Sanskrit, the sacred language of the Hindus, is also an Indo-Aryan language. Today it is spoken by around 14,000 people, is an official language in the Indian state of Uttarakhand, and is one of the 22 official languages of India. ==Iranic languages== There are about 86 Iranian languages, or Iranic languages as argued by some scholars,Kümmel, Martin Joachim. \"Iranic vs. Iranian.\" Update of Mar 30 (2018). with between 150 and 200 million speakers. Below are the most widely spoken Iranian languages. * Persian (official language in Iran; also official as Dari in Afghanistan and as Tajik in Tajikistan) * Pashto (official language in Afghanistan) * Kurdish – official language in the Kurdistan Region of Iraq The Iranian languages also contain the extinct language Avestan – used in the scripture of Zoroastrianism. It is similar to Sanskrit but not widely spoken today. ==Nuristani, Bangani, and Badeshi== Some scholars consider the Nuristani and Bangani languages as part of the Indo- Aryan subgroup, but some other scholars consider them as two separate subgroups of Indo-Iranian. The Badeshi language is also an unclassified Indo- Iranian language. ==Further reading== * * Kümmel, Martin. \"Substrata of Indo- Iranic and related questions.\" Loanwords and substrata. Proceedings of the Colloquium held in Limoges (5th–7th June, 2018). 2020. * Pinault, Georges- Jean. \"Contacts religieux et culturels des Indo-Iraniens avec la civilisation de l'Oxus\". In: Comptes rendus des séances de l'Académie des Inscriptions et Belles-Lettres, 149ᵉ année, N. 1, 2005. pp. 213–257. DOI:https://doi.org/10.3406/crai.2005.22848 ; www.persee.fr/doc/crai_0065-0536_2005_num_149_1_22848 * Pinault, Georges-Jean. \"La langue des Scythes et le nom des Arimaspes\". In: Comptes rendus des séances de l'Académie des Inscriptions et Belles-Lettres, 152e année, N. 1, 2008. pp. 105–138. DOI:https://doi.org/10.3406/crai.2008.92104 ; www.persee.fr/doc/crai_0065-0536_2008_num_152_1_92104 * Baly, Joseph. Eur- Aryan roots: With their English derivatives and the corresponding words in the cognate languages compared and systematically arranged. Vol. 1. K. Paul, Trench, Trubner & Company, Limited, 1897. ==Notes== ==References==",
 "title": "Indo-Iranic languages"
}