{
 "id": "897476",
 "text": "Bhool Bhulaiyaa 2 () is a 2022 Indian Hindi-language comedy horror film directed by Anees Bazmee, written by Aakash Kaushik, and produced by Bhushan Kumar. It is a standalone sequel to Priyadarshan's 2007 iconic horror comedy Bhool Bhulaiyaa. Bhool Bhulaiyaa 2 stars Kartik Aaryan, Tabu and Kiara Advani. The filming began on 9 October 2019. It was theatrically released in India on 20 May 2022. The film received positive reviews from critics, with praise for the performances (particularly Tabu), horror sequences, and Kaushik's screenplay. The film is loosely based on the Malayalam film Geethaanjali directed by Priyadarshan, which was based on Agatha Christie's novel, Elephants Can Remember. ==Plot== In 2007, a group of sorcerers trap a spirit inside a room of the Thakur palace, securing it with holy threads. Eighteen years later, Ruhan Randhawa meets Reet Thakur on a trip to Chandigarh and convinces her to miss their bus to attend a music festival. The duo later finds out that the bus they were supposed to take had an accident and Reet's family thinks she is dead. Reet finds out that her cousin was in love with her fiancé, and in order to get them married she convinces Ruhan to stay in her ancestral home, where the spirit of Manjulika is trapped, with her so her family thinks she is dead. When Reet's family finds Ruhan there they confront him and Ruhan pretends to be a spirit seer, and through a bunch of happy accidents manages to convince the villagers. Ruhan tells the family that Reet's final wishes were to stay in the ancestral home with her family and see her cousin marry. Meanwhile, three priests whose business is affected because of Ruhan try to convince the villagers that he is a fraud, causing Reet to hide in Manjulika's room, which then releases her spirit, who causes havoc but the family thinks Reet's spirit is doing so. Manjulika's backstory is revealed. Manjulika and Anjulika, Reet's sister-in-law, were identical twins but Manjulika was jealous of Anjulika because she was their father's favourite, so she started practising dark magic. When a boy she liked chooses Anjulika over her, she decides to kill her, killing their father in the process. But Anjulika ends up stabbing Manjulika in defense and Manjulika's spirit pushes her husband from the balcony, paralyzing him. They call a priest to lock Manjulika's spirit in a room and leave the house planning to never return. In the present day, Manjulika's spirit keeps causing disrupt but Ruhan, Reet and Anjulika, who found out everything, are afraid to tell fearing that Reet's secret will be out. Manjulika's spirit enters. Ruhan get possessed by Manjulika's spirit and threatens Anjulika in front of the family. Reet is revealed to be alive. Anjulika holds a knife to Reet's throat and it is revealed that she was Manjulika all along. Manjulika had switched bodies with Anjulika and had killed Anjulika that night and pushed Anjulika's husband off the balcony when he found out the truth. Anjulika's spirit was locked in a room for eighteen years while Manjulika pretended to be her. Ruhan reveals that he knew the truth and had pretended to be possessed so the truth was unveiled. Anjulika's spirit appears and Manjulika admits to everything. Anjulika's spirit then drags and traps Manjulika in the same room where she was locked and talks to her family. She asks them to forgive Reet because her innocence was proven because of her. She thanks Ruhan, and Manjulika is heard screaming to be let out. Anjulika asks the family to leave because she has unfinished business with her sister and proceeds to enter the locked room after which screaming is heard. == References == ==Cast== * Kartik Aaryan as Ruhan Randhawa / Rooh Baba * Tabu as Manjulika and Anjulika * Kiara Advani as Reet Thakur * Rajpal Yadav as Chhote Pandit * Amar Upadhyay as Uday Pathak * Sanjay Mishra as Jyotishi Baba * Milind Gunaji as Ruhabo * Karmveer Choudhary as Mukhiyaji * Rajesh Sharma as Chacha Choudhary * Siddhant Ghegadmal as Potlu * Govind Namdev as Tantrik Baba == Other websites == * Category:2020s Indian movies Category:2022 movies Category:Hindi-language movies",
 "title": "Bhool Bhulaiyaa 2"
}