{
 "id": "897570",
 "text": "Kyle Egan Richards Umansky (born January 11, 1969) is an American actress and television personality. She began her career as a child actress in Little House on the Prairie, and is know for appearing as Lindsay Wallace in the Halloween films franchise. Richards has appeared as a main cast member on the Bravo reality television series The Real Housewives of Beverly Hills since 2010. As of 2023, Richards is the last remaining original cast member of the series. == Early life == Kyle Egan Richards was born in the Hollywood neighborhood of Los Angeles, California on January 11, 1969, as the younger of two daughters to businessman and retired lieutenant colonel Ken Richards, and casting director Kathleen Richards. Her elder sister is Kim Richards, an actress. She also has an older maternal half-sister, Kathy Hilton, and three older paternal half-siblings, all of whom are deceased. Richards is of Welsh and Irish ancestry. Richards parents divorced when she was 10 years old. Her mother married Jack Catain Jr., a businessman and convicted criminal, on July 4, 1980.California, U.S., Marriage Index, 1960-1985: 4 JUL 1980 LOS ANGELES – Kathleen M Dugan = Jack M Catain Catain Jr. was her stepfather, briefly. She gained two stepsiblings from her mother's third marriage; Michele Catain, a crew member and real estate agent, and Michael Catain, a businessman and convicted criminal. Her mother and stepfather were divorced on March 16, 1982.California, U.S., Divorce Index, 1966-1984: 16 MAR 1982 LOS ANGELES – Jack M = Kathleen Catain == Personal life == In 1988 Richards married her first husband, Indonesian real estate tycoon Guraish Aldjufrie. The couple welcomed their first child Farrah Aldjufrie on October 31, 1988. Richards and Aldjufrie separated in 1990 and finalized their divorce in 1992. The two have remained close friends. In 1994 Richards met her second husband, real estate agent, Mauricio Umansky. Richards converted to Modern Orthodox Judaism to marry Umansky.The couple wed on January 20, 1996. They went on to welcome three daughters, Alexia Umansky (born June 18, 1996), Sophia Umansky (born January 18, 2000), and Portia Umansky (born March 1, 2008). Richards and Umansky announced their separation after 27 years of marriage in July of 2023. ==References== Category:1969 births Category:Living people",
 "title": "Kyle Richards"
}