{
 "id": "897798",
 "text": "Yucca Mountain Yucca Mountain Highest point Elevation 6,707 ft (2,044 m) NAVD 88\"Yucca\". NGS data sheet. U.S. National Geodetic Survey. Retrieved 2011-05-20. Prominence 1,333 ft (406 m)\"Chocolate Mountain, Nevada\". Coordinates 36°56′25″N 116°29′06″W﻿ / ﻿36.940210656°N 116.485006506°W﻿ / 36.940210656; -116.485006506Coordinates: 36°56′25″N 116°29′06″W﻿ / ﻿36.940210656°N 116.485006506°W﻿ / 36.940210656; -116.485006506 Geography Yucca Mountain Nye County, Nevada, U.S. Topo map USGS Topopah Spring Geology Mountain type Caldera, cinder cones Last eruption 80,000 years ago Yucca Mountain is a mountain in Nevada, near its border with California,. It is approximately northwest of Las Vegas. Yucca Mountain is in the Great Basin. The mountain is east of the Amargosa Desert, south of the Nevada Test and Training Range and in the Nevada National Security Site. It is the site of the Yucca Mountain nuclear waste repository. As of 2021, laws have identified this site as the place where spent nuclear waste is to be stored. Because of politics, the funding of the site was cut in 2010. == Geology == Several large eruptionsd from a caldera volcano created Yucca Mountain. The mountain is composed of changing layers of different kinds of rock. The volcanic units have been tilted along fault lines. They formed the current ridge line called Yucca Mountain. In addition to these faults, Yucca Mountain is criss-crossed by fractures, many of which formed when the volcanic units cooled. == Cultural history == Yucca Mountain and surrounding lands were central in the lives of the Western Shoshone and Southern Paiute peoples, who shared them for religious ceremonies, resource uses, and social events; Yucca Mountain is still considered sacred by the Shoshone people living today. == References == == Other websites == * GNIS - Feature Detail Report for Yucca Mountain * * * Category:Geography of Nevada Category:Pages with unreviewed translations",
 "title": "Yucca Mountain"
}