{
 "id": "897863",
 "text": "The Russo-Ukrainian War; ; is an ongoing conflict between Russia and Ukraine that began in February 2014. It started when Russia took over Crimea and funded anti-government rebels in the Donbas region. It escalated in February 2022 when Russia invaded the whole of Ukraine. The number of soldiers that have been wounded or killed is a half million (as of 2023), according to U.S. authorities.https://www.nettavisen.no/nyheter/i-atte-ar-kjempet-roman-43-mot- russerne-sa-gikk-det-nesten-forferdelig-galt/f/5-95-1294219. Nettavisen.no. Retrieved 2023-09-01 == History == === War in Donbas === On 20 February 2014, Russian soldiers took control of Crimea. The Annexation of Crimea by the Russian Federation soon followed. Russia also supported separatists in the Donbas region, who took control of the Donetsk Oblast and the Luhansk Oblast and declared them as independent countries. In August 2014, Ukraine attacked the separatist oblasts. A ceasefire, the Minsk Protocol, was agreed on but both sides continued fighting, with 85% of the ceasefire violations being done by Russia. The fighting slowed down and became a frozen conflict. === Invasion of Ukraine === In 2021, more and more Russian soldiers and weapons arrived near the border with Ukraine. There was fear of a possible invasion. On 17 January 2022, Russian troops and weapons began arriving in Belarus for a 'military exercise', that [started or] was going to start in February; Its name is Allied Resolve. The following month, Russia officially recognised the separatist regions in Donetsk and Luhansk as independent countries (separate from Ukraine). Russian soldiers then began appearing in the regions. On 24 February 2022, President Vladimir Putin announced the invasion of Ukraine. Most other countries declared their support for Ukraine, especially the countries of the NATO military alliance. Many other countries began sanctioning Russia (such as stopping trade, participation in events and the travel of Russian politicians) as a way to fight Russia without using soldiers. Russia's effort to take Kyiv, the capital of Ukraine, failed in early April 2022 and had to withdraw. Ukraine began taking back land that Russia had taken during 2022. In September 2022, four Russian-controlled separatist regions of Ukraine were annexed as member states of Russia. In 2023 the frontlines changed very little, with many calling the war a stalemate. However, the year saw many important events, such as when the Wagner Group, a Russian mercenary company, took over the Russian city of Rostov-on-Don and tried to reach Moscow (capital of Russia), after its leader had complained about how the war was going. As of 2024's third quarter, the U.S. government is still giving military aid to Ukraine. Earlier, there have been months when U.S. lawmakers did not pass laws about military aid to Ukraine. ==Related pages== *List of ongoing armed conflicts *2022 Russian invasion of Ukraine *The Long Breakup, a film about the relationship between Ukraine and Russia. ==Notes== ==References== Category:2010s conflicts Category:2010s in Russia Category:2020 in Russia Category:2010s in Ukraine Category:2021 in Russia Category:2020s conflicts",
 "title": "Russo-Ukrainian War"
}