{
 "id": "897968",
 "text": "There is a long road called Nakasendo in Japan. Nakasendo is a road that is one of the five major highways in the Edo period, and is a highway that connects Nihonbashi in Edo and Sanjo Ohashi in Kyoto via inland. Narai-juku is a post-town located right in the middle of the Nakasendo. == History == Narai- juku is the place that is the longest historic post-town in Japan, forming a townscape for about 1 km while gently descending along the Narai river. Also, Narai-juku was bustling with many people as a post-town in the middle of the 16 century. It was rebuilt as a modern Narai-juku in 1601 with the establishment of a post-town by Edo Shogunate. In this way, Narai-juku was very prosperous during the Edo period. In particular, the procession of the prestigious \"Ochatsubo Dochu\", which carried tea for the Tokugawa Shogunate from Uji in Kyoto to Edo Castle, has become a very famous event in this place. == Geography == === Topography === Narai-juku is in Shiojiri city in Nagano prefecture. It is located in the west of Nagano prefecture. The cityscape is formed on a road of about 1km. This place is a village that is created under a marine terrace (a terrace formed along a seashore by the merging of wave-cut and wave-built terraces) at an altitude of 900 meters. === Geology === === Climate === Narai-juku is located under a marine terrace so the temperature difference between summer and winter is large. According to the data from Google, the highest temperature is 28 degrees in August and the lowest temperature is -8 degrees in January. There is a lot of nature around Narai- juku, so the visitors can enjoy the colors of nature that change with each season. In spring, there are many cherry blossoms. In summer there are many green trees. In autumn, there are autumn leaves. In winter, there is a lot of snow. == Demographics == The population of Narai-juku in 1843 was 2,155, with 409 houses, one Honjin and one Wakihonjin, and five inns. It is currently merged with Shiojiri City, Nagano Prefecture. However, the population of Narai-juku is declining and aging. == Festivals == === Narai Shukuba Festival === The Narai Shukuba Festival is a festival that recreates the teapots that were held during the Edo period. At that time, the Ochabo Dochu had a great deal of authority and scale. Since it faithfully reproduces it, visitors can enjoy the atmosphere of that time along with the old townscape of Narai-juku. === Summer Festival (Shizu Shrine annual Festival) === In 1618, a plague called \"Sukumi\" became prevalent in Narai-juku. To quell this plague, the people of Narai-juku invited Futsunushi (It is a god of martial arts that appears in the Nihon Shoki, and brings you good luck such as victory luck, traffic and avoiding misfortune.) from Katori Shrine in Shimousa (now Chiba Prefecture) to start a ritual. This is said to be the origin of this festival. Every year after noon on August 12, Wakashu (young man) dedicates a musical accompaniment at Shizu Shrine and walks north through the post town while playing a musical accompaniment (Music that is added to enhance the atmosphere (in Nogaku, Kabuki, etc). The houses along the road entertain the Wakashu with alcohol and food after the music is dedicated. === Ice Candle Festival === It is a festival where you can see a fantastic view of about 2,000 handmade ice candles lit in the old townscape, which was selected as an important traditional buildings preservation district of the country. It is held once a year on the day of Setsubun on February 3rd. == Cuisine == === Oyaki === Oyaki is a local dish of Shinshu. Wheat flour is kneaded with water, and various delicacies such as Nozawana are wrapped and steamed. Oyaki goes well with any ingredients, so you can add sweets to make it a snack, or add side dishes to eat as a staple food. === Shinshu Soba === Nagano Prefecture has become famous as \"Shinshu soba\" because the temperature difference between day and night is large, the well-drained mountain fields are suitable for soba cultivation, and good quality soba can be obtained. In addition, wild vegetables are also famous in Narai-juku, so you can eat them with wild vegetable tempura. === Gohei Mochi === Gohei mochi is made by pounding half of brown rice on a skewer and adding miso or soy sauce-based sauce to it. The origin is not clear, but it is said that Gohei mochi came to be called Gohei mochi because a person named Gobei crushed rice and ate it with miso. Gohei mochi in Narai-juku is characterized by its round shape. == Traditional items == === Kiso Shikki === Kiso Shikki is lacquerware. The unique climate of Narai-juku, where summers are cool and winters are harsh and cold, is good for the lacquer work environment. In addition, large forests rich in nature nurture good wood and are blessed with two favorable environments, one is the climate and another is that there are the main roads which can carry trees to this place in terms of transportation. Against this background, Kiso lacquerware continues to be made and has become a traditional item. === Mage Mono === Divide the grain of Kiso cypress into an appropriate thickness, boil it in boiling water to soften the wood, bend it into a circle or oval, and sew it with the bark of mountain cherry blossoms. Bent products are finished by fitting the bottom plate and then applying lacquer. These are Mage Mono. Typical examples are tubs, barrels, and lunch boxes. == References == [1]奈良井宿観光協会. (2018、October 3). 歴史・宿場町の歩み. Retrieved January 13, 2022, from https://www.naraijuku.com/narai/history/ [2]奈良井宿. (n.d.-b). www.kisoji.com. Retrieved January 13, 2022, from http://www.kisoji.com/kisoji/feature/narai.html [3]Token World. (n.d.). 江戸時代の町並みが残る奈良井宿. 刀剣ワールド. Retrieved January 13, 2022, from https://www.touken- world.jp/tips/44034/ [5]徒然なるブロブログ. (2019, December 2). 奈良井宿の四季の写真と季節ごとの名物をご紹介！東京との気温差もご説明します. Retrieved January 13, 2022, from https://riba-kurata.com/season [7]木曽地域.(n.d.).長野県.Retrieved January 8, 2022, from https://www.pref.nagano.lg.jp/kikaku/kensei/soshiki/shingikai/ichiran/sogokeikaku/documents/chap5-6.pdf [8]漆器祭・宿場祭とは. (n.d.). Shikki-Shukuba, Shiojiri. Retrieved January 8, 2022, from http://shikki-shukuba.shiojiri.com/about/ [9]奈良井宿観光協会. (2022, January 10). イベント. Retrieved January 13, 2022, from https://www.naraijuku.com/event/ [10]奈良井宿観光協会. (2022a, January 10). アイスキャンドルまつり. https://www.naraijuku.com/shop/post-59/ [11]奈良井宿観光協会. (2018b, October 24). てずから. Retrieved January 13, 2022, from https://www.naraijuku.com/shop/post-19/ [12]信州そばとは?. (n.d.). Shinsu. Retrieved January 8, 2022, from http://shinshu.jp.net/wild/food/soba_variety.html [13]五平餅. (n.d.). 農林水産省. Retrieved January 8, 2022, from https://www.maff.go.jp/j/keikaku/syokubunka/k_ryouri/search_menu/menu/gohei_mochi_nagano.html [14][15]奈良井宿観光協会. (2018b, October 10). 魅力「味・創・旅」. Retrieved January 13, 2022, from https://www.naraijuku.com/narai/charm/ Category:History of Japan",
 "title": "Narai-juku"
}