{
 "id": "897955",
 "text": "Shoma Uno (born 17 December 1997) is a Japanese figure skater. He is a silver medalist of the 2018 Winter Olympic in Pyongyang. He is the first skater to land a quadruple flip. Shoma Uno was born in Nagoya, Japan. == Career == Uno started skating because he was suggested to skate by Mao Asada when he was 5 years old. === 2011-2012 season === Uno made his Junior International debut. He placed third at the Junior Grand Prix (JGP) Tallinn Cup in Estonia. At the 2012 Winter Youth Olympics, he placed second in the single and first in the team. He was 10th at the 2012 World Junior Championships in Minsk. === 2012-2013 season === Uno placed 6th at the JGP Skate Bled in Slovenia. He came second at the Schwerter Cup. He placed second at the All Japan Junior Championships held at Dydo Drinco Ice Arena. He was 11th at the All Japan Championship recommended by All Japan Junior. Keiji Tanaka abstained from the World Junior Championships, so he took the place and finished 7th. === 2013-2014 season === Uno placed third at the JGP in Riga, and placed 4th in Tallinn. He came 5th at the 2014 World Junior Championship. He placed first in his first international senior class at the Gardena Spring Cup. === 2014-2015 season === He won the Asian Figure Skating Trophy by landing his first quadruple toe loop. He won a silver medal at the JGP in Japan and won a gold medal in Croatia. He made his first participation in the JGP Final. Overall, he renewed the highest score in the world for junior class and became the third Japanese winner to follow Takahiko Kozuka and Yuzuru Hanyu. He placed 1st at the All Japan Junior Championship and placed 2nd at the All Japan Championship. Based on this result, he was represented in the Four Continents Championships and finished 5th. He became the fifth Japanese winner of the World Junior Championships. === 2015-2016 season === He switched to senior class. At the Japan Open, he scored a high score of 185.48, although it was not officially recognized, and became the first place for individual men. He finished second in Skate America for the first Grand Prix series. He took first place in the short program at the Eric Bompard Cup, but the free program was canceled due to a series of attacks in Paris. So the short program ranking was the final ranking and he won a gold medal. He made his first participation in the Grand Prix Final and finished in third. He finished second in the All Japan Championships and represented for the Four Continents Championships and the World Championships. He finished 4th in the Four Continents Championships and 7th in the World Championships. At the Team Challenge Cup, he became the first person to succeed in a quad flip at an international competition. === 2016-2017 season === He finished first in Skate America, second in the Rostelecom Cup, and participated in the Grand Prix Final for the second time in a row. He finished in third. He won the All Japan Championship for the first time. At the Four Continents Championships, he set a new personal best overall and finished 3rd. At the World Championship, he updated his personal best by 4.58 points in a short program and placed second. He finished without major mistakes in the free program, and won a silver medal. Following the results of this competition, He contributed to get three representative men's slots at the Pyeongchang Olympics the following year. === 2017-2018 season === Uno won a gold medal at Skate Canada. At Internationaux de France, he wasn't feeling well because of the flu, but he came in second and was able to participate in the Grand Prix Final which was held in his hometown of Nagoya. At the Grand Prix Final, he did not reach Nathan Chen by a small margin and finished second. He won the All Japan Championship for the second time in a row and was selected as the Olympic representative. At the Pyeongchang Olympics, he performed a short program as a member of a team competition. He came 1st and contributed to the free program participation and 5th place prize. In the individual competition, he won a silver medal and finished one- two with Yuzuru Hanyu. After the Olympics, he changed his skates to a new one and it didn't fit his feet well, and he injured his right instep while practicing. He was in second place even though he faced the competition without being in perfect condition. === 2018-2019 season === Uno became a two- time winner of Skate Canada. He also won a gold medal at the NHK Trophy. He finished second at the Grand Prix Final. At the All Japan Championship, he sprained his right ankle during the warm-up before the official practice on the morning of the short program. In the actual performance, he succeeded in all the jumps and took the lead. He also participated in a free program and achieved the third straight victory as a result. After the tournament, he devoted himself to treatment, but when he started practice, he sprained the same spot. In the Four Continents Championships, due to the influence of injury, he was late in the short program 4th place, but he won the world's highest score after the rule revision in the free program. At the World Championship, he missed the podium in 4th place. He left the coaches Machiko Yamada and Mihoko Higuchi, who he had studied with for over 15 years, and showed his intention to change coaches. === 2019-2020 season === He announced that he would face the season without a main coach. At the 2019 Internationaux de France, in the short program, jumps fell one after another, and he was delayed to 4th place. Even in the free program, he made a mistake in jumping and got 9th place, and he was desperate to participate in the Grand Prix Final. At the Rostelecom Cup, Stephane Lambiel accompanied him, though not his official coach, to give technical advice and sit in a kiss and cry. The result was 4th, but showed signs of recovery. He announced that he would study under Stephane Lambiel. At the All Japan Championship, he finished second in the short program, but Yuzuru Hanyu, who was in first place, made a mistake in the free program and he won a come-from-behind victory to achieve his fourth straight victory. The Four Continents Championships, in which he was represented, declined to improve the accuracy of jumps and programs for the World Championships. However, the world championship was canceled due to the influence of Covid-19. === 2020-2021 season === He was scheduled to participate in the Grand Prix series of Internationaux de France, but was canceled due to the pandemic. At the All Japan Championship, there was a mistake in the jump in the short program and he placed in 3rd, but in the free program he regained 2nd place. At the world championships, he came 6th in the short program, but 3rd in the free program and finished 4th overall. At the World Team Trophy, he finished 9th in the short program and 6th in the free program. It was third place as a team. === 2021-2022 season === Uno was placed 2nd at the GP Skate America and placed 1st at NHK Trophy. He was scheduled to participate in the Grand Prix Final in Osaka, but it was canceled due to the effects of Covid-19. He won a silver medal at the All Japan Championship and was chosen for the 2022 Winter Olympics in Beijing. == References == *Shoma Uno Official Site. (n.d.). Shoma Uno Official Site.https://shoma-uno.com/ *12歳の宇野昌磨の人生を決めた「浅田真央との出会い」. (2019, April 10). COURRIER. https://courrier.jp/news/archives/157877/ *フィギュアスケート、氷上の華. (2017). 名古屋GPファイナルで宇野昌磨2位。 それでも「後悔なし」だった理由。. https://number.bunshun.jp/articles/-/829471 *「靴」に苦しむ日本勢。世界選手権 ３枠ゲットへ、宇野昌磨も波乱含み. (2018). 「靴」に苦しむ日本勢。世界選手権 ３枠ゲットへ、宇野昌磨も波乱含み. https://sportiva.shueisha.co.jp/clm/othersports/figure/2018/03/24/___split_8/ *サンスポ. (2019). 宇野昌磨の新コーチはランビエル氏. 宇野昌磨の新コーチはランビエル氏. https://www.sanspo.com/article/20191218-D4RWYICUZJK6JKNPCBKGSTFSWU/ *http://www.isuresults.com/bios/isufs00012455.htm *“宇野昌磨3位 - フィギュア”. ニッカンスポーツ・コム. 日刊スポーツ新聞社. (2015年12月14日) https://www.nikkansports.com/sports/news/1579157.html *“田中刑事が代表辞退 宇野出場へ フィギュア世界ジュニア”. スポーツニッポン（スポニチAnnex）. (2013年2月17日)https://www.sponichi.co.jp/sports/news/2013/02/17/kiji/K20130217005219330.html Category:1997 births Category:Living people Category:Japanese figure skaters Category:Sportspeople from Aichi Prefecture",
 "title": "Shoma Uno"
}