{
 "id": "898188",
 "text": "The Danube Swabians are German settlers of the former Austria-Hungary Empire. They founded villages, and worked as farmers. Their ancestors were once settled from 1686 - 1829 by the order of the House of Habsburg in Hungary, and parts of former Yugoslavia and Romania who belonged to the Habsburger Monarchy, from different parts from Austria and Germany like Hesse, Bavaria, the Palatinate, Hunsrück, Baden-Württemberg, Swabian Jura Fulda (district), Rhön, Franconia, Rhein-Pfalz-Kreis, Swabia (Government Region), but also Alsace, Lorraine, Southern Netherlands and Luxembourg etc. The city Ulm at Alb-Donau-Kreis, in Swabian Jura, was the startpoint, where this German emigrants went with the Ulmer Schachtel (a small boat), along the Danube River, this is why they got the name Danube Swabians. They speak different German dialects. They believed in Roman Catholicism and Lutheranism and hold much of the old Norse mythology. After World War II, most of the Danube Swabians were expelled by the order of the Potsdam Conference, to Allied- occupied Austria and Allied-occupied Germany. Only a few Danube Swabians live today in this country who once belongend to the Habsburger Monarchy. Most Danube Swabian descendants live in Austria and Germany, but also some in USA, Canada and Australia.http://www.danube- swabians.org/https://www.dvhh.org/history/https://www.dvhh.org/history/1700s/DS- history~tullius.htm ==Stiffoller== The Germans from the Hochstift Fulda settled at 25 villages in the Baranya and in the city Pécs arround 1717 - 1804,https://www.worldcat.org/oclc/311888384 this subgroup is named Stifolder or Stiffoller.https://www.feked.hu/etc/Stifolder_tortenet.pdf An example of the Stifullerisch Danube Swabian German-dialect of Baranya: \"Mer rede noch die schwowisch Muddersprooch\"https://hrcak.srce.hr/file/152751, DNA testing shows that Danube Swabians from Hungary are real descendants of Germans == Name == The first German settlers came via the Danube River 1686 - 1713, and was Swabians mostly from Black Forest in Wurttemberg and called by the Hungarian, Serbian, Croatian, and Romanian population as Svábok, Švabo, Şvabii. The German itself have said Donauschwowehttps://www.dvhh.org/history/1700s/DS- history~tullius.htm The term Danube Swabians was ofically given in 1922. ==References== Category:Austria-Hungary Category:Germanic peoples",
 "title": "Danube Swabians"
}