{
 "id": "898124",
 "text": "The (First) Slovak Republic (), also called the Slovak State (Slovenský štát), was a partially-recognised client state of Nazi Germany which existed in Central Europe between 14 March 1939 and 4 April 1945. ==History== One day before the Nazi German occupation of Bohemia and Moravia, they declared independence from Czechoslovakia. It has mostly the same borders as the modern-day Slovakia except for the regions which were ceded to Hungary in 1938. The Capital city was declared Bratislava, as it was good in terms of politics, economics and culture when it came to representing Slovakia. ===Jozef Tiso=== Jozef Tiso, the founder and only President of the Slovak Republic, was a Catholic priest. He was a member of the pro-Nazi Catholic fascist Hlinka Slovak People's Party (HSL’S), * * * * * which seized power in Slovakia, when Czechoslovakia was dismembered by Nazi Germany, and modelled Slovakia after Nazi Germany's totalitarian state. * * * * * ===Slovak Hlinka Guard=== The Slovak Hlinka Guard was a militia set up by Jozef Tiso to hunt down Jews, Roma and other \"undesirable\" minorities. ===Holocaust in Slovakia=== ====1940–1942==== In 1940, Jews were fired from their jobs and their properties taken over by Jozef Tiso's regime. Tiso's regime enacted the strictest laws against Jews – called The Jewish Code – in Nazi-occupied European countries. Before the start Tiso's deportation of Jews in March 1942, 88,951 Jews were estimated to be living in Slovakia. ====1942–44==== By November 1942, 57,000 Slovak Jews were rounded up and handed over to Nazi German troops by the Hlinka Guard, Slovak police and ethnic German Slovak Freiwillige Schutzstaffel (\"Volunteer SS\"). In the final three months of 1944, over 70,000 of the pre-deportation 88,951 Jews were deported to Nazi death camps, mostly Auschwitz and Theresienstadt, with over 60,000 of them slain. Tiso's regime paid Hitler 500 reichsmarks per deported Jew. ===Disestablishment=== In April 1945, the Slovak capital Bratislava was taken over by the Soviet Red Army, while Romanian troops took over other parts of Slovakia. ===Aftermath=== Jozef Tiso was handed over by American troops to the restored Czechoslovak government. Tiso was tried along with former Foreign Minister Ferdinand Durčanský and Interior Minister Alexander Mach. He was convicted of treason, collaboration and executed four days after his verdict. ==Related pages== * Ustaše * Antisemitism * Supersessionism * Independent State of Croatia * Catholic Church and the Independent State of Croatia * Roman Catholics and antisemitism in the 21st century ==Further reading== * Kamenec, Ivan. Tragédia politika, kñaza, a človeka (Dr. Jozef Tiso, 1887–1947). Bratislava: Premedia, 1998. * Fabricius, Miroslav, and Katarína Hradská, eds. Jozef Tiso: Prejavy a články 1938–1944. Bratislava: Historicky ústav SAV, 2007. * Ward, James Mace. Priest, Politician, Collaborator: Jozef Tiso and the Making of Fascist Slovakia. Ithaca: Cornell University Press, 2013. ==Notes== ==References== Category:Europe Category:Slovakia Category:Puppet states Category:Czechoslovakia Category:Eastern Europe Category:Former dictatorships Category:Government of Slovakia Category:Former countries in Europe",
 "title": "Slovak Republic (1939–1945)"
}