{
 "id": "89821",
 "text": "Mary, Queen of Scots (8 December 1542 – 8 February 1587) was Queen of Scotland from 14 December 1542 to 24 July 1567. Then, she was forced to give up her kingdom (abdicate). She was executed because it was said she had been plotting to kill her cousin, Queen Elizabeth I of England. == Early life == Mary was the daughter of King James V of Scotland, who died just after she was born. She was crowned queen when she was only six days old.The British Monarchy: Mary Queen of Scots Her grandmother Margaret Tudor was the oldest surviving daughter ofKing Henry VII of England. Mary went to live in France when she was very young. Scotland was ruled by regents until she was 18 years old. The first regent was the Earl of Arran. After 1554, the regent was Mary's mother, Mary of Guise. == Life in France == King Henry VIII of England tried to get Lord Arran to agree that Mary would marry his son, which led to a series of battles called the \"Rough Wooing\". In the end, Lord Arran turned to the French for help. Lord Arran and King Henry II of France agreed that France would protect Scotland if Mary could marry Francis Henry II's son. That happened when she was 15, and Francis was now King Francis II of France. However, their marriage was short since Francis became very ill. He died from an ear infection, which had spread to his brain. That left Mary a widow shortly before her 18th birthday. == Reign in Scotland == When Mary was born, Scotland was a Catholic country. While she was living in France, Protestant ideas were spreading to Scotland. Her mother, Mary of Guise, tried to stop that but was unable. In 1560, the Parliament of Scotland decided that Scotland would be a Protestant country. In 1561, Mary returned to Scotland. She found that she was not popular in her kingdom. She had been brought up as a Catholic, but many people in Scotland had become Protestant. It was difficult for Mary to avoid siding with either Catholics or Protestants. As Mary was now free to marry again, there were many noblemen who wanted to become her husband. For her second husband, she chose an English lord, Henry Stuart, Lord Darnley, who was of royal blood. Both Mary and Darnley were grandchildren of Henry VII, and they were half first cousins. Darnley was good-looking and charming, but he was often very childish, and he was jealous of Mary's secretary, an Italian named David Rizzio. Mary became pregnant. While she was expecting the baby, Darnley and his friends got drunk one night and decided to kill Rizzio. They came into Mary's private rooms at Holyrood Palace while she was talking with Rizzio, and they stabbed him to death. Darnley got away with the murder because he was the queen's husband, but Mary never forgave him for murdering her friend Rizzio and avoided being with him again. When her baby was born, it was a boy, who would later become King James VI of Scotland. In 1567, Darnley was murdered. James Hepburn, 4th Earl of Bothwell, was put on trial for the murder but found not guilty. He was a powerful Scottish nobleman, who was loyal to Mary and hated Darnley. Mary then married him. That caused her problems because Bothwell had many enemies, and many still believed he had murdered Darnley. Mary's enemies forced her off the throne and made her young son the king in her place. Mary was put in prison in Loch Leven Castle. She escaped and crossed the border into England, which was ruled by her cousin Queen Elizabeth I of England. == Imprisonment and death == Mary hoped that her cousin Elizabeth I would help her regain her throne, but Elizabeth did not trust Mary and feared that Mary might try to take over the English throne. As a result, Mary was imprisoned for many years. However, things took a dark turn when Mary was accused of planning to murder Elizabeth. She was put on trial and found guilty of treason by a jury of 30 noblemen. She was sentenced to death by beheading. On February 8, 1587, Mary was executed at Fotheringhay Castle in Northamptonshire, England, at the order of Queen Elizabeth I. After the execution, the executioner held up Mary's head and famously declared, \"God save the Queen.\" While that was meant to demonstrate his loyalty to Elizabeth I, some accounts suggest that the crowd was horrified by the display, which only added to the public sympathy for Mary. The execution of Mary was a significant event in the history of Scotland and of England, and it is still remembered and debated today. Some believe that Mary was a victim of Elizabeth's political plotting. Others argue that she was a threat to English security and had to be dealt with accordingly. Some people in Scotland saw Mary as a victim, a Catholic queen who was unfairly treated by her Protestant cousin, and mourned her death. ==References== Category:1542 births Category:1587 deaths Category:House of Stuart Category:Kings and Queens of Scotland Category:16th century in Scotland",
 "title": "Mary, Queen of Scots"
}