{
 "id": "898399",
 "text": "GoodBarber is a no-code development platform, developed in France, which allows users unfamiliar with programming to build mobile apps and progressive web applications, using Drag and Drop graphic user interface. == History == === Establishment === GoodBarber was born from the merger of two French software companies, DuoApps and WebzineMaker, It was founded in 2001, in Ajaccio (Corsica), by François-Sébastien Simoni and 3 associates (J. Pietri, P. Chiappe and F. Bernardini). At the beginnings, the GoodBarber's platform performed as generator of blogs in SaaS mode, websites and WebTVs. In 2011, DuoApps and WebzineMaker officially launched the native mobile application builder named GoodBarber in order to develop and market a technical solution to build native IOS and Android applications and Progressive Web apps, for content publishing and eCommerce shopping stores. Also used as content management system by some research organizations. GoodBarber's technology is recognized among No-code development platforms, best known as App builders or App makers. === After launch === As a cross-platform software, the technical platform generate mobile applications compatibles for mobile phones for both Android and iOS and Progressive web application (PWA) mobile applications, accessible from the web through by a mobile browser. In the same class of software, other noticeable companies are Appy Pie, AppSheet, BuildFire, Microsoft PowerApps, AppInstitute, Zoho. Initially launched on the English and French markets, between 2013 and 2015 GoodBarber was enhanced to integrate Italian, Spanish, German, Portuguese and Turkish in its editor interfaces. In April 2015, GoodBarber acquired Mougli, an online appointment platform for professionals In December 2018, the companies WebzineMaker and DuoApps merged into a single entity under the name of GoodBarber. == Developments, locations and key figures == In 2013, GoodBarber first attended Mobile World Congress. GoodBarber has been listed in the FT 1000 by the Financial Times and the French economic newspaper Les Echos. In 2020, it integrated the Mercado Pago payment platform, as payment solution for eCommerce apps. GoodBarber is physically established in 3 countries (France, Portugal and the United States) ==References== ==Other websites== *Official website Category:Technology companies of France Category:2001 establishments in Europe",
 "title": "GoodBarber"
}