{
 "id": "898306",
 "text": "is a Japanese singer-songwriter and model. == Introduction == Rina Sawayama is a Japanese female artist from Niigata Prefecture. She is currently attracting attention as the next pop icon in the UK. She is an artist and creator who self produces her own music videos, writes lyrics and composition. == Early life == Rina Sawayama was born on 16th of August 1990. Her hometown is Niigata prefecture. Her occupations are singer, model and music composer. The labels are Avex in Japan and Dirty hits in the UK. == Career == In 2013, Rina Sawayama started her career with her first single “Sleeping in Walking”. After then her first mini album “RINA” released in 2017 was selected as one of the “Artist to Know in 2017” by The FADER(USA) and “DAZED 100(100 Creators of the Next Generation)”by DAZED(UK). In November 2019, she was awarded “VOGUE JAPAN Women Of The Year 2019” which is given to women who have made various achievements in the year. On April 17, 2020, they released their first studio album, “SAWAYAMA”. It received high praise from music critics, with a 5-star rating from ”NME”, 4-star ratings from ”AllMusic”, Independent, and ”Rolling Stone”, and an 89/100 rating from the review collection site Metacritic. Her career has not been limited to music, and it has been announced that she will appear as a main cast member in the movie \"John Wick: Chapter 4\" to be released in 2022. == Personal life == Rina Sawayama was born in Niigata in 1990, she later moved to Tokyo and then to London when she was four years old due to her father's job transfer. After attending a Japanese school in North London, she studied political science at Cambridge University. However, Rina Sawayama is bullied and driven to the brink of depression on campus, where the old ways of white family society still exist and discrimination and prejudice against students from Asian and Western countries still persist. At that time, she met the LGBTQ community on campus and was saved by the members of the group. There are four members in the family: his mother, father, and an older brother. Rina Sawayama Parents divorced when she was a teenager. After that, she stayed in London with her mother and lived there. She has an older brother who is a translator, web designer, copywriter, photographer, and web consultant. Now, all of her family members live in Japan apart from Rina Sawayama. == Other Venture == Rina Sawayama is also a model. In 2013, she started working with “Anti Agency”, a modeling agency created by her friend. She was selected as a campaign model for the 2016 Osaka building, “LUCUA Osaka”. It was also announced that she will be a main cast member in the movie \"John Wick Chapter 4\" scheduled to be released in 2022. == Awards and nominations == Rina Sawayama named one of Noisey's \"25 Women Under 25 Who Are Absolutely Killing It Right Now\" for International Women's Day 2016. In 2017, she was selected as one of the \"Dazed 100\" nominees, a group of 100 next- generation creators who will be responsible for the future of youth culture. November 2019, ”VOGUE JAPAN Women of the Year 2019” will be awarded to women who have shone in a variety of fields that year. In 2020, her first album ”SAWAYAMA” was awarded ”AllMusic Best of 2020” ”and Favorite Pop Album”. == Discography == === Singles === Sleeping in Waking (2013) Where U Are (2016) This Time Last Year (2016) Cyber Stockholm Syndrome (2017) Alterlife (2017) Tunnel Vision (2017) Valentine (What's It Gonna Be) (2018) Cherry (2018) Flicker (2018) STFU! (2019) Comme des garçons (like the boys)(2020) === Albums === RINA (2017) SAWAYAMA (2020) ==References== *ALL MUSIC: https://www.allmusic.com/artist/rina-sawayama-mn0003639509/awards *Billboard: https://www.billboard.com/culture/pride/rina-sawayama-billboard-cover-story- interview-2021-9580420/ *BBC News: https://www.bbc.com/news/entertainment- arts-52380231 *Rolling Stones: https://www.rollingstone.com/music/music- lists/10-new-artists-you-need-to-know-november-2017-124811/ *TIMES : https://time.com/collection/next-generation-leaders/ *ARAMAJAPAN: https://aramajapan.com/featured/vogue-japan-names-its-vogue-japan-women-of- the-year-2019/102738/ Category:Living people Category:1990 births Category:People from Niigata Prefecture Category:Japanese singers",
 "title": "Rina Sawayama"
}