{
 "id": "898762",
 "text": "The Federal Ethics and Anti-Corruption Commission (FEACC) is a commission headquartered in Addis Ababa by the Government of Ethiopia. ==Duty== FEACC is responsible for controlling Ethiopia's corruption problems and making the country less corrupt and more lawful. The Federal Ethics and Anti-Corruption Commission is accountable to the Prime Minister of Ethiopia. == Authority == Under Proclamation No. 1236-2020 the Federal Ethic and Anti-Corruption Commission is charged with \"it has become necessary to prevent corruption and impropriety and to create a society of good ethical values and moral which shall not condone but rather prepared to resolutely combat corruption; in order to arid, sustain the development, peace and democratic process in our country.\" The Federal Ethics and Anti-Corruption Commission has had the authority to press charges to individuals and has had brought charges to high- ranking government officials to high courts and businessmen in 2013. But later the role of prosecuting and investigation went to the Federal Police Commission and the Ministry of Justice. === Powers === The FEACC has the powers to register assets and has had to disclose the names of government officials to denied registering their assets to the FEACC. The FEACC under No.668/2010 has the authority to demand anyone including the President and Prime Minister of the country to register their assets to the FEACC and coming to their headquarters to do so. ==== Structure ==== The Federal Ethics Commission is \"The Commission is comprised of various Directorates and three Services. The Directorates are: * Public and International Relations * Ethics Liaison and Corruption Prevention * Ethics building and Public Participation Coordination * Training Study and Research * Asset Disclosure and Registration * Anti-Corruption legal Advice * Implementation and Experience Formulation * Regional Affairs Coordination * Change Management and Capacity Building * Plan and Budget Administration * Human Resource Administration * Procurement * Finance and Property Administration * Information Communication Technology * Internal Audit * Women and Children Affairs and General Services The Commissioner’s Office and the Deputy Commissioner’s Office are also part of the Organizational set-up. The Commission currently has 282 staff members (164 male and 118 female).\" == References == Category:Government of Ethiopia",
 "title": "Federal Ethics and Anti-Corruption Commission"
}