{
 "id": "898856",
 "text": "Flydubai Flight 981 was a scheduled international passenger flight from Dubai International Airport, in the United Arab Emirates. On 19 March 2016, the Boeing 737-800 crashed while landing at Rostov-on-Don Airport in Russia. There are no survivors among 62 people on board. ==Crew== The captain was 37-year- old Aristos Sokratous, from Cyprus. He had over 6,000 hours of total flying time, including 4,905 hours on the Boeing 737. Sokratous was promoted to captain a year and a half before the crash. At the time of the crash, he had intended to quit the airline after accepting a job from Ryanair, which would allow him to be based with his family in Cyprus. His wife was due to give birth to their first child a few weeks after the crash. According to several Flydubai staff members, Sokratous decided to leave the airline mainly because of fatigue and lifestyle issues. The first officer, 36-year-old Alejandro Cruz Álava, was from Spain. He had more than 5,700 hours of flying time, with 1,100 of them on the Boeing 737. He started flying with Flydubai in 2013, two years before the crash, and had previously flown two regional airlines in the Spanish Canary Islands – Binter and Naysa – before joining the company. According to the final report by the Interstate Aviation Committee (IAC), the accident flight was both pilots' first ever flight to Rostov. The captain had experience flying into other Russian airports, but the first officer did not. == Victims == People on board by nationality Nationality Passengers Crew Total Russia 44 1 45 Ukraine 8 0 8 India 2 0 2 Uzbekistan 1 0 1 Spain 0 2 2 Colombia 0 1 1 Cyprus 0 1 1 Kyrgyzstan 0 1 1 Seychelles 0 1 1 Total 55 7 62 File:Авиакатастрофа в Ростове-на-Дону (25).jpg File:Авиакатастрофа в Ростове- на-Дону (28).jpg File:Авиакатастрофа в Ростове-на-Дону (23).jpg File:Авиакатастрофа в Ростове-на-Дону (29).jpg ==References== Category:Aviation accidents and incidents in the 2010s Category:Aviation accidents and incidents in Asia Category:2016 disasters in Asia Category:Boeing 737 Category:March 2016 events",
 "title": "Flydubai Flight 981"
}