{
 "id": "898962",
 "text": "Moriuchi Takahiro (born April 17, 1988, in Tokyo) is known as Taka, the lead vocalist of Japanese rock band ONE OK ROCK. He was listed as “50 Greatest Rockstars in the World” on Kerrang! magazine in 2017. He was a member of NEWS until he left the group in Earlier life == Earlier life == He was born as a first son between Masako Mori and Shinichi Mori. They are both well known singers in Japan. He went to Keio elementary school and continued to study at Keio middle school. In the first year of his middle school, he entered Johnny's office in 2001. He made his debut as a member of a group “NEWS” in September 2003. He gained his career so quickly that he was bashed by the fans. They were saying that Taka gained his career because of his parents, not his skills. In December 2003, a weekly magazine posted a scandal. The subject was a suspicion of Taka drinking alcohol and smoking cigarettes. He left Johnny's office after this scandal. In 2005, his parents divorced. He joined the band ONE OK ROCK in the following year. The group continued to grow and became famous around the world as a rock star. == Career == *2017 Jan 9th, “ONE OK ROCK18祭” was shown on TV. The band made their TV debut. *2018 :Jan 18th, ONE OK ROCK ranked first in the most listened to artists in Japan on Spotify. :Apr 22, ONE OK ROCK completed the AMBITION JAPAN TOUR, AMBITIONS WORLD TOUR, AMBITIONS JAPAN DOME TOUR, in 27 countries, for a total of 99 concerts. :Oct, Tried “ONE OK ROCK with Orchestra Japan Tour” for the first time in Saitama Super Arena and Osakajo hole. :“Wherever you are” ranked third on the most played songs on Spotify. *2019, Taka appeared on Ed Sheeran’s “” and followed Ed Sheeran over 10 concerts during Asia tour. *2020 :“Wasted Nights” has been used as a theme song of American drama “Council of Dads”. :First online live “ONE OK ROCK 2020 Field of Wonder at Stadium live streaming”. *2021, Became independent from the office Amuse. Built the company 株式会社10969 with chief manager as a CEO. == Relatives == *Father: Shinichi Mori (森進一), A trendy singer in the 1960s. He sang in the “NHK紅白歌合戦” 48 times in a low since 1968 to 2015. *Mother: Masako Mori (森昌子), Enka singer, and an actress. She first performed in the “NHK紅白歌合戦” when she was 15 years old. She was the youngest performer at that time. *Brother: Tomohiro Moriuchi (森内智寛), Second son. He works at TV Tokyo after he graduated from Keio university. *Hiroki Moriuchi (森内寛樹), Third son. Vocalist of Japanese rock band MY FIRST STORY. Known as Hiro. == Inspired artists == *Linkin Park (United States) Taka said he studied English pronunciation by listening to Linkin Park’s songs again and again. He is well known for his song “New Divide” from the movie “Transformers Revenge of the Fallen . Taka was planning to sing in his concert as a guest. However, the concert had been canceled due to Chester Bennington’s(Vocalist) sudden death. He attended “Linkin Park and Friends Celebrate Life in Honor of Chester Bennington and sang “Somewhere I Belong” to mourn Chester’s death. *Rize (Japan) Taka saw this band when he was young and dreamed of becoming a bandman. Kenken (member of Rize) said that the band ONE OK ROCK was built mostly based on Rize in the interview. *Fall Out Boy (United States) Fall Out Boy is a band from the early 2000s. Taka said in his interview that he was positively influenced by this band. He also played as an opening act in Fall Out Boy’s concert. The band is famously known for the song “Immortals” from the movie “Big Hero 6”. == References == *ONE OK ROCK（ワンオク）メンバーの年齢、名前、意外な経歴とは. .Cal-cha (2021, December 23). https://ticketjam.jp/magazine/music/japan-rock/519 *ONE OK ROCK – Takaはジャニーズ出身！入所と退所のきっかけとは…？Cal-cha(2021, July 15) https://ticketjam.jp/magazine/music/japan-rock/37203 *Interview with ONE OK ROCK in Tokyo. (2008, June 21). JaME. https://www.jame- world.com/en/article/22552-interview-with-one-ok-rock-in-tokyo.html *Takaの生い立ち！家族やジャニーズの苦難を越え世界のONE OK ROCKへ. ONE OK ROCK LIFE BLOG〜ワンオク ライフ ブログ〜.(2016, November 9). ONE OK ROCK Blog., https://one-ok-rock- blog.jp/taka/29/ *ONE OK ROCK JAPAN AMBITION TOUR (2017) ALL RIGHT RESERVED, https://www.oneokrock.com/jp/news/1947 *ONE OK ROCK official website (n.d). INC. ALL RIGHT RESERVED, https://www.oneokrock.com/jp/ Category:1988 births Category:Living people Category:Singers from Tokyo",
 "title": "Takahiro Moriuchi"
}