{
 "id": "898957",
 "text": "A Counter Terrorist Specialist Firearms Officer (CTSFO) is an elite armed police officer in the United Kingdom specially-trained in the usage of firearms. The CTSFO standard is the highest Authorized Firearms Officer level in the National Police Firearms Training Curriculum (NPFTC) and was established by the Metropolitan Police Service in the lead up to the 2012 Summer Olympics held in London in July 2012. The Firearms units of police forces organize CTSFOs into teams to establish a Police Tactical Unit. A national capability to respond to terrorist incidents such as marauding terrorist firearms attacks through collaboration of police forces who maintain CTSFO teams was established known as the CTSFO Network. == History == In April 2016, a two year recruitment drive known as the CTSFO uplift project, part of the National Armed Uplift Program, commenced to double the number of CTSFOs, and was subsequently extended until the end of 2018. On 3 August 2016, the MPS held a press conference for the announcement of Operation Hercules, displaying the CTSFO teams to the public wearing wolf-grey-coloured tactical uniforms, equipped with SIG Sauer SIG516 and SIG MCX carbines, Glock 17 handguns, Remington 870 shotgun, Accuracy International AT308 sniper rifle, and paraded the BMW F800GS motorcycles used for deployments in central London. == Training == CTSFOs engage in various types of high level training including use of live rounds during close quarters combat (CQC) training, explosive entry and fast-roping from helicopters to be able to respond more effectively to terrorist incidents. They also conduct training with the United Kingdom Special Forces at a level approaching the Special Air Service (SAS) and/or Special Boat Service (SBS) standards. The CTSFO training facilities at the MPS Specialist Training Centre includes indoor and outdoor live-fire shooting ranges, an assault house for practicing method of entry (MOE) techniques and train, subway and aircraft mock-ups. Training was also provided to five territorial police forces, including Thames Valley Police, West Yorkshire Police, West Midlands Police, Greater Manchester Police and Strathclyde Police (now Police Scotland), to form what was named the National Combined Response Firearms Teams (CRFT) capability for the London Olympics and Paralympic Games. The police forces received standardized training and also had standardized procedures, weaponry and equipment to enable interoperability. == CTSFO Network == The CTSFO Network provides a collective response capability to terrorist incidents from police forces with CTSFO teams through regional hubs based nationally. The national Combined Response Firearms Teams established for the Olympics was maintained after the closing of the Games forming the basis of the CTSFO Network. The CTSFO Network has 5 regional hubs outside London including Scotland. In 2013, West Midlands Police CTSFOs deployed to London to support the MPS following the Murder of Lee Rigby in Operation Pegboard. == MPS Specialist Firearms Command == The MPS Specialist Firearms Command (SC&O19;) has 7 CTSFO teams consisting of 1 sergeant and 15 constables, with 6 CTSFO Inspectors and an Operational Senior Manager with a reported strength of 130 officers. An operational CTSFO team works a 7 week shift pattern which includes night duty. On 30 June 2015, Operation Strong Tower was held in London over 2 days. The National Counter Terrorism Program exercise was the largest ever conducted in the United Kingdom and included the British Transport Police. == Equipment == CTSFOs are able to be deployed by air and sea. They can also be deployed using armoured vehicles such as the Jankel Guardian armoured vehicle based on a Ford F-450 chassis, as well as various other unmarked vehicles, including Toyota Land Cruisers, BMW X5s and Land Rover Discoveries. CTSFOs are also equipped with BMW F800GS motorcycles used to deploy quickly to terrorist incidents. They also use the following weapons: Make Model Cartridge Origin Image Glock 17, 17M, 19, 19M 9x19mm Austria SIG Sauer SIG MCX, SIG MCX Rattler .300 AC Blackout, 5.56x45mm Germany SIG Sauer SIG 516 5.56x45mm Germany Remington Remington 870 12-Gauge USA Heckler & Koch G3K 7.62x51mm Germany Accuracy International Arctic Warfare AT308, Arctic Warfare Magnum .308 Winchester, .338 Lapua Magnum United Kingdom Benelli M3 12-Gauge Italy Heckler & Koch HK69A1 40mm Grenade Germany == References == Category:2012 establishments in the United Kingdom",
 "title": "Counter Terrorist Specialist Firearms Officer"
}