{
 "id": "899017",
 "text": "MUJI is a Japanese retail company which sells clothing, furniture, general merchandise, foods and so on. == Their three principles == MUJI is based on three core principles, which remain unchanged to this day: # Selection of materials # Streaming of processes # Simplification of packaging They work hard on recycling, reducing production and packaging waste, and a no-logo or \"no-brand\" policy. They think simplicity and emptiness yield the ultimate universality, embracing the feelings and thoughts of all people. == History == 1980 Seiyu Co., Ltd.’s private brand “MUJI” was born 1985 MUJI Business Division was established 1989 Established Ryohin Keikaku Co., Ltd. 1990 Transferred the business rights of “MUJI” from Seiyu Co., Ltd. 1991 Started overseas expansion (first store in the UK, first store in Hong Kong) 1997 Received the PLMA (International PB Product Manufacturers Association) Excellence Award 2000 Established MUJI HOUSE Co., Ltd. (currently MUJI HOUSE Co., Ltd.) == Countries of operation == As of August 2021, 497 MUJI stores were opened in Japan and 571 stores were opened in 32 other countries. China (299), Hong Kong (20), Taiwan (54), Korea (39) England (7), France (7), Italy (6), Germany (8), Spain (4), Portugal (1), Ireland (1), Sweden (1), Poland (1), Switzerland (1), Finland (1), Denmark (1), US (10), Canada (9), Singapore (10), Malaysia (9), Thailand (22), India (3), Australia (5), Philippines (5), Vietnam (2), Kuwait (3), UAE (7), Saudi Arabia (5), Bahrain (2), Qatar (2), Oman (1) == Sustainability == MUJI contributes to the realization of a resource-recycling, nature-friendly society and a sustainable society through the products, services and activities it provides. As one of the examples, they collect unnecessary clothes at stores to circulate global resources and reduce waste. The collected clothes are recycled as raw materials for clothes, re-dyed and resold as \"ReMUJI\". As part of their efforts to reduce plastic waste, they have installed water dispensers in MUJI stores. This is a water supply service that uses tap water that anyone can use for free if people purchase a \"bottle of water that you pack yourself\" at the store or bring their own bottle. == MUJI’s expanding activity == MUJI wants to be a platform that responds sensitively to various issues that are occurring in society and solves them in a better direction from “conscience and creativity. This commitment drives them to various activities. Here are eight examples. The first one is “Resource Utilization”. As one of these activities, in order to support producers in areas where it is difficult to maintain paddy fields due to the aging of the population, they brewed sake by studying products with added value before general-purpose products, where prices are sluggish, with local people. The second one is “Building Connections”. This is a service for mobile sales in rural areas and direct delivery from production areas at online stores. The third one is “Public Design”. As a concrete example, In April 2015, MUJI set up sofa benches in the gate lounges and natural oak tables and chairs in the food court of the Narita Airport Terminal 3 to create a pleasant environment in which passengers can relax. The fourth is “Simple Food”. At MUJI Diner and Cafe & Meal MUJI, the person in charge goes to the production area and offers the ingredients selected. The fifth is “Reduce Waste”. One example is ReMUJI. This is an initiative to recycle products that customers have used for years and those products that are deemed unsellable as a result of a glitch during the manufacturing and distribution process. The sixth is “Social Initiative”. In Japan, MUJI provides support for earthquakes and heavy rain disasters, and in developing countries, they are working to revitalize the region. The seventh is “Long-lasting Homes”. MUJI Renovation Club and MUJI House provide a one-room space where people can easily change their life according to lifestyle changes and family growth. The last one is “Nature Conservation”. With the idea of “enjoying nature--naturally”, they operate three campsites and manage a total of approximately 700,000 tsubo of forests around the sites. == Reference == * https://ryohin-keikaku.jp/about- muji/principles/ * https://ryohin-keikaku.jp/about-muji/history/ * https://careers.muji.com/jp/recruit/about/data/ * https://ryohin- keikaku.jp/sustainability/ * https://ryohin-keikaku.jp/about-muji/activities/ __FORCETOC__ Category:Retail companies of Japan",
 "title": "MUJI"
}