{
 "id": "899014",
 "text": "Ice candle is a kind of candle made from water. It is fantastical and looks like a lamp-shade. It has been made in cold areas in winter. It melts quickly. == History == The Ice candle was first made in Shimokawa, Hokkaido. In Shimokawa, there are few days in a year when the temperature is 30 degrees below freezing. The members of “Egg of Columbus”, which is a Town Development Idea Semester, had thought about some ideas on how people could enjoy a cold winter with snow. In 1985, they found a sentence, “...the flame moves in the ice block, it changes to the natural lamp-shade quickly, the flame in the natural and pale clear glass lights up in the garden fantastically...” This is from “Live in north literary calendar, Northern area column” written by Ryuichi Ito who was a professor of Hokkaido University of education. He wrote about the candle which is made by Scandinavian Finland children. The Egg of Columbus got some hints to create the Ice candle from that sentence. In 1986, the Ice candle was created. They put a wish for people to be able to spend winter happily in it. In 1987, the Ice candle was introduced on TV. From around that time, townspeople have made it at their own homes. Now, the Ice candle is known by Japanese people nationwide and loved by people living in cold areas. == How to make == To make the Ice candle, you need a bucket, water and a cold environment to freeze water. At night the temperature is under -16 degrees, put water into the bucket, then get it outside and through the night. Next morning, turn it upside down and take out the ice if the water has almost frozen. Flow outside the water which couldn’t freeze. Put a candle into the hole of the ice. Not to break it, treat it carefully. It can be made with original ideas. To color it food coloring or paints can be used. A milk carton or a balloon can be used instead of a bucket. == Ice candle festival == The Ice Candle Festival is one of the festivals which is held in winter. In this festival, the venue is illuminated by many Ice candles. The place of origin is also Shimokawa in Hokkaido. Two years later after the Ice candle appeared, the name of Shimokawa Winter Festival, which was already there, was changed to Ice Candle Festival. In this festival, the Ice candle was put not only at the venue but also at each house in the town. In total, about 7000 Ice candles were put in the town. In addition, people who go to the festival enjoy eating food outside while seeing the Ice candles. Now, the Ice Candle Festival is held in various places in Japan. Lake-Yamanakako Ice Candle Festival in Yamanashi prefecture and Mt. Nobeyama Plateau Ice Candle Festival in Nagano prefecture are also famous festivals. == References == Shimokawa in Hokkaido. 下川町. (n.d.). 下川町 -道北・”ワクワク”が生まれるまち-. SHIMOKAWA Town. Retrieved January 16, 2022, from https://www.town.shimokawa.hokkaido.jp/ Egg of Columbus. ウェブマガジンカムイミンタラ. (2005, August 1). ウェブマガジン カムイミンタラ ~北海 道の風土・文化誌 :まちづくりアイディア研究会 コロンブスの卵 下川 幻想的なアイスキャンドルの灯火の中に 過疎の逆境をはね返す活力が燃えてくる.1984-2010 Rinyu Kanko. Retrieved January 16, 2022, from http://kamuimintara.net/detail.php?rskey=49199203t01 History. のーすもーる 北海道の森. (2004). 北海道下川町発祥★アイスキャンドル. Northmall. Retrieved January 16, 2022, from http://www.northmall.jp/shimokawa/icecandle/index.html How to make. しもかわ観光協会 SHIMOKAWA TIME. (n.d.). アイスキャンドルの作り方 | しもかわ観光協会. NPO法人し もかわ観光協会. Retrieved January 16, 2022, from http://www.shimokawa-time.net/event/ice-candle/ice-make/ Ice Candle Festival. しもかわ観光協会 SHIMOKAWA TIME. (n.d.). アイスキャンドル | しもかわ観光協会. NPO法人しもかわ 観光協会. Retrieved January 16, 2022, from http://www.shimokawa-time.net/event/ice-candle/ Ice Candle Festival. https://www.soumu.go.jp/main_sosiki/jichi_gyousei/c-gyousei/2001/kaso/pdf/h17hyousyou-01.pdf Lake-Yamanakako Ice Candle Festival. RESORT STAY LAKE YAMANAKAKO AREA 山中湖観光ガイド. (n.d.). 山中湖アイスキャンドルフェスティバル（Ice Candles Festival). 山中湖観光協会 公式ホームページ. Retrieved January 16, 2022, from https://lake-yamanakako.com/event/10384 Mt. Nobeyama Plateau Ice Candle Festival. 長野県公式観光サイト Go N A G A N O. (2007). 第２５回野辺山高原アイスキャンドルフェスティバル | イベント情報. Go NAGANO 長野県公式観光サイト. Retrieved January 16, 2022, from https://www.go-nagano.net/topics_detail11/id=17529 Category:Light sources Category:Japanese culture",
 "title": "Ice candle"
}