{
 "id": "899048",
 "text": "The L Taraval is a light rail line of the Muni Metro system in San Francisco, California. The line is currently not operating and replaced by buses through the end of 2024 for reconstruction along Taraval Street. ==Route description== The line begins at Wawona and 46th Avenue station (near the San Francisco Zoo), which is on a one-way loop on Vicente Street, 47th Avenue, Wawona Street, and 46th Avenue. It runs north on 46th Avenue to Taraval Street, then runs east on Taraval Street to 15th Avenue. The line then runs south one block on 15th Avenue, then east on Ulloa Street to West Portal station, where it tags along with all the other Muni Metro lines towards Embarcadero station. === Operation === Before the COVID-19 pandemic, the L Taraval operates 7 days a week, with train service beginning at 5 a.m. on weekdays, 6 a.m. Saturdays and 8 a.m. Sundays and running until 12:30 a.m. ==History== Muni's L Taraval line opened as a shuttle from West Portal to 33rd Avenue on April 12, 1919. It went further west along Taraval Street to 48th Avenue at Ocean Beach on January 14, 1923; that October 15, the shuttle service was replaced with larger streetcars running through to the Ferry Building. The L Taraval went south (turning off Taraval at 46th) to the San Francisco Zoo, the line's current outer terminus, on September 15, 1937. Every other streetcar line was routed to the new Transbay Terminal on January 15, 1939; they went back to the Ferry Building on January 1, 1941, but the Transbay Terminal became the inner terminal for all streetcars on June 6, 1948. ===Light rail operation=== The L switched to light rail operations as part of the opening of the Muni Metro system in 1980. While many streetcar lines switched to buses operations after World War II, the L Taraval remained a streetcar line due to its use of the Twin Peaks Tunnel. ==L Taraval Improvement Project== The L Taraval Improvement Project, originally called the L Taraval Rapid project, was to improve street safety and speed up trains. L Taraval Improvement Project construction began in August 2019. In September 2019, construction on the first phase of the project began. It took place between Sunset Blvd and 46th Avenue. The first phase was completed in July 2021. The second phase began in January 2022, with the second phase of the construction project taking place from Sunset Blvd to Ulloa St near West Portal station. This phase is expected to last through 2024. == References == == Other websites == * SFMTA - L Taraval Category:Muni Metro lines Category:1919 establishments",
 "title": "L Taraval"
}