{
 "id": "899033",
 "text": "Kona Coffee is one of the kinds of coffee that is made in Kona, Hawaii. And it is famous for being the second most expensive coffee in the world following the Blue Mountains. It is also rare and accounts for only less than 0.1% of all coffee production all over the world. == History == In 1825, the person who was one of the royal family of Hawaii went to Britain with the king of Hawaii and brought coffee plants on the way home. Those plants spread to many regions of Hawaii. In 1828, coffee plants were planted in the Kona region. After that, many farms were made there. But, because of pest damage and the price decline of coffee, most farmers quit their jobs. In this situation, Japanese immigrants moved to the Kona region and started to grow coffee to pay their land cost by coffee. This is the beginning of kona coffee. Now, Kona coffee is drunk at the dinner party in White House because this is the only coffee that is grown in America and the quality is quite high. == Distribution == Kona is one of the districts of Hawaii, and it is located western. Also, it is the only place which grows coffee in the U.S. states. It has a good natural environment for growing coffee thanks to some volcanoes that give soil many nutrients. Also, the unique oceanic climate of the Kona region, which is cooler and rains a lot more than that of flat ground, is good for growing coffee. Furthermore, there is a terroir that is called “ Kona coffee belt” that is around 32 km long and 3.2 wide area. In this territory, there are many farms and shops that sell Kona coffee directly from the farms and as much as 900,000 kg of coffee beans are harvested annually. == Kona blends and Flavor coffee == There are some blended Kona coffees that are made by mixing some kinds of coffee beans because 100% Kona coffee is quite expensive because of labor and land cost. In the Hawaii-grow coffee law, blended coffee that accounted for 10% of Kona coffee beans can be called Kona blended coffee. The coffees that have extra flavor like macadamia nut, vanilla and so on are also famous. Those flavor coffees are made by adding flavor during roasting. == Taste == This coffee has a less bitter taste and softly sourness. Because of its great sourness, this coffee is called “Queen of sourness”. You can feel the sweet and fresh smell like tropical fruits. Also Kona coffee is graded 5 stages according to the size of the beans. The bigger beans are graded better and those coffee beans have better taste. The biggest coffee beans are called “extra fancy” and there are only 15 % of Kona coffee. Following “fancy”, “No 1”, “select”, “prime”. Other coffee beans are called “ Hawaiian coffee”. Also, there are coffee beans which are called Peaberry. It is round beans although originally one is half round. Those coffee beans contain more nutrition. == References == # History of Kona Coffee https://www.honolulucoffee.com/blogs/news/history-of-kona-coffee-beans-in- hawaii # Distribution of Kona Coffee https://www.royalkonacoffee.com/growing- kona-coffee-in-hawaii/ # Grade of Kona Coffee https://www.konacoffeebeans.org/how-to/types-of-kona-coffee-beans-the-kona- coffee-grading-system # Peaberry https://onlinestore.tailoredcafe.jp/blogs/blog/peaberry # Hawaii-grown coffee law https://hawaiicoffeeassoc.org/Hawaii-Labeling-Laws # flavor coffee https://www.konacoffee.ne.jp/products/index/cid/3 Category:Coffee",
 "title": "Kona coffee"
}