{
 "id": "899205",
 "text": "Pinnochio is a 2022 American musical fantasy film directed by Robert Zemeckis from a screenplay by Zemeckis and Chris Weitz. The film, produced by Walt Disney Pictures, is a live-action adaptation of Walt Disney's 1940 animated film of the same name, which is itself based on the 1883 Italian book The Adventures of Pinocchio, by Carlo Collodi. The film stars Tom Hanks, Cynthia Erivo, and Luke Evans with Benjamin Evan Ainsworth, Joseph Gordon-Levitt, and Keegan-Michael Key in voice roles. Pinocchio was released on September 8, 2022, by Disney+. The film received negative reviews from critics. == Plot == A hobo cricket named Jiminy Cricket enters the home of an elderly woodcarver named Geppetto, accompanied by his pet kitten Figaro and pet fish Cleo, and finds that he has completed work on a marionette puppet he names Pinocchio. When Geppetto decides to retire for the night, he makes a wish on a star. A few hours later, the star magically brings Pinocchio to life and he is soon visited by the Blue Fairy, who tells Pinocchio that if he acts brave, truthful and selfless, he can be a real boy and she also appoints Jiminy the responsibility of being Pinocchio's conscience to teach him right from wrong. When Geppetto awakens and finds Pinocchio alive, he is at first shocked, but becomes overjoyed. After a few days, Geppetto decides that Pinocchio should attend school and sends him there. However, Pinocchio is soon approached by a con-artist fox and cat named \"Honest\" John and Gideon as they convince him that he should live a life of fame in order to truly be a real boy, when they really want to sell him to the puppet master Stromboli in exchange for wealth. Jiminy, who finds Pinocchio with the help of a seagull named Sofia, convinces Pinocchio to continue going to school. Unfortunately Pinocchio is thrown out of school on account of being a puppet, so he decides to go to Stromboli's after all and Jiminy can't stop him when John places a glass jar over him. At Stromboli's theater, Pinocchio befriends one of Stromboli's employees Fabiana and her puppet Sabina. Pinocchio puts on a good show for the crowd as they throw their cash to him, but Stromboli locks Pinocchio in a bird cage to prevent him from ever leaving, wanting to exploit Pinocchio for all he's worth. Soon, Stromboli's coach ends up freeing Jiminy from the jar and when he enters the coach, he manages to help Pinocchio escape when Pinocchio has him reach the keys to the lock on the cage by telling lies since that makes his nose grow. Geppetto, Figaro and Cleo go out to look for Pinocchio when he fails to come home for dinner. Soon, Pinocchio is swiped up by a coach full of children driven by a charismatic Coachman, who is taking the kids to Pleasure Island, an isle where misbehavior is encouraged. When they reach the island, Pinocchio slowly gets disturbed by the amount of cruelty the kids commit, much to the bemusement of an unruly boy named Lampwick. When Jiminy, who got separated from Pinocchio again, makes it to the island, he soon finds out that the kids their get turned into donkeys and the Coachman sells them to the salt-mines with help from his fog-like henchmen. Pinocchio witnesses Lampwick get transformed himself at a pool hall and he and Jiminy escape the island before the Coachman and his goons can get them, but not before Pinocchio gains a donkey's ears and tail. Pinocchio and Jiminy make it back to Geppetto's but find that he's not home because Sofia gave him a flyer of Pleasure Island to let him know where Pinocchio is and that he sold all of his clocks to buy a boat to go there. While trying to find Geppetto, Pinocchio reunites with Fabiana and Sabina, who tell him that Stromboli has been arrested and they have taken over his puppet show. They offer Pinocchio to join them, but Pinocchio declines, wanting to save his father, which makes his donkey parts disappear. Sofia pulls a rope for Pinocchio to hold out to the sea, where they soon find Geppetto in his boat. Just as they reunite, they are swallowed by a giant sea monster named Monstro. They take refuge in a giant boat in Monstro's stomach, and Pinocchio gets the idea to make him sneeze by starting a fire within him. The plan is successful, and Monstro sneezes them out, but he gives a chase that ends with him and the group crashing on dry land and rendering Geppetto unconscious. Pinocchio thinks Geppetto has died, and despairs before Geppetto comes to and soon tells Pinocchio that despite being a puppet, he has proven himself to be a true boy at heart for all that he's done, and they depart for home as Pinocchio slowly transforms into a real boy. Jiminy then breaks the fourth wall before ending the film. == Cast == * Tom Hanks as Geppetto, a lonely and heartbroken but kind, elderly Italian woodcarver and toymaker who builds and raises Pinocchio as if he were his real son and wishes for him to become a real boy. * Cynthia Erivo as The Blue Fairy, a wise magical fairy who brings Pinocchio to life, and promises to turn him into a real boy if he proves himself brave, truthful, and selfless. * Giuseppe Battiston as Stromboli, an initially kind-hearted but later abusive, greedy, and arrogant Italian puppeteer, who intends to force Pinocchio to perform onstage in order to make money. * Kyanne Lamaya as Fabiana, a former ballerina dancer and Sabina's puppeteer who works for Stromboli, as the result of a leg injury that ended her dancing career. * Jamie Demetriou as the aggressive headmaster who throws Pinocchio out of school due to the latter being a puppet. * Angus Wright as Signore Rizzi. * Sheila Atim as Signora Vitelli. * Luke Evans as the Coachman, the charismatic but cruel owner and operator of Pleasure Island, where trouble-making children are turned into donkeys and sold. * Lewin Lloyd as Lampwick, a naughty, spoiled and mischievous boy whom Pinocchio befriends on his way to Pleasure Island. He is turned into a donkey on Pleasure Island. === Voices === * Benjamin Evan Ainsworth as Pinocchio, an exuberant and endearing living wooden puppet carved by Geppetto, and brought to life by the Blue Fairy. He seeks to learn about right and wrong so that one day he will become a real boy. Geppetto created him out of grief for the death of his young son, who had died long before the film's events. * Joseph Gordon-Levitt as Jiminy Cricket, a cheerful, intelligent, wisecracking, optimistic and wise anthropomorphic cricket, who acts as Pinocchio's \"conscience\". * Lorraine Bracco as Sofia, a friendly seagull who befriends Jiminy. * Keegan-Michael Key as \"Honest\" John, a deceptive, dishonest, illiterate, poor and greedy anthropomorphic red fox who cons Pinocchio. He is always accompanied by his mute, dimwitted and bumbling anthropomorphic cat friend who serves as the film's comic relief, Gideon. * Jaquita Ta'le as Sabrina, Fabiana's puppet. Figaro the Cat, Cleo the Goldfish and Monstro the Sea Monster also appear. ==References== Category:2022 movies",
 "title": "Pinocchio (2022 live-action movie)"
}