{
 "id": "89937",
 "text": "Suharto (June 8, 1921 - January 27, 2008) was an Indonesian military, political leader, and second President of Indonesia. He served as president from 1967 to 1998. His presidency ended in 1998 amid mass protests, leading to his resignation. == Name == Suharto had only one name, like most Javanese. The spelling of \"Suharto\" reflects the modern Indonesian spelling system, although the general approach in Indonesia is to rely on the spelling preferred by the person concerned. At the time of his birth, the standard transcription used was \"Soeharto\", and he used the original spelling throughout his life. The international English-language press usually uses the spelling \"Suharto\", while the Indonesian government and media use the spelling \"Soeharto\". After completing the hajj in 1991, Suharto was given the Islamic name \"Mohammad\" by King Fahd of Saudi Arabia and received the honorific title Hajji. He used the name \"Haji Mohammad Soeharto\" after returning from Mecca on June 26, 1991 until his death. == Early life and Family == Suharto was born on June 8,1921 in a small house in the hamlet of Kemusuk, part of a village called Godean. Born to Javanese parents, he was the only child from his father's second marriage. His father, Kertosudiro, had two children from his previous marriage and was a village irrigation official. His mother, Sukirah, a local woman, was distantly related to Hamengkubuwono V through his first concubine. Five weeks after Suharto's birth, his mother suffered a nervous breakdown. As a result, Suharto was placed in the care of his paternal great-aunt, Kromodiryo, the midwife at his birth. Kertosudiro and Sukirah divorced early in Suharto's life. At the age of three, Suharto was returned to his mother, who had remarried a local farmer. Suharto spent his childhood by helping his stepfather in the rice fields. In 1929, Suharto's father, Kertosudiro, took him to live with his sister, who was married to an agricultural supervisor, Prawirowihardjo, in Wuryantoro, a small town south of Wonogiri. Over the following two years, Suharto was taken back to his mother in Kemusuk by his stepfather and then back again to Wuryantoro with his father, Kertosudiro. Prawirowihardjo took to raising the boy as his own son, which provided Suharto with a father-figure and a stable home in Wuryantoro. Suharto stayed in Wuryantoro for four years to attend the primary school. He also attended Quran-reading classes and joined the Muslim boy scout organization, Hizbul Wathan. == Political power == Suharto rose to power after a failed coup by the Indonesian Communist Party that killed six generals in the Indonesian Army. The first president of Indonesia, Sukarno, was seen by both the people and political elites as and wanted him to step down. Soeharto was appointed as President by the Indonesian Parliament in 1967. Suharto ruled over Indonesia for three decades with a strong central government. His time as president was known as \"Orde Baru\" period. As he took an anti-communist position, many Western governments supported him both in economic and political matters. After mass demonstrations in 1998, Soeharto was forced to resign. Suharto had been the face of Indonesia for over 30 years. His legacy remains hotly debated and contested both in Indonesia and abroad. == Death == Suharto was admitted to hospital on January 4; on 23 January, Suharto's health worsened further, as a sepsis infection spread through his body. His family consented to the removal of life support machines if his condition did not improve and he died on 27 January at 1:09 pm. He died at Pertamina Hospital in Jakarta, Indonesia of congestive heart failure. He was taken off life support. He was buried at a family mausoleum near Solo, Central Java. ==Soekarno, Suharto and Sarwo Edhie Wibowo/Slaughter of Indonesian \"Communists\"== The balance of power was shifted in favour of anti-Communists in December 1965, when personnel from both the Army Para-commando Regiment and 5th Brawijaya Military Region units arrived in Bali after having carried out killings in Java. Led by Suharto's principal troubleshooter, Sarwo Edhie Wibowo who with Javanese military commanders permitted Balinese squads (led by Anwar Congo, Adi Zulkadry, Safit Pardede) to kill until reined in. Taylor (2003), p. 359; Vickers (2005), p. 158; Vittachi (1967), p. 143 In contrast to Central Java where the Army encouraged people to kill the \"Gestapu\", Bali's eagerness to kill was so tremendous and spontaneous that, having provided logistic support initially, the Army eventually had to step in to prevent chaos.Friend (2003), p. 113. Sukarno's choice of Bali's provincial governor, Suteja, was recalled from office and accused of preparing a communist uprising, and his relatives were tracked down and killed.Taylor (2003), p. 358; Robinson (1995), pp. 299–302; Vittachi (1967), p. 143 A series of killings similar to those in Central and East Java were led by black- shirted PNI youth. For several months, militia death squads went through villages capturing suspects and taking them away. Hundreds of houses belonging to communists and their relatives were burnt down within one week of the reprisal crusade, with occupants being butchered as they ran from their homes. An early estimate suggested that 50,000 people, including women and children, were killed in this operation alone. The population of several Balinese villages were halved in the last months of 1965.Vittachi (1967), p. 143 All the Chinese shops in the towns of Singaraja and Denpasar were destroyed and many of their owners who were alleged to have financially supported the \"Gestapu\" killed. Between December 1965 and early 1966, an estimated 80,000 Balinese were killed, roughly 5% of the island's population at the time, and proportionally more than anywhere else in Indonesia.Friend (2003), p. 111; Taylor (2003), p. 358; Vickers (2005), p. 159; Robinson (1995), p. ch. 11. Most of the people killed had little to do with Communist Party or other allegations thrown at them. Soekarno continued to command loyalty from large sections of the armed forces as well as the general population, and Soeharto was careful not to be seen to be seizing power in his own coup. For eighteen months following the quashing of the 30 September Movement, there was a complicated process of political manoeuvres against Soekarno, including student agitation, stacking of parliament, media propaganda and military threats.Vickers (2005), page 160 In January 1966, university students under the banner of KAMI, begin demonstrations against the Soekarno government voicing demands for the disbandment of PKI and control of hyperinflation. The students received support and protection from the army. Street fights broke out between the students and pro-Sukarno loyalists with the pro-Soeharto students prevailing due to army protection.Ricklefs (1991), pages 288 - 290 In February 1966, Soekarno promoted Suharto to lieutenant-general (and to full general in July 1966). The killing of a student demonstrator and Soekarno's order for the disbandment of KAMI in February 1966 further galvanised public opinion against the president. On 11 March 1966, the appearance of unidentified troops around Merdeka Palace during a cabinet meeting (which Soeharto had not attended) forced Soekarno to flee to Bogor Palace (60 km away) by helicopter. Three pro-Soeharto generals, Major-General Basuki Rahmat, Brigadier-General M Jusuf, and Brigadier-General Amirmachmud went to Bogor to meet Soekarno. There, they persuaded and secured a presidential decree from Soekarno (see Supersemar) that gave Suharto authority to take any action necessary to maintain security. Using the Supersemar letter, Soeharto ordered the banning of PKI the following day and proceeded to purge pro-Soekarno elements from the parliament, the government and military, accusing them of being communist sympathisers. The army arrested 15 cabinet ministers and forced Soekarno to appoint a new cabinet consisting of Soeharto supporters. The army arrested pro-Soekarno and pro-communist members of the MPRS (parliament), and Soeharto replaced chiefs of the navy, air force, and the police force with his supporters, who then began an extensive purge within each service. In June 1966, the now-purged parliament passed 24 resolutions including the banning of Marxism–Leninism, ratifying the Supersemar, and stripping Soekarno of his title of President for Life. Against the wishes of Soekarno, the government ended the Konfrontasi with Malaysia and rejoined the United Nations (Soekarno had removed Indonesia from the UN in the previous year). Soeharto did not seek Soekarno's outright removal at this MPRS session due to the remaining support for the president among some elements of the armed forces.Schwarz (1992), p.25 By January 1967, Soeharto felt confident that he had removed all significant support for Soekarno within the armed forces, and the MPRS decided to hold another session to impeach Soekarno. On 22 February 1967, Soekarno announced he would resign from the presidency, and on 12 March, the MPRS session stripped him of his remaining power and named Soeharto acting president. Soekarno was placed under house arrest in Bogor Palace, little more was heard from him, and he died in near seclusion in June 1970. ==References== ==Other websites== *The Lasting Legacy of Suharto (at BBC) |- |- |- |- |- |- |- |- Category:1921 births Category:2008 deaths Category:Presidents of Indonesia Category:Former dictators Category:Indonesian Muslims",
 "title": "Suharto"
}