{
 "id": "899488",
 "text": "Elisabeth Hartnagel-Scholl (born 27 February 1920 in Forchtenberg as Elisabeth Scholl; died 28 February 2020 in Stuttgart) was the sister of Hans and Sophie Scholl. == Life == Elisabeth Hartnagel (then Scholl) grew up together with her siblings Inge (1917–1998), Hans (1918–1943), Sophie (1921–1943) and Werner (1922–1944). Her siblings initially enthusiastically followed National Socialism and were members of the League of German Girls or Hitler Youth, but later became dissatisfied with the Nazi Regime. == Scholl arrest and Sippenhaft == Her siblings Hans and Sophie were arrested on February 18, 1943. Elisabeth found this out from the newspaper. Four days later, on the 22nd February, Hans and Sophie Scholl and their fellow student Christoph Probst were sentenced to death in Munich by the People's Court chaired by Judge Roland Freisler, who came from Berlin for the sole purpose of the trial. Around 5 p.m., the convicts were beheaded in Munich's Stadelheim Prison. At the funeral of Hans and Sophie Scholl on the 24th February, the parents and siblings Inge, Elisabeth and Werner were present. Three days later, on Elisabeth's 23rd birthday, the Scholl family was taken into custody in Ulm, Elisabeth Scholl fell seriously ill in \"protective detention\" and was released after two months. She was the first of the Scholls to be released from prison. == After the War == In October 1945, she married Fritz Hartnagel (1917–2001). Fritz had been Sophie’s fiance, and after the execution Fritz and Elisabeth had been brought together from their shared grief at their loss. Together the couple had four children. After the death of her sister Inge Aicher-Scholl in 1998, Elisabeth began to speak about her siblings at schools and other educational institutions. She was commited to keeping the memory of her brother and sister alive. She died on February 28, 2020, one day after her hundredth birthday. ==References== Category:German centenarians Category:1920 births Category:2020 deaths Category:People from Baden-Württemberg",
 "title": "Elisabeth Hartnagel-Scholl"
}