{
 "id": "899550",
 "text": "Elizabethton is a city in, and the county seat of Carter County, Tennessee, United States. Elizabethton is the historical site of the first independent American government (known as the Watauga Association, created in 1772). The city is also the historical site of the Transylvania Purchase (1775) which was a major site during the American Revolutionary War for both the Battle of Musgrove Mill (1780) and the Battle of Kings Mountain (1780). It was within the secessionist North Carolina \"State of Franklin\" territory (1784–1788). == Geography == Elizabethton is located within the \"Tri-Cities\" area (encompassed by Bristol, Johnson City, and Kingsport) of northeast Tennessee. Their time zone is Coordinated Universal Time (UTC): UTC-5 (Eastern Time). According to the United States Census Bureau, the city has a total area of , of which is land and , or 1.51%, is water. == Weather == ==Education== Public Schools in Elizabethton are operated by Elizabethton City Schools. www.ecschools.net ===Colleges=== Satellite campuses of Northeast State Community College and Tennessee College of Applied Technology are located in the eastern part of the city off Tennessee State Route 91. Milligan College and Emmanuel Christian Seminary are located in the southwestern part of the city off Tennessee State Route 359. ==Notable people== * Paul Edward Anderson – Olympic gold medalist in weightlifting * Margaret Bowen – led the March 12, 1929, walkout of 523 female co-workers at American Glanzstoff, beginning the 1929 labor strikes * William Gannaway Brownlow – governor of Tennessee, U.S. senator, Methodist minister, and publisher of the Whig newspaper * Samuel P. Carter – U.S. Army general and U.S. Navy admiral * Charles Davis – University of Tennessee football player and Fox Sports analyst * Landon Carter Haynes – Speaker of the Tennessee House of Representatives, Confederate senator, lawyer, Methodist minister, and editor of the Tennessee Sentinel * Alec McLean – Olympic rower * Thomas Amos Rogers Nelson – early Elizabethton attorney and member of the U.S. House of Representatives. * Dayton E. Phillips – jurist and member of the U.S. House of Representatives * Jeff Reed – Major League Baseball catcher * Alfred A. Taylor – governor of Tennessee and congressman * Robert Love Taylor – governor of Tennessee and U.S. senator from Tennessee * Kenneth R. Wallace – United States Navy Blue Angels Pilot * Kent Williams – Speaker of the Tennessee House of Representatives * Jason Witten – National Football League tight end ==Related pages== * Tri-Cities, Tennessee ==References== Category:Cities in Tennessee Category:Tri-Cities, Tennessee Category:Carter County, Tennessee",
 "title": "Elizabethton, Tennessee"
}