{
 "id": "899537",
 "text": "The Tanzimat was a period of reforms in the Ottoman Empire that began in 1839 and ended in 1876. It intended to modernize the Ottoman Empire, and allowed for religious freedom. Tanzimat means \"re-ordering\" or \"restructuring\" the relationship between the state and the different communities, which were named subjects. The period started with the publishing of the Tanzimat edict which was written by Koca Mustafa Reşit Paşa under the order of Sultan Mahmud II. The period began in 1839, after Hatt-ı Şerif. It was followed by Hatt-ı Hümayun in 1856. The Constitution of 1876 made these two edicts into law. These laws limited the power of the Sultan. Some of the reforms were influenced by those in British Empire and France. == Hatt-ı Şerif (Noble Script or Edict of Gulhane) == The Hatt-ı Şerif was a proclamation, or edict, that was announced on 1856. It is considered the first act of the Tanzimat, which begun under Sultan Abdülmecid I. It is also known as the Edict of Gulhane or Noble Script. The Hatt-ı Şerif proclamation included three main demands. It began to limit the Sultan's power and also to establish the basis for equality among citizens of the Ottoman Empire. == Hatt-ı Humayun (Imperial Script) == This edict was established 18 days after the Crimea War (1853) on 18 February 1856. It guaranteed that all subjects of the Ottoman Empire would have security of life, honor, and fortune regardless of their ethnicity or religion. It promised equality for everyone who lived in the Ottoman Empire. It also reformed the tax system and the military. One of the goals of the edict was to weaken the power of the local governors and lay the groundwork for the creation of a modern army. == Land code of 1858 == The Land Code of 1858, also referred to as The Ottoman Imperial Land Code, modernized the taxation system and agriculture. It was divided into three sections, that included 132 articles. It changed the way people owned property. Individuals now had the right to own land. Before people farmed only to feed themselves and their family. With this change people began commercial agriculture to farm more food than they needed. They sold the extra food for money. This was good for the Sultan because he could collect more taxes. The Code added to the freedom of people who possessed land and made inheritance rules more fair for men and women. == Constitution of 1876 == In 1876, the Hatt-i Sherif and the Hatt-i Humayun were turned into law as part of the constitution. It was established during the reign of Sultan Abdulhamid II. The constitution established two chambers of government, an elected chamber called the Chamber of Deputies, and a senate that was appointed by the Sultan. The constitution was partly modelled on the 1831 Belgian constitution, which democratized some aspects of Ottoman society. However, the Sultan maintained significant amounts of power. The Sultan was able to declare war, appoint and dismiss ministers, approve law, and form and dismiss the Chamber of Deputies. These parts of the constitution meant that the executive branch of government - the Sultan - held significantly more power than the elected branch. Another important outcome of the constitution was the declaration that all religions in the Empire were now equal citizens. Islam remained the state religion, however the system of the millet was abolished. ==References== Category:19th century in the Ottoman Empire",
 "title": "Tanzimat"
}