{
 "id": "899672",
 "text": "Olena Volodymyrivna Zelenska (; born 6 February 1978) is a Ukrainian screenwriter serving as the first lady of Ukraine since 2019 as the wife of President Volodymyr Zelenskyy. == Biography == === Early life and education === Olena Kyiashko was born on 6 February 1978 in Kryvyi Rih, Soviet Ukraine. She studied at Kryvyi Rih National University, where she met her future husband, Volodymyr Zelenskyy. In 2000, she graduated from Kryvyi Rih Technical University and received a specialist diploma. She also graduated from a music school with a piano class. === Marriage and family === In 2003, she and her husband got married. They have two children named Oleksandra and Kyrylo. == First Lady of Ukraine (2019–present) == On August 23, 2021, the First Kyiv Summit of First Ladies and Gentlemen took place in Kyiv at the initiative of Zelenska. Eleven first ladies from different countries joined the event. The main topic of discussion was the COVID-19 pandemic. On 19 July 2022, Zelenska started her visit to the United States. On the first day of the visit, Zelenska met with the U.S. Secretary of State Antony Blinken and Samantha Power. On the second day of the visit, she held a meeting with U.S. First Lady Jill Biden at the White House. Zelenska was also met U.S .President Joe Biden and U.S. Vice President Kamala Harris. Zelenska also addressed the U.S. Congress on the second day of her visit. She became first presidential wife of another country to address the U.S. Congress. === Olena Zelenska Foundation === On 22 September 2022, Olena Zelenska presented her foundation at a charity evening in New York City during the 77th UN General Assembly. The Foundation has three key directions: medicine, education and humanitarian aid. == Awards and honors == She was honored as one of the BBC 100 Women in December 2022. In November 2023, Zelenska was named one of the 25 most influential women in the world. == References == Category:1978 births Category:Living people Category:First Ladies of Ukraine Category:Ukrainian screenwriters",
 "title": "Olena Zelenska"
}