{
 "id": "899677",
 "text": "Affiliated Computer Services Inc. (ACS) was a company that provided information technology services as well as business process outsourcing solutions to businesses, government agencies, and non-profit organizations. ACS was based in Dallas, Texas. Founded in 1988, by Darwin Deason, ACS operated in nearly 100 countries, generating over $6 billion per year. Affiliated Computer Services, Inc. (ACS) was founded by Darwin Deason in 1988. At first created as a data services provider to the financial services industry, Deason expand ACS's influence on the communications, education, financial services, government, healthcare, insurance, manufacturing, retail, and travel and transportation industries. In 1995 ACS became a public company and stopped bank data processing. By FY 1996 ACS became the fourth-largest commercial outsource provider in the United States. In February 2010, following its purchase by Xerox, ACS was replaced by Urban Outfitters on the Standard & Poor 500 Index. On July 1, 2015, Xerox sold the IT Outsourcing business to Atos. Xerox pointed out that ITO did not line up with its vision of integration of BPO (business process outsourcing) and the legacy document handling concerns. On July 29, 2016, the US District Court for the Southern District of New York dismissed the suit at law by Matthew Sciabacucchi. The lawsuit contended that some Xerox Corp directors and officers had cancelled their fiduciary duties because of purchasing ACS for $6.4 billion in 2010. On January 3, 2017, a company called Conduent was spun off as a divestiture from Xerox. The business scope of Conduent was generally identical to that of the former Affiliated Computer Services (ACS). In February 2020 efforts to take down the company's former headquarters building in Dallas failed. == SEC Investigation == In 2006, the U.S. Securities and Exchange Commission (SEC) reported ACS that they were conducting an informal investigation into certain stock option grants made by the company from October 1998 through March 2005. This was associated with the inadequate and unethical practice of reverse back-dating to specific low points available. ACS said the managers incorrectly backdated the price of grant options from 1994 to 2005. During that time, ACS said they chose days on purpose the days when ACS's shares fell a dip as the effective date for the options, making them more valuable when exercised. Rich, King, and Edwards \"used retrospect to select favorable grant dates,\" ACS said in a statement. CEO Mark King and CFO Warren Edwards, both involved in the wrongdoing. So they immediately resigned. The former CEO Jeff Rich previously retired at the beginning of the year. == References == Category:1988 establishments in the United States Category:American technology companies Category:Companies based in Dallas",
 "title": "Affiliated Computer Services"
}