{
 "id": "899777",
 "text": "The 2021 season is the Los Angeles Rams' 84th season in the National Football League and the fifth under head coach Sean McVay. ==Draft== 2021 Los Angeles Rams Draft Round Selection Player Position College 2 57 Tutu Atwell WR Louisville 3 103 Ernest Jones LB South Carolina 4 117 Bobby Brown III DT Texas A&M; 130 Robert Rochell CB Central Arkansas 141 Jacob Harris WR UCF 5 174 Earnest Brown IV DE Northwestern 7 233 Jake Funk RB Maryland 249 Ben Skowronek WR Notre Dame 252 Chris Garrett LB Concordia–St. Paul ==Regular season== ===Schedule=== The Rams' 2021 schedule was announced on May 12. Week Date Opponent Result Record Venue Recap 1 September 12 Chicago Bears W 34–14 1–0 SoFi Stadium Recap 2 September 19 at Indianapolis Colts W 27–24 2–0 Lucas Oil Stadium Recap 3 September 26 Tampa Bay Buccaneers W 34–24 3–0 SoFi Stadium Recap 4 October 3 Arizona Cardinals L 20–37 3–1 SoFi Stadium Recap 5 at Seattle Seahawks W 26–17 4–1 Lumen Field Recap 6 October 17 at New York Giants W 38–11 5–1 MetLife Stadium Recap 7 October 24 Detroit Lions W 28–19 6–1 SoFi Stadium Recap 8 October 31 at Houston Texans W 38–22 7–1 NRG Stadium Recap 9 November 7 Tennessee Titans L 16–28 7–2 SoFi Stadium Recap 10 at San Francisco 49ers L 10–31 7–3 Levi's Stadium Recap 11 Bye 12 November 28 at Green Bay Packers L 28–36 7–4 Lambeau Field Recap 13 December 5 Jacksonville Jaguars W 37–7 8–4 SoFi Stadium Recap 14 at Arizona Cardinals W 30–23 9–4 State Farm Stadium Recap 15 Seattle Seahawks W 20–10 10–4 SoFi Stadium Recap 16 December 26 at Minnesota Vikings W 30–23 11–4 U.S. Bank Stadium Recap 17 January 2 at Baltimore Ravens W 20–19 12–4 M&T; Bank Stadium Recap 18 January 9 San Francisco 49ers L 24–27 12–5 SoFi Stadium Recap Note: Intra-division opponents are in bold text. ===Standings=== ====Division==== ====Conference==== ==Postseason== ===Schedule=== Round Date Time () Opponent (seed) Result Record Venue TV Recap Wild Card 5:15 p.m. Arizona Cardinals (5) W 34–11 1–0 SoFi Stadium ESPN Recap Divisional January 23 12:00 p.m. at Tampa Bay Buccaneers (2) W 30–27 2–0 Raymond James Stadium NBC Recap NFC Championship January 30 3:40 p.m. San Francisco 49ers (6) W 20–17 3–0 SoFi Stadium Fox Recap Super Bowl LVI February 13 3:30 p.m. vs. Cincinnati Bengals (A4) W 23–20 4–0 SoFi Stadium NBC Recap ==Notes== Category:2021 National Football League season by team Category:Los Angeles Rams",
 "title": "2021 Los Angeles Rams season"
}