{
 "id": "899878",
 "text": "Spanish Sahara, now known as Western Sahara, was a Spanish colony in North Africa. The region borders Morocco, Algeria, and Mauritania. It was colonized by Spain in the late 19th century and was under Spanish control until the mid-1970s. == Colonial era == In the late 1800s, European countries wanted more land in Africa, an era known as the \"Scramble for Africa.\" Spain took over the area called Western Sahara in 1884. They controlled the coast and started large mines to get phosphate, an important mineral. == Path to independence == After World War II, people around the world wanted freedom, and movements against colonial rule grew everywhere. In Western Sahara, the desire for independence got stronger in the 1960s. The United Nations said the Sahrawi (the local people) should be allowed to decide their own future, calling for decolonization and self-determination. == Green march and Madrid accords == In 1975, Spain planned to leave because of pressure from many countries and the Sahrawi. That year, Morocco sent many people in a march (called the \"Green March\") to claim the area. Spain, Morocco, and Mauritania then made a deal called the Madrid Accords to split the land between Morocco and Mauritania. The goal of this accord was to resolve the conflict. == Conflict and current status == Spain leaving did not lead to peace. The Polisario Front, representing the Sahrawi and backed by Algeria, declared the Sahrawi Arab Democratic Republic (SADR) and fought against Morocco and Mauritania for independence. In 1979, Mauritania left the fight due to instability, but Morocco stayed in control of most of the territory. Today, the fight goes on. Morocco offers some self-rule but the Polisario Front rejects this solution. They only want full independence for the SADR. The United Nations wants a vote to decide what will happen but there is no agreement yet. Several UN resolutions have called for a referendum but disagreements on voter eligibility and status of the territory have prevented the referendum from taking place. International efforts, including many rounds of negotiations and special envoys, continue to seek a peaceful solution. == Sahrawi culture == Western Sahara's culture is a mix of Arab, Berber, and African influences. The Sahrawi people were mostly nomads who moved around with their camels. Despite the conflict, the Sahrawi maintain their unique customs, language, and traditions. The history of Spanish Sahara includes colonial rule, strong resistance, and an ongoing fight for freedom. The international community's role in finding a peaceful solution remains crucial. The future of the region is still not decided as efforts go on to find a diplomatic solution. == References == Category:History of Spain Category:Western Sahara Category:Spanish Empire Category:Former colonies in Africa",
 "title": "Spanish Sahara"
}