{
 "id": "899810",
 "text": "The 2021 season was the Pittsburgh Steelers' 89th season in the National Football League and their 15th under head coach Mike Tomlin. ==Draft== 2021 Pittsburgh Steelers Draft Round Selection Player Position College Notes 1 24 Najee Harris RB Alabama 2 55 Pat Freiermuth TE Penn State 3 87 Kendrick Green C Illinois 4 128 Dan Moore Jr. OT Texas A&M; 4 140 Buddy Johnson ILB Texas A&M; Compensatory selection 5 156 Isaiahh Loudermilk DT Wisconsin from Dallas via Philadelphia and Miami 6 216 Quincy Roche OLB Miami from Tampa Bay 7 245 Tre Norwood CB Oklahoma from Miami 7 254 Pressley Harvin III P Georgia Tech from Baltimore ==Regular season== ===Schedule=== The Steelers' 2021 schedule was announced on May 12. Week Date Opponent Result Record Venue Recap 1 September 12 at Buffalo Bills W 23–16 1–0 Highmark Stadium Recap 2 September 19 Las Vegas Raiders L 17−26 1–1 Heinz Field Recap 3 September 26 Cincinnati Bengals L 10–24 1–2 Heinz Field Recap 4 October 3 at Green Bay Packers L 17–27 1–3 Lambeau Field Recap 5 October 10 Denver Broncos W 27–19 2–3 Heinz Field Recap 6 October 17 Seattle Seahawks W 23–20 3–3 Heinz Field Recap 7 Bye 8 October 31 at Cleveland Browns W 15–10 4–3 FirstEnergy Stadium Recap 9 Chicago Bears W 29–27 5–3 Heinz Field Recap 10 November 14 Detroit Lions T 16–16 5–3–1 Heinz Field Recap 11 November 21 at Los Angeles Chargers L 37–41 5–4–1 SoFi Stadium Recap 12 November 28 at Cincinnati Bengals L 10–41 5–5–1 Paul Brown Stadium Recap 13 December 5 Baltimore Ravens W 20–19 6–5–1 Heinz Field Recap 14 at Minnesota Vikings L 28–36 6–6–1 U.S. Bank Stadium Recap 15 December 19 Tennessee Titans W 19–13 7–6–1 Heinz Field Recap 16 December 26 at Kansas City Chiefs L 10–36 7–7–1 Arrowhead Stadium Recap 17 Cleveland Browns W 26–14 8–7–1 Heinz Field Recap 18 January 9 at Baltimore Ravens W 16–13 9–7–1 M&T; Bank Stadium Recap Note: Intra-division opponents are in bold text. ===Standings=== ====Division==== ====Conference==== ==Postseason== ===Schedule=== Round Date Opponent (seed) Result Record Venue Recap Wild Card January 16, 2022 at Kansas City Chiefs (2) L 21–42 0–1 Arrowhead Stadium Recap ==References== Category:2021 National Football League season by team Category:Pittsburgh Steelers",
 "title": "2021 Pittsburgh Steelers season"
}