{
 "id": "899835",
 "text": "The Sabra and Shatila massacre refers to the killings of Palestinian refugees and Lebanese Shias at the Sabra and Shatila refugee camp that took place in Beirut, Lebanon, the 16, 17 and 18 of September, 1982, during the Lebanese Civil War. Israeli-backed Phalange militia killed between 2,000 and 3,500 Palestinian refugees and Lebanese civilians in two days. Those killed were nearly all Palestinian refugees, and the slaughter was carried out by the decision of the Lebanese Christian political party by their Phalangist militia. The massacre is today referred to as Sabra and Shatila after the names of the refugee camps in the attack. == Historical Context: The Lebanese Civil War == === Before the War: A Strained Situation === The Lebanese civil war took place in a context of extreme tensions all around Lebanon. The politicians were corrupted and could not agree on the country's policy, for example on subjects such as international policy and on the Palestinian question, in which many countries of the Middle-East region were involved. Lebanese society was divided between religious groups. Certain religious groups had certain political rights and occupied specific functions that could not be taken by a member of another group. The Christian group was monopolizing the political life while Muslim groups were put aside.Nalbantian, T. (2022). The Lebanese Civil War. History of the Modern Middle East. Leiden; Leiden University Faculty of Humanities. There is also an important Palestinian presence in the south of the country. Palestinians are mainly refugees. They are also numerous members of the PLO (Palestine Liberation Organization), who established in south Lebanon in order to lead terrorist operations from there. Therefore, the different classes of society are also divided about the Palestinian question that is supported by some but not by others. The economic situation is not great as well since unemployment is at a very high rate. === The context before the Sabra and Shatila massacre === Right before the massacre of the two camps, the President of Lebanon, Bachir Gemayel, was murdered in a bombing attack on the 14 of September 1982. He also was the leader of the Lebanese Phalanges. They took control and closed the west part of Beirut, including the Sabra and Shatila camps. Their invasion was helped by Israeli forces in the pretext of maintaining order in the capital. == The Factions Involved in the Massacre of Sabra and Shatila == There were different factions involved in the Sabra and Shatila massacre: The Lebanese phalanges, the Israeli army, and the Palestinian refugees, inhabitants of the camps. === The Lebanese Phalanges === Formally known as the Christian Maronite Lebanese Forces, the Lebanese Phalanges were the primary Christian militia involved in the Lebanese Civil War. The Maronites first came to Lebanon in an attempt to escape persecution in Syria. The group was able to build a relationship with European powers, specifically maintaining a connection with France. In addition to the Phalangist militia, there was also a strong Phalangist political party, led most prominently by Pierre Gemayel. One of the key leaders of the Phalangist military faction was Bachir Gemayel, son to Pierre, and eventually elected president, though he was assassinated in mid- September of the same year he was elected, before having the opportunity to actually take office. His murder was carried out by bombing and perpetrated by Habib Tanious Shartouni, whose allegiance lay with Syria. He is known to have been a member of the Syrian Social Nationalist Party. Another was Elie Hobeika, who was known to have a close relationship with Gemayel and served as a military leader for the Lebanese forces at the time of the war. === The Israeli Army === in 1982 Israel sent troops to Lebanon after the murder attempt on Shlomo Argov, the Israeli ambassador. This gave Israel a pretext to invade the south of Lebanon and the capital. This operation was called \"Peace for Galilee\". Its goal was to drive out the PLO fighters who established in the country. Though the murder attempt on Shlomo Argov was not perpetuated by the PLO, it gave to Israel the justification to attack Palestinian fighters in Lebanon. The Israeli army slowly advanced on Beirut where they joined their military forces with the Syrian forces already involved in the conflict and with the Lebanese Phalanges. They did not enter the capital until a cease-fire agreement was set up by the USA in September. After the assassination of Bachir Gemayel Israel broke the agreement. They allowed the Lebanese militia to enter the camp, despite the agreement to protect the Muslim population. === The Palestinian Refugees and Fighters of the PLO === The Palestine Liberation Organization, started in 1964 with the intention of creating a Palestinian state. The organization had directly opposition to and conflict with the State of Israel. Both Palestinian refugees and fighters had seen large amounts of violence. They sought to establish a place for themselves in Southern areas of Lebanon and in Beirut. The Palestinian refugees' presence in Jordan played a significant role in the rising tension which eventually led to the Lebanese Civil War. They were the target of several forces, including the Maronites, accompanied by the Lebanese army and several other militias, as well as the Israeli army. == The Proceedings: When, Where, How and Why the Massacre Occurred == In June of 1982, the Israeli army invaded Lebanon in an attempt to obliterate the Palestinian Liberation Organization. Despite steadfast attempts at resistance from the Palestinian-Lebanese side, violence and death was increasing and other actors became involved. Along with several others, the Lebanese prime minister, Shafik Wazzan, and an American representative named Philip Habib were making attempts to diffuse the issue diplomatically. On 11th August 1982, they came to an accord which said that the PLO would be forcefully removed from Beirut under the direction of both American and European forces, specifically France and Italy. Providing this evacuation of Palestinian troops, the Israeli government said that their army would not infiltrate west Beirut or perpetrate further attack. They also pledged, in conjunction with the United States government, the safety of the Palestinians and people inside the refugee camps. The Shatila camp, located in west Beirut, had been a standing Palestinian refugee camp since the 1940s. Over time, the camp had grown to also include the nearby Sabra neighborhood, and both Sabra and Shatila were in the direct path of the violence by the Israeli forces. However, because of the formal agreement reached by Philip Habib and Shafik Wazzan, the camps and the Palestinian civilians' security should have been safeguarded. This changed following the assassination of Lebanese president Bachir Gemayel. That prompted the Israeli army and the Phalangist militia, whose loyalty was strongly tied to Gemayel, to take action that they considered necessary to regain control in Beirut and protect the area and people within it. This claim of needing to acquire security and safeguard against terrorism was the veneer Israeli forces employed to justify the disruption of their previous promises and the acts of brutality which followed. Many other parties, including the United States, were implicated in the events of the next few days. On 15th September, the Israeli army was the first power to occupy Sabra and Shatila, closing all access out of the camps and effectively confining thousands of civilians and refugees inside. From 16th to 18th September 1982, the camps were then subjected to an onslaught of violence, rape, abuse, and mass murder. Other groups were involved, including the Lebanese Forces and other right-wing militias. The massacre was an enormous loss of human life, consisting of almost entirely Palestinian refugees and Lebanese civilians, including many women and children, hospital patients, and public servants such as medical staff. There is still uncertainty as to precisely how many were killed in the massacre; some state the death toll was as low as 300, some claim it's nearer to 1,700, while other estimates range as high as 4,500 victims. Most sources say that at least 3,000 innocent people were murdered in this 3-day period. == The Impact of the Massacre == === International reactions === The massacre was highly denounced by international powers and by the israeli population. The United Nations said the event was a \"high scale massacre\" and as a \"genocide\". It also pointed out the responsibility of Israel, while Israeli people demonstrated in the streets. An international inquiry commission, the Mc Bride Commission, was opened. Under pressure, Israeli government was forced to open its own inquiry commission, the Kahan Commission. The Mc Bride commission, did not establish the direct responsibility of Israel in the massacre. However, it makes Israel responsible for letting the Phalanges enter the camps and helping the massacre by lighting the camps at night. This allowed the massacre to continue even after nightfall. Following the Kahan Commission, Israel recognized having surrounded and controlled the camps during the massacre. However, it denies knowing that the massacre was happening. Ariel Sharon, the Israeli minister of Defense, was several times blamed for the massacre. He was sued in Belgium with other Israeli supervisors. However, the plaint would not be followed. === Lebanese responsibility === Elie Hobeka was particularly blamed as the one who ordered the massacre by the Phalanges. He was the leader of the Lebanese secret services. Today, his role as the main responsible of the massacre is fully acknowledged. He died in a bombing in 2002 as he was involved in the Belgian trial for the accusation against Ariel Sharon. === Testimonies === Many scholars and journalists have written about the massacre. Also, numerous testimonies depicting the massacre have spread through journalist's work. Many testimonies say that Israeli soldiers saw the massacres occurring. We can illustrate that through the testimonies collected by Pierre Péan, or Leila Shahid. These allegations however could have been discussed and their authenticity has not always been proved. In addition to their memorial role, they are also used by journalists and scholars who study the importance of the massacre. Seth Anziska has worked on American actions during the war. He based his works on the communications between Israel and the USA and the record of the military movements. == Cultural Evocations == === Cinema === * Waltz with Bashir, an animated movie realized by Ari Foldman in 2008, tells the autobiographical story of an Israeli soldier who served during the Israeli intervention in Lebanon, in 1982, and who was involved in assisting Lebanese Phalanges during the Sabra and Shatila massacre. * Massaker, realized by Monika Borgmann, Lokman Slim and Hermann Theissen in 2004. The massacre of Sabra and Shatila is narrated by soldiers who have been directly involved in the killings. * Al-Manam, realized by Mohammad Malas, is a documentary about Palestinian refugees during the Lebanese civil war. * Incendies, realized by Denis Villeneuve, refers without telling it explicitely to a scene of the Sabra and Shatila massacre. === Literature === * Sabra and Chatila, by Bayan Nuwayed, Pluto Press, Londres, 2004. * Le Quatrième Mur, by Sorj Chalandon, 2013. * Anima, by Wajdi Mouawad, 2015. * Quatre heures à Chatila, by Jean Genet, 1991. * From Israel to Damascus the Painful Road of blood, betrayal, and deception, by Robert Maroun Hatem. Often known colloquially as \"Cobra\", the author of this biography was one of the bodyguards to the book's main person of interest. It is the account of Phalangist leader Elie Hobeika's life, in which his former employee, Hatem, portrays the violence of the war from an inside perspective and offers a decidedly negative overall picture of Hobeika. == Bibliography == * Al-Madfai, M. R. (1993). Jordan, the United States, and the Middle East Peace Process, 1974-1991. Cambridge University Press. * Al-Shaikh, Z. (1984). Sabra and Shatila 1982: Resisting the massacre. Journal of Palestine Studies, 14(1), 57–90. https://doi.org/10.2307/2537057. * Anderson, Betty. A History of the Modern Middle East: Rulers, Rebels, and Rogues. Stanford: Stanford University Press, 2016. * Anziska, S. (2012, September 17). A preventable massacre. The New York Times. https://www.nytimes.com/2012/09/17/opinion/a-preventable-massacre.html. * Anziska, S. (2018). Preventing palestine: A political history from Camp David to Oslo. Princeton University Press. * Aulas, M.-C. (1985). The Socio- Ideological Development of the Maronite Community. The Emergence of the Phalanges and the Lebanese Forces. Arab Studies Quarterly, 7(4), 1–27. http://www.jstor.org/stable/41857790. * Bassil-Morozow, H. (2016). Waltz with Bashir. Journal of Analytical Psychology, 61(5), 712–714. https://doi.org/10.1111/1468-5922.12267. * Documents and Source Material: Documents on Palestine and the Arab-Israeli Conflict. (1982). Journal of Palestine Studies, 11/12, 292–349. https://doi.org/10.2307/2538386. * Fisk, R. (2012, September 15). The forgotten massacre. The Independent. https://www.independent.co.uk/news/world/middle-east/the-forgotten- massacre-8139930.html. * Hagopian, E. C. (1983). Redrawing the Map in the Middle East: Phalangist Lebanon and Zionist Israel. Arab Studies Quarterly, 5(4), 321–336. http://www.jstor.org/stable/41857693. * Harrison, O. C. (2021). Sounds of Palestine. Sounds Senses, 181. * Hatem, R. M. (1999). From Israel to Damascus the Painful Road of blood, betrayal, and deception. Pride International Pub. * Hiro, D. (1993). Lebanon: Fire and embers: A history of the lebanese Civil War. Weidenfeld and Nicolson. * Ḥūt Bayān Nuwayhiḍ. (2004). Sabra and Shatila September 1982. Pluto Press. * Malley, M. (2018). The Lebanese Civil War and the Taif Accord: Conflict and Compromise Engendered by Institutionalized Sectarianism. The History Teacher, 52(1), 121–159. https://www.jstor.org/stable/26646477. * Malone, Linda A. (1985). The Kahan Report, Ariel Sharon and the Sabra-Shatila Massacres in Lebanon: Responsibility Under International Law for Massacres of Civilian Populations. Faculty Publications, 587. * Nalbantian, T. (2022). The Lebanese Civil War. History of the Modern Middle East. Leiden; Leiden University Faculty of Humanities. * Palestinian Journeys. (1982, September 16). Sabra and Shatila, 1982. Palestinian Journeys. https://www.paljourneys.org/en/timeline/highlight/169/sabra-and-shatila-1982 . * Reuters. (1982, October 3). Phalangists identify bomber of Gemayel as Lebanese leftist. The New York Times. Retrieved May 14, 2022, from https://www.nytimes.com/1982/10/03/world/phalangists-identify-bomber-of- gemayel-as-lebanese-leftist.html. * Shahid, L. (2002). The Sabra and Shatila Massacres: Eye-Witness Reports. Journal of Palestine Studies, 32:1, 36-58, DOI: 10.1525/jps.2002.32.1.36. * Slaieh, E. N. (1974). THE JORDANIAN- PALESTINIAN CIVIL WAR OF 1970 : A QUEST FOR JUSTICE AND PEACE. India Quarterly, 30(1), 42–59. http://www.jstor.org/stable/45070090. * The Irish Times. (2002, January 26). Led Christian Lebanese militia which massacred 2,000 refugees. The Irish Times. https://www.irishtimes.com/news/led- christian-lebanese-militia-which-massacred-2-000-refugees-1.1048147. * United Nations High Commissioner for Refugees, Minorities at risk Project. (2004). Chronology for Maronite Christians in Lebanon. Refworld. https://www.refworld.org/docid/469f38b3c.html. * Wakim, J. (2021). The Lebanese Civil War 1975–90. Contemporary Arab Affairs, 14(3), 105–124. https://doi.org/10.1525/caa.2021.14.3.105. ==References== Category:Massacres of Palestinians Category:Massacres in Asia Category:Massacres of Muslims Category:Lebanese Muslims Category:Lebanese Christians Category:Lebanese Civil War Category:Incidents of violence against women",
 "title": "Sabra and Shatila massacre"
}