{
 "id": "900001",
 "text": "DWET-TV (channel 5) is a television station in Metro Manila, Philippines, serving as the flagship of the TV5 network. It is owned and operated by the network's namesake corporate parent; TV5 also provides certain services to RPTV flagship DWKB-TV (channel 22) and One Sports flagship DWNB-TV (channel 41) under an airtime lease agreement with station owners Radio Philippines Network and Nation Broadcasting Corporation, respectively. The three stations share studios at the TV5 Media Center, Reliance cor. Sheridan Sts., Brgy. Highway Hills, Mandaluyong, Metro Manila. DWET-TV maintains its alternate studios and hybrid analog/digital transmitting facilities are located at the TV5 Complex, 762 Quirino Highway, Brgy. San Bartolome, Novaliches, Quezon City and its alternate digital transmitting facility is located at Block 3, Emerald Hills, Sumulong Highway, Antipolo, Rizal (shared with NBC-owned sister stations DWNB-TV, as well as True FM flagship DWLA 105.9 MHz). ==Digital television== ===Digital channels=== DWET-TV's digital signal operates on UHF Channel 18 (497.143 MHz)1 and broadcasts on the following subchannels: Channel Video Aspect Short name Programming Notes 5.01 480i 16:9 TV5 TV5 Commercial broadcast (10 kW) 5.02 RPTV RPTV (Mirror feed from DTT 19) 5.03 One Sports One Sports 5.35 240p One Seg S1 TV5 1seg broadcast Prior to the NTC's assignment of channels 14 to 20 for major broadcast networks, the station utilized UHF Channel 51 (695.143 MHz)2 for its digital TV operations, although it remains active to this day. Channel Video Aspect Short name Programming Notes 5.01 480i 16:9 TV5 TV5 Commercial broadcast (5.5 kW) 5.02 RPTV RPTV Mirror feed from DTT 19) 5.03 One Sports One Sports 5.35 240p One Seg S1 TV5 1seg broadcast 16:9 widescreen output. The One Sports subchannel feeds, however, converted to widescreen broadcasting less than a year later, on January 22, 2024. Upon the launch of RPTV on February 1, 2024, it replaced the subchannel space of One PH, which reverted its availability to pay TV and streaming. ;Notes 1 – Permanent digital frequency assigned by NTC (through a Memorandum Circular). 2 – Licensed to Mediascape (Cignal TV), Inc.2011 Philippine Yearbook. Page 46. == Areas of coverage == === Primary areas === * Metro Manila * Cavite * Bulacan * Laguna * Rizal === Secondary areas === * Pampanga * Nueva Ecija * Tarlac * Portion of Pangasinan * Portion of Bataan * Portion of Batangas * Portion of Quezon ==Related pages== * TV5 * One Sports * RPTV * List of TV5 stations * 92.3 Radyo5 True FM == References == Category:Filipino television stations",
 "title": "DWET-TV"
}