{
 "id": "900097",
 "text": "The 2021 season was the Cincinnati Bengals' 52nd season in the National Football League and their third under head coach Zac Taylor. ==Draft== ==Regular season== ===Schedule=== The Bengals 2021 schedule was announced on May 12. Week Date Opponent Result Record Venue Recap 1 September 12 Minnesota Vikings W 27–24 ( 1–0 Paul Brown Stadium Recap 2 September 19 at Chicago Bears L 17–20 1–1 Soldier Field Recap 3 September 26 at Pittsburgh Steelers W 24–10 2–1 Heinz Field Recap 4 Jacksonville Jaguars W 24–21 3–1 Paul Brown Stadium Recap 5 October 10 Green Bay Packers L 22–25 3–2 Paul Brown Stadium Recap 6 October 17 at Detroit Lions W 34–11 4–2 Ford Field Recap 7 October 24 at Baltimore Ravens W 41–17 5–2 M&T; Bank Stadium Recap 8 October 31 at New York Jets L 31–34 5–3 MetLife Stadium Recap 9 November 7 Cleveland Browns L 16–41 5–4 Paul Brown Stadium Recap 10 Bye 11 November 21 at Las Vegas Raiders W 32–13 6–4 Allegiant Stadium Recap 12 November 28 Pittsburgh Steelers W 41–10 7–4 Paul Brown Stadium Recap 13 December 5 Los Angeles Chargers L 22–41 7–5 Paul Brown Stadium Recap 14 December 12 San Francisco 49ers L 23–26 7–6 Paul Brown Stadium Recap 15 December 19 at Denver Broncos W 15–10 8–6 Empower Field at Mile High Recap 16 December 26 Baltimore Ravens W 41–21 9–6 Paul Brown Stadium Recap 17 January 2 Kansas City Chiefs W 34–31 10–6 Paul Brown Stadium Recap 18 January 9 at Cleveland Browns L 16–21 10–7 FirstEnergy Stadium Recap Note: Intra-division opponents are in bold text. ===Standings=== ====Division==== ====Conference==== ==Postseason== ===Schedule=== Round Date Time () Opponent (seed) Result Record Venue TV Recap Wild Card 4:35 p.m. Las Vegas Raiders (5) W 26–19 1–0 Paul Brown Stadium NBC Recap Divisional 4:35 p.m. at Tennessee Titans (1) W 19–16 2–0 Nissan Stadium CBS Recap AFC Championship January 30 3:05 p.m. at Kansas City Chiefs (2) W 27–24 3–0 Arrowhead Stadium CBS Recap Super Bowl LVI February 13 6:30 p.m. vs. Los Angeles Rams (N4) SoFi Stadium NBC ==References== ==Notes== Category:2021 National Football League season by team Category:Cincinnati Bengals seasons",
 "title": "2021 Cincinnati Bengals season"
}