{
 "id": "900112",
 "text": "The 2021 season was the Cleveland Browns' 69th season as a member of the National Football League and their second under head coach Kevin Stefanski. ==Draft== 2021 Cleveland Browns Draft Round Selection Player Position College Notes 1 26 Greg Newsome II CB Northwestern 2 52 Jeremiah Owusu-Koramoah LB Notre Dame from Chicago via Carolina 3 91 Anthony Schwartz WR Auburn from New Orleans 4 110 James Hudson OT Cincinnati from Philadelphia 132 Tommy Togiai DT Ohio State 5 153 Tony Fields II LB West Virginia from Detroit 169 Richard LeCounte S Georgia from Los Angeles Rams 6 211 Demetric Felton RB UCLA ==Regular season== ===Schedule=== The Browns' 2021 schedule was announced on May 12. Week Date Opponent Result Record Venue Recap 1 September 12 at Kansas City Chiefs L 29–33 0–1 Arrowhead Stadium Recap 2 September 19 Houston Texans W 31–21 1–1 FirstEnergy Stadium Recap 3 September 26 Chicago Bears W 26–6 2–1 FirstEnergy Stadium Recap 4 October 3 at Minnesota Vikings W 14–7 3–1 U.S. Bank Stadium Recap 5 October 10 at Los Angeles Chargers L 42–47 3–2 SoFi Stadium Recap 6 October 17 Arizona Cardinals L 14–37 3–3 FirstEnergy Stadium Recap 7 Denver Broncos W 17–14 4–3 FirstEnergy Stadium Recap 8 October 31 Pittsburgh Steelers L 10–15 4–4 FirstEnergy Stadium Recap 9 November 7 at Cincinnati Bengals W 41–16 5–4 Paul Brown Stadium Recap 10 November 14 at New England Patriots L 7–45 5–5 Gillette Stadium Recap 11 November 21 Detroit Lions W 13–10 6–5 FirstEnergy Stadium Recap 12 November 28 at Baltimore Ravens L 10–16 6–6 M&T; Bank Stadium Recap 13 Bye 14 December 12 Baltimore Ravens W 24–22 7–6 FirstEnergy Stadium Recap 15 Las Vegas Raiders L 14–16 7–7 FirstEnergy Stadium Recap 16 December 25 at Green Bay Packers L 22–24 7–8 Lambeau Field Recap 17 at Pittsburgh Steelers L 14–26 7–9 Heinz Field Recap 18 January 9 Cincinnati Bengals W 21–16 8–9 FirstEnergy Stadium Recap Note: Intra-division opponents are in bold text. ===Standings=== ====Division==== ====Conference==== Category:2021 National Football League season by team Category:Cleveland Browns",
 "title": "2021 Cleveland Browns season"
}