{
 "id": "900189",
 "text": "Pakka Commercial () is an 2022 Indian Telugu-language legal action-comedy film. It is directed by Maruthi and produced by UV Creations and GA2 Pictures. The film stars Gopichand and Raashi Khanna with Sathyaraj, Rao Ramesh and Anasuya Bharadwaj playing pivotal roles. The movie was originally scheduled to release on May 20, 2022, but instead, it released on July 1, 2022. ==Plot== Suryanarayana is a dutiful lawyer, who resigns after being unable to deliver justice to Amulya, who was threatened and blackmailed by the rich man named Vivek and ultimately committed suicide. While he works hard at his shop to provide for his family, his son Ramchand \"Lucky\" finds his law books and coat, sparking an inspiration to become a lawyer. Years later, Lucky becomes an advocate, who embodies the opposite principles of his father, settling cases outside of the court for his personal profits, which Suryanarayana is unaware. One day, Jhansi an actress whose character, a lawyer in a serial, was killed off to save money requests Lucky so that she can sue the studio. Although their case is rejected, Lucky is impressed by Jhansi's knowledge and qualifications in real-life law and they fall in love with each other. Afterwards, Lucky defends a gangster, who killed a lawyer despite extensive evidence against him while Suryanayarana helps a couple file a case against a corrupt developer and politician who is actually Vivek. When Suryanarayana refers the case to him, he instead meets Vivek and agrees to work with him for substantial rewards. Vivek also kidnaps the husband, who exposed his corruption. On the second hearing for the gangster's murder case, Jhansi, who has gotten closer to the family, unexpectedly brings Suryanarayana to the courtroom, forcing Lucky to honestly argue and leading to a guilty verdict for the gangster. Watching through a secret camera, Vivek is impressed by his performances and reaches the court. Vivek's arrival brings all the truths to light, and Suryanaryana is ashamed by Lucky's actions, where he decides to fight for the couple himself. Jhansi decides to join Suryanarayana after seeing his drive for justice. At home, they work on the case, splitting the house into halves which they title themselves as Commercial (Lucky) and Non- Commercial (Suryanaryana and Jhansi). Lucky uses various tricks to hamper Suryanaryana and Jhansi, slanders the couple's names, claiming that he had actually gone to Dubai and had affairs, and nearly gets Suryanaryana disbarred. Meanwhile, Lucky keeps getting gifts from Vivek. Lucky's search for the disappeared husband, ends to no avail and Vivek plans to kill him by putting him in a pillar and casting concrete inside. Lucky also meets a mysterious woman also named Amulya, who is Vivek's wife. Ultimately, Lucky gets a seat as an MLA in Vivek's political party. As Vivek prepares to be sworn, the news breaks about the body of a cab driver that Vivek had murdered earlier being found at his farmhouse. It is revealed that Amulya is actually Saira Banu, the cab driver's wife. In retaliation, Vivek kidnaps Suryanarayana and asks Lucky to cover his bail. However, Lucky instead saves Suryanarayana from Vivek's goons and reveals that he had planned everything all along to seek vengeance on Vivek, ever since he saw Suryanarayana's sufferings as a child following his resignation, and had enlisted Saira Banu to seduce and distract Vivek. Vivek attempts to appeal, but his lawyer deserts him after revealing that Lucky used his gifts and conversations to collect his evidence and biometric traits. Finally, Vivek becomes insane and requests the court to provide him a death penalty. == Cast == * Gopichand as Lawyer Ramchand (Lucky) * Raashii Khanna as Lawyer Jhansi * Sathyaraj as Justice Suryanarayana * Subhalekha Sudhakar as Justice Sudhakar * Praveen as Junior Lawyer * Rao Ramesh as Vivek * Ajay Ghosh as PA Diwakar * Kiran Talasila * Srinivasa Reddy * Viva Harsha as Balraju * Ramana Reddy * Saptagiri * Sai Krishna * Srikanth Iyengar * Chitra Shukla as Amulya * Aditi Gautam as Saira Banu aka Amulya * Varalaxmi Sarathkumar as Senior Lawyer (Cameo appearance) * Maruthi Dasari as Dancer, Cameo appearance in the title song * Dev Gill as Ayub Khan * Anasuya Bharadwaj as Prostitute == References == Category:2022 movies Category:2020s Indian movies Category:Telugu-language movies",
 "title": "Pakka Commercial"
}