{
 "id": "900103",
 "text": "The 2021 season is the Kansas City Chiefs' 52nd season in the National Football League and their ninth under head coach Andy Reid. ==Draft== 2021 Kansas City Chiefs Draft Round Selection Player Position College 2 58 Nick Bolton Linebacker Missouri 2 63 Creed Humphrey Center Oklahoma 4 144* Joshua Kaindoh Defensive end Florida State 5 162 Noah Gray Tight end Duke 181* Cornell Powell Wide receiver Clemson 6 226 Trey Smith Guard Tennessee * Compensatory selection ==Regular season== ===Schedule=== Week Date Opponent Result Record Venue Recap 1 September 12 Cleveland Browns W 33–29 1–0 Arrowhead Stadium Recap 2 September 19 at Baltimore Ravens L 35–36 1–1 M&T; Bank Stadium Recap 3 September 26 Los Angeles Chargers L 24–30 1–2 Arrowhead Stadium Recap 4 October 3 at Philadelphia Eagles W 42–30 2–2 Lincoln Financial Field Recap 5 October 10 Buffalo Bills L 20–38 2–3 Arrowhead Stadium Recap 6 October 17 at Washington Football Team W 31–13 3–3 FedExField Recap 7 October 24 at Tennessee Titans L 3–27 3–4 Nissan Stadium Recap 8 New York Giants W 20–17 4–4 Arrowhead Stadium Recap 9 November 7 Green Bay Packers W 13–7 5–4 Arrowhead Stadium Recap 10 November 14 at Las Vegas Raiders W 41–14 6–4 Allegiant Stadium Recap 11 November 21 Dallas Cowboys W 19–9 7–4 Arrowhead Stadium Recap 12 Bye 13 December 5 Denver Broncos W 22–9 8–4 Arrowhead Stadium Recap 14 December 12 Las Vegas Raiders W 48–9 9–4 Arrowhead Stadium Recap 15 at Los Angeles Chargers W 34–28 10–4 SoFi Stadium Recap 16 December 26 Pittsburgh Steelers W 36–10 11–4 Arrowhead Stadium Recap 17 January 2 at Cincinnati Bengals L 31–34 11–5 Paul Brown Stadium Recap 18 at Denver Broncos W 28–24 12–5 Empower Field at Mile High Recap Note: Intra-division opponents are in bold text. ===Standings=== ====Division==== ====Conference==== ==Postseason== ===Schedule=== Round Date Time () Opponent (seed) Result Record Venue TV Recap Wild Card January 16 7:15 p.m. Pittsburgh Steelers (7) W 42–21 1–0 Arrowhead Stadium NBC Recap Divisional January 23 5:30 p.m. Buffalo Bills (3) W 42–36 2–0 Arrowhead Stadium CBS Recap AFC Championship January 30 Cincinnati Bengals (4) L 24–27 2–1 Arrowhead Stadium Recap Category:2021 National Football League season by team Category:Kansas City Chiefs",
 "title": "2021 Kansas City Chiefs season"
}