{
 "id": "900230",
 "text": "Charadrahyla is a group of frogs in the family Hylidae. They live in southern Mexico. The name of this genus comes from the Greek word charadra (\"ravine\") and Hyla. Accordingly, common name ravine treefrogs has been coined for the genus. ==Taxonomy and systematics== Scientists made this genus in 2005 after looking closely at all the frogs in Hylidae. The frogs in Charadrahyla are those that used to be in the Hyla taeniopus group as defined by in 1970. The genus was originally made using molecular markers and no morphological synapomorphies, meaning that scientists only used the frogs' genes to tell whether they should be in this group. They did not use what the frogs looked like or how their bodies worked. The closet related group to Charadrahyla is the genus Megastomatohyla. Five of the frogs in this genus were in the genus Hyla before 2005. Since then, scientists discovered two species of frogs for the first time, and placed them in Charadrahyla too. Another two were moved into Charadrahyla from Exerodonta in 2018 after scientists studied their DNA. ==Description== The frogs in Charadrahyla are large for frogs. They lay eggs in streams in cloud forests and humid pine-oak forests of central and southern Mexico. Most of the male frogs in this genus are long from nose to rear end and females . But the former Exerodonta species, Charadrahyla juanitae and Charadrahyla pinorum, are much smaller, with males and females . Most species have a brownish skin on their backs with large spots (exception is Charadrahyla altipotens). == Species == As of 2019, there were ten species in this genus: * Charadrahyla altipotens (Duellman, 1968) — yellowbelly voiceless tree frog * Charadrahyla chaneque (Duellman, 1961) — fairy tree frog * Charadrahyla esperancensis (Canseco-Márquez, Ramírez-González, and González- Bernal, 2017) * Charadrahyla juanitae (Snyder, 1972) * Charadrahyla nephila (Mendelson and Campbell, 1999) * Charadrahyla pinorum (Taylor, 1937) * Charadrahyla sakbah (Jiménez-Arcos, Calzada-Arciniega, Alfaro-Juantorena, Vázquez-Reyes, Blair & Parra-Olea, 2019) * Charadrahyla taeniopus (Günther, 1901) — porthole tree frog * Charadrahyla tecuani (Campbell, Blancas- Hernández, and Smith, 2009) * Charadrahyla trux (Adler and Dennis, 1972) — spine-fingered tree frog ==References== Category:Frogs of North America",
 "title": "Charadrahyla"
}