{
 "id": "900552",
 "text": "The Iran–Saudi Arabia proxy conflict, also named the New Middle Eastern Cold War, refers to the struggle between its two main actors - Iran and Saudi Arabia. They are not confronting each other militarily, however, as the contest for political influence in the region mainly plays out in other Middle Eastern states. The rivalry is primarily a political and economic struggle exacerbated by the history between the two countries. == Background == Beginning with the rule of King Saud in 1932, Saudi Arabia has claimed to be the Muslim representative involving the Sunni Wahhabi ideology, initiated by the state, and being the guard of the holy cities of Mecca and Medina. Iran, on the other hand, has been affiliated with Shia Islam and declared to be the protector of Islam during the 1979 Iranian Revolution, when Khomeini seized power of the country; this marked the beginning of the proxy conflict as it undermined Saudi Arabia's image as leader of the Muslim World. Another important event in 1979 was the seizure of the Grand Mosque of Mecca, where extremist insurgents protested against westernization of the monarchy and called for the overthrow of the house of Saud. Though the state captured them, the monarchy took over their demands for stricter Islamization policies to re- establish its Islamic legitimacy. Before 1979, Iran and Saudi Arabia managed cordial ties. However, these relations were not without tensions. === Arab Spring === The Arab Spring of 2011 was a wave of uprisings that caused political instability. These uprisings were mainly concerned with economic, political, and social issues. == Involved parties == === Iranian allies === Iran's main strategic allies are the Syrian government led by Assad and the Lebanese militant group Hezbollah. Syria's main incentive for their relations with Iran was to find a new counterforce to its main enemies, Israel and Iraq. The relationship between Hezbollah and Iran can be explained in political and religious terms, as Hezbollah shares Iran's Shiite Islamist ideology, and in financial terms as Iran has played a role in funding Hezbollah's military wing. Additionally, Yemen's Houthis have an alleged relationship with Iran. ==== Saudi Arabian allies ==== The Gulf Cooperation Council (GCC) comprised Saudi Arabia as a de facto leader, Qatar, Oman, Bahrain, Kuwait, and the United Arab Emirates, has been described as an important ally to Saudi Arabia in this conflict. Concerns over Iran's expansionary goals following the 1979 revolution are said to be the main drivers for the creation of the GCC in 1981 as a regional political, economic, and security alliance. It is important to note that there are numerous political and ideological differences among the GCC's members, and their positions towards Iran are not identical. Especially Qatar and Oman have pursued a strategy of maintaining positive relations, emphasizing independent trade and commercial links to Iran. ==== Other parties ==== Although nations such as the United States, Israel and Turkey play an important role in the Middle East, they have not played a decisive role in this conflict. This is because they are concerned with the regional balance of power. Still, their interests are not as directly tied up with every detail of the competition between Iran and Saudi Arabia. However, all three nations tend to lean more towards Saudi Arabia. == Involvement in regional conflicts == Several Middle Eastern states have been battlegrounds for the geopolitical and geo-sectarian friction between Saudi Arabia and Iran with destabilizing effects. === Iraqi Civil War === The first proxy war was set in Iraq, involving Saddam Hussein invasion of Iran in response to the 1979 Revolution and its commitment to exporting its ideology to other countries. This resulted in the eight-year eighth-year-long Iran-Iraq war, in which Saudi Arabia backed Ir, ref, When Iraqi troops invaded Saudi Arabia's ally Kuwait in 1990, however, Saudi got directly involved in the offensive against Iraq with the help of the United States. In 2003 the Americans led an invasion toppling the Iraqi government, creating a power vacuum in the region. Because Iran was concerned that they might be the next target of the Americans, it supported Shiite militias in their fight against American forces. Saudi Arabia remained more passive during the invasion, likely to avoid any complications in its relations with the United States. As the American troops withdrew from Iraq in 2011 and with the rise of Islamic State in 2014, Iran's influence in the country grew. More recently, Iran has played a role in suppressing the Iraqi Kurdish call for independence, whereas Saudi Arabia are said to support the Kurds. ==== Syrian Civil War ==== The Syrian civil war began as a part of the Arab uprisings in 2011, when civilians protested against the government for greater freedom and openness, to which the regime responded with great violence. While Iran and Hezbollah back the Assad regime through the provision of weaponry, military technology, and financial support, Saudi Arabia and other GCC states support the various resistance groups that actively oppose the regime. ==== Yemeni Civil War ==== The Yemeni Civil War began in 2014, when the Houthis aligned with Iran and took control of the capital, Sana, in an attempt to take over the country. The government was sent into exile in Saudi Arabia, which formed a coalition with the UAE against the Houthis. They heavily bombarded the nation, causing many civilian deaths. In addition, the coalition-backdrops Yemeni opposition groups. Iran, which had a relationship with the Houthis before 2014, expanded their military aid to support the Houthi movement. ==== Bahreini Uprising ==== Saudi Arabia and Iran have spent decades trying to expand their influence in Bahrain. The estimate percentage of Shia in the Bahraini population is between 60% and 70%, which concerns the neighboring Sunni countries because they fear a Shiite revolution against the government incited by Iran. Bahrain's Sunni ruling al-Khalifa family and the Sunni dynasties in the region have also accused Iran for provoking the Bahraini anti-government Uprising during the Arab Spring in February 2011. The protesters were non-sectarian and wanted greater political representation. The uprising was shut down after the Bahraini government requested help from neighboring countries. Saudi-Arabia deployed more than one thousand troops with armored support in an attempt to prevent Iranian involvement in the country but also to put a stop to democratic aspirations from spreading into the Gulf region. == nuclear programs of Iran and Saudi Arabia == For years, Iran's and Saudi Arabia's nuclear ambitions have gained much international attention. According to the Nuclear Threat Initiative, \"Although Saudi Arabia does not possess weapons of mass destruction, Saudi officials have hinted at the desirability of possessing nuclear weapons to counter the nuclear ambitions of rival regional Iran.\" In 2015, Iran concluded an agreement restricting its nuclear program in exchange for sanction relief. Saudi Arabia felt threatened by this deal, fearing that the easing of sanctions would allow Iran to further support Shia groups in the Middle East. In 2018, the U.S. withdrew from the deal. ==References== == Other websites == and Category:Politics of Iran Category:Politics of Saudi Arabia",
 "title": "Iran–Saudi Arabia proxy conflict"
}