{
 "id": "900555",
 "text": "The Kurdistan Workers' Party (PKK) is a Kurdish militant organization and armed guerrilla movement currently operating in Turkey founded by Abdullah Öcalan in the 1970s. Since 1984 there have been many clashes between them and the Turkish government. They once sought for an independent socialist state, now they want more autonomy and democratic confederalism. They are recognised as a terrorist organisation by Turkey, United States, and the European Union. ==History== The organization can be traced back to 1972-1973 when a group of revolutionary students got together led by Abdullah Öcalan. After the military coup of 1971, many leftists groups went underground to avoid repression by the generals in the name of restoring law and order. It was established as a party in 1978 and it held its foundation congress in November of the same year. In 1980 there was another coup which resulted in the ruling of Turkish Armed Forces for three years. In 1983 a law passed to prohibit the use of the Kurdish language, and the Turkish forces committed several human rights abuses. ===1984 war=== In 1984 a guerrilla war between the PKK and the Turkish state started, although attacks from both sides had been performed before. It was met with a violent military reaction, and repeated clashes caused many losses and massive migrations. The following years resulted in continuous fighting and tension, leading up to the capture and imprisonment of leader Öcalan in 1999 and their admitted military defeat. This led to internal divisions in the party. ===Peace talks=== Since the divisions, several ceasefires have been declared and peace talks have been held. However, the conflict has not ended and as recently as 2016 there was a renewed rise in violence. ===Peace possible=== In February 2025, Öcalan called on his followers in the PKK to stop their fighting against Turkey. He also said the organisation should dissolve (stop existing). On May 12 the party said to all that it would stop fighting Turkey. Instead it wants to be a political party. The PKK says it has completed what it wanted to do but also that it has guilt from dead civilians in the conflict. Turkish Foreign Minister Hakan Fidan said the decision of \"historic importance\" and could bring \"lasting peace and stability\" to everyone in Kurdistan. Turkish President Tayyip Erdogan said that the decision was a start. It is likely the PKK will not stop fighting turkey. ==Ideology== ===Original ideology=== The PKK started as an ideologically leftist nationalist movement which applied Marxism-Leninism thought of class struggle and national liberation to the Kurdish national context. Through their first years (1978-1986) their goal was achieving independence from Turkey, Iran, Iraq, and Syria. They also wanted to seize state power through armed revolution to establish a Kurdish socialist state. ===Changes=== Their ideology went through changes from 1985 until 1995. This was a period in which Öcalan made various criticisms of socialist organizations at the time, questioning the focus on state led socialism and calling for a merging of socialist ideals with democratic and pluralist ones.During this time their ideal of creating an independent state shifted and a political solution without separatism was proposed. These changes further developed after 1999 after Öcalan was imprisoned and started reading Murray Bookchin. Since then, the PKK has shifted to an ideology of democratic confederalism with a strong focus on radical direct democracy, feminism and environmentalism. This has also led to a change in their demands as they no longer believe in the nation-state and therefore seek autonomy and the slow disappearance of borders rather than an independent state. ==Tactics== ===Warfare=== The party has used several guerrilla tactics since its existence, taking inspiration from Che Guevara’s Guerrilla Warfare. One of these was the strategic use of mountains they were familiar with, but Turkish armed forces were not. To escape from Turkish persecution, members of the PKK have also strategically crossed borders to Syria, Iraq or Iran. In the 1990s, they started using bomb attacks and shifted to positional warfare. ===Politics=== Along with its ideological change since the 1990s the PKK also experienced strategic transformations. They entered the field of law, electoral politics and media. Additionally, after Öcalan's arrest the PKK argued that they went into defense mode militarily without giving up their armed struggle, and put focus into constructing a civil society and electoral politics. ==Recognition== Because of their use of guerrilla tactics and positional warfare, the PKK is registered as a terrorist organisation by Turkey, the European Union, NATO, and most Western governments. Yet, this definition has been contested by other countries, the PKK itself and other institutions. ==References== Category:Nationalist organizations in Asia Category:1970s establishments in Asia Category:Kurdish organizations",
 "title": "Kurdistan Workers' Party"
}