{
 "id": "900695",
 "text": "Theodore Gilmore Bilbo (October 13, 1877 – August 21, 1947) was an American politician who first served as Lieutenant Governor of Mississippi (1912–1916), then served 2 terms as Governor of Mississippi (1916–1920, 1928–1932), then served as a US Senator (1935–1947). A lifelong Democrat, he was a filibusterer whose name was synonymous with racism and white supremacy. Like many Southern Democrats during his era, he defended segregation. More positive was Bilbo's approach to social reform. During his first time as Governor of Mississippi, for instance, he presided over a wide range of reforms. Although the state house of representatives was under the leadership of a critic of Bilbo's, the legislature nevertheless (as noted by one historian) \"responded favorably to most of Bilbo's proposals.\"Mississippi A History by Westley F. Busbee, P.213 As one study has noted, \"Former governor Brewer's program of providing various state services was accelerated by the Bilbo administration.\" A commission to tackle adult illiteracy was set up, while attempts were made to prevent high text book prices. A compulsory school law was introduced while provision was made for transportation to rural consolidated schools. A program was also sponsored for the building of hospitals and institutions for the subnormal and underprivileged.American Demagogues, Twentieth Century. With an introduction by Allan Nevins, 1959, by Reinhard Henry Luthin, P.53 A number of Acts and regulations concerning public health were also introduced.STATE LAWS AND REGULATIONS PERTAINING TO PUBLIC HEALTH 1918 COMPLIED BY JASON WATERMAN, LL. B. AND WILLIAM FOWLER, LL. B. , P.166-205 An Act of April 1916, for instance, provided for the establishment and maintenance of hospitals for pellagra sufferers.State laws and regulations pertaining to public health, 1916 ... c.1, P.139 Also, an Act of March 1918 authorized municipalities to borrow money to provide loans to citizens to help them make sewer connections.STATE LAWS AND REGULATIONS PERTAINING TO PUBLIC HEALTH 1918 COMPLIED BY JASON WATERMAN, LL. B. AND WILLIAM FOWLER, LL. B. , P.200-201 New dormitories were added to an Old Soldier’s Home, and increases were made in the pensions of Confederate soldiers.New Outlook 1931-06-17: Vol 158 Iss 7, P.204 Farm mechanics and manual training were also introduced into rural school curricula.Revolt of the rednecks; Mississippi politics, 1876-1925 by Albert D. Kirwan, 1951, P.265 An act was introduced “to regulate the custody, control, and care of delinquent children and to provide for the establishment' and maintenance of a State industrial and training school.” STATE LAWS RELATING TO EDUCATION ENACTED IN 1915, 1916 AND 1917, P.245 Another Act sought to provide “schools for Indian children and other children not otherwise provided for by law.”State Laws Relating to Education Enacted in 1918 and 1919. Bulletin, 1920, No. 30 Hood, William R., Comp. Bureau of Education, Department of the Interior, P.199 The legislature also officially accepted, as noted by one study, \"federal funds to help pay salaries for vocational teachers in agricultural high schools.\"Mississippi A History by Westley F. Busbee, P.213-214 People were also given a greater voice in government through initiatives like restrictions upon the activities of lobbyist, a reapportionment of representation in the legislature, and the introduction of an initiative and referendum system. A distribution system for school funds aimed at benefitting poorer counties was also adopted.Memorial services held in the House of Representatives and Senate of the United States, together with remarks presented in eulogy of Theodore Gilmore Bilbo, late Senator from Mississippi, Eightieth Congress, 2d Session, P.56-57 Night schools for adults were also set up, along with a charity hospital for poor people who could not afford medical care.Was Mississippi a Part of Progressivism? by Stephen Cresswell / June 2004 Provision was also made for 3 additional state charity hospitals.Revolt of the rednecks; Mississippi politics, 1876-1925 by Albert D. Kirwan, 1951, P.271 A State Tax Commission was set up, adding (according to one study) “”$300,000,000 of property to the tax rolls,” and a hog vaccination law for eliminating cholera was introduced.Revolt of the rednecks; Mississippi politics, 1876-1925 by Albert D. Kirwan, 1951, P.271 Public hangings were also abolished, along with the fee system in county offices. 2 lime-crushing plants were set up where farmers could acquire crushed limestone at cost.Revolt of the rednecks; Mississippi politics, 1876-1925 by Albert D. Kirwan, 1951, P.272 In addition, an antilobbying law was enacted, along with a blue sky law to prevent the marketing of stocks that were worthless.Revolt of the rednecks; Mississippi politics, 1876-1925 by Albert D. Kirwan, 1951, P.272 Various labor laws were introducedLabor Legislation of 1916 : Bulletin of the United States Bureau of Labor Statistics, No. 213, P.81-82 such as one that established a Saturday half-holiday for all female state employees during the months of June, July and August.American labor legislation review v.8 1918, P.245 The maximum amount affected by a law directing to whom the wages of a deceased employee should be paid was increased from $200 to $300.American labor legislation review v.10 1920, P.176 Under a reform of employer’s liability, according to one study, “Heirs of a person killed by the wrongful act or default of a ship or vessel may recover in all cases in which the person injured would have been entitled to recover damages if not killed by the injury.”American labor legislation review v.10 1920, P.188-189 An Act to prevent blindness in new-born infants was introduced, along with registration of cattle brands to enable farmers to borrow money upon their live stock.Journal of the Senate of the State of Mississippi ... 1918, P.10 A Mississippi State Plant Board was also established. One of the intentions of this measure, according to Bilbo, was to \"protect and encourage the nursery interests of the State and to free the farmers from destructive ravages by bugs, worms, etc.\"Journal of the Senate of the State of Mississippi ... 1920, P.27 In addition, a highway commission was introduced, organisation of which (according to one study) “was a prerequisite for receiving federal aid for constructing rural roads. Farm to market roads were of critical importance in enabling farmers to get produce to local markets. This was the type of federal aid that was warmly embraced by Bilbo and his core constituency.”Populism in the White Southern Democratic Party With Reference to Alabama and Mississippi by William Sheward, 2001, P.240 He was also a staunch supporter of the New Deal.Populism in the White Southern Democratic Party With Reference to Alabama and Mississippi by William Sheward, 2001, P.240-241 He died on August 21, 1947 in New Orleans, Louisiana. He was 69 years old. ==References== Category:1877 births Category:1947 deaths Category:Democratic Party (United States) politicians Category:Governors of Mississippi Category:United States senators from Mississippi Category:White supremacists",
 "title": "Theodore G. Bilbo"
}