{
 "id": "900790",
 "text": "The 1860 civil conflict in Mount Lebanon and Damascus (also called the 1860 Syrian Civil War) was a civil conflict in Mount Lebanon during Ottoman rule in 1860–1861, fought mainly between the local Druze and Christians. The Druze are a religious group that incorporate many beliefs from different religions, there are Druze communities across the world, but large numbers are found in Israel, Lebanon and Syria. The violence was at the beginning of the conflict targeted at the Maronites, but other Christian groups were targeted as well, such as members of the Greek orthodox church in Damascus. Many Christian villages were destroyed in this war, along with their churches and monasteries. People were forced to abandon their homes and villages and became refugees. Also many people were killed. == Historical background == There has been tensions and periods of conflict between the Druzes and Maronites in Mount Lebanon, even before the civil war in 1860 started. The region in Mount Lebanon was divided in a Christian division and a Druze division, with each having their own governor. This all happened under Ottoman rule. The friction started to grow between the two groups, partly because of the involvement of outside powers. The British supported the Druzes and the French supported the Christians, while the Ottomans wanted to maintain its power all the way. === Peasant uprising in 1859 === The motivation for the Maronite peasant uprising was driven by economic factors and had a class-related struggle for equality. The publication of Hatt-i humayun caused a reaction among Maronite peasants in Keserwan. It highlighted the social inequality and their low status: along with the daily abuse they endured they got inspired to demand for a stop on their feudal duties. Tanyus Shahin, a Maronite peasant leader, demanded that the feudal class would abolish its privileges. The feudal class refused. This started a revolutionary wave of Lebanese peasants preparing for an armed struggle against the Druzes. As a reaction, Druzes started to arm themselves too. This revolutionary wave eventually started to look like a civil war and ended in a massacre of the Maronite people. == 1860 Druze-Maronite war == === Mount Lebanon === By 1860, the conflict had turned from economic into sectarian violence between Maronites and Druze.It is not exactly clear who the civil war started, and when it started. The Christians claimed that the Ottomans and/or the Druzes started it, whereas the Druzes claim that the Christians started it. The date of the beginning of the war is being debated. Some say that the 27th of May 1860 was the beginning, others say that it's the 29th of May. It is likely that the war started with murder and revenge killings in between families, where eventually local communities got involved. Along with the killings’, harvested crops of Druzes were being raided by Maronites, villages were being plundered and afterwards burned down, causing many people having to flee their homes. After only one month of violent confrontations between the two, the attacks became more and more violent, killing more and more people. The killings were mostly done at random which made them more frightening. People were already fleeing the region before the war due to the tensions running high, but after the killing of 165 people in Jezzine along with more than 1000 killings in the nearby region, many more people fled the region immediately. While they were on the run for the violence, they met violence: many people were attacked by Druzes in their attempt to flee. At the end of June 1860, there were an estimated 80,000 people on the run for the violence in Mount Lebanon, many of them went to Damascus. === Damascus === The war started to spread from Mount Lebanon and Damascus got involved. Many people who lived in Damascus were not directly involved in the war at first, but the tensions rose in the city because of the many Christian refugees that had fled to Damascus. Christians who already lived in Damascus tried to help the Christian refugees, even some Muslims offered help to the refugees. When the Druze booked more and more victories in the war, the violence against Christians in Damascus increased. In the second and third week of July 1860, the Damascus massacre happened. The Christians in Damascus were attacked by violent groups of Druzes, they were looting, and destroying homes and places of worship. The Christian part of Damascus was completely destroyed after the massacre (as to be seen in the picture on this page). The aftermath of this extreme outburst of violence was a city covered in a heavy atmosphere of devastation. The city and its inhabitants remained uptight. A letter published in July 1869 in the Daily News stated that over 7,000 to 8,000 people were killed in the Damascus massacre which also caused an enormous number of people being widowed or orphaned. Other sources even claim that an estimated 20,000 Christians were killed by the Druze in the war. == International intervention == France wanted to put an end to the violence that was occurring and decided to send 6,000-7,000 troops to Syria. Napoleon Bonaparte had the perfect opportunity to gain Syria as a territory, while also claiming to save the Christians from the violence that they had to endure. The Ottomans did not want France to intervene because they were afraid that it would enlarge French power in the Ottoman region. The Ottomans negotiated the partition of Mount Lebanon between Christians and Druze which led to division between sects and created tensions. As a reaction to the coming of French troops they send Fuad Pasha to Damascus, with the intention to end the conflict before the French had arrived. Pasha ordered a mass execution of more than one hundred Druzes, in the hopes of restoring order in the region, while also pleasing Bonaparte by firmly punishing the Muslims and no Christians. Eventually the French troops arrived in August 1860, but there were agreements made between several countries (England, Russia, France, Austria, Prussia, and Turkey) to limit the powers and the stay of the French troops, along with their own troops. There were around 12,000 foreign troops in Syria in an effort to stop the conflict. When this agreement came to an end, Bonaparte tried to extend the stay of his troops, but got threatened by England and Austria with war. In July 1861 the French troops left and Bonaparte’s plan to gain Syria as a territory failed. == References == Category:1860s in Asia",
 "title": "1860 civil conflict in Mount Lebanon and Damascus"
}