{
 "id": "90078",
 "text": "Lotus may refer to: * Nelumbo, plant genus commonly known as 'Lotus' * Lotus position, cross-legged sitting posture for meditation in horticulture: * Lotus (genus), it includes bird's-foot trefoils and deervetches * Nelumbo nucifera, blue or Indian lotus * Nelumbo lutea, American lotus * Nymphaea, the water- lily genus superficially similar to Nelumbo * Nymphaea alba, European white water-lily or white lotus * Nymphaea caerulea, Egyptian blue lily or sacred blue lily, also called the blue or sacred lotus * Nymphaea lotus, the Egyptian white water-lily or tiger lotus * Lotus effect, self-cleaning property of Nelumbo species * Saussurea laniceps, snow lotus * Ziziphus lotus, thorny shrub that may have been the \"lotus tree\" of Greek mythology in culture (Asian): * Lotus feet, the practice of Foot binding in pre-modern China * Lotus kick, foot sweep in Tai chi chuan * Lotus seed, in Chinese medicine * Lotus Sutra * Lotus, one of the Ashtamangala, or Eight Auspicious Symbols * Nelumbo nucifera, the blue lotus, the sacred lotus or the Indian lotus * Padma (attribute), the sacred lotus in corporate and computing: * Lotus Software, previously Lotus Development Corporation, software company in Cambridge, Massachusetts * IBM Lotus Connections, social networking program * IBM Lotus Quickr, enterprise-level team collaboration * Lotus 1-2-3, spreadsheet program * Lotus Cars, British sports and racing car manufacturer * Lotus (computer games), a videogame series based on Lotus Cars * Lotus Notes, enterprise-level electronic messaging * Lotus Sametime, instant messaging program * Team Lotus, Formula 1 constructor related to Lotus Cars * Tesco Lotus, chain of Thai hypermarket stores in geography: * Lotus, Florida, area in Brevard County, USA * Vancouver, nickname Lotus Land in maritime * S.S.S. Lotus, gaff-rigged schooner * Lotus case, a precedent-setting case resulting from a collision between the S.S. Lotus and the S.S. Boz-Kourt in other meanings: * Lotus tree of Greek mythology, into which Lotis was transformed, and which was eaten by the Lotophagi of Homer's Odyssey",
 "title": "Lotus"
}