{
 "id": "900785",
 "text": "Ulugʻbek Qodirov (sometimes spelled Ulugʻbek Kadirov in English), () (born August 3, 1983) is an actor from Uzbekistan. == Early life == Qodirov was born on August 3, 1983, in Tashkent. He graduated from the Art Institute of Uzbekistan. In 2005 he received the \"Best Young Actor of the Year\" award in Uzbekistan. Ulugʻbek Qodirov got famous in 2009 after starring in the Uzbek drama movie \"Shabbona\". ==Today== Today he lives and works in the USA. One of the movies that made him popular was the 2016 movie Baron. This movie was recognized as the movie that made new history in Uzbek cinema. In addition, the movie \"Traitor\", dedicated to the events in Andijan in 2005, brought a great reputation to him. === Family === * Father: Nasir Kadirov * Mother: Farida Kadirova * Brother: Islombek Kadirov Nasirovich * Sister: Feruza Kadirova Nasirovna * Sister: Aziza Kadirova Nasirovna * Sister: Dilfuza Kadirova Nasirovna * Wife: Azizaxon Kadirova ==== Children ==== * Imona Kadirova Ulugbekovna April 1, 2014. * Amirbek Kadirov Ulugbekovich July 21, 2016. * Zubayda Kadirova Ulugbekovna September 13, 2021 == Filmography == Below is a chronologically ordered list of films in which Ulugbek Qodirov has appeared. Year Film Role Ref 200... Akademiya 200... Shayton bilan oʻynashma 2004 Devona Shodi 2004 Sarvinoz Odil 2005 Baxt uchun million Odil 2005 Oʻyin Jamshid 2006 Fotima va Zuhra Shohrux 2006 Shabbona Bahrom 2007 Sevginator Akmal 2007 Jazo Jasur 2007 Panoh Elyor 2008 Shabnam Bobur 2008 Iztirob Ruslan 2008 Telba Rustam 2008 Oshiqlar Yodgor 2010 Oʻgʻrigina kelin Jasur 2010 Sevginator 2: Qaynona operatsiyasi Akmal 2010 Majruh Farrux 2010 Doda Zafar 2011 Hur qiz ? 2011 Nafs Ulugbek 2011 Qasos Bahrom 2011 Er bermoq — jon bermoq Otabek 2011 Yondiradi Kuydiradi Azamat 2011 Jodugar Farxod 2012 Jannatdagi boʻri bolasi ? 2012 Men yulduzman ? 2012 O Maryam, Maryam ? 2012 Akajon xizmatingizdamiz Shuhrat 2013 Panjara ? 2013 O’lim farishtasi ? 2013 Rashk Otabek 2013 Oʻkinch Sherzod 2013 Arslon izidan ? 2014 Gunoh Azamat 2014 Erkatoy Jamol 2014 Sotqin ? 2015 Aka ? 2015 Baron Botir (Chempon) 2015 Majnun Majnun 2016 Baron 2 Botir (Chempon) 2017 Sniper (Snayper) Yunusbek 201... Rashk 2 Otabek 2018 Sarvqomat dilbarim Baytemir == Awards == * In 2005 he received the \"Best Young Actor of the Year\" award in Uzbekistan. * In 2008 he became the winner of M&TVA.; ==References== == Other websites == * * Instagram * ВКонтакте * Facebook *Twitter *Tik Tok *Telegram Category:1983 births Category:Living people Category:Movie actors Category:Singers Category:People from Tashkent",
 "title": "Ulugʻbek Qodirov"
}