{
 "id": "900815",
 "text": "The reticulated humming frog (Chiasmocleis royi) is a frog that lives in Bolivia, Brazil, and Peru. They sometimes live with tarantula spiders. ==Home== This frog lives in forests. People have seen this frog between 200 and 530 meters above sea level. Scientists think it hatches out of its egg as a tadpole and not a small frog. ==Tarantulas== Scientists have seen this frog living in the same burrows or holes in trees as tarantula spiders in the genus Pamphobeteus. The spiders eat other frogs but not reticulated humming frogs. Scientists have seen the frogs and the spiders coming out of the same burrows to look for food at night. Scientists think the tarantulas use chemicals to tell which frog is which. They have seen young tarantulas catch and pick up small reticulated humming frogs. They catch them the same way they catch frogs that they will eat. But the tarantulas only touch the reticulated humming frogs with their mouths. Then they put them back down without biting them. Microhylid frogs, like the reticulated humming frog, make chemicals in their skin that taste bad. Scientists think this might be why the frogs and spiders started living together. Scientists do not know whether the reticulated humming frog and the tarantula both help each other or whether the tarantula helps the frog but not the other way around. The frog lives in the tarantula burrow, where it is safe from drying out during the day. Other animals that would eat the frog stay away from the tarantulas. However, scientists think the reticulated humming frog might help the tarantula too. They have seen parasite fly larvae on young tarantulas. They think the frog might help the tarantulas by eating flies that try to get into the burrow. Other frogs and tarantulas that live far from South America also live together like this. For example, there are frogs and tarantulas in Sri Lanka that live together this way. Scientists think this relationship evolved more than once. ==Danger== Scientists believe this frog is in not danger of dying out because it lives in a large place. It is in a little danger from people digging good rocks out of the ground, and because of bad chemicals from the digging. The frog's home has more than one protected park in it: Manu National Park, Tambopata National Reserve, Parque Estadual Guajará-Mirim, Reserva Extrativista Rio Pacaás Novas, Reserva Extrativista Chico Mendes, Parque Nacional Madidi, Reserva Manuripi, Reserva de Biosfera Estación Biológica del Beni, and Parque Nacional Isiboro Sécure. ==References== Category:Frogs of South America",
 "title": "Reticulated humming frog"
}