{
 "id": "900812",
 "text": "Sheikh Jarrah is a neighbourhood in Jerusalem. It is to the north of the Old City of Jerusalem and to the east of the Nablus Road, one of the ancient passageways into the Old City. This puts it incredibly close to the many holy sites that are contained within the walls of the Old City, including the Al- Aqsa Mosque, the Western Wall, and the Church of the Holy Sepulchre. The neighbourhood is mostly inhabited by Palestinians and is one of the wealthiest Palestinian neighbourhoods in Jerusalem. According to international law, Sheikh Jarrah, along with East Jerusalem, is considered to be part of the Palestinian Occupied Territories (POT). However, since its annexation in 1967 and Israel's expansion into the Palestinian Territories, the area functions under Israeli governance and law. Combined with its pre-existing political and social importance, this neighbourhood has been turned into 'the eye of [the] storm' of Israeli-Palestinian land disputes in East Jerusalem and across the POT. == History == Sheikh Jarrah is in the east of Jerusalem and its name is thought to refer to the personal doctor of Saladin, leader of the Muslim armies who captured Jerusalem from Christian crusaders in 1187. The doctor is then believed to have settled in the area of modern-day Sheikh Jarrah, giving it his name. Since the time of the Ottomans, the neighbourhood has been one of the major diplomatic centres of the city of Jerusalem. It was in Sheikh Jarrah, at the American Colony Hotel, that the Ottoman mayor of the city, Hussein al-Husseini, announced the surrender of the city to the British in 1917 during the First World War, signifying its importance on an international level. This international importance has continued throughout the last century, with the establishment of multiple consulates and diplomatic missions, earning it the name of 'The District of Embassies'. The area had a mixed population (made up of Muslims, Jews and Christians) while the Ottoman Empire ruled Jerusalem. But when the city came under the control of the British in Mandatory Palestine after the First World War, combined with the rise of Zionism and antisemitic persecution in Europe in places such as Russia, the Jewish population of Jerusalem grew incredibly fast. The city expanded beyond its previous boarders, but also became increasingly divided along religious lines. The east of Jerusalem became predominantly inhabited by Arab people. With Yishuv organisations pushing for increased water and utility supply in the areas with a high Jewish population, areas such as Sheikh Jarrah became increasingly undeveloped, only making the growing religious divides felt more intensely. Following the creation of the State of Israel after the 1948 War (called the 'War of Independence' by Israelis and the 'Nakbah' or 'disaster' by Palestinians), East Jerusalem was absorbed along with the West Bank by the Hashemite Kingdom of Jordan. The war forced many Palestinians to flee their homes that were in the land of the new State of Israel, and many moved into East Jerusalem. Without access to the whole of Jerusalem, and with the city considered the second capital of Jordan after Amman, Sheikh Jarrah became the home of the Arab representation in Palestine. The Egyptian, Lebanese, Iraqi, Saudi Arabian and Syrian consulates were all based there, alongside multiple European diplomatic missions such as the UK, Ireland, France and Greece. After the Arab-Israeli war in 1967 (also known as the 'Six Day War' or 'The Setback'), Sheikh Jarrah, along with the rest of Israel, came under Israeli control. East Jerusalem is still, under international law, part of Palestine, and as a consequence many foreign consulates decided to remain in Sheikh Jarrah. However, the intruding power of settlers is calling this ever more into question. == The Case of Sheikh Jarrah == The rise of ultranationalism in Israel has put many Palestinians living in Sheikh Jarrah at risk of losing their homes. Motivated by a belief in the claim of Israel to all the land between the West Bank of the Jordan River and the Mediterranean Sea, and its proximity to the holy sites, Israeli settler groups have made persistent efforts to take over land and property in Sheikh Jarrah. A lot of the Palestinian population in the neighbourhood moved in as refugees in 1948. Based on this, the Israeli judicial system has been used multiple times by settlers making claims to land on the basis of it being owned by Jewish individuals or associations before 1948. Therefore, the argument is that the Palestinians living in Sheikh Jarrah, where they may have lived with their families for seventy years, have no right to their homes and should be evicted. These attempts have intensified in recent years, with some cases being directly (or indirectly) supported by the Israeli government. In May 2021 the 'Case of Sheikh Jarrah' hit international news headlines after a ruling by an Israeli court that 14 Palestinian residences, housing three hundred people, had to be evicted to make way for Jewish-Israelis. The ruling caused international outrage. Furthermore, on a domestic level, with the neighbourhood being so close to the disputed Old City and Temple Mount, these rulings have had incendiary consequences and have been accredited with causing unrest in Jerusalem and across the Palestinian Occupied Territories. Sheikh Jarrah remains an area of disputed territory, with a UN report in February 2022 recording 218 Palestinian families in East Jerusalem neighbourhoods of Sheikh Jarrah and Silwan, comprising of 970 individuals (424 of whom are children) at risk of eviction by Israeli authorities. These evictions of Palestinian families, often carried out by force, have been called a 'serious humanitarian concern' by the United Nations, and calls have been made for active steps to de-escalate the situation as soon as possible. ==References== Category:Jerusalem",
 "title": "Sheikh Jarrah"
}