{
 "id": "900858",
 "text": "The Republican Guard is an Ethiopian federal law enforcement agency. It is a part of the Ethiopian Ministry of Defense focused on protecting high cabinet level government and high-ranking military officials in the country. The (RG) protect the Prime Minister of the country the first lady, the President, ministers, and generals and high-level federal executives of the country. The republican guard had a budget of 140 million birr for 2019. The Guard not only protect high level officials they also conduct protections for high-risk places and have riot police for times other agencies need help. They also conduct special operations outside their protecting mission seen at high-risk places and times. == Authority == Under Regulation No. 426-2018 Which states \"The Guard shall have the following powers and duties: prepare and submit procedures and standards, and implement same up on approval by the Prime Minister; prepare and submit to the Prime Minister Office, directives related to human resource recruitment, training, periodic evaluation, transfer and dismissal, and implement same upon approval; in coordination with the Ministry and appropriate organs recruit, train, employ and deploy appropriate human resources equip itself with materials, vehicles, weapons, and appropriate technologies that comply with international standards and important for the execution of the mission; without prejudice to sub-article (4) of this Article, whenever necessary, request and obtain appropriate provisional support from other organs; ensure security of the Prime Minister and their family members, and Head of State and Deputy Prime Minister and their family members; without prejudice to sub-article (6) of this Article the protection extends to the outgoing Prime Ministers and his family, outgoing Head of State and Deputy Prime Minister and their families; and it does not include appointee with the Rank of Deputy Prime Minister; provide protection to the visiting foreign Heads of State and Government, Heads of International Organizations and individuals having such status; provide gourd of honor services; conduct studies prepare and submit to the Prime Minister necessary structure and units that help for the accomplishment of mission and implement same upon approval; take necessary measures to ensure the security of head of states and governments; own property, enter into contract, sue and be sued in its own name; undertake other related activities that are supporting the attainment of its objectives.\" The Guard carry out law enforcement operations in parts of the country. == Training == The Republican Guard are trained inside The National College of Information and Security which is under the supervision and teaching of the NISS. The Republican Guard according to Prof De Waal were Emirati-trained. They originally were trained from abroad for 6 months but later after time they are now domestically trained. === Weapons === The Republican Guard use many rifles and guns with assault rifles. These include the CSR 338 sniper rifle, the assault rifle CAR 816 carbine, the CAR 817DMR, they also use the Israeli TAR-21. These weapons come from several countries including Israel. == Structure == The Republican Guard has four main structures. These structures are composed of units inside the Guard. These Units include VIP protection or people who are close with the Prime Minister and Protectees at all times, there is also the Counter Military Unit which are uniformed military personnel protecting the Prime minister and other Protectees with the VIP personnel which are close to the Protectees. There is also another unit which is called Military uniformed Republican Guard Special Force they are tasked with protecting high risk places as the Prime Minister Office or high military or national interest's place. The last is the military police who are said to intervene at high risk and volatile situations in the country. == History == The Republican Guard was formed on December 23, 2018, after a grenade attack whilst the Prime Minister was hosting a speech and other high government officials with while starting his premier ship. The attack was on June 28, 2018, or on the 89th day of his Prime Minister ship. === Rebellion & Arrests === Weeks after becoming Prime Minister Republican guard members from other stations stormed the Prime Minister's residence and demanded a pay raise, the prime ministers' republican guards stationed to him were outnumbered by the hundreds: the prime minister then did pushups to lessen the tension and that made the demanding guards enjoy the pushups with the PM, and they left the palace they later were arrested. Later some members of the Republican Guard apologized for protesting and demanding a pay raise to the Prime Minister. The then Federal Police Commissioner said about the protest raid \"They raised issues related to their living conditions, low pay and a dismal benefits package and demanded to meet the prime minister,\" the guards who raided the PM residence were estimated to be around 250, the guards were ordered to do 10 pushups whom the Prime Minister also led himself. They were invited to dinner then let go out of the residence of the Prime Minister. === Military operations === The Republican Guard have also been involved with operations in Tigray region after rebels rebelled against the federal government. The Republican Guard were able for a brief period able to control the capital city of the northmost state of Ethiopia for a couple weeks till the Commander in Chief of the Ethiopian Armed forces Abiy Ahmed ordered all troops to leave the regional state as a whole forcing the Republican Guard that conducted special operations to leave the area. But whilst they were on the grounds, they have been able to capture high level rebel officials who served as leading the rebel group for decades. One of these is Sebhat Nega the one of the founding members of the TPLF rebel group: which served as the leading political party in Ethiopia for 27 years. The Guard had to fight multiple rebels and go through mountains to catch these high-level leaders of the TPLF. With the Airforce they flied over the rebels to Addis Ababa and gave them to the Ethiopian Federal Police Forensic Investigation Team. == References == Category:Government of Ethiopia Category:Law enforcement agencies",
 "title": "Republican Guard"
}