{
 "id": "900804",
 "text": "The Young Turks was a political reform movement in the late 19th and the early 20th centuries to replace the Ottoman Empire's absolute monarchy with a constitutional government. They led a rebellion against the absolute rule of Sultan Abdul Hamid II, to restore the 1876 constitution, in the 1908 Young Turk Revolution. They also committed the Armenian genocide. == History == The Young Turks was an opposition movement at the end of the Ottoman Empire that existed in the late 19th and the early 20th centuries. Its members aimed to make reforms in politics and culture and wanted to create a new identity that was against the dominant ideology of Ottoman rule. That made them disconnected from the Ottoman regime, and Sultan Abdul Hamid II (r. 1876-1909) repressed the group. Throughout the years, its members built up a resistance inside and outside the empire. The movement was a combination of three groups. Each group had its own critic against the Ottoman regime, which eventually made the groups come together. The first group was a community in exile and traced its origins further back since its members were abroad since the time of the Young Ottomans (1860s and 1870s). The second group was a squad of Ottoman students. The last group was a collaboration of dissatisfied army officers. The many members in the movement had an urban and literary character. Their Western style of education led them to a scientific view. Learning the French language had opened them doors to modern ideas. Their members received an influence from some well-known thinkers from France and so came up with conflicting ideas against the current regime. In the end, they focused on replacing the old structure of the empire with their new approach. === Three groups === ==== Young Ottomans in exile ==== The first group had been abroad since the period of the Young Ottomans, when a group of young Ottoman intellectuals was formed in 1867 to criticize the development of the empire. They went quickly to Europe to escape the harsh policy of Sultan Abdul Hamid II. They got their education in the new Western types of schools, which allowed them to see things from a different view. For example, they criticized the Tanzimat period of reforms (1839-1876), which they thought simply imitated the Western style of government. They did not want to lose their own values but instead wanted a combination of Western and Eastern elements with a mix of Ottoman Islamic concepts and European innovations. They achieved their idea in 1876, when a constitution was established in the Ottoman Empire, but the success did not last long. The Sultan abolished the established constitution and dissolved the parliament in February 1878. His persecutions of dissidents quickly made the movement disappear. The subsequent murder of Midhat Pasha, the father of the constitution, was badly received and in later years increased the opposition to the Sultan. The Young Ottomans placed themselves in cities as Paris and Geneva and grew in number there. In the 1890s, they once more gained an opportunity to influence Ottoman political life. They followed the ideological line of their predecessors. They wanted to restore the constitution of 1876 and reject the tyrannical regime of the Sultan. They found the constitution the greatest mean to defeat the current royal government in power. In addition, they thought that their Ottomanist ideal would restore the empire to its previous glory. ==== Ottoman students ==== The second group was a team of four military students from the state medical academy who founded a secret resistance group on May 21, 1889. It was called the Ottoman Unity Society. The members of the group were not Ottoman Turks but Muslims of other origins. For example, its four founders were an Albanian, a Circassian, and two Kurds. They also received a lot of help from Russian immigrants from Russian. The group wanted equal political access for every citizen. Their broad idea of Ottomanism was not based on nationality and attracted various Ottomans, many of whom were not Turks. The group shared the same customs and values as that of the exiles. Both were trained in the European way, shared the opinion that Abdul Hamid II was a problem to potential innovations, and they wanted to restore the 1876 constitution and overthrow the Sultan. The Ottoman Ahmet Rıza, also a supporter of those ideas, went to Paris in 1895 to join the centenary celebrations of the French Revolution. That historic event was a great inspiration to the Young Ottomans. He brought the ideas of both groups together. He accepted to serve as the head of this Paris faction. However, attempts to expand their influence in the empire were unsuccessful. The Sultan's spy network discovered the existence of the group. The Sultan arrested the members, exiled them, reinforced his tight security, and imposed more censorship. The small group that had survived that intervention now less hope of success. However, with their exile to places like Egypt and European cities, it became more influential abroad. ==== Military group ==== The third group consisted of an alliance of army officers who were dissatisfied after the negative intervention of Sultan Abdulhamid II in the military system. In response, they began to form secret resistance groups that met the other two groups. Most army officers of the resistance were from the Third Ottoman Army of Salonika and had been educated in European-style military schools, giving them a Western mindset that influenced their actions. Their attitude towards the Sultan was another similarity with other two groups. They were military members themselves as loyal soldiers of the empire and wanted to preserve its traditional culture. However, they felt that the Sultan's attitude towards the army did not help but rather undermined that goal. After the arrest and the exile of the members of the other groups, those officers regrouped within the empire. That made them manage to play a greater role behind the scenes. They became the military branch of the movement. In addition, they were finding more support for their mission. === Congress of Ottoman Liberals === The Congress of Liberal Ottomans in 1902, was an attempt to bring together the different resistance groups in Paris. Its aim was to create a unified direction to the movement to strengthen the opposition to Abdulhamid II. As explained earlier, the military branch of the movement had been active in the empire itself. Therefore, this congress was mainly in the presence of citizens in exile, who were a mix of the group that was already abroad and the students who joined later. From then on, this combination called itself the Young Turks. Unlike the previous student group, this group openly included Turkish Muslims. Disagreements caused the group to be divided into two flanks. One flank was led by Prince Sabahaddin, a cousin of the Sultan. He betrayed the ruling family and formed the Society of Ottoman Liberals, whose main goal was to overthrow the Sultan. In addition, it wanted to ask the British government for help. The other flank was spread across several small divisions throughout the Ottoman Empire and Europe. It had influential resources to spread its ideas to the rest of the population to gather support. In 1907, they started calling themselves the Committee of Union and Progress (CUP), with Ahmet Riza still heading it. It was later a political party that ruled the Ottoman Empire. Meanwhile, the military branch that was in the empire had organized itself by founding the Ottoman Freedom Society of Salonika. The civilians had clearly joined in the first years of the 19th century. Now, the military had arrived and officially joined the Young Turks movement, largely because of its complaints against the repressive Sultan. Finally, in 1907, the military group joined the CUP. Thus, the Young Turks had now formally combined its civil and military branches and was in fact ready to launch the 1908 revolution. == Ideology == === Origins === The ideology of the Young Turks started out from sentiments that originated in the 18th and the 19th centuries, when the Ottomans sent their intellectuals and elites to study in the West to catch up with the scientific advancements of the time in which the West led. The Ottomans who settled in the West often felt disappointed with the general development back home. From their perspective, the empire was declining from all fronts. They believed that Ottoman society's social and cultural beliefs were restrictive and so caused its decline. On the other hand, they believed that Western progress was caused by leading the world in the sciences, which helped their development. The sentiments of the time eventually led to a class of intellectuals who would become open to Western thought, which would be characterized by rationalism, materialism and liberalism. === Political Ideas === In the public pamphlets that the Young Turks spread, they would show themselves to the public as a very devout Islamic movement. In one of the pamphlets, they even accused the Sultan of being a secret atheist. However, in their more private writings, the Young Turks would discuss totally different kinds of views and be more critical of traditional Islamic authorities. Their world view revolved around terms like positivism, nationalism, and constitutionalism. Positivism had a major role in their world view, which many of them acknowledged as well. Positivism supports a very scientific and rational way of looking at the world, which made it very popular for the Young Turks. It was a good ideological foundation for the Young Turks because it reinforced their critical opinions on religion and the clergy. This focus on science and the quest of finding a scientific outlook made positivism attractive for them. A very important ideological belief of the Young Turks was their nationalism, partly as a reaction to the European imperial politics that they experienced at their time. However, the movement was split into groups who supported different forms. Some wanted a pan-Islamic form of nationalism, whilst some were pan-Turkic, however the official line of the party (crucially for the 1908 revolution) was pan-Ottomanism. In their leaflets, the Young Turks proclaimed that they wanted to restore the constitution of 1876, which they believed had been neglected by their time's Ottoman rulers. The Young Turks had other motives to their constitutionalism. The return to an active constitution would be a means to change other things within the empire. One of the social changes that they wanted to see was the creation of a strong state, which would be ruled by an intellectual elite. In the new state, the law would not be based on religion, and there would be a strong separation with the religious institutions. Eventually, the state would represent a Turkish nation, which was controversial since some of the Young Turks were not Turkish themselves. For the Young Turks, constitutionalism was a means to catch up to the west. === Influence on Atatürk === Whilst Atatürk wasn't a member of the Young Turks himself, his policies were greatly influenced by their ideology. His initial secularization of branches of Turkish society was a continuation of CUP policies from between 1913 and 1918. He also agreed with positivist and nationalist elements of Young Turk ideology. However, after Atatürk took power he tried to distance himself and discredited the Young Turks as he wanted to be the focal point of the new Turkish Republic. == Revolution and legacy == In 1908, the Turkish revolutionaries overthrew the Ottoman authorities in the Young Turk Revolution and claimed to have established a regime that would be democratic, unlike the Ottoman absolutes monarchs. After restoring the constitution, the Young Turks were involved with other challenges during their ten years of government such as conflicts with the West and the constantly-revolting minorities within the empire. However, the Young Turks implemented a lot of important changes. The implementation of a language law in 1915 created the legal basis to establish that accounts were be managed in Turkish, which helped educated Turks work for European companies. That formalized language requirements for companies and eventually society. Other important reforms brought by the Young Turks were the steps made for the further emancipation of the empire's women like by supporting the role of women in society and the workforce, allowing education for more women, building girls' schools, and allowing female students in Istanbul University. == The 31st March Incident == After the 1908 revolution, the Young Turks brought back the constitution and limited the Sultan’s powers, marking the start of a period called the Second Constitutional Era. However, tensions kept growing between conservative religious groups, insurgent soldiers, and the modernizing officer corps. The revolt broke out on the night of 12-13 April 1909, which corresponded to 31 March 1325 in the Rumi calendar. The revolt was set off by complaints over poor pay, harsh discipline, and resentment toward the secular changes pushed by the CUP. Many of the mutineers were supported by the reactionary faction led by the preacher Derviş Vahdeti and the Mohammedan Union, an Islamist organization. In response, Mahmud Shevket Pasha gathered the Action Army in Thessaloniki, consisting of three army groups loyal to the CUP. The force marched into Istanbul on 24 April 1909 and fought the rebels in key neighborhoods. Within days, the uprising was crushed by the superior organization and firepower of the Action Army. On 27 April 1909, Abdul Hamid II was declared unfit to rule and deposed by the Ottoman Parliament, then replaced by his brother, Mehmed V.Chisholm, Hugh, ed. Encyclopædia Britannica. 11th ed. Vol. 1. Cambridge: Cambridge University Press, 1911. s.v. “Abd-ul-Hamid II.” This move solidified the CUP’s dominance and pushed the government towards a more centralized, one-party rule. The crisis also showed the fragility of constitutional governance, hinting at further internal conflicts before World War I. == Involvement in WWI == === Entry to the War === The Young Turks were in charge of the Ottoman Empire during the First World War. They made a secret deal with Germany to join the Central Powers in 1914, because they were scared of Russian and British threats to Ottoman territory. === Armenian Genocide === During WW1, the Young Turks committed a genocide against Armenians because they wanted a ethnically homogenous nation, and wanted to make the country more Turkish and Muslim. They were also scared that the Armenians would help the Young Turks' war enemies, especially the Russians. Historians estimate that between 600,000 to 1,500,000 Armenians died. Hundreds of thousands were forcibly deported from their homes to the far east of the empire, such as Syria and Mesopotamia. Many died of starvation along the way, or were executed by military forces of the Young Turks at some point during the journey east. Children whose parents were killed were often forcibly converted to Islam. Prominent Young Turks Enver Pasha and Talaat Pasha were convicted of war crimes for their involvement and sanctioning of the genocide. == References == Category:1900s in the Ottoman Empire Category:20th century in Turkey",
 "title": "Young Turks"
}