{
 "id": "900808",
 "text": "1980 Turkish coup d’état is the third coup in the history of Republic of Turkey led by Kenan Evren, which overthrew the 1980 government of Turkey. Before the 1980 coup d'état, there were two other coups carried out in 1960 and 1971. The coup d’état of 1971 and 1980 took place due to similar motivations as they aimed to fix the country’s economic and political problems. The political problems specifically included political instability caused by the violence between left- and right-wing political groups. However, the political violence between left- and right-wing political groups was only lightened after the coup of 1980. Both of the economic and political issues that motivated the coup were believed to be caused mostly by Ecevit's regime. In addition to the internal economic and political issues in Turkey between 1970-1980, there were also external actors like U.S. who were believed to intervene in the 1980's coup's process. On 12th September 1980, the coup was carried out. As the consequence of the coup, martial law was declared and Kenan Evren became the new president of Republic of Turkey. In the aftermath of the coup, large scales of human rights violations were carried out. These violations were later on discussed within the international arena. == Before the Coup == === Political Instability === The political problems that motivated the coup was due to the political instability in Turkey between the period of 1970-1980. The political instability was shaped by the violence between left- and right-wing political groups and therefore the coup aimed to ease the violence between these groups. The army's stance, which carried out the coup, towards this political violence was more in support of the reduction of the left wing ideology and groups. There were two reasons regarding why the army was in support of right wing groups more, compared to their support for left-wing groups. The first reason was due to the unpopularity of communist ideology among the Turkish army. The army that carried out the coup was characterized by nationalist ideology. Therefore, communism was seen as a factor endangering this national unity, and thus the notion of nationalism, in Turkey. As a result, the political instability in Turkey became one of the motivations of the army to carry out the coup of 1980. The second reason why the army had an unfriendly view about communism was because of the Turkey-NATO relations. Turkey became a member of NATO in 1952, establishing its stance against communism's spread. Therefore, the 1980 Turkish army believed that rising communism in Turkey, being a NATO member state, could damage its relations with other NATO member states. Thus, isolating the rising communist movements became the second motivation for the army to carry out a coup. In this respect, the army and their nationalistic and anti-communism ideology was mainly supported by the Nationalist Movement Party (Turkish: Milliyetçi Hareket Partisi (MHP)). On the other hand, MHP believed that the arising communist groups were supported by Republican People’s Party (Turkish: Cumhuriyet Halk Partisi (CHP)), which was represented by Bulent Ecevit as the prime minister of Turkey. Thus, MHP and the Turkish army accepted Bulent Ecevit as the reason for Turkey’s political and economic instability. === Economy === The Turkish economy between 1970-1980 was deteriorating. This economic depression led to lack of access to oil, basic goods like food, and high levels of unemployment. The depression was due to Bulent Ecevit’s unsuccessful economic policies, 1973-74 Oil Crisis and U.S. embargo on Turkey after the 1974 Cyprus Peace Operation. Combined with political instability, the economic recession was leading to lower living standards in Turkey. The economic policies of Ecevit in the beginning years of 1970s were enabling the county to grow at a constant rate. However, the oil crisis after the Yom- Kippur War caused one of the most drastic downfalls of Turkish economy in 1976. Secondly, after the 1974 Cyprus Peace Operation, Turkey was embargoed by U.S. In addition to the already existing economic issues and the oil crisis, the embargo put more pressure upon the Turkish economy. Despite the debate that the US established the embargo as an outcome of the 1974 Cyprus Peace Operation, Ecevit claims in an interview that the embargo has already been established by the U.S. before the 1974 Cyprus Peace Operation was carried out. In general, the Turkish economy under Ecevit’s regime was experiencing recession because although he was applying policies to tackle the recession, his policies were not strong enough to establish an improved economy. Therefore, Ecevit’s regime came to be characterized by both economic crisis and internal political unrest, and the interrelating problems they have caused. == The Allegations of Western Intervention == Although the 1980 coup d’état was motivated by the domestic political and economic factors persisting between 1970 and 1980, there has been a debate regarding West's connection to the 1980 coup d’état. One dimension of how this was discussed can be linked back to Iran and its geopolitical importance. Iran was perceived as a geopolitically important country for the West since it is an oil-rich country as well as one of the significant oil-supplier to the West. The West had concerns that the oil supply from Iran might be at risk when USSR invaded Afghanistan in 1979. Afghanistan, which neighbors both Iran and former USSR, acted as a buffer zone against USSR expansionism into the oil-rich countries, which included Iran as well. The West feared this invasion since the it could mean that the oil-supply to the West might be disrupted and owned by USSR. The discussion regarding how the West could have been involved in the 1980 Turkish coup d’état's upbringing starts with the discussion of U.S. military being deployed in this region. In order to fight against any further Soviet expansionism into Iran, the U.S. decides to deploy a military belonging to U.S. in a geopolitically beneficial country which is also closer to Iran. The Western powers believed that the most geopolitically suitable country to deploy their army to would be Turkey. However, for a U.S. military force to be deployed in Turkey, the U.S. believed that Turkey needed to obtain a more stable economy and political environment. What U.S. found problematic about the political environment of Turkey is argued to be the rise of communist movements in Turkey. Therefore, U.S. believed that such a coup also aiming to ease the communist movements is highly important for the efficiency of the U.S. army to be deployed in Turkey. As a result, the Soviet invasion of Afghanistan indirectly affected how the West, mainly consisting the U.S., supported the 1980 Turkish coup d’état. == The Coup and its Aftermath == On the morning of 12th September 1980, approximately at 3 A.M, the coup took place declaring a curfew. The 1980’s coup d’état led to the suspension of democracy and a shift into an authoritarian military rule. The parliament was dissolved and the existing political parties were abolished. Trade unions were closed down since they were seen as communists threats. Although the National Security Council that overthrew the government declared that it would eventually return the power to democratically elected civilians, Turkish Military ruled the country for 3 years. === Human Rights Violations === Many people were arrested on the morning of 12 September 1980. After coup d’état the cases of torture in Turkey rapidly increased and first executions in ten years were carried out in a month. Prisoners were beaten, intimidated, humiliated and starved. After a global pressure, the state opened an investigation. According to the report in 1982 published by the Turkish State authorities, only four of the alleged 204 deaths were caused by torture. The Military also implemented a nationwide treatment programme called mixing for peace. This programme enforced the cohabitation of leftist and rightist prisoners. This was perceived as a mental torture by some prisoners, while the others believed that they were all the victims of the coup d’état. The Constituent Assembly, consisting of 160 members, implemented a new constitution which strengthened the military’s power and state authority. The purpose of the 1982 constitution was to ensure that the country was safe from political polarization of 1970s. === January 24th Decrees === It was a programme designed to help Turkey overcome the economic crisis before the coup d’état. With the guidance of International Monetary Fund (IMF), the purpose of the programme was to encourage foreign investments and trade. The provisional government kept following the programme. Furthermore, the designer of the programme, Turgut Özal, was appointed as the finance minister of the military government. == References == Category:1980 in Asia Category:20th century in Turkey",
 "title": "1980 Turkish coup d'état"
}