{
 "id": "901213",
 "text": "African immigration to the United States refers to immigrants to the United States who are or were nationals of modern African countries. Between the Immigration and Nationality Act of 1965 and 2017 the African born population in the United States grew to 2.1 million people. The term African in the scope of this article refers to geographical or national origins rather than racial affiliation. African immigration to Minneapolis/St. Paul is the biggest in the United States of America. Between 1990–2000, African immigration to Minneapolis/St. Paul was enough to grow the number of African people by 629%.http://www.americanimmigrationcouncil.org/research/diversity-and- transformation-african-americans-and-african-immigration-united-states ==Health== Akinsulure-Smith 2014 finds female genital cutting among many African immigrants to the United States of America.http://doi.org/10.1007/s10903-012-9763-7 Abdalla and Galea 2019, El- Dirani et al., 2022 and Agbemenu et al., 2022 and others say good things about Akinsulure-Smith 2014. ==Pathways== Most African immigrants to the United States of America are allowed to immigrate by the laws of the United States of America. Most African immigrants to the United States of America immigrate under family reunification visas or employment visas.http://doi.org/10.1017/CBO9781316018828.004 === Diversity Immigrant Visa === The Diversity Immigrant Visahttp://www.asanet.org/footnotes- article/african-immigration-and-the-black-immigrant-paradox/ is also named the green card lottery. The Diversity Immigrant Visa is also named the Diversity Visa Program. The Diversity Immigrant Visa is a program made by the Immigration Act of 1990. Some people come to the United States of America to stay forever. Those people come from other countries. Some of those countries have few of those people every year. The Diversity Immigrant Visa allows some more people born in those countries to get permission from the government of the United States of America to stay forever. Each year, 50,000 Diversity Immigrant Visas are given to random people. Almost 38% of the Diversity Immigrant Visas were given to African born people in 2016. African born persons also are the most biggest group among those people who ask for Diversity Immigrant Visas since 2013. The asking for a Diversity Immigrant Visa is free of charge. To ask for a Diversity Immigrant Visa you must have either a high school diploma or two years of a professional experience which requires at least two years of training. ==Yoruba immigration to the United States of America== Yorubas who come to the United States find something about Americans very strange. That thing is the way Americans behave towards pets. The way Americans behave towards pets is something that does not seem like the way Yorubas are used to doing things.https://link.springer.com/chapter/10.1007/978-3-319-30186-0_2 ==Which Africans immigrate to the United States of America?== Sub-Saharan Africans immigrants to the United States of America have higher levels of schooling than most people in the United States of America. Sub-Saharan Africans immigrants to the United States of America are more likely to have done their schooling in a Science, Technology, Engineering, and Math, or STEM field.http://research.newamericaneconomy.org/wp- content/uploads/sites/2/2018/01/NAE_African_V6.pdf ==References== ==Other things you should read about African immigration to the United States== *The Foreign-Born Population from Africa: 2008-2012 Category:Immigration to the United States Category:African-American people",
 "title": "African immigration to the United States"
}