{
 "id": "901322",
 "text": "Upper Swabia ( or ) is a region in Germany in the states of Baden-Württemberg and Bavaria.Brockhaus Enzyklopädie. 19. Auflage. Band 16, 1991, p. 72. The name refers to the area between the Swabian Jura, Lake Constance and the Lech. Its equivalent is Lower Swabia (Niederschwaben), the region around Heilbronn. ==Geography== The region of Upper Swabia is in the central south of Germany containing of the south-east of Baden-Württemberg and the south-west Bavarian Swabia region and is on the Iller-Lech Plateau, also known as the Upper Swabian Plain, one of the natural regions of Germany. The landscape of Upper Swabia is quite hilly rising from about 458 metres above sea level in the valley of the river Danube to 833 metres above sea level in the south-west of Upper Swabia only to decrease again to 395 meters above sea level at Lake Constance. The European watershed also passes through the region, with some rivers releasing into the Danube (ultimately flowing into the Black Sea) and others releasing into Lake Constance (ending in the North Sea). Upper Swabia is still a rural area dominated by villages. The urban population is concentrated in the cities of Friedrichshafen, Ravensburg & Weingarten and Biberach an der Riß as well as Memmingen and Günzburg. ==Administration== Upper Swabia is part of the Tübingen, a being a sub-division of a federal state. The following districts are wholly or partially part of Upper Swabia: * Alb-Donau * Biberach * Bodenseekreis (Lake Constance) * Ravensburg * Reutlingen * Sigmaringen * Ulm ==Related pages== * Baden-Württemberg * Swabia region * Upper Swabian Baroque Route == References == ==Further reading== * * * * * * * * * * * * * * * * * * * * * ==Other websites== * Webpage of the Upper Swabian Tourist Office * German webpage of the Upper Swabian Baroque Route * German webpage of the Swabian Spa Route * German webpage of the German Half-Timbered Buildings Route * German webpage of the Upper Swabian Mill Route",
 "title": "Upper Swabia"
}