{
 "id": "901526",
 "text": "The Federal Republic of Cameroon was established on 1 October 1961 as a result of the union between the Republic of Cameroon, former French Cameroon and the Southern Cameroons, part of the former British Cameroon. The existence of the two Cameroon is a major consequence of the World War I which also took place on Cameroonian soil. The Federal Republic of Cameroon lasted from 1 October 1961 to 20 May 1972 and was made up of two states : * East Cameroon (former Cameroon under French rule), * West Cameroon (former Southern Cameroons, part of Cameroon under British rule). == History == === From multiparty to one- party system === On 11 November 1961, Ahmadou Ahidjo invited the other parties in the Assembly to join the UC to found a single Cameroonian party in order to develop the Cameroonian society and economy: \"I say straight away that it is desirable that in Cameroon there should be a large unified party. In any case, I personally wish it after an agreement between the different parties that exist. A great unified national party into which Cameroonians would freely enter, after being convinced. A party in which there is democracy, freedom of expression, freedom of discussion; a party in which there can be several tendencies, with the understanding that the minority supports the opinions of the majority. The Union of the Peoples of Cameroon led by Theodore Mayi Matip, the Cameroon Socialist Party led by Charles Okala and the Cameroon Democrats Party led by André-Marie Mbida refused to accept the President's authoritarian drift3. On 27 April 1962, John Ngu Foncha and Ahmadou Ahidjo formed the 'National Unity Group' which included all the deputies of the Federal Assembly and the UC-KNDP Coordination Committee whose goal was to suppress political pluralism in the two federated states. == Institutions == === Executive === The electorate votes for a five-year mandate by direct universal suffrage and secret ballot for the President of the Federal Republic and a Vice-President from a different federal state than the President. The president is the head of the armed forces, the state and the federal government. === Legislative === The Federal Assembly is composed of 50 deputies calculated on the basis of 1 deputy per 80,000 residents. They are distributed as follows: 40 deputies for East Cameroon and 10 for West Cameroon. In East Cameroon, the 40 deputies were divided according to regions: 14 deputies for the North, 10 for the Centre- South, 8 for the West, 5 for the Littoral and 3 for the East. === In Western Cameroon === West Cameroon has an Assembly of Traditional Leaders and a Legislative Assembly. The Legislative Assembly of Western Cameroon is composed of 37 representatives. === In East Cameroon === As the traditional power has not been officially recognized in the political arena of the former French Cameroon, the Legislative Assembly of this part of the Federal Republic of Cameroon is unicameral. Category:1961 establishments in Africa Category:Establishments in Cameroon Category:1972 disestablishments Category:Former countries in Africa",
 "title": "Federal Republic of Cameroon"
}