{
 "id": "901611",
 "text": "The Second Kretschmer cabinet or Cabinet Kretschmer II is the current state government of Saxony after the 2019 Saxony state election on September 1, 2019. The Cabinet Kretschmer II is a coalition between the political parties CDU, led by Minister-president of Saxony Michael Kretschmer, Bündnis 90/Die Grünen and the SPD. In the 4th session of the 7th Saxon State Parliament on December 20, 2019, the Saxon Minister-president Michael Kretschmer, who has been in office since December 13, 2017, was re-elected to this office with 61 votes and 57 against. At least 5 members of the coalition voted against Michael Kretschmer. 118 of the 119 Members of Parliament took part in the election. == Members of the state government == Government office Picture Name Party State Secretary Party Minister-president Michael Kretschmer CDU First Deputy of the Minister President Wolfram Günther B'90/Die Grünen Saxon State Ministry for Energy, Climate protection, Environment und Agriculture (SMEKUL) Gerd Lippold Gisela Reetz B'90/Die Grünen Second Deputy of the Minister President Martin Dulig SPD Saxon State Ministry for Economic Affairs, Labour and Transport (SMWA) Hartmut Mangold Ines Fröhlich SPD Saxon State Ministry of the Interior (SMI) Roland Wöller CDU Thomas Rechentin Head of office CDU Saxon State Ministry of Finance (SMF) Hartmut Vorjohann CDU Dirk Diedrichs Head of office non-party Saxon State Ministry of Justice and for Democracy, European Affairs and Equality (SMJ) Katja Meier B'90/Die Grünen Mathias Weilandt Gesine Märtens B'90/Die Grünen Saxon State Ministry of Education (SMK) Christian Piwarz CDU Herbert Wolff CDU Saxon State Ministry of Science (SMWK) Sebastian Gemkow CDU Andrea Franke CDU Saxon State Ministry of Culture and Tourism (SMWK) Barbara Klepsch CDU Saxon State Ministry of Social Affairs (SMS) Petra Köpping SPD Uwe Gaul (until July 5, 2021) Sebastian Vogel (since July 6, 2021) Dagmar Neukirch SPD Saxon State Ministry of Regional Development (SMR) Thomas Schmidt CDU Frank Pfeil non-party Head of the Saxon State Chancellery and State Minister of Federal matters and Media Oliver Schenk CDU Thomas Popp Digital Administration and Administrative modernization (Member of the state government) Conrad Clemens Authorized representative of the free state Saxony to the federal government of Germany CDU == References == == Other websites == * Gemeinsam für Sachsen - Koalitionsvertrag 2019 bis 2024 Category:Saxony",
 "title": "Second Kretschmer cabinet"
}