{
 "id": "902333",
 "text": "Fustanella (; ; ; ; ) is a pleated, or folded, skirt like a Scottish kilt. It is worn by men from different countries in Southeast Europe. ==History== The fustanella originates from ancient Greek clothing like the chiton (or tunic) and the chitonium (or short military tunic).; . An ancient Greek statue in Attica shows a stonecutter named Archedemus wearing a folded skirt like the fustanella.. The ancient Roman toga may have also impacted the development of the fustanella.. In the Byzantine Empire, the fustanella was worn and called the podea ()... It was commonly used in Greek lands as early as the 12th century AD.. In Byzantine art and music, the wearer of the podea was either a hero or a Greek warrior defending the empire's borders.; . The fustanella was part of a military outfit consisting of bows, swords, battle-axes and armor (corselet or chain mail). In the Ottoman Empire, the fustanella was worn by Greek guerillas like the klephts and the armatoloi.; ; . In Albania, the fustanella is first mentioned in 1335 in a list of items taken from a sailor at the port of the Drin River.. The Albanian fustanella is based on the Greek fustanella.. But the difference is in the number of pleats. The \"Bridegroom's coat\" is a Greek fustanella with two-hundred pleats that a bride would buy as a wedding gift for her groom.; . The Albanian fustanella has around sixty pleats or usually a moderate amount of folds.. ==Gallery== File:Young man exomis Musei Capitolini MC892.jpg|Statue of a young man wearing a chiton; Roman copy of a Greek original (4th century BC). File:Bosniangraves bosniska gravar februari 2007 stecak stecci3.jpg|Gravestone depiction of an Aromanian wearing a fustanella (15th century AD). File:Lord Byron in Albanian Dress by Phillips, 1813.jpg|Lord Byron in Albanian Dress painted by Thomas Phillips (1813). File:Dupré - Warrior of Sellaida.jpg|Souliote Warrior painted by Louis Dupré (1820). File:A Souliot in Corfu Nikolos Pervolis, by Louis Dupré - 1827.jpg|A Souliot in Corfu Nikolos Pervolis painted by Louis Dupré (1827). File:Fustanella Greek Costume 1835.JPG|Greek general of the Royal Phalanx in full dress uniform (1835). File:Скотти - На карнавале в Венеции.jpg|At the Carnival in Venice painted by Mikhail Scotti (1839). File:Albanian fustanella - 1850 - 1900.jpg|A group of upper-class Albanians in typical dress (circa 1850–1900). File:Hamza Kazazi.jpg|Albanian leader Hamza Kazazi (circa 1858). File:Haag Carl - Greek Warrior - Google Art Project.jpg|Greek Warrior painted by Carl Haag (1861). File:Greek and Arnaut 1862 Fustanella.jpg|Russian picture of a Greek and an Albanian (1862). File:Jean-leon gerome arnaut fumant.jpg|Arnaut Smoking in Cairo, Egypt painted by Jean-Léon Gérôme (1865). File:Ilio voivoda.jpg|Ilyo Voyvoda, a Bulgarian Macedonian revolutionary (1867). File:Ottomcostumes1873_planche19_janina.jpg|Albanian costumes with the fustanella from Yanina (1873). File:Arnaut-in-Cairo.jpg|Albanian in Cairo by Jean-Léon Gérôme (circa 1880). File:Jean-Léon Gérôme – Albanian Officer (Officier Arnaoute), 1894.jpg|Albanian Officer painted by Jean-Léon Gérôme (1894). File:Spiridon louis.jpg|Spiridon Louis, Olympic marathon champion (1896). File:Vlach Shepherd.png|Vlach shepherd in traditional attire (early 1900s). File:BASA-1932K-1-426-5-Georgi Kasapcheto.jpg|Aromanian leader Ioryi Mucitano (early 1900s). File:Yannis Ramnalis-1.jpg|Ioannis Ramnalis, a Greek Macedonian revolutionary (after 1908). File:Greek Fustanella - Vervena, Arcadia, Greece.jpg|Old man wearing the fustanella in Arcadia, Greece (circa 1920s). File:Royal Guard of Albania.jpg|Royal Guard of Albania (1921). File:Sarakatsani Western Macedonia 1935.jpg|Sarakatsani, or Greek nomads, in Western Macedonia, Greece (1935). File:Sarakatsani Thrace 1938.jpg|Sarakatsani, or Greek nomads, in Thrace (1938). File:EVZONES GROUP.JPG|Changing of the guards at the Tomb of the Unknown Soldier (2005). File:Greek guard uniforms 1.jpg|Greek Presidential Guard officer, Athens (2007). ==Related pages== *Kilt ==References== ===Citations=== ===Sources=== * * * * * * * * * ==Further reading== * * * * ==Other websites== * The New Hellenic State (1833 - our days): Fustanella Category:Bottoms (clothing)",
 "title": "Fustanella"
}