{
 "id": "902603",
 "text": "Badhaai Ho () is a 2018 Indian Hindi-language comedy-drama film. It was directed by Amit Ravindernath Sharma. It was also produced by Sharma, Aleya Sen and Hemant Bhandari under Chrome Pictures and Vineet Jain under Junglee Pictures. The movie stars Ayushmann Khurrana and Neena Gupta with Gajraj Rao, Surekha Sikri, Shardul Rana and Sanya Malhotra in supporting roles. The film tells the story of a middle-aged couple who get pregnant, much to the disappointment of their sons. Based on a script written by Shantanu Srivastava and Akshat Ghildial and a story conceived by Jyoti Kapoor. The plot is loosely based on the 1994 Malayalam movie Pavithram starring Mohanlal and Shobana. Badhaai Ho got positive reviews and it was also a commercial success. With earnings of over against a budget of , it became the ninth-highest-grossing Bollywood film of 2018. The film won four awards at the 64th Filmfare Awards, including Best Actress (Critics) for Gupta, Best Supporting Actress for Sikri, and Best Supporting Actor for Rao. It also won two National Film Awards: Best Popular Film Providing Wholesome Entertainment, the first time where two films featuring the same lead actor (Khurrana) has won both Best Film awards at the National Awards as Andhadhun won Best Film, and Best Supporting Actress for Sikri. In 2022, a spritual sequel to the film titled Badhaai Do was released. ==Cast== * Ayushmann Khurrana as Nakul Jeetendra Kaushik * Neena Gupta Mehra as Priyamvada \"Bubbly\" Jeetendra Kaushik, Nakul's mother * Gajraj Rao as Jeetendra \"Jeetu\" Dhirendra Kaushik, Nakul's father * Surekha Sikri as Durgamati Dhirendra Kaushik, Nakul's grandmother * Sanya Malhotra as Renee Shekhar Sharma / Renee Nakul Kaushik, Nakul's wife * Sheeba Chaddha as Sangeeta Shekhar Sharma, Nakul's mother-in-law * Shardul Rana as Vishwas \"Gular\" Jeetendra Kaushik, Nakul's younger brother * Sobbie Bawa as Rahul, Nakul's friend * Farabi Md Refat as Nitesh, Nakul's friend * Alka Badola Kaushal as Guddan Dhirendra Kaushik, Nakul's fraternal aunt * Alka Saxena Amin as Kokila Ramakant Kaushik, Nakul's paternal aunt ==References== Category:2018 movies Category:2010s Indian movies Category:Hindi-language movies",
 "title": "Badhaai Ho"
}