{
 "id": "902666",
 "text": "Senor Abravanel (12 December 1930 – 17 August 2024), known professionally as Sílvio Santos (), was a Brazilian media businessman, television producer, and television host. He was the owner of SBT, the second largest television network in the country. His net worth was US$3.2 billion in 2020.Meet TV Star Silvio Santos, Brazil's First Ever Celebrity Billionaire He was the host of the second longest running Brazilian program: Programa Silvio Santos from 1963 to 2023. Santos has been called the greatest personality in the history of Brazilian television. ==Early life== Santos was born in Rio de Janeiro in 1930. He was the son of Sephardic Jewish immigrants. He worked on the streets of Rio de Janeiro as a street vendor at the age of 14, selling plastic cases for storing voter registration cards. Some people liked his his voice, that he was invited to try out for a job at Radio Guanabara, but quit after a month because he made more money as a street vendor. Santos graduated from Colégio Estadual Amaro Cavalcanti in Rio de Janeiro. ==Career== Santos began focusing on a broadcasting career during his free days and soon joined Rádio Mauá. He later moved to Rádio Tupi, where he began working at Rádio Continental in Niterói. He travelled by ferry from Rio. He then saw another chance by entertaining the ferry passengers, where he would play music. He quit Rádio Continental to focus on the ferry entertainment instead. Santos changed his name from Senor Abravanel to Silvio Santos; his mother Caro had been calling him \"Silvio\" instead of \"Senor\" since it was easier to pronounce, while his surname came from having once said \"que todos os Santos me ajudem\" (\"may all the Saints help me\") before going on the air. In the 1960s, he would move to São Paulo to focus on his television career. In 1960, TV Paulista signed Santos to host a television program—Vamos Brincar de Forca. He would also go on to host other shows for TV Tupi. In 1963, he began working on a Sunday afternoon variety show on TV Paulista, Programa Silvio Santos. In 1966, TV Paulista became part of the new Rede Globo, which signed Santos to a five-year deal. He opened a studio, Estudios Silvio Santos Cinema e Televisao in 1974. In 1975, Santos became the first Brazilian television personality to own their own broadcast station. In the late 1980s, the television station Sistema Brasileiro de Televisão (SBT) was created due to his show's popularity and he would have an executive role in the station as a result. Santos would go on to host Programa Silvio Santos until February 2023, when he stopped hosting due to his old age and health problems. Santos would also step down from his role as vice president of SBT in April 2023. ==Personal life== Santos was married to Maria Aparecida Vieira from 1962 until her death in 1977. He then married Íris Abravanel in 1978. He had six children. Santos died on 17 August 2024 from problems caused by bronchopneumonia at hospital in São Paulo, Brazil at the age of 93. He had been hospitalized for over two weeks with H1N1. Santos was buried in a Jewish cemetery in São Paulo the same day. ==References== ==Other websites== * * Official SBT site * Official Group * Category:1930 births Category:Brazilian television presenters Category:Businesspeople from Rio de Janeiro Category:2024 deaths Category:Deaths from bronchopneumonia Category:Deaths from influenza",
 "title": "Silvio Santos"
}