{
 "id": "902683",
 "text": "Antonio Segni was born 2 February 1891, son of Celestino Segni and Annetta Campus. His paternal family had distant Ligurian origins: his father, a practicing catholic and political moderate, lawyer and free lecturer in economics at the University of Sassari, was a municipal and provincial councilor. In the Giolitti era he served for a brief period as deputy mayor. In July 1913 Segni graduated with honors in jurisprudence at the University of Sassari defending a thesis titled Il vadimonium, a highly valued study on civil procedure in Roman law. He completed his study in Rome under Giuseppe Chiovenda, whose favorite pupil he became. In this authoritative jurist’s studio he met Piero Calamandrei, which was the beginning of a life-long human and scientific relationship. When the Great War broke out, he was called under arms as an artillery officer. After the demobilization he dedicated himself to the legal profession, continuing to deepen his knowledge of civil procedural law, in particular on the subject of interventions (L’intervento adesivo studio teorico-pratico, Rome 1919; L’intervento volontario in appello, Sassari 20). In 1920 he started his academic career as a lecturer at the Free University of Perugia, where he taught until 1925 and obtained an extraordinary chair. In 1921 he married Laura Carta Caprino, from a rich agrarian family, with whom he had four children: Celestino (1926), Giuseppe (1928), Paolo (1937) and Mariotto (1939); the youngest would become a political exponent on national level – a Christian Democrat deputy from 1976 to 1996 and MEP from 1994 to 1999 – and played a role of first importance in the transition period between ‘First’ and ‘Second’ Republic. In that same year Antonio Segni joined the Popular Party of Italy, for which he was to become a member of the national council in 1923. A year later he was a candidate for the Chamber of Deputies in the electoral college of Sardinia, ending on the first place of the non-elected. During the crisis caused by the murder of Giacomo Matteotti (1924) he participated in the Committee of Oppositions. When, however, the fascist regime entered into its harsh phase, he dedicated himself almost exclusively to the study of law, the solving of issues at the University of Sassari, advocacy and management of his estates. In 1925 he won a Chair at both the universities of Sassari and Cagliari and chose for the latter, where he was nominated head of the Faculty of Law. In 1929, however, he went to Pavia, where he taught only for one year. He returned to lecture Commercial Law in Sassari, where he was head of the faculty for two consecutive two-year periods. Together with Lorenzo Mossa he directed the review Studi Sassaresi and was director of the Juridical Institute. He closely followed the activities on the reform of civil procedure: especially his intervention in the Solmi bill, considered an expression of procedural authoritarianism, was of critical importance. He substantially accepted the ‘Chiovendian’ themes in Grandi’s draft law as elaborated by Piero Calamandrei, who showed his appreciation of Segni’s critical overview of essays on civil procedures by German legal specialists (Scritti giuridici, I, 1965, pp. 196-214). In April 1943, before an auditorium of Sassarese catholic academics, he seized the opportunity to deliver a courageous attack on the fascist regime, exaggerated nationalism and ‘state-idolatry’. In the wake of the armistice of 8 September 1943 he exhibited unusual energy and became effectively (before the arrival of Emilio Lussu in 1944) the most authoritative exponent of Sardinian antifascism. He was one of the most important founders and head of the island’s Democrazia Cristiana (CD), sustained by the Sardinian episcopate and in close contact with Alcide De Gasperi and Giuseppe Spataro. In that period of time he wrote a series of articles in Sardinian newspapers on the Italian region as an institute, in which he criticized an activist type of federalism, but first of all the centralism of the left and of the right. To Segni the region meant a ‘natural unit’, etched into the Italian landscape, a ‘geographical and economical, if not also ethnic reality’, an ‘autonomous organ’ as distinct from a ‘new intermediary organism’ that would only have added to state bureaucracy. An ‘autarchic, non-state-institute’, which in determined matters (e.g., agriculture, industry, commerce) was to substitute the state (Scritti politici, edited by S. Mura, 2013, pp. 27-57). In 8 October 1943 he was appointed by the Allied Military Command of Sardinia as extraordinary administrator of the University of Sassari, a function that he was to hold until 10 April 1945, when he was elected rector. (He resigned in 1951 when he was nominated Minister of Education). On 12 December 1944 he joined the Second Bonomi Government as undersecretary at the Ministry of Agriculture that was headed by the communist Fausto Gullo. This entailed between other things implementing a decree to extend agrarian contracts (DL nr. 146 of 3 June 1944), in particular Decree Gullo nr. 279 of 19 October 1944 on a multi-annual concession of uncultivated land to farmers and associates. His wholehearted dedication to the government’s policy put him in conflict with those sectors of the DC, in the South and in Sardinia, that protected the interests of large landowners. His personal results and that of the DC in the June 2 elections for the Sardinian Council, as well as the support of personalities like Paolo Bonomi, led to his appointment as minister of agriculture on 14 July 1946, in which function he concentrated his attention first of all on the growth of production necessary for improving the food situation in Italy. The first reform attempt Segni advanced was that of the agrarian contracts, but this was met with decisive opposition from the right and interest groups within the DC. De Gasperi himself advised prudence. The failure of this legislative proposal accelerated his efforts for agrarian reform. Already in 1947 Segni’s ideas were taking definite form. His memorandum of 21 September to the Prime Minister ended with a passionate address: “I want to press onto you to take the agrarian problem to heart. We must not fail to comply with our promises and our social guidelines. We must work to raise up the regions of the South that have remained behind, raise the conditions of the farm workers, deliver land reform and the formation of small holdings” (Dept. of History of the University of Sassari, Archivio Antonio Segni, Carteggio, f. 8, letter by Segni to De Gasperi). In the fall of 1949, agrarian revolt, mainly in the South, pushed the government to speed up reforms: on 2 December Segni presented his bill Provvedimenti per la valorizzazione dell’Altopiano della Sila (Measures for Land Reclamation on the Plateau of Sila) to the Senate. This regarded a zone that was particularly dominated by absentee landlordism. The decree, that was to become the Sila Law (Law 230 of 21 May 1950), turned out to be a general test for the reforms that were to come. In parallel, on 17 May 1950 Segni presented to the Chamber of Deputies the Decree-Law Norme per la espropriazione, bonifica, trasformazione ed assegnazione dei terreni ai contadini (Regulations for expropriation, land reform and land allotment to the farmers), a genuine Italian land reform law that drew its inspiration from constitutional principles (art. 1, 3, 42, 44). Segni himself had drafted the regulations of the reform, leveraging the collaboration of various agrarian economists, among whom Mario Bandini and Manlio Rossi-Doria. De Gasperi however, opposed to a national-scale agrarian reform, convinced him to focus on those regions, especially in the South, which were characterized by widespread latifundism. The ‘Provisional Law’ (Law 841 of 21 October 1950) passed in Parliament in 1950, but Segni, who had left the Ministry of Agriculture for that of Education in July 1951, was not able to personally assist in its implementation. In subsequent governments he engaged in the struggle against illiteracy, for the building of schools and for improvement of teaching methods. He did, however, not continue the reforms initiated by his predecessor, Guido Gonella. He endeavored to carry out the reforms in a gradual manner, but encountered strong resistance, also from ministries that were to finance the measures. His proposal to substitute the final exams in high school for university admission tests was rejected, otherwise that law would have coupled his name to an important change in the history of the Italian school system. His endeavors, although praised even by adversaries as less accommodating to religious interests than Gonella’s, lacked endurance and boldness. In 1954 Segni was called to the Chair at the University of Rome that was once occupied by his mentor Chiovenda. He was to teach civil procedural law, but penal procedure was added to his charge. In Rome Segni took an active interest in promoting the career of Salvatore Satta, who was his long-time friend and whom he continued to visit after his election to the Quirinal. On 6 July 955 he became first minister, leading a coalition cabinet composed by DC, the Partito Socialdemocratico Italiano (PSDI), the Partito Liberale Italiano (PLI) and with external support of the Partito Repubblicano Italiano (PRI). It was to become one of the most important governments in the history of the ‘First’ Republic. Italy’s admission to the UN and signature of the Treaties of Rome on 25 March 1957 meant a consolidation of its international role. For Segni, the integration of Europe in a world governed by the great powers was the only possible way. He manifested a strong and convinced pro-Europe attitude and was committed to further strengthening the relations with the German Federal Republic. In the complicated circumstances of the Suez Crisis in 1956 he was engaged in defending Italy’s economic interests without loosing sight of the need to safeguard Atlantic solidarity. He had some diverging points of view from those of Amintore Fanfani: the secretary of the DC was of the opinion that the government should take a more critical standpoint regarding the choices made by Britain and France. The events of 1956 in Hungary further widened the distance between Segni and Fanfani. Opposing anti- communist legislative measures in a sharp debate with the secretary of the DC, he threatened to resign. In his diary he noted: “The events in Hungary cause a lot of noise and are unfortunately being used for repressive political speculation. [...] I refuse any further speculation” (Diario (1956-1964), edited by S. Mura, 2012, p. 101 ff.). During his government the process of implementing the Constitution made a significant step forward: a law regulating the National Council of the Economy and Labor (CNEL) was approved, whereas the draft law on the Supreme Judicial Council passed scrutiny by the Senate. But most important of all was the entering into function of the Constitutional Court. “The first thing of historical importance” - administrative law expert Mario Bracci wrote to him – “is that you gave life to the Constitutional Court. Alone you couldn’t have done it, but without your unshakeable will to realize this point in your program, which for eight years remained an unfulfilled point in the program of all successive ministers, no one would have succeeded.” (Department of History of the University of Sassari, Archivio Antonio Segni, Attività politica 1955-57, f. 4: letter from Bracci to Segni, 26 May 1957). His government entered into crisis by a series of causes: the conflict with the president of the Republic, Giovanni Gronchi, who had a different vision of Italian foreign policy from that of foreign minister Gaetano Martino, created severe tensions. And once again the reform of the agrarian contracts turned out to be a major obstacle: unhappy with the provisions for the ‘just cause’, the liberals threatened more than once to withdraw their support for the government, whereas CISL, the Christian- Democratic trade union, warned that it was about to turn against the government. After the PRI joined the opposition, on 5 May 1957 also the PSDI left the cabinet and the following day Segni offered his resignation. The overall balance however of the twenty-two months of government was positive. “In conferring with our parliamentary friends yesterday,” wrote the sociologist Achille Ardigò to Segni, “I found in all (from Pastore to Fanfani, from friends of the “Base” to Andreotti, Oliva, Giacchetto etc.) a sincere consensus that went further than the usual political judgment or expediency. I’d like to add that many of us have understood that on various occasions you have tried to exceed the increasingly stifling limits of the four-party coalition and that, on the other side, the first period of your latest government so far has been unsurpassed for its courageous position-taking” (Department of History of the University of Sassari, Archivio Antonio Segni, Attività politica 1957-58, f. 4: letter from Ardigò to Segni, 15 July 1957). In the general elections of 1958 Segni did not obtain the hoped-for result. This time the candidate from Cagliari, Antonio Maxia, won most preferential votes in the electoral college of Sardinia. It did not preclude his entrance into the second Fanfani-led government, but it meant a weakening of his position. Segni had aspired to the Ministry of Foreign Affairs, but obtained Defense and the vice-presidency of the Ministerial Council. At a moment when Italy seemed to move lightly to the left, he endeavored to fulfill a role as guarantor of stability and continuity. With determination he sought to represent the interests of the armed forces (raising salaries and pensions, supplying more powerful arms systems and equipment). He accepted missile bases for atomic arms, convinced that they were an indispensable means to secure the Italian defense system, rather than a dangerous presence that exposed the nation to possible retaliations. After Fanfani’s resignation as first minister, as well as secretary of the party on 15 February 1959, the second Segni government was formed, a ‘mono-color’ Christian Democratic cabinet with external support from the liberals. Without a solid majority and sustained more than once by the cumbersome votes of the neo-fascist Movimento Sociale Italiano (MSI), Segni tried to buttress Atlantic solidarity and give a demonstration of Italy’s trustworthiness to its allies, at a moment of tension due to the Berlin question and France’s ambition to cut out a new role for itself in international politics. More comforting signals, though, came from the economy: industry and trade were expanding, unemployment was diminishing, Italy’s growth was higher than 6%, at a rhythm that placed it among the world’s most dynamic countries. The government, however, had taken a direction contrary to the course the party wanted to follow. The former was oriented toward the right, whereas the latter was opening to the left. The secretary of the Christian-Democatic party, Aldo Moro, chosen with Segni’s support, was moving toward a new political season. The secretary of the PLI, Giovanni Malagodi, withdrew his support to the government, officially because he did not share a number of its policy choices - among which the attempt to give the Regions an official status -, but also to avoid exasperating already existing misgivings within his party. Segni announced his resignation, without even considering continuing with the help of MSI votes. His name, however, kept coming up among the most authoritative for the formation of a new government and, in fact, the president of the republic charged him with the task, but he handled the negotiations rather indecisively. The secretariat of his party had recommended a coalition cabinet (DC, PRI and PSDI) with a program that reached out to the socialists. The Vatican hierarchies, in particular the Cardinals Giuseppe Siri and Domenico Tardini, spoke out against a left-oriented government and even threatened to found another party for Italian catholics. On 21 March 1960 Segni resigned his commission. In the successive government, that of Fernando Tambroni, which received support also by the MSI, he became minister of foreign affairs. The cabinet was short-lived and fell in the wake of the ‘Events of Genoa’ that evoked a strong anti-fascist reaction.[lv1] Segni, however, was confirmed as a foreign minister in a new Fanfani government and remained in charge until 6 May 1962. He strove principally for consolidation of the relations with the allied states, without qualms or claims for more autonomy; this way he represented a reassuring alternative to Fanfani’s boldness. He was the guardian of Italian Atlanticism in a season of openings to the left, a minister who was ready to slow down, if not to arrest, any adventurous opening to the Soviet sphere (he accompanied Fanfani to Moscow on his historical journey in August 1961). Segni dedicated special attention to European integration, as he was convinced that the process had to make several steps forward in order to strengthen the cohesion among the states and to forestall nationalism taking precedence. This did not prevent Segni from delivering a first-level contribution in the question of Alto Adige (or South Tyrol), where he capably and prudently represented Italian interests, also before the United Nations General Assembly. On 6 May 1962 he was elected President of the Republic in the ninth vote. His name as a possible candidate had circulated already from 1955, but careful planning was necessary to secure his election against resistance from within the DC, as well as among allied parties (the PSDI proposed Giuseppe Saragat as a candidate), as MSI votes were decisive for the outcome. Although he inaugurated his mandate with the statement “it is not my task to determine political orientations in the daily life of the state” (Atti parlamentari, Camera-Senato, joint session of 11 May 1962, page 71), he was actively involved in moderating the character of the center-left coalition. Segni was considered a person of reference by a sector that was quite concerned about the participation of the Partito Socialista Italiano (PSI) in the ruling coalition. This group comprised Governor Guido Carli of the Banca d’Italia and part of high-placed bureaucrats and the judiciary, of the army top, of Vatican hierarchies and of economic and financial circles. His power to condition affairs still increased in the aftermath of the general elections of 1963, but at the end of that year Moro and PSI secretary, Pietro Nenni, launched the first ‘organic’ center-left cabinet. The crisis in the summer of 1964 cast a shadow over his operations. The accusations, published in 1967 in the Espresso, of having prepared a coup d’etat together with the general of the Carabinieri, Giovanni De Lorenzo, former head of the military intelligence (SIFAR), were followed by a parliamentary inquiry and subsequently by various investigations that were more or less directed by the judiciary, such as the one following a lawsuit by De Lorenzo against the director of the Espresso, Eugenio Scalfari and a reporter of that magazine, Lino Jannuzzi. Only recently historiography has put the so-called coup into perspective (Franzinelli, 2014): Plan Solo (named Solo (‘Alone’) because it involved ‘only’ the army corps of the Carabinieri) decidedly provided for some disconcerting measures, such as the internment of citizens who were deemed dangerous, but the prime minister’s purpose was not to install an authoritarian regime. His intention was to safeguard public order against any power grab attempt - however improbable in practice - by the communist party of Italy (PCI). On 7 August 1964 he collapsed during a meeting with Moro and Saragat and was diagnosed with a grave and irreversible damage to the brain. Segni was substituted by the president of the Senate, Cesare Merzagora, and resigned on 6 December of the same year. Giuseppe Saragat succeeded him as President of the Republic. He died in Rome on the first of December 1972. \\----References. Writings, articles and essays. Scritti giuridici, I-II, Turin 1965; Diario (1956-1964), edited by S. Mura, Bologna 2012 (with a biographical note on page 7-13); Scritti politici, edited by S. Mura, Cagliari 2013. Sources and bibliography: the main archive, Archivio Antonio Segni, resides in the History Department of the University of Sassari. Various documents are stored in the Archivio Storico of the latter University, as well as in Rome, in the Historic Archive of the Istituto Luigi Sturzo, in the Historic Archive of the Senate and in the Historic Archive of the Presidenza della Repubblica. Moreover, in Rome, Archivio centrale dello Stato, Presidenza del Consiglio dei ministri, Consiglio dei ministri, Verbali; Ministero della Pubblica Istruzione, Direzione generale istruzione universitaria, Fascicoli professori ordinari (III versamento), b. 428, ad nomen; Università La Sapienza, Archivio storico, f. 4884, ad nomen; Atti e documenti della Democrazia cristiana: 1943-1967, I-II, Rome 1968. M. Brigaglia, La classe dirigente a Sassari da Giolitti a Mussolini, Cagliari 1979, ad ind.; O.M. Petracca, Il primo governo Segni, in: Il Parlamento italiano (1861-1988), XVII, 1954-1958, il centrismo dopo De Gasperi: da Pella a Zoli, Milan 1991, page 211-237; A. Giovagnoli, A. S., ibid., XIX, 1964-1968, il centro-sinistra: la stagione di Moro e di Nenni, Milan 1992, page 244-268; P. Craveri, La Repubblica dal 1958 al 1992, Turin 1995, ad ind.; G. Fois, Storia dell’Università di Sassari 1859-1943, Rome 2000, ad ind.; F. Scarano, A. S. e la politica estera, in 1989. Rivista di diritto pubblico e scienze politiche, XI (2001), 1, page 129-143; Per una storia della riforma agraria in Sardegna, ed. by M. Brigaglia, Roma 2004, ad ind.; M.L. Di Felice, Terra e lavoro, Rome 2005, ad ind.; E. Bernardi, La riforma agraria in Italia e gli Stati Uniti, Bologna 2006, ad ind.; F. Scarano, A. S., Konrad Adenauer e l’integrazione europea, in: L’Italia nella costruzione europea, ed. by P. Craveri - A. Varsori, Milan 2009, page 369-393; G. Mammarella - P. Cacace, Il Quirinale. Storia politica e istituzionale da De Nicola a Napolitano, Rome- Bari 2011, page 90-114; Il riformismo alla prova. Il primo governo Moro nei documenti e nelle parole dei protagonisti (ottobre 1963-agosto 1964), ed.by M. Franzinelli - A. Giacone, Milan 2012, ad ind.; S. Mura, Aldo Moro, A. S. e il centro-sinistra, in Studi storici, LIV (2013), 3, page 699-742; M. Franzinelli, Il Piano Solo. I servizi segreti, il centro-sinistra e il ‘golpe’ del 1964, Milan 2014, ad ind.; A. Giacone, Il capo dello Stato nella «Repubblica dei partiti», in: Presidenti. Storia e costumi della Repubblica nell’Italia democratica, ed. by M. Ridolfi, Rome 2014, page 103-109; L. Barbetta, L’Italia e l’avvio del processo di distensione internazionale (1955-1958), Milan 2015, ad ind.; M. Gervasoni, Le armate del presidente. La politica del Quirinale nell’Italia repubblicana, Venice 2015, ad ind.; A. Mattone, Il ministro A. S. ‘agrarista’. Politica e scienza giuridica nell’elaborazione della riforma fondiaria e della legge sui contratti agrari (1946-1950), in: Studi storici, LVII (2016), 3, page 523-576; Id., Storia della Facoltà di Giurisprudenza dell’Università di Sassari, Bologna 2016, ad ind.; S. Mura, A. S. La politica e le istituzioni, Bologna 2017. ==References== Category:1891 births Category:1972 deaths Category:Deaths from cerebral hemorrhage Category:Presidents of Italy Category:Prime ministers of Italy Category:Politicians from Sardinia",
 "title": "Antonio Segni"
}