{
 "id": "902820",
 "text": "An iron lung, also known as a tank ventilator or Drinker tank, is a type of ventilator which encases a person's body except for the head, and changes the air pressure in the space, to help them breathe.Shneerson, Dr. John M., Newmarket General Hospital, (Newmarket, Suffolk, U.K.), \"Non-invasive and domiciliary ventilation: negative pressure techniques,\" #5 of series \"Assisted ventilation\" in Thorax, 1991;46:131–35, retrieved April 12, 2020Rockoff, Mark, M.D., \"The Iron Lung and Polio,\", video (8 minutes), January 11, 2016, OPENPediatrics and Boston Children's Hospital on YouTube, retrieved April 11, 2020 (historical background and images, explanatory diagrams, and live demonstrations)Jackson, Christopher D., MD, Dept. of Internal Medicine, and Muthiah P Muthiah, MD, FCCP, D-ABSM, Assoc. Prof. of Medicine, Div. of Pulmonary / Critical Care / Sleep Medicine, Univ. of Tennessee College of Medicine-Memphis, et.al., \"What is the background of the iron lung form of mechanical ventilation?,\" April 11, 2019, Medscape, retrieved April 12, 2020 (short summary of iron history and technology, with photo)Grum, Cyril M., MD, and Melvin L. Morganroth, MD, \"Initiating Mechanical Ventilation,\" in Intensive Care Medicine 1988;3:6–20, retrieved April 12, 2020 The use of this device is usually for victims of polio and botulism. The use of iron lungs is largely not used because of more modern ways to help breathing problems, the invention of positive pressure ventilator, and since the eradication of polio. However, in 2020, the COVID-19 pandemic made some people think reusing this would be a good idea.\"Modern iron lung designed to address ventilator shortage,\", April 6, 2020, New Atlas, retrieved April 11, 2020Laderas, Crystal, reporter: \"Alberta team building modern 'iron lung' for COVID-19 in dire environments,\", (video & text), March 25, 2020, as updated March 26, 2020, City News / Citytv, Edmonton, Alberta, Canada – also broadcast as \"Bioengineers build modern 'iron lung’ for COVID-19 in dire environments: Scientists build a prototype 'iron lung' for COVID-19 patients in crisis environments. The machine is a last resort for patients when hospital ventilators are not available,\" (video only), March 25, 2020, 660 News / CityNews / Citytv, Calgary, Alberta, Canada, retrieved April 23, 2020 == Related pages == * Poliomyelitis * Botulism * Respiratory system * Breathing system ==References== Category:Medical equipment",
 "title": "Iron lung"
}