{
 "id": "90293",
 "text": "Mika Pohjola (born December 1, 1971 in Helsinki, Finland) is a jazz pianist and composer. He lives in New York City. ==Biography== Biography from www.mikapohjola.com Mika Pohjola lived in Vantaa, Finland, outside Helsinki until 1987. He started studying piano and music theory with his father, Heikki Pohjola in 1979. In 1982, he started singing in the Helsinki Cathedral boy choir, Cantores Minores. He then studied classical piano, music theory and counterpoint at the Vantaa Music Institute. After completing his classical studies, Pohjola moved to Stockholm, Sweden to study jazz music. He met Alvaro Is Rojas while studying at the Södra Latin Gymnasium. Is Rojas taught him piano improvisation and jazz ear-training for five years. Pohjola received a Master's Degree in Jazz Education at the Royal Swedish College of Music in 1992. Encouraged by Alvaro Is Rojas, Pohjola moved to Boston, Massachusetts to study at Berklee College of Music. His teachers included Herb Pomeroy, Gary Burton, Phil Wilson, Ed Bedner and Hal Crook. Pohjola also met many new music collaborators, such as Johanna Grüssner, Matt Penman, Roberto Dani, Fernando Huergo, Sophie Dunér and Yusuke Yamamoto. Pohjola graduated from Berklee with honors in 1994. That same year he recorded his first album, Myths and Beliefs (GM Recordings) produced by Gunther Schuller. In 1995, Pohjola moved to New York City and became a part of the downtown jazz scene. He briefly studied with pianist Sal Mosca. Pohjola performed at New York clubs such as the Blue Note, Birdland, the Five Spot, Smalls, The Jazz Standard and Visiones. His many bands featured saxophonists Chris Cheek, Mark Turner and Miguel Zenón, guitarist Ben Monder, bassists Matt Penman, Johannes Weidenmüller and Fernando Huergo, drummers Roberto Dani, Marlon Browden, Darren Beckett, Matt Wilson and Mark Ferber. In the 1990s, Pohjola often toured Europe, and performed in his native Finland, Sweden, Denmark, The United Kingdom, Germany and Italy. Pohjola was also invited to play in Ukraine in 1999, 2001 and 2002. In 2002 to 2005 Pohjola spent much time in his own recording studio, documenting ambitious arrangements of Scandinavian traditional and popular music. He released the catalogue of the original Moomin music on Moomin Voices (2003 in Swedish; 2005 in Finnish). His main collaborators included vocalists Theo Bleckmann, Rigmor Gustafsson, Lisa Werlinder, Sanni Orasmaa and Eeppi Ursin; and instrumentalists Alan Ferber, David Ambrosio, Christof Knoche, Laura Arpiainen and Ayumi Takeshima. He also recorded Scandinavian Christmas music on Scandinavian Yuletide Voices (2005), and a tribute to the Finnish legendary tango composer, Toivo Kärki on the album, Leivonen lumimyrskyssä (A Lark in a Snowstorm) (2006). Pohjola has since 1995 been a jazz piano principal at the Nilsiä Music Camp in Finland. Additionally, he has been a guest lecturer at many conservatories in Scandinavia. In 2006 Pohjola was invited as a lecturer to Berklee College of Music as a major visiting artist. Pohjola plays chacarera and jazz compositions with Argentinean bassist and composer Fernando Huergo. Pohjola also leads several groups in Finland, such as the popular Moomin Voices (in Finnish Muumilauluja-bändi) which often performs at children's events and festivals. ==Discography== Discography from www.scandinavianmusic.net ===Arranger and Producer=== Title Featuring Contents label Year Leivonen lumimyrskyssä Listen Henrik Lamberg Sanni Orasmaa Eeppi Ursin New arrangements of music by Toivo Kärki Change Records 2006 Scandinavian Yuletide Voices Listen Theo Bleckmann Rigmor Gustafsson Sanni Orasmaa Lisa Werlinder Eeppi Ursin Scandinavian Christmas Carols Change Records 2005 Moomin Voices – Muumilauluja Listen Mirja Mäkelä Eeppi Ursin The Finnish version of the Moomin songbook Change Records 2005 Moomin Voices – Muminröster Listen Johanna Grüssner The Swedish version of the Moomin songbook Change Records 2003 ===Jazz Composer and Pianist=== Title Featuring Label Year Two For The Road Jill Walsh Done Records 2008 Landmark Listen Ben Monder Miguel Zenón Fernando Huergo Roberto Dani Johanna Grüssner Abovoice/ Change Records 2002 The Music of Mika Pohjola Listen Miguel Zenón Chris Cheek Jill Seifers Siri Larsen Change Records 2002 Live at the Blue Note Listen Matt Penman Roberto Dani Change Records 2000 Announcement Listen Chris Cheek Matt Penman Roberto Dani YLE 1998 On the Move Listen Chris Cheek Matt Penman Roberto Dani MikaMusik 1997 Myths & Beliefs Listen Mick Goodrick Bruno Råberg Roberto Dani GM Recordings 1997 ===Co-leader and Sideman=== Title Featuring/Leader Label Year Nu blir sommar Listen Johanna Grüssner Change Records 2007 Live at the Regattabar Fernando Huergo Fresh Sound 2002 Sound of Village Listen Yusuke Yamamoto Splasc(H) Records 2001 Hur man räddar kärleken & annat Johanna Grüssner YLE 2000 Improvisations Gary Davis Heckard feat. George Garzone GDH Music 1997 Johanna Grüssner Band Johanna Grüssner feat. Casey Scheuerell Johanna Grüssner 1995 Orange Sophie Dunér Berklee College of Music 1994 ==References== ==Other websites== *Official Website *Moomin Voices *Scandinavian Music *Mika Pohjola at All About Jazz *Mika Pohjola at All Music Guide *Mika Pohjola at CD Baby Category:Finnish composers Category:Finnish jazz musicians Category:Pianists Category:1971 births Category:Living people Category:Musicians from Helsinki",
 "title": "Mika Pohjola"
}