{
 "id": "903033",
 "text": "Priscus of Panium () was a Roman diplomat and Greek historian from the 5th century AD...; . ==Biography== Priscus was born between 410 and 420 AD in Panium (or Panion), Thrace. He joined in 448/449 AD the Roman embassy, led by Maximinus and speaking on behalf of Emperor Theodosius II, on a diplomatic mission to the court of Attila the Hun.. While he was there, Priscus met and spoke with a Greek trader dressed in Hunnic clothes who was captured in around 441–442 AD when the Huns pillaged the city of Viminacium in modern Serbia.; ; .. The trader then told Priscus that he was a slave of a Hunnic nobleman named Onegesius, but got his freedom and chose to live among the Huns.. Priscus finally had a debate with the Greek defector about life and justice in both the Roman Empire and in barbarian kingdoms. Priscus traveled to Rome, Alexandria, and Egypt. In around 456 AD, he was with the staff of Euphemios as the magister officiorum of Emperor Marcian. Priscus died after 472 AD. ===Writings=== Priscus wrote in the Greek language a history of the Byzantine Empire in eight books. The books probably covered the time from the rise of Attila the Hun to the rise of Emperor Zeno, or from 433 up until 474 AD. Priscus was very influential in the empire and his books were used by different writers: Emperor Constantine VII Porphyrogenitus (Excerpta de Legationibus), Evagrius Scholasticus, Cassiodorus, Jordanes, and author of the Suda. The style of Priscus's writing is direct and his work is considered a trustworthy account of Attila the Hun, his court, and the admission of the Roman ambassadors. Priscus relied on a style of historiography that was part of an ancient Greek tradition dating back to the 5th century BC.. ===Collections=== The books of Priscus are published in four collections: * * * * ==References== ===Citations=== ===Sources=== * * * * * * * * ==Further reading== * * * ==Other websites== * *Georgetown University: \"Priscus at the Court of Attila\" (Translation by J. B. Bury) *University of Calgary: \"Priscus, fragment 8: Priscus at the Court of Attila\" Category:410s births Category:European diplomats Category:Ancient Greek historians",
 "title": "Priscus"
}