{
 "id": "903071",
 "text": "Gerhard Struber (born 24 January 1977) is a former Austrian player. Now he is football manager. He is head coach of Major League Soccer club New York Red Bulls. ==Playing career== He played most of his career at SV Austria Salzburg from 1995 to 2001. He won the Austrian Bundesliga in the 1996–97 season with Salzburg and the Austrian Super Cup in 1997. Before he retired he played with less known Austrian clubs. ==Coaching career== ===Red Bull Salzburg=== After in software systems and eight years in sales and management positions at an insurance company he Struber quit his job in 2014 to work as footbaal manager. He already worked part time as co-trainer in the academy of FC Red Bull Salzburg from mid-2007 to mid-2010 and as coach SV Kuchl for 20 months. In 2014 Struber became coach of the U 15 at the Red Bull Salzburg academy. ===FC Liefering=== In June 2017 he became coach of FC Liefering together with Janusz Góra. In this season he was also coach of the Red Bull Salzburg team in the UEFA Youth League. 2018–19 he became single head of Liefering. In January 2010 he left to make his UEFA Pro Licence.Gerhard Struber gibt Traineramt beim FC Liefering ab. Salzburger Nachrichten . 4 January 2019. ===Wolfsberger AC=== 2019-20 he became head coach of Wolfsberger AC in the Austrian Bundesliga. ===Barnsley=== On 20 November 2019 Struber was appointed as manager of EFL Championship side Barnsley.\"Gerhard Struber: Barnsley appoint Wolfsberger AC boss as head coach\". BBC Sport. 20 November 2019.Struber: “Diese Chance ist was ganz besonderes als österreichischer Trainer”. Sky Sport. 23 November 2019. Barnsley was at the bottom of the league seven points away from safety. With two wins in the injurie time against Nottingham Forest and Brentford they fixed the place in the league. ===New York Red Bulls=== On 6 October 2020 Struber became head coach of Major League Soccer team New York Red Bulls. The Red Bulls paid an unknown sum to Barnsley in order to sign him. Struber made his coaching debut for the club in a 3–2 MLS Cup Playoffs loss against the Columbus Crew on 21 November. At the end of the season they were in the play- offs but lost the first round after a 0:0 with 0:1 in extra time versus Philadelphia Union.Weltfussball.de:MLS Play-offs ===FC Red Bull Salzburg === At the end of July 2023, he returned to Red Bull Salzburg as Matthias Jaissle's successor. He received a contract running until 2025 FC RB Salzburg Homepage The 2023/24 season did not go as planned. The club was eliminated in the group stage of the UEFA Champions League. Although Salzburg finished first in the league after 26 matches, Struber was dismissed in April 2024 after two games without a win. FC RB Salzburg Homepage ==Managerial statistics== Managerial record by team and tenure Team Nat From To Record Record Record Record Record Team Nat From To Wolfsberger AC 1 July 2019 19 November 2019 Barnsley 19 November 2019 6 October 2020 New York Red Bulls 6 October 2020Announced as manager 6 October, but didn't make first appearance until 21 November 8 May 2023 Red Bull Salzburg 31 July 2023 present Total Total Total Total ==Honours== SV Austria Salzburg *Austrian Football Bundesliga: 1996–97 *Austrian Super Cup: 1997 ==References== ==Other websites== *Gerhard Struber at fussballoesterreich.at * *Gerhard Struber at thefinalball.com Category:1977 births Category:Living people Category:Austrian footballers Category:FC Red Bull Salzburg players Category:Association football midfielders Category:Austrian football managers Category:FC Liefering managers Category:Wolfsberger AC managers Category:New York Red Bulls managers Category:Austrian football midfielders Category:FC Red Bull Salzburg managers",
 "title": "Gerhard Struber"
}