{
 "id": "903212",
 "text": "The Azerbaijan Communist Party (; ) was the ruling political party in the Azerbaijan SSR, which was a branch of the Communist Party of the Soviet Union. ==Establishment== It was formed on 20 February 1920, when the Muslim Social Democratic Party, Communist Party of Persia, Ahrar Party and the Baku Bolsheviks joined together to establish the Communist Party of Azerbaijan. On 1 April of the same year, the Fifth Cabinet of Ministers of the Azerbaijan Democratic Republic gave its resignations and all the power to the Communist Party of Azerbaijan. The party ruled the Azerbaijan SSR until 14 September 1991 when it was formally disbanded.По сообщениям информагентств Распад. 23 августа - 24 ноября 1991. Последний этап борьбы за обновленный Союз. \"Разбегание\" республик и раздел имущества СССР ==1990 election== Nevertheless, former leaders and members of the communists continued to play a role in the family- and patronage-based political system of Azerbaijan. The Communist Party of Azerbaijan won the first multi-party elections in Azerbaijan that took place on 30 September and 14 October 1990 for the parliament of the Soviet Union, the Supreme Soviet, getting 280 out of 360 seats. == First secretaries of the Communist Party of Azerbaijan == No. Name Took office Left office 1 Mirza Davud Huseynov 12 February 1920 23 October 1920 2 Grigory Kaminsky 23 October 1920 July 1921 3 Sergey Kirov July 1921 January 1926 4 Levon Mirzoyan January 1926 August 1929 5 Nikolay Gikalo August 1929 June 1930 6 Vladimir Polonsky June 1930 November 1933 7 Ruben Rubenov (Mkrtchyan) 1 January 1933 12 December 1933 8 Mir Jafar Baghirov November 1933 July 1953 9 Mir Teymur Yaqubov July 1953 February 1954 10 Imam Mustafayev 7 February 1954 12 June 1959 11 Veli Akhundov 11 July 1959 14 July 1969 12 Heydar Aliyev 14 July 1969 3 December 1982 13 Kamran Baghirov 3 December 1982 21 May 1988 14 Abdulrahman Vezirov 21 May 1988 20 January 1990 15 Ayaz Mütallibov 24 January 1990 14 September 1991 Source: World Statesman - Azerbaijan == Notes == == References == Category:Communist parties in Asia Category:Communist parties in Europe Category:Political parties in Azerbaijan Category:20th century in Azerbaijan Category:Political history of Azerbaijan Category:1920 establishments in Russia Category:1991 disestablishments in the Soviet Union Category:Communism in Azerbaijan",
 "title": "Azerbaijan Communist Party (1920)"
}