{
 "id": "903241",
 "text": "Bokermannohyla is a genus of frogs in the family Hylidae. Scientists invented this genus in 2005. That year, many amphibian scientists looked at the species of in Hylidae and decided to make changes. Twenty-three species that had been placed in the genus Hyla were moved to Bokermannohyla. These frogs live in southern Brazil. Scientist tell whether a frog is a Bokermannohyla frog using 65 specific parts of the DNA in its nucleus and mitochondria. These genes are for proteins and ribosomes. This group is named after scientist Werner Carlos Agosto Bokermann. ==Size== With most frogs, the adult female frog is larger than the adult male frog. But with some frogs in Bokermannohyla, the adult male frog is larger. Scientists say this happens when the male frogs fight each other for good places to find female frogs. ==Species== Binomial name and author Common name Bokermannohyla ahenea Bokermannohyla alvarengai Santa Barbara tree frog Bokermannohyla astartea Paranapiacaba tree frog Bokermannohyla capra Bokermannohyla caramaschii Bokermannohyla carvalhoi Carvalho's tree frog Bokermannohyla circumdata Espirito Santo tree frog Bokermannohyla claresignata Rio tree frog Bokermannohyla clepsydra São Paulo tree frog Bokermannohyla diamantina Bokermannohyla flavopicta Bokermannohyla gouveai Itatiaia tree frog Bokermannohyla hylax Atlantic forest tree frog Bokermannohyla ibitiguara Fazenda Salto tree frog Bokermannohyla ibitipoca Ibitipoca tree frog Bokermannohyla itapoty Bokermannohyla izeckshoni Izecksohn's tree frog Bokermannohyla juiju Bokermannohyla langei Marumbi tree frog Bokermannohyla lucianae Bokermannohyla luctuosa Reservoir tree frog Bokermannohyla martinsi Martins' tree frog Bokermannohyla nanuzae Jaboticatubas tree frog Bokermannohyla napolii Bokermannohyla oxente Bokermannohyla pseudopseudis Veadeiros tree frog Bokermannohyla ravida Bokermannohyla sagarana Bokermannohyla sapiranga Bokermannohyla saxicola Ledge tree frog Bokermannohyla sazimai Zagaia tree frog Bokermannohyla vulcaniae ==References== Category:Frogs of South America",
 "title": "Bokermannohyla"
}