{
 "id": "903352",
 "text": "The Indian Council for Cultural Relations (ICCR), is an autonomous body working under the aegis of the Ministry of External Affairs (MEA), Government of India, was founded in the year 1950 by Maulana Abul Kalam Azad, independent India’s first Education Minister. History One of the aims of India's freedom struggle was to revive and strengthen the country's cultural ties with the outside world. This was reflected in the historic Asian Relations Conference held in New Delhi in 1946 wherein it was resolved to set up an Indian Council for Cultural Cooperation to revive and promote closer cultural ties with the other Asian Countries and to project the Indian personality and its rich culture through \"Indian eyes\". The Indian Council for Cultural Relations came to be set up some three years later. However, its scope was not confined to the Asian region alone. Prime Minister of India, Jawaharlal Nehru and Education Minister Maulana Abul Kalarn Azad (who was the Founder President of ICCR from 1950 till 1958) enlarged its mandate to include the task of forging closer cultural ties with the rest of the wide world. The ICCR was established and formally inaugurated in April 1950. Its objectives as defined in the Memorandum of Association included the following: * to establish, revive and strengthen cultural relations and mutual understanding between India and other countries. * to promote cultural exchange with other countries. * to adopt all other measures as may be required to further its objectives. Right from its establishment until 1958, the ICCR was under the administrative jurisdiction of the Education Ministry, Government of India. This arrangement continued till 22 April, 1970, when the jurisdiction of the Council was transferred to the Ministry of External Affairs, Government of India, following a decision of the Cabinet Committee on Foreign Affairs. The proposal for the transfer was initiated in 1967 by Shri M.C. Chagla, following his appointment as the Minister of External Affairs from his earlier charge as the Minister of Education. The Ministry of External Affairs assumed administrative and operational control of the Council in 1970-71 with a view to making the Council an effective instrument of India's foreign policy. In 1978, in keeping with the recommendations of the Asoka Mehta Committee, the Council took over from the Department of Culture all work pertaining to incoming and outgoing cultural delegations and delegated activities relating to implementation of cultural exchange programmes. In the initial years, the aims and objectives of the ICCR were two-fold: (a) to project Indian culture and heritage on the international cultural map and to present India through Indian eyes so as to correct various distortions about India created by established stereotypes of the colonial era; and (b) to forge people-to-people contacts with the other countries, particularly the newly emerging nations. By and large, the ICCR's activities have helped in achieving these broad Objectives. ==Aim== The objective of ICCR is to actively participate in the formulation and implementation of policies and programmes pertaining to India’s external cultural relations; to foster and strengthen cultural relations and mutual understanding between India and other countries and to promote cultural exchange with other countries and people. ==Locations== The ICCR Headquarter is situated at Azad Bhavan, I.P. Estate, New Delhi. The 38 Cultural Centres and 2 Centres in PPP model in different parts of the world promote awareness of India’s composite cultural heritage abroad. They are under the administrative control of the Council and their respective Indian Missions abroad. Paris and Washington are the new ICCs in the pipeline. The Indian Cultural Centres (ICCs) are located in Georgetown, Paramaribo, Port Louis, Jakarta, Bali, Kabul, Budapest, Mexico City, Moscow, Berlin, Seoul, Cairo, London (Nehru Centre, London), Tashkent, Almaty, Durban, Port of Spain and Colombo. ICCR has opened new cultural centers in Dhaka, Thimpu, Sao Paulo, Kathmandu, Bangkok, Kuala Lumpur and Tokyo. They also have zonal and sub-zonal offices in Bangalore, Guwahati, Kolkata, Lucknow, Mumbai, Patna, Pune, Jammu, Ahmedabad, Delhi NCR and Shillong. Organisation The activities of ICCR are broadly categorized under three important Heads, (i) Administration & Establishment, (ii) Culture and (iii) Education. One of the flagship programmes of ICCR includes offering of 3938 scholarships annually to foreign nationals from approximate 140 countries all over the world, under 26 schemes. Online admissions taking place on the A2A (Admissions to Alumni) portal launched by our EAM in January, 2018 ensures a smooth, efficient and transparent process. Towards meeting the primary mandate of the Council to create international understanding through culture, ICCR sponsors hundreds of Indian Outgoing Cultural Delegations (OCD) abroad, both within the ambit of India’s Cultural Exchange programme with different countries and outside it. The Council also hosts Incoming Cultural Delegations (ICD) to promote foreign cultural presentations in the country. In addition, the Council implements cultural projects on behalf of MEA, Ministry of Culture, the Parliament, etc. ICCR in consultation with Indian Missions abroad, has established 65 Indian Chairs in various foreign Universities, besides Nelson Mandela Chair in India. It also organises International Conferences under Conferences and Seminar on diverse subjects covering a wide spectrum. The ICCR hosts Exhibitions, Distinguished Visitor’s Programme, Academic Visitors Programme, Publication, maintenance of a well-stocked library and the manuscripts of Maulana Abul Kalam Azad, digitisation of rare manuscripts, publication of Gagnanchal (Hindi bi-monthly), promotion of Hindi, presentation of books, art objects and musical instruments to Institutions abroad. Besides the Jawaharlal Nehru Award for International Understanding and the Gisela Bonn Award for a German national, the ICCR has also instituted the Distinguished Alumni Award, the Distinguished Indologist Award and the World Sanskrit Award in 2015 respectively, to recognise the contributions of foreign scholars in the field of art, culture and literature. ICCR has been vigorously involved in coordinating International Yoga Day (IYD) celebrations at a global scale. The organisation of recently held Kumbh Mela witnessed participation of 186 delegations from 184 countries. ICCR is celebrating 150th birth anniversary of Mahatma Gandhi Ji globally. It is now coordinating the marking of 550th birth Anniversary of Guru Nanak Devji. Youth Seminar on “Teachings of Sri Guru Nanak Dev ji and Sikhism Contribution in Universal Well being” was organized by the Council on 6 November 2019 followed by visits to 03 Takhats to Patna, Amritsar and Nanded from 7-10 November 2019. The Council organised the first of its kind 2 days conference titled “Destination India-Making India the Preferred Hub of Education” in collaboration with Symbiosis International University and Savitribai Phule Pune University from 28-29 January, 2020 to brain storm ways and strategies of attracting foreign students to India and making India an attractive destination for higher education. The conference was inaugurated by Hon’ble Minister of Human Resource Development and witnessed the participation of reputed Government organisations like UGC, Ministry of Home Affairs, IITs several Art and cultural institutions, etc. References Category:Foreign relations of India Category:1950 establishments in India Category:Delhi Cultural Relations",
 "title": "Indian Council for Cultural Relations"
}