{
 "id": "903643",
 "text": "Asha BhosleAsha Bhosle has been credited variously as Asha, Asha Bhosle, Asha Bhonsale, Asha Bhonsle, Asha Bhonsley, Asha Bhosale and Asha Bhosley (See her IMDB entry for details). She is often referred to as Ashaji – the Hindi suffix ji denotes respect. ( Mangeshkar; born 8 September 1933) is an Indian singer who records songs for movies. Then the movie actors move their lips so that they seem to be singing the songs. She is also a businesswoman. She is best known for her singing in Hindi movies. Bhosle's career started in 1943. In 2013, At the age of 79, Bhosle did her first acting performance with a Marathi movie named Mai. She is one of the oldest indian actress to have made debut in Bollywood. Bhosle is the sister of playback singer Lata Mangeshkar. During the 1950s and 60s, Asha and her sister Lata were the main playback singers for Marathi movies. In 1997 and 2006, she got nominated for the Grammy Award. ==Early life== Asha was born on 8 September 1933 in the village of Sangli. Sangli is located near Krishna river in Maharashtra. She is the daughter of Deenanath Mangeshkar. Deenanath was an actor and classical singer on Marathi theatre. When Asha was nine years old, her father died. Their family moved from Pune to Kolhapur and then to Mumbai. She and her elder sister Lata Mangeshkar began singing for movies to support their family. She sang her first song \"Chala Chala Nav Bala\" for the Marathi movie Majha Bal (1943). In 1948, She made her Hindi movie debut when she sang the song 'Saawan Aaya' for the movie named Chunariya. In 1949, at the age of 16, she ran away to marry the 31-year-old Ganpatrao Bhosle, who was her personal secretary. She married him even though her family was not happy with the marriage. ==Career== Asha Bhosle became famous when Raj Kapoor chose her in 1954 for a song from the movie named Boot Polish. The song was called Nanhe Munne Bache (which means cute little kids). She sang it with Mohammed Rafi. Musician O. P. Nayyar also chose Asha Bhosle for C.I.D. in 1956. BR Chopra chose her for the movie Naya Daur in 1957. She sang \"Maang Ke Saath Tumhara\", \"Saathi Haath Badhana\" and \"Uden Jab Jab Zulfein Teri\" with Mohammed Rafi which made her very popular. All these songs in the movie were written by Sahir Ludhianvi. In 1957, Naya Daur was Asha Bhosle's first movie where she sang all the songs in a single movie for the heroine. The heroine in that movie was Vyjayanthimala. On 2 May 2020, Bhosle launched her YouTube channel named \"Asha Bhosle Official\". As of February 2024, she has 291 thousand subscribers on her YouTube account. ==Awards== In 1962, Maharashtra government gave Bhosle the '1962 Best singer award' for the Marathi movie, Manini. In 2002, she received the BBC Lifetime Achievement Award, which was given to her by the Prime minister of UK, Tony Blair. In 2011, she was honored by the Guinness Book of World Records as the most recorded artist in music history. She also received the Dadasaheb Phalke Award in 2000 and the Padma Vibhushan in 2008. In 2015, she was listed in the Top 100 inspiring women of 2015. ==References== Category:1933 births Category:Living people Category:Indian singers Category:Indian businesspeople Category:Marathi people Category:Indian movie actors",
 "title": "Asha Bhosle"
}