{
 "id": "903795",
 "text": "The PS General Slocum was a ship. It was a steam ship. One June 15, 1904, it caught fire in the East River in New York. More than 1000 people died. ==Making== The PS Slocum was built in 1891. It had a sidewheel system. It was a paddle boat. It was a passenger ship. The Solcum was built to take as many as 2500 passengers. It had 2500 life vests. In May 1904, a fire inspector looked at the ship and said its fire stopping tools were in \"fine working order.\" ==Disaster== St. Mark's Evangelical Lutheran Church was on the Lower East Side of Manhattan island. It was in a German-American neighborhood called Kleindeutschland, or \"Little Germany.\" The church paid the Knickerbocker Steamboat Company $350 for the General Slocum to take a special trip. The trip was to celebrate the end of the school year. Not everyone who came on the trip was German-American. Churchgoers invited their friends and neighbors to come too. Most people wore their best clothes. The people on the boat planned to go to Locust Grove on Long Island's North Shore for the day. They brought baskets of food for picnics. There were 1,358 people on the boat in total, passengers and crew. Most of the passengers were women and children. The ship left Manhattan at 9:00 a.m. Before 9:30, something on the ship began to burn. The ship caught fire. People had to decide whether to burn on the boat or jump into the water. Most people in 1904 New York could not swim. The clothes people wore in 1904 New York became very heavy when they got wet, so even people who could swim a little were pulled down into the river. The crew tried to put out the fire with fire hoses. But the hoses were old and broke apart. There were life vests on the ship, but they were so old that they only sank into the water. They had been made with cork, but the cork had turned to powder. The life boats were old and could not float. The crew had not done any fire drills. The crew did not know what to do when the passengers became frightened. The captain, William Henry Van Schaick, tried to find a place to land, and he chose North Brother Island a mile away. He made the ship move very fast. This made the fire worse. Some people saw the fire and tried to help. Tug boats came to the ship. The people tried to pull people from the General Slocum out of the water. Mostly, they found dead bodies, but the people on the tug boats pulled dozens of living people out of the water. A ship from the New York Yacht Club came near the General Slocum, but the man on it only watched. The ship came to North Brother Island. The island had a hospital on it for people with typhoid. The people in the hospital blew their fire whistle. They brought hoses and equipment to put out the fire. Nurses threw ropes and anything that would float to people in the water. Some nurses jumped into the water and swam to pull people out. But the fire was very hot and many people burned to death. 321 people lived. 1021 died. This was the highest number of dead people from one thing in New York City until the September 11 attacks in 2001. The river water washed dead bodies onto the ground for days. ==Blame and trial== People are not sure how the fire started, but it could have been from a match or cigarette falling onto some hay. Frank A. Barnaby, the President of the Knickerbocker Steamboat Company, said the captain and crew had done well. People said Captain Van Schaick decided not to steer the ship back to the city when the fire started. They said this was because of insurance. But it may not be true. Van Schaick steered the ship toward North Brother Island. Van Schaick said this was because he would have had to land the ship near 130th street near the Bronx, which had wood yards and gas tanks. Captain Van Shaick was put on trial in a United States Circuit Court for criminal negligence. On Janaury 27, 1906, he was found guilty. They said the disaster was his fault because he did not make the crew do fire drills. Judge Thomas sentenced him to 10 years hard labor. The Knickerbocker Steamboat Company was not punished. Van Schaick went to Sing Sing prison. His wife asked President William Howard Taft to pardon him. Taft did in 1911. ==Communities== The German-American community in Manhattan changed after the disaster. Many people whose families had died killed themselves or were so sad that it became an illness. The Jewish-American and Italian-American communities lost many people too. There is a marble monument to the people who died in Tompkins Square Park. The Sympathy Society of German Ladies put it there in 1906. Because most of the people on the boat were women and children, many German-American men suddenly had no wives or children. Many of them moved north to be nearer the place where their families had died. Soon, there was a German-American neighborhood on the Upper East Side. The Kleindeutschland neighborhood faded away. New people from Poland and Russia came to live there instead. ==References== Category:Ferries Category:Fires in New York (state)",
 "title": "PS General Slocum"
}