{
 "id": "903787",
 "text": "Johannes Diderik van der Waals (; 23 November 1837 – 8 March 1923) was a Dutch theoretical physicist and thermodynamicist. He became famous for his pioneering work on the equation of state for gases and liquids. Van der Waals started his career as a school teacher. In 1877, he became the first physics professor of the University of Amsterdam. Van der Waals won the 1910 Nobel Prize in physics for his work on the equation of state for gases and liquids. ==Things named after Van der Waals== His name is primarily associated with the Van der Waals equation of state that describes the behavior of gases and their condensation to the liquid phase. His name is also associated with Van der Waals forces (forces between stable molecules),Parsegian, V. Adrian (2005). Van der Waals Forces: A Handbook for Biologists, Chemists, Engineers, and Physicists. (Cambridge University Press), p. 2. “The first clear evidence of forces between what were soon to be called molecules came from Johannes Diderik van der Waals's 1873 Ph.D. thesis formulation of the pressure p, volume V, and temperature T of dense gases.” with Van der Waals molecules (small molecular clusters bound by Van der Waals forces), and with Van der Waals radii (sizes of molecules). As James Clerk Maxwell said, \"there can be no doubt that the name of Van der Waals will soon be among the foremost in molecular science.\"Johannes Diderik van der Waals - Biographical - Nobelprize.org ==1873 thesis== In his 1873 thesis, Van der Waals noted that real gases were not ideal: He thought this was because there are intermolecular interactions. He introduced the first equation of state derived by the assumption of a finite volume occupied by the constituent molecules. Spearheaded by Ernst Mach and Wilhelm Ostwald, a strong philosophical current that denied the existence of molecules arose towards the end of the 19th century. The molecular existence was considered unproven and the molecular hypothesis unnecessary. At the time Van der Waals's thesis was written (1873), the molecular structure of fluids had not been accepted by most physicists, and liquid and vapor were often considered as chemically distinct. But Van der Waals's work affirmed the reality of molecules and allowed an assessment of their size and attractive strength. His new formula revolutionized the study of equations of state. By comparing his equation of state with experimental data, Van der Waals was able to obtain estimates for the actual size of molecules and the strength of their mutual attraction.Sengers, Johanna Levelt (2002), p. 16 ==Effects to molecular physics== The effect of Van der Waals's work on molecular physics in the 20th century was direct and fundamental.Kipnis, A. Ya.; Yavelov, B. E.; Rowlinson, J. S.: Van der Waals and Molecular Science. (Oxford: Clarendon Press, 1996) By introducing parameters characterizing molecular size and attraction in constructing his equation of state, Van der Waals set the tone for modern molecular science. That molecular aspects such as size, shape, attraction, and multipolar interactions should form the basis for mathematical formulations of the thermodynamic and transport properties of fluids is presently considered an axiom.Sengers, Johanna Levelt (2002), pp. 255–256 With the help of the Van der Waals's equation of state, the critical-point parameters of gases could be accurately predicted from thermodynamic measurements made at much higher temperatures. Nitrogen, oxygen, hydrogen, and helium subsequently succumbed to liquefaction. Heike Kamerlingh Onnes was significantly influenced by the pioneering work of Van der Waals. In 1908, Onnes became the first to make liquid helium; this led directly to his 1911 discovery of superconductivity.Blundell, Stephen: Superconductivity: A Very Short Introduction. (Oxford University Press, 1st edition, 2009, p. 20) == Notes == == References == Category:1837 births Category:1923 deaths Category:Dutch theoretical physicists Category:Scientists from Leiden",
 "title": "Johannes Diderik van der Waals"
}