{
 "id": "903866",
 "text": "The navy bean, haricot, pearl haricot bean, Boston bean, white pea bean, or pea bean is a variety of the common bean (Phaseolus vulgaris) native to the Americas, where it was first domesticated. It is a dry white bean that is smaller than many other types of white beans, and has an oval, slightly flattened shape. It features in such dishes as baked beans, various soups such as Senate bean soup,[senate.gov/reference/reference_item/bean_soup.htm Senate Bean Soup] and even pies. The green bean plants that produce navy beans may be either of the bush type or vining type, depending on which cultivar they are. == History == The name \"Navy bean\" is an American term coined because the US Navy has served the beans as a staple to its sailors since the mid-1800s. In Australia, navy bean production began during World War II when it became necessary to find an economical way of supplying a nutritious food to the many troops—especially American troops—based in Queensland. The United States military maintained a large base in Kingaroy and had many bases and camps throughout south-east Queensland. It actively encouraged the widespread planting of the beans. Kingaroy is known as the Baked Bean Capital of Australia. Another popular name for the bean during this time was \"the Yankee bean\". == Cultivars == Navy bean cultivars include: * \"Rainy River\" * \"Robust\", resistant to the bean common mosaic virus (BCMV), which is transmitted through seeds * Michelite, descended from 'Robust', but with higher yields and better seed quality * Sanilac, the first bush navy bean cultivar == Other white beans == Other varieties of white beans include: * Cannellini (or fazolia) are a white kidney bean that is popular in central and southern Italy, but first developed in Argentina. They are larger than navy beans and closely related to the red kidney bean They are used in minestrone soups. * Lima beans, also known as Butter Beans. * Great northern, also called \"large white\" beans, are larger than navy beans as well, but smaller than cannellini beans. They have a flattened shape similar to lima beans and a delicate flavor. * The runner bean, Phaseolus coccineus, is a large white bean known in Greece as gígantes (Greek: γίγαντες, \"giants\") and eléfantes (ελέφαντες, \"elephants\"). * The marrow bean, a medium to large white bean with a bacon-like flavor, which was popular for baked beans in the U.S. in the 19th and early 20th centuries. == Nutritional value == White beans are the most abundant plant-based source of phosphatidylserine (PS) yet known.Souci SW, Fachmann E, Kraut H (2008). Food Composition and Nutrition Tables. Medpharm Scientific Publishers Stuttgart. It contains notably high levels of apigenin, , which vary widely among legumes. Consumption of baked beans has been shown to lower total cholesterol levels and low-density lipoprotein cholesterol. This might be at least partly explained by the high saponin content of navy beans. Saponins also exhibit antibacterial and anti-fungal activity, and have been found to inhibit cancer cell growth. Furthermore, navy beans are the richest source of ferulic acid and p-coumaric acid among the common bean varieties. == Storage and safety == Dried and canned beans stay fresh longer by storing them in a pantry or other cool, dark place under . With normal seed storage, seeds should last from one to four years for replanting, with a very large timetable for cooking for well-kept seeds, nearing on indefinite. Avoid beans that are discolored from the pure white color of these beans, as they may have been poorly handled while they dried. == References == Category:Beans",
 "title": "Navy bean"
}