{
 "id": "903943",
 "text": "Jacobus \"Co\" Adriaanse (born 21 July 1947) is a Dutch football manager. As player he played as centre-back for De Volewijckers anf FC Utrecht. ==Playing career== Adriaanse played six seasons with (now dissolved) De Volewijckers (1964 until 1970) and also six seasons with Utrecht (1970 until 1976). ==Managerial career== ===Early career=== Adriaanse began his managing career with Zilvermeeuwen in 1979for four years and then went to AZ as scout and youth trainer. Then he coached PEC Zwolle and FC Den Haag for four seasons each. He then managed the youth side of Ajax, for five seasons. ===Willem II=== In 1997 he became manager of Willem II. The team finished in fifth place and had wins over Feyenoord (2–0) and defending champions PSV (4–1). The fifth place was the first qualification for European football since 1963. In the 1998–99 UEFA Cup they reached round 2 but lost to Betis Sevilla. After the team did not reach another European competition, Adriaans resigned in 2000. ===Ajax=== Adriaanse returned to Ajax as manager and reached a third place but was sacked early in the next season because of poor results. ===AZ=== In November 2002 Adriaanse was signed to AZ. In the first season they finished tenth, in the next fifth . They qualified for the UEFA Cup 2004-05. There they reached the semi-finals but lost to Sporting Clube de Portugal. In the Eredivisiethey finished third. ===Porto=== On 24 May 2005 Adriaanse was presented as the new manager of Portuguese club Porto. In the first season as Porto coach, he achieved the double for the first time since Jose Mourinho left the club. ===Metalurh Donetsk=== On 9 August 2006 Adriaanse resigned as manager of Porto. In December 2006 he became coach of FC Metalurh Donetsk. On 17 May 2007 he resigned as manager of Metalurh Donetsk. ===Al-Sadd Sports Club=== On 27 August 2007 Adriaanse became manager of Al-Sadd but resigned as coach on 28 January 2008. ===Red Bull Salzburg=== On 13 March 2008 Adriaanse signed with the Austrian champion Red Bull Salzburg. He left the club after the end of the season finishing with the team as champion. ===Qatar Olympic team=== 2010 he became manager of the Qatar Olympic team. His Middle East stint, however, lasted only 14 months, as his contract was terminated by mutual consent in March 2011. ===Twente=== On 20 June 2011 he was named manager. In his first official match with the club, Adriaanse won the Johan Cruyff Shield against his former team Ajax. In January 2012 the contract was dissolved by Twente. 2014-15 Adriaanse was technical advisor at Utrecht. At the end of the season he left.Alflen en Adriaanse verlaten FC Utrecht - FC Utrecht ==Honours== Porto * Primeira Liga:206 * Portuguese cup:206 Red Bull Salzburg * Austrian Football Bundesliga: 2009 Twente * Johan Cruyff Shield: 2011 Individual * Rinus Michels Award: * Primeira Liga's Manager of the Season: 2006 ==References== Category:1947 births Category:Living people Category:Dutch football managers Category:Dutch footballers Category:FC Red Bull Salzburg managers Category:AZ Alkmaar managers Category:Willem II (football club) managers Category:AFC Ajax managers",
 "title": "Co Adriaanse"
}