{
 "id": "904162",
 "text": "The Oxyrhynchus hymn is a Christian Greek religious song with lyrics and musical notation from the 3rd century AD. The hymn was written on a manuscript that was discovered in 1918 in modern Egypt, published in 1922, and now preserved in Oxford University.; . ==Description== The lyrics of the Oxyrhynchus hymn were written in the Greek language. They use poetry to summon silence in praise of the Holy Trinity, a motif of ancient Greek hymns called cosmic stillness.. The cosmic stillness motif is also found in Homer's Iliad (19.255–19.256), Callimachus's hymn to Apollo, Limenius's hymn to Apollo, in one of Mesomedes's hymns, in two of Synesius's hymns, etc. The music of the Oxychynchus hymn is composed in Greek vocal notation.; . Overall, the Oxyrhynchus hymn illustrates the historical continuity of Greek culture where educated Christian Greeks accepted and used the musical notation of their ancient Greek ancestors.. Also, it is the only surviving piece of Christian Greek music from the first 400 years of Christianity.; . ==Text== The Phos Hilaron and the Oxyrhynchus hymn are the earliest existing Greek hymns used in Christian worship, but are not based on the Bible.. # . . . together all the eminent ones of God. . . # . . . night] nor day (?) Let it/them be silent. Let the luminous stars not [. . .], # . . . [Let the rushings of winds, the sources] of all surging rivers [cease]. While we hymn # Father and Son and Holy Spirit, let all the powers answer, \"Amen, amen, Strength, praise, # [and glory forever to God], the sole giver of all good things. Amen, amen.\". ==References== ===Citations=== ===Sources=== * * * * * * * ==Further reading== * ==Discography== * Ensemble Kérylos a music group directed by scholar Annie Bélis and dedicated to the recreation of ancient Greek and Roman music. 1996. \"Hymne chrétienne d'Oxyrhynchus.\" Musique de l'Antiquité grecque. K617.069. *Atrium Musicæ de Madrid, Gregorio Paniagua. 1979. \"Christian Hymn of Oxyrhynchus.\" Musique de la Grèce Antique. Harmonia Mundi (France) HMA 1901015. Arles: Harmonia Mundi. *Christodoulos Halaris. 1992. \"Hymn to the Holy Trinity\". Music of Ancient Greece. Orata ORANGM 2013. [Greece]: Orata Ltd. *Ensemble De Organographia. 1995. \"Christian hymn, Anonymous (3rd c. AD) Oxyrhynchus papyrus 1786.\" Music of the Ancient Greeks. Pandourion PRCD1001. Oregon City: Pandourion Records. Track sample available at: http://www.liturgica.com/Home/litEChLit ==Other websites== * Oxyrhynchus 1786 at Oxyrhynchus Online Category:Christian hymns Category:Greek culture",
 "title": "Oxyrhynchus hymn"
}