{
 "id": "904625",
 "text": "DZOE-TV (channel 11) is a television station in Metro Manila, Philippines, serving as the flagship of the A2Z network. It is owned by ZOE Broadcasting Network (alongside Light TV flagship DZOZ-DTV channel 33) and operated by ABS- CBN Corporation under a blocktime agreement. The station maintains studios at the ABS-CBN Broadcasting Center, Sgt. Esguerra Ave. corner Mo. Ignacia St., Diliman, Quezon City and 22nd floor, Strata 2000 Bldg., F. Ortigas Jr. Road (formerly Emerald Avenue), Ortigas Center, Pasig, while its hybrid analog and digital transmitting facility is located at Crestview Heights Subdivision, Brgy. San Roque, Antipolo, Rizal. ==History== They have partnership with ABS- CBN Corporation through a blocktime agreement. It was bought from Delta Broadcasting System in the mid-1990s. ==Locations and operations== The station's studio is located at the ABS-CBN Broadcasting Center, Sgt. Esguerra Ave., corner Mo. Ignacia Ave., Diliman, Quezon City, and 22nd floor, Strata 2000 Bldg., F. Ortigas Jr. Road (formerly Emerald Avenue), Ortigas Center, Pasig. Their analog and digital transmitter are located at ZOE Compound Center, Crestview Heights Subdivision, Brgy. San Roque, Antipolo, Rizal. DZOE- TV operates from Mondays to Fridays at 5:00a.m. to 12:15a.m., Weekend at 6:00a.m. to 11:30p.m. ==Digital television== UHF Channel 20 (509.143 MHz) Channel Video Aspect Short name Programming Note 20.21 480i 4:3 A2Z A2Z Commercial broadcast (5.5 kW) 20.22 Knowledge Channel Knowledge Channel 20.24 Light TV Light TV 20.31 240p A2Z OneSeg A2Z 1seg black screen == Areas of Coverage == === Primary areas === * Metro Manila * Cavite * Bulacan * Laguna * Rizal === Secondary Areas === * Pampanga * Nueva Ecija * Batangas * Bataan * Portion of Quezon Province * Portion of Zambales * Portion of Occidental Mindoro * Portion of Nueva Viscaya ==References== Category:1998 establishments in Asia Category:1990s establishments in the Philippines",
 "title": "DZOE-TV"
}