{
 "id": "904838",
 "text": "Michelle Rodríguez (Xochimilco, Mexico City, December 1, 1983), is a Mexican film, theater and television actress, singer and comedian. She is known for playing the character of Toña in the television series 40 y 20. == Early life == Michelle Rodríguez was born in Xochimilco, Mexico City on 1st of December 1983. At an early age, she wanted to be an actress and comedian. She studied design and visual communication at the National Autonomous University of Mexico. == Career == She joined the entertainment industry in 1999. She started with dubbing, voiceover, and radio production. Later in her career, she did comedy, musical theater, interpretation, and acting. She made her television debut in 2012 in the successful telenovela AmoresTrues. In 2012 and 2013, she played the character of \"Polita\" alongside Mexican actors such as Erika Buenfil, Eduardo Yáñez, Sebastián Rulli and Eiza González in the TV-show Amores verdaderos. She joined the main cast of the comedy series 40 y 20 where she played Toña, sharing scenes with Jorge Van Rankin and Mauricio Garza. == Filmography == === Television === Year Show Character 2012–2013 Amores verdaderos Policarpia \"Polita\" López 2013 Qué pobres tan ricos Admirer of Tizoc 2014–2021 Me caigo de risa Herself 2014 Mi corazón es tuyo Impersonator 2015–2016 La rose de Guadeloupe Juanita \\---- Aurora \\---- Catita Comedy Central Presents: Stand Up Herself 2016 Nosotros los guapos Vendor 2016 -present 40 y 20 Toña 2017 The Beloved Estrella 2017–2018 Run Coyote Run Rubí 2018 LOL: Last One Laughing Herself 2019 ¿Quién es la máscara? Herself Julia vs. Julia Patient Noches con Platanito Herself 2020 La culpa es de la Malinche === Movie === Year Movie Character 2017 Fausto Supporting actor Cómo cortar a tu patán Martita 2019 Mirreyes vs Godínez Goyita Emma Madre de Betty 2020 Te llevo conmigo Sandra Sin hijos Sonia 2021 Guerra de likes Melissa === Dubbing/Voicing === Year Film Character Original voice 2020 Dolittle Ginko (voice) Frances de la Tour Trolls World Tour Delta Dawn (voice) Kelly Clarkson Category:Mexican comedians Category:Mexican television actors Category:1983 births Category:Living people",
 "title": "Michelle Rodríguez (Mexican actress)"
}