{
 "id": "905072",
 "text": "Nordhorn is a town in Lower Saxony, Germany. It is the district seat of the County of Bentheim in Lower Saxony's southwesternmost corner near the border with the Netherlands and the boundary with North Rhine-Westphalia. ==Geography== ===Place=== The town is in southwesternmost Lower Saxony, near the border with the Netherlands and the boundary with North Rhine-Westphalia, on the river Vechte. The nearest major city is Hengelo in the Netherlands, some southwest of Nordhorn. The nearest German cities are Münster, about to the southeast, and Osnabrück, about to the east. The landscape in and around Nordhorn is marked by the Vechte, the Vechtesee (lake), through which the Vechte flows, and three canals: the Süd-Nord-Kanal, the Nordhorn-Almelo-Kanal and the Ems-Vechte-Kanal. ===Extent of the municipal area=== Through various combinations the town's area has grown to 14 959 ha, only slightly smaller than the Principality of Liechtenstein. ===Neighbouring communities=== North of Nordhorn is the town and joint community (Samtgemeinde) both called Neuenhaus, while the communities of Engden and Isterberg are in the south. The town's western limit is also part of Germany's border with the Netherlands. ===Constituent communities=== Nordhorn is subdivided into 17 quarters (\"Stadtteile\"). ==Twin towns – sister cities== Nordhorn is twinned with: * Coevorden, Netherlands (1963) * Montivilliers, France (1963) * Reichenbach im Vogtland, Germany (1987) * Malbork, Poland (1995) * Rieti, Italy (2010) ==References== ==Further reading== * (English-French-Dutch-German) * Heinrich Specht, Bürgerbücher der Stadt Nordhorn von 1396-1913, Nordhorn 1939 * Heinrich Specht, Wappen und Siegel der Stadt Nordhorn, aus Nordhorner Nachrichten Nr. 213, 194 (1941): Ältere Nordhorner Wappenzeichen, * Alfred Dietrich, Nordhorn - Textilstadt im Grünen, Oldenburg 1966 * Bernd-Andreas Knoop + Jörg-Uwe Seifert, Nordhorn - Gesichter einer Stadt, 1976 * VHS Grafschaft Bentheim (publisher), Nordhorn nach 1945, Nordhorn, 1977 * Heinrich Specht, Nordhorn - Geschichte einer Grenzstadt, Nordhorn 1941; 1979. publisher: Heimatverein der Grafschaft Bentheim. * Clemens v. Looz-Corswarem + Michael Schmitt (publisher), Nordhorn - Beiträge zur 600 jährigen Stadtgeschichte, 1979 * Bernd-Andreas Knoop + Fritz Schöbel, Das war die Festwoche - 600 Jahre Stadt Nordhorn, 1979 * VHS Grafschaft Bentheim (publisher), 35 Jahre Volkshochschule der Stadt Nordhorn, Bad Bentheim, 1983 * Gerhard Plasger, Nordhorn in alten Ansichten, 1983 * Gerhard Plasger, Nordhorn - Bilder der Vergangenheit, 1986 * VHS Grafschaft Bentheim (publisher), Mühlen und Müller, Nordhorn, 1987 * Wilfried P. Delissen et al., Nordhorn - Spuren und Notizen, Nordhorn 1988 * Herbert Wagner: Militär in der Region, Dokumentation über den Artillerieschieß- und Bombenabwurfplatz Engdener Wüste / Nordhorn - Range, Bad Bentheim, 1989 * neomdedia GmbH (publisher), Nordhorn - Grenzstadt ohne Grenzen, 1989 * VHS Grafschaft Bentheim (publisher), Nordhorn im 3. Reich, Nordhorn, 1991 * Bernd-Andreas Knoop, Das große Buch der Grafschaft, Lage 1994 * VHS Grafschaft Bentheim (publisher), Nordhorn - eine Zeitreise, Nordhorn, 1998 * Schwester M. Willibaldis, St. Augustinus Nordhorn, Nordhorn 2003 * Herbert Wagner: Die Gestapo war nicht allein... Politische Sozialkontrolle und Staatsterror im deutsch - niederländischen Grenzgebiet 1929 - 1945, Münster 2004 == Other websites == * * Category:County of Bentheim (district)",
 "title": "Nordhorn"
}