{
 "id": "905081",
 "text": "The Piedmont is a plateau area in the Eastern United States. It is located between the Atlantic coastal plain and the main Appalachian Mountains. The plateu goes from New York in the north to Alabama in the south. The Piedmont Province is a physiographic province of the larger Appalachian division/ It is made up of the Gettysburg-Newark Lowlands, the Piedmont Upland and the Piedmont Lowlands. ==Boundaries== The Atlantic Seaboard fall line marks the Piedmont's eastern boundary. To the west, it is bounded by the Blue Ridge Mountains. They are the easternmost range of the main Appalachians. The width of the Piedmont varies. It os very narrow above the Delaware River . It is almost wide in North Carolina. The Piedmont's area is about . ==Origin of name== The name \"Piedmont\" comes from the , meaning \"foothill\". It comes from the Latin \"pedemontium\", meaning \"at the foot of the mountains\". This id similar to the name of the Italian region of Piedmont (Piemonte). == Geology == The Piedmont is mainly an area of relatively low, rolling hills. They have a height above sea level between 200 feet (50 m) to 1,000 feet (300 m). Its geology is complex. THere are many rock formations of different materials and ages. The Piedmont is the remains of several old mountain chains. Geologists say at least five separate events led to sediment being depositted. These include the Grenville orogeny and the Appalachian orogeny. The last major event in the history of the Piedmont was the break-up of Pangaea. This was when North America and Africa began to separate. == Soils and farming == Piedmont soils are generally clay-like (Ultisols). They are moderately fertile. In some areas, they have suffered from erosion . They have also been farmed heavily. This is mostly in the South where cotton was the main crop. In the central Piedmont region of North Carolina and Virginia, tobacco is the main crop. In the north region, the land is used for many different things. These include orchards, dairying, and general farming. == Cities == Many major cities are on the Atlantic Seaboard fall line, the eastern boundary of the Piedmont. Within the Piedmont area, there are many large urban areas. The largest is the Philadelphia metropolitan area in Pennsylvania and New Jersey. The Piedmont cuts Maryland in half, It covers the Baltimore–Washington metropolitan area. In Virginia, the Greater Richmond metropolitan area is the largest. In North Carolina, the Piedmont Crescent includes several areas. These include the Charlotte metropolitan area, the Piedmont Triad, and the Research Triangle. Other notable areas include the Greenville-Spartanburg- Anderson, SC Combined Statistical Area in South Carolina, and the Atlanta metropolitan area in Georgia. == References == == Other websites == * Hilton Pond Center for Piedmont Natural History * Category:Regions of the United States Category:Geography of Pennsylvania Category:Geography of New Jersey Category:Geography of Maryland Category:Geography of Virginia Category:Geography of North Carolina Category:Geography of South Carolina Category:Washington, D.C. Category:Geography of Alabama Category:Geography of Georgia (U.S. state) Category:Geography of Delaware",
 "title": "Piedmont (United States)"
}