{
 "id": "905104",
 "text": "Adolf \"Adi\" Hütter (; born 11 February 1970) is an Austrian professional football coach and former player who is the manager of Ligue 1 club Monaco. ==Playing career== Hütter played in the youth teams of Altach in his youth. In his senior career he played for LASK, Altach, Grazer AK and Austria Salzburg. With Salzburg he won three-times the Austrian championship and won the Supercup. He also played in the UEFA-Cup final in 1994 against Inter Milan. Hütter played for the Austrian national team 14 times and scored 3 times. In 2000 went to Grazer AK again. 2002 he played for the first division team Kapfenberg. In 2005 Hütter played for Red Bull Salzburg Juniors and secured promotion to the Austrian first division. Health problems were the reason why he became assistant of Gerald Baumgartner in August 2007. ==Coaching career== ===Salzburg Juniors, Altach, Grödig, Salzburg=== Hütter is the former assistant coach and head coach of Red Bull Salzburg Juniors. He finished with a record of 13 wins, seven draws, and 15 losses at the club. Then he was head coach of Rheindorf Altach between 1 July 2009 and 5 April 2012. In the 2009–10 season, Rheindorf Altach lost to FC Pasching in the first round of the Austrian Cup and finished third in the league. In the 2010–11 season, Rheindorf Altach got to the Round of 16 of the Austrian Cup and finished second in the league. In the 2011–12 season, Rheindorf Altach were eliminated from the Austrian Cup in the first round. On 1 July 2012 he became manager of SV Grödig. In the 2012–13 season, Grödig were eliminated in the second round of the Austrian Cup. In the 2013–14 season, Grödig were eliminated in the first round of the Austrian Cup. They got a 2014–15 UEFA Europa League place after 3–3 draw on the final matchday against Wacker Innsbruck. Then he took over Red Bull Salzburg for the 2014–15 season His first training session was on 16 June 2014. His first match was a 10–1 win against 1. SC Sollenau on 12 July 2014. After one season he resigned on 15 June 2015. He won the double in his only season. His final match was a 2–0 win in the Austrian Cup final on 3 June 2015. ===Young Boys Bern=== In September 2015, Hütter took over as head coach of Swiss Super League side BSC Young Boys. In April 2018 Hütter's Young Boys won the Swiss Super League for the first time since 1986. ===Eintracht Frankfurt=== On 16 May 2018 became head coach of Eintracht Frankfurt. He started as coach on 1 July 2018. His first match was a 0-5 loss versus Bayern München in the German Supercup. Afterwards Eintracht Frankfurt was knocked out in the first round of the German Cup by fourth division SSV Ulm. Also in the Bundesliga there was a weak start(just 4 points in five matchdays. But they did'nt loose the next 11 games. the second half of the season was sucessful. They reached the semi-final of the Europa League where they drew two times and lost on penalties against Chelsea. At the end of the season, Hütter was voted by readers of German newspaper Bild as Coach of the Year while Eintracht Frankfurt was voted as the Team of the Year.Havertz ist der Spieler des Jahres, Bild, 22 May 2019. The union of professional football players also voted Hütter as Coach of the Year.Adi Hütter Trainer des Jahres, Frankfurter Allgemeine Zeitung, 6 June 2019. On 13 April, Hütter announced that he would leave Frankfurt and join Borussia Mönchengladbach for the 2021–22 season. ===Borussia Mönchengladbach=== After one season he left Gladbach finishing tenth in the league on 14 May 2022. ===AS Monaco=== In mid-2023 he signed a two-year contract with AS Monaco. ORF.at ==Coaching record== Managerial record by team and tenure Team From To Record Rheindorf Altach 1 July 2009 6 April 2012 Grödig 1 June 2012 31 May 2014 Red Bull Salzburg 1 June 2014 15 June 2015 Young Boys 3 September 2015 30 June 2018 Eintracht Frankfurt 1 July 2018 30 June 2021 Borussia Mönchengladbach 1 July 2021 16 May 2022 Monaco 4 July 2023 present Total — ==Honours== ===Coach=== ;Red Bull Salzburg *Austrian Football Bundesliga: 2014–15 *Austrian Cup: 2014–15 ;Young Boys *Swiss Super League: 2017–18 ; Individual * VDV Coach of the Season: 2018–19, 2020–21 ==References== Category:1970 births Category:Living people Category:Association football midfielders Category:Austrian footballers Category:Players of the Austrian national football team Category:FC Red Bull Salzburg players Category:Austrian football managers Category:FC Red Bull Salzburg managers Category:Borussia Mönchengladbach managers Category:Austrian football champions Category:Austrian football midfielders",
 "title": "Adi Hütter"
}