{
 "id": "90526",
 "text": "The CN Tower is a telecommunications tower in Toronto, Ontario, Canada. It is 1815.2 ft is (553.30 m) tall and is the tallest free-standing structure (meaning it cannot have wires to keep it standing) in Canada, North America, and the Western Hemisphere. It is not the tallest building as there are no floors for people to work or live in. Which is a bit shorter at tall. It is not the tallest structure of any kind in the Americas either, as the KVLY-TV mast in North Dakota, also in the United States, is taller at , but that needs wires to keep it upright. Construction of the concrete tower started on 6 February 1973. In 1975, while it was still being built, it became taller than the Ostankino Tower in Moscow. When it opened to the public on 26 June 1976, it became the tallest free-standing structure on land in the world. It held this record for more than thirty years, until the Burj Khalifa, while it was still being built, became taller on 12 September 2007 .CBC News Story The CN Tower continued to be the world's tallest tower until the Canton Tower became taller in 2010. It is now the ninth tallest building in the world and the fifth tallest free-standing structure behind both of these, the Shanghai Tower, and the Burj Khalifa. The \"CN\" in the tower's name came from the Canadian National Railway, the railway company that built the tower. In 1995, the railway sold the tower to the Canada Lands Company (CLC). Local residents wanted to keep the name CN Tower, though, so the abbreviation is now a shortened form of Canada's National Tower instead of the original Canadian National Tower. Neither of these names are commonly used, though; the tower is usually called the CN Tower. Today, the CN Tower is an important icon of Toronto and has more than two million tourists and visitors every year. It has been one of the Seven Wonders of the Modern World since 1995. It has a restaurant that spins around every 1 hour & 12 minutes. ==Related pages== * List of tallest structures in the world == References == == Other websites == * * CBC Archives – CN Tower opens to the public * Edgewalk * The Design, Engineering and Construction of the CN Tower – 1972 through to 1976 * A visual construction history of the CN Tower – at 40th year anniversaries * How the CN Tower was Built—Art of Engineering (YouTube documentary) Category:1970s establishments in Canada Category:1976 establishments in North America Category:Buildings and structures completed in the 20th century Category:Buildings and structures in Toronto Category:Seven Wonders of the Modern World Category:Towers in North America",
 "title": "CN Tower"
}