{
 "id": "905396",
 "text": "This is a list of numbers. This list will always be not finished. This happens because there are an infinite amount of numbers. Only notable numbers will be added. Numbers can be added as long as they are popular in math, history or culture. This means that numbers can only be notable if they are a big part of history. A number isn't notable if it is only related to another number. For example, the number (3,4) is a notable number when it is a complex number (3+4i). When it is only (3,4), however, it's not notable. If a number is not important, that can also make the number important. This is called the interesting number paradox. == Natural numbers == Natural numbers are a type of integer. They can be used for counting. Natural numbers can also be used to find out about other number systems. The symbol (or blackboard bold \\mathbb{\\N}, Unicode ) is used to symbolize all of the natural numbers.. A negative number is not a natural number. 0 is argued on whether or not it is a natural number. In computer science and set theory, 0 is a natural number. In number theory, it is not. To fix this, people use the terms \"non-negative integers\". Non-negative integers includes the number 0. \"Positive integers\" does not. Natural numbers can be used as cardinal numbers or ordinal numbers. Table of small natural numbers 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 400 500 600 700 800 900 330 1000 2000 3000 4000 5000 6000 7000 8000 9000 340 10,000 20,000 30,000 40,000 50,000 60,000 70,000 80,000 90,000 105 106 107 108 109 1012 larger numbers, including 10100 and 1010100 === Importance in math === Natural numbers can be important in mathematics. This might because it is part of a set. A number can also be important because it has a unique property. === Importance in culture === Many numbers are also important in culture. They can also be important for measurement. == Classes of natural numbers == === Prime numbers === A prime number is a type of natural number. It only has two divisors: 1 and itself. The first 100 prime numbers | 2 2 3 5 7 11 13 17 19 23 29 31 37 41 43 47 53 59 61 67 71 73 79 83 89 97 101 103 107 109 113 127 131 137 139 149 151 157 163 167 173 179 181 191 193 197 199 211 223 227 229 233 239 241 251 257 263 269 271 277 281 283 293 307 311 313 317 331 337 347 349 353 359 367 373 379 383 389 397 401 409 419 421 431 433 439 443 449 457 461 463 467 479 487 491 499 503 509 521 523 541 === Highly composite numbers === A highly composite number is a type of natural number. It has more divisors than any smaller natural number. They are used a lot in geometry, grouping, and time measurement. The first 20 highly composite numbers are: 1, 2, 4, 6, 12, 24, 36, 48, 60, 120, 180, 240, 360, 720, 840, 1260, 1680, 2520, 5040, 7560 === Perfect numbers === A perfect number is a type of integer. It has the sum of its positive divisors (all divisors except itself). The first 10 perfect numbers: == Integers == Integers are a set of numbers. They usually are in arithmetic and number theory. There are many subsets of integers. These can cover natural numbers, prime numbers, perfect numbers, etc. Popular integers are −1 and 0. === Orders of magnitude === Integers can be written in orders of magnitude. This can be written as 10k, where k is an integer. If k = 0, 1, 2, 3, then the powers of ten for them are 1, 10, 100 and 1000. This is used in scientific notation. Each number has its own prefix. Each prefix has its own symbol. For example, kilo- may be added to the beginning of gram. This changes the meaning of gram to mean that the gram is 1000 times more than a gram: one kilogram is the same as 1000 grams. Number 1000m Name Symbol 0.0000000001 10-24 Yokto y 0.000000001 10-21 Zepto z 0.00000001 10-18 Atto a 0.0000001 10-15 Femto f 0.000001 10-12 Pico p 0.00001 10-9 Nano n 0.0001 10-6 Micro μ 0.001 10-3 Mili m 0.01 10-2 Centi c 0.1 10-1 Deci d 10 101 Deca da 100 102 Hecto h 103 Kilo k 106 Mega M 109 Giga G 1012 Tera T 1015 Peta P 1018 Exa E 1021 Zetta Z 1024 Yotta Y == Rational numbers == A rational number is a number that can be written as a fraction with two integers. The numerator is written as p. The denominator(which cannot be zero) is written as q. Every integer is a rational number. This is because, in integers, 1 is always the denominator of a fraction. Rational numbers can be written in infinitely many ways. For example, 0.12 can be written as three twenty-fifths (\\frac{3}{25}), nine seventy-fifths (\\frac{9}{75}), etc. Table of notable rational numbers Decimal expansion Fraction Reason 1.0 \\bar1 \\bar1 is equal to 1, a notable real number. 1 0.5 \\bar2 \\bar2 is a popular number in math. For example, you can use \\bar2 to find the area of a Triangle. 3.142 857... \\frac{22}{7} \\frac{22}{7} is a number slightly above \\pi and is an approximation of \\pi. 0.166 666... \\bar6 One sixth is seen in a lot of equations. For example, the solution to the Basel problem uses 1/6. == Irrational numbers == Irrational numbers are numbers that cannot be written as a fraction. These are written as algebraic numbers or transcendental numbers. === Algebraic numbers === Name Expression Decimal expansion Reason Square root of two \\sqrt{2} The Square root of 2(also called Pythagoras' constant) is a number used in math a lot. It can be used to find the ratio of diagonal to side length in a square. Triangular root of 2 \\frac{\\sqrt{17}-1}{2} Phi, Golden ratio \\phi The golden ratio is a famous number used in both math and science. === Transcendental numbers === Name Symbol or Formula Decimal expansion Reason e, Euler's number e ... e is the base of a natural logarithm. Pi ... Pi is an irrational number that is the result of dividing the circumference of a circle by its diameter. === Real numbers === The real numbers are a superset(or category) of numbers. They cover algebraic and transcendental numbers. === Real but not known if irrational or transcendental === Name and symbol Decimal expansion Notes Euler–Mascheroni constant, γ ... The Euler–Mascheroni constant is used in limits and logarithms. It is thought to be transcendental but not proven to be so. Twin prime constant, C2 ... == Hypercomplex numbers == A hypercomplex number is a word for an element of a unital algebra over the field of real numbers. === Algebraic complex numbers === * i, Imaginary unit: i=\\sqrt{-1} == Transfinite numbers == Transfinite numbers are numbers that are \"infinite\". They are larger than any finite number. They are, however, not absolutely infinite. == Physical Constants == Physical constants are constants that can be used in the universe to figure out information. * Avogadro constant * Gravitational constant * Planck constant * Rydberg constant * Speed of light in vacuum == Named numbers == * Googol, 10,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000 * Googolplex, 1010,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000 * Graham's number, G * Skewes's number, S == References == == Bibliography == * * . == Further reading == * Kingdom of Infinite Number: A Field Guide by Bryan Bunch, W.H. Freeman & Company, 2001. == Other websites == * The Database of Number Correlations: 1 to 2000+ * What's Special About This Number? A Zoology of Numbers: from 0 to 500 * Name of a Number * See how to write big numbers * * Robert P. Munafo's Large Numbers page * Different notations for big numbers – by Susan Stepney * Names for Large Numbers, in How Many? A Dictionary of Units of Measurement by Russ Rowlett * What's Special About This Number? (from 0 to 9999) Category:Numbers Category:Mathematics lists",
 "title": "List of numbers"
}