{
 "id": "905477",
 "text": "The megaron (, , plural megara) is the rectangular great hall in Mycenaean and ancient Greek palace architecture. The hall was: 1) surrounded by four columns, 2) had an open portico with two columns in the front, and 3) had a central, open hearth venting through an oculus, or opening, in the roof.. The megaron also had the throne-room of the wanax, or Mycenaean Greek ruler, whose throne was in the main room with the central hearth.; . Similar architecture is found in the Near East but the open portico supported by columns is particular to the Aegean region. Megara are sometimes called \"long-rooms\" because of their rectangular shape and the position of their entrances.. There were often many rooms around the central megaron, such as archive rooms, offices, oil-press rooms, workshops, potteries, shrines, corridors, armories, and rooms storing wine, oil and wheat.. The megaron was used for sacrifices,. royal events, and court meetings. ==Structure== Halls in the shape of rectangles were a defining theme of Greek architecture.. The Mycenaean megaron originated from the megaroid, or large hall-centered rectangular building, of Greece dating back to the Late Neolithic and Early Bronze Age.. Also, it was the architectural forerunner to ancient Greek temples.. The megaron's structural layout included a columned entrance, a pronaos, a central naos (or cella), and one of many roof types (i.e., pitched, flat, barrel). The roof was supported by wooden beams.; . The floor was made of patterned concrete and covered in carpet.. The walls were built with bricks of mud,. and were decorated with frescoes. There were metal doors often having two-leaved wood decorations.. Footbaths were also used in the megaron as mentioned in Homer's Odyssey where Odysseus's feet were washed by Eurycleia.; Homer. Odyssey, XIX.316. The dimensions involving a larger length than width are similar structurally to the early temples of the Dorian Greeks.. ==Examples== A famous megaron is in the king's large reception hall in the Bronze Age palace of Tiryns where the main room had a raised throne placed against the right wall and a central hearth bordered by four Minoan-style wooden columns supporting the roof. The Cretan elements in the megaron of Tiryns were adopted by the Mycenaean Greeks from Minoan palace architecture. Frescoes from Pylos show people eating and drinking, which were important activities in Greek culture. Artistic images of bulls, a common animal motif in Mycenaean vase painting,. appear on Greek megaron frescoes such as the one in the Pylos megaron where a bull is shown at the center of a Mycenaean procession. Other famous megara include the ones at the Mycenaean palaces of Thebes and Mycenae.. Different Greek cultures had their own megara where, for example, the Greeks of the mainland separated their central megaron from the other rooms whereas the Greeks of Crete did not do this.. ==Related pages== *Mycenaean culture ==References== ===Citations=== ===Sources=== * * * * * * * * * * * * ==Further reading== *Homer's Odyssey contains detailed references to the megaron of Odysseus. * * * ==Other websites== * * Category:Rooms Category:Ancient Greek architecture",
 "title": "Megaron"
}