{
 "id": "90545",
 "text": "Baden-Baden () is a spa town with around 50,000 inhabitants in Baden- Württemberg, Germany. It is at the border of the Rhine valley and the Black Forest. The town is well known as a spa town, as a place for rich people and for many cultural offers. In the 19th century the town played an important role as a meeting place for the nobles, rich and other important people. A rich cultural heritage from that time can still be found at Baden-Baden. == History == The springs of Baden-Baden were known to the Romans, and the foundation of the town is referred to the emperor Hadrian by an inscription of somewhat doubtful authenticity. The name of Aurelia Aquensis was given to it in honour of Aurelius Severus, in whose reign it would seem to have been well known. Fragments of its ancient sculptures are still to be seen, and in 1847 remains of Roman vapour baths, well preserved, were discovered just below the New Castle. In 1931, the town of Baden-Baden was officially given its double name (a short form for \"Baden in Baden\", i.e. Baden in the state of Baden). In both World Wars, the town escaped destruction. After World War II, Baden-Baden became the headquarters of the French forces in Germany and the site of a displaced persons camp. From September 23 to September 28, 1981, the 11th Olympic Congress took place in the Kurhaus in Baden-Baden. The Baden Airpark is west of Baden-Baden. The Russian writer Dostoevsky wrote \"The Gambler\" while gambling at the famous Baden-Baden Casino. == Sights == * Kurhaus * The Casino * Friedrichsbad * Caracalla Spa * Lichtentaler Allee, a well known 19th century park * Sammlung Frieder Burda * Old Castle \"Hohenbaden\", built in 1102, the first residence of the margraves of Baden, a ruin since the 15th century * New Castle, former residence of the margraves of Baden * The famous Festspielhaus Baden-Baden * Ruins of Roman baths, ca. 2000 years old, excavated in 1847 * Stiftskirche, a church including the tombs of fourteen margraves of Baden * \"The Paradise\" (Paradies), an Italian style Renaissance garden with lots of trick fountains * Mount Merkur with Merkurbergbahn funicular railway and observation tower * Fremersberg Tower * Fabergé Museum Baden-Baden-Kurhaus-54-gje.jpg|Kurhaus Baden-Baden-Kurhaus-Casino-32-Roulette- gje.jpg|Casino Baden-Baden-Friedrichsbad-12-gje.jpg|Friedrichsbad Baden-Baden- Caracalla-Therme-22-gje.jpg|Caracalla Spa Baden-Baden-Sequoia-120-Lichtentaler Allee-2010-gje.jpg|Lichtentaler Allee Baden-Baden-Frieder-Burda- Museum-12-gje.jpg|Sammlung Frieder Burda Baden-Baden-Altes Schloss Hohenbaden-04-gje.jpg|Old Castle Baden-Baden-Neues Schloss-116-Innenhof-1981-gje.jpg|New Castle Baden-Baden- Festspielhaus-40-Premierenabend Liebestrank-Szene-gje.jpg|Festspielhaus Baden- Baden-Roemische Badruinen-10-Vitrine-2013-gje.jpg|Ruins of Roman baths Baden- Baden-Stiftskirche-30-von Hardstaffeln-gje.jpg|Stiftskirche Baden-Baden- Wasserkunst Paradies-16-aufwaerts-gje.jpg|Paradies Baden-Baden-Merkur-06-von Gelbeichweg-2015-gje.jpg|Mount Merkur Baden-Baden- Fremersbergturm-04-2014-gje.jpg|Fremersberg Tower Baden-Baden-Faberge-Museum- Schild russisch-2020-gje.jpg|Fabergé Museum == References == == Other websites == * Official site * Castle Hohenbaden * \"Art and Nightlife Have Baden-Baden Percolating Again\", New York Times, July 9, 2006 Category:Spa towns in Germany",
 "title": "Baden-Baden"
}