{
 "id": "905516",
 "text": "Johann Joachim Quantz (30 January 1697 – 12 July 1773) was a German composer, flautist (somebody who plays the flute) and flute maker from the late Baroque period. He was Frederick the Great's flute teacher. ==Life== Quantz was born in Oberscheden, Electorate of Hanover. From 1708 to 1713, Quantz studied music with his uncle, Justus Quantz, a town musician in Merseburg. After his uncle died, he studied with the organist Friedrich Kiesewetter. In 1714, Quantz travelled to Pirna, a town near Dresden. He studied Vivaldi's violin concertos.Biography with translated excerpts of Quantz's autobiography at a Elysium ensemble's website. In 1716 he joined the town band in Dresden. He studied counterpoint with Jan Dismas Zelenka in Vienna in 1717. In March 1718, he became an oboist (somebody who plays the oboe) in the Polish chapel of August II, Elector of Saxony and King of Poland. Quantz could not become a better oboe player than other oboe players. So, he changed his instrument to the flute. He learned playing the flute with Pierre-Gabriel Buffardin for four months. From 1724 to 1727, Quantz went on a trip around Europe. He met and studied with many musicians, including Francesco Gasparini in Rome, Alessandro Scarlatti in Naples, Michel Blavet in Paris, and George Frideric Handel in London. He returned to Dresden in July 1727. The trip made him famous around Europe. In 1728, Quantz visitied Berlin. He met Crown Prince Frederick. He returned to Berlin two times a year to teach Prince Frederick the flute. When King August II died, Quantz stayed in Dresden until Prince Frederick became King of Prussia. Quantz moved to Berlin. He became a composer and flute player for King Frederick. Quantz did not write operas. Other composers in Frederick's court wrote operas. ==Music== Quantz did not publish a lot of his music during his life. He wrote concertos, trio sonatas, and other works for the flute. ==Writing== Quantz wrote On Playing the Flute in 1752. It explains how people played music and the flute in the baroque period. ==References== Category:1697 births Category:1773 deaths Category:18th-century German composers Category:Oboists Category:Flutists",
 "title": "Johann Joachim Quantz"
}