{
 "id": "905671",
 "text": "Óscar García Junyent (born 26 April 1973), player name Óscar, is a former Spanish professional footballer. He is now the manager of the Ligue 1 club Stade de Reims. ==Career== He was able to play as an attacking midfielder or a second striker. Most of his active career he spent with CF Barcelona, but played also for Espanyol (four years), Albacete, Lleida and Valencia (one apiece). In La Liga he played 169 matches and 31 goals over 12 seasons. ==International== He played for Spain national under-23 football team at the 1996 Summer Olympics in Atlanta. He scored twice for the quarter-finalists. ==Coaching career== ===Maccabi Tel Aviv and England=== In 2009 he became member of Johan Cruyff's coaching staff in the Catalonia national team. On 22 May 2012 he became head coach of Maccabi Tel Aviv FC.2013 Maccabi won the Israel championship. Garcia resigned from his post because of personal reasons. 2013 he became head coach of the Football League Championship team Brighton & Hove Albion. He was November's Manager of the Month, with three wins and a draw. On 12 May 2014 the team was defeatet in the play-offs by Derby County. His offer of resignation was accepted by the club. 2014 García returned to Maccabi but left on 26 August due to war. Then he was appointed head coach at Watford. He was brought to hospital with minor chest pains on 15 September. Two weeks later he resigned as head coach. ===Red Bull Salzburg=== On 28 December 2015 Oscar followed Peter Zeidler as head coach of the Austrian Bundesliga team FC Red Bull Salzburg. During his time in Salzburg he won twice the double (Cup and Champion). ===Saint-Étienne=== On 15 June 2017 he signed with AS Saint-Étienne. In November after a 5–0 home loss against Olympique Lyonnais he left the club by mutual agreement. ===Olympiacos=== 2018 he became head coach of Olympiacos F.C. in Greece. His contract was dissolved on 3 April 2019. ===Celta=== In November 2019 he took over RC Celta de Vigo in La Liga. On the last day of the season he could held the team in the first league. On 9 November 2020, after only one win in nine matches of the new campaign, García was sacked. ===Reims=== García returned to the French Ligue 1 in June 2021 as head coach of Stade de Reims. ==Personal life== García's brothers, Roger and Genís were also footballers. ==Managerial statistics== Team Nat From To Record P W D L Win % Maccabi Tel Aviv 22 May 2012 22 May 2013 Brighton & Hove Albion 26 June 2013 12 May 2014 Maccabi Tel Aviv 2 June 2014 26 August 2014 Watford 2 September 2014 29 September 2014 Red Bull Salzburg 28 December 2015 15 June 2017 Saint-Étienne 15 June 2017 15 November 2017 Olympiacos 6 January 2018 3 April 2018 Celta 9 November 2019 9 November 2020 Reims 23 June 2021 Present Total ==Honours== ===Player=== ====Club==== Barcelona *La Liga: 1993, 1994, 1998, 1999 *Copa del Rey: 1997, 1998 *UEFA Cup Winners' Cup: 1997 *UEFA Super Cup: 1997 Valencia *Supercopa de España: 1999 ====International==== Spain U-21 *UEFA European Under-21 Championship runner-up: 1996; third place 1994 ===Manager=== Maccabi Tel Aviv *Israeli Premier League: 2013 Red Bull Salzburg *Austrian Football Bundesliga: 2016, 2017 *Austrian Cup: 2016, 2017 ===Individual=== *Football League Manager of the Month: November 2013 ==Other websites== * *FC Barcelona profile * ==References== Category:1973 births Category:Living people Category:Footballers from Catalonia Category:Association football midfielders Category:Association football forwards Category:Spanish football managers Category:FC Barcelona players Category:FC Red Bull Salzburg managers Category:Footballers at the 1996 Summer Olympics Category:Olympiacos F.C. managers Category:RC Celta de Vigo managers Category:Sportspeople from Sabadell",
 "title": "Óscar García"
}