{
 "id": "905633",
 "text": "The Marvels is a 2023 American superhero movie. It is based on Marvel Comics. The movie features the characters Carol Danvers (Captain Marvel), Kamala Khan (Ms. Marvel), and Monica Rambeau. It was produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. The movie is the sequel to Captain Marvel (2019) and the continuation of the Disney+ series Ms. Marvel (2022). It is the 31st movie in the Marvel Cinematic Universe (MCU). The movie was directed by Nia DaCosta. The screenplay was written by Megan McDonnell. It stars Brie Larson as Carol Danvers, Iman Vellani as Kamala Khan and Teyonah Parris as Monica Rambeau. Marvel Studios said they were making a sequel to Captain Marvel in July 2019. They said that development began in January 2020 with Larson set to return. DaCosta was hired that August. Vellani and Parris were said to be cast in December. Filming began in mid-April 2021 in New Jersey. Principal photography began in August 2021. It took place at Pinewood Studios in Buckinghamshire as well as in Tropea, Italy and Los Angeles. The Marvels was released in the United States on November 10, 2023, as part of Phase Five of the MCU. The Marvels was the final Marvel movie released on home video by Walt Disney Studios Home Entertainment before Disney switched it's home video business to Sony Pictures Home Entertainment. == Premise == Following the events of Ms. Marvel (2022), Carol Danvers, Kamala Khan, and Monica Rambeau begin swapping places with each other every time they use their powers and must team-up to figure out why. == Cast == * Brie Larson as Carol Danvers / Captain Marvel: An Avenger and ex-U.S. Air Force fighter pilot whose DNA was altered during an accident, imbuing her with superhuman strength, energy projection, and flight. * Iman Vellani as Kamala Khan / Ms. Marvel: A teenage mutant from Jersey City who idolizes Danvers and wears a magical bangle that unlocked her ability to harness cosmic energy and create hard light constructs. * Teyonah Parris as Monica Rambeau: An agent of S.W.O.R.D. with the ability to absorb energy. She is the daughter of Danvers' friend and fellow airman, Maria Rambeau, and looked up to Danvers as a child. Parris said The Marvels would further explore Rambeau beyond what was established in WandaVision (2021). * Samuel L. Jackson as Nick Fury: The former director of S.H.I.E.L.D. who is working with the Skrulls in deep space. Saagar Shaikh, Zenobia Shroff, and Mohan Kapur reprise their respective roles from Ms. Marvel (2022) as Khan's older brother Aamir, mother Muneeba, and father Yusuf. Zawe Ashton has been cast as a villain, and Park Seo-joon has been cast in an undisclosed role. The Flerken Goose, who resembles a cat, returns from the first movie. ==References== Category:2020s superhero movies Category:2023 superhero movies Category:2020s American action movies Category:American sequel movies Category:Marvel Cinematic Universe movies Category:Movies set in Italy Category:2020s sequel movies",
 "title": "The Marvels"
}