{
 "id": "90583",
 "text": "'Christopher Maurice Brown' (born May 5, 1989) is an American singer, songwriter, dancer, and actor. He is one of the most successful R&B; singers of the generation as said by Billboard. He has often been called by many contemporaries as the \"King of R&B;\". Forever is one of Brown's most famous songs. He has won three American Music Awards, three MTV Video Music Awards, eleven BET Awards, and one Grammy Award. ==Personal life== He got attention when he was arrested and convicted in 2009 for beating his then-girlfriend, Barbadian singer Rihanna. He was sentenced to five years probation and six months community service. He was also ordered to stay at least 300 feet away from her for five years. Brown has bipolar disorder and post-traumatic stress disorder.Brown diagnosed with PTSD and bipolar disorder He made his own record label CBE (Chris Brown Entertainment or Culture Beyond Your Evolution) in 2007. Brown has three children: Royalty Brown (born 2014 with Nia Guzman), Aeko Catori (born 2019 with Annika Harris) and Lovely Symphani (born 2022 with Diamond Brown) ==Artistry== Brown has a three-octave tenor vocal range and the useful of the falsetto. He lists Michael Jackson, Marvin Gaye, Sam Cooke, Ginuwine, Lil Wayne, 2Pac, Phil Collins, Bobby Brown and R. Kelly as his musical influences. ==Discography== Brown has released 11 studio albums and 9 mixtapes: Year Album 2005 Chris Brown 2007 Exclusive 2009 Graffiti 2011 F.A.M.E. 2012 Fortune 2014 X 2015 Fan of a Fan: The Album (with Tyga) 2015 Royalty 2019 Indigo 2022 Breezy 2023 11:11 ==References== Category:1989 births Category:Living people Category:American dancers Category:American criminals Category:American pop singers Category:American R&B; singers Category:American pop rappers Category:Actors from Virginia Category:Singers from Virginia Category:Rappers from Virginia Category:American movie actors Category:American Music Awards Category:African-American actors Category:American hip hop singers Category:African-American singers Category:African-American rappers Category:American dance musicians Category:American singer-songwriters Category:People with bipolar disorder Category:21st-century American actors Category:21st-century American rappers Category:American Grammy Award winners Category:American contemporary R&B; singers Category:African-American television actors Category:American people convicted of assault Category:21st-century American singer-songwriters",
 "title": "Chris Brown"
}