{
 "id": "905951",
 "text": "Teuku Iskandar was an Indonesian scholar, literary critic, lexicographer, historian, and nobleman. He was one of the native Indonesians of Acehnese who wanted to find explore the historical records of the indigenous civilizations of the Indonesian island of Sumatra (mainly revolve about the literatures of Acehnese, as well as Malay). In the modern days, Teuku Iskandar considered as the linguistic father of Standard Malay, a standardized form of Malay which heavily based on the Standard Indonesian linguistic elements. == Biography == ===Background=== Teuku Iskandar was born at the district of Trienggadeng in the Pidie Jaya regencial territory of Aceh (part of modern-day Indonesia). He was a native Acehnese who was born to a father who were an Aceh's uleebalang ( in Acehnese). His front name Teuku indicated that he was originally from notable Acehnese family background. ===Early life=== In 1947, a day after Queen Juliana appointed as regent, the 18-year-old Teuku Iskandar was able to continue his study at Leiden University in Leiden (part of the Netherlands). In 1955, he earned his doctorate from Leiden University with a dissertation which was later published as a book, De Hikajat Atjeh (). Topics related to Aceh has become his personal interest due to his personal ancestry background, which later also became his main topic of his dissertation. His interest was mainly driven by his personal background because at that time he was part of the first-known generation of Acehnese who studied at the Leiden University in Netherlands. Moreover, at that time he was motivated by the fact that there were not as many books written by native Indonesians that discuss about the state of Aceh and its natives (the Acehnese people and Acehnese language). In addition, Teuku Iskandar adore the Acehnese culture so much, as he told to his children. ===1960s=== In the 1960s, Teuku Iskandar asked by Sukarno (the first president of Indonesia) to be part of the founders of a state university in the state of Aceh, which later publicly known as the Syiah Kuala University, which he was briefly served as the dean for the Faculty of Economics for several years. His diligence in studying the Malay literature as one of the indigenous languages of Sumatra (and also the native culture of Sumatra in general) attracted another countries interest, such as the federation of Malaysia who had no capable linguists or even scholars at that time (as Malaysia was developed as newly created country), he was offered to work at the Dewan Pustaka dan Bahasa () of Malaysia. During his tenure, Teuku Iskandar asked by the Malaysia's linguistic council to copied the Bahasa Indonesia dan Pembakuannya () and Kamus Besar Bahasa Indonesia () who were developed by Raja Ali Haji (an Indonesian Bugis scholar) since 19th century and Anton Moeliono in 1969 to re-branded and claimed it as the Kamus Dewan () that published in 1970 and designated as the main linguistic reference for the Malay language in the region (which later also known as Malaysian Malay). At the same time, he was also asked by the Sultan of Brunei Darussalam to become a lecture at the University of Brunei Darussalam and he received a professorship from the university. His works are still used as the main linguistic source for the Standard Malay until nowadays in all respective Malay-speaking countries (which may include Singapore). Teuku Iskandar later returned to Leiden to serve as the lecturer. Within his alma-mater (Leiden University) educational environment, he became a prominent and ultimate professor for Acehnese and Malay literature, and also gave special classes in the Acehnese language. As an Acehnese enthusiast, he also continued to produce his works related to Aceh including the Catalog of Acehnese Manuscripts (compiled with Voorhoeve), two large volumes of the Catalog of Malay, Minangkabau and South Sumatra, and Manuscripts (in the Netherlands). ===Family relationship=== Studying classical literary manuscripts is a job that not many people can do. It takes passion, perseverance, thoroughness and high concentration. But, indeed, such qualities seem to be attached to Teuku Iskandar. \"Dad really likes history and art\", said Tjut Njak Ubit Iskandar who are the second daughter of Teuku Iskandar. Teuku Iskandar is very thorough even in reading the books he referenced. As a close daughter, Tjut Njak Ubit Iskandar often found his father's handwritten notes in reference books, which indicated that the information in the books could be referenced or questioned. Ubit also said that his father is the type of person who reads and contemplates a lot. Despite his abundant knowledge, he is not an 'outsider' or talkative person. Not all of his interlocutors can also make him interested in talking. But if he meets someone he thinks is sharp-minded, this father of three will be an extraordinary storyteller. “When there is a moment like that, my mother usually asks me to bring a recording device to save the interesting conversation,” recalls Ubit. Teuku Iskandar was also a scholar and person who holds principles. He's not the kind of person who wants to please others but rather be himself. In Ubit's eyes, his father was not interested in politics even though he loved Sumatran (especially Acehnese and Malay) culture very much, he was an intellectual who carried himself as a citizen of the world. Also, not many people know that Teuku Iskandar is very fond of architectural history. According to Ubit, it can be said that his father's first love was precisely in architecture. However, because his chemistry skills were not sufficient to become a scholar of architecture, he then chose to study literature. Teuku Iskandar's passion for architecture can be found in his residence in Jakarta which he designed himself. He also built a rest house with an English garden-style garden in Bogor, which he also designed his own architecture. At his home in the Netherlands, Teuku Iskandar designed a fireplace made of wood from a bridge from the 17th century with Acehnese decorations. One of his other hobbies is sketching. Teuku also once conveyed his dream to his sons and daughters, he wanted to build a farmhouse in Aceh. \"I have a dream (to develop) in Aceh\", Ubit remembers his father. In one of his works, a book that discusses Bustanas-Salatin by Nuruddin ar-Ranniry, Teuku Iskandar asked Ubit to translate it into English. For years, the father and daughter studied books by 17th century clerics who were read by scholars and sultans in the Aceh Kingdom. For Ubit, it was a wonderful experience that was unforgettable. As a respected scholar (mainly in Indonesia and Southeast Asia), Teuku Iskandar was known as a very down-to-earth person. Tjut Rosmanida, his first daughter who lived in Medan, said, “Father is a humble and simple person. His demeanor is mediocre. When you go home to Aceh, you always ask for Acehnese food to be cooked. He likes all Acehnese dishes.” A valuable lesson from his father that he always reminded him to be proud to be an Acehnese and proud to speak the Acehnese language. ==Awards== Teuku Iskandar was officially awarded in 2017 as the ‘Satyalancana Budaya’, an award by the national government of the Republic Indonesia due to his revolutionary and persistent works, especially in revivifying the indigenous Sumatran linguistics and cultures (mainly revolve about Acehnese, as well as Malay). == List of notable works == * De Hikayat Atjeh ( 'Acehnese Annals'). ‘S-Gravenhage: Nederlandsche Boek-en Steendrukkerij V. H. H. L. Smits. (RCLOS 992.1 ISK), 1959. * Some Aspects Concerning the Work of Copyists of Malay Historical Writings // Peninjau Sejarah, 3 (2), 1968. * Kamus Dewan. Kuala Lumpur: DBP, 1970 (second edition 1984) * Hikayat Aceh: Kisah Kepahlawanan Sultan Iskandar Muda ( 'Acehnese Annals: The Heroic Story of Sultan Iskandar Muda'). Banda Aceh: Proyek Rehabilitasi dan Perluasan Museum Daerah Istimewa Aceh, 1978. * Kesusasteraan Klasik Melayu Sepanjang Abad ( 'Classic Malay Literature Throughout the Centuries'). Bandar Seri Begawan: Jabatan Kesusasteraan Melayu Universiti Brunei Darussalam, Brunei, 1995. * Catalog of Acehnese Manuscripts. Leiden, University Library / ILDEP 1994 / (Codices Manuscripti XXIV) (with P. Voorhoeve).(review) Henri Chambert-Loir // Bulletin de L’cole française d’Extréme-Orient, N 81 1994, p. 402-403 * Catalog of Malay, Minangkabau, and South Sumatran manuscripts in the Netherlands. 2 vols., Xiv, 1095 pp. Leiden: Documentatiebureau Islam-Christendom, 1999.(review) Vladimir Braginsky. Bulletin of the School of Oriental and African Studies 64 (03): 401 - 455, October 2001 * Hikayat Aceh ( 'Acehnese Annals'). Kuala Lumpur: Yayasan Karyawan (R 959.81 ISK), 2001. * Aceh as a Muslim-Malay Cultural Center (14th-19th Century) // First International Conference of Aceh and Indian Ocean Studies February 24–27, 2007. Organized by Asia Research Institute, National University of Singapore & Rehabilitation and Construction Executing Agency for Aceh and Nias (BRR), Banda Aceh, Indonesia 2007. ==Named after Teuku Iskandar== ===Indonesia=== # Teuku Iskandar Street (), a street located at Lamteh, Banda Aceh City, Aceh Province. # Teuku Iskandar Street Block Rose (), a street located at Ceurih, Banda Aceh City, Aceh Province. # Teuku Iskandar Street Block Jasmine (), a street located at Lambhuk, Banda Aceh City, Aceh Province. ==References== ==Further reading== * Category:1924 births Category:2012 deaths Category:Literary critics Category:Indonesian writers Category:Aceh",
 "title": "Teuku Iskandar"
}