{
 "id": "905942",
 "text": "Palembangese or Palembang Malay (Palembang: Uwong Pelémbang) are indigenous ethnic group native to the Palembang regions in southern Sumatra, Indonesia. There are around 3,800,000 Palembang living in Indonesia.Sosial Budaya dan Adat Kota Palembang. Retrieved 6 Juli 2023. ==Culture== The Palembang culture is one of the oldest civilisations in Indonesia. Especially they flourished in the southern hempishere of Sumatra. ==Noble titles== According to its prominent role, the Palembang Malay people are categorized under two classifications. They are the Wong Jero/Wong Jeroo ( 'aristocrats') and Wong Jabo ( 'regular people'). Palembangese noble titles are highly influenced by the Javanese nobility system due to the Javanese royals relationship with the Palembangese royals. ===Male=== * Ki, Kie, Ke, or Kyai ** Kimas/Ki Mas, Kiemas/Kie Mas, Kemas, or Kyai Mas, the male noble title with the ancestry line of Kemas Anom Dipati. (figures with this title: Taufiq Kiemas) ** Ki Gede or Kyai Gede, it is among one of the earliest titles used by Palembangese influenced by Javanese royals noble system. In the structure of Javanese society, the title Ki or Kyai is an honorary title given to someone who is considered wise or has aristocratic origins. ** Kiagus or Kyai Agus. * Mas ** Masagus, the male nobility title. * Pangeran ** Pangeran Adipati, the male nobility title for the crown prince brothers. ** Pangeran Ratu, the male nobility title for the crown prince. * Prabu ** Prabu Anom. * Raden, the male nobility tile. * Raja ** Raja Madang ===Female=== * Mas ** Masayu, the female nobility title. * Nyanyu * Nyi or Nyai ** Nyi Gede or Nyai Gede, it is the female honorary title who had aristrocratic origins. ** Nyimas or Nyai Mas. * Raden ** Raden Ayu, the female (married) nobility title. * Ratu ** Ratu Agung ** Ratu Gading ** Ratu Ilir or Ratu Ilèr ** Ratu Mas ** Ratu Sepuh *** Ratu Sepuh Asma ** Ratu Ulu ==Notable people== ===Entertainment industry=== * Dinda Hauw, a female Indonesian actress. Her real Palembangese name is Nyimas Khodijah Nasthiti Adinda. * Fenita Jayanti Fenita Arie, a female Indonesian actress and presenter. * Gita Savitri, a female Indonesian TV star. * Putri Titian Asih Putri Titian, a female Indonesian actress and TV star. ===Pageantry=== * Maria Selena, a female Indonesian actress, Puteri Indonesia 2011 ( 'Miss Universe Indonesia 2011'), and Top 22 of Miss Universe 2012. ===Politics=== * Taufiq Kiemas, a male Indonesian politician. ===Sports=== * Mohammad Ahsan, Indonesian badminton player who specializes in the men's doubles, ranked Top 6 in the BWF World Rankings. ==References== == Bibliography == * * Category:Ethnic groups in Indonesia Category:South Sumatra",
 "title": "Palembang people"
}