{
 "id": "906088",
 "text": "Sistem Televisyen Malaysia Berhad, operating as TV3 (pronounced as Tivi Tiga), is a Bangsar-based Malaysian free-to-air television channel owned by Malaysian media conglomerate, Media Prima. The network is notable for opening the big doors for the launching of private TV stations in Malaysia and responsible for launching the careers of many well-known personalities in broadcasting fields. Since 2003, it also organised the Jom Heboh carnival to promote its brands and products. ==History== ===Setup=== As early as 1976, some members of parliament demanded the creation of a commercial television channel, but concerns were raised by the government over a potential loss of revenue from newspapers and magazines. A license was granted to Fleet Holdings, which was owned by Tun Dr. Abdul Daim Zainuddin in August 1983. Officials from CBS were in talks with Fleet Holdings executives regarding the development of broadcasting in the country. The plan was to produce 30% national content and air 70% international content, with the option to buy programmes produced by the government. Fleet Holdings, the publisher of the New Straits Times, was chosen due to its \"capacity, capability and expertise\". The channel, with a projected launch date of 1 January 1985, was budgeted at RM 45 million. One of the plans was to recapture urban audiences, who had escaped television in pursuit of other forms of entertainment, especially home video, a practice that, among the ethnic groups, was more prevalent in Chinese Malaysians. In November 1983, TV3 announced that its broadcasts would start ahead of schedule, at some point in 1984. Work for the transmitter at Bukit Besi started in February 1984, revealing the TV3 name to the public. In a surprise move, the channel later secured the rights to the 1984 Summer Olympics days later, to be held later in the year in Los Angeles. The decision still depended on whether or not the owners would start the channel on time. A prospective launch date of between June and July was then announced. ===Beginning of operations=== TV3 (Sistem Televisyen Malaysia Berhad) officially began broadcasting in the Klang Valley (the area surrounding Kuala Lumpur, capital of Malaysia) in conjunction the Hijri date of the first day of the holy month of Ramadan year 1404 AH (1 June 1984) at 5:00pm local time. The deliberate choice of starting the channel during Ramadan was to test the openness of the Malaysian society. The television channel used to broadcast from a building in Jalan Liku, Bangsar, Lembah Pantai, Kuala Lumpur before it moved to Sri Pentas, Bandar Utama, Petaling Jaya, Selangor in 1995. Initially, the channel ran for seven hours a day - 5:00pm to 12:00am relying largely on television series produced mainly in the UK and the USA. The programming was mostly new to Malaysia, although some shows were already acquired by SBC (now Mediacorp) in neighboring Singapore. The channel initially had its coverage area limited to the Klang Valley, with plans to start increasing its coverage by the end of the year. Among the shows seen on the new service were Yellow Rose, Hill Street Blues (which SBC rejected), Just Our Luck and Scarecrow and Mrs King. There was also a dedicated slot for Chinese viewers (7 to 8pm), prime-time entertainment at the time RTM's channels were airing news and related programming, and movies in the last slot before closedown. Initially the channel, despite its entertainment format, was faced with criticism over the lack of news and documentaries, while clerics believed that the channel's lack of documentaries would have an adverse influence. Facing the moral controversies the channel had suffered, the channel added prayer calls (RTM had already done for its channels) and had plans to air the main news from RTM. In order to broadcast the news, TV3 needed permission from various organisations (ABU, Asiavision, Visnews, etc.). In late June 1984, the government was studying the effects to TV3 related to the permission of allowing private radio stations to be opened. 1 June 1984. TV3 is the first and oldest private television channel in Malaysia. In 1996, TV3 set up its four subsidiaries in Ghana in which it owns a 52.5% of equity stake for each of these subsidiaries. In 1997, TV3 and MetroVision was ordered by the Ministry of Information to relocate their transmitters to the Kuala Lumpur Tower. TV3 began 24 hour broadcasting on 31 August 1997 after the government realised that cable and satellite television stations that operate 24 hours have no negative effect to the population, something the government previously sceptical about for productivity reasons. TV3 had plans to start a second channel by the name of TV9 in 1997, unrelated to the present-day TV9. The application had yet to be received by the Information Ministry. In April 1998, TV3 and MRCB agreed to build studios and audiotorium in Shah Alam, costing RM 7.2 million and planned to be completed on 31 October 1998. TV3 would be the sole user of such facilities. MRCB will receive RM1.7 million from TV3's advertising income. In November 1998, TV3 decided to reduce its broadcast hours to just 12 hours for Mondays to Thursdays instead of 20 hours starting next month. In the financial results of MRCB ending 31 August 1998, TV3 recorded a loss of RM 82 million. TV3 become the first TV station in Malaysia and the Asian region when it introduces a 3D broadcast in 2001 for some of its programmes and international films. It also held a charity campaign known as Kurniaan Harapan (A Gift of Hope) in collaboration with the Tun Hussein Onn National Eye Hospital and the Malaysian Association for the Blind (MAB) to raised funds for the visually-impaired. To coincide with the campaign, a 3D spectacles was on sale at selected Caltex, 7-Eleven, Courts Mammoth and TOPS outlets. The campaign took place from 28 January to 26 February 2001. On 22 September 2003, both Sistem Televisyen Malaysia Berhad and The New Straits Times Press (Malaysia) Berhad were spun off from Malaysian Resources Corporation Berhad (MRCB), in which the latter had acquired from Renong Berhad in 1993 to form Media Prima Berhad. In 2004, TV3 celebrates its 20th anniversary and concurrently reintroduced 24-hour broadcast time, which has introduced a year before, in 2003. On 6 September 2007, TV3 along with its sister channels, ntv7, 8TV and TV9 made available for online viewing via Media Prima's newly-launched streaming service, Catch-Up TV, which later rebranded as Tonton. In 2008, TV3 through programs produced by it, dominates the list of 20 programs with higher viewership. During the Eid- ul-Fitr celebration in 2009, TV3 dominates 30 percent of entire viewership. In the first quarter of 2013, TV3 commands a 26% of market share in television audience. On 1 June 2024, TV3 celebrates its 40th anniversary. It also organised an event called Immersio: Inspirasi Generasi By TV3, which took place at the Telekom Museum prior to its anniversary celebration. Media Prima announced on 15 October 2024 that the news operations of all of its television networks, including TV3, will began broadcast at the company's Balai Berita starting 21 October after more than two decades operated at Sri Pentas, Bandar Utama. ==Programmes TV3== This is a list of television programmes broadcast by TV3 either currently broadcast or formerly broadcast on TV3 in Malaysia. ===Bananana! block=== * 44 Cats * Android Kikaider * Arthur * American Dragon: Jake Long (aired on 2013-2015) * Avatar: The Last Airbender * Bakugan Battle Planet * Bakugan (2023) * Barbie movie series * Barbie: Dreamtopia * Battle Claw (also on TV2) * Beyblade Series * Metal Fight Beyblade * Beyblade Burst * Beyblade X (Upcoming) * Blaze and the Monster Machines (also on TV2) * BoBoiBoy * BoBoiBoy Galaxy * Bubble Guppies * Bunsen Is a Beast * Digimon Adventure * Dora the Explorer * Deer Squad * Ejen Ali (2016 - 2018, 2023) * Go, Diego, Go! * Kamen Rider Series * Kamen Rider: Dragon Knight * Kamen Rider Build * Kamen Rider Zi-O * Kamen Rider Zero-One * Kung Fu Panda: Legends of Awesomeness (also airs on NTV7) * Larva * Lego series * Lego City Adventures * Lego Friends - Girls on A Mission * Lego Monkie Kid (also aired on NTV7 & 8TV) * Lego Ninjago * My Little Pony: Friendship Is Magic (formerly aired on NTV7) * Maggie & Bianca: Fashion Friends * Oggy and the Cockroaches (Season 1-7 Only) * Ollie and Friends * Paw Patrol * Penguins of Madagascar * Peppa Pig * Pokémon Series ** Pokémon Sun and Moon ** Pokémon Sun and Moon Ultra Adventures * Power Rangers **Power Rangers Dino Supercharge (rerun from NTV7 starting 7 February 2019) * The Powerpuff Girls (2016 reboot) * Postman Pat (Series 3-8) * Pony Life * Rabbids Invasion (formerly aired on NTV7) * Rat-A- Tat * Recess (aired on 2013) * Rise of the Teenage Mutant Ninja Turtles * Robot and Monster * Rolling with the Ronks! * Senario Toons * Shimmer and Shine * Sing & Dance with Barney *Special Rescue Exceedraft **SpongeBob SquarePants * StoryBots Super Songs * Superbook * Super Sentai * Zyuden Sentai Kyoryuger (moved from NTV7 during repeat since 31 December 2018) * TaleSpin (aired on 2013) * Team Umizoomi * Teacher's Pet * Teletubbies (2015 series) * The Adventures of Jimmy Neutron * The Adventures of Kid Danger * The Amazing Awang Khenit * The Fairly OddParents * The Proud Family (aired on 2012-2013) * Thomas & Friends * Top Wing * Trolls: The Beat Goes On! * True and the Rainbow Kingdom * Turning Mecard Wallykazam! * Ben 10: Ultimate Alien **Ben 10: Omniverse * Sofia The First * The Troop * Victorious * Kim Possible (Also aired on NTV7, starting in June 2014) ===Japanese anime=== * Aikatsu! (Malaysian dubbed, and opening and closing theme are dubbed in Malaysia) * Aoashi * Astroboy * Atashinchi * Beyblade * Bleach * Blue Dragon (TV series) * Card Captor Sakura * Crush Gear Turbo * Date A Live * Detective Conan * Fullmetal Alchemist * Initial D * Lucy of the Southern Rainbow * Mirmo Zibang * Mermaid Melody Pichi Pichi Pitch * Mon Colle Knights * My Annette * Naruto * Rurouni Kenshin * Samurai 7 * Super Doll Licca * Nanook's Great Hunt ===International programmes=== * Caught On Camera (MSNBC) (Reality Television - Documentary - News) * Changing Rooms Australia (Network Ten) * Disorderly Conduct: Video On Patrol (Spike) * Extreme Makeover Home Edition USA (ABC) * Human Weapon (History Channel) * Master in the House (SBS) * Most Daring (Court TV & truTV) * Most Shocking (Court TV & truTV) * MXC (Most Extreme Elimination Challenge) (Spike) * Top 20 Funniest (truTV) * The Titan Games (NBC) * Unbeatable Banzuke * WWE SmackDown * WWF SmackDown * World's Most Amazing Videos (NBC & Spike) * World's Wildest Police Videos (Spike) * World's Wildest Vacation Videos (truTV) ===English Series TV3=== * Agents of S.H.I.E.L.D. (ABC) * Cloak & Dagger (Freeform) * CSI: Crime Scene Investigation (CBS) * Dawson's Creek (The WB) * Grey's Anatomy (ABC) * Hannibal (NBC) * Heroes (NBC) * Kyle XY (ABC Family) * NCIS (CBS) * NCIS: Los Angeles (CBS) * No Ordinary Family (ABC) * Prison Break (FOX) * Riverdale (The CW) * Runaways (Hulu) * Smallville (The CW) * Supernatural (The CW) ==References== ==Other websites== * Official Website Category:1984 establishments in Malaysia Category:Malaysian culture Category:Television networks",
 "title": "TV3 (Malaysian TV network)"
}