{
 "id": "906337",
 "text": "Sogdia () or Sogdiana was an ancient Iranian civilization in present-day Uzbekistan, Tajikstan and Kyrgyzstan, located in Central Asia. ==Related pages== * Kipchaks * Tocharians * Tang Dynasty * Achaemenid Empire * Indo- Iranian peoples * Indo-Iranian languages ==Further reading== * ==Other websites== * Sogdian on Interlinguae * Xerxes II and Sogdianus * The Sogdians: Influencers on the Silk Roads (Online exhibition) ==References== * * Ahmed, S. Z. (2004), Chaghatai: the Fabulous Cities and People of the Silk Road, West Conshohocken: Infinity Publishing. * Baumer, Christoph (2012), The History of Central Asia: the Age of the Steppe Warriors, London, New York: I.B. Tauris, . * Belenitskii, A. M. and B. I. Marshak (1981), \"Part One: the Paintings of Sogdiana\" in Guitty Azarpay, Sogdian Painting: the Pictorial Epic in Oriental Art, Berkeley, Los Angeles, London: University of California Press, pp 11–78, . * Boulnois, Luce (2005), Silk Road: Monks, Warriors & Merchants, Odyssey Books, . * Briant, Pierre (2002), From Cyrus to Alexander: a History of the Persian Empire, trans. Peter T. Daniels, Winona Lake: Eisenbrauns, . * Christopoulos, Lucas (August 2012), \"Hellenes and Romans in Ancient China (240 BC – 1398 AD),\" in Victor H. Mair (ed), Sino-Platonic Papers, No. 230, Chinese Academy of Social Sciences, University of Pennsylvania Department of East Asian Languages and Civilizations, ISSN 2157-9687. * Rafe de Crespigny (2007), A Biographical Dictionary of Later Han to the Three Kingdoms (23–220 AD), Leiden: Koninklijke Brill, . * Étienne de la Vaissière (2005). Sogdian Traders: A History. Leiden: Brill. * Dresden, Mark J. (1981), \"Introductory Note,\" in Guitty Azarpay, Sogdian Painting: the Pictorial Epic in Oriental Art, Berkeley, Los Angeles, London: University of California Press, pp. 1–10, . * Enoki, Kazuo, (1998), \"Yü-ni-ch'êng and the Site of Lou-Lan,\" and \"The Location of the Capital of Lou-Lan and the Date of the Kharoshthi Inscriptions,\" in Rokuro Kono (ed.), Studia Asiatica: The Collected Papers in Western Languages of the Late Dr. Kazuo Enoki, Tokyo: Kyu-Shoin. * Frumkin, Grégoire (1970), Archaeology in Soviet Central Asia, Leiden, Koln: E. J. Brill. * Galambos, Imre (2015), \"She Association Circulars from Dunhuang\", in ed. Antje Richter A History of Chinese Letters and Epistolary Culture, Brill: Leiden, Boston, pp 853–77. * Gasparini, Mariachiara. \"A Mathematic Expression of Art: Sino-Iranian and Uighur Textile Interactions and the Turfan Textile Collection in Berlin,\" in Rudolf G. Wagner and Monica Juneja (eds.), Transcultural Studies, Ruprecht-Karls Universität Heidelberg, No 1 (2014), pp. 134–163. . ** * Ghafurov, Babadjan, \"Tajiks\", published in USSR, Russia, Tajikistan * Peter B. Golden (2011), Central Asia in World History, Oxford, New York: Oxford University Press, p. 47, . * Hanks, Reuel R. (2010), Global Security Watch: Central Asia, Santa Barbara, Denver, Oxford: Praeger. * Hansen, Valerie (2012), The Silk Road: A New History, Oxford: Oxford University Press, . * Hansson, Anders, (1996), Chinese Outcasts: Discrimination and Emancipation in Late Imperial China, Leiden, New York, Koln: E.J. Brill, . * Holt, Frank L. (1989), Alexander the Great and Bactria: the Formation of a Greek Frontier in Central Asia, Leiden, New York, Copenhagen, Cologne: E. J. Brill, . * Howard, Michael C. (2012), Transnationalism in Ancient and Medieval Societies: the Role of Cross Border Trade and Travel, Jefferson: McFarland & Company. * Hucker, Charles O. (1975). China's Imperial Past: An Introduction to Chinese History and Culture. Stanford: Stanford University Press. . * A.F.P. Hulsewé. (1986). \"Ch'in and Han law,\" in Denis Twitchett and Michael Loewe (eds.), The Cambridge History of China: Volume I: the Ch'in and Han Empires, 221 B.C. – A.D. 220, pp 520–544 Cambridge: Cambridge University Press. . * Ibbotson, Sophie and Max Lovell- Hoare (2016), Uzbekistan, 2nd edition, Bradt Travel Guides Ltd, . * Braja Bihārī Kumar (2007). \"India and Central Asia: Links and Interactions,\" in J.N. Roy and B.B. Kumar (eds.), India and Central Asia: Classical to Contemporary Periods, 3–33. New Delhi: Published for Astha Bharati Concept Publishing Company. . * Litvinski, B. A., A. H. Jalilov, A. I. Kolesnikov (1999), \"The Arab Conquest\", in History of Civilizations of Central Asia: Volume III, the Crossroads of Civilizations: A.D. 250–750, B. A. Litvinski, Zhang Guangda, and R. Shabani Samghabadi (eds.). Delhi: Motilal Banarsidass Publishers Private Limited, pp. 449–472. * Liu, Xinru, \"The Silk Road: Overland Trade and Cultural Interactions in Eurasia\", in Agricultural and Pastoral Societies in Ancient and Classical History, ed. Michael Adas, American Historical Association, Philadelphia: Temple University Press, 2001. * Magill, Frank N. et al. (eds.) (1998). The Ancient World: Dictionary of World Biography, Volume 1. Pasadena; Chicago; London: Fitzroy Dearborn Publishers, Salem Press, . * Michon, Daniel (2015). Archaeology and Religion in Early Northwest India: History, Theory, Practice, London, New York, New Delhi: Routledge, . * * Nourzhanov, Kirill, Christian Bleuer (2013), Tajikistan: a Political and Social History, Canberra: Australian National University Press, . * Prevas, John (2004), Envy of the Gods: Alexander the Great's Ill-Fated Journey across Asia, Da Capo Press. * Ramirez-Faria, Carlos, (2007), Concise Encyclopedia of World History, New Delhi: Atlantic Publishers & Distributors, . * Rong, Xinjiang, \"The Sogdian Caravan as Depicted in the Relieves of the Stone Sarcophagus from Shi's Tomb of the Northern Zhou\" in Chinese Archaeology. Volume 6, Issue 1, pp. 181–185, ISSN (Online) 2160–5068, ISSN (Print) 5004–4295, DOI: 10.1515/CHAR.2006.6.1.181, January 2006. * Rong, Xinjiang, \"New light on Sogdian Colonies along the Silk Road : Recent Archaeological Finds in Northern China (Lecture at the BBAW on 20 September 2001)\", in Berichte und Abhandlungen (17 December 2009); 10, S. 147–160, urn:nbn:de:kobv:b4-opus-11068. * Rose, J., \"The Sogdians: Prime Movers between Boundaries\", Comparative Studies of South Asia, Africa and the Middle East, vol. 30, no. 3, (2010), p. 412\\. * Smith, William eds et al. (1873), A Dictionary of Greek and Roman Biography and Mythology, Volume 1, London: John Murray. * Strachan, Edward and Roy Bolton (2008), Russia and Europe in the Nineteenth Century, London: Sphinx Fine Art, . * * Taenzer, Gertraud (2016), \"Changing Relations between Administration, Clergy and Lay People in Eastern Central Asia: a Case Study According to the Dunhuang Manuscripts Referring to the Transition from Tibetan to Local Rule in Dunhuang, 8th–11th Centuries\", in Carmen Meinert, Transfer of Buddhism Across Central Asian Networks (7th to 13th Centuries), Leiden, Boston: Brill, pp. 106–179, . * Tafazzoli, A. (2003), \"Iranian Languages,\" in C. E. Bosworth and M. S. Asimov, History of Civilizations of Central Asia, Volume IV: The Age of Achievement, A.D. 750 to the End of the Fifteenth Century, Delhi: Motilal Banarsidass Publishers Private Limited, pp. 323–30. * Watson, Burton (1993), Records of the Great Historian, Han Dynasty II, Columbia University Press, . * Wood, Francis (2002). The Silk Road: Two Thousand Years in the Heart of Asia. Berkeley, CA: University of California Press. . Category:5th century Category:Middle Ages Category:History of Asia Category:Persian culture Category:History of China Category:History of Tajikistan Category:History of Kazakhstan Category:Achaemenid satrapies Category:Former countries in Central Asia",
 "title": "Sogdiana"
}