{
 "id": "906311",
 "text": "Nefertari, also known as Nefertari Meritmut, was an Egyptian queen, She was the first of the Great Royal Wives (or principal wives) of Ramesses the Great.Dodson, Aidan and Hilton, Dyan. The Complete Royal Families of Ancient Egypt. Thames & Hudson. 2004. ==Family== Nefertari's family is unknown, but the name Pharaoh Ay was discovered in her tomb. It is believed that she was related to him and may be his granddaughter. However, there is no direct evidence linking Nefertari to the royal family of the Eighteenth Dynasty. Nefertari married Ramesses II before he became the king of Egypt, She had at least four sons and two daughters. Amun-Hor-Khebeshef, Parheroenemph who served in the army of Ramesses II, Prince Meryatum who was high priest of Ra and Prince Mery-Ra is her fourth son that is mentioned at Abu Simbel. Meritamen and Henuttaw were also queen Nefertari's daughters Kitchen, Kenneth A., Pharaoh Triumphant: The Life and Times of Ramesses II, The King of Egypt, Aris & Phillips. 1983 ==Life== Nefertari was the wife of Ramesses II, an ancient Egyptian pharaoh. They are often shown together in statues in Luxor and Karnak Temple. In Western Thebes, there are also mentions of Nefertari on a group of statues from Deir el-Bahari. The most important honor for Nefertari was in Abu Simbel. There, she is shown in statue at the great temple of Abu simbel, and the small temple is built to her and the goddess Hathor. The buulding of these temples began during the reign of Ramesses II, around year 25 of his reign, but they were not finished until ten years later.Kitchen, Kenneth A., Pharaoh Triumphant: The Life and Times of Ramesses II, The King of Egypt, Aris & Phillips. 1983 Nefertari was a very important person at the court. She was friends with the queen of Hitties, and they wrote letters to each other. These letters were found in a place called Hattusas, which is now called Boghazkoy in Turkey. The letters mention Nefertari as “Naptera.” She gave presents to the king’s wife, Puduhepa. She sent a a message to Puduhepa, the Great Queen of the Hitties land. She wishes her to be well and hopes that her country is also doing well. She has learned that Puduhepa is worried about her health and is happy for their good friendship and the strong relationship between the king of Egypt and Hitties. She believes that the Storm god will bring peace and ensure that the good relationship between the Egyptian king and the Hatti king lasts forever.Tyldesley, Joyce. Chronicle of the Queens of Egypt. Thames & Hudson. 2006 == Tomb of Nefertari == The most important and famous of Ramesses' Queen consorts was discovered in 1904.Siliotti, Alberto 1994. Egypt: temples, people, gods. The tomb of Nefertari is extremely important, because its magnificent wall painting is regarded as one of the greatest examples of ancient Egyptian art. A flight of steps cut out of the rock makes it possible to go to the antechamber. This is decorated with paintings based on chapter 17 of the Book of the Dead. The astronomical ceiling represents the heavens and is painted in dark blue, with many golden five-pointed stars. The east wall of the antechamber is interrupted by a large opening with paintings of Osiris and Anubis. This leads to the side chamber, decorated with offering scenes. A vestibule with paintings shows Nefertari being presented to the gods, who welcome her. On the north wall of the antechamber is the stairway that goes down to the burial chamber. This is a vast quadrangular room covering a surface area of about , the astronomical ceiling of which is supported by four pillars entirely covered with decoration. ==References== == Other websites == * The tomb of Nefertari Merytmut Category:Ancient Egyptian queens Category:2nd millennium BC in Egypt Category:Ancient Egyptians",
 "title": "Nefertari"
}