{
 "id": "906458",
 "text": "Jan Dismas Zelenka (16 October 1679 – 23 December 1745) was a Bohemian baroque composer. == Life == Zelenka was born in Louňovice pod Blaníkem, Bohemia. It is a small market town southeast of Prague. He was baptized as Jan Lukas Zelenka. His first music teacher was likely his father, Jiři. His father was an organist and organist in Louňovice. He received more musical training at the Jesuit college Clementinum in Prague. He learned to play the violone (a kind of contrabass in the Baroque period). ===Education=== In 1709, he studied with Johann Hubert Hartig in Prague. Zelenka had access to a lot of Italian baroque music through his teacher's library. ===Move to Dresden=== Zelenka moved to Dresden in 1710 or 1711. He became the violone player in the Dresden court orchestra. He received a salary of 300 thalers when he started working in Dresden. He must have been a very impressive musician. His salary was increased to 400 thalers in 1714. He wrote his Mass, the Missa Sanctae Caeciliae (St. Cecilia Mass) in 1711. ===Visit to Vienna=== In 1716, Zelenka visited Vienna to study with Johann Joseph Fux. Fux was the Imperial Kapellmeister in Vienna. That means Fux was in charget of the music for the Holy Roman Emperor. It is unclear if he also visited Venice during this time. ===Return to Dresden=== Zelenka returned to Dresden in 1719. He visited Prague from 1722 - 23. He wrote some of his instrumental works while in Prague. The Kapellmeister in Dresden at that time was Johann David Heinichen. Because Heinichen was often ill, Zelenka managed the sacred music in Dresden. When Heinichen died in 1729, Zelenka became an acting Kapellmeister. He finally became a Kapellmeister in 1734. In 1726, Zelenka started a list of works composed by the composers in Dresden. This list is called the Inventarium. It is an important document for Dresden baroque music. In the 1730s, a group of Italian-trained singers arrived at Dresden. They were prepared to resurrect opera in Dresden. Zelenka's job was to train these singers. He wrote some arias for the singers to practice. After August II, Zelenka's employer died, Zelenka asked the new King August III for the title of Kapellmeister. This title was granted to Zelenka on 1734. Johann Sebastian Bach also received the title of \"Royal Polish Composer\" in 1736. ===Death=== On 23 December 1745, Zelenka died of dropsy. Because he was a Catholic, he was allowed to be buried in the Catholic cemetery. According to the records in Dresden, Zelenka never married. He lived alone. His music became valuable after he died. Georg Philipp Telemann tried to publish Zelenka's works. He was not successful. The manuscripts of Zelenka's music remained locked in Dresden. There are no known paintings of Zelenka. == Music == Zelenka's musical style is very unique. He used unexpected harmonies and rhythms. His musical writing shows that he mastered counterpoint. Zelenka may have used elements from Bohemian folk music in his music. He was respected by Bach. Bach performed some of Zelenka's music in Leipzig, where Bach worked. == References == Category:1679 births Category:1745 deaths Category:Czech composers Category:Deaths from edema Category:Classical double bassists Category:Baroque composers",
 "title": "Jan Dismas Zelenka"
}