{
 "id": "906522",
 "text": "Peter Stöger ( born 11 April 1966) is an Austrian football coach and a former player. ==Club career== Stöger started his career at Favoritner AC Wien. Then he played six years for FK Austria Wien from 1988 to 1994. After a year at FC Tirol Innsbruck, he went to SK Rapid Wien in 1995. He also played in the 1996 UEFA Cup Winners Cup Final against Paris St Germain in Brussels. He then returned to Austria after a year at LASK Linz and finished his career at 38 years with SC Untersiebenbrunn.Peter Stöger und Ralph Hasenhüttl: Happels Erben Herbert Prohaska about Hasenhüttl and StögerTeam Austria Wien 1990, weltfussball.com, accessed 29 January 2019.Jubelt Ingolstadt auch in Köln?, 15 September 2015. ==International career== He made his debut for Austria in February 1988 against Switzerland, missed the 1990 FIFA World Cup, but was a member of Austrias team at the 1998 FIFA World Cup.Record at FIFA Tournaments - FIFA He played 65 matches and scored 15 goals.Appearances for Austrian National Team - RSSSF His last international was in March 1999 versus Switzerland. ==Managerial career== ===Austria=== Stöger became coach of coach of Austria Wien on 6 May 2005 together with Frank Schinkels till the end of the season. Stöger continued in the position until December 2005. In December he became sporting director. The following season did not start well and he was sacked in both positions. Stöger moved for 3 years to First Vienna FC, then Grazer AK and SC Wiener Neustadt. Then Stöger returned to Austria Wien on 30 May 2012, and won the Austrian championship with a record number of points.Austria Wien 2012/2013 unter Peter Stöger, spielverlagerung.de, 1 June 2013.Von der Vienna zur Borussia, orf.at, 11 December 2017.Red Bull Salzburg under Roger Schmidt 2014, ===1. FC Köln=== Stöger and his co-trainer Manfred Schmid were bought out of their contracts and went to 1. FC Köln. In January 2016, Stöger, along with his co-trainer Manfred Schmid extended the contracts to 2020, 1\\. FC Köln Setzt Stöger wieder einen drauf? , Express, 23 January 2016.Bis 2020 FC-Trainer Rekord-Vertrag! Stöger feiert mit „Verlängertem“ , Express, 21 January 2015. In the season 2016/17 Köln reached international football for the first time after 25 years. Cologne finished 5th and qualified for the Europa League.FC-Sportchef Schmadtke rechnet mit furiosem Finale um Europa, express.de, 8 May 2017.Hin- Rückrunde 2016/17, kicker.de, Hin- Rückrunde 2016/17, zugegriffen: 22 May 2017. In the 2017/18 seasonKöln reached only only three points from the opening 14 matches. Schmidt and Stöger were sacked on 3 December 2017. ===Borussia Dortmund=== On 10 December 2017 Stöger signed to coach Borussia Dortmund until end of the season. Stöger stabilized the team and BVB finished fourth after eight place when Stöger signed. They qualified for the UEFA Champions League on the final matchday. He left Dortmund on 12 May 2018. ===Return to Austria Wien=== On August, 1st 2019 he went back to Austria Wien and became sports director.On 31 July 2020 he returned as head coach of Austria Wien. ===Move to Ferencváros=== On 5 June 2021 Stöger went to the Hungarian team Ferencváros. The team reached the group stage of the UEFA Europa League. Ferencváros lost five of the six group stage games and finishing last in their group. After a away loss in the league to Debrecen, he was sacked on 13 December 2021. ==Career statistics== ===International=== Appearances and goals by national team and year National team Year Apps Goals Austria 1988 4 0 1989 3 0 1990 1 0 1991 8 0 1992 9 2 1993 7 0 1994 8 3 1995 4 4 1996 4 0 1997 8 4 1998 8 2 1999 1 0 Total 65 15 ===Managerial record=== Team From To Record G W D L Win % Austria Wien 6 May 2005 12 December 2005 First Vienna 14 October 2007 26 April 2010 Grazer AK 26 November 2010 25 May 2011 Wiener Neustadt 1 June 2011 30 May 2012 Austria Wien 30 May 2012 11 June 2013 1\\. FC Köln 11 June 2013 3 December 2017 Borussia Dortmund 10 December 2017 12 May 2018 Austria Wien 31 July 2020 5 June 2021 Ferencváros 5 June 2021 13 December 2021 Total — ==Honours== ===Player=== ;Austria Wien *Austrian Football Bundesliga: 1991, 1992, 1993 *Austrian Cup: 1990, 1992, 1993 *Austrian Supercup: 1990, 1991, 1992, 1993 ;Rapid Wien *Austrian Football Bundesliga: 1996 *UEFA Cup Winners' Cup: Runner–up 1996 *Austrian Supercup: 1996 ===Manager=== ;Austria Wien *Austrian Cup: 2005 *Austrian Football Bundesliga: 2013 ;1. FC Köln *2. Liga : 2014 ==References== ==Other websites== *Player profile - Austria Archive *Rapid stats - Rapid Archive * Category:1966 births Category:Living people Category:Austrian footballers Category:Grazer AK managers Category:SC Wiener Neustadt managers Category:Association football midfielders Category:Borussia Dortmund managers Category:Players of the Austrian national football team Category:FK Austria Wien managers Category:First Vienna FC managers Category:LASK players Category:Austrian football champions Category:Austrian football midfielders",
 "title": "Peter Stöger"
}