{
 "id": "906639",
 "text": "In math, a colossally abundant number (also written as CA) is a type of natural number that has to follow a special set of rules. CAs usually have a lot of divisors. To figure out whether or not a number is a CA, however, it has to follow an equation. For a number to be colossally abundant, ε has to be greater than 0. k a number greater than 1 and σ is the sum of every divisor that the number has.K. Briggs, \"Abundant Numbers and the Riemann Hypothesis\", Experimental Mathematics 15:2 (2006), pp. 251–256, . : \\frac{\\sigma(n)}{n^{1+\\varepsilon}}\\geq\\frac{\\sigma(k)}{k^{1+\\varepsilon}} All colossally abundant numbers are also superabundant numbers, but not all superabundant numbers are colossal. The first 15 colossally abundant numbers are 2, 6, 12, 60, 120, 360, 2520, 5040, 55440, 720720, 1441440, 4324320, 21621600, 367567200, 6983776800 . These are also the first 15 superior highly composite numbers. == History == Colossally abundant numbers were first learned about by Ramanujan. They were written about in his paper about highly composite numbersin 1915.S. Ramanujan, \"Highly Composite Numbers\", Proc. London Math. Soc. 14 (1915), pp. 347–407}.S. Ramanujan, Collected papers, Chelsea, 1962.S. Ramanujan, \"Highly composite numbers. Annotated and with a foreword by J.-L. Nicholas and G. Robin\", Ramanujan Journal 1 (1997), pp. 119–153. In 1944, Leonidas Alaoglu and Paul Erdős expanded on what Ramanujan's wrote about and learned more about it.. == Similarities with the Riemann hypothesis == In the 1980s, Guy Robin showedG. Robin, \"Grandes valeurs de la fonction somme des diviseurs et hypothèse de Riemann\", Journal de Mathématiques Pures et Appliquées 63 (1984), pp. 187–213. that the Riemann hypothesis is the same for whenever n is greater than 5040(γ is the Euler–Mascheroni constant). : \\sigma(n) This doesn't work for 27 different numbers : : 2, 3, 4, 5, 6, 8, 9, 10, 12, 16, 18, 20, 24, 30, 36, 48, 60, 72, 84, 120, 180, 240, 360, 720, 840, 2520, 5040 Robin showed that if the Riemann hypothesis is true then n = 5040 is the last integer that doesn't work in this equation. This inequality is also known as Robin's inequality. From 2001–2002 LagariasJ. C. Lagarias, An elementary problem equivalent to the Riemann hypothesis, American Mathematical Monthly 109 (2002), pp. 534–543. showed that Robin's inequality can be written another way. This inequality uses the harmonic numbers instead of logarithms and works for any CA that is bigger than 60. : \\sigma(n) < H_n + \\exp(H_n)\\log(H_n) The next inequality works for when n is equal to 1, 2, 3, 4, 6, 12, 24 or 60. : \\sigma(n) < \\exp(H_n)\\log(H_n) == References == == Other websites == * Keith Briggs on colossally abundant numbers and the Riemann hypothesis * MathWorld entry * Notes on the Riemann hypothesis and abundant numbers * More on Robin's formulation of the RH Category:Integer sequences",
 "title": "Colossally abundant number"
}