{
 "id": "906744",
 "text": "A water clock was a tool for measuring time by the flow of liquid into or out of a vessel. Water clocks are one of the oldest time-measuring tools. The bowl-shaped outflow is the simplest form of a water clock and is known to have existed in Babylon, Egypt, and Persia around the 16th century BC. Other regions of the world, including India and China, also have early evidence of water clocks. == Designs == A water clock uses the flow of water to measure time. There are two types of water clocks: inflow and outflow. In an outflow water clock, a container is filled with water, and the water is drained slowly out of the container. An inflow water clock works in basically the same way, except instead of flowing out of the container, the water is filling up the marked container. As the container fills, the observer can see where the water meets the lines and tell how much time has passed. ==Regional development== ===Persia=== The simplest and more useable clock was a Persian water clock used by manager of the qanat . The use of water clocks in Persia or Greater Iran ,especially in desert area of Iran such as Yazd, Isfahan, and Gonabad,dates back to 500 BC. Later they were also used to say the exact time of holy days of pre-Islamic religions, such as telling the time of the equal day and night ( Nowruz), Chelah, or Yaldā – the shortest, longest, and equal- length days and nights of the years. The water clocks used in Iran were one of the most practical ancient tools for timing the yearly calendar. The water clock, or Fenjaan, was the most accurate and commonly used timekeeping device for calculating the amount or the time that a farmer must take water from a qanat or well for irrigation, until it was replaced by more accurate current clocks. Persian water clocks were a practical and useful and necessary tool for the qanat's shareholders to calculate the length of time they could divert water to their farms or Gardens. The qanat (Kariz) was the only water source for agriculture and irrigation in arid areas so a just and fair water distribution was very important. A very fair and clever old person was elected to be the manager of the water clock called Mir Aab, and at least two full- time managers were needed to control and observe the number of Fenjans or Pengan hours and announce the exact time of the days and nights from sunrise to sunset because share holders usually were divided to the days owners and night owners. The Fenjaan consisted of a large pot full of water and a bowl with a small hole in the center. When the bowl became full of water, it would sink into the pot, and the manager would empty the bowl and again put it on the top of the water in the pot. He would record the number of times the bowl sank by putting small stones into a jar. The place where the clock was situated, and its managers, were collectively known as khaneh Fenjaan (time house). Usually this would be the top floor of a public-house, with west- and east-facing windows to show the time of Sunset and Sunrise. The Zibad Gonabad water clock was in use until 1965 when it was substituted by modern clocks. ===Egypt=== it is not clear how Egyptians used water clocks. ===Babylon=== In Babylon, water clocks were of the outflow type and were cylindrical in shape. In Babylonian times, time was measured with temporal hours. So, as seasons changed, so did the length of a day. \"To define the length of a 'night watch' at the summer solstice, one had to pour two mana of water into a cylindrical clepsydra; its emptying indicated the end of the watch. One-sixth of mana had to be added each succeeding half-month. At the equinox, three mana had to be emptied in order to correspond to one watch, and four mana was emptied for each watch of the winter solstitial night.\" ===India=== According to N. Kameswara Rao, pots excavated from the Indus valley civilization site of Mohenjo-daro (around 2500 BC) may have been used as water clocks. Descriptions of similar water clocks are given in the Pañca Siddhāntikā by the polymath Varāhamihira (6th century AD), which adds further detail to the account given in the Sürya Siddhānta.. Further descriptions are recorded in the Brāhmasphuṭa Siddhānta, by the mathematician Brahmagupta (7th century AD). A detailed description with measurements is also recorded by the astronomer Lalla (8th century AD), who describes the ghati as a hemispherical copper vessel with a hole that is fully filled after one nadika. ===China=== In ancient China, as well as throughout East Asia, water clocks were very important in the study of astronomy and astrology. The oldest written reference dates the use of the water clock in China to the 6th century BC. From about 200 BC onwards, the outflow clepsydra was replaced almost everywhere in China by the inflow type with an indicator-rod borne on a float. ===Greco-Roman world=== ====Clepsydrae for keeping time==== Some scholars suspect that the clepsydra may have been used as a stop-watch for imposing a time limit on clients' visits in Athenian brothels. Slightly later, in the early 3rd century BC, the Hellenistic physician Herophilos had a portable clepsydra on his house visits in Alexandria for measuring his patients' pulse-beats. By comparing the rate by age group with empirically obtained data sets, he was able to determine the intensity of the disorder. The biggest achievement of the invention of clepsydrae during this time, however, was by Ctesibius with his incorporation of gears and a dial indicator to show the time as the lengths of the days changed throughout the year. This is because of the temporal timekeeping used during his day. Also, a Greek astronomer, Andronicus of Cyrrhus, supervised the construction of his Horologion, known today as the Tower of the Winds, in the Athens marketplace (or agora) in the first half of the 1st century BC. This octagonal clocktower showed both sundials and mechanical hour indicators. It featured a 24-hour mechanized clepsydra and indicators for the eight winds from which the tower got its name, and it displayed the seasons of the year and astrological dates and periods. ===Medieval Islamic world=== In the medieval Islamic world (632-1280), the use of water clocks has its roots from Archimedes during the rise of Alexandria in Egypt and continues on through Byzantium. The water clocks by the Arabic engineer Al-Jazari, however, are credited for going \"well beyond anything\" that had preceded them. At daybreak, the tap was opened and water flowed from the top tank to the bottom tank via a float regulator that maintained a constant pressure in the receiving tank. ===Korea=== In 1434 during the Joseon Dynasty, Jang Yeong-sil, Palace Guard and later Chief Court Engineer, constructed the Jagyeongnu (self-striking water clock or striking clepsydra) for King Sejong. What made the Jagyeongnu self-striking (or automatic) was the use of jack-work mechanisms, by which three wooden figures (jacks) struck objects to signal the time. This innovation no longer required the reliance of human workers, known as \"rooster men\", to constantly replenish it. The uniqueness of the clock was its capability to announce dual-times automatically with both visual and audible signals. Jang developed a signal conversion technique that made it possible to measure analog time and announce digital time simultaneously as well as to separate the water mechanisms from the ball-operated striking mechanisms. ==Notes== === Sources used === * * * * ==Other websites== * Qanat or Kariz tools * The Clock of Flowing Time in Berlin * NIST: A Walk Through Time - Early Clocks * Bernard Gitton's Time-Flow Clocks * Qanat is cultural,social and scientific heritage in Iran * Egypt's Water Clock * A Brief History of Clocks: From Thales to Ptolemy * The Indianapolis Children's Museum Water Clock * Nanaimo, BC Water Clock Category:Clocks Category:Ancient Egypt",
 "title": "Water clock"
}