{
 "id": "906891",
 "text": "Ileana D'Cruz (born 1 November 1986) is an Indian film actress who mostly appears in Telugu language films . She started as a model and made her film debut in 2006 with YVS Chowdhury's Telugu film Devadasu . She then starred in the commercially successful films Pokkiri (2006), Jalsa (2008) and Kick established herself as one of the leading actresses of Telugu cinema. She had been working in Badshaho at 2017. ==Family== She has an older sister named Farah, a young brother named Reis, and a young sister named Erin.https://m.ragalahari.com/celebrity-interview/294/illeana-speaks-about- devdas Ragalahari. Her first name comes from Greek mythology meaning \"torch\" or \"bright.\" In childhood, she lived in Goa for many years.\"गोवन डायसपोरा मेक्स ए मार्क वर्ल्डवाइड, इंडो-एशियन न्यूज़ सर्विस, टाइम्स ऑफ इंडिया के माध्यम से, (2007/01/14). 18 नवम्बर 2006 को पुनःप्राप्त. == Career == === Early reputation === She was widely praised by critics, especially for her anatomy and facial features; Idealbrain's GV wrote that Ileana \"made her debut very well. She not only does well in acting but also her physique is admirable which every woman would like to achieve. She has long legs and is physically beautiful.\" Devdasu was the first major commercial hit of the year and eventually grossed ₹14 crore. Ileana was given the Filmfare Award for Best Female Debutant for the movie. ===Pokkiri=== Her next movie was the action movie Pokkiri starring Mahesh Babu. Ileana played an aerobics teacher who is harassed by a corrupt policeman. The movie was a huge success. It became the highest-grossing Telugu film of all time, as well as being Ileana's biggest commercial hit of all time. ===Tamil movie debut=== Later in the same year, she made her debut in a Tamil language movie with Kedi (2006).Although the movie did not do as well at the box office, D'Cruz was so busy that she had to decline several offers. She also did a debut with Ilayathalapathy Vijay in his Nanban(2012) directed by Shankar, ( a remake of 3 Idiots ( 2009 ) directed by Rajkumar Hirani )which was a hit ,which grossed 81 crorces but not more than its original version,3 Idiots (2009).Her Telugu movie Dangerous (2006) in which she starred opposite Ravi Teja was not as good as was expected. === Ata === D'Cruz's career again took a turn when she starred in the 2007 movie Ata, opposite Sidharth. रोनामै, रेमंड. \"इलियाना टर्न्स हॉट अगेन \", तेलुगु मूवी न्यूज़ (2007/06/01). 18 नवम्बर 2006 को पुनः प्राप्त. She was widely thanked for her performance as Satya, a college student who runs away from the home minister's devious son and comes under attack as she marches to demand punishment for her crime. Idlebrain describes them as \"beautiful\" and \"a comfort to the eyes\". ===Jalsa=== In 2008 she played the lead role in Jalsa opposite Pawan Kalyan. She is currently considered the most expensive actress in the South Indian movie industry, being paid 1.75 crore as of 2008. \"इलियाना - 1.75 करोड़\" , बिहाइंडवुड्स न्यूज़ ब्यूरो (2008/03/22) ===Career since 2009=== Her 2009 movie with Ravi Teja titled Kick was declared a box office hit. After that in 2009, she starred in Rechipo with Vishnu Manchu and YVS Chowdhary's Salim, both of which failed at the box office. Ileana recently wrapped up shooting for Shakti, where she worked with Jr. NTR before she worked with him in Rakhi. Puri Jagannadh has signed her for their upcoming film Nenu Na Rakshasi. This will be Ileana's second movie with Puri after the massive success of Pokkiri in 2006. She has also done an item song for the Kannada movie Huduga Hudugi with the lyrics \"Ileana Ileana\". Currently, Ileana will begin shooting for the Telugu and Tamil adaptation of the Hindi film 3 Idiots, where she will be essaying the role of Kareena Kapoor. S. Shankar will direct it. Her next offering will be Anurag Basu's Barfi in which Ileana will be working with Ranbir Kapoor. http://timesofindia.indiatimes.com/entertainment/bollywood/news- interviews/इलियाना-to-star-opposite-Ranbir-in-Barfee/articleshow/7087784.cms Times Of India. == List of movies == The year Movies Role Language Notes 2006 devdasu Bhanumati Katmaraju telugu Winner, Filmfare Best Female Debut (South) pokkiri Shruti telugu KD Arti Tamil Dangerous Nakshatra telugu Rakhi Tripura telugu 2007 Munna Nidhi telugu atta Satya telugu 2008 Jalsa Bhagyamati telugu Winner, Santhosham Best Actress Award Nominated, Telugu Filmfare Best Actress Award Bhale Dongalu Jyoti telugu 2009 kick Naina telugu Nominated, Telugu Filmfare Best Actress Award Rechipo Krishna Veni telugu Salim Satyavati telugu 2010 hooduga hoodoogi Self Kannada special appearance 2011 Nenu na rakshasi telugu Power telugu filming 2012 Nanban Tamil July telugu Devudu Chesina Manushulu telugu Barfi! Hindi 2013 Phata Poster Nikla Hero Hindi Main Tera Hero Hindi 2016 Rustom Hindi == Prizes == === Wins === * Filmfare Best Female Debut (South) - Devdasu (2006) * Santosham Best Actress Award - Jalsa (2008) === Nominations === ; Filmfare Awards South * 2008: Best Telugu Actress - Jalsa * 2009: Best Telugu Actress - Kick (2009) == References == == Other websites == * * Category:Actors from Mumbai Category:Living people Category:1987 births",
 "title": "Ileana D'Cruz"
}