{
 "id": "906996",
 "text": "Nidhhi Agerwal (born 17 August 1992/1993) is an Indian actress and dancer. She mainly works in Telugu and Tamil-language movies. In 2017, she made her acting debut in the Hindi movie Munna Michael. She was a Yamaha Fascino Miss Diva 2014 finalist. She made her Telugu movie debut with Savyasachi (2018). Her Tamil movie debut with Eeswaran (2021). == Early life == Nidhhi was born in Hyderabad and brought up in Bangalore. She was born into a Hindi-speaking Marwari family. Agerwal can understand as well as speak Telugu, Tamil and Kannada. Her birthdate is reported either as 17 August 1992 or 1993. ==Education== Her schooling was at Debipur Milan Vidyapith. She holds a graduation in Business Management from Christ University, Bangalore. She is well trained in ballet, kathak and belly dance. == Career == In 2016, director Sabbir Khan said that Nidhhi was signed as the lead in his movie Munna Michael, alongside Tiger Shroff. She was chosen from among 300 people. Nidhhi was also asked to sign a no-dating clause until the movie was completed. == Filmography == Key Denotes movies that have not yet been released === Movies === Year Title Role(s) Language(s) Notes 2017 Munna Michael Dolly / Deepika Sharma Hindi 2018 Savyasachi Chitra Telugu 2019 Mr. Majnu Nikitha (Nikky) Telugu iSmart Shankar Dr. Sarah Telugu 2021 Eeswaran Poongodi Tamil Bhoomi Shakthi Tamil 2022 Hero Subhadra \"Subbu\" Telugu Untitled Magizh Thirumeni project Tamil Filming Hari Hara Veera Mallu Panchami Telugu Filming == Awards and nominations == Year Award Category Language Movie Result 2017 Zee Cine Awards Zee Cine Award for Best Female Debut Hindi Munna Michael 2019 SIIMA Awards Best Female Debut (Telugu) Telugu Savyasachi * Honored with life membership of International Film And Television Club of Asian Academy of Film &amp; Television * Yamaha Fascino Miss Diva 2014 - finalist == References == == Other websites == * * Category:Living people category:1990s births Category:Indian movie actors category:Indian dancers Category:People from Hyderabad, India",
 "title": "Nidhhi Agerwal"
}