{
 "id": "90694",
 "text": "George Gordon Byron, 6th Baron Byron (22 January 1788 – 19 April 1824) was an English peer, nobleman, politician, and poet. He was christened George Gordon Byron, but changed his name later in life. He adopted the surname Noel, so that he could inherit half his mother-in-law's estate. Lord Byron was the son Captain John Byron and Catherine Gordon. He was a leading figure in Romanticism. He was regarded as one of the greatest European poets and many people still read his works. Among his best-known works are the narrative poems Childe Harold's Pilgrimage and Don Juan. Lord Byron is also famous for the way he lived his life. He was a dandy, living extravagantly, with many love affairs and debts. His fight against the Turks in the Greek War of Independence led to his death from a fever in Messolonghi in Greece. He is buried in the family vault in St. Mary Magdalene Church, Hucknall Torkard, Nottinghamshire, England. A memorial was not raised to him in Poet's Corner in Westminster Abbey until 1969.Poet's Graves: Lord Byron His daughter, Ada Lovelace, was famous because she collaborated with Charles Babbage on the \"analytical engine,\" a predecessor to modern computers. == Bibliography == === Major works === * Hours of Idleness (1806) * English Bards and Scotch Reviewers (1809) * Childe Harold's Pilgrimage (1812–1818) * The Giaour (1813) * The Bride of Abydos (1813) * The Corsair (1814) * Lara (1814) * Hebrew Melodies (1815) * The Siege of Corinth (poem) (1816) * Parisina (1816) * The Prisoner Of Chillon (1816) (text on Wikisource) * The Dream (1816) * Prometheus (1816) * Darkness (1816) * Manfred (1817) (text on Wikisource) * The Lament of Tasso (1817) * Beppo (1818) * Mazeppa (1819) * The Prophecy of Dante (1819) * Marino Faliero (1820) * Sardanapalus (1821) * The Two Foscari (1821) * Cain (1821) * The Vision of Judgement (1821) * Heaven and Earth (1821) * Werner (1822) * The Deformed Transformed (1822) * The Age of Bronze (1823) * The Island (1823) * Don Juan (1819–1824; incomplete on Byron's death in 1824) === Minor works === * So, we'll go no more a roving (text on Wikisource) * The First Kiss of Love (1806) (text on Wikisource) * Thoughts Suggested by a College Examination (1806) (text on Wikisource) * To a Beautiful Quaker (1807) (text on Wikisource) * The Cornelian (1807) (text on Wikisource) * Lines Addressed to a Young Lady (1807) (text on Wikisource) * Lachin y Garr (1807) (text on Wikisource) * Epitaph to a Dog (1808) (text on Wikisource) * She Walks in Beauty (1814) (text on Wikisource) * When We Two Parted (text on Wikisource) == Further reading == * MacCarthy, Fiona: Byron: Life and Legend. John Murray, 2002. . * McGann, Jerome: Byron and Romanticism. Cambridge: Cambridge University Press, 2002. . * Rosen, Fred: Bentham, Byron and Greece. Clarendon Press, Oxford, 1992. * Nicholson, Andrew, editor: The Letters of John Murray to Lord Byron. Liverpool University Press, 2007. . * Jean-Pierre Thiollet, Carré d'Art : Barbey d'Aurevilly, lord Byron, Salvador Dalí, Jean-Edern Hallier, Anagramme éditions, 2008. == References == == Other websites == * Pictures of Byron's Walk, Seaham, County Durham * Poems by Lord Byron at PoetryFoundation.org * Podcast—Listen Live or download Audio of Childe Harold's Pilgrimage by Lord Byron * A Website of the Romantic Movement * * The Byron Society * The Byron Society's Journal * The International Byron Society * Byron's Grave * Detailed site on Newstead Abbey, Byron's ancestral home, and on Byron's life in general * Hucknall Parish Church, Byron's final resting place * Statue of Byron at Trinity College, Cambridge * Complete list of Byron poetry * The Byron Cronology * Childe Harold's Pilgrimage * Discussion of Byron's homosexuality * Byron's Poetical Works, Vol. 1 * Byron's Poetical Works, Vol. 6 * The Works Of Lord Byron, Letters and Journals, Vol. 1 * The Works of Lord Byron: Letters and Journals, Vol. 2 * Byron's 1816-1824 letters to Murray and Moore about Armenian studies and translations * The biography Byron by John Nichol * Byron quotes * Lord George Gordon Byron—Biography & Works * Centre for Byron Studies, University of Nottingham * The first Full English translation of Fantasmagoriana (Tales of The Dead) * Byron page on The Literature Network * Films based on Byron's life and works * 2003 television dramatization of Byron's life by the BBC * Detailed account of Byron's love for animals * Inscription on the monument to Boatswain, Byron's dog * More on Byron's Newfoundland dogs * Byron manuscripts at the Harry Ransom Center, The University of Texas * George Gordon, Lord Byron at Find-A- Grave Category:1788 births Category:1824 deaths Category:Bisexual people Category:English Barons Category:English LGBT writers Category:English poets Category:Writers from London",
 "title": "Lord Byron"
}