{
 "id": "907016",
 "text": "Urvashi Rautela (born 25 February 1994) is an Indian actress and model. She appears in Bollywood movies. She was crowned Miss Diva Universe 2015 and represented India at the Miss Universe 2015 pageant. She made her Bollywood debut with Singh Saab the Great (2013). She also appeared in movies like Sanam Re (2016), Great Grand Masti (2016), Hate Story 4 (2018) and Pagalpanti (2019). == Early life and education == Rautela was born in Haridwar on 25 February 1994 to Meera Rautela and Manwar Singh Rautela in a Rajput family.https://m.rediff.com/getahead/report/glamour-achiever-meet-urvashi- rautela-miss-india-universe-2015/20151214.htm Rediff. Her hometown is Kotdwar. Rautela is an alumna of Gargi College, University of Delhi. == Early career == Rautela got her first major break at age 15 in Wills lifestyle India Fashion Week. She also won the title of Miss Teen India 2009. She was the show stopper as a teen model for Lakme Fashion Week and walked the ramp at Amazon Fashion Week, Bombay Fashion Week and Dubai Fashion Week. ===Awards in 2011=== In 2011, Rautela won Indian Princess 2011, Miss Tourism World 2011, and Miss Asian Supermodel 2011. She also won the title of Miss Tourism Queen of the Year 2011 that was held in China and became the first Indian woman to win the pageant.She was also offered Ishaqzaade but turned it down as she wanted to focus on the Miss Universe pageant. ===I AM She – Miss Universe India=== In 2012, she won the I AM She – Miss Universe India as well as the special award for Miss Photogenic. However, she had to return her crown as she was underage at that time. In 2015, Rautela joined again and won the title. She represented India in Miss Universe 2015, but did not place. == Movie debut == Rautela made her debut at Bollywood with the movie Singh Saab The Great. Her role was the female lead opposite Sunny Deol. After that, she appeared in Yo Yo Honey Singh's international music video album Love Dose. The music video was released in October 2014.https://www.gr8mag.com/posts.php?id=2595 GR8! Magazine.https://m.timesofindia.com/entertainment/telugu/movies/news/I-am-a- big-fan-of-Yo-Yo-Honey-Singh-Urvashi-Rautela/articleshow/45427575.cms Times Of India. ==Later movie career== Soon after, she started working in the South Indian movie industry. Her first movie was the Kannada movie Mr. Airavata.https://m.timesofindia.com/entertainment/kannada/movies/news/Urvashi- Rautela-replaces-Erica-Fernandes-in-Darshan-film/articleshow/41942547.cms Times Of India. The movie got negative reviews from the critics. But her dance sequence was praised. Sunayana Suresh writing for the Times of India noted, \"Urvashi is expressive and leaves her mark in the few scenes and songs she appears in, especially with her dancing.\"https://m.timesofindia.com/entertainment/kannada/movie-reviews/mr- airavatha/movie-review/49213640.cms Times Of India. Later, she appeared in two other Hindi movies, Sanam Re and Great Grand Masti. She also took part in two music videos in 2016. The first was Laal Dupatta with Mika Singh and Anupama Raag and the other was Gal Bann Gayi along with Vidyut Jammwal.https://www.news18.com/news/movies/yo-yo-honey-singhs-peppy-number- gal-ban-gayi-is-what-you-need-on-your-playlist-now-1290356.html News18. In 2017, Rautela starred in a special dance sequence Haseeno Ka Deewana in the movie Kaabil. She was complimented on her performance by Amitabh Bachchan.https://www.mid-day.com/entertainment/bollywood-news/article/amitabh- bachchan-compliments-urvashi-rautela-haseeno-ka-deewana-kaabil-17848177 Mid- Day. She also made a special appearance in a Bangladeshi film Porobashinee. ===Hate Story 4=== In 2018, she appeared in the revenge drama Hate Story 4. Rachit Gupta of the Times of India stated about her performance, \"Urvashi Rautela has the main role and her character has plenty to offer. She starts off as a girl dancing in a strip club, but as the story unfolds, her character gets plenty of twists, turns and reveals. There’s a lot on her table and the pretty actress handles the myriad emotions and shades with ease.\"https://m.timesofindia.com/entertainment/hindi/movie-reviews/hate- story-4/movie-review/63233743.cms Times Of India. ===Pagalpanti=== In February 2019, Rautela appeared for Anees Bazmee's comedy movie Pagalpanti which was a box-office flop and got unfavourable reviews. ===Virgin Bhanupriya=== In 2020, she starred in Virgin Bhanupriya a comedy-drama directed by Ajay Lohan and produced by Shreyans Mahendra Dhariwal. The movie was released through ZEE5 due to the COVID-19 pandemic.https://www.hindustantimes.com/brand-post/will- virgin-bhanupriya-break-her-virginity-vow-watch-zee5-s-latest-flick-to-find- out/story-nmlf554KtGuR0R1NQlCOpI.html Hindustan Times. == Filmography == === Movies === Key Denotes films that have not yet been released Year Title Role Language Notes Ref. 2013 Singh Saab the Great Minnie Hindi Hindi debut 2015 Mr. Airavata Priya Kannada Kannada debut Bhaag Johnny Hindi Special appearance in the song \"Daddy Mummy\". 2016 Sanam Re Akanksha / Mrs. Pablo Hindi Great Grand Masti Ragini Hindi 2017 Kaabil Hindi Special appearance in the song \"Haseeno Ka Deewana\" Porobashinee Bengali Special appearance in the song \"Challobay\" 2018 Hate Story 4 Tasha Hindi 2019 Pagalpanti Kavya Hindi 2020 Virgin Bhanupriya Bhanupriya Awasthi Hindi Black Rose Hindi Telugu Telugu Debut Untitled film Hindi Tamil Tamil Debut === Music videos === Year Title Singer(s) Ref. 2014 LoveDose Yo Yo Honey Singh 2016 Laal Dupatta Mika Singh and Anupama Raag Gal Ban Gayi Yo Yo Honey Singh, Meet Bros and Neha Kakkar. 2019 Bijli Ki Taar Tony Kakkar 2020 Ek Diamond Da Haar Meet Bros Woh Chaand Kaha Se Laogi Vishal Mishra 2021 Teri Load Ve Singaa Ek Ladki Bheegi Bhaagi Si Ajay Keswani Doob Gaye Guru Randhawa Versace Baby Mohamed Ramadan === Web series === Year Title Role Ref. 2016 Sex Chat with Pappu & Papa Cameo in Episode 3 2018-2019 The Dance Project Dancer in Episode 2 and 7 2021 Inspector Avinash Poonam Mishra == Awards and nominations == Year Award Film Category Result Ref. 2013 Screen Awards Singh Saab The Great Best Female Debut 2016 5th South Indian International Movie Awards Mr. Airavata Best Debut Actress (Kannada) == References == == Other websites == * * == Social Media Profiles == * * Category:1994 births Category:Indian beauty pageant winners Category:Living people Category:Pages with unreviewed translations",
 "title": "Urvashi Rautela"
}