{
 "id": "907127",
 "text": "Engine Sentai Go-onger is a Japanese television series. It is the 32nd series in Toei's Super Sentai series It is third vehicle-themed Super Sentai, preceded by Kousoku Sentai Turboranger and Gekisou Sentai Carranger. It aired as part of TV Asahi's 2008 Super Hero Time block alongside Kamen Rider Kiva. Its footage was used in Power Rangers RPM. ==Plot== Machine World is one of the 11 Braneworlds order than our own, which is referred as the Human World and it is home to giant vehicular beings called called Engines who wage a war against the Gaiark who desire to Pollution their world. Losing, Gaiark's three Pollution Ministers' escape ==Characters== ===Go-onger=== Actor Name Rangers Zord Yasuhisa Furuhara Sousuke Esumi Go-on Red Speedor Shinwa Kataoka Renn Kousaka Go-on Blue Bus-on Rina Aizawa Saki Rouyama Go-on Yellow BearrV Masahiro Usui Hant Jou Go-on Green Birca Kenji Ebisawa Gunpei Ishihara Go-on Black Gunpherd ===Go-on Wings=== Actor Name Rangers Zord Hidenori Tokuyama Hiroto Sutou Go-on Gold Toripter Yumi Sugimoto Miu Sutou Go-on Silver Jetras ==Cast== * Sousuke Esumi / Go-on Red: Yasuhisa Furuhara * Renn Kousaka / Go-on Blue: Shinwa Kataoka * Saki Rouyama / Go-on Yellow: Rina Aizawa * Hant Jou / Go-on Green: Masahiro Usui * Gunpei Ishihara / Go-on Black: Kenji Ebisawa * Hiroto Sutou / Go-on Gold: Hidenori Tokuyama * Miu Sutou / Go-on Silver: Yumi Sugimoto * Water Pollution Minister Kegalesia / Nao Shimizu: Nao Oikawa ===Voice actor=== *Bomper: Akiko Nakagawa ===Guests=== *Seiji Ogawa (6): Keisuke Minami *Gang Father (13): Shun Sugata *Retsu-Taka (40): Kento Handa ==Songs== ;Opening theme * \"Engine Sentai Go-onger\" ** Lyrics: Mike Sugiyama ** Composition: Takafumi Iwasaki ** Arrangement: Project. R (Kenichiro Ōishi & Takafumi Iwasaki) ** Artist: Hideyuki Takahashi (Project. R) ;Ending themes * \"Engine First Lap -Type Normal-\" (1-21, 26 & 47-49) ** Lyrics: Mike Sugiyama & Saburo Yatsude ** Composition & Arrangement: Kenichiro Ōishi (Project. R) ** Artist: Project.R (Takayoshi Tanimoto, Sister MAYO, Kenichiro Ōishi) with Engine Kids :Starting with episode 9 to 13, and 15 to 17, the second verse from \"Engine First Lap -Type Normal-\" was used as the ending theme, switching from the verse about Speedor to the Bus-on. BearRV's verse was used as the ending theme in episode 18. * \"Engine Second Lap -TURBO CUSTOM-\" (22, 27-30, 32-35 & 46) ** Lyrics: Mike Sugiyama & Saburo Yatsude ** Composition & Arrangement: Kenichiro Ōishi ** Artist: Project. R (Hidekai Takatori, Mayumi Gojo, Takayoshi Tanimoto, Sister MAYO, Kenichiro Ōishi) with Engine Kids :Starting with episode 22, the third verse from \"Engine Second Lap -TURBO CUSTOM-\", Carrigator's verse, was used as the ending theme as aa way to promote the movie. It was played again, from episodes 27 to 30, with Birca's verse. It then was resumed, in episode 32, with Gunpherd's verse. * \"Engine Eco Lap -Recycle Custom-\" (23 & 24, It's a Seminar! Everyone GO-ON) ** Lyrics: Mike Sugiyama ** Composition & Arrangement: Kenichiro Ōishi ** Artist: Engine Kids with Project. R (Takayoshi Tanimoto, Sister MAYO, Kenichiro Ōishi) :This version of the ending theme, first used at the end of episode 23 and later used as the ending theme to the It's Seminar! Everyone GO-ON DVD features the Engine Kids singing and members of Project. R singing back up. As the title suggests, the song discusses ecology and recycling. * \"Engine Formation Lap -Gekijōbang! Custom-\" (25 & Movie) ** Lyrics: Mike Sugiyama ** Composition & Arrangement: Kenichiro Ōishi ** Artist: Project. R (Takayoshi Tanimoto, Hideaki Takatori, Sister MAYO, Hideyuki Takahashi, Takafumi Iwasaki, YOFFY, Mayumi Gojo, Kenichiro Ōishi) with Engine Kids :This version of the ending theme, first used at the end of episode 25, is also the ending theme for the movie. * \"G3 Princess Lap ~PRETTY LOVE Limited~\" (31) ** Lyrics: Mike Sugiyama ** Composition & Arrangement: Kenichiro Ōishi ** Artist: \"G3 Princess\" (Saki Rōyama Rina Aizawa, Miu Sutō Yumi Sugimoto, Kegalesia Nao Oikawa) * \"Engine Third Lap -AERO-Dynamic CUSTOM-\" (36-41) ** Lyrics: Mike Sugiyama & Saburo Yatsude ** Composition & Arrangement: Kenichiro Ōishi (Project.R) ** Artist: Project.R (YOFFY, Takafumi Iwasaki, Hideaki Taketori, Mayumi Gojo, Takayoshi Tanimoto, Sister MAYO, Kenichiro Ōishi) with the Engine Kids * \"Engine Final Lap -Type Evolution-\" (42-44) ** Lyrics: Mike Sugiyama & Saburo Yatsude ** Composition & Arrangement: Kenichiro Ōishi (Project.R) ** Artist: Project.R (Hideyuki Takahashi, Takayoshi Tanimoto, Sister MAYO, Kenichiro Ōishi) with the Engine Kids * \"G5 Prince Lap ~Bombaye Limited~\" (45) ** Lyrics: Mike Sugiyama & Saburo Yatsude ** Composition & Arrangement: Kenichiro Ōishi (Project.R) ** Artist: \"G5 Prince\" (Sōsuke Esumi Yasuhisa Furuhara, Renn Kōsaka Shinwa Kataoka, Hant Jō Masahiro Usui, Gunpei Ishihara Kenji Ebisawa, Hiroto Sutō Hidenori Tokuyama) with Bomper (Akiko Nakagawa) * \"Engine Winning Lap -Type Formula-\" (50) ** Lyrics: Mike Sugiyama & Saburo Yatsude ** Composition & Arrangement: Kenichiro Ōishi (Project.R) ** Artist: Project.R (Hideyuki Takahashi, Takayoshi Tanimoto, Sister MAYO, Hideaki Takatori, Mayumi Gojo, Takafumi Iwasaki, IMAJO, Kenichiro Ōishi) with the Engine Kids Category:Super Sentai series Category:2008 television series debuts Category:2009 television series endings Category:2009 disestablishments in Japan",
 "title": "Engine Sentai Go-onger"
}