{
 "id": "907313",
 "text": "Kousoku Sentai Turboranger is a Japanese television series. It is the 13th series in Toei's Super Sentai series. Turboranger was also first Super Sentai series to air on Friday instead of Saturday. During its initial run, Turboranger was the 11th series and was billed as the 10th anniversary title of the Super Sentai series . Battle Fever J was originally the first Super Sentai series. However, in 1995, Himitsu Sentai Gorenger and J.A.K.Q. Dengekitai officially became the first two Super Sentai series. This made Turboranger the 13th in the franchise. ==Plot== 20,000 years ago, the Fairy race assisted humans in a battle against the Bouma Tribe. Due to modern day pollution and man's destruction of nature, the power of Fairy magic has awakened, allowing the seal to be broken and thus the Tribe's escape. With the help Dr. Dazai, Seelon, the last of fairies, summons five high school seniors. As children, they were showered with the \"flames of spirit\" of the fallen fairies in a forest and can now hear Seelon's voice. Donning powered suits, the product of a collaboration between Seelon's magic and Dr. Dazai's science, the five become the Turborangers, juggling days of fighting with their regular school lives, in order to defeat the Bouma Tribe. ==Characters== ===Turboranger=== Actor Name Rangers Mecha Kenta Satou Riki Honoo Red Turbo Turbo GT Yoshiaki Ganaha Daichi Yamagata Black Turbo Turbo Truck Keiya Asakura Yohei Hama Blue Turbo Turbo Jeep Junichiro Katagiri Shunsuke Hino Yellow Turbo Turbo Buggy Yoshiko Iwaya Haruna Morikawa Pink Turbo Turbo Wagon ==Cast== * Riki Honoo / Red Turbo: Kenta Satou * Daichi Yamagata / Black Turbo: Yoshiaki Ganaha * Yohei Hama / Blue Turbo: Keiya Asakura * Shunsuke Hino / Yellow Turbo: Junichiro Katagiri * Haruna Morikawa / Pink Turbo: Yoshiko Iwaya * Dr. Dazai: Fujita Okamoto * Seelon: Mayumi Omura * Misa Yamaguchi: Kyoko Takami ===Guest stars=== * Mika: Keiko Hayase (episode 37) * Yukari: Miho Tojo (episode 35) * Rin: Hiromi Yuhara (episode 27) * Yumi Sakakibara: Sayuri Uchida (episode 09) ==Songs== ;Opening theme * \"Kousoku Sentai Turboranger\" **Lyrics: Ikki Matsumoto **Composition: Yoshimasa Inoue **Arrangement: Ryō Yonemitsu **Artist: Kenta Satou ;Ending theme * \"Zigzag Youth Road\" **Lyrics: Ikki Matsumoto **Composition: Yoshimasa Inoue **Arrangement: Ryō Yonemitsu **Artist: Kenta Satou ;Final Theme * \"Dance, Beating Heart\" **Lyrics: Ikki Matsumoto **Composition: Yoshimasa Inoue **Arrangement: Ryō Yonemitsu **Artist: Kenta Satou Category:Super Sentai series Category:1989 television series debuts Category:1990 television series endings",
 "title": "Kousoku Sentai Turboranger"
}