{
 "id": "907494",
 "text": "Vishal Mishra is an Indian music composer and singer. He first appeared in a television reality singing show aired on DD National. He was then guided through his initial days in the industry by Lalit Pandit of Jatin–Lalit fame. ==Career== Mishra made his debut as a composer in 2016 with the Tamil film Devi, simultaneously dubbed as Abhinetri in Telugu and in Hindi as Tutak Tutak Tutiya. He found fame in 2017 with the song \"Jaane De\", sung by , featured on the soundtrack of Qarib Qarib Singlle, and also composed songs for Munna Michael, which marked his singing debut, and the Marathi film FU: Friendship Unlimited. Under the tutelage of actor-producer Salman Khan, he composed the \"Rafta Rafta\" medley for Yamla Pagla Deewana Phir Se, marking his first project of 2018, whose music video features Khan in a special appearance; he subsequently composed the romantic song \"Selfish\", written by and starring Khan for the action drama Race 3, while also composing the title track of Veere Di Wedding, starring Sonam Kapoor, Kareena Kapoor Khan, Swara Bhaskar and Shikha Talsania. Mishra's next project, and his first as a solo composer for songs and score, came with the Salman Khan-produced romantic drama Notebook. He rose to popularity with the song \"Kaise Hua\" from Kabir Singh, which became a rage among the audiences. His final album of the year was as a soundtrack composer for the Anurag Kashyap-produced Saand Ki Aankh, a biopic on the lives of the Shooter Dadis. 2020 saw Mishra release Manjha, a song featuring Aayush Sharma and Saiee Manjrekar. Akshay Kumar and Jackky Bhagnani roped him in to compose the song \"Phir Muskurayega India\", featuring many Bollywood actors including Kumar and Bhagnani, which became popular during the 2020 coronavirus pandemic lockdown in the country as a means of motivating the general public to maintain safety. == References == Category:Indian singer- songwriters Category:Living people Category:People from Uttar Pradesh Category:1991 births",
 "title": "Vishal Mishra (composer)"
}