{
 "id": "907506",
 "text": "Samuel Cooper (June 12, 1798 – December 3, 1876) was a United States Army officer. He served in the Second Seminole War and the Mexican–American War. Cooper was technically the highest-ranking general in the Confederate States Army throughout the American Civil War. He even outranked Robert E. Lee. After the conflict, Cooper remained in Virginia as a farmer. ==Birth== Samuel Cooper was born in New Hackensack, Dutchess County, New York.Davis, William C. \"General Samuel Cooper.\" In Leaders of the Lost Cause: New Perspectives on the Confederate High Command, edited by Gary W. Gallagher and Joseph T. Glatthaar, 101–131. Mechanicsburg, PA: Stackpole Books, 2004, 102Lee, Fitzhugh. \"Sketch of the Late General S. Cooper.\" Southern Historical Society Papers 3, no. 5–6 (June 1877): 271Mary Boykin Chesnut, A Diary from Dixie As Written by Mary Boykin Chesnut (New York: D. Appleton and Company, 1905), 150. Cooper's place of birth is often incorrectly given as Hackensack, New Jersey, by Dupuy (p. 189), Eicher (p. 184), Wakelyn (p. 150), and Wright (p. 9); place of birth given as Dutchess County, New York, by Warner (p. 62), or just New York by Snow (p. 305); place of birth given as New Hackensack, New York, by both websites \"leeslieutenants.com\" and \"generalcooper.com\". He was a son of Samuel Cooper and his wife Mary Horton.Wakelyn, p. 150. ==Entry to the military== In 1813 he entered the United States Military Academy at age 15 and graduated two years later. He was appointed a brevet lieutenant in the U.S. Light Artillery on December 11, 1815. He was promoted to first lieutenant in 1821 and to captain in 1836.Eicher, p. 185. ==Early military services== In 1827, Cooper married Sarah Maria Mason who was the sister of James M. Mason. Cooper served as aide-de-camp for Gen. Macomb from 1828 to 1836. Under his supervision authored A Concise System of Instructions and Regulations for the Militia and Volunteers of the United States. Cooper served in many artillery units until 1837. That is when he was appointed chief clerk of the U.S. War Department. In 1838 he received a promotion to Brevet major and was appointed assistant adjutant general of the Army. Nine years later, with a brevet as lieutenant colonel, he served in the same capacity. ==Second Seminole War== Cooper's service in the Second Seminole War of 1841–42 was a rare departure for him from Washington, D.C. He was chief of staff for Col. William J. Worth, and after bad relations ended he returned to staff duty in Washington from 1842 to 1845.Dupuy, pp. 189–90. Cooper received a brevet promotion to colonel on May 30, 1848, for his War Department service in the Mexican–American War, and was promoted to the permanent rank of colonel in the regular army and appointed the army's Adjutant General on July 15, 1852. ==Slave ownership== Cooper was also a slave owner. At the time of the 1850 census, he owned six slaves. ==Family== On February 5, 1857, his daughter Sarah Maria Mason Cooper (August 4, 1836 – December 15, 1858) married Frank Wheaton, who would become a Union general during the coming war. They had one child, Sarah Maria Cooper Wheaton, in 1858.Descendents of George Mason 1629-1686 - Person Page 6 . Gunston Hall Plantation Website. Retrieved January 6, 2009. ==American Civil War== At the beginning of the American Civil War, he was loyal to the South. His wife's family was from Virginia. He also had a close friendship with Jefferson Davis, who had also been U.S. Secretary of War.Warner, pp. 62-3. One of his last official acts as Adjutant General of the U.S. Army was to sign an order dismissing Brig. Gen. David E. Twiggs from the army. Twiggs had surrendered his command and supplies in Texas to the Confederacy on March 1, 1861 and Cooper resigned six days later. He traveled to Montgomery, Alabama to join the Confederate States Army. ===Reach to Montgomery=== When he reached Montgomery, Cooper was immediately given a commission as a brigadier general on March 16, 1861. He served as both Adjutant General and Inspector General of the Confederate Army, a post he held until the end of the war. Cooper provided organization and knowledge to the fledgling Confederate War Department from on his years performing such duties as Adjutant General of the U.S. Army.Warner, p. 63. ===Promotion=== On May 16, 1861, Cooper was promoted to full general in the Confederate Army. He was one of five men promoted to the grade at that time, and one of only seven during the war. It was the earliest date of rank. ===End of war=== At the war's end in 1865, Cooper surrendered and was paroled on May 3 at Charlotte, North Carolina. ===Dishonor=== While building defenses near Washington, D.C., Union forces demolished his home and used its bricks to build a fort dubbed \"Traitor's Hill\" in dishonor of Cooper. ==Later years== Cooper's last official act in office was to preserve the official records of the Confederate Army and turn them over intact to the United States government. They form a part of the Official Records, The War of the Rebellion: a Compilation of the Official Records of the Union and Confederate Armies. The publishing started in 1880. Military historians have highly regarded Cooper for this action.Lee's Lieutenants site biography of Cooper: \"This contribution is said to be Samuel's most lasting contribution to the Confederacy, in overseeing the removal of War Department records from Richmond in April 1865, and protecting them until they could be turned over to Federal authorities...\" Historian Ezra J. Warner believed that in doing so Cooper was \"thereby making a priceless contribution to the history of the period.\" ===After war=== After the war, Cooper was a farmer at his home, Cameron, near Alexandria, Virginia. His house had been taken over by the U.S. government during the war and turned into a fort. But he was able to move into what had been an overseer's house. Due to his age Cooper earned a meager living. On August 4, 1870, Robert E. Lee, on the behalf of other former Confederates, sent Cooper $300. Lee wrote to him saying, \"To this sum I have only been able to add $100, but I hope it may enable you to supply some immediate want and prevent you from taxing your strength too much.\" Samuel Cooper died at his home in 1876, and was buried in the Christ Church Episcopal Cemetery. ==Selected works== * Prepared and Arranged by Brevet Captain S. Cooper, Aide de Camp and Assistant Adjutant General. Under the Supervision of Major General Alexander Macomb, Commanding the Army of the United States. ==Related pages== * List of American Civil War generals (Confederate) ==Notes== ==References== * Davis, William C. \"General Samuel Cooper.\" In Leaders of the Lost Cause: New Perspectives on the Confederate High Command, edited by Gary W. Gallagher and Joseph T. Glatthaar, 101–131. Mechanicsburg, PA: Stackpole Books, 2004. * Dupuy, Trevor N., Curt Johnson, and David L. Bongard. The Harper Encyclopedia of Military Biography. New York: HarperCollins, 1992. . * Eicher, John H., and David J. Eicher. Civil War High Commands. Stanford, CA: Stanford University Press, 2001. . * Lee, Fitzhugh. \"Sketch of the Late General S. Cooper.\" Southern Historical Society Papers 3, no. 5-6 (June 1877): 269–76. * Sifakis, Stewart. Who Was Who in the Civil War. New York: Facts On File, 1988. . * Snow, William P. Lee and His Generals. New York: Gramercy Books, 1996. . First published 1867 by Richardson and Co. * Wakelyn, Jon L. Biographical Dictionary of the Confederacy. Westport, CT: Greenwood Press, 1977. . * Warner, Ezra J. Generals in Gray: Lives of the Confederate Commanders. Baton Rouge: Louisiana State University Press, 1959. . * Wright, Marcus J., General Officers of the Confederate Army: Officers of the Executive Departments of the Confederate States, Members of the Confederate Congress by States. Mattituck, NY: J. M. Carroll & Co., 1983. . First published 1911 by Neale Publishing Co. ==Other websites== * Biography at generalcooper.com * www.leeslieutenants.com Lee's Lieutenants site biography of Cooper. * * civilwarlandscapes.org Civil War Landscapes site military biography of Cooper. Category:1798 births Category:1876 deaths Category:American generals Category:Military people from Virginia",
 "title": "Samuel Cooper (general)"
}