{
 "id": "907528",
 "text": "The Obie Awards or Off-Broadway Theater Awards are annual awards originally given by Village Voice newspaper to theatre artists and groups in New York City ==Ceremony history== Obie Award ceremonies have been held at Webster Hall in Manhattan's East Village since the 2010-2011 season. Year Host Venue Presenters 1956 Shelley Winters unknown venue 1957 Geraldine Page The Limelight 1958 Maureen Stapleton The Limelight 1959 Kim Stanley Village Gate 1960 Anne Bancroft Village Gate 1961 Julie Harris Village Gate 1962 Lotte Lenya Village Gate 1963 Uta Hagen Village Gate 1964 Colleen Dewhurst Village Gate 1965 Gloria Foster Village Gate 1966 Anne Jackson Village Gate 1967 Barbara Harris Village Gate 1968 Estelle Parsons Village Gate 1969 Julie Bovasso Village Gate 1970 Dustin Hoffman Village Gate 1971 Elaine May Village Gate 1972 Groucho Marx Village Gate 1973 Sylvia Miles unknown venue 1974 Madeleine Le Roux unknown venue 1975 Godfrey Cambridge Village Gate 1976 no formal host Lincoln Center 1977 Paul Sorvino, Gilda Radner, Marilyn Sokol The Bottom Line 1978 Dustin Hoffman The Bottom Line 1979 Ron Leibman The Bottom Line 1980 no formal host Roxy NYC 1981 Kevin Kline, Sigourney Weaver Roxy NYC 1982 Swoosie Kurtz, Tommy Tune Savoy 1983 Harvey Fierstein, Julie Bovasso First City Cabaret 1984 no formal host Cat Club 1985 Ellen Stewart, Harvey Fierstein Puck Building 1986 Christopher Durang, Swoozie Kurtz unknown venue 1987 Morgan Freeman, Christine Lahti unknown venue 1988 Morgan Freeman, Lee Breuer unknown venue 1989 no formal host unknown venue 1990 Julie Bovasso, Olympia Dukakis unknown venue 1991 Stockard Channing, Alan Arkin Palladium Ballroom 1992 Jerry Zaks, Kate Nelligan Palladium Ballroom 1993 no formal host unknown venue 1994 Mary McDonnell, James McDaniel unknown venue 1995 Hector Elizondo, Anne Meara unknown venue 1996 Nicky Silver unknown venue 1997 no formal host unknown venue Fyvush Finkel, Kathleen Chalfant, Lisa Gay Hamilton, Peter Francis James, Shirley Knight, Camryn Manheim, Mary Louise Parker, Roger Guenveur Smith, Julie Taymor, Marisa Tomei, Rip Torn, Ming Cho Lee, Karin Coonrod, and Scott Elliot 1998 Eric Bogosian, Kristen Johnson Webster Hall Danny Hoch, Woodie King Jr., Mac Wellman, Mary Louise Wilson, Lea DeLaria, Ellie Covan, Tsai Chin, Greg Germann, and Liz Diamond 1999 Lea DeLaria, Paul Rudnick Webster Hall Betty Buckley, Kathleen Chalfant, Stephen DeRosa, David Henry Hwang, Swoosie Kurtz, Elizabeth Marvel, John Cameron Mitchell, Everett Quinton, Phylicia Rashad, and Roger Rees 2000 Claudia Shear, Mary Testa Webster Hall Ping Chong, Felicity Huffman, William H. Macy, Cynthia Nixon, Frances Sternhagen, Mary Testa, Carmelita Tropicana, James Urbaniak 2001 Brian Murray, Marian Seldes Webster Hall Darius De Haas, David Gallo, Linda Lavin, Marion McClinton, Debra Monk, Mark Russell, J. Smith-Cameron, and Daphne Rubin-Vega 2002 Karen Evans Kandel, Ruben Santiago-Hudson Webster Hall Elizabeth Franz, Mary Louise Parker, Ellen McLaughlin, Rinde Eckert, Richard Maxwell, Suzan-Lori Parks, and George C. Wolfe 2003 Bill Irwin, Charlayne Woodard Webster Hall Edward Albee, Linda Emond, Juliana Francis, Martha Plimpton, Jackie Hoffman, Eddie Izzard, John Ortiz, and Liev Schreiber 2004 Swoosie Kurtz, Raul Esparza Webster Hall Viola Davis, Idina Menzel, Taye Diggs, and Denis O'Hare 2005 Stockard Channing, Brian F. O'Byrne Webster Hall Elaine Stritch and Frances Sternhagen 2006 Lili Taylor, Eric Bogosian Skirball Center for the Performing Arts Christine Lahti, Christine Ebersole, Edward Hibbert, Douglas Carter Beane, Phylicia Rashad, and Oskar Eustis 2007 Cynthia Nixon, T.R. Knight Skirball Center for the Performing Arts Michael Cerveris, Angela Lansbury, William Ivey Long, Camryn Manheim, Stephanie March, Terrence McNally, Liev Schreiber, and Anika Noni Rose 2008 Elizabeth Marvel, Bill Camp Webster Hall Jonathan Groff, Priscilla Lopez, S. Epatha Merkerson, Marisa Tomei, Julie White and Bradley Whitford 2009 Daniel Breaker, Martha Plimpton Webster Hall Anne Hathaway, Brian d’Arcy James, Gavin Creel, John Shea, Karen Olivo, Kate Mulgrew, Marc Kudisch, and Nilaja Sun 2010 Anika Noni-Rose and Michael Cerveris Webster Hall J. Smith-Cameron, Marin Ireland, Linda Lavin, Hamish Linklater, Michael Shannon and Jennifer Westfeldt 2011 S. Epatha Merkerson and David Hyde Pierce Webster Hall Nina Arianda, Alec Baldwin, Margaret Colin, Mamie Gummer, Rose Hemingway, John Larroquette, Patina Miller, Lin-Manuel Miranda, Arian Moayed, Jim Parsons, Andrew Rannells, Liev Schreiber, and Frank Wood 2012 no formal host Webster Hall Eric McCormack, Grace Gummer, Hugh Dancy, Jonathan Pryce, Justin Bartha, Leslie Odom Jr., Lily Rabe, Michael McKean, Tonya Pinkins, Topher Grace, and Tracee Chimo 2013 Jessica Hecht and Jeremy ShamosGans, Andrew. \"'Detroit', 'Grimly Handsome', Eisa Davis, John Rando, Shuler Hensley and More Are Obie Winners\" playbill.com, May 20, 2013 Webster Hall Bobby Cannavale, Tracee Chimo, Cyndi Lauper, Judith Light, Krysta Rodriguez, Duncan Sheik, Meryl Streep, and Courtney B. Vance 2014 Tamara Tunie and Hamish LinklaterGans, Andrew.\"59th Annual Obie Award Winners Announced; Sydney Lucas Is Youngest Winner in Obie History\" playbill.com, May 19, 2014 Webster Hall Betsy Aidem, Harvey Fierstein, Lena Hall, LaTanya Richardson Jackson, Andy Karl, David Bar Katz, Cristin Milioti, Kelli O'Hara, Lily Rabe, and Stephen Trask 2015 Lea DeLaria Webster Hall Sting, Jessie Eisenberg, Stockard Channing, Billy Crudup, Tony Kushner, Lisa Kron, and William Ivey Long 2016 Lea DeLaria Webster Hall Savion Glover, Elizabeth Marvel, Colman Domingo, Danai Gurira, Tovah Feldshuh, Lisa Kron, Maura Tierney, Kate Burton, Carrie Preston, Norm Lewis, and Marlo Thomas 2017 Lea DeLaria Webster Hall Chris Cooper, Rose Byrne, Benj Pasek and Justin Paul, Jayne Houdyshell, Lena Hall, Jefferson Mays, LaChanze, Daphne Rubin- Vega, Taylor Mac, Darius de Haas, Mike Faist, J. Smith-Cameron, David Henry Hwang, Derek McLane, William Ivey Long, Emilio Sosa, Peter Barbey 2018 John Leguizamo Terminal 5 Andrew Garfield, Lucy Liu, Matthew Broderick, Oliver Platt, Laura Benanti, Laura Osnes, Beth Malone, David Morse, Itamar Moses, Arian Moayed, Stephen Trask, Gideon Glick, Rebecca Taichman, William Ivey Long, Natasha Katz, David Henry Hwang, David Zinn, Emilio Sosa, Lilli Cooper, Pixie Aventura, Heather Hitchens, Peter Barbey, Michael FeingoldAndrew Gans, \"Andrew Garfield, Laura Benanti, Laura Osnes Among Presenters for 2018 Obie Awards\", Playbill, May 14, 2018 2019 Rachel Bloom Terminal 5 Eric Bogosian, Julie White, Kristine Nielsen, Beowulf Boritt, Patti LuPone, Lily Rabe, Hamish Linklater, Heather Hitchens, David Henry Hwang, Billy Crudup, Margo Seibert, Michael John LaChiusa, Liesl Tommy, Damon Daunno, Rachel Chavkin, Rebecca Taichman, Luke Cresswell, Riccardo Hernandez, Mimi Lien, Marc KudischOlivia Clement, \"Liesl Tommy, Patti LuPone, Rachel Chavkin, and More to Present at the 2019 Obies\", Playbill, May 16, 2019 2020 Cole Escola YouTube Clint Ramos, Craig Lucas, Cynthia Erivo, Dominique Morisseau, Eisa Davis, Emilio Sosa, Heather Hitchens, Heidi Schreck, Katrina Lenk, LaTanya Richardson Jackson, Liesl Tommy, Malcolm Gets, Rachel Chavkin, Rachel Hauck, Sahr Ngaujah, Sam Pinkleton, Saycon Sengbloh,Playbill Staff, \"The 2020 Obie Awards, Celebrating the Best of Off-Broadway, Stream July 14\", Playbill, July 14, 2020 == References == == Other websites == Category:Entertainment awards",
 "title": "Obie Award"
}