{
 "id": "907598",
 "text": "Samurai Sentai Shinkenger is a Japanese television series. It is the 33rd series in Toei's Super Sentai series. It joined Kamen Rider Decade as a program featured in TV Asahi's programming block, and following Decade's finale, it aired alongside Kamen Rider W. Its footage was used in Power Rangers Samurai. and its follow up season, Super Samurai. ==Story== For eighteen generations, Samurai of the Shiba House have suppressed the evil intentions of the Gedoushu, malevolent spirits that enter the world of the living from gaps between buildings and other structures. Now, Takeru Shiba, the youngest head of the Shiba Clan must gather his four Vassal in order to battle the Gedoushu under the revived Doukoku Chimatsuri as the Shinkengers. However, as they are joined by his childhood friend Genta, the vassals slowly learn that there's a reason for Takeru's behavior that sets him apart from his predecessors. ==Characters== ===Shinkenger=== Actor Name Rangers Mecha Tori Matsuzaka Takeru Shiba Shinken Red Shishi Origami Runa Natsui Kaoru Shiba Hiroki Aiba Ryunosuke Ikenami Shinken Blue Ryu Origami Rin Takanashi Mako Shiraishi Shinken Pink Kame Origami Shogo Suzuki Chiaki Tani Shinken Green Kuma Origami Suzuka Morita Kotoha Hanaori Shinken Yellow Saru Origami Keisuke Sohma Genta Umemori Shinken Gold Ebi Origami ==Cast== * Takeru Shiba / Shinken Red: Tori Matsuzaka * Ryunosuke Ikenami / Shinken Blue: Hiroki Aiba * Mako Shiraishi / Shinken Pink: Rin Takanashi * Chiaki Tani / Shinken Green: Shogo Suzuki * Kotoha Hanaori / Shinken Yellow: Suzuka Morita * Genta Umemori / Shinken Gold: Keisuke Sohma * Kaoru Shiba / Shinken Red: Runa Natsui * Hikoma Kusakabe: Goro Ibuki * Toshizo Tanba: Kazuyuki Matsuzawa * Juzo Fuwa: Mitsuru Karahashi ===Guest cast=== * Takeru's father (1, 12, 33, 46): Kanji Tsuda * Kana (12): Kayoko Shibata * Daiki Kaito (20): Kimito Totani * Tsukasa Kadoya (21): Masahiro Inoue * Natsumi Hikari (21): Kanna Mori * Narutaki (21): Tatsuhito Okuda * Eijiro Hikari (21): Renji Ishibashi * Toji Sakakibara (32, 33): Tetsuo Morishita * Kyoko Shiraishi (34): Kazue Itoh * Masataka Shiba (45): Masaya Matsukaze * Retsutaka Shiba (movie): Masashi Goda ==Songs== ;Opening theme * \"Samurai Sentai Shinkenger\" ** Lyrics: Shoko Fujibayashi ** Composition: YOFFY ** Arrangement: Project.R (Kenichiro Ōishi & Psychic Lover) ** Artist: Psychic Lover (Project.R) ;Ending theme * \"Shirokujimuchū Shinkenger\" ** Lyrics: Shoko Fujibayashi ** Composition: Hideaki Takatori ** Arrangement: Project.R (Hiroaki Kagoshima) ** Artist: Hideaki Takatori (Project.R) ** Instruments: Zetto ** Episodes: 1-20, 29-48 * \"Shirokujimuchū Shinkenger ~Ginmakuban~\" (\"Dreaming 24/7, Shinkenger (Movie Version)\") ** Lyrics: Shoko Fujibayashi ** Composition: Hideaki Takatori ** Arrangement: Project.R (Hiroaki Kagoshima) ** Artist: Shinkengers (Tori Matsuzaka, Hiroki Aiba, Rin Takanashi, Shogo Suzuki, Suzuka Morita, Keisuke Sohma) & Hideaki Takatori ** Episodes: 21-28 The opening and ending themes of Shinkenger are performed by Psychic Lover and Hideaki Takatori as part of Project.R, respectively. The opening is also featured as a playable song in Taiko no Tatsujin Wii: Do Don to 2 Daime. Its opening theme song single ranked highly on the Oricon charts, reaching #4 on the Daily Ranking Charts on its day of release. and peaked at #6 on the weekly charts selling 20,130 copies within its first week of release and stayed in the top 30 ranks for 4 weeks straight. Category:Super Sentai series Category:2009 Japanese television series debuts Category:2010 television series endings",
 "title": "Samurai Sentai Shinkenger"
}