{
 "id": "90765",
 "text": "Moulin Rouge (Red Windmill) is a traditional cabaret and nightclub which began in 1889. It is on Boulevard de Clichy in the 18th arrondissement (district of the city). This is near the French quarter of Montmartre in the red-light district of Paris called Pigalle. The theatre can be recognized by the large red windmill on its roof. The Moulin Rouge puts on cabaret shows every day. It is where the famous French dance, the Can-can, was first performed. It is also famous because many artists and writers have often gone there. Henri Toulouse- Lautrec designed many posters for the cabaret. Because of this, the management always set aside a table where he could have a meal and watch the show. The ingredients for its success are said to be: Histoire du Moulin Rouge * A revolutionary architecture for the auditorium that allowed rapid changes of décor and where everyone could mix; * Festive champagne evenings where people danced and were entertained thanks to amusing acts that changed regularly, such as the Pétomane; * A new dance inspired by the quadrille which becomes more and more popular: the Can-can, danced to a fastly moving rhythm by dancers in titillating costumes; * Famous dancers whom history still remembers: La Goulue, Jane Avril, la Môme Fromage, Grille d'Egout, Nini Pattes en l'Air, Yvette Guilbert ; * A place loved by artists, of whom the most iconic was Toulouse-Lautrec. His posters and paintings secured rapid and international fame for the Moulin Rouge. Several movies have been made about the Moulin Rouge. The latest is Moulin Rouge! directed by Baz Luhrmann. Jean Renoir made another film about the Moulin Rouge. Until 2023, the shows sometimes featured Burmese pythons. Until 2021, ponies could be seen on stage. There are 850 seats. In the year 2000, about 420.000 people visited the shows. In 2023, the Moulin Rouge had a profit of about 82 million euros, with about 550.000 spectators, and employed 450 people. The Moulin Rouge has a large cave, used for Champagne and other wines. When there is a show, up to 800 bottles of Champagne are consumed, or about 240.000 a year.Die Welt des Moulin Rouge. documentary by Vivienne Radermacher, 2013, 45 Min., author: Anna Sigrist, procuced by ARD-Studio Paris and Phoenix. This makes it the biggest single consumer of Champagne in the world. == Related pages == * Henri Toulouse-Lautrec * Paris * Bohemianism == References == == Other websites == * Moulin Rouge Paris - Official Website Category:Theatres in Paris",
 "title": "Moulin Rouge"
}