{
 "id": "907753",
 "text": "Choushinsei Flashman is a Japanese television series. It is the 10th series in Toei's Super Sentai series. It was the first incarnation of Super Sentai that introduced a second giant robot. Yutaka Izubuchi designed all characters in the series. He would eventually return much later on to design the characters for Tokumei Sentai Go-Busters. ==Storyline== In 1966, 5 young children were kidnapped by an alien group known as the Alien Hunters for the Reconstructive Experiment Empire Mess, who wanted samples of humans from Earth to experiment on. The 5 children were rescued by Mess' archenemy, the Flash alien race, which took each one to a different planet of the Flash solar system for training. Each child was trained separately in a range of superpowers that will allow them to fight Mess, their bodies also adapted to the atmosphere pf the Flash Solar System making them gain special abilities. When they finally return to Earth in 1986 to combat Mess, who is now trying to invade it, they use the opportunity to search for their birth parents. ==Characters== Actor Name Rangers Touta Tarumi Jin Flash Red Kihachiro Uemura Dai Flash Green Jo Ishiwatari Bun Flash Blue Youko Nakamura Sara Flash Yellow Mayumi Yoshida Lou Flash Pink ==Cast== * Jin / Flash Red: Touta Tarumi * Dai / Flash Green: Kihachirō Uemura * Bun / Flash Blue: Jo Ishiwatari * Sara / Flash Yellow: Youko Nakamura * Lou / Flash Pink: Mayumi Yoshida * Leh Näfel: Sayoko Hagiwara * Narrator: Eiichi Onoda ===Guest Stars=== * Miran: Kazuoki Takahashi (credited as Kenji Kawai) (Episode 21) * Ryuu Wakakusa: Ryousuke Kaizu (Episode 27) * Sibelle: Mina Asami (Episode 40) ==Song== ;Opening Theme *\"Choushinei Flashman\" **Lyrics: Reo Rinozuka **Composition: Yukihide Takewara **Arrangement: Keiichi Oku **Artist: Taku Kitahara ;Ending Theme *\"Fighting Pose, Flashman!\" **Lyrics: Kōhei Oikawa **Composition: Yukihide Takewara **Arrangement: Keiichi Oku **Artist: Taku Kitahara Category:Super Sentai series Category:1986 television series debuts Category:1987 television series endings",
 "title": "Choushinsei Flashman"
}