{
 "id": "907728",
 "text": "Chōjin Sentai Jetman is a Japanese television series. It is the 15th series in Toei's Super Sentai series. ==Plot== This series takes place in 199X. On the Earth Ship, the command center of a defence agency called Sky Force, the guardians of peace on Earth, scientists have developed \"Birdonic Waves\", a newly developed technology that gives the subject superhuman abilities. Experiments called \"J-Protect\" were successful. Aya Odagiri, the director of the project, chooses five elite Sky Force officials from Earth to use this technology. Ryuu Tendou, one of the Sky Force officers, is successfully exposed to the Birdonic Waves, making him the first Jetman, the Red Hawk. However, the Earth Ship is suddenly attacked by Vyram, an evil outer- dimensional organization bent on inter-dimensional domination. They successfully destroy the ship, apparently killing Ryuu's lover and fellow candidate member Rie. In the chaos, the remaining Birdonic Waves for the other four officials become scattered on Earth, hitting four civilians. Odagiri and Tendou successfully escape and begin searching on Earth for the four remaining Jetmen, training them to aid them in stopping Vyram's plans of conquering their dimension. The series later follows the tribulations of Ryuu as he learns of Rie's survival and enlistment in the Vyram forces, as well as a love triangle between Gai, Ryuu, and Kaori. ==Characters== ===Jetman=== Actor Name Rangers Mecha Kotaro Tanaka Ryuu Tendou Red Hawk Jet Hawk Toshihide Wakamatsu Gai Yuki Black Condor Jet Condor Ikko Tadano Raita Ōishi Yellow Owl Jet Owl Rika Kishida Kaori Rokumeikan White Swan Jet Swan Sayuri Uchida Ako Hayasaka Blue Swallow Jet Swallow Jeffrey Kensaki Green Eagle Jet Eagle ==Cast== * Ryuu Tendou / Red Hawk: Koutaro Tanaka * Kaori Rokumeikan / White Swan: Rika Kishida * Raita Ōishi / Yellow Owl: Ikko Tadano * Ako Hayasaka / Blue Swallow: Sayuri Uchida * Gai Yuki / Black Condor, Jeffrey Kensaki / Green Eagle: Toshihide Wakamatsu * Commander Aya Odagiri: Mikiko Miki * Rie Aoi / Maria: Maho Maruyama * Tran: Miku Kuga * Narrator: Tsutomu Tareki ==Songs== ;Opening theme *Title song **Lyrics: Toyohisa Araki **Composition & Arrangement: Gōji Tsuno **Artist: Hironobu Kageyama ;Ending theme *\"Your Heart is an Egg\" **Lyrics: Toyohisa Araki **Composition: Gōji Tsuno **Arrangement: Kenji Yamamoto **Artist: Hironobu Kageyama ==Reception== Jetman was originally going to be adapted into the first season of Mighty Morphin Power Rangers, but Saban chose its successor, Kyōryū Sentai Zyuranger to be the first instead. Category:Super Sentai series Category:1991 television series debuts Category:1992 television series endings",
 "title": "Chōjin Sentai Jetman"
}