{
 "id": "907743",
 "text": "Hikari Sentai Maskman is a Japanese television series. It is the 11th series in Toei's Super Sentai series. It was the first Super Sentai series that showcased each members having their own individual vehicles that form their robot, it also introduced non-Japanese martial arts discipline. ==Plot== Commander Sugata is a scientist and sage who excels in mental reinforcements and is a master of every martial arts discipline. He discovered the existence of the Underground Empire Tube, a once peaceful kingdom that has turned into a malignant force under the mysterious Zeba, who desires to conquer the surface. In order to stand against them and thwart their plans, Sugata recruits five young people to become the Maskmen. Each becomes specialized in a style of martial arts, and Sugata teaches them the ways of the mystical Aura Power. A year after Sugata recruits and trains the Maskmen, the Underground Empire Tube is ready to strike. Princess lai of the deposed Igam Royal Family, sent to spy above ground as Mio, falls in love with Takeru, and wishes for those underground and above ground to coexist. She is kidnapped and imprisoned in ice for her betrayal. As Takeru and the Maskmen battle Tube, they learn about lai and Igam's relationship, and a terrible dark secret about Zeba, the Tube leader. ==Characters== ===Maskman=== Actor Name Rangers Mecha Ryousuke Kaizu Takeu Red Mask Mask Fighter Kouichi Kurasaki Kenta Black Mask Mask Drill Issei Hirota Akira Blue Mask Mask Tank Yuki Nagata Haruka Yellow Mask Mask Jet Kanako Maeda Momoko Pink Mask Mask Gyro Shinji Higashi Ryo Asuka X1 Mask ?????? ==Cast== * Takeru / Red Mask: Ryousuke Kaizu * Kenta / Black Mask: Kouichi Kurasaki * Arika / Blue Mask / Unas: Issei Hirota * Haruka / Yellow Mask: Yuki Nagata * Momoko / Pink Mask: Kanako Maeda * Ryo Asuka / X1 Mask: Shinji Higashi (episode 39) * Commander Sanjuro Sugata: Hayato Tani * Prince (Princess) Igam, Princess lai: Mina Asami * Narrator: Hiroshi Takeda ==Song== ;Opening Theme * \"Hikari Sentai Maskman\" **Lyrics: Masao Irino **Composition: Daisuke Inoue **Arrangement: Ohzuchi Fujita **Artist: Hironobu Kageyama ;Movie Opening Theme * \"Shot Bomber Zenryoku Shūchū\" (\"Shot Bomber All Concentration Force\") **Lyrics: Kazunori Sonobe **Composition: Takeshi Ike **Arrangement: Daito Fujita **Artist: Hironobu Kageyama ;Ending Theme * \"Ai no Soldier\" (\"Soldier of Love\") **Lyrics: Masao Irino **Composition: Daisuke Inoue **Arrangement: Ohzuchi Fujita **Artist: Hironobu Kageyama Category:Super Sentai series Category:1987 television series debuts Category:1988 television series endings",
 "title": "Hikari Sentai Maskman"
}