{
 "id": "90790",
 "text": "James Broadbent (born 24 May 1949) is an English actor. Broadbent was born in Lincolnshire; he lives in London.The Heartbreak Kid ==Filmography== Year Title Role Notes 1980 Breaking Glass Station Porter 1981 Film crew 1981 Time Bandits Compere 1982 Bird of Prey DI Richardson 1982 Birth of a Nation Geoff Fig 1983 Don Speekingleesh 1983–1991 Only Fools and Horses Det. Chief Insp. Roy Slater Television Series: 3 Episodes 1985 Brazil Dr. Jaffe 1985 Roger Miles 1985 Happy Families Dalcroix Television Series: 3 Episodes 1987 Superman IV: The Quest for Peace Jean Pierre Dubois 1988 Blackadder's Christmas Carol Prince Albert Television Special 1989 Revolution!! Wallace Television Film Also Writer 1989 Erik the Viking Ernest the Viking 1990 Life Is Sweet Andy 1991 Gone to the Dogs Jim Morley 1992 A Sense of History The 23rd Earl of Leete Television Film Also Writer 1992 Enchanted April Frederick Arbuthnot 1992 Col 1993 Prince Cinders Ugly Brother 1994 Bullets Over Broadway Warner Purcell 1994 Princess Caraboo Mr. Worrall 1994 Widows' Peak Con Clancy 1995 Richard III The Duke of Buckingham 1995 The Last Englishman Col. Alfred D. Wintle 1996–2000 Percy the Park Keeper Percy Voice for animated children's series 1997 Pod Clock 1997 Smilla's Sense of Snow Dr. Lagermann 1998 Mother 1998 Little Voice Mr. Boo Nominated — Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture 1999 Topsy-Turvy W. S. Gilbert 1999 Doctor Who: Curse of Fatal Death Unofficial Eleventh Doctor Television Special 2001 Bridget Jones's Diary Colin Jones, Bridget's father 2001 Moulin Rouge! Harold Zidler 2001 Iris John Bayley 2002 Desmond Morton 2002 Gangs of New York Boss Tweed 2002 Nicholas Nickleby Mr. Wackford Squeers National Board of Review Award for Best Cast 2003 Bright Young Things Drunk Major 2003 Alfred Salteena 2004 Around the World in 80 Days Lord Kelvin 2004 Pride Eddie Voice Role Television Film 2004 Vanity Fair Mr. Osborne 2004 Vera Drake Judge 2004 Bridget Jones: The Edge of Reason Colin Jones, Bridget's father 2005 Robots Madame Gasket Voice Role 2005 Valiant Sergeant Voice Role 2005 Professor Kirke 2006 Free Jimmy Igor Stromowskij Voice Role for 2008 English version 2006 Stan McDermott 2006 Longford Lord Longford 2006 Art School Confidential Jimmy 2007 Hot Fuzz Inspector Frank Butterman 2007 And When Did You Last See Your Father? Arthur Morrison 2008 Indiana Jones and the Kingdom of the Crystal Skull Dean Charles Stanforth 2008 Einstein and Eddington Sir Oliver Lodge Television Film 2008 Inkheart Fenoglio 2009 King William IV 2009 Sam Longson Nominated — British Independent Film Award for Best Supporting Actor 2009 Harry Potter and the Half-Blood Prince Horace Slughorn 2009 Perrier's Bounty Jim McCrea 2010 Another Year Tom 2010 Animals United Winston 2010 Any Human Heart Logan Mountstuart (older) 2011 Harry Potter and the Deathly Hallows – Part 2 Horace Slughorn 2011 Exile Sam Ronstadt Television Series: 3 Episodes 2011 Arthur Christmas Santa Voice Role 2011 The Iron Lady Denis Thatcher Nominated - BAFTA Award for Best Actor in a Supporting Role 2012 Cloud Atlas Captain Molyneux Vyvyan Ayrs Timothy Cavendish Korean Musician Prescient 2 2013 Postman Pat: The Movie — You Know You're The One Unknown Voice only == References == == Other websites == * * * *Biography on the Broadbent Theatre website Category:1949 births Category:Living people Category:English Academy Award winning actors Category:Actors from Lincolnshire Category:BAFTA Award winning actors Category:English movie actors Category:English stage actors Category:English television actors Category:English voice actors Category:Golden Globe Award winning actors",
 "title": "Jim Broadbent"
}