{
 "id": "90792",
 "text": "John Leguizamo (born July 22, 1964) is an Emmy Award-winning and Golden Globe- nominated American comedian, actor and producer. == Movies == Year Title Role Notes 1985 Mixed Blood Macetero 1989 Casualties of War PFC Antonio Diaz 1990 Street Hunter Angel 1990 Gentille Alouette Ortiz 1990 Revenge Ignacio 1990 Die Hard 2 Burke 1991 Poison Chanchi Credited as Damien Garcia 1991 Hangin' with the Homeboys Johnny 1991 Out for Justice Boy in alley 1991 Regarding Henry Liquor store gunman 1991 NYPD Mounted Unknown 1992 Puerto Rican Mambo (Not a Musical) \"Guess my nationality\" guy 1992 Whispers in the Dark John Castillo 1992 Time Expired Ruby 1993 Night Owl Angel 1993 Super Mario Bros. Luigi Mario 1993 Carlito's Way Benny Blanco 1995 A Pyromaniac's Love Story Sergio 1995 To Wong Foo, Thanks for Everything! Julie Newmar Chi-Chi Rodriguez Nominated – Golden Globe Award for Best Supporting Actor – Motion Picture 1996 Executive Decision Rat 1996 The Fan Manny 1996 Romeo + Juliet Tybalt Capulet 1997 The Pest Pestario \"Pest\" Vargas 1997 A Brother's Kiss Lefty 1997 Spawn Clown/Violator 1998 Frogs for Snakes Zip 1998 Body Count Chino 1998 Dr. Dolittle Rat #2 Voice 1999 Joe the King Jorge 1999 Summer of Sam Vinny 2000 Arabian Nights Genie 2000 Titan A.E. Gune Voice 2000 King of the Jungle Seymour 2001 Moulin Rouge! Toulouse-Lautrec 2001 What's the Worst That Could Happen? Berger 2001 Dr. Dolittle 2 Rat #2 Voice (uncredited) 2002 Collateral Damage Felix Ramirez 2002 Zig Zag Dean Singer 2002 Ice Age Sid Voice 2002 Point of Origin Keith Lang 2002 Empire Victor Rosa 2002 Spun Spider Mike 2003 Undefeated Lex Vargas 2004 Crónicas Manolo Bonilla 2005 Assault on Precinct 13 Beck 2005 The Honeymooners Dodge 2005 Land of the Dead Cholo DeMora 2005 Sueño Antonio 2006 AKA Sean Edison 2006 The Alibi Hannibal 2006 Ice Age: The Meltdown Sid Voice 2006 The Groomsmen T.C. 2007 Where God Left His Shoes Frank Diaz 2007 The Babysitters Michael Beltran 2007 Love in the Time of Cholera Lorenzo Daza 2007 The Take Felix De La Pena 2008 Paraiso Travel Roger Pena 2008 The Happening Julian 2008 Miracle at St. Anna Enrico 2008 Righteous Kill Detective Simon Perez 2008 Nothing like the Holidays Mauricio Rodriguez 2008 Surviving Sid Sid Voice 2009 The Ministers Dante / Perfecto Mendoza 2009 Rage Jed 2009 Ice Age: Dawn of the Dinosaurs Sid Voice Nominated - Annie Award for Voice Acting in a Feature Production 2009 Gamer Freek 2010 Repo Men Asbury Uncredited 2010 Vanishing on 7th Street Paul 2010 Big Balls Unknown Short film 2011 One for the Money Jimmy Alpha 2011 The Lincoln Lawyer Val Valenzuela 2012 Ice Age: Continental Drift Sid Voice 2012 El Paseo 2 Lucho Calvo 2013 Underdogs Ziggy Voice; American dub 2013 Kick-Ass 2 Javier 2013 The Counselor Randy 2013 Walking with Dinosaurs Alex Voice 2013 Fish N Chips, Best Enemies Forever Chips Voice 2014 Ride Along Santiago 2014 Chef Martin 2014 Cymbeline Pisanio 2014 John Wick Aurelio 2014 Fugly! Jesse 2015 Experimenter Taylor 2015 Meadowland Pete 2015 Stealing Cars Montgomery De La Cruz 2015 American Ultra Rose 2015 Get Squirrely Fly Boy/Liam Voice 2015 Sisters Dave 2016 The Hollow Point Atticus 2016 Ice Age: Collision Course Sid Voice 2016 The Infiltrator Emil Abreu 2016 11:55 Berto 2017 The Crash George John Wick: Chapter 2 Aurelio 2018 Nancy Jeb 2019 The Sun Is Also a Star Jeremy Martinez Playing with Fire TBA The Night Clerk Post-production Harry Haft Post-production Critical Thinking Mario Martinez Post-production; also director The Godmother Post-production ==References== == Other websites == * * * John Leguizamo at Internet Off-Broadway Database * * Q&A; Sessions: John Leguizamo on The Happening at nocheLatina.com Category:1964 births Category:Living people Category:Naturalized citizens of the United States Category:American movie actors Category:American voice actors Category:Comedians from Los Angeles Category:American Emmy Award winners Category:Puerto Rican movie actors Category:People from Bogotá Category:Actors from Los Angeles Category:Movie producers from Los Angeles Category:Puerto Rican voice actors Category:Puerto Rican comedians",
 "title": "John Leguizamo"
}