{
 "id": "908165",
 "text": "The Railway Series is a series of fiction books written by the Reverend W. Awdry and his son Christopher Awdry. The books are about the locomotives who work on the Island of Sodor, including Thomas the Tank Engine. The first book, called The Three Railway Engines, came out in 1945. The last book, Thomas and His Friends, was published in 2011. The books were made into a TV show in 1984, called Thomas & Friends. == Origins == In 1942, Christopher Awdry caught measles and was confined to his bedroom. He was two years old at the time. His father, Wilbert, told him stories and rhymes to cheer him up. One of Christopher's favourite rhymes was: Early in the morning, Down at the station, All the little engines Standing in a row. Along comes the driver, Pulls the little lever Puff, puff! Chuff, chuff! Off we go! Wilbert then drew illustrations of the rhyme. Christopher then asked questions about the sad engine depicted in the drawing. This led to Wilbert writing a short story titled \"Edward's Day Out\". It is about , an old engine who is allowed out of the shed for a day. Another story about Edward followed, this time also featuring Gordon the Big Engine. Gordon was named after a child living on the same road who Christopher considered rather bossy. The third story had its origins in a limerick Christopher liked. Wilbert used the rhyme as inspiration for the introduction in \"The Sad Story of Henry\": Once, an engine attached to a train Was afraid of a few drops of rain It went into a tunnel, And squeaked through its funnel And never came out again. This story introduced and The Fat Controller. Wilbert's wife, Margaret, encouraged her husband to publish the stories. In 1943, Awdry submitted the three stories to writer Michael Barsley. The stories were then sent to publishing firm Edmund Ward in Leicester. Edmund Ward requested a fourth story to bring the three engines together and redeem Henry, who had been bricked up in a tunnel in the previous story. Wilbert had not intended that the three engines live on the same railway. Nonetheless, he responded by writing the story \"Edward, Gordon and Henry\". The four stories were published by Edmund Ward on 12 May 1945. The stories were included in a single book, The Three Railway Engines. The illustrations were drawn by William Middleton. == References == == Sources == * Category:Series of books Category:Thomas and Friends",
 "title": "The Railway Series"
}