{
 "id": "908170",
 "text": "The veined tree frog, merian frog, common tree frog, warty tree frog, marbled tree frog, lost treefrog, Laurenti's brown tree frog, vein-eyed glue frog, Amazon milk frog, or pepper tree frog (Trachycephalus typhonius) is a frog that lives in Brazil, Colombia, Nicaragua, Surname, Argentina, Bolivia, Guianas, Paraguay, Argentina, Venezuela, Peru, Trinidad, and Tobago. This animal is large for a tree frog. The adult male is 7.0 to 10.0 cm long from nose to rear end and the adult female is 9.3 to 11.4 cm long. It has thick yellow, gray, or red-brown skin on its back with a large tan or brown mark. It has strong toes with disks on them for climbing. There is a little webbing on the front feet and more webbing on the back feet. The adult male frog has vocal sacs for singing. Unlike other tree frogs, it has green bones and solid color on its sides. But it can have stripes on its legs. This frog hides during the day and looks for food at night. People have seen it high in the tree branches. This frog lays eggs after big rainstorms. The female lays eggs on the surface of a pond. The tadpoles take 37 to 47 days to become young frogs. The tadpoles have large lungs and large gills. This is because there is not much oxygen in the warm water where they live. They eat algae. Scientists have seen this frog glide through the air. They call this kind of gliding parachuting. The frog falls in the same direction, with its legs spread out. This frog makes a sticky white substance in its skin. This substance has chemicals that can cause human beings' skin and eyes to hurt. One of its names \"pepper tree frog,\" comes from the idea that it makes people sneeze, like pepper does. If a snake or other predator tries to eat the frog, it will make this white substance come out of its skin. This will hurt the predator's mouth so the frog can hop away. Because this substance does not dissolve in water, like wax does not, scientists also think it might also stop the frog from drying out and dying. ==References== Category:Frogs of South America",
 "title": "Veined tree frog"
}