{
 "id": "908191",
 "text": "Linguolabials or apicolabialsThe term apicolabial is older, but Ladefoged and Maddieson point out that often these sounds are not apical. are consonants articulated by putting the tip of the tongue against the top-side of the lip. The lip then goes to the tongue. Linguolabial consonants are not seen very often in languages, but they are not very hard to make with your mouth, unlike click consonants or ejectives. Some languages that do have lots of linguolabial consonants are Vanuatu, Bijago, in Umotína and as paralinguistic sounds. They can be sometimes seen in disordered speech. They can be typed as to the alveolar consonant that fits it. You can also use the apical diacritic, to the bilabial consonant that fits it.Pullum & Ladusaw, Phonetic Symbol Guide, 1996:256. They note that the apical diacritic was added to the IPA after the linguolabial diacritic, and would have made the latter unnecessary. == List of consonants == IPA (two transcriptions) Description Example Language Orthography IPA Meaning linguolabial nasal Araki m̈ana \"laugh\"See p.270 of . See also entry m̈ana in Araki-English online dictionary. voiceless linguolabial plosive Tangoa p̈ep̈e \"butterfly\"Ladefoged and Maddieson 1996, p. 19. voiced linguolabial plosive Kajoko dialect of Bijago \"stone\"Olson et al. 2009, p. 523. prenasalized voiced linguolabial plosive Vao \"bow\" voiceless linguolabial fricative Big Nambas \"he is asthmatic\" voiced linguolabial fricative Tangoa v̈atu \"stone\" — linguolabial lateral approximant (common in disordered speech) — voiceless linguolabial lateral fricative (in disordered speech) — voiced linguolabial lateral fricative (in disordered speech) linguolabial trill (uses lower lip) Coatlán Zapotec mimesis for a child's flatulenceRosemary Beam de Azcona, Sound Symbolism. Available at (blowing a raspberry) or linguolabial click release (multiple consonants) Coatlán Zapotec mimesis for eating soup or a pig drinking water == Related pages == * Place of articulation == Notes == == References == * * * Category:Consonants",
 "title": "Linguolabial consonant"
}