{
 "id": "90826",
 "text": "The Burj Khalifa (, \"Khalifa Tower\") is a megatall skyscraper in Dubai, United Arab Emirates named after Khalifa bin Zayed Al Nahyan, and is the tallest building ever built, at . Before the building opened, it was called Burj Dubai. The building is 162 stories high. Construction of the tower was started on 6 January 2004, and the building was officially opened on 4 January 2010, almost 6 years later. It is the tallest structure made by humans in the world. The building is more than taller than The Taipei 101. Taipei 101 was the tallest building until 2010 before Burj Khalifa was built. Adrian Smith designed the tower. He worked with Skidmore, Owings and Merrill (SOM) until 2006. It was built by Samsung Engineering & Construction, Besix, and Arabtec. The tower cost US $1.5 billion to build. The building is part of a building project on Sheikh Zayed Road, Downtown Burj Khalifa. It is near Dubai's main business district. == The building and planning == The main contractor was Samsung C&T; of South Korea. They also built the Taipei 101 and Petronas Towers. Other contractors who helped with the building included Belgian group Besix and Arabtec from the UAE. The Turner Construction Company was chosen as the construction project manager. The design architect, Adrian Smith, did not like the first design of the upper part of the building. He added 27 new floors and an aluminium spire to the top of the plans. The design of Burj Khalifa is based on those used in Islamic architecture. Burj Khalifa has been said to have had several other planned height increases since it was first built. This has not been proven to be true yet. The TV/radio communications mast was added to the tower's plans in 2007. This was after building work had begun in 2006. There are pressurized, air-conditioned refuge floors about every 35 floors. These were put into the tower in case of an emergency or fire. The unusual design and engineering problems of building Burj Khalifa have been shown in many television documentaries. These include the Big, Bigger, Biggest series on the National Geographic and Five channels, and the Mega Builders series on the Discovery Channel. The most important building material of Burj Khalifa is reinforced concrete. A special concrete was needed because of the high pressures of the building's weight and the hot local climate of Persian Gulf temperatures that can reach . Any major cracks could have caused a large amount of damage to the building. The foundation of the building is deep. It was built with 192 columns being put into the ground. Each column was in diameter and long. of steel rebar was used in the construction of the tower. It took 22 million man-hours to build. A high density, low permeability concrete was used in the foundations of Burj Khalifa. A cathodic protection system is used to lessen any bad effects from corrosive chemicals in local ground water. === The Dubai Fountain === A fountain system was built outside the tower. It was designed by WET Design of California. They built and planned out the fountains at the Bellagio Hotel Lake in Las Vegas. The fountain cost UAEd 800 million. It is lit by 6,600 lights and 50 coloured projectors. The fountain is long. It shoots water into the air to the sounds of classical and modern Arabic and world music. On 26 October 2008, the fountain was named the Dubai Fountain. === Delays and late building work === Emaar Properties said on 9 June 2008 that construction of Burj Khalifa was slowed because of changes to finishes. An Emaar official said that the luxury finishes that were decided on in 2004, when the tower was first planned, were being being replaced by better finishes. The design of the apartments were also made better. This was done to make them both look better and work better. There were problems with the marble decorations, flooring, the top floors' sanitation system, broken glasswork and a poorly done wall mural of the Sultan of Oman. A new ending date of 2 December 2009, was then given. Burj Khalifa opened on 4 January 2010. === Workers' disputes and strikes. === Burj Khalifa was built mainly by people from South Asia. Press reports said in 2006 that skilled carpenters at the site earned UK£4.34 a day, and labourers earned UK£2.84. According to a BBC investigation and a Human Rights Watch report, the workers lived in very bad conditions. Often they were not paid for the work. Their passports were taken by their employers. It was said that they were working in dangerous conditions that caused high number of deaths and injuries. Companies not paying workers has been reported to the authorities several times. On 21 March 2006, about 2,500 workers protested. They were mad about buses that were delayed for the end of their shifts. They damaged cars, offices, computers, and construction equipment. A Dubai Interior Ministry official said they caused almost UK£500,000 in damage. Most of the workers who were part of the riot returned the following day but refused to work. == Records set == The building is not only the tallest building in the world, it also holds the following records- * Tallest skyscraper to top of spire: (previously Taipei 101 – ) * Tallest structure ever built: (previously Warsaw radio mast – ) * Tallest freestanding structure: (previously CN Tower – ) * Building with most floors: 160 (previously Willis Tower – 108) * World's highest elevator installation * Highest vertical concrete pumping (for a building): (previously Taipei 101 – ) * Highest vertical concrete pumping (for any construction): (previously Riva del Garda Hydroelectric Power Plant – ) * The first world's tallest structure in history to include residential space * Highest outdoor observation deck in the world (126th floor), at about 440 m (1,440 ft). * World's highest installation of an aluminum and glass façade, at a height of . * World's highest swimming pool (125th floor) * World's highest restaurant (128th floor) == Gallery == File:Burj2.jpg|Construction work during February 2006 File:20060829 Burj Dubai.jpg|29 August 2006 File:84floors.jpg|11 November 2006 File:Burjdubaijanuary07.jpg|2 January 2007 File:Burjdubai030106.jpg|3 January 2007 |Construction work during early 2007 File:Burjdubaifeb2107.jpg|21 March 2007 File:Burj Dubai 20071204.jpg|4 December 2007 File:Burj dubai 3.11.08.jpg|Construction work during 11 March 2008 File:Burj Dubai Under Construction on 8 May 2008 Pict 2.jpg|8 May 2008 File:Burj Dubai 20090121 (close-up of spire).jpg|The spire is added along with the TV/radio mast File:Burj Dubai 001.jpg|4 January 2010, skyline of Dubai with Burj Khalifa in the background == Comparisons == |- |- |- == References == == Other websites == * Beautiful Places in Dubai * http://www.widerview.ae/ * Official website * Dubai Top Ten Hidden treasures * Burj Dubai Skyscraper.com * Skidmore, Owings & Merrill LLP, architects * Emporis page on Burj Khalifa * (Irwin, Baker, June 2006) STRUCTURE magazine * (Erwin, etal, November 2006) STRUCTURE magazine * Otis Worldwide, Signature Projects , information on the project's elevators at the Otis Elevator Company * Wind and Other Studies performed by RWDI * View from the top * 2daydubai.com , Burj Khalifa Project Review * BBC report on Burj Khalifa opening with video and links * A map of its location (Google Maps) Category:2010 establishments in Asia Category:Buildings and structures completed in the 21st century Category:Buildings and structures in Dubai Category:Hotels in the United Arab Emirates Category:Skyscrapers in the United Arab Emirates Category:Establishments in the United Arab Emirates",
 "title": "Burj Khalifa"
}