{
 "id": "908844",
 "text": "Historically, the United Kingdom has been a big producer of music. Including church music, traditional folk music and instrumentation of England, Scotland, Northern Ireland, and Wales. The countries of the United Kingdom has its own folk music forms, which is popular until the era of industrialisation. Many British musicians have influenced modern music around the world, and the United Kingdom has one of the world's largest music industries. Genres include pop, rock, also sub-genres like avant-funk, new wave, acid jazz, neo soul, trip hop, dubstep and industrial. == Folk music == Every countries of the United Kingdom has its own. folk music forms. Folk music is an important sub- culture within society.G. Boyes, The Imagined Village: Culture, Ideology, and the English Folk Revival (Manchester: Manchester University Press, 1993), . === English folk music === England has a long history of folk music. During the medieval period there were forms of music, song and dance. A lot of the tradition has been preserved and is practiced. There are a number other forms of music that made subgenres such as British folk rock, folk punk and folk metal, popular in areas such as Northumbria and Cornwall.B. Sweers, Electric Folk: The Changing Face of English Traditional Music (Oxford: Oxford University Press, 2005), . ===Gaels folk music=== ==== Ulster/Irish folk music ==== Ireland, including Northern Ireland, has vibrant folk traditions. The popularity of traditional instruments such as fiddles has remained throughout the centuries even as analogues in Great Britain died out. Perhaps the most famous modern musician from Northern Ireland influenced by folk tradition is Van Morrison. ==== Scottish folk music ==== Scottish folk music includes many kinds of songs, including ballads and laments, sung by a single singer with accompaniment by bagpipes, fiddles or harps. Traditional dances include waltzes, reels, strathspeys and jigs. Alongside the other areas of the United Kingdom, Scotland underwent a roots revival in the 1960s. Cathy-Ann McPhee and Jeannie Robertson were the heroes of this revival, which inspired some revolutions in band formats by groups like The Clutha, The Whistlebinkies, The Boys of the Lough and the Incredible String Band. === Welsh folk music === Wales is a Celtic country that features folk music played at twmpathau (communal dances) and gwyl werin (music festivals). Welsh music also includes male voice choirs and songs accompanied by a harp. Having long been subordinate to English culture, Welsh musicians in the late 20th century had to reconstruct traditional music when a roots revival began. This revival began in the late 1970s and achieved some mainstream success in the UK in the 1980s with performers like Robin Huw Bowen, Moniars and Gwerinos. ==References== *",
 "title": "Music of the United Kingdom"
}