{
 "id": "90977",
 "text": "Gottfried Silbermann (born Kleinbobritzsch, 14 January 1683; died Dresden, 4 August 1753) was a very important German builder of keyboard instruments. He built harpsichords, clavichords, organs, and pianos. == Life == He was born in Kleinbobritzsch. He learnt to build organs from his brother in Straßburg. In 1711 Silbermann opened his own workshop in Freiberg. Then, in 1723 got the title \"Honorary Court and State Organ Builder to the King of Poland and Elector of Saxony\" from Frederick Augustus I.Kümmerle, Salomon (1894). Encyklopädie der evangelischen Kirchenmusik, Band 3. C. Bertelsmann Verlag. p. 394. Gottfried Silbermann designed and built approximately 50 organs. He had different ideas about organ building from Arp Schnitger who was an organ builder in the north of Germany. Silbermann's organs were some of the best instruments in the south of Germany, some of them still exist. The Hofkirche organ and that of Freiberg Cathedral are considered his greatest works.\"The Great Organ by Gottfried Silbermann - Ev.-luth. Domgemeinde Freiberg\". www.freiberger-dom.de. == Silbermann's pianos == Silbermann also played a big role in the history of the piano. He built the first German fortepiano in 1732.\"Silbermann, Gottfried - Blättern im Zedler-Lexikon Bd. 37, Seite 645\". www.zedler-lexikon.de. During the 1740s, King Frederick the Great of Prussia became familiar with Silbermann's pianos and bought a number of them.Stewart Pollens. Bartolomeo Cristofori and the Invention of the Piano. Cambridge University Press, 2017. ISBN 110709657X. p. 294.Restle, Conny (2001), Wagner, Günther (ed.), \"Gottfried Silbermann und die Hammerflügel für den Preussischen Hof in Potsdam\", Jahrbuch des Staatlichen Instituts für Musikforschung Preußischer Kulturbesitz: 2001 (in German), Stuttgart: J.B. Metzler, pp. 189–203 He employed Carl Philipp Emanuel Bach who was playing Silbermann fortepianos and wrote music for this particular fortepiano model.Spányi, Miklós (2016). Schulenberg, David (ed.). C. P. E. Bach. London and New York: Routledge. p. 495. ISBN 978-1-4724-4337-3. They were also played by Johann Sebastian Bach during his visit to PotsdamChristoph Wolff. Johann Sebastian Bach: The Learned Musician. ISBN 0393322564. p. 413 where during his second visit Silbermann pianos met Bach's \"complete approval\". == References == ==Other websites== * www.silbermann.org Gottfried-Silbermann-Society Category:1683 births Category:1753 deaths Category:People from Saxony Category:Organ builders Category:Piano makers",
 "title": "Gottfried Silbermann"
}