{
 "id": "909745",
 "text": "There were protests against the 2022 Russian invasion of Ukraine in many places. == Russia == 1,700 Russians in 53 Russian cities have been arrested arrested by police for protesting against the 2022 Russian invasion of Ukraine. On 24 February, Russia said to not make any \"unsanctioned\" protest. Authorities said that they would get arrested for protesting against the war. Over 60 Russian activists and journalist have been arrested. Dmitry Muratov, a Nobel Peace Prize winner said that the Novaya Gazeta newspaper would be in both Ukrainian and Russian. A lot of journalists signed a document saying that Ukraine wouldn't hurt Russia. The document also asked Russian citizens \"to say no to this war.\" Russian leader Alexei Navalny disliked the attack on Ukraine. He called the people who started the war \"bandits and thieves.\" On 24 February, Lev Ponomaryov made a petition to protest the invasion. It got 289,000 signatures by the end of the day. == Outside Russia == There have been many protests in Russia's embassies and consulates. These include: * Armenia * Azerbaijan * Belgium * Bulgaria * Bosnia and Herzegovina * Canada * Chile * Croatia * Czech Republic * Denmark * Estonia * Finland * France * Georgia * Greece * Hungary * Iceland * Ireland * Israel * Kazakhstan * Kosovo * Kyrgyzstan * Latvia * Lebanon * Lithuania * Mexico * Moldova * Montenegro * Netherlands * New Zealand * Norway. The former mayor of Sør-Varanger (municipality), gave back the friendship medal that he got from Putin. https://www.vg.no/nyheter/innenriks/i/L5gLx4/russlands-ambassade-beklager- retur-av-putin-medalje. VG.no. Retrieved March 4, 2022. \"... Rune Rafaelsen\" On 8 March, the local council where the Embassy of Russia is located, is scheduled to vote on a proposal to change the name of a stretch of road where the embassy is located - proposed name: \"Ukraine Street\".https://www.nettavisen.no/nyheter/russlands-ambassade-kan-fa-ny- adresse-i-ukrainas-gate/s/12-95-3424252608. Nettavisen.no * Poland * Portugal * Romania * Serbia * Slovakia * Spain * Taiwan * Thailand * United Kingdom * United States Protests were also done in Istanbul, Luxembourg City, Sydney, Tokyo and Vienna. In Valencia, Venezuela, many students held a protest. == Gallery == File:Stop Putin.jpg|Protest in Montreal, Canada File:Podpora suverénní Ukrajiny, protest proti ruské invazi 2022-02-25 Brno (3670).jpg|Protest at the Russian Consulate in Brno, Czech Republic File:2022-02-25 rass-Audincourt.webm|Protest in Audincourt, France File:Protests in Budapest.jpg|Protests at the Russian embassy in Budapest, Hungary File:Solidarizējoties ar ukraiņu tautu, pie Saeimas nama plīvo Ukrainas karogs 07.jpg|Protesters at the Russian embassy in Riga, Latvia File:Быдгашч. Акцыя салідарнасці з Украінай (2022-02-24) 1.jpg|Protest in Bydgoszcz, Poland File:Manifestacja solidarności z Ukrainą we Wrocławiu 3 (24.02.2022).jpg|Protest in Wrocław, Poland File:No to War in Ukraine - 008 (51903357411).jpg|Protest in London, UK File:25. februar demonstration imod Russiske invasion til Ukraine foran Folketinget (2).jpg|Protest in Copenhagen, Denmark File:Ukraine Rally (51901585971).jpg|Protest in New York City, U.S. File:Ukraine rally downtownRaleigh Feb 24 22-06 (51902308556).jpg|Protest in Raleigh, North Carolina, U.S. File:SUNY Binghamton supports Ukraine 20220225 172024.jpg|Student demonstration at the Binghamton University, U.S. File:MIT Rally for Ukraine outside Stata Center 20220228 01.jpg|Student rally at the Massachusetts Institute of Technology, U.S. == Related pages == *Anti-war movement *Reactions to the Russian invasion of Ukraine == References == Category:2022 protests Category:2022 in Russia Category:2022 in the United States Category:2022 in Canada Category:2022 in the United Kingdom Category:2022 in Asia Category:2022 Russian invasion of Ukraine Category:2022 in Germany Category:2022 in the Netherlands Category:2022 in France",
 "title": "Protests against the 2022 Russian invasion of Ukraine"
}