{
 "id": "909865",
 "text": "Spider-Man and His Amazing Friends is a 1981–1983 American animated television series that was produced by Marvel Productions. It is intended to be a crossover series connected to the 1981 Spider-Man series. The show stars already-established Marvel Comics characters Spider-Man and Iceman, plus an original character, Firestar. As a trio called the Spider-Friends, they fought against various villains of the Marvel Universe. ==Cast== * Hans Conried - Chameleon * Jerry Dexter - Sunfire * George DiCenzo - Captain America, Lance Macho, Kraven the Hunter (in \"The Crime of All Centuries\"), Cyclops (in \"The X-Men Adventure\") * Alan Dinehart - Boris, Sam Blockbuster, Helicopter Pilot (in \"Triumph of the Green Goblin\"), Norman Osborn's Pilot (in \"Triumph of the Green Goblin\"), Police Officer #2 (in \"Triumph of the Green Goblin\"), Thief #1 (in \"Triumph of the Green Goblin\"), Security Guard #1 (in \"The Crime of All Centuries\") * Walker Edmiston - Frankenstein's Monster (in \"The Transylvanian Connection\"), Kingpin (in \"Pawns of the Kingpin\") * Michael Evans - Professor Wells * Al Fann - Swarm * June Foray - Aunt May, Crime Computer, Judy * Kathy Garver - Firestar/Angelica Jones, Sally, Storm (in \"The X-Men Adventure\") * Dan Gilvezan - Spider-Man/Peter Parker, Zoltan Amadeus/The Arachnoid (in \"Attack of the Arachnoid\"), Biker Gang Leader (in \"The Crime of All Centuries\") * John Haymer - Skelton (in \"The Crime of All Centuries\"), Security Guard #2 (in \"The Crime of All Centuries\"), Black Knight (in \"Knights and Demons\") * Sally Julian - Mona Osborn, Jungle Girl (in \"Triumph of the Green Goblin\") * Annie Lockhart - Honey Dove, Storm (in \"A Firestar is Born\") * Keye Luke - Sunfire's Uncle Genju * Dennis Marks - Dr. Faustus, Green Goblin/Norman Osborn (in \"Triumph of the Green Goblin\"), Police Officer #1 (in \"Triumph of the Green Goblin\"), Thief #2 (in \"Triumph of the Green Goblin\"), Cyberiad/Nathan Price (in \"The X-Men Adventure\") * Alan Melvin - Electro * Shepard Menkin - Doctor Doom * John Stephenson - Colossus, Eric the Viking, Loki, Modred the Mystic, Shocker, Surtur, Thunderbird, Ymir * Janet Waldo - Shanna the She-Devil, Zerona * Frank Welker - Iceman/Bobby Drake, Flash Thompson, Matt Murdock, Mr. Jones, Ms. Lion, Uncle Ben, Videoman/Francis Byte, Wolf-Thing (in \"The Transylvanian Connection\") * William Woodson - Doctor Strange, Namor, J. Jonah Jameson * Alan Young - Mr. Frump === Notable guest stars === * Michael Ansara - Hiawatha Smith (in \"The Quest of the Red Skull\") * Marlene Aragon - Lightwave * Michael Bell - Ariel and Bartow's father (in \"Spidey Meets the Girl of Tomorrow\"), Doctor Octopus (in \"Spidey Meets the Girl of Tomorrow\") * Bob Bergen - Bartow (in \"Spidey Meets the Girl of Tomorrow\") * Susan Blu - Louise (in \"The Education of a Superhero\"), Monica (in \"Attack of the Arachnoid\") * William Callaway - Angel (in \"A Fire-Star is Born\"), Wolverine (in \"A Firestar is Born\") * Cathy Cavadini - Ariel (in \"Spidey Meets the Girl of Tomorrow\") * Christopher Collins - Sandman (in \"Spider-Man Unmasked!\"), Beetle (in \"The Origin of the Spider-Friends\") * Peter Cullen - Hulk/Dr. Bruce Banner (in \"Spidey Goes Hollywood\"), Mysterio (in \"Spidey Goes Hollywood\"), Red Skull (in \"The Quest of the Red Skull\") * Stanley Jones - Professor X, Cyclops (in \"A Firestar is Born\"), Dean Wilmer (in \"A Firestar is Born\"), Dracula (in \"The Transylvanian Connection\"), Nightcrawler (in \"The X-Men Adventure\") * William Marshall - Juggernaut (in \"A Firestar is Born\"), Tony Stark (in \"The Origin of the Spider-Friends\") * Noelle North - Sprite/Kitty Pryde * Vic Perrin - Thor (in \"The Vengeance of Loki!\"), Zerona's Soldier (in \"The Vengeance of Loki!\"), Black Knight (in \"Knights and Demons\") * Neil Ross - Scorpion (in \"Attack of the Arachnoid\") * Michael Rye - Magneto (in \"The Prison Plot\") * Marilyn Schreffler - Bonnie (in \"A Firestar is Born\") ==References== Category:1980s American animated television series Category:1981 television series debuts Category:1983 American television series endings",
 "title": "Spider-Man and His Amazing Friends"
}