{
 "id": "909881",
 "text": "In February and March 2014, Russia invaded and annexed (took over) the Crimean Peninsula from Ukraine. This event took place after the Revolution of Dignity. It is part of the wider Russo-Ukrainian conflict. ==Beginning== On 22–23 February 2014, Russian President Vladimir Putin met with security service chiefs to discuss how to save the deposed Ukrainian president, Viktor Yanukovych. At the end of the meeting, Putin remarked that \"we must start working on returning Crimea to Russia\". On 23 February, pro-Russian demonstrations were held in the Crimean city of Sevastopol. On 27 February, masked Russian soldiers in unmarked green military uniforms took over the Supreme Council (parliament) of Crimea and captured strategic sites across Crimea, which led to the installation of the pro-Russian Sergey Aksyonov government in Crimea. This government held the Crimean status referendum, and declared Crimea's independence on 16 March 2014. Russia formally incorporated Crimea as two Russian federal subjects—the Republic of Crimea and the federal city of Sevastopol on 18 March 2014. After the event, Russia deployed more military on the peninsula and came with threats about using nuclear weapons so that Russia could keep its new power in Crimea (or solidify the new status quo on the ground). ==Responses== Ukraine and many other countries condemned the annexation and consider it to be a violation of international law, as well as Russian-signed agreements safeguarding the territorial integrity of Ukraine, including the 1991 Belavezha Accords that established the Commonwealth of Independent States, the 1975 Helsinki Accords, the 1994 Budapest Memorandum on Security Assurances and the 1997 Treaty on friendship, cooperation and partnership between the Russian Federation and Ukraine. It led to the other members of the then G8 suspending Russia from the group and then introducing a first round of sanctions against the country. The United Nations General Assembly also rejected the referendum and annexation, adopting a resolution affirming the \"territorial integrity of Ukraine within its internationally recognised borders\". The UN resolution also \"underscores that the referendum [is not valid, and] cannot form the basis for any alteration of the status of [Crimea]\" and called upon all states and international organizations not to recognize or to imply the recognition of Russia's annexation. In 2016, the UN General Assembly reaffirmed non-recognition of the annexation and condemned \"the temporary occupation of part of the territory of Ukraine—the Autonomous Republic of Crimea and the city of Sevastopol\". The Russian government opposes the \"annexation\" label, with Putin defending the referendum as complying with the principle of self-determination of peoples. == Names == The conflict has many names. In Russia, it is known as *accession of Crimea to the Russian Federation (), *the return of Crimea () and the reunification of Crimea. In Ukraine, the names are also known as the *Temporary occupation of the Autonomous Republic of Crimea and Sevastopol by Russia (), *the illegal occupation of the Autonomous Republic of Crimea, the fall of Crimea and the invasion of Crimea. ==Notes== ==References== Category:2014 pro-Russian unrest in Ukraine Category:Crimea Category:February 2014 events Category:March 2014 events",
 "title": "Annexation of Crimea by the Russian Federation"
}