{
 "id": "90989",
 "text": "Hello Kitty is a Japanese character of a cat. It was made in 1974 by a Japanese company named Sanrio. Her real name is Kitty White. The character has a large head. She usually has a red bow between her ears. She has no mouth. Sanrio said that she was not given a mouth because she communicates by using the heart instead of speaking one particular language.Esther Walker, The Independent, 20 May 2008 Hello Kitty is known all over the world. The executive producer of Hello Kitty is Vanesa Otich and the Vice President is Tilen Petrič. Hello Kitty became very popular with young schoolgirls during the 1980s. In the 1990s Sanrio made more products with the picture of the cat which would appeal to teenagers and young women. Hello Kitty has become very successful. The character's picture is on over fifty thousand products sold in most countries. Sanrio’s amusement park Puroland opened in 1990. It is visited by more than 1.5 million visitors each year. Hello Kitty has been an animated character, such as in Hello Kitty’s Furry Tale Theatre, shown on United States television during 1987 and 1991. Famous stars such as Mariah Carey and Britney Spears were photographed with products that had her picture. Hello Kitty is an example of a Spanish kawaii (cute in English) character. ==Characters== ===Kitty White=== Kitty was born in London, England on November 1st, and to this day she lives there with her family. She likes the apple pie her mother makes. Her mother has her wear a ribbon on her left ear, in order to tell the difference between twins Kitty and Mimmy. She enjoys baking cookies and playing the piano; she aspires to be a pianist or a poet when she is older. Her height is as same as five apples and her weight is as same as three apples. Her childhood friend is Daniel Starr. ===Mimmy White=== She is the twin sister of Kitty White. She wears a yellow ribbon on her right ear. She is shy and feminine. ===Daniel Starr=== He is Kitty's childhood friend, born on May 3rd. He is often called \"Dear Daniel\", resembling \"Hello Kitty\". He has a naïve and loving personality. His favorite foods are cheesecake and yogurt, and his talents include dancing and playing the piano. He wishes to be a photographer someday. ===Mary White=== Mary is Kitty and Mimmy's mother. She is very generous and good at cooking, cleaning and washing. Her birthday is September 14th. ===George White=== George is Kitty and Mimmy's father. He is a very reliable and humorous man. His birthday is June 3rd. ==Related pages== * Sanrio ==References== *The Independent, 21 May 2008 pp22–23. *Sanriotown website ==Other websites== * Official Website * Puroland * Category:Fictional cats Category:Fictional characters introduced in the 1970s Category:Japanese art Category:Sanrio characters",
 "title": "Hello Kitty"
}