{
 "id": "909859",
 "text": "Mirai Sentai Timeranger is a Japanese television series. It is the 24th series on Toei's Super Sentai series. joining Timeranger alongside Kamen Rider Kuuga. Its footage was used in Power Rangers Time Force. ==Plot== In the 30th century, time travel becomes illegal after a Temporal paradox crisis. The Time Database Bureau (TDB) is established to watch for and stop time crimes. Four new enlistee Cadet of the TDB are tricked by Don Dolnero and his gang into letting them time-travel to the year 2000 to commit various crimes and, to protect history, to four cadets pursue them. They encounter a severe problem: the Timeranger program requires five members for the first operation. They coerce a present-day Martial arts, Tatsuya Asami, to join them, and they become the Timerangers. Tatsuya rents a building for them to live in, and they start a small odd-jobs business called Tomorrow Research to financially support themselves. Over time, the four cadets begin to realize that their presence would inevitably change the Future in the form of the City Guardians, a Police under the employment of the Asami Corporation to protect the city from the Londerz. The City Guardians form a tenuous relationship with the Timerangers, especially when Tatsuya's college acquaintance Naoto becomes Time Fire and later also becomes the City Guardian's captain. ==Characters== ===Timeranger=== Actor Name Rangers Masaru Nagai Tatsuya Asami Time Red Miku Katsumura Yuuri Time Pink Yuji Kido Ayase Time Blue Masahiro Kuranuki Sion Time Green Shuhei Izumi Domon Time Yellow Shinji Kasahara Naoto Takizawa Time Fire ==Cast== * Tatsuya Asami / Time Red, Ranger Captain: Ryuuya: Masaru Nagai * Yuuri / Time Pink: Miku Katsumura * Ayase / Time Blue: Yūji Kido * Sion / Time Green: Masahiro Kuranuki * Domon / Time Yellow: Shūhei Izumi * Naoto Takizawa / Time Fire: Shinji Kasahara * Wataru Asami: Fujita Okamoto * Honami Moriyama: Tamao Yoshimura * Narration: Yukitoshi Hori ==Songs== ; Opening theme * \"Jikū ~Mirai Sentai Timeranger~\" ** Lyrics: Yoshie Isogai ** Composition & Arrangement: Kōichirō Kameyama ** Artist: Kumi Sasaki ; Ending theme * \"Toki no Katana e\" (\"Into Time\") ** Lyrics: Shōichi Yoshi ** Composition & Arrangement: Kōichirō Kameyama ** Artist: Nat's * \"Beyond All Space and Time\" ** Artist: Kumi Sasaki ** Timeranger vs. GoGo Fives ending theme. An English version of the series opening theme. * \"Miracle Xmas\" ** Lyrics: Kiyomi Katō ** Composition & Arrangement: Kōichirō Kameyama ** Artist: T.R. Futures (Masaru Nagai (Tatsuya), Miku Katsumura (Yuuri), Yuuji Kido (Ayase), Shuhei Izumi (Domon), Masahiro Kuranuki (Sion)) ** Episode 44's ending theme * \"Eternal Wind\" ** Lyrics: Takako Shingetsu ** Composition & Arrangement: Kōtarō Nakagawa ** Artist: Naritaka Takayama ** Episode 45's ending theme * \"Where the Future\" ** Lyrics: Yoshie Isogai ** Composition, Arrangement & Performance: Motoyoshi Iwasaki ** Final episode's ending theme * \"Don't Stop Your Story!\" ** Lyrics: Yukari Yamato ** Composition & Arrangement: Taku Iwasaki ** Artist: T.R. Futures ** Special Compilation's ending theme Category:Super Sentai series Category:2000 television series debuts Category:2001 television series endings",
 "title": "Mirai Sentai Timeranger"
}