{
 "id": "909849",
 "text": "Kyuukyuu Sentai GoGoFive is a Japanese television series. It is the 23rd series on Toei's Super Sentai series. Its footage was used in Power Rangers Lightspeed Rescue. ==Synopsis== Grandiene has been waiting for the moment she can mainfest on Earth on the day when the planets are in the alignment of the Grand Cross, sending her children to make the preparations while making Earth into a realm of darkness for her. But Professor Mondo Tatsumi of the Tatsumi Disaster Prevention Research Center, while falling to convince his peers of this event despite his eminence, left his family to secretly develop the Rescue System to counter the threat by the Psyma Family. When the Psyma commence their attack in 1999, month before the Grand Cross is to occur, the Tatsumi siblings find themselves recruited by the estranged father to fight the demons as the GoGoFive team. ==Characters== ===GoGoFive / Tatsumi Family=== Actor Name Rangers Mecha Ryuichiro Nishioka Matoi Tatsumi Go Red Red Ladder Masashi Taniguchi Nagare Tatsumi Go Blue Blue Thrower Atsushi Harada Shou Tatsumi Go Green Green Hover Kenji Shibata Daimon Tatsumi Go Yellow Yellow Armor Kayoko Shibata Matsuri Matsumi Go Pink Pink Aider ==Cast== * Matoi Tatsumi / Go Red: Ryuichiro Nishioka * Nagare Tatsumi / Go Blue: Masashi Taniguchi * Shou Tatsumi / Go Green: Atsushi Harada * Daimon Tatsumi / Go Yellow: Kenji Shibata * Matsuri Tatsumi / Go Pink: Kayoko Shibata * Mondo Tatsumi: Mike Maki * Kyouko Hayase: Yūko Miyamura * Ritsuko Tatsumi: Kyoko Yoshizawa * Kenji Inui: Takushi Iwao ==Songs== ; Opening theme * \"Kyuukyuu Sentai GoGoFive\" ** Lyrics: Nagae Kuwabara ** Composition & Arrangement: Toshiyuki Watanabe ** Artist: Shinichi Ishihara ; Ending theme * \"Kono Hoshi o, Kono Mochi o\" (\"This Planet, This City\") ** Lyrics: Shoko Fujibayashi ** Composition: Shinsuke Kazato ** Arrangement: Toshihiko Sahashi ** Artist: Naritaka Takayama Category:Super Sentai series Category:1999 television series debuts Category:2000 television series endings",
 "title": "Kyuukyuu Sentai GoGoFive"
}