{
 "id": "909992",
 "text": "Constantine XI Dragases Palaiologos or Dragaš Palaeologus (, Kōnstantînos Dragásēs Palaiológos; 8 February 1405 – 29 May 1453) was the last Byzantine emperor, started in 1449 until he died in the Fall of Constantinople. His death marked the end of the Byzantine Empire (Eastern Roman Empire) and of the Roman Empire, founded by Augustus almost 1,500 years earlier. ==History== Constantine was the fourth son of Emperor Manuel II Palaiologos and Helena Dragaš, the daughter of Serbian ruler Konstantin Dejanović. His early life is unknown, but from the 1420s onward, he is shown to be a skilled general. Based on his career, Constantine must have been a soldier. He was trusted and liked by his older brother, Emperor John VIII Palaiologos. Constantine and John fended off an attack on the Morea (the Peloponnese) by Carlo I Tocco, ruler of Epirus. In 1428 Constantine became Despot of the Morea and ruled the province together with his older brother Theodore and his younger brother Thomas. Together, they ruled almost the entire Peloponnese for the first time since the Fourth Crusade more than two hundred years before. They rebuilt the ancient Hexamilion wall, which defended the peninsula from outside attacks. Although ultimately unsuccessful, Constantine personally led a campaign into Central Greece and Thessaly in 1444–1446, attempting to extend Byzantine rule into Greece. In 1448, John VIII died without children, and as his favored successor, Constantine was proclaimed emperor on 6 January 1449. Constantine's brief reign would see the emperor grapple with three primary concerns. First, there was the issue of an heir, as Constantine was also childless. Despite attempts by Constantine's friend and confidant George Sphrantzes to find him a wife, Constantine died unmarried. The second concern was the religious disunity within what little remained of his empire. Constantine and his predecessor John VIII both believed a union between the Orthodox and Catholic Churches was needed to secure military aid from Catholic Europe, but most of the Byzantine people opposed the idea. Finally, the most important concern was the growing Ottoman Empire, which by 1449 completely surrounded Constantinople. In April 1453, the Ottoman Sultan Mehmed II laid siege to Constantinople with an army perhaps numbering as many as 80,000 men. Even though the city's defenders may have had less than a tenth of the sultan's army, Constantine considered the idea of abandoning Constantinople unthinkable. The emperor stayed to defend the city and on 29 May, Constantinople fell. Constantine died the same day. Although no reliable eyewitness accounts of his death survived, most historical accounts agree that the emperor led a last charge against the Ottomans and died fighting. Constantine was the last Christian ruler of Constantinople. He became known in later Greek folklore as the Marble Emperor (, romanized: Marmaromenos Vasileus, lit. 'Emperor/King turned into Marble'), reflecting a popular legend which endured for centuries that Constantine had not actually died, but had been rescued by an angel and turned into marble, hidden beneath the Golden Gate of Constantinople awaiting a call from God to be restored to life and reconquer both the city and the old empire. After he died, the monarchy actually did not finish until 1512, and the last person to hold the title Roman Emperor was Francis I as Holy Roman Emperor. Category:1405 births Category:1453 deaths Category:Byzantine emperors",
 "title": "Constantine XI Palaiologos"
}