{
 "id": "910048",
 "text": "Pokémon Scarlet and Pokémon Violet are Pokémon video games. They are part of the ninth generation of the Pokémon game series. They released on the Nintendo Switch on November 18, 2022. == Gameplay == Pokémon Scarlet and Violet has the same gameplay of other Pokémon video games. People can catch creatures called Pokémon. Pokémon can be used in fights. In the games, Pokémon can do some fights without being told what to do. This is called \"Let's Go\". Pokémon can also be given to other people. There are many new Pokémon in the games. The games have an open world. There are cities in the open world. There is also wilderness. People can choose three stories to complete in the games. The stories are called Path of Legends, Victory Road, and Starfall Street. People can play in the world and do the stories with up to three other people. === World === The games take place in the Paldea region. The Paldea region is based off of the Iberian Peninsula, which is made from mostly Spain and Portugal. In the middle of Paldea is a crater. Inside the crater is a place called Area Zero. === Story === In the games, people attend a school called the Naranja or Uva Academy. The school has a \"Treasure Hunt\". In the Treasure Hunt, people are told to explore the region and find things they treasure. The protagonist has three friends that tell them to do something different. In Victory Road, they fight eight Pokémon Gyms. Then, they can fight the strongest trainers. If they win, they can become a Champion. Then, they can fight their friend Nemona. In Starfall Street, they want to stop Team Star. Team Star has caused school bullying. They can win against the Team Star bosses. This makes the bosses leave the group. When they do, their friend Penny says she is the person who made Team Star. She also wants to stop Team Star. But the school director lets Team Star continue. In Path of Legends, Arven helps them battle Titan Pokémon. The Titan Pokémon guard Herba Mystica. Arven wants the Herba Mystica to heal his pet Pokémon dog. After completing all three stories, the protagonist goes to Area Zero with Arven, Nemona, and Penny. They meet the professor, who says they are an AI substitute for the real professor because the real professor died. The protagonist fights them to break a time machine to the past or future. They win the fight. == Notes == ==References== Category:2022 video games Category:Pokémon RPGs Category:Game Freak games Category:Nintendo Switch-only games Category:Open-world video games Category:Video game sequels Category:Video games about time travel",
 "title": "Pokémon Scarlet and Violet"
}