{
 "id": "910046",
 "text": "Hazbin Hotel is an American adult animated musical series created by Vivienne \"VivziePop\" Medrano. Its pilot was released to YouTube on October 28, 2019. The series focuses on Charlie Morningstar, the daughter of Lucifer and princess of Hell, with an almost impossible goal: to help the demons of Hell learn how to be better and get into Heaven. The series was picked up by the independent film company A24. The show's first season came out on January 19, 2024 on Prime Video, and a second season is being worked on. == Premise == Charlie Morningstar, the princess of Hell, opens a hotel called the \"Happy Hotel\", where she wants to teach demons of Hell how to be better people, in the hopes of getting them into Heaven. Due to overpopulation, Hell goes through an annual purge once a year, where angels descend from Heaven and kill demons. Charlie finds this upsetting, and wants to find a more peaceful solution to the overpopulation problem. With the help of her manager and girlfriend, Vaggie, and their first customer, pornographic film actor Angel Dust, she tries to make her dream come true. Her plan gets the attention of the powerful \"Radio Demon\", Alastor. He thinks her idea is impossible, but he wants to help Charlie run the hotel because he thinks it's funny. Alastor renames the Happy Hotel the Hazbin Hotel at the end of the pilot. == Characters == * Charlie Morningstar (voiced by Erika Henningsen), the main character of the series. She is the princess of Hell and the daughter of Lucifer and Lilith. She is the founder of the Hazbin Hotel. She thinks that all demons can be better people, even though most of them don't believe her. * Vaggie (voiced by Stephanie Beatriz), Charlie's girlfriend and the manager of the Hazbin Hotel. She has a temper, but tries her hardest to keep calm when running the hotel. * Angel Dust (voiced by Blake Roman), an adult movie star and the hotel's first patient. He often gets into trouble and disobeys the hotel rules. * Alastor (voiced by Amir Talai), one of the most powerful demons in Hell. He is Charlie's business partner, choosing to work at the hotel because he finds it funny. * Husk (voiced by Keith David), an angry bartender at the hotel. He is an alcoholic, and he loves gambling. * Niffty (voiced by Kimiko Glenn), a cleaner at the hotel. She is hyper and obsessed with men. == References == == Other websites == * * Category:2019 American television series debuts Category:2010s American comedy television series Category:2020s American comedy television series Category:2010s satirical television series Category:2020s satirical television series Category:2010s LGBT television series Category:2020s LGBT television series Category:2024 American television series debuts",
 "title": "Hazbin Hotel"
}