{
 "id": "910132",
 "text": "The Even (Even: эвэсэл, Russian: эвены) people are a native population of Siberia and the Russian Far East. They are sometimes called Ewens or Lamuts. ==Language== Evens are Tungusic people. They speak their own language called Even. The Even language was unwritten until the Russians created a written language for them, using the Cyrillic alphabet. Some Evens also speak Yakut or Sakha, and live in the Sakha Republic. Most Evens live in parts of the Magadan Oblast and Kamchatka Krai. They share many things in common with the Evenki people. Evens are reindeer herders. They are nomads, which means they move from one place to another. ==Contact with Russians== During the 17th century, Russians made contact with the Even people. They introduced diseases to the Evens, such as smallpox and influenza. Russians also made Evens pay the yasak, which meant they had to pay taxes to the Russian government with reindeer furs. Because of the new diseases and the reindeer population decreasing, the population of the Even people went down. == Religion == Evens' religion is a mixture of shamanism and Russian Orthodoxy. Shamanism is a belief that worships animals and nature. There are shamans, people who communicate with spirits. An Even shaman is called a haman. Evens believe in different kinds of spirits. One of them is a fire spirit called togh-muranni, which is very powerful. Ibdiril are spirits that help the haman. They can look like different people and animals. == Culture == Reindeer are very important to the Even people. They were traditionally sacrificed and used in special ceremonies. Reindeer were used for transportation, along with dogs. One group of Evens living on the Pacific coast didn't have as many reindeer, and depended on fish instead. Evens lived in clans. Even people had a custom called nimat, which meant that all of the fish and animals caught were shared with the whole clan. There are many kinds of folklore in Even culture. Nemkan are about people and animals. Teleng are long stories that are sung, often about warriors and heroes. Ike are short songs, and nenuken are riddles. == References == Category:Ethnic groups in Russia Category:Nomadic people",
 "title": "Evens"
}