{
 "id": "910287",
 "text": "Bachchhan Paandey is a 2022 Indian Hindi-language action comedy movie. It was directed by Farhad Samji . The movie was produced by Sajid Nadiadwala. It stars Akshay Kumar, Kriti Sanon, Jacqueline Fernandez and Arshad Warsi. The movie is a remake of the 2014 Tamil movie Jigarthanda. That movie was based on the 2006 South Korean movie A Dirty Carnival. Bachhan Paandey was released in theaters on 18 March 2022. ==Plot== Myra Devekar (Kriti Sanon), a budding director is given a task by a producer to come up with a gripping and violent gangster story to produce a film. To satisfy the producer's commercial outlook and her hunger for making a realistic flick, she decides to study the life of a real-life gangster for the script. Her extensive research leads to menacing one-eyed Bachchhan Paandey (Akshay Kumar) of Baghwa, a ruthless gangster surrounded by quirky yet scary henchmen. Myra travels to Baghwa where she meets her best friend Vishu (Arshad Warsi) and tells him about her film idea on Bachchhan. Vishu gets furious and asks her to leave but is later persuaded to help her with the film. Both Vishu and Myra start to target Bachchhan's henchmen in an effort to get closer to him. Virgin (Prateik Babbar), one of the goons, tells them about his former girlfriend Sophie (Jacqueline Fernandez), who was killed by the former. Vishu and Myra plant a microphone in Virgin's mobile phone to eavesdrop on his conversations with Bachchhan. Later, it is revealed that Virgin was betraying Bachchhan for another criminal Rana Lohia but is caught and killed by him. Vishu and Myra listen to the murder through the microphone, but are caught by Bachchhan's gang. Bachchhan sets out to kill Vishu and Myra, but agrees to spare them when he discovers that Myra is directing a gangster movie, under the condition that he plays the protagonist of the film. Myra initially doesn't accept, but Bachchhan kidnaps her producer, and Myra is forced to listen to his backstory to develop the script. In a flashback, Bachchhan works for a corrupt politician Laalji Bhagat (Mohan Agashe). After a fallout, the politician gets Bachchhan's girlfriend Sophie killed. In retaliation, Bachchhan murders Bhagat in the hospital where he was admitted for a wound. Bachchhan and his goons don't know how to do acting, so they learn through Bhavesh Bhoplo, an acting coach. Bhavesh hits, threatens, and humiliates Paandey and his henchmen, much to their chagrin. Nevertheless, Myra dissuades them from harming Bhavesh for the sake of the movie. Bachchan and Myra start having feeling for One another and Bachchan starts loving Myra. The film is eventually completed and released in the theatres. Bachchan and his goons initially get excited and promote the film named \"BP,\" thinking it to be the gritty gangster drama that it was marketed as. To their horror, the film turns out to be a comedy that portrays them negatively. On the other hand, Myra's film is proved to be a blockbuster and gets praise from her media and her director who used to often criticize her a lot. Bachchan and his goons decide to kill her for making his fear in people vanish but later on, refrain from him as Bachchan gets evolved by heart and narrates her story that his ears were ringing to hear from her mother calling him and also his fans get impressed by him. Bachchan, later on, becomes a star, and Kaandi, Bachchhan's close goon, gives up his habit of watching porn films. Vishu gets a lead role in an unnamed film. Bhavesh Bhoplo becomes the best acting teacher and Bachchan gets recognized as a best comedy actor with Myra as best director. == Cast == * Akshay Kumar as Gangster Bachchhan Paandey, Sophie’s Boyfriend and Myra’s Love Interest * Kriti Sanon as Myra Devekar, Bachchhan's Love Interest and Director * Jacqueline Fernandez as Sophie, Bachchhan's Late Girlfriend * Arshad Warsi as Vishwakant Mhatre (Vishu), Myra's Best Friend * Pankaj Tripathi as Guruji Bhavesh Bhoplo (extended cameo appearance) * Prateik Babbar as Virgin * Sanjay Mishra as Bufferiya Chacha * Abhimanyu Singh as Pendulum * Snehal Dabi as Jumbo * Saharsh Kumar Shukla as Kaandi * Ashwin Mushran as Producer Rakesh Verma * Santosh Shukla as SP Suryakant Mishra * Sajid Nadiadwala as Film Director * Ahmed Khan as Film Director * Aroosa Khan as Pinky * Mohan Agashe as Laalji Bhagat * Seema Biswas as Mrs. Paandey, Bachchhan's mother * Trishna Singh as Smita (Virgin's wife) * Surendra Rajan as Mr. Devekar, Myra's father * Dolly Thakore as Crime Reporter * Nasir Abdullah as Myra's director * Gaurav Chopra as Bheema * Netram Tiwari as Bullet * Sunil Pendurkar as Qadri * Arun Khedwal as Guleria * Vipul Roy as Anchor ==References== Category:2022 action movies Category:2020s Indian movies Category:2022 comedy movies Category:2020s action comedy movies",
 "title": "Bachhan Paandey"
}