{
 "id": "91031",
 "text": "German automobile number plates (Kfz-Kennzeichen) show the place where the automobile carrying them is registered. When a person changes their main home in Germany, or buys a new automobile, they must buy new number plates. Number plates can be bought which are valid all year round or between 2 to 11 months within any 12 months. This allows changing between summer and winter automobiles, such as a convertible and a sedan/saloon without having the time and money wasted for de- and re-registering. ==Format== The present number plate format, used since 1994, uses black print on a white background and first provides information about the country where the automobile is registered within the European Union. German licence plates show a D (for Deutschland=Germany) on the blue strip on the left, which shows the European Union's flag, 12 golden stars in a circle on blue ground. After that, there are between one and three letters for the city or region where the automobile is registered, such as B for Berlin. These units usually coincide with the German districts, in few cases an urban district and the surrounding district share the same letter code. Usually if an urban district and a rural district share the code, the number of the following letters is different. For example, the urban district (Straubing) SR has one letter after the code (SR - A 123). The surrounding district Straubing-Bogen has two letters (SR - AB 123) after the code. It depends on the number of registered automobiles (or citizens) whether the City or the district has two letters, because there are more possibilities with two letters, so the part with more citizens usually has two letters. For example, the urban district Regensburg has more citizens than the rural district Regensburg, so the city has two letters after the code R. The number of letters in the city/region code usually shows the size and location of the district: the largest German cities generally only have one letter codes (B=Berlin, M=München (Munich), K=Köln (Cologne), F=Frankfurt am Main), most other districts in Germany have two or three letter codes. Districts in eastern Germany usually have more letters, for two reasons: * As they only started using the modern system in 1990 after German reunification, many of the possible shorter combinations had already been used up in western Germany. Thus, big east German cities like Dresden have two letter codes (DD) instead of one (D) which was already in use for Düsseldorf. L is, however, now in use for Leipzig because in West Germany it was used for a regional area of Hesse (Lahn) apparently in order to keep the code available for Leipzig as there were no suitably large cities in W. Germany whose names began with the letter L. * Fewer people live in eastern Germany, so the number of automobiles registered is smaller and hence the use of three letter codes. This is only a rule of thumb, there are a number of exceptions e.g. Germany's second largest city Hamburg (HH, Hansestadt Hamburg, because of its historical membership in the Hanseatic League) or the west German district Ammerland (WST, Westerstede is the capital of the district). The reason for this scheme is however not to display size or location, but simply to have enough combinations available within the maximum length of eight characters per plate. After the location name there are the emission test and vehicle safety test stickers (see below), followed by one or two letters and one to four numbers. These letters and numbers can be chosen by the vehicle owner or if they prefer, random ones can be allocated by the licensing office. The total quantity of letters and numbers on the plate is never higher than eight. One letter with low numbers are normally reserved for motorcycle use since the plate space of these vehicles is smaller. ===Prohibited combinations=== Various combinations that could be considered politically unacceptable—mainly due to implications relating to Nazi Germany—are disallowed or otherwise avoided. The district Sächsische Schweiz-Osterzgebirge uses the name of its main town, Pirna, in its code PIR, to avoid the use of SS, the name of the nazi group; similarly SA is also unused. This is why automobiles for the government and parliament in Saxony-Anhalt are registered with LSA (Land Sachsen Anhalt). In 2004 in Nuremberg, an automobile owner was refused a number plate beginning N-PD because of the connection to the political party, the NPD. Banned combinations include the Nazi abbreviations HJ (Hitlerjugend, Hitler Youth), NS (Nationalsozialismus, National Socialism), SA (Sturmabteilung), SS (Schutzstaffel) and KZ (Konzentrationslager, concentration camp). Some registration offices have overlooked this rule by mistake, however; there are a few automobiles registered carrying prohibited codes, such as B-SS 12. Some counties also allow these combinations if they are the initials of the owner (e.g., Norbert Schmidt might be able to get XX-NS 1234), but in this case, if the automobile is sold and re-registered in the same county by the new owner, the number can be changed (otherwise the number stays with the automobile until it registered in a different area). ===Special codes=== Certain types of vehicle bear special codes: * Classic cars (known in German by the pseudo- English expression Oldtimer) can get an H (historisch, historic) at the end of the plate, such as K-AA 100H in order to preserve the so called \"vehicle of cultural value\" (kraftfahrtechnisches Kulturgut\"). It includes also a flat tax of appr. €300 per year. The requirements for a vehicle for an H-Plate are: **minimum age of the vehicle of 30 years from first registering **must be in original condition and well maintained. Some features such as safety belts or a catalytic converter which have been added are accepted and are not in conflict with the \"original condition\" rule * Automobiles with seasonal number plates have two numbers at the end of the plate indicating the months between which they are registered to drive, with the licence being valid from the start of the upper month until the end of the lower month. This results in lower fees for de- and re-registering automobiles, as well lower insurance premiums. * Official cars such as police, fire fighting and municipality vehicles do not carry a letter after the sticker, such as M-1234. :These include: ** vehicles of the district government: 1-199, 1000-1999, 10000-19999 ** vehicles of the local government (for example: fire brigade): 200-299, 2000-2999, 20000-29999, 300-399 ** police: 3000-3999, 7000-7999, 30000-39999, 70000-79999 ** disaster relief (mostly changed \"THW\", see below): 8000-8999, 80000-89999 ** consular corps: 900-999, 9000-9999. :However the registration law has changed in 2006 so that in after March 2007 official vehicles will get standard number plates. The German Federal President's license plate is 0-1, the Chancellor's 0-2, the Foreign Secretary's 0-3. The plate of the President of the Bundestag is an exception: it shows 1-1. This is to show that the Bundestag's President is not part of the government but still ranks higher in importance than the Chancellor. These vehicles are tax-exempt and need not to be insured since the German government acts as insurer. == Other websites == *More information about German automboile number plates and their history * List of currently issued registration codes (German Wikipedia) * List of all ever issued registration codes of the current registration system (German Wikipedia) Category:Transport in Germany Germany Category:Law of Germany",
 "title": "Vehicle registration plates of Germany"
}