{
 "id": "91068",
 "text": "The Chi-Chi earthquake (later also known as the Jiji earthquake or the great earthquake of September 21), was an earthquake in central Taiwan. The earthquake happened on September 21, 1999 at 1:47 am local time (September 20 17:47 GMT). It measured 7.3 on the Richter scale. The epicentre of the earthquake was at in Chichi Township of Nantou County, hovering around the 12.5 km mark west of the Sun Moon Lake. The depth of the epicenter was 7.0 km. ==Damages== The earthquake caused much damage, according to the National Fire Agency, Ministry of the Interior R.O.C. This damage included: * 2,415 people died or were never found * 11,305 people were badly hurt * NT$300 billion (US$10 billion) worth of damage * 51,711 buildings were completely destroyed * 53,768 buildings were badly damaged The earthquake continued to shake Taiwan throughout the night. People tell stories about a house that was not destroyed but moved by the earthquake from one county to another. The story says that because of this, the owners of the house had to change their address. The earthquake killed many people. ==Chelungpu fault== The epicenter of the earthquake was Chichi Township. The 921 Earthquake happened along the Chelungpu fault line in western part of the island of Taiwan. The fault is located along the foothills of the Central Mountains in Nantou and Taichung counties. Some sections of land near the fault were changed in elevation by as much as 7 meters (23 feet). Near the northern end of the fault line, a 7-meter tall waterfall was created by the earthquake. In the middle-western part of the island, bridges were destroyed. This stopped traffic for weeks. In Wufeng, a village in southern Taichung County, the damage was very bad. The village's Guangfu High School was located on the fault line. It was badly damaged by the quake. Today the high school is the site of the National Museum of Natural Science's 921 Earthquake Museum of Taiwan. Landslides were created which in turn caused impromptu formation of lakes. ==Notes== ==References== ==Other websites== *National Center for Research on Earthquake Engineering (NCREE) Category:1999 disasters Category:1999 in Asia Category:Earthquakes in Taiwan Category:Earthquakes in the 1990s Category:20th century in Taiwan Category:September events",
 "title": "1999 Jiji earthquake"
}