{
 "id": "910869",
 "text": "John Fire Lame Deer (Lakota: Tȟáȟča Hušté; March 17, 1903 – December 14, 1976), also known as Lame Deer, John Fire and John (Fire) Lame Deer, was a Lakota medicine man. He was from the Miniconjou band of the Lakota tribe. His grandfather was the Mincionjou leader Lame Deer, and his son was Archie Fire Lame Deer. When he was sixteen, he had his first hanblechia, or \"vision- seeking\", a Lakota ceremony that is a quest for a vision. Lame Deer named himself after his grandfather after seeing him in a vision. ==Birth== Lame Deer was born on the Rosebud Indian Reservation in South Dakota. His father was Silas Fire Let-Them-Have-Enough. His mother was Sally Red Blanket. He lived with his grandparents until he was 6 or 7, and then he was placed in a day school until he was fourteen. He was sent to a boarding school run by the U.S. Bureau of Indian Affairs. The boarding school tried to assimilate Native Americans to be more like white people. Lame Deer's mother died of tuberculosis in 1920. His father then moved north to the Standing Rock Indian Reservation. He left Lame Deer with land and livestock, which Lame Deer quickly sold. ==Youth== Lame Deer's young days were rough and wild. He worked in rodeos as a rider and as a rodeo clown. He spent time as a heyoka, a sacred clown. He also joined the Native American Church. He was a tribal policeman for a short time. He drank alcohol, gambled, and stole cars. He learned English in saloons, prison, and the U.S. Army. He made his home at the Pine Ridge Reservation. Lame Deer became known to the Lakota and the American public. He performed pipe ceremonies. He went to American Indian Movement events, including sit-ins at the Black Hills, which are a sacred place for the Lakota people. It was taken by the United States government after the discovery of gold in the area.United States v. Sioux Nation of Indians, 448 U.S. 371, 378 (1980). == Lame Deer, Seeker of Visions == In 1972, Richard Erdoes published the book Lame Deer, Seeker of Visions. The book is a collection of interviews with Lame Deer. Lame Deer talks about Lakota culture and his life as a teacher and a healer. == References == Category:Native American people Category:1903 births Category:1976 deaths",
 "title": "John Fire Lame Deer"
}