{
 "id": "91091",
 "text": "{{Infobox settlement |name = Nord |settlement_type = Department |native_name = Nò |native_name_lang = ht |image_skyline = Gfp-looking-at-the-horizon.jpg |imagesize = 300px |image_alt = |image_caption = La Belle Mère |image_map = Nord in Haiti.svg |map_caption = Nord in Haiti |area_total_km2 = 2114.91 |population_as_of = 2015 |population_density_km2 = auto |population_total = 1067177 |population_footnotes = |subdivision_type = Country |subdivision_name = Haiti |subdivision_type1 = Capital |subdivision_name1 = Cap-Haïtien |iso_code = HT-ND |utc_offset1 = -5 |timezone1 = Eastern |blank_name_sec2 = HDI (2017) |blank_info_sec2 = 0.508 · 2nd |population_urban = 538875 |population_rural = 528302 |government_type = Departmental Council }} Nord (English: North) is one of the ten departments (French: départments, singular départment) of Haiti. After the Haitian Revolution, the country was divided into only three departments: Nord, Ouest and Sud. The Nord-Est and Nord-Ouest departments were part of the Nord department. Its capital and largest city is Cap-Haïtien, founded in 1670 by Bertrand d'Orgeron and the old capital city of Saint-Domingue. It had the nickname of Paris of Saint-Domingue. == Geography == The Départment du Nord has an area of 2,106 km². It is bordered to the northwest by the Nord-Ouest Department, to the east by the Nord-Est Department, to the southeast by the Centre Department and to the west by the Artibonite Department. The Atlantic Ocean is to the north. The main rivers of the department are Grande Rivière du Nord, Haut du Cap and Limbé. The rivers Trois-Rivières and Bouyaha have their sources in this department. All these rivers, except Bouyaha that is a tributary of the river Artibonite, flow to the north, into the Atlantic Ocean. The Massif du Nord mountain range, known in the Dominican Republic as Cordillera Central, runs from the northwest to the southeast along the southern half of the department. This Massif du Nord is formed by several chains and the most important, in this department, are the Chaine de la Grande Rivière du Nord and the 'Chaine de Saint Raphael. The Pleine du Nord (in English, \"Northern Plain\") is in the northern half of the department. == Population == The department had, in the 2003 census, a population of 823,043 persons: 393,547 men and 429,496 women, with 325,318 (39.53%) living in cities and towns. == Administrative division == The department is divided into seven arrondissements (like districts) and 19 communes (like municipalities). The \"arrondissements\" and their \"communes\" are: # Acul-du-Nord ## Acul-du-Nord ## Milot ## Plaine-du-Nord # Borgne ## Borgne ## Port-Margot # Cap-Haïtien ## Cap-Haïtien ## Limonade ## Quartier-Morin # Grand-Rivière du Nord ## Grande- Rivière-du-Nord ## Bahon # Limbé ## Limbé ## Bas-Limbé # Plaissance ## Plaisance ## Pilate # Saint-Raphaël ## Saint-Raphaël ## Dondon ## La Victoire ## Pignon ## Ranquitte == References == Category:Departments of Haiti",
 "title": "Nord (Haitian department)"
}