{
 "id": "91108",
 "text": "Mani Ratnam () (born June 2, 1956) is a Tamil Indian movie director, writer and producer. ==Filmography== The following is the list of movies directed by Mani Ratnam. For many of these movies, Mani Ratnam is also credited for the story, screenplay and producing: ===Director=== Year Film Language Cast Music Director Notes 1983 Pallavi Anu Pallavi Kannada Anil Kapoor, Lakshmi Ilaiyaraaja Dubbed into Tamil as Oh! Priya Priya 1985 Unaru Malayalam Mohanlal, Sukumaran, Sabina Jose Ilaiyaraaja 1985 Pagal Nilavu Tamil Murali, Revathi Menon, Radhika Sarath Kumar, Sathyaraj Ilaiyaraaja 1985 Idaya Kovil Tamil Mohan, Radha, Ambika, Goundamani Ilaiyaraaja 1986 Mouna Raagam Tamil Mohan, Revathi, Karthik Ilaiyaraaja Dubbed into Telugu as Mouna Raagam 1987 Nayagan Tamil Kamal Haasan, Saranya, Nassar, Janagaraj Ilaiyaraaja Dubbed into Hindi as Nayak Dubbed into Telugu as Nayakudu 1988 Agni Natchathiram Tamil Prabhu, Karthik, Vijayakumar, Nirosha, Amala, Janagaraj, Jayachitra Ilaiyaraaja Dubbed into Telugu as Gharshana 1989 Geethanjali Telugu Nagarjuna, Girija, Vijayakumar Ilaiyaraaja Dubbed into Tamil as Idhayathai Thirudathey Dubbed into Malayalam as Geethanjali 1990 Anjali Tamil Raghuvaran, Revathi, Prabhu, Tarun Kumar, Shamili, Shruti, Saranya Ilaiyaraaja Dubbed into Telugu as Anjali 1991 Thalapathi Tamil Rajinikanth, Mammooty, Arvind Swamy, Amrish Puri, Sobhana, Bhanupriya, Srividya, Geetha, Jaishankar Ilaiyaraaja Dubbed into Telugu as Dalapati Dubbed into Hindi as Dal-pati 1992 Roja Tamil Arvind Swamy, Madhubala, Pankaj Kapoor, Nassar, Janagaraj A. R. Rahman Dubbed into English as The Rose Dubbed into Hindi, Telugu, Malayalam and Marathi as Roja 1993 Thiruda Thiruda Tamil Prashanth, Anand, Heera Rajgopal, Anu Agarwal, Balasubrahmanyam A. R. Rahman Dubbed into Hindi as Chor Chor Dubbed into Telugu as Donga Donga 1995 Bombay Tamil Arvind Swamy, Manisha Koirala, Nassar, Prakash Raj A. R. Rahman Dubbed into Hindi and Telugu as Bombay 1997 Iruvar Tamil Mohanlal, Aishwarya Rai, Prakash Raj, Madhubala, Tabu, Revathi, Gouthami, Nassar A. R. Rahman Dubbed into Telugu as Iddaru 1998 Dil Se(Uyerea in tamil) Hindi Shah Rukh Khan, Manisha Koirala, Preity Zinta A. R. Rahman Dubbed into Tamil as Uyire Dubbed into Telugu as Prema Tho 2000 Alaipayuthey Tamil Madhavan, Shalini, Arvind Swamy, Kushboo, Vivek, Sukumari, Lalitha, Jayasudha, Pyramid Natarajan A. R. Rahman Dubbed into English as Waves Dubbed into Telugu as Sakhi remade into Hindi as Saathiya 2002 Kannathil Muthamittal Tamil Madhavan, Simran, Nandita Das, Keerthana, Prakash Raj, Pasupathy A. R. Rahman Dubbed into English as A Peck on the Cheek Dubbed into Telugu as Amrutha 2004 Aayitha Ezhuthu Tamil Madhavan, Surya Sivakumar, Siddharth Narayan, Meera Jasmine, Esha Deol, Trisha, Bharathiraja, Janagaraj A. R. Rahman Dubbed into Telugu as Yuva Dubbed into English as The Three Dots 2004 Yuva Hindi Ajay Devgan, Abhishek Bachchan, Vivek Oberoi, Rani Mukherjee, Esha Deol, Kareena Kapoor, Om Puri A. R. Rahman 2007 Guru Hindi Abhishek Bachchan, Aishwarya Rai, Madhavan, Vidya Balan, Mallika Sherawat, Mithun Chakraborty A. R. Rahman Dubbed into Tamil as Guru Dubbed into Telugu as Gurukanth 2010 Ravana Hindi Abhishek Bachchan, Aishwarya Rai, Vikram, A. R. Rahman This film is in both Tamil and Hindi Dubbed into Telugu as Villain ===Non-Director=== Mani Ratnam established Madras Talkies for movie production during the shoot of Iruvar. Mani Ratnam had earlier produced Thiruda Thiruda under his personal name. All movies directed by Mani Ratnam subsequent to Iruvar have been produced through Madras Talkies. Apart from production, Mani Ratnam also has written story and screenplay for movies directed by others. * Indira (1996) - Screenplay (Movie was directed by his wife Suhasini) * Gayam (1993) - Story & Screenplay (Telugu Movie) * Chatriyan - Story & Screenplay * Tajmahal - Story & Screenplay * Aasai (1995) - Producer * Nerrukku Ner (1997) - Producer (Madras Talkies) * Dumm Dumm Dumm (2001) - Story & Screenplay * Saathiya (2002) - Screenplay (Movie is a re-make of Alaipayuthey and was directed by his assistant Shaad Ali) and Producer (Madras Talkies) * Five Star (2003) - Producer (Madras Talkies) ===Writer=== Years movie Role Notes 2010 Raavan screenplay The movie of Raavan's Screenplay was written by Mani Ratnam 2010 Raavanan Story 2007 Guru screenplay 2004 Ayitha Ezhuthu 2004 Yuva screenplay 2002 Saathiya story & screenplay 2002 Kannathil Muthamittal screenplay & story 2001 Waves dialogue, screenplay & story 1998 Dil Se.. story & screenplay 1997 The Duo screenplay & story 1996 Indira (Priyanka) screenplay 1995 Bombay screenplay & story 1994 Thiruda Thiruda 1993 Gaayam screenplay & story 1992 Roja 1991 Thalapathi screenplay & story 1990 Anjali screenplay & story 1989 Gitanjali screenplay & story 1988 Agni Natchathiram 1987 Nayakan 1985 Pagal Nilavu 1983 Pallavi Anu Pallavi ==Other websites== * * Director Mani Ratnam: A living Legend in Film Making * Technical Analysis of Mani Ratnam Films * Mani Ratnam and A. R. Rahman * Mani Ratnam: Brief film descriptions * A Mani Ratnam Interview * Mani Ratnam - article and interview *Interview with Bharathan Kandaswamy and Mani Ratnam Category:Indian movie directors Category:Indian screenwriters Category:Indian movie producers Category:1956 births Category:Living people Category:Tamil people",
 "title": "Mani Ratnam"
}