{
 "id": "911127",
 "text": "Carlos Armando Gruezo Arboleda (; born 19 April 1995) is an Ecuadorian professional footballer who plays as a defensive midfielder or central defender for Major League Soccer club San Jose Earthquakes and the Ecuador national team. He is the son of Carlos Armando Gruezo Quiñónez. == Club career == He began his career with Independiente del Valle before joining Ecuadorian club Barcelona SC. Gruezo went on trial for VfB Stuttgart in their pre season friendlies in South Africa. On 30 January 2014, he signed a four-year contract with Stuttgart. He scored his first goal for the club in a 4–1 victory over Freiburg on 28 November 2014, becoming the first Ecuadorian to score in the Bundesliga. In 2015 however, he lost his spot in the starting lineup and only had a few more appearances for Stuttgart. He moved to FC Dallas on 23 January 2016. On 2 July 2019, Gruezo returned to Germany, joining FC Augsburg on a five-year-deal. == International career == He played for Ecuador at the 2011 FIFA U-17 World Cup and at the 2013 South American Youth Championship. Gruezo made his debut for the Ecuador national football team on 17 May 2014, coming in as a second-half substitute for Christian Noboa against the Netherlands. On 6 June, he was named in Ecuador's squad for the 2014 FIFA World Cup. == International goals == : Scores and results list Ecuador's goal tally first. No. Date Venue Opponent Score Result Competition 1\\. 12 November 2020 Estadio Hernando Siles, La Paz, Bolivia 3–2 3–2 2022 FIFA World Cup qualification == Career statistics == === Club === Club Season League Cup Continental Other Total Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Independiente 2011 4 0 0 0 0 0 0 0 4 0 Barcelona 2012 39 1 0 0 1 0 0 0 40 1 2013 38 2 0 0 3 0 0 0 41 2 VfB Stuttgart 2013–14 8 0 0 0 0 0 0 0 8 0 2014–15 6 1 0 0 0 0 0 0 6 1 FC Dallas 2016 27 0 0 0 0 0 2 0 29 0 2017 31 0 0 0 0 0 0 0 31 0 2018 31 2 0 0 0 0 0 0 31 2 2019 2 0 0 0 0 0 0 0 2 0 Career total 186 6 0 0 4 0 2 0 192 6 == Honours == === Club === Barcelona S.C. ** Serie A de Ecuador: 2012 FC Dallas ** US Open Cup: 2016 ** Supporters' Shield: 2016 == References == == Other websites == * * Category:1995 births Category:Living people Category:Association football midfielders Category:Ecuadorian footballers Category:2014 FIFA World Cup players Category:FC Augsburg players",
 "title": "Carlos Gruezo (footballer, born 1995)"
}