{
 "id": "91135",
 "text": "Jacob Benjamin GyllenhaalPronounced . (born December 19, 1980) is an Academy Award-nominated american actor. He has appeared in diverse roles since his first lead role in 1999's October Sky, followed by the 2001 cult hit Donnie Darko, in which he played a psychologically troubled teen and onscreen brother to his real-life sister, actress Maggie Gyllenhaal. In the 2004 blockbuster The Day After Tomorrow he portrayed a student caught in a cataclysmic global cooling event, alongside Dennis Quaid as his father. He then played against type as a frustrated Marine in Jarhead (2005). The same year, he won critical acclaim portraying a role that entered popular shorthand as a \"gay cowboy\" in the controversial but highly acclaimed film Brokeback Mountain. == Early life == His mother is screenwriter Naomi Foner. His father is director Stephen Gyllenhaal, who was raised as a Swedenborgian, is of Swedish and English descent, and is a descendant of the Swedish noble Gyllenhaal family.Stated on Finding Your Roots with Henry Louis Gates, Jr., PBS, April 22, 2012 Jake's last ancestor to be born in Sweden was his great-great-grandfather, Anders Leonard Gyllenhaal.Bloom, Nate (June 11, 2004) Rootsweb.com. Retrieved September 19, 2006. Jake's mother is Jewish; she was born in New York City, to a family from Russia and Poland. Gyllenhaal has said that he considers himself Jewish. Gyllenhaal began acting at 11 years old. == Filmography == Year Title Role 1991 City Slickers Danny Robbins 1993 Josh and S.A.M. Leon 1999 October Sky Homer Hickam Jr. 2001 Donnie Darko Donald J. \"Donnie\" Darko Bubble Boy Jimmy Livingston Lovely & Amazing Jordan 2002 Highway Pilot Kelson Moonlight Mile Joe Nast The Good Girl Thomas 'Holden' Worther 2003 Abby Singer Himself (cameo) 2004 The Day After Tomorrow Sam Hall 2005 Brokeback Mountain Jack Twist Jarhead Anthony Swofford (\"Swoff\") Proof Harold 'Hal' Dobbs 2007 Zodiac Robert Graysmith Rendition Douglas Freeman 2008 Brothers TBA 2009 Untitled Moon Project == Awards == Year Group Award Result Film 2002 Young Hollywood Awards Breakthrough Performance - Male Won Independent Spirit Awards Best Male Lead Nominated Donnie Darko 2003 Chlotrudis Awards Best Actor Won DVD Exclusive Awards DVD Premiere Award, Best Actor Nominated Highway Teen Choice Awards Choice Movie Breakout Star - Male Nominated The Good Girl 2005 National Board of Review Best Supporting Actor Won Brokeback Mountain 2006 MTV Movie Awards Best Performance Won Best Kiss Won Screen Actors Guild Best Supporting Actor Nominated Best Ensemble Nominated Critics' Choice Award Best Supporting Actor Nominated BAFTA Best Supporting Actor Won Academy Awards Best Supporting Actor Nominated Satellite Awards Outstanding Supporting Actor Nominated Outstanding Lead Actor Nominated Jarhead National Arts Awards Young Artist Award for Artistic Excellence Won == References == == Other websites == * Official website * Category:1980 births Category:Living people Category:Actors from Los Angeles Category:American child actors Category:American movie actors Category:American television actors Category:American voice actors Category:BAFTA Award winners Category:Jewish American actors",
 "title": "Jake Gyllenhaal"
}