{
 "id": "911325",
 "text": "Queen is a 2013 Indian Hindi-language comedy-drama film directed by Vikas Bahl. It was produced by Anurag Kashyap, Vikramaditya Motwane, and Madhu Mantena. It stars Kangana Ranaut in the lead role, with Lisa Haydon and Rajkummar Rao playing supporting roles. The film follows the story of Rani Mehra, a diffident Punjabi girl from New Delhi who embarks on her honeymoon to Paris and Amsterdam by herself after her fiancé calls off their wedding. ==Plot== Rani Mehra is a 24 year-old sheltered, meek, yet good-natured young Punjabi woman from Delhi. One day before her wedding, her fiancé Vijay Dhingra (Rajkummar Rao) tells her that he no longer wishes to marry her. He explains that his lifestyle has changed after living abroad, and Rani's conservative habits would be a wrong match for him. Stunned at the development, Rani shuts herself in her room for a day recalling her and Vijay's story of how they met and fell in love. Wanting to control the situation, she asks her parent's permission to go alone on her pre-booked honeymoon to Paris and Amsterdam. After initially hesitating, her parents agree, thinking that a vacation might cheer her up. ===In Paris=== In Paris, Rani meets Vijayalakshmi (Lisa Haydon), a free-spirited woman of French-Spanish-Indian descent, who works at the hotel in which Rani stays. Overwhelmed by the new city and having gotten into trouble twice – once with the local police and once with a robber – Rani intends to return to India. However, Vijayalakshmi helps her out and gives her a tour around the city. The two have a series of adventures, during which Rani relives the memories of Vijay patronizing her and forbidding her from dancing and drinking – which she's free to do in Paris. During one particular incident, Rani tries on what she considers to be a revealing outfit and accidentally sends a selfie of her wearing the attire to Vijay instead of Vijayalakshmi due to the similarity in their names. Rani quickly realizes her mistake, but unbeknownst to her, the selfie revives Vijay's interest in Rani and he decides to seek her out. Eventually, the time comes for Rani to bid an emotional farewell to Vijayalakshmi and board the Dutch Sprinter train for Amsterdam. However, when Rani arrives in Amsterdam, she finds that her hostel room is being shared with three men: Taka from Japan, Tim from France, and Oleksander from Russia. Despite being skeptical, she soon becomes good friends with them and spends time shopping, sightseeing, visiting a sex shop, going to a church, and meeting pole dancers in a club. Rani befriends a pole dancer at the club, Roxette/Rukhsar (Sabeeka Imam), a Pakistani girl who is the sole breadwinner for her family back in Lahore and who is also a friend of Vijaylakshmi. Rani slowly begins to gain confidence by taking control of her decisions. Realizing her earning potential, she wins a cook-off by selling gol gappas. After the cook-off event, the Italian host and restaurant owner shares an intimate moment with her when she experiences her first 'Indo-Italian' kiss with him and proves that Indians are the best in cooking and even lip to lip kissing. She learns more about her friends' backgrounds and begins to understand how different life can be for people in other parts of the world. One day, the four friends find Vijay waiting for Rani in front of the hostel. Vijay apologizes to Rani and asks her to reconsider the relationship. Their conversation escalates as he tries to grab hold of Rani, but her friends retaliate, and she asks him to leave. Rani decides to miss out on a concert with her friends to meet with Vijay and discuss their future. A conservative thinking Vijay judges Rani's new friends and behavior, like drinking champagne and her choice of living with roommates of the opposite gender, and tells her that she doesn’t know foreigners. This causes her to leave abruptly, saying that she would rather speak to him after returning to Delhi. She then meets up with her friends one last time at the concert. After bidding an emotional farewell to them, Rani returns to India. ===Back in Delhi=== Back in Delhi, Rani visits Vijay at his home. Vijay and his family think that she has decided to forgive him and start discussing wedding plans. Instead, Rani hands Vijay her engagement ring and says \"thank you,” probably suggesting that he gave her the opportunity to explore the world and develop herself by rejecting her and it did her good, highlighting her grandma’s words earlier in the movie on how things occur for the better. She walks away with a confident smile on her face. ==Cast== *Kangana Ranaut as Rani Mehra (Queen) , Vijay's Love Interest and Fiancé *Rajkummar Rao as Vijay Dhingra, Rani's Selfish and Aggressive Fiancé *Lisa Haydon as Vijayalakshmi *Mish Boyko as Oleksander (Sikander) *Jeffrey Ho as Taka *Joseph Guitobh as Tim *Tantrik Baba as Baba *Marco Canadea as Marcello, Rani's Crush *Yogendra Tiku as Rani's Father *Alka Badola Kaushal as Rani's Mother *Chinmaya Agrawal as Chintu Mehra, Rani's Brother *Tripta Lakhanpal as Dadi *Nayani Dixit as Sonal *Sabeeka Imam as Roxette (Rukhsar) *Alexandre Plasti Melara as flying pig drunk #1 *Leonardo Pricoli as flying pig drunk #2 ==References== Category:2010s Indian movies Category:2010s Hindi-language movies Category:2013 movies",
 "title": "Queen (movie)"
}