{
 "id": "911317",
 "text": "Ruben Estephan Vargas Martinez (born 5 August 1998) is a Swiss professional footballer who plays as a winger for superleague club panathinaikos fc ==Club career== Vargas made his professional debut for FC Luzern in a 1–1 draw with FC Zürich on 27 August 2017. He signed a 5 year contract with Augsburg in the summer of 2019, becoming the first Bundesliga player of Dominican descent. He scored his first goal in his second match, against Union Berlin. ==International career== Vargas made his Switzerland senior team debut on 8 September 2019, in a Euro 2020 qualifier against Gibraltar. He replaced Granit Xhaka in the 74th minute. ===Euro 2020=== Vargas scored a important penalty for Switzerland, during UEFA Euro 2020, in a penalty shootout against France on 28 June in the Round of 16 knockout stage, qualifying Switzerland for the quarter-final. Vargas, however, later missed a penalty for Switzerland, during the penalty shootout against Spain on 2 July in the quarter-final. Switzerland would later lose on penalties. ==Personal life== Vargas was born in Adligenswil, Switzerland, to a Dominican father and a Swiss mother, and holds citizenship of both nations. Vargas shares a hometown with his previous Augsburg teammate and previous Switzerland captain Stephan Lichtsteiner. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National Cup Europe Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Luzern 2017–18 Swiss Super League 19 1 1 1 0 0 — 20 2 2018–19 Swiss Super League 31 8 4 1 2 0 — 37 9 Total 50 9 5 2 2 0 — 57 11 FC Augsburg 2019–20 Bundesliga 33 6 0 0 — — 33 6 2020–21 Bundesliga 30 6 2 1 — — 32 7 2021–22 Bundesliga 6 0 0 0 — — 6 0 Total 69 12 2 1 — — 71 13 Career total 119 21 7 3 2 0 0 0 128 24 ===International goals=== :Scores and results list Switzerland's goal tally first. No. Date Venue Opponent Score Result Competition 1 18 November 2019 Victoria Stadium, Gibraltar 2–0 6–1 UEFA Euro 2020 qualification 2 31 March 2021 Kybunpark, St. Gallen, Switzerland 2–2 3–2 Friendly 3 1 September 2021 St. Jakob-Park, Basel, Switzerland 2–1 2–1 Friendly 4 15 November 2021 Swissporarena, Lucerne, Switzerland 2–0 4–0 2022 FIFA World Cup qualification ==References== ==Other websites== *Ruben Vargas en Fútbol Dominicano. Net * * SFL Profile * * * Swiss U20 Profile * Category:1998 births Category:Living people Category:Swiss footballers Category:FC Augsburg players Category:2022 FIFA World Cup players Category:Sportspeople from the canton of Lucerne Category:UEFA Euro 2024 players",
 "title": "Ruben Vargas"
}