{
 "id": "911656",
 "text": "The Cristero War (in Spanish: Guerra Cristera or La Cristiada; ) is an internal Mexican conflict that occurred from 3 August 1926 to 21 June 1929, especially in the central and western parts of Mexico. The antecedents of the conflict began with the implementation of the Calles Law, where the Catholic Church was prohibited from many laws, and also the tightening of articles 3, 5, 24, 27 and 130 of Constitution of 1917. The rural population of central Mexico was in favor of the church and they were against the implemented Law. This conflict was also involved in the U.S. Ambassador in Mexico Dwight Morrow would break relations with the Government of the President Calles and the Church, in 1929 the Conflict ended of the firm of Treaty between the Federal government of Mexico and Archbishop Ruiz y Flóres to the cessed the Fire and the disintegrated the Cristeros. == Notable Battles == Note: The mayor battles of the Cristero War occurred in the States of Zacatecas, Colima, Guanajuato and Jalisco. * Take of Huejuquilla el Alto * Take of Valparaíso * Battle of Santiago Bayacora * Battle of Cerrito Verde * Battle of Cerro del Capulín * Battle of Cerro de las Papas * Battle of Tepatitlán * Battle of El Fresnal * Manzanillo Assault * Battle of Piedra Imán * Battle of Caucentla * Battle of Los Rubios * Battle of Tenaxcamilpa * Battle of Nogueras * Battle of Borbollón * Battle of Mezquitic * Battle of San Julián * Battle of Cuquío * Take of Juchitlán * First Take of Cocula * Take of Colima * Second Take of Cocula * Encarnación de Díaz Massacre * Take of Colotlán * Amatlán de Cañas Battle * Battle of Etzatlán * San Marcos Battle (1927) * Battle of Guachinango * Mascota Battle * Ixtlán del Río Battle * Take of Compostela * Tepatitlán Crisis * Battle of Atotonilco el Alto * Villa de Guadalupe Battle * Cerro El Fresquial Battle * Sahuayo, Jiquilpan and Cotija Battles * Aereal attack of Torreón == References == * Cristeros (Soldiers of Christ) – Documentary * The Cristero Rebellion, by Jim Tuck * AP article on the 2000 canonizations * Biography of Miguel Pro * Spanish article on the war * Spanish biographies of the saints canonized in 2000 * Ferreira, Cornelia R. Blessed José Luis Sánchez del Rio: Cristero Boy Martyr, biography (2006 Canisius Books). * Iniquis Afflictisque – encyclical of Pope Pius XI on the persecution of the Church in Mexico (November 18, 1926) * Miss Mexico wears dress depicting Cristeros at the 2007 Miss Universe Pageant * Catholicism.org: \"Valor and Betrayal – The Historical Background and Story of the Cristeros\" – article by Gary Potter. Category:1920s conflicts Category:20th century in Mexico",
 "title": "Cristero War"
}