{
 "id": "911733",
 "text": "Ressha Sentai ToQger is a Japanese television series. It is the 38th part of Toei's Super Sentai series. It follows Zyuden Sentai Kyoryuger. The series premiered on TV Asahi affiliates on February 16, 2014. It joined Kamen Rider Gaim and Kamen Rider Drive in the Super Hero Time programming block. The series ended on February 15, 2015. The series has a Train motif. Unlike previous series where the heroes are named after colors, the heroes in ToQger are numbered and regularly changed colors. One of the props from the series was used for the 24th and 25th seasons of the American Power Rangers (Power Rangers Ninja Steel and Power Rangers Super Ninja Steel. Both are versions of the 2015 Sentai series, Shuriken Sentai Ninninger). ToQger was the second Sentai since Chōjin Sentai Jetman to not be made into a season of Power Rangers. The series' main characters made a small appearance in the movie Zyuden Sentai Kyoryuger vs Go-Busters: The Great Dinosaur Battle! Farewell Our Eternal Friends. They also were at a special meet-and-greet and press conference at Tokyo Dome City in late January 2014. In October 2014, the series was given the Japan Railway Award's Special award by the Ministry of Land, Infrastructure, Transport and Tourism in its annual \"Train Day\" observance. The award was for the effect the series had on making children enjoy trains. ==Story== Only those with a great imagination can see the mystical railway known as the Rainbow Line, on which run massive train known as Ressha These Ressha are driven by five warriors known as the ToQgers, It is their mission to save towns from the evil forces of the Shadow Line who are using the residents' fear and sadness to establish their own railway to enable the coming of their leader of Emperor Z, whose intention is consume light to plunge the world into darkness. The five ToQgers are also childhood friends who are fighting to recover the memories of their hometown after it was consumed by the Shadow Line's evil. Later joined by Akira Nijino, a former Shadow Creep who reformed, the ToQgers begin a campaign to free these \"Shadow Towns\" from their Shadow Creep Keepers in an attempt to recover their memories while the Shadow Line itself must deal with some opposition among their own subjects. ==Characters== ===ToQger=== Actor Name Rangers Mecha Weapon Jun Shison Suzuki Right ToQ Ichigou Red Ressha ToQ Changer, ToQ Blaster, Rail Slasher Homare Mabuchi Suzuki Right ToQ Ichigou Red Ressha ToQ Changer, ToQ Blaster, Rail Slasher Jin Hiramaki Haru Tokatti ToQ Nigou Blue Ressha ToQ Changer, ToQ Blaster, Home Trigger Keishiro Nagase Haru Tokatti ToQ Nigou Blue Ressha ToQ Changer, ToQ Blaster, Home Trigger Riria Kojima Mio Natsume ToQ Sangou Yellow Ressha ToQ Changer, ToQ Blaster, Shingo Hammer Kaoruko Ishii Mio Natsume ToQ Sangou Yellow Ressha ToQ Changer, ToQ Blaster, Shingo Hammer Ryusei Yokohama Hikari Nomomura ToQ Yongou Green Ressha ToQ Changer, ToQ Blaster, Tunnel Axe Hikaru Yamazaki Hikari Nomomura ToQ Yongou Green Ressha ToQ Changer, ToQ Blaster, Tunnel Axe Ai Moritaka Kagura Izumi ToQ Gogou Pink Ressha ToQ Changer, ToQ Blaster, Tekkyou Claw Rara Shimizu Kagura Izumi ToQ Gogou Pink Ressha ToQ Changer, ToQ Blaster, Tekkyou Claw Shin Nagahama Akira Nijino ToQ Rokugou Build Ressha, Drill Ressha Appli Changer, Yudou Breaker Tsutomu Sekine Conductor ToQ Nanagou ==Cast== * Right / ToQ Ichigou: Jun Shison, Homare Mabuchi (Child) * Tokatti / ToQ Nigou: Jin Hiramaki, Keishiro Nagase (Child) * Mio / ToQ Sangou: Riria Kojima, Kaoruko Ishii (Child) * Hikari / ToQ Yongou: Ryusei Yokohama, Hikaru Yamazaki (Child) * Kagura / ToQ Gogou: Ai Moritaka, Rara Shimizu (Child) * Akira Nijino / ToQ Rokugou: Shin Nagahama * Conductor / ToQ Nanagou: Tsutomu Sekine * Emperor Z: Kengo Ohkuchi * Ticket (Voice), ToQger Equipment Voice, Narration: Kappei Yamaguchi * Wagon (Voice): Yui Horie ===Guest stars=== * Tooru Chiba (9): Sotaro * Gonzaemon Toride (14): Hiroyuki Konishi * Ryo Tokashiki (23, 25, 45, 47): Mizuki Ohno * Naked Emperor (25): John Kaminari * Owner of Sentō (26): Ken Nishida * Teruo Inzai (26): Masahiro Kuranaki * Taihei Kasuga (33): Ryo Kinomoto * Tsuyoshi Suzuki (33, 45-47): Takashi Inoue * Yoshio Omotesando (34): Makoto Sakamoto * Sakura Igawa (36): Erica Tonooka * Ayaka Nomomura (43, 45, 47): Hitomi Hasebe ==Theme songs== ; Opening theme * \"Ressha Sentai ToQger\" ** Lyrics: Shio Watanabe ** Composition & Arrangemnt: Go Sakabe ** Artist: Daiki Ise ; Ending theme * \"Byun Byun! ToQger\" ** Lyrics: Shoko Fujibayashi ** Composition: Shunryū ** Arrangement: Go Sakabe ** Artist: Project.R (YOFFY, Takayoshi Tanimoto, Shogo Kamada) Category:Super Sentai series Category:2014 Japanese television series debuts Category:2015 Japanese television series endings",
 "title": "Ressha Sentai ToQger"
}