{
 "id": "911789",
 "text": "Iblis is a character mentioned in the Quran. He is a fallen angel from a a group called \"al-djinn\" and refused to bow before Adam.Saleh, Walid A. \"Rereading al-Ṭabarī through al-Māturīdī: New light on the third century hijrī.\" Journal of Qur'anic Studies 18.2 (2016): 180-209 This is because Iblis thought that he was better than Adam. Because he felt from heaven, he is often compared to Lucifer. However, Iblis is not God's enemy, he is only the enemy of djinn and humans. == Story of Iblis == Since the Quran tells about stories, the explanation is provided in books called tafsir. The tafsirs explain that before Adam, djinn lived on earth. Djinn have, like humans, free will. However, the djinn became more and more evil. When God was fed up with the djinn, he decided to kill the djinn by an army of angels. The leader of the angels was Iblis. After the djinn died or hid themselves from the angels, Iblis felt proud. He thought he was the favorite creature of God now. However, God decided to create a new creature with free will instead. Then God commanded Iblis to bow before Adam as a sign of respect. Iblis was disappointed and felt that this command was unjust. Instead, he wanted to destroy humans as he destroyed the djinn before. Because of his arrogant actions, he was dismissed from his angelic duties. When Iblis lost his angelic nature, he became a devil and was not able to return to heaven. Some scholars also add, that his name before his fall was Azazel, but his name became Iblis when he turned into a devil.http://dx.doi.org/10.1163/1573-3912_ei3_COM_23204> First published online: 2009 First print edition: 9789004181304, 2009, 2009-3 As a devil, he wants to prove that the other creatures are inferior to him. == Dispute == Since the tafsir is an explanation, disagreements are also recorded. The story of Iblis is not mentioned in the Quran, but is explained by Muhammad 's followers. Two followers disagreed. Ibn Abbas said that Iblis was an angel called Azazel, who was made from fire and he was the leader of the angels. Hasan Basri said, that he was not a real angel, since angels would not make bad decisions. He argues, that Iblis has always been a devil.Erdağı, Deniz Özkan. \"Evil in Turkish Muslim horror film: the demonic in “Semum”.\" SN Social Sciences 4.2 (2024): 1-22 Therefore, traditional Muslims have one of these two views about Iblis. == Theology == Islam scholars explain the meaning and purpose of the story for the Muslims. First, they explain, Iblis did not create evil. This is different from some Christians and Zoroastrianism who believe that Satan creates evil. Muslims believe that God creates both good and evil, but evil has a better purpose in the end. Next, Muslims should not compare themselves to others (not be envious), because Iblis sinned when he compared himself to Adam. Muslims should also not be arrogant, since Iblis was arrogant. Iblis is also said to have children. His own children are called shayāṭīn (satans or devils). They come from eggs, because Iblis has no gender. Next, humans and remaining djinn who decide to become evil, also turn into devils and are Iblis' children. Since Iblis' children betrayed God, Iblis does not like them. Instead, he betrays his own people whenever he meets God or his angels. This is, for example, supposed to have happened at a battle between Muhammad and his enemies.Sinai, Nicolai. \"Key terms of the Qur'an: a critical dictionary.\" (2023): 1-84 ==References== Category:Angels Category:Demons Category:Quranic figures",
 "title": "Iblis"
}