{
 "id": "911786",
 "text": "Lara Jill Miller (born April 20, 1967) is an American actress. She played Samantha \"Sam\" Kanisky on the 1980s sitcom Gimme a Break! and Kathy on The Amanda Show. ==Filmography== ===Live-action=== List of acting performances in live-action television and film Year Title Role Notes Source 1981–1987 Gimme a Break! Samantha \"Sam\" Kanisky Main role 1986 Touch and Go Courtney 1999–2002 The Amanda Show Kathy 2000 Chicken Soup for the Soul The Teacher TV series 2002 General Hospital Kate Whittaker Episode #1.9927 2005 Shushybye Snoozles, Dozie, and Zeez 2009 iCarly Mrs. Kravitz Episode: \"IFind Lewberts Lost Love\" ===Anime=== List of dubbing performances in anime Year Title Role Notes Source 1999 Digimon Adventure Kari Kamiya 2000 Digimon Adventure 02 2001 Digimon Tamers Nami Asaji 2002 Daigunder Haruka Argento Soma Second Lt. Sue Harris 2002-03 Great Teacher Onizuka Anko's friend 2003 .hack//Legend of the Twilight Random Girl 2003 S-CRY-ed Scheris Adjani 2004 Ghost in the Shell: Stand Alone Complex Tachikoma also in Ghost in the Shell: S.A.C. 2nd GIG (series 2) Astro Boy Alejo, Vivienne, C.J., Mimi, Nina Sony Pictures / Kids' WB!/ Cartoon Network/Toonami Please Twins Karen Onodera 2005 Planetes Nono Rave Master Haul Episode 2 2005–2007 Zatch Bell! Koko 2005 Naruto Matsuri 2007 Blood+ Min, Lulu, Javier 2008 Lucky ☆ Star Misao Kusakabe 2008 Strait Jacket Kapelteta Fernandez 2010 Nodame Cantabile Yuiko Miyoshi 2020–present Beastars Haru ===Animation=== List of voice performances in animation Year Title Role Note's Notes Source 2001-2013 Totally Spies! Ariel Episode: W.O.W. 2002 Static Shock Teen Girl #2 Episode: \"Power Play\" 2002 Rocket Power Girl #1, Kid #1 Episode: \"Beach Boyz and a Girl/X-treme Ideas\" 2003–2006 Clifford's Puppy Days Clifford 2004 The Grim Adventures of Billy & Mandy Girl/Kid C Episode: \"Which Came First?/Substitute Teacher\" 2004 Megas XLR Little Girl, Kelly 2004 All Grown Up! Olivia 2004–2008 Higglytown Heroes Pookie, Wiki, Tini 2005–2007 The Life and Times of Juniper Lee Juniper Lee 2006 Hi Hi Puffy AmiYumi Julie Hinikawa Episode: \"Manga Madness, Part II/Julie AmiYumi/It's Alive!\" 2006–2007 Shorty McShorts' Shorts April In the episode My Mom Married A Yeti 2006–2010 Wow! Wow! Wubbzy! Widget, Huggy, Old Lady Zamboni 2009–2022 Curious George Allie 2010–2023 SciGirls Izzie 2011–2012 Winx Club Chatta, Tune, Livy Special 4, season 3–4 Atlas Oceanic version 2011–2016 Poppy Cat Mother Bumblebird 2012–2020 Doc McStuffins Lambie 2013–2015 Henry Hugglemonster Henry Hugglemonster 2016–present The Loud House Lisa Loud, Liam Hunnicutt, Becky, Margo Roberts (2016-2018), Nurse Patti, Levi Loud, Persephone, Additional Voices 2017–present If You Give a Mouse a Cookie Cat 2017–2019 OK K.O.! Let's Be Heroes Fink 2018 Bunnicula Lil Capone In the episode Haunted Dog House 2020 DC Super Hero Girls Casey Krinsky In the episode All About Zee 2020-2022 The Casagrandes Lisa Loud, Female Voice In the episode Cursed! and Kick Some Bot 2021–2023 Looney Tunes Cartoons Petunia Pig 2021–2024 The Ghost and Molly McGee Libby Stein-Torres ===Film=== List of voice performances in direct-to- video and television films Year Title Role Notes Source 2005 Digimon Adventure 02: Revenge of Diaboromon Kari Kamiya 2008 Wubbzy's Big Movie! Widget, Huggy, Old Lady Zamboni 2013 Curious George Swings Into Spring Allie, Balloonist 2013 Curious George: A Halloween Boo Fest Allie 2021 The Loud House Movie Lisa Loud, 1600's Lisa 2022 Trick or Treat Scooby-Doo! Prisoner Costume Teen, Superhero Boy, Musketeer 3 2024 No Time to Spy: A Loud House Movie Lisa Loud List of voice performances in feature films Year Title Role Notes Source Digimon: The Movie Kari, Young Kari Puss in Boots Additional Voices ===Video games=== List of voice performances in video games Year Title Role Notes Source Baldur's Gate Girl EverQuest Various characters Adiboo: Discover series Adiboo Diablo II: Lord of Destruction Assassin Digimon Rumble Arena Kari Warcraft III: Reign of Chaos Jaina Proudmoore Nickelodeon Party Blast Jimmy Neutron Warcraft III: The Frozen Throne Jaina Proudmoore Tak and the Power of Juju Dinky Juju Tak 2: The Staff of Dreams Dinky Juju EverQuest II Various characters Tak: The Great Juju Challenge Dinky Juju Psychonauts Milka Phage Barnyard Zak Boy, various Nicktoons: Attack of the Toybots Bustup Ballerina, Mr. Huggles, Springy Rabbit de Blob Comrade Black, Zip, Graydians FusionFall Juniper Lee White Knight Chronicles Various de Blob 2 Comrade Black, Papa Blanc, Inkies Once Upon a Monster Shelby World of Warcraft: Legion Korine Kingdom Hearts HD 2.8 Final Chapter Prologue Chirithy Kingdom Hearts III Chirithy Kingdom Hearts III Re:Mind Chirithy Legends of Runeterra Crackshot Corsair, Ava Achiever Kingdom Hearts: Melody of Memory Chirithy Learn Through Music Leo the Lion (singer) Hooked on Phonics Pig Wig ==References== ==Other websites== * * * * * Category:American voice actors Category:1967 births Category:American television actors Category:Actors from Pennsylvania",
 "title": "Lara Jill Miller"
}