{
 "id": "911774",
 "text": "Andrew Breitbart (February 1, 1969 - March 1, 2012) was an American conservative and libertarian political commentator. Breitbart was the founder of Breitbart News, a conservative news and opinion website, in addition to HuffPost, often considered a liberal website. Often considered a prominent conservative voice, Breitbart was born in Los Angeles, California. Breitbart was Jewish. Breitbart helped in the early stages of both HuffPost and the Drudge Report, and later founded Breitbart News, a conservative website intended as a right-wing HuffPost. He was a key figure in the Anthony Weiner sexting scandal, the firing of Shirley Sherrod, and the ACORN 2009 undercover videos controversy. Upon Breitbart’s death, he was mourned by such figures as Mitt Romney, Rush Limbaugh, Glenn Beck, Tucker Carlson, and Newt Gingrich. == Early life == Breitbart was born to Irish-Americans in Los Angeles on February 1, 1969. His biological father, according to his birth certificate, was a singer of folk music. At the age of three weeks, Breitbart was adopted by a Jewish family, growing up in Brentwood, Los Angeles. Breitbart studied at Hebrew school, and had a bar mitzvah, in his youth. Theologically, Breitbart was an agnostic. Breitbart described his upbringing as apolitical. He remained \"proudly and playfully Jewish\" throughout his life, albeit not religiously orthodox. He would sing Hebrew Jewish songs at work, and be teasing toward his orthodox Jewish acquaintances for their kosher diet. Breitbart worked as a pizza delivery driver whilst in high school; he delivered to celebrities, e.g. Judge Reinhold. He earned a BA in American studies from Tulane University in 1991, graduating with \"no sense of [his] future whatsoever.\" In his early years, Breitbart was left-wing, shifting in his beliefs upon an epiphany, while watching the late 1991 confirmation hearings for Supreme Court Justice Clarence Thomas, due to what he considered unfounded attacks on the part of liberals based on former employee Anita Hill’s sexual harassment accusations. Breitbart described himself as a Reagan conservative, with libertarian sympathies. Breitbart’s conservatism was refined by listening to such conservative hosts as Rush Limbaugh, igniting an interest in learning that he had suppressed as a result of his distaste for the \"nihilistic musings of dead critical theorists\" that had dominated his studies at Tulane. In this era, Breitbart also read Camille Paglia's book Sexual Personae (1990), a massive survey of Western art, literature and culture from ancient Egypt to the 20th century, which, he wrote, \"made me realize how little I really had learned in college.\" == Political positions == Breitbart self-identified as \"eighty-five percent conservative, fifteen percent libertarian\". Category:1969 births Category:2012 deaths Category:American journalists Category:People from Los Angeles Category:Republicans (United States) Category:American Jews Category:Libertarians Category:HuffPost Category:American agnostics",
 "title": "Andrew Breitbart"
}