{
 "id": "911836",
 "text": "The White Star Line was a British shipping line founded in 1845 in the Liverpool-Australia service, in 1868 it would be renamed the Oceanic Steam Navigation Company (OSNC) now operating via North America, throughout its history it would be one of the most important shipping companies in the British Empire until its merger with the rival Cunard Line in 1934. This shipping company is best known for being the owner of the famous ocean liner RMS Titanic, famous for having sunk in the Atlantic Ocean after colliding with an iceberg, also for having owned the HMHS Britannic, which sank in the Aegean Sea in Greece during WWI, and the RMS Olympic. the only Olympic-class ocean liner to have survived until her scrapping at Rosyth, Scotland along with the Mauretania in 1935. == History == ===Origins=== The Company was founded in 1845 for transport between uuithe British Isles and Australia. by John Pilkington and Henry Wilson,. due to the start of the Australian Gold Rush in 1851, they would operate only three Clippers ships, the Red Jacket, Blue Jacket and Tayleur which would serve on the Liverpool-Australia service, the Tayleur would sink off the coast of Ireland during her maiden voyage in 1854, the company would go bankrupt in 1868 with an incredible debt of £527,000 (£57,000,000 in 2019 prices). The company would be bought by the investor and founder of the National Line, Thomas Henry Ismay, who would buy it for just £1,000 (£102,900, at 2019 prices) and which would rename the Oceanic Steam Navigation Company, even though the trade name would be would keep White Star Line. To this day, only one white star line ship, the Cherbourg French passenger tender Nomadic, has not been scrapped. == Biobliography == * * * * * * * * == References == == Further readings == * The ship's list * History of the White Star Line * Red duster page on the White Star Line * Brief company overview * Info on the original financing deal * Oldham, Wilton J., The Ismay Line: The White Star Line, and the Ismay family story, The Journal of Commerce, Liverpool, 1961 * \"A Nice Quiet Life\" by Alfred H Burlinson, an engineer who served on the Olympic, the Megantic, and Britanic == Other websites == * White Star Line at Titanic-Titanic.com * Final Demise of White Star Line Vessels * Brief history of the White Star Line – from TDTSC MN * White Star Line discussion forum at TDTSC * White Star Line Historical Documents, Brochures, Menus, Passenger Lists etc. GG Archives * White Star Line History website * Cunard-White Star Line on Chris' Cunard page Category:British transport companies Category:1845 establishments in England Category:1934 disestablishments in Europe Category:Defunct shipping companies",
 "title": "White Star Line"
}