{
 "id": "911987",
 "text": "Selim I (10 October 1470 – 22 September 1520), also known as Selim The Grim or Selim the Resolute, was the 9th Sultan and the 1st caliph of the Ottoman Empire. He is known for his conquest of the Mamluk Sultanate, which made him caliph, and also for being the father of Suleiman the Magnificent. He is also known for crushing the power of the Safavids in the Battle of Chaldiran. He ruled between 1512 and 1520. == Early life == Selim was born on October 20, 1470, and was the youngest son of Bayezid II. Most historians believed that Ayşe Hatun was his wife. == Run to throne == Selim killed his 7 brothers and their 5 sons to capture the throne. He left his son Suleiman as the only heir. == Sultan and wars == Selim’s ambitions circled through Europe and Asia. Bayezid had left the Europeans relatively quiet and so the new King first turned to the east and picked the Safavids of Iran as his first victims. The relationship between the Ottomans and the Mamluks was hostile. Both states fought for control of the spice trade, and Selim dreamed of eventually taking control of the Holy Cities of Islam. He crushed the Safavid Iranian Empire and took control of what is now Armenia, Georgia, Chechnya, Dagestan and Azerbaijan. He then defeated and crushed the Mamluks and took control of the holy Islamic cities of Mecca and Medina. His conquest of Egypt finally gave him a base to launch attacks in the west, in North Africa. After defeating the Iranian Safavids, he captured the strategic cities of Tabriz and Baghdad. After he defeated the Mamluk Sultanate of Cairo, he captured the entire Levant region and eventually conquered Egypt itself and captured Cairo. That effectively destroyed the Mamluk Sultanate and put an end to it. He captured all of its territories up to Libya in the west. He proceeded to turn his new territories into administrative divisions, the largest of them was the province of Syria. He also turned Egypt into a province with Cairo as its capital, but Egypt became under direct Ottoman control from the Ottoman capital, Constantinople. == References == Category:Sultans of the Ottoman Empire Category:1470 births Category:1520 deaths",
 "title": "Selim I"
}