{
 "id": "912068",
 "text": "Reece Joel Oxford (born 16 December 1998) is an English professional footballer who plays as a defender for Bundesliga club FC Augsburg. Oxford made his debut for West Ham United aged 16 years and 198 days, making him the club's youngest ever player, beating a record of 16 years and 221 days set in 1922 by Billy Williams. ==Club career== Oxford was born in Edmonton, London, and was a childhood supporter of Arsenal. He began playing football at Tottenham Hotspur's academy but was released from the club in 2011. He then joined West Ham United at under-13 level. He turned out for the under-18 team while still an under-15 schoolboy, and made the bench for a League Cup match in August 2014, still aged 15. On 11 January 2015, Oxford signed a long-term professional contract with West Ham. Four months later, he won the Dylan Tombides Academy Player of the Year Award. Oxford made his competitive, first team debut on 2 July 2015, aged 16, starting in midfield in a 3–0 win against Andorran club Lusitanos in a UEFA Europa League first qualifying round first leg draw. In so doing, he became West Ham's youngest ever player. He then made his Premier League debut on 9 August, playing the first 79 minutes before being substituted for Kevin Nolan as West Ham won 2–0 away to Arsenal. Following his start, Oxford became the second-youngest Premier League starter of all-time, after Jose Baxter. Ahead of the 2016–17 season, Oxford was named in The Daily Telegraph's list of the best youth prospects in English football. On his 18th birthday, 16 December 2016, Oxford signed a new, four-and-a-half year contract with West Ham. Just over one month later, he was sent on loan to Reading for the remainder of the season. He made his Reading debut on 11 March 2017 in a 3–0 away defeat to Preston North End, coming on as a second-half substitute for Paul McShane. He made five appearances, his final match being the 8 April away loss to Norwich City, 7–1. On 21 June 2017, Oxford was sent on loan to Bundesliga club Borussia Mönchengladbach for the 2017–18 season. He did not make his debut until 28 October when he came on as an 89th-minute substitute for Lars Stindl in a 1–3 win against Hoffenheim. On 12 December, Oxford made his first league start for Gladbach, against Freiburg. After the match, sporting director Max Eberl praised Oxford's development during his time at the club and stated talks had taken place over a permanent deal. His loan was cut short and he returned to West Ham on 29 December 2017. On 31 January 2018, Oxford was loaned to Borussia Mönchengladbach again. On 31 January 2019, Oxford again went out on loan, this time joining Bundesliga club FC Augsburg until the end of the season. Oxford made nine appearances for Augsburg, his final game coming in the last day of the Bundesliga season in an 8–1 defeat by Wolfsburg. On 2 August 2019, Oxford joined Augsburg permanently on a four-year deal. ==International career== Oxford has played for England up to under-20 level and captained his country at the 2015 UEFA European Under-17 Championship. The Young Lions reached the quarter-finals, and Oxford scored in the penalty shootout as they defeated Spain in a play-off for the 2015 U-17 World Cup. West Ham refused permission for him to play in the U17 World Cup in Chile, fearing that playing in an international football tournament would lead to burnout. ==Style of play== UEFA.com has described his playing style as, \"Tall and quick, he is not daunted in the face of illustrious opponents.\" On several occasions, Oxford has been compared to former West Ham academy graduate Rio Ferdinand. ==Personal life== Oxford is of Jamaican descent through his grandfather. His grandfather, Karl, is the brother of the Jamaican footballer Neville Oxford. In December 2018, Oxford was the victim of a theft when his 18-carat Rolex watch was stolen from the changing rooms at West Ham's Chadwell Heath training ground. ==Career statistics== Appearances and goals by club, season and competition Club Season League National Cup League Cup Continental Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals West Ham United 2014–15 Premier League 0 0 0 0 0 0 — 0 0 2015–16 Premier League 7 0 2 0 0 0 3Appearances in UEFA Europa League 0 12 0 2016–17 Premier League 0 0 0 0 0 0 2 0 2 0 2017–18 Premier League 1 0 2 0 — — 3 0 2018–19 Premier League 0 0 0 0 0 0 — 0 0 Total 8 0 4 0 0 0 5 0 17 0 Reading (loan) 2016–17 Championship 5 0 0 0 0 0 — 5 0 Borussia Mönchengladbach (loan) 2017–18 Bundesliga 7 0 1 0 — — 8 0 West Ham United U-21s 2018–19 — — — — 2 0 2 0 FC Augsburg (loan) 2018–19 Bundesliga 8 0 1 0 — — 9 0 FC Augsburg 2019–20 Bundesliga 12 0 0 0 — — 12 0 2020–21 Bundesliga 24 0 1 0 — — — — 25 0 2021–22 Bundesliga 30 2 1 1 — — — — 31 3 2022–23 Bundesliga 3 0 0 0 — — — — 3 0 Total 77 2 3 1 0 0 0 0 80 3 FC Augsburg II 2022–23 Regionalliga Bayern 1 0 0 0 — — 0 0 Career total 96 2 8 1 0 0 7 0 111 3 ==Honours== ===Club=== ====West Ham United==== *Under-21 Premier League Cup: 2015–16 ===Individual=== *Dylan Tombides Academy Player of the Year Award: 2015 ==References== ==Other websites== *Reece Oxford profile at the official West Ham United F.C. website * *England profile at The FA Category:1998 births Category:Living people Category:English footballers Category:Association football defenders Category:Association football midfielders Category:Reading F.C. players Category:Tottenham Hotspur F.C. players Category:West Ham United F.C. players Category:Premier League players Category:Black British sportspeople Category:FC Augsburg players",
 "title": "Reece Oxford"
}