{
 "id": "912042",
 "text": "Elsa Klensch ( Aeschbacher; 21 February 1930 – 4 March 2022) was an Australian-American journalist, novelist, and television personality, often working in the world of fashion. She was the producer and host of Style with Elsa Klensch, CNN's weekly fashion and design television program, which ran from 1980 to 2001. ==Biography== Klensch was born on 21 February 1930 in Cooranbong, in the Lake Macquarie District of New South Wales, to Johann Ernst and Mary Margaret (née Miles) Aeschbacher. She was married to Charles Klensch, whom she met in Hong Kong while he was on leave from his post as Saigon, South Vietnam, news bureau manager for the American Broadcasting Company. They were married in 1966 in wartime Saigon and then settled in New York City. Klensch worked at the Sydney Telegraph, Australian Broadcasting Corporation, and the Public Information Office of the Territory of Papua and New Guinea. She edited the Hong Kong Trade Bulletin, Women's Wear Daily, and was senior fashion editor at Vogue, Harper's Bazaar, New York Post, and for WCBS-TV. She hosted and produced Style with Elsa Klensch, which ran from 1980 to 2000 on CNN. ==Honors and awards== Her honors included: *Council of Fashion Designers of America (CFDA) in 1987 cited Klensch for “Consistently bringing international fashion to the largest audience in the history of television, and for consistently “getting the story first and getting it right.” In 1999, she received a second CFDA Award for “career achievement in fashion journalism.” *Anti-Defamation League's 1995 Woman of Achievement Award. *Fashion Group International 1966 Superstar Award. * Order of Merit (Ordine al Merito) from the Italian government in 1988 for “distinguished reporting on Italian design, craftsmanship and style.” * Honorary Doctorate of Fine Arts from the International Fine Arts College in Miami in 1990, which cited her “outstanding contribution to the international fashion and design community and her continuing inspiration for students of fashion and interior design.” *Elected to the International Best Dressed Hall of Fame List in 1990. * Commencement address at New York's Fashion Institute of Technology (Class of 2001). * Distinguished Achievement Award of the Laboratory Institute of Merchandising, New York City (2005). * Election to Fashion Media Hall of Fame at Kent State University. She served on the Kent State University Fashion Department Advisory Board. New York's Metropolitan Museum of Art acquired the CNN archive of a thousand weeks of Style with Elsa Klensch for its Costume Institute. Member and former vice president of the Fashion Group International. Member of The Authors Guild, the Society of Authors (UK), Mystery Writers of America, and Sisters in Crime. ==Death== Klensch died in New York City on 4 March 2022, at the age of 92. ==Notes== ==Other websites== * * Internationally renowned fashion journalist (Retrieved 24 March 2008) * New Yorker Magazine article 20 September 1999 Category:1930 births Category:2022 deaths Category:CNN people Category:Writers from New South Wales",
 "title": "Elsa Klensch"
}