{
 "id": "912086",
 "text": "Markus Weinzierl (born 28 December 1974) is a German football coach, who last managed 1. FC Nürnberg. As the manager of Jahn Regensburg, a position he held from 2008 to 2012, Weinzierl achieved promotion into the 2. Bundesliga. On 17 May 2012, Weinzierl was hired as the new manager of FC Augsburg, and was there for four years until he left the club to join Schalke 04. == Coaching career == === Jahn Regensburg === Weinzierl was hired on 24 November 2008. His first match was a 0–0 draw against Wuppertaler SV on 29 November 2008. Jahn Regensburg finished the 2008–09 season in 15th place and the following season in 16th place. Regensburg started the 2010–11 season with a 1–0 win against Werder Bremen II. In the first round of the German Cup, Arminia Bielefeld knocked out Jahn Regensburg in a shoot–out. The match had finished in a 1–1 draw. In the 2010–11 season, Regensburg finished in eighth place and were knocked out of the German Cup in the first round after losing 3–1 to Borussia Mönchengladbach. Regensburg finished in third place in the 2011–12 season and advanced to the promotion–relegation playoff. They won promotion on away goals after the draw finished 3–3. Weinzierl finished with a record of 49 wins, 48 draws, and 42 losses in 139 matches. === FC Augsburg === Weinzierl was named head coach of FC Augsburg on 17 May 2012. His first match in–charge was on 17 August 2012 against SV Wilhelmshaven in the German Cup, which they won, 2–0. They ended up eliminated in the round of 16. In his first season, Weinzierl won only one match in the first–half of the season. They ended the season in 15th place and two points clear of the relegation zone. Augsburg started the 2013–14 season with a 2–0 win against RB Leipzig in the German Cup. Augsburg defeated Bayern 1–0 to end their 53–match undefeated streak. This was also the first time that FC Augsburg defeated Bayern. The last time a club from Augsburg defeated Bayern was when BC Augsburg won on 6 August 1961. Augsburg finished the 2013–14 season in eighth place. Augsburg started the 2014–15 season with a 1–0 loss to 1. FC Magdeburg in the German Cup. On 5 April 2015, Weinzierl extended his contract at Augsburg until 2019. on 9 May 2015, Augsburg defeated Bayern Munich in his 100th Bundesliga match as head coach. Augsburg finished the season in fifth place. Augsburg started the 2015–16 season with a 3–1 win against SV Elversberg in the German Cup. Augsburg also participated in the Europa League. Augsburg were eliminated in the second round by Liverpool. Augsburg finished the season in 12th place. Weinzierl finished with a record of 56 wins, 32 draws, and 66 losses. === Schalke 04 === On 3 June 2016, Weinzierl became Schalke 04 manager. His first match was a 4–1 win in the German Cup against FC 08 Villingen. He was sacked on 9 June 2017. He finished with a record of 21 wins, 13 draws, and 16 losses in 50 matches. === VfB Stuttgart === On 9 October 2018, Weinzierl became new head coach of VfB Stuttgart. He replaced Tayfun Korkut with a contract until June 2020. His first match as Stuttgart's head coach was a 4–0 loss to Borussia Dortmund on 20 October 2018. He was sacked on 20 April 2019. He finished with a record of four wins, four draws, and 15 losses. === Return to FC Augsburg === On 26 April 2021, Weinzierl returned to FC Augsburg as head coach. Augsburg were in 13th place and four points above the relegation playoff spot when Weinzierl took over as head coach. ===1. FC Nürnberg=== Weinzierl was hired on 4 October 2022 as manager for 1. FC Nürnberg. He took the reins from Robert Klauß who was sacked the day prior after leading the Franconian club to 14th in the table after Match Day ten in the 2022–23 2. Bundesliga season. Just four months later, he was sacked after a 5-0 loss to FC Heidenheim. Weinzierl finished with a record of four wins, four draws, and five losses. ==Coaching record== Team From To Record Jahn Regensburg 24 November 2008 30 June 2012 FC Augsburg 1 July 2012 3 June 2016 FC Schalke 04 3 June 2016 9 June 2017 VfB Stuttgart 9 October 2018 20 April 2019 FC Augsburg 26 April 2021 30 June 2022 1\\. FC Nürnberg 4 October 2022 20 February 2023 Total — == References == == Other websites == * Category:1974 births Category:Living people Category:German footballers Category:Association football midfielders Category:German football managers Category:FC Schalke 04 managers Category:Bundesliga managers Category:SSV Jahn Regensburg managers Category:VfB Stuttgart managers",
 "title": "Markus Weinzierl"
}