{
 "id": "91213",
 "text": "The player piano is a piano with an automatic mechanism so that it can play by itself. The mechanism may be pneumatic, mechanical, or electrical. A more modern kind of player piano uses MIDI. In the pneumatic type of player piano, the air comes from a pump operated by the player's feet, and in some later models, an electric pump. Inside the piano are paper rolls which have holes punched in them. These holes release air which in turn triggers the keys to play. When the player piano plays itself the keys of the piano can be seen moving by themselves. The player piano became popular in the late 19th and early 20th century. Mass-produced pianos were popular in people's homes then, and more and more people bought sheet music. By the 1920s the player piano started to become less popular as the gramophone had been invented. The \"Pianola\", a popular type of player piano, was patented in 1897 by Edwin Votey of the Aeolian Company. He chose the name as a combination of the words \"piano\" and \"Aeolian\", from the company he worked for.Arthur W.J.G. Ord-Hume. \"Player piano.\" In Grove Music Online. Oxford Music Online, http://www.oxfordmusiconline.com He first built a prototype in his Detroit home in 1895. This device was fitted with control levers so that the player (\"player pianist\" or \"pianolist\") could play in the way he wanted. The pianola made it possible for the player to sound as if he was playing very difficult music that he was not capable of playing. At the same time he could control the performance. The word \"pianola\" became used as a general word for all player pianos in the early 20th century, even though it was just one kind. Later, \"player piano\" became the most common term. A player piano is the same as any other piano except it is fitted with a pneumatic player action, which plays paper rolls. This mechanism consists of about one hundred bellows, large and small, the smaller ones being called pneumatics of which there are 88, one for each note on the piano. The largest are the foot operated ones, called the bellows. Other pneumatics of varying sizes operate the roll motor, tracking device, motor speed governor, and the sustain and soft pedals. ==References== Category:Percussion instruments",
 "title": "Player piano"
}