{
 "id": "912157",
 "text": "A repunit is a number like 11, 111, or 1111. It only has the digit 1 in it. It is a more specific type of repdigit. The term stands for repeated unit and was coined in 1966 by Albert H. Beiler in his book Recreations in the Theory of Numbers. A repunit prime is a repunit that is also a prime number. Primes that are repunits in base-2 are Mersenne primes. == Definition == The base-b repunits can be written as this where b is the base and n is the number that you are checking in whether or not it is a repunit: : R_n^{(b)}\\equiv 1 + b + b^2 + \\cdots + b^{n-1} = {b^n-1\\over{b-1}}\\qquad\\mbox{for }|b|\\ge2, n\\ge1. This means that the number Rn(b) is made of of of n copies of the digit 1 in base-b representation. The first two repunits base-b for n = 1 and n = 2 are : R_1^{(b)}={b-1\\over{b-1}}= 1 \\qquad \\text{and} \\qquad R_2^{(b)}={b^2-1\\over{b-1}}= b+1\\qquad\\text{for}\\ |b|\\ge2. The first of repunits in base-10 are with : 1, 11, 111, 1111, 11111, 111111, ... . Base-2 repunits are also Mersenne numbers Mn = 2n − 1\\. They start with : 1, 3, 7, 15, 31, 63, 127, 255, 511, 1023, 2047, 4095, 8191, 16383, 32767, 65535, ... . == Factorization of decimal repunits == Prime factors that are are \"new factors\" that haven't been mentioned before. Basically, the prime factor divides Rn but does not divide Rk for all k < n. For more information, see Factorization of repunit numbers. {| R1 = 1 R2 = R3 = · R4 = 11 · R5 = · R6 = 3 · · 11 · · 37 R7 = · R8 = 11 · · 101 · R9 = 32 · 37 · R10 = 11 · 41 · 271 · The smallest prime factors of Rn for n > 1 are : 11, 3, 11, 41, 3, 239, 11, 3, 11, 21649, 3, 53, 11, 3, 11, 2071723, 3, 1111111111111111111, 11, 3, 11, 11111111111111111111111, 3, 41, 11, 3, 11, 3191, 3, 2791, 11, 3, 11, 41, 3, 2028119, 11, 3, 11, 83, 3, 173, 11, 3, 11, 35121409, 3, 239, 11, ... == Related pages == * Repeating decimal * Repdigit == Footnotes == === Notes === === References === == Further reading == * * * * * * * * * == Other websites == * * The main tables of the Cunningham project. * Repunit at The Prime Pages by Chris Caldwell. * Repunits and their prime factors at World!Of Numbers. * Prime generalized repunits of at least 1000 decimal digits by Andy Steward * Repunit Primes Project Giovanni Di Maria's repunit primes page. * Smallest odd prime p such that (b^p-1)/(b-1) and (b^p+1)/(b+1) is prime for bases 2<=b<=1024 * Factorization of repunit numbers * Generalized repunit primes in base -50 to 50 Category:Integer sequences",
 "title": "Repunit"
}