{
 "id": "912153",
 "text": "Dmitry Stepanovich Bortniansky (; ; 28 October 1751 in Glukhov 10 October 1825 in St. Petersburg) was a Russian and Ukrainian composer and musician. He was an important composer of Orthodox church music. ==Life== ===Early life=== Bortniansky was born in Glukhov, Russian Empire (now in Ukraine). He studied music and sang in the local church. People noticed that he had a beautiful voice. So, he was chosen to become a singer in the imperial chapel choir in St. Petersburg. He was able to study music and composition in St. Petersburg. He studied music with Baldassare Galuppi. Galuppi returned to Venice in 1768. Galuppi asked Empress Catherine to send Bortniansky to Italy. Catherine accepted this request. She sent Bortniansky to Venice. In Venice, Bortniansky continued his training with Galuppi. In 1776, his first opera, Creonte was performed in Venice. However, it was not a success. So, he wrote two more operas, Alcide and Quinto Fabio in 1778. These were successful. In Italy, he also wrote music for Catholic liturgy. This includes an Ave Maria. ===Career=== Bortniansky returned to St. Petersburg in 1779. He became a composer in the imperial court chapel. In 1783, he became the Kapellmeister for Prince Paul. In 1796 Prince Paul became Emperor of Russia. He made Bortniansky the director of the Imperial Chapel. The imperial court chapel was in a bad condition. The singers were not talented. They were not disciplined. Bortniansky worked to improve the chapel. He improved the living conditions of singers. He increased the singer's salaries. He made sure that the singers received proper education. He introduced choral music from Western European composers. This includes Mozart, Handel, Haydn, and Beethoven. In 1816, the imperial court chapel received a monopoly for all church music. This means that Bortniansky had full control of the church music in the Russian Empire. He gets to say if a piece of church music can be published or not. However, Bortniansky never published any of his own compositions. Bortniansky died in St Petersburg on October 10, 1825. It is said that he invited the court chapel to his house before he died. He wanted to hear his favorite choral concerto, Vskuyu Priskorbna Yesi, Dusha Moya? (English: \"Why are you mournful, O my soul?\"). He died after the choir finished singing. ==Music== Bortniansky's greatest contribution was his church music. He was an important composer of the choral concerto. He was not allowed to use musical instruments in his church music. This is because the Orthodox Church does not allow musical instruments in their church. Bortniansky wrote over 100 religious pieces. Tchaikovsky edited his works after he died. Tchaikovsky later regretted his decision. He did not think that Bortniansky's music was good. He thought that Bortniansky's music did not fit Russian Orthodox liturgy. On the other hand, Hector Berlioz praised Bortniansky's music. ==Notes== ==References== Category:1751 births Category:1825 deaths Category:Russian composers Category:Ukrainian composers",
 "title": "Dmitry Bortniansky"
}