{
 "id": "912248",
 "text": "Werner Olk (born 18 January 1938) is a German former professional football player and manager. == Club career == Olk started his football career as a youth player with SG Letter 05 (Hanover region) in 1948 and eventually switched into the youth team of TuS Seelze. Before his transfer to Bayern Munich, he played 1956–57 in the Oberliga Nord with Arminia Hannover and after the relegation of the club from 1957 to 1960 in the second tier, which in this part of Northern Germany was the Amateuroberliga Niedersachsen. He spent his career in the 1960s through to 1970 with German club Bayern Munich in the Oberliga Süd and the Bundesliga. His honors with Bayern include the DFB-Pokal in 1966, 1967 and 1969; winner of the German Championship in 1969; and winner of the European Cup Winners' Cup in 1967. After the promotion to the Bundesliga in 1965 until 1970, Olk served as Bayern's captain, a function in which he was succeeded by Franz Beckenbauer. == International career == Olk won his only cap for the West Germany national team in 1961. He was an available member of the German squad at the 1962 FIFA World Cup in Chile. In the amateur squad of the Germany national team, Olk was called up three times. He was also called up into the youth national team in 1961 for a match against England. == Coaching career == After his time with Bayern, Olk became player- manager with Swiss second division side FC Aarau. He stayed there until 1973, although he had been sacked by December 1972, and was replaced in this role by Jiří \"Georges\" Sobotka.St. Galler Trainer: Der sechste Deutsche, St. Galler Tagblatt, 17 September 2015 Afterwards, Olk became a manager for German clubs such as Eintracht Braunschweig, SV Darmstadt 98 (with which he achieved promotion to the Bundesliga in 1981), SC Freiburg, SC Preußen Münster, and Karlsruher SC (with which he achieved promotion to the Bundesliga in 1984). He also had a brief engagement managing St. Gallen in the Swiss League during the 1985–86 season. From 1990 to 1992, Olk coached the Morocco national team, with which he qualified for the African Nations Cup in January 1992 and the Olympic Games later in the same year in Barcelona. Morocco remained in both competitions without win. From 1995 to 1997, he was in charge of El Zamalek of Cairo, Egypt, with which he won the African Cup of Champions Clubs of 1996, where they prevailed in the finals over Nigeria's Shooting Stars SC. Olk also had two spells as assistant coach at Bayern Munich. From 1975 to 1977, he was assisting Dettmar Cramer in a period when the club the European Champions' and Intercontinental Cups of 1977. Between 1986 and 1988, he served under Udo Lattek and Jupp Heynckes, being part of the team that won the German championship of 1987.Dietrich Schulze-Marmeling: Die Bayern. Die Geschichte des deutschen Rekordmeisters. Verlag Die Werkstatt, Göttingen 2006, . ==Career statistics== Appearances and goals by club, season and competition Club Club League Cup Continental Total Division Apps Goals Apps Goals Apps Goals Apps Goals Bayern Munich Oberliga Süd 1960–61 27 2 1961–62 29 0 1962–63 20 0 Regionalliga Süd 1963–64 17 0 1964–65 29 0 Bundesliga 1965–66 28 0 1966–67 32 1 1967–68 32 0 1968–69 34 1 1969–70 18 0 Career total 266 4 ==References== ==Other websites== * * * * Category:1938 births Category:Living people Category:Association football defenders Category:German footballers Category:German football managers Category:FC Augsburg managers Category:Karlsruher SC managers Category:FC Aarau managers Category:Eintracht Braunschweig managers Category:SC Freiburg managers Category:SV Darmstadt 98 managers Category:FC St. Gallen managers",
 "title": "Werner Olk"
}