{
 "id": "912383",
 "text": "Action movie is a movie genre in which the protagonist is put into a series of events that usually have violence and physical actions. The genre is usually about a resourceful hero fighting against high odds. These movies often have life-threatening situations, a villain, or a chase which usually ends in victory for the hero. Action movies became cheaper and easier to make as computer-generated imagery (CGI) changed. Action sequences and other visual effects that needed stunt crews were more expensive in the past. Reactions to action movies with a large amount of CGI have been mixed. Some movies use CGI to create events that are not realistic and are unbelievable. Action has been a part of movies for a long time but the \"action movie\" genre did not start until the 1970s along with the increase of stunts and special effects. This genre is often used with the thriller and adventure genres. It can also have elements of comedy, drama and spy fiction. Screenwriter Eric R. Williams says action movies are one of 11 super-genres in his screenwriters’ taxonomy. He says that all feature-length narrative movies can be classified by these super-genres. The other 10 super-genres are Crime, Fantasy, Horror, Romance, Science Fiction, Slice of Life, Sports, Thriller, War and Western.Williams, Eric R. (2017). The screenwriters taxonomy : a roadmap to collaborative storytelling. New York, NY: Routledge Studies in Media Theory and Practice. ISBN 978-1-315-10864-3. OCLC 993983488. P. 21 ==History== ===Early action movies=== Some historians say The Great Train Robbery (1903) was the first action movie. During the 1920s and 1930s, action-based movie were often swashbuckling adventure movie. In these movies actors such as Douglas Fairbanks used swords. Indian action movies of this time were known as stunt movies. The 1940s and 1950s saw \"action\" in a new form. Many movies were war and cowboy movies. Alfred Hitchcock started the spy-adventure genre. He also began the use of action-oriented \"set pieces\" those used in North by Northwest (1959). The movie led producers Albert R. Broccoli and Harry Saltzman to create their own spy-adventure in the James Bond series. These movies were based the novels of Ian Fleming. In Japan, the 1950s saw the jidaigeki action movies. The most notable of these were the samurai movies made famous by Akira Kurosawa. His 1954 movie Seven Samurai is said to be one of the greatest action movie of all time. The movie is often seen as one of the most \"remade, reworked, referenced\" movie in cinema. It made the \"assembling the team\" trope popular. It has become a common trope in many action and heist movies. The look, plot and dialogue of the movie have affected many people who make movies. They range from George Lucas and John Landis to Quentin Tarantino and George Miller. Kurosawa's Yojimbo (1961) was also remade as Sergio Leone's A Fistful of Dollars (1964). Fistfull of Dollars created the \"Spaghetti Western\" action genre of Italian cinema/ Kurosawa's The Hidden Fortress (1958) later inspired Star Wars (1977). The James Bond movie series were the most popular action movies of the 1960s. They created the \"resourseful hero\". This character type is used in most modern-day action movies: . These larger-than- life characters were a \"one-man army\". They could defeat the villians in many creative ways. ==References== ==Further reading== * * * * * * ==Other websites== * IMDB Popular Action Titles * Category:movie genres",
 "title": "Action movie"
}