{
 "id": "912321",
 "text": "Marion Vreedendaal-de Groot (born 1940) is a Dutch former Paralympic table tennis player and swimmer from Amsterdam. At the 1964 Summer Paralympics, she won a gold and silver medal in table tennis, and another gold medal in swimming. She became world champion at the 1962 Stoke Mandeville Games. == Biography == She played field hockey with club HIC in Amsterdam, played tennis and was a swimmer. In November 1960, when she cycled in Amsterdam, she was hit by a car. Because she had broken her neck, she was paralyzed and had to use a wheelchair. At the rehabilitation center she got in touch with para sports. She started with para table tennis to train her balance and reaction time. After 20 months in the rehabilitation center she could go back home in February 1963. Already in 1962, she had competed in table tennis at the 1962 Stoke Mandeville Games and won the gold medal. She was a member of the “Amsterdamse Sportclub”. She competed regularly at competitions, including in Maastricht and Brussels. Ahead of the 1964 Summer Paralympics she trained with a group of 45 people weekly in Amersfoort at the “Juliana van Stolbergkazerne”. She practiced table tennis, archery, javelin throw and wheelchair basketball. Initially, she would only participate in table tennis. She was scared to start swimming because she was paralyzed. However, she tried it and was able to swim. She decided also to compete in para-swimming. From that training group, 11 athletes were selected for the Paralympics. At the Paralympics she competed in disability class A, the most impaired class. In table tennis she competed in the events that are labeled by the IPC as “men’s events”. She won a gold, silver and bronze medal. Together with Gerard Jacobs she won the gold medal in the Men's Doubles A1 event and individually she won bronze. In swimming she won the silver medal in the Women's 25 m Freestyle Supine complete class 1 event behind Evelyn Mulry Moore, the only other competitor. After returning from the Paralympics she received a huge number of congratulations, including a telegram of the Queen of the Netherlands and prince. She became a member of honor of field hockey club HIC. In November 1964 she competed at the international wheelchair basketball tournament at the Rai Amsterdam. She was a designer and translator at the science magazine Elsevier and was secretary of the “Amsterdamse Sportclub”. She married on 9 June 1966 in Amsterdam to Ph. Vreedendaal. == References == Category:1940 births Category:Paralympic gold medalists for the Netherlands Category:Living people Category:Dutch table tennis players Category:Swimmers with disabilities",
 "title": "Marion de Groot"
}