{
 "id": "912468",
 "text": "An observation arc (or arc length) of a Solar System body is the amount of time between its earliest and latest observations. It is used for finding its path. It is usually given in days or years. It is used asteroids and comets to find where they go. == Short arcs == A very short arc makes an inaccurate result. Sometimes, the original amount of time is short to figure out if something orbits Earth or the asteroid belt. For example, was thought to be a trans-Neptunian dwarf planet after an arc-length of one day. Now it is known to be in the 1 km main-belt asteroid. was thought to be a Mars-crossing asteroid that could be a threat to Earth, but was later found to be another main-belt asteroid. An observation arc less than 30 days can make it difficult to figure out an Inner Solar System object more than a year after the last observation. It can make the planet lost. Trans-Neptunian objects with observation arcs less than a few years usually have bad results.TNOs really do require patience; 2-3 years is only just enough to say anything about the orbit parameters – Astronomer Michele Bannister (4 April 2018) As a general rule objects discovered when they are currently farther from the Sun will have greater uncertainties in their initial orbits if the observation arcs are short. was discovered to be over 100 AUs from the Sun and was observed 9 times over 2 years.JPL Small-Body Database Browser for 2018 AG37 It needs an arc of many years, however to figure out the furthest distance from the sun. had 4 observations in 1 day.JPL Small-Body Database Browser for 1999 DP8. Discovery date Ephemeris table setting: #39. Range & range-rate = 6.8E+11 / AU / 3-sigma = 1500 AU It has error bars that are so big that don't really mean anything because. When it was first discovered, is estimated to have been from Earth. It took an observation arc of about 200 days to confirm that there was an impact on Mars by Oort cloud comet C/2013 A1 (Siding Spring). == Interstellar objects == Interstellar objects usually need an arc of 2–3 weeks with hundreds of observations to confirm that it has a hyperbolic excess velocity (interstellar speed) of more than a few km/s. == Earth approaches == Uncertainty in Earth approach distance by comets currently further than Uranus that have not been observed in the last ~20 years Comet Observation arc Number of observations Uncertainty parameter Earth approach date Uncertainty in distance from Earth Reference Comet Swift–Tuttle 257 years 652 0 2126-Aug-05 ±10 thousand km 0.9 years 886 2 2147-Mar-23 ±2 million km C/1991 L3 (Levy) 1.6 years 125 3 2094-Aug-01 ±15 million km The Comet Swift–Tuttle has a 257-year observation arc. It's closest approach to Earth on 5 August 2126 is about ±10 thousand km.JPL Small-Body Database Browser for Comet Swift–Tuttle With an observation arc of ~1 year, the uncertainty in 's closest approach to Earth on 23 March 2147 is about ±2 million km.JPL Small-Body Database Browser for C/2001 OG108 (Close approach uncertainty: (MaxDist of 0.434) – (MinDist of 0.408) * 149597870.7 = 3.9 million km) == Related pages == * == References == == Other websites == * How to determine the orbit of a comet? (ESA 7 March 2014) * * Category:Asteroids Category:Orbits",
 "title": "Observation arc"
}