{
 "id": "912525",
 "text": "Taiyo Sentai Sun Vulcan is a Japanese television series. It is the 5th in Toei's Super Sentai series. It was broadcast from February 7, 1981, to January 30, 1982, and is the Super Sentai series to serve as a direct sequel to its previous series (Denshi Sentai Denjiman). It is also the first and only series in the franchise to have an all-male Super Sentai team and the first to have fewer than five members in the core team. ==Plot== The threat of the Machine Empire Black Magma causes the United Nations to establish the Solar Sentai at a summit. From the UN's Guardians of World Peace's (GWP) air force, navy, and rangers, Commander Arashiyama assembles three specialists to become Sun Vulcan. When Black Magma learns of this, he attacks the GWP's base, but Sun Vulcan debuts in time to save it. Hell Saturn prays to the Black Solar God and is rewarded with a revived Queen Heridan, now a cyborg with a mechanical heart and a metallic Afro. Black Magma multiple plots, even with Herdian's aid, fails. Following the death of 01, Amazon Killer, (a Vader) arrives from space, destroying the Sun Vulcan Base. A new Vulcan Base is then built. The original Vul Eagle, Ryusuke Ohwashi, is replaced by a friend and master of the sword, Takayuki Hiba (who first appeared on episode 23). ==Characters== ===Sun Vulcan=== Actor Name Rangers Ryusuke Kawasaki Ryusuke Ohwashi Vul Eagle Takayuki Godai Takayuki Hiba Vul Eagle Kinya Sugi Kinya Samejima Vul Shark Asao Kobayashi Asao Hyou Vul Panther ==Cast== * Ryusuke Ohwashi / Vul Eagle I: Ryūsuke Kawasaki * Takayuki Hiba / Vul Eagle II: Takayuki Godai * Kinya Samejima / Vul Shark: Kin'ya Sugi * Asao Hyou / Vul Panther: Asao Kobayashi * Daizaburo Arashiyama: Shin Kishida * Misa Arashiyama: Yumi Nemoto * Narration: Tōru Ōhira * Sun Vulcan Robo: Eiji Kinae ==Songs== ; Opening theme * \"Taiyo Sentai Sun Vulcan\" ** Lyrics: Keisuke Yamakawa ** Composition: Michiaki Watanabe ** Artist: Akira Kushida & Koorogi '73 ; Ending theme * \"Wakasa wa Plasma\" (\"Youth is a Plasma\") ** Lyrics: Keisuke Yamakawa ** Composition: Michiaki Watanabe ** Artist: Akira Kushida ** Episodes: 1-33 * \"Ichi tasu Ni tasu Sun Vulcan\" (\"One plus Two plus Sul Vulcan\") ** Lyrics: Keisuke Yamakawa ** Composition: Michiaki Watanabe ** Artist: Akira Kushida ** Episodes: 34-50 Category:Super Sentai series Category:1981 television series debuts Category:1982 television series endings",
 "title": "Taiyo Sentai Sun Vulcan"
}