{
 "id": "912503",
 "text": "Battle Fever J is a Japanese television series. It is the 3rd in Toei's Super Sentai series. Battle Fever J was a co-production of Toei Company and Marvel Comics. A total of 52 episodes aired on TV Asahi between February 3, 1978 and January 26, 1980. ==Codenames== The team have codenames named for countries around the world, also respectively named in their theme song: Battle France, Battle Cossack (Soviet Union), Battle Kenya, Miss America (United States) and Battle Japan. ==Robots== This was the first series in the Super Sentai franchise where the heroes must control giant robots to defeat a monster who itself has grown to a gigantic size. ==Black & Orange Ranger== Battle Fever J also marks the first appearance of a Black and Orange Ranger in the franchise. ==Other new things== Toei's tokusatsu adaptation of Spider-Man was the first to introduce this format and was also the inspiration for this series. The series was also partially inspired by the Marvel Comics character Captain America. Battle Fever J was also the first series to use the term Super Sentai (unlike the previous two who were just called Sentai, without the \"Super\") until Toei announced in 1995 that its predecessors Himitsu Sentai Gorenger and J.A.K.Q. Dengekitai were also part of the Super Sentai series, when Chouriki Sentai Ohranger was announced as the 19th Super Sentai team. ==Plot== General Kurama assembles four young agents who had been dispatched around the world for training. They are joined by FBI investigator Diane Martin, whose father was murdered by Egos. The five don powered suits to become the Battle Fever team. The Battle Fever team's trump card is the Battle Fever Robo. Egos tries to stop the construction of the Robot. Although the monsters they send to perform this task are defeated one by one by the Fever team. Egos then unleashes the \"younger brother\" of the Buffalo Monster, a giant robot replica of its \"older brother\". The Robot, fortunately, is finished in time. Aboard it, the Fever team defeats the Buffalo Monster and its successors. The Fever team never stops, even when is lost two of its members (the original Miss America and Battle Cossack). With new members, the team defeats Hedder, now the Hedder Monster, and breaks into Egos' headquarters, where they are fed into the Egos Monster Making Machine so that they may be used as material for a Battle Fever Monster. The team destroys the machine and slays the mysterious deity Satan Egos himself with the Lightning Sword Rocketter sword-throwing move. ==Characters== ===Battle Fever=== Actor Name Rangers Hironoki Tanioka Masao Den Battle Japan Yukio Itou Kensaku Shiraishi Battle Cossack Daisuke Ban Makoto Jin Battle Cossack Narimitsu Kurachi Kyosuke Shida Battle France Kenji Ohba Shirou Akebono Battle Kenya Diane Martin Diane Martin Miss America Naomi Hagi Maria Nagisa Miss America ==Cast== * Masao Den / Battle Japan: Hironori Tanioka * Kensaku Shiraishi / Battle Cossack I: Yukio Itou * Makoto Jin / Battle Cossack II: Daisuke Ban * Kyosuke Shida / Battle France: Narimitsu Kurachi * Shiro Akebono / Battle Kenya: Kenji Ohba * Diane Martin / Miss America I: Diane Martin * Maria Nagisa / Miss America II: Naomi Hagi * General Tetsuzan Kurama: Chiyonosuke Azuma * Keiko Nakahara: Noriko Itō * Masaru Nakahara: Takumi Satō * Tomoko Ueno: Keiko Kanno * Yuki Ueno: Michiyo Satō * Akio Hamamura: Shin'ichi Yoshimiya * Shigeo Aoki: Seiji Suzuki * Narrator: Tōru Ōhira ===Guest Stars=== * Boiser Martin (Diane's father) (1 & 24): David Friedman * Black Tiger Mari (16): Mitchi Love * Mitsuru Okiyama (16): Naoya Uchida * Sayuri Kurihara (25): Lisa Komaki * Car Owner (34): Kin'ya Sugi ==Songs== ; Opening theme * \"Battle Fever J\" ** Lyrics: Keisuke Yamakawa ** Composition and Arrangement: Michiaki Watanabe ** Artist: MoJo with the Columbia Yurikago-Kai * \"Battle Fever J (Alternate Opening)\" ** Lyrics: Keisuke Yamakawa ** Composition and Arrangement: Michiaki Watanabe ** Artist: MoJo, the Columbia Yurikago-Kai, Feeling Free ; Ending theme * \"Yūshu ga Yuku\" (\"Brave Men Go\") ** Lyrics: Saburō Yatsude ** Composition and Arrangement: Michiaki Watanabe ** Artist: MoJo Category:Super Sentai series Category:1979 television series debuts Category:1980 television series endings Category:1970s Japanese television series debuts",
 "title": "Battle Fever J"
}