{
 "id": "912680",
 "text": "David Bennett Sr. (1964 – March 8, 2022) was an American medical patient. He was the first patient to have a xenotransplantation with a genetically modified heart. On January 7, 2022, aged 57, he received the heart of a gene- edited pig. He was born in Maryland. Bennett died in Baltimore, Maryland on March 8, 2022, at the age of 57. ==Disease, transplantation and death== Bennett tite suffered from advanced heart failure, accompanied by cardiac arrhythmias.https://www.washingtonpost.com/health/2022/03/09/pig-heart- transplant-bennett/ He had not made sufficient efforts to control his blood pressure. The treating physicians saw him as unsuitable for an allotransplantation. There were doubts as to whether, when human organs were so scarce, one should be given to a person who might not comply with advice after. Therefore, with Bennett's approval, an exemption was sought from the Food and Drug Administration to perform a pig heart transplant. The operation was on January 7, 2022. It was done by US heart surgeon Bartley P. Griffith at the University of Maryland Medical Center in Baltimore.https://www.washingtonpost.com/science/2022/01/11/pig-heart- transplant-genetically- modified/https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)00097-6/fulltext The clinic reported January 10 with video from the operating room and a picture of the isolated pig heart. The patient had survived the typical period of a rapid rejection reaction. He was conscious and reflected on his situation. He knows it's \"a shot in the dark,\" but it's his last chance. The clinic quoted him as saying he was looking forward to getting up soon. By January 18, Bennett was off the heart-lung machine. He could communicate with those around him.https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)00097-6/fulltext One month later it was reported that he was still in his bed. Attempts were made to get him up with physiotherapy.https://healthyduck.org/recipient-of- pig-heart-undergoing-physiotherapy-for-first-time-says-university-of-maryland- cbs-baltimore/ A rejection reaction to the foreign organ had not happened until then.Patient with transplanted pig heart is doing well Two months after the transplant, Bennett died on March 8, 2022, after his health had got worse over a few days. About two months after Bennett's death, doctors announced that he had been diagnosed with a pig virus. It was possible that the virus had been the cause of death. It could also have been silent and had no effect on the patient. A combination with other factors contributing to the cause of death can also be considered. ==References== Category:1964 births Category:2022 deaths Category:People from Baltimore Category:Heart disease Category:Organ transplant recipients",
 "title": "David Bennett Sr."
}