{
 "id": "912622",
 "text": "Choudenshi Bioman is a Japanese television series. It is the 8th in Toei's Super Sentai series. Its 51 episodes aired on TV Asahi from February 4, 1984 to January 26, 1985 with a movie being released during the show's initial run. It is the first Super Sentai series to have two females in the main five as well as the first Super Sentai series to have a female Yellow Ranger. ==Plot== The once prosperous Planet Bio is destroyed after a world war erupted over the use of a scientific discovery called \"Bio Particles\". The Planet Bio Peacekeeping Alliance, which sought to use Bio Particles for peaceful purposes, sends the giant robot Bio Robo and an assistant robot named Peebo to prevent the same tragedy from happening on Earth. Bio Robo arrives in the 15th century Japan, where it showers Bio Particles on five young individuals. Five centuries later, the descendants of these individuals, infused with Bio Particles, are chosen by Peebo and Bio Robo to become the Bioman team to protect the Earth from the Neo-Empire Gear, an organization led by mad scientist Doctor Man. ==Characters== Actor Name Rangers Ryosuke Sakamoto Shiro Go Red One Naota Ota Shingo Takasugi Green Two Akito Osuga Ryuta Nanbara Blue Three Yuki Kajima Mika Koizumi Yellow Four Sumiko Tanaka Jun Yabuki Yellow Four Michiko Makino Hikaru Katsuragi Pink Five Hikaru Kurosaki Shota Yamamori Mange Warrior ==Cast== * Shirō Gō / Red One: Ryōsuke Sakamoto * Shingo Takasugi / Green One: Naoto Ōta * Ryūta Nanbara / Blue Three: Akito Ōsuga * Mika Koizumi / Yellow Four I: Yuki Kajima * Jun Yabuki / Yellow Four II: Sumiko Tanaka * Hikaru Katsuragi / Pink Five: Michiko Makino * Shota Yamamori / Mange Warrior: Hikaru Kurosaki * Doctor Shibata: Tadao Nakamaru * Shūichi Kageyama, Prince: Hidenori Iura * Doctor Man: Munemaru Kōda * Farrah: Yōko Asuka * Farrah Cat: Yukari Oshima * Monster: Strong Kongō ===Voice Actors=== * Peebo: Yoshiko Ōta * Mettzler: Hiroshi Izawa * Jyuoh: Masahiro Anzai * Psygorn: Keisuke Yamashita * Aquaiger: Hirotaka Nagai * Messarju: Shun Yashiro * Bio Hunter Silva: Kazuo Hayashi * Narration: Ichirō Murakoshi ==Songs== ; Opening theme * \"Choudenshi Bioman\" ** Lyrics: Chinfa Kan ** Composition: Kunihiko Kase ** Arrangement: Tatsumi Yano ** Artist: Takayuki Miyauchi ; Ending theme * \"Biomic Soldier\" ** Lyrics: Kang Jin-hwa ** Composition: Kunihiko Kase ** Arrangement: Tatsumi Yano ** Artist: Takayuki Miyauchi Category:Super Sentai series Category:1984 television series debuts Category:1985 television series endings",
 "title": "Choudenshi Bioman"
}