{
 "id": "91286",
 "text": "Cervical cancer is cancer of the cervix (a part of the female body between the vagina and the uterus). It is caused by a virus called human papillomavirus (HPV). This virus can also cause certain other cancers, in both females and males. The virus can spread from one person to another when they have sex. It can also be spread by skin-to-skin sexual touching. There is now a vaccine that can prevent cervical cancer by stopping infection by this virus. Both girls and boys should get the HPV vaccine. The International Agency for Research on Cancer says, \"Cervical cancer may be eliminated as a public health problem by vaccination against human papillomavirus.\" ==Number of Women Affected== Worldwide, cervical cancer is the fourth-most common cancer in women. Worldwide, it is also the fourth-most common cause of deaths from cancer in women. In the United States, in 2023, it was the fifteenth most- common cause of deaths from cancer in women. In countries such as the United States, many women get checked regularly by a doctor. Doctors can usually stop cervical cancer from developing if a test finds a problem starting. Women in poor or developing countries often do not get tested due to the cost and the lower number of doctors and nurses. In the world, there are approximately 604,000 new cases of cervical cancer each year. In 2020, there were over 342,000 deaths from cervical cancer in the world. It is the second-most common female-specific cancer after breast cancer, accounting for around 8% of both total cancer cases and total cancer deaths in women. About 80% of cervical cancers occur in developing countries. == Cause, Prevention and Testing == Human papillomavirus infection (HPV) causes cervical cancer. Older studies said it caused more than 90% of cases. The World Health Organization's World Cancer Report now says, \"Thirteen sexually transmitted mucosal human papillomavirus (HPV) subtypes are established human carcinogens. Together, they are responsible for all cervical cancer cases globally.\" Vaccination against HPV before a young person becomes sexually active can prevent cervical cancer. Both girls and boys should get the HPV vaccine. The vaccine usually requires two doses. Some parents who are social conservatives say it is a bad idea to give young people the HPV vaccine. They think it will encourage young, people to have sex before they are married. They say their daughters won't get cervical cancer because their daughters will not have sex until they are married. The parents are not worried that their daughters could die of cervical cancer. Other parents think vaccines are more dangerous than the diseases they prevent. Vaccination is uncommon in developing countries due to the high cost or because there are few doctors and nurses to give the vaccines. Sometimes, there are no symptoms until the cancer is very developed. For this reason, pap tests have become common to diagnose this cancer. They have cut the rate of cervical cancer in half. A new test that checks for HPV may be better at detecting cervical cancer risk than the traditional pap test. The HPV test can be done at the same time. Treatments are available for cervical cancer. Cervical cancer can be cured if diagnosed at an early stage and treated quickly. Regular pap tests can detect abnormal cell growth in the cervix. A pap test, also called a pap smear, is simple medical test which should be done every year after a woman becomes sexually active. If there is a problem found, a doctor can prescribe treatments to stop it from developing into cancer. In developed countries, abnormal cell growth is usually detected and treated in this way. Women in developing countries often do not have access to health services where pap smears could be performed. If medical services do exist, women in developing countries often cannot afford the cost. Women in poor or developing countries sometimes do not even know that they should be tested. Transportation to a health office may be a problem. Cultural beliefs may make it embarrassing for a woman to ask a doctor for information or testing, especially if the doctor is a man. Cost and access to healthcare is sometimes also a problem for low income and minority (especially Hispanic and African American) women in the United States since the costs of tests may not be covered by health insurance, if they even have health insurance. The American Cancer Society recommends that women receive both a pap smear and HPV test, regardless of HPV vaccination status. There are specific recommendations depending on how old the woman is and other factors. The risk of cervical cancer can be reduced by the use of condoms, which reduce the spread of HPV when used correctly. Human papillomavirus often attaches to the cells inside the male foreskin, which is the skin covering the end of the penis. Male circumcision can reduce the spread of HPV, and therefore the incidence of cervical cancer. ==Symptoms== Cervical cancer is due to the abnormal growth of cells that have the ability to invade or spread to other parts of the body. Early on, there are often no symptoms (signs or indications.) Bleeding from the vagina (other than from normal menstruation) or other liquid leaking out of the vagina can be signs of cervical cancer. If the liquid has a bad smell, that can be a sign. Pelvic pain or pain during sexual intercourse can be a sign. Pain or vaginal bleeding after sex can be a sign. While bleeding after sex may not be serious, it may also indicate the presence of cervical cancer. A woman should ask a doctor or nurse if having any of these signs. Cervical cancer is a serious medical problem that can spread within the body and cause death. Most women who have had HPV infections, however, do not develop cervical cancer. HPV 16 and 18 strains are responsible for nearly 50% of high grade cervical pre-cancers. Other risk factors include smoking, a weak immune system, birth control pills, starting sex at a young age, and having many sexual partners, but these are less important. Genetic factors also contribute to cervical cancer risk. Cervical cancer typically develops from precancerous changes over 15 to 20 years. About 90% of cervical cancer cases are squamous cell carcinomas, 10% are adenocarcinoma, and a small number are other types. Diagnosis is typically by cervical screening followed by a biopsy. Medical imaging is then done to determine whether or not the cancer has spread. == Treatment == The cancer stage (the extent of cancer in the body) is an important factor in deciding the best treatment for cervical cancer. Other factors, such as the patient's preferences and overall health, are also important. For some people, taking part in a clinical trial may be an option. Clinical trials of new cancer drugs or treatment combinations may be available. For early cervical cancer, surgery is the first treatment. For cancer that is farther along, chemotherapy and radiotherapy can be used. Immunotherapy is sometimes used to treat cervical cancer that comes back (recurs) after it has been treated. A concern that some may have is fertility, the ability to have children. There are treatments for cervical cancer that preserve the uterus and ovaries. If the cancer is large or it has a high chance of coming back, it is likely to have treatments that will prevent pregnancy. == References == Category:Medicine Category:Cancer C Category:Obstetrics and gynecology category:Female reproductive system",
 "title": "Cervical cancer"
}