{
 "id": "912805",
 "text": "This page is a chart of the International Phonetic Alphabet. The International Phonetic Alphabet is a system of phonetic symbols. These are created and maintained by the International Phonetic Association. It is not a full list of every single sound that is in every language. == Official chart == == Vowels == == Consonants == === Pulmonic consonants === === Non-pulmonic consonants === === Co-articulated consonants === === Other consonants === * Nasal palatal approximant * Nasal labial–velar approximant * Voiceless nasal glottal approximant * Voiceless bilabially post-trilled dental stop * Voiceless bidental fricative * Voiceless upper-pharyngeal plosive * Voiced upper- pharyngeal plosive * Bilabial percussive * Bidental percussive * Sublaminal lower-alveolar percussive == Tones == Tone registers Extra-high (top) High Mid Low Extra-low (bottom) Downstep Upstep Tone contours Rising (low to high) Falling (high to low) High rising Mid rising Low rising High falling Mid falling Low falling Rising–falling (Peaking) Falling–rising (Dipping) == Auxiliary symbols == Diacritics Voiceless Breathy voiced Dental Voiced Creaky voiced Apical Aspirated Linguolabial Laminal More rounded Labialized Nasalized Less rounded Palatalized Nasal release Advanced Velarized Lateral release Retracted Pharyngealized No audible release Centralized Velarized or pharyngealized Mid central vowel release Mid-centralized Raised Voiceless dental fricative release Syllabic Lowered Voiceless velar fricative release Non-syllabic Advanced tongue root Ejective Rhoticity Retracted tongue root Affricate or double articulation Suprasegmentals Primary stress Secondary stress Long Half-long Extra-short Minor (foot) group Major (intonation) group Syllable break Linking (absence of a break) Global rise Global fall Transcription Phonetic transcription Phonemic transcription Prosodic notation Indistinguishable utterance Sound obscured == Other websites == * The International Phonetic Alphabet and the IPA Chart * Interactive IPA chart Category:Charts Category:Pronunciation",
 "title": "International Phonetic Alphabet chart"
}