{
 "id": "912932",
 "text": "Johann Mattheson (28 September 1681 – 17 April 1764) was a German composer, singer, writer, lexicographer, diplomat and music theorist. == Life == ===Early life=== Mattheson was born on September 28, 1681 in Hamburg. His father was a tax collector. Mattheson studied many things. He learned English, French, Italian, and music. He learned to play the keyboard and write music with Johann Nicholaus Hanff. He learned to sing and play different instruments with a musician named Woldag. He played the organ when he was 9 years old. Mattheson became interested in opera. He joined the Hamburg opera company in around 1690. He thought that he could learn more about music writing from operas. He wrote his first opera Die Plejades (English: \"The Pleiades\") in 1699. ===Career=== Mattheson met Handel in 1703. He became friends with Handel. They went to Lübeck together to apply for the position of organist at the Marienkirche. They met the composer Dietrich Buxtehude, who was the previous organist. They refused the position. This was because Buxtehude wanted the next organist to marry his daughter. In 1704, Mattheson got in a fight with Handel. Handel did not let Mattheson replace him as a conductor in a performance. Mattheson got angry. They fought in a duel. Mattheson almost killed Handel with his sword. But Handel was saved because of a large button on his coat. They were soon reconciled. The Hamburg opera company started to dislike Mattheson. Mattheson left the opera in 1705. He said that he had performed over 2000 performances with the opera company. In 1704, Mattheson became the teacher of Cyrill Wich. Cyrill was the son of the English ambassador to Hamburg, John Wich. Mattheson started studying English politics and history at this time. Mattheson became John Wich's secretary in 1706. He was first assigned to prepare and write reports. He traveled for diplomatic missions. He got to meet many musicians from his travels. In 1709, Mattheson married Catharina Jennings, an Englishwoman. In 1715, Mattheson became the music director of Hamburg Cathedral. He wrote some oratorios and cantatas for the church. He left this position in 1728. He was becoming deaf. He had lost his hearing completely by 1735. In 1719, he became the Kapellmesiter in the court of Holstein. Mattheson was active from 1715 to 1740. He translated English books into German. He also wrote books about music. ===Later life and death=== Mattheson's wife died on February 3, 1753. He decided to give his money to the Michaeliskirche in Hamburg. The church was destroyed by a lightning strike in 1750. He gave his money to help rebuild the church and organ. In return, Mattheson asked to be buried on the church grounds. Mattheson died on April 17, 1763 in Hamburg. Georg Philipp Telemann conducted the funeral service. He was buried in the Michaeliskirche. ==Music== It was thought that Mattheson's music were missing since the Second World War. It turns out that his music was not destroyed. They were returned from Armenia in 1998. ==Writing== Mattheson wrote books about music theory. He published a music periodical from 1722 to 1725. Mattheson included quotes from other musicians in this periodical. He often attacked other musicians in his writings. He did this without ever writing their names. He attacks older music styles in his writings. One of his most important works is Der vollkommene Capellmeister (English: \"The Perfect Kapellmeister\"). It contains things that a Kapellmeister should know. == References == Category:1681 births Category:1764 deaths Category:18th-century German composers Category:German diplomats Category:Writers from Hamburg Category:Duels",
 "title": "Johann Mattheson"
}