{
 "id": "913034",
 "text": "Pam & Tommy is an American biographical drama miniseries. It stars Lily James and Sebastian Stan. The series tells about the marriage between actress Pamela Anderson (James) and Mötley Crüe drummer Tommy Lee (Stan). The story takes place during the time when their sex tape was made public. The series is based on the 2014 Rolling Stone article \"Pam and Tommy: The Untold Story of the World's Most Infamous Sex Tape\" by Amanda Chicago Lewis, It was created for Hulu by Robert Siegel. Pam and Tommy was produced by Point Grey Pictures, Annapurna Television and Lionsgate Television. The making of the series was announced in 2018. James Franco was to direct the miniseries and play Lee. It was given a series order in December 2020 by Hulu. At that time, they said that James was to play Anderson and Stan would replace Franco. Casting announcements were made throughout 2021. Filming took place in Los Angeles between April and July 2021. The first three episodes of Pam & Tommy were first shown on Hulu on February 2, 2022. They were directed by Craig Gillespie. The rest of episodes were shown one episode each week after that. The miniseries mostly well liked by the critics. They said the cast performed very well. The series has eight episodes in it. ==Cast and characters== ===Main=== * Lily James as Pamela Anderson * Sebastian Stan as Tommy Lee * Nick Offerman as Uncle Miltie * Seth Rogen as Rand Gauthier * Taylor Schilling as Erica Gauthier ===Recurring=== * Pepi Sonuga as Melanie * Andrew Dice Clay as Butchie * Spenser Granese as Steve Fasanella * Mozhan Marnò as Gail Chwatsky * Fred Hechinger as Seth Warshavsky * Mike Seely as Hugh Hefner * Medalion Rahimi as Danielle, Erica's girlfriend ===Guest=== * Jason Mantzoukas as the voice of Tommy's penis (in \"I Love You, Tommy\") * Don Harvey as Anthony Pellicano, a private investigator (in \"The Master Beta\", \"Uncle Jim and Aunt Susie In Duluth\") * Maxwell Caulfield as Bob Guccione, the owner of Penthouse (in \"Uncle Jim and Aunt Susie In Duluth\") * John Billingsley as the Penthouse defense counsel (in \"Pamela in Wonderland\") * Adam Ray as Jay Leno * Paul Ben- Victor as Pam and Tommy's lawyer * Brian Huskey as Gambler in Debt (in \"Destroyer of Worlds\") * Clint Howard as himself playing his character Schmitz in Barb Wire (in \"Destroyer of Worlds\") ==Production== ===Development=== The series was first announced in 2018. Seth Rogen and Evan Goldberg were working on the project under their production company Point Grey Pictures. James Franco was to direct the miniseries and play Tommy Lee. By December 2020, Franco had left the series. It was announced that Hulu had approved the project. They wanted them to make eight-episodes. Craig Gillespie was to direct with Robert D. Siegel writing and Rogen and Goldberg executive producing the miniseries. Tatiana S. Riegel, who has often worked with Gillespie, was to edit the miniseries. Pamela Anderson reportedly did not want to be in the series at all. Lee was also not a part ofthe series but he supported it. The series is based on a 2014 Rolling Stone article about the story of how Anderson and Lee's sex tape was stolen and released. Siegel found it hard to believe the events had not been made into a movie or series already. Siegel and D.V. DeVincentis said that most of the \"basic plot beats\" came from that article and \"the basic mechanics\" of the events \"was pretty much what happened\". The conversations between the characters was written to be more dramatic. ===Casting=== Lily James and Sebastian Stan were cast to play the title characters. Rogen also cast in a main role. In April 2021, Nick Offerman and Taylor Schilling joined the cast in main roles. Pepi Sonuga, Andrew Dice Clay, Spenser Granese and Mozhan Marnò joining in recurring roles. In June 2021, Fred Hechinger joined the cast of the series in a recurring role. In January 2022, it was revealed that Jason Mantzoukas was voicing Tommy Lee's penis. ==Notes== ==References== Category:2022 American television series debuts Category:American drama television series Category:Hulu original series Category:Miniseries",
 "title": "Pam and Tommy"
}