{
 "id": "913128",
 "text": "The Mexican Navy (in Spanish: Armada de México) is the naval forces of Mexico and depends on the Navy Secretariat (SEMAR). It was founded on February 19, 1821. It is in charge of the protection of the Coasts of Mexico and the Exclusive Economic Zone.\"Mission and objectives\" In addition to dedicating themselves to the protection of the coasts, they are also dedicated to the protection of rivers and waterways. == Fleet == Class Image Type Ships Origin Frigates (5) Multipurpose Anti-submarine frigate F211 Ignacio Allende F212 Mariano Abasolo F213 Guadalupe Victoria F214 Francisco Javier Mina United States – ex-US Navy Reformador class Multipurpose Frigate F101 Benito Juárez Netherlands/Mexico – Ships being built in The Netherlands and Mexico. At least 8 ships planned for fleet modernisation plan. Missile boats (2) Huracán class Missile boat A301 A302 Israel – ex-Israeli Navy Patrol vessel and other Warships (35) Ocean patrol vessels P161 P162 P163 Independencia P164 Revolución P165 Chiapas P166 Hidalgo P167 Jalisco P168 Tabasco Mexico Compact Frigate / Patrol vessel P151 P152 P153 P154 Mexico Corvette P141 Sierra P143 Prieto P144 Mexico Ocean/Offshore patrol vessels P131 Holzinger P132 Godínez P133 De la Vega P134 Berriozabal Mexico Ocean patrol vessels P122 Azueta P123 Baranda P124 Bretón P125 Blanco P126 Monasterio Spain Converted Minesweeper / Ocean patrol vessels P102 Juan de la Barrera P103 Mariano Escobedo P104 Manuel Doblado P106 Santos Degollado P108 Juan N. Álvarez P109 Manuel Gutiérrez Zamora P110 Valentín Gómez Farías P112 Francisco Zarco P113 Ignacio L. Vallarta P114 Jesús González Ortega P117 Mariano Matamoros United States – ex- Coastal patrol ships (44) Coastal patrol PC331 PC332 PC333 ARM Palenque PC334 ARM Mitla PC335 ARM Uxmal PC336 ARM Tajin PC337 ARM Tulum PC338 ARM Monte Albán PC339 ARM Bonampak PC340 Chichen Iztzá Netherlands/Mexico Based on Damen Stan Patrol 4207 Coastal patrol PC202 Cordova PC206 Rayón PC207 Rejón PC208 De la Fuente PC209 Guzmán PC210 Ramírez PC211 Mariscal PC212 Jara PC214 Colima PC215 Lizardi PC216 Mugica PC218 Velazco PC220 Macías PC223 Tamaulipas PC224 Yucatán PC225 Tabasco PC226 Cochimie PC228 Puebla PC230 Vicario PC231 Ortíz United Kingdom Mexico Coastal patrol PC241 Demócrata PC242 Francisco I. Madero Mexico Coastal patrol PC271 Corriente PC272 Corso PC273 Catoche Mexico Coastal patrol PC-281 Morro PC-282 Mastún Mexico Interceptors Polaris class Small Patrol vessel 44 In service Sweden Polaris II class Small Patrol vessel 6 In service + 17 under construction Mexico Acuario A/B class Patrol In service Mexico Isla class Patrol In service Mexico Amphibious ships (3) Papaloapan class Tank landing ship A411 Papaloapan A412 Usumacinta United States – ex-USN Panuco class Tank landing ship A402 Manzanillo United States – ex-US Navy USS Clearwater County, transferred in 1972 Logistic support vessel (2) Landing ship BAL01 Montes Azules BAL02 Libertador (construction completed, inaugurated on September 10, 2012) Mexico TBD class Supply ship BAL11 Isla Madre Launched July 11, 2016. Netherlands Based on Damen Stan 5009 Fast Crew Supplier Mine counter-measure (6) Minesweeper Banderas Magdalena Kino Yavaros Chamela Tepoca United States Auxiliary vessels Huasteco class Multipurpose logistics vessel AMP01 Huasteco AMP02 Zapoteco Mexico Maya class Multipurpose ATR01 Maya ATR02 Tarasco Mexico Cuauhtemoc class Three-masted barque sail training ship BE01 Spain == References == == Other websites == * Secretary of the Navy Official site (in Spanish) * Naval Infantry official site (in Spanish) Category:Navies Category:Military of Mexico Category:Organizations based in Mexico",
 "title": "Mexican Navy"
}