{
 "id": "913170",
 "text": "The Imperial Russian Navy (in Russian: Российский императорский флот) was the navy of the Russian Empire (and its predecessor: Tsardom of Russia), from 1696 until the start of the Russian Revolution in 1917. == History == It was founded by Tsar Peter the Great. This was due to the fact that Russia did not have naval forces and the inexperience of its inhabitants in naval architecture, after a visit to Amsterdam, Tsar Peter would learn naval construction in detail, the first ship would be the Frigate Oryol (Eagle in English), after the victory against the Ottomans in Azov, the Black Sea Fleet would be created, over time the Fleet would grow. In 1740 the Baltic Fleet based in St. Petersburg would be founded after several victories against the Swedish Fleet. This was during the Russo-Turkish Wars the Black Sea Fleet would be the main fleet against the Ottoman Influence in this Sea. Near the end of the 1700s, the Caspian, White Sea and Okhotsk Flotillas would be created. ==Battles== The Russians would also make Circumnavigation trips,Norman E. Saul, Richard D. McKinzie. Russian-American Dialogue on Cultural Relations, 1776-1914 p 95. , 9780826210975 from the Pacific Coast of Russia to the north of the Hawaiian Islands, They would participate in the Napoleonic Wars against the Ottoman Navy, During the Crimean War, they would suffer a serious defeat against the Ottoman Empire, Great Britain, France and Sardinia,Grant p. 12, 13, 15, etc. continuous throughout the book then over time the fleet would increase in naval size becoming one of the largest existing fleets, During the War Against Japan, they would suffer a serious defeat which would make Russia look like a less strong country From what it appeared to be, the fleet would finally be dissolved after the Russian Revolution where it would be succeeded by the Soviet Navy in 1920. == References == == Other websites == * Russian Submarine forces history * History of the Russian Navy * Web site focusing on submarine history and the works of Irish-American inventor, John Philip Holland and his company which was known as The Holland Torpedo Boat Company. See Fulton and look under Russian submarines (Som Class) Type 7-P. * Russian submarine history can be located on this site. Category:Disbanded navies Category:1690s establishments in Europe Category:1917 disestablishments Category:1910s disestablishments in Europe Category:Disestablishments in Russia Category:Russian military organizations",
 "title": "Imperial Russian Navy"
}