{
 "id": "913190",
 "text": "Aliya Nursultanovna Nazarbaeva (, born 3 February 1980) is a Kazakhstani movie producer and businesswoman. She is the youngest daughter of Nursultan Nazarbayev, the first President of Kazakhstan. == Education == ===Musical school=== Nazarbayeva graduated from the K. Baiseitova National Musical School in Almaty. She studied at the International Relations Faculty of the Richmond University in London and the International Relations Faculty of the George Washington University in Washington D.C. ===Law academy and MBA=== In 2001, she graduated from the Law Faculty of the Kazakh State Law Academy with a degree in Legal Science. In 2016, The Al-Farabi Kazakh National University gave her an MBA degree in “Economics. Innovation Economics & Management”. == Business == Nazarbayeva is in charge of several companies in Kazakhstan. But it is said that her natural gas company gets good treatment from the government because of her father. In 2005, police in Almaty took control of the newspaper Svoboda Slova after it printed an article about dealings by Aliya Nazarbayeva through her construction company Elitstroi. In 2018, people in Temirtau collected petitions about polluted black snow to send her. The petitions were send to her because of her role as head of the Association of Ecological Organisations of Kazakhstan. ==As movie producer== She is the producer of several documentary series.При поддержке Алии Назарбаевой в Астане откроется Школа гуманной педагогики She produced The Road to Mother in 2016. The movie received awards at six international film festivals. It won prizes at a festival in Croatia and the Eurasian Bridge INternational Film Festival” . ==Personal life== Nazarbayeva was married to Aidar Akayev. He is the eldest son of former Kyrgyz president Askar Akayev. According to the BBC, the marriage was \"seen by many people as a return to the old Central Asian tradition of cementing political ties with family ones.\" Now she is married to Dimash Dosanov. He is the former general director of KazTransOil. It is the largest oil pipeline company in Kazakhstan. They have 4 children, daughters Tiara (born 2007) and Alsara (born 2011), son Aldiyar (born 2016) and daughter named Alana (born 2018). == References == Category:1980 births Category:Living people Category:Kazakhstani people Category:Business people Category:Movie producers",
 "title": "Aliya Nazarbayeva"
}