{
 "id": "913223",
 "text": "Kishiryu Sentai Ryusoulger is a Japanese television series. It is the 43th in Toei's Super Sentai series. This succeeded Kaitou Sentai Lupinranger VS Keisatsu Sentai Patranger and following the four week special TV miniseries Super Sentai Strongest Battle. Although the series primarily aired in the Reiwa era, it is considered the final Heisei era series as it began airing during it. It is the fourth Super Sentai series to use the motif of dinosaurs, having been preceded by Zyuden Sentai Kyoryuger (and Zyuden Sentai Kyoryuger Brave). It is also the first to use the motif of knights. ==Schedule== The show aired from March 17, 2019 to March 1, 2020, joining Kamen Rider Zi-O, and later Kamen Rider Zero-One, in the Super Hero Time line-up on TV Asahi affiliate stations. Additionally Ryusoulger began airing in South Korea in August 2019 as Power Rangers Dino Soul. Its footage was adapted for Power Rangers's 28th season - Power Rangers Dino Fury, in 2021. ==Story== 65 million years ago, the knights of the Ryusoul Tribe were selected to go for a war campaign against the dictating Druidon Tribe who sought to rule Earth. But the Druidon's war campaign was halted by the meteor that brought the age of the dinosaurs to an end. They were forced to flee into space. Meanwhile, the Kishiryu were placed in a deep sleep as a failsafe should the Druidon return. The chosen knights choose to live in peace while passing their mantle down across generations. Today, the Druidon return to reclaim Earth. Current generations of knights, the Ryusoulgers, battle them with the support of Ui Tatsui and the father Naohisa Tatsui. ==Characters== ===Ryusoulger=== Actor Name Ryusoulger Weapon Mecha Hayate Ichinose Koh Ryusoul Red Ryusoul Changer Ryusoul Ken Kishiryu Tyramigo Masaya Kikawada Master Red Ryusoul Red Ryusoul Changer Ryusoul Ken Kishiryu Tyramigo Keito Tsuna Melto Ryusoul Blue Ryusoul Changer Ryusoul Ken Kishiryu Triken Jouji Shibue Master Blue Ryusoul Blue Ryusoul Changer Ryusoul Ken Kishiryu Triken Ichika Osaki Asuna Ryusoul Pink Ryusoul Changer Ryusoul Ken Kishiryu Ankyloze Miyuu Sawai Master Pink Ryusoul Pink Ryusoul Changer Ryusoul Ken Kishiryu Ankyloze Yuita Obara Towa Ryusoul Green Ryusoul Changer Ryusoul Ken Kishiryu TigerLance Tatsuya Kishida Bamba Ryusoul Black Ryusoul Changer Ryusoul Ken Kishiryu MidNeedle Masaru Nagai Master Black Ryusoul Black Ryusoul Changer Ryusoul Ken Kishiryu MidNeedle Katsumi Hyodo Canalo Ryusoul Gold Mosa Changer Mosa Blade Kishiryu MosaRex Seiya Osada Nada Gaisoulg Gaisoulg Ken Mitsuru Fukikoshi Naohisa Tatsui / Seto Ryusoul Brown Brown Gaisoulg Ken ==Cast== * Koh / Ryusoul Red: Hayate Ichinose * Melto / Ryusoul Blue: Keito Tsuna * Asuna / Ryusoul Pink: Ichika Osaki * Towa / Ryusoul Green: Yuito Obara * Bamba / Ryusoul Black: Tatsuya Kishida * Canalo / Ryusoul Gold: Katsumi Hyodo * Ui Tatsui: Mana Kinjo * Naohisa Tatsui / Seto / Ryusoul Brown: Mitsuru Fukikoshi * Master Red: Masaya Kikawada * Master Blue: Jouji Shibue * Master Pink: Miyuu Sawai * Elder: Jirō Dan * Oto: Sora Tamaki * Master Black: Masaru Nagai * Nada / Gaisoulg: Seiya Osada ===Voice Actors=== * Tyramigo: Masaki Terasoma * DimeVolcano: Wataru Takagi * MosaRex: Ryōta Takeuchi * Chibigaroo: Mao Ichimichi * Pii-tan: Takeshi Kusao * Gaisoulg, Ryusoulger Equipment Voice: Tomokazu Seki * Ryusoul Gold Equipment Voice: Jun Hattori ===Guest cast=== * Cardena (7, 8): Reika Tanaka * Fita (7, 8): Rei Kobayashi * Ippei Shimomura (7, 8): Tadashi Mizuno * Officer work (9): Tomonori Mizuno * Nurse (11): Natsumi Hirajima * Mioko Karino (13): Noriko Nakagoshi * Misako Karina (19): Yukari Taki * Anikin (25): Hyokkorihan * Yui (29): Hikaru Yamamoto * Tomori Saionji (30): Nao Nagasawa * Saki's coach (36): Takuma Sugawara * Kyōko Taniguchi (37): Rei Yoshii * Yuno (38): Rie Kitahara * Akari (39): Ayaka Komatsu * Miya (41): Rikako Sakata ==Songs== ; Opening theme * \"Kishiryu Sentai Ryusoulger\" ** Lyrics: Mike Sugiyama ** Composition: Kentaro Sonoda ** Arrangement: Masato Kouda ** Artist: Tomohiro Hatano ** Episodes: All ;Ending theme * \"Que Booom! Ryusoulger\" ** Lyrics: KOCHO ** Composition: Kosuke Okui ** Arrangement: Takeshi Nakatsuka ** Artist: Sister Mayo ** Episodes: All Category:Super Sentai series Category:2019 Japanese television series debuts",
 "title": "Kishiryu Sentai Ryusoulger"
}