{
 "id": "913246",
 "text": "4 Week Continuous Special Super Sentai Strongest Battle!! is a Japanese Tokusatsu minidrama (crossover special) based on Toei's long-running Super Sentai metaseries featuring cast members from past installments and acts as a prelude to the events of Kishiryu Sentai Ryusoulger. It aired from February 17, 2019, following the finale Kaitou Sentai Lupinranger VS Keisatsu Sentai Patranger, until March 10, 2019, alongside Kamen Rider Zi-O in the Super Hero Time line-up on TV Asahi affiliate stations. ==Plot== A mysterious girl named Rita invites members from the Super Sentai teams across history to Planet Nemesis. The heroes are told that any wish they desire will come true if they can win the \"Super Sentai Strongest Battle\" tournament, the 160 heroes divided into 32 teams of five to complete against each other to have their wishes granted while contending with the mysterious Gaisoulg who seeks worthy opponents to battle. The story follows the Oddball Team, composed of the Zyuohgers' Yamato Kazakiri, the of Gokaigers' Captain Marvelous, the Ninningers' Takaharu Igasaki, the Kyurangers' Stinger, and the ToQgers' Kagura as they fight other heroes for the prize while learning the secrets behind the tournament. ==Cast== * Yamato Kazakiri / Zyuoh Eagle: Masaki Nakao * Captain Marvelous / Gokai Red: Ryota Ozawa * Takaharu Igasaki / Akaninger: Shunsuke Nishikawa * Stinger / Sasori Orange: Yosuke Kishi * Kagura / ToQ Gogou: Ai Moritaka * Keiichiro Asaka / Patren 1 (1): Kousei Yuki * Eiji Takaoka / Bouken Silver (1): Masayuki Deai * Sōsuke Esumi / Go-on Red (1): Yasuhisa Furuhara * Luka Millfy / Gokai Yellow (1, 3, 4): Mao Ichimichi * Kakeru Shishi / Gao Red (1, 2): Noboru Kaneko * Master Red (3, 4): Masaya Kikawada * Rita: Nana Asakawa * Gaisoulg (Voice), Akarenger (Voice), Narration: Tomokazu Seki * Introduction Voice: Shinichiro Ōta ===Voice Actors=== * Ryusoul Green: Yuito Obara * Ryusoul Black: Tatsuya Kishida * Doggie Kruger / Deka Master (1-3): Tetsu Inada * Ryuu Ranger (2, 3): Keiichi Wada * Ninja White (2): Satomi Hirose ==Opening theme song== * \"Saikyō Saikō Super Stars!\" (\"Strongest and Best Super Stars!\") ** Lyrics: Shio Watanabe ** Composition: Nobuo Yamada ** Arrangement: Go Sakabe ** Artist: NoB Category:Super Sentai series Category:2019 Japanese television series debuts Category:2019 Japanese television series endings",
 "title": "Super Sentai Strongest Battle"
}