{
 "id": "913237",
 "text": "Kaitou Sentai Lupinranger VS Keisatsu Sentai Patranger is a Japanese television series. It is the 42th in Toei's Super Sentai series, following Uchu Sentai Kyuranger. ==New things== This series if the first to feature two different teams of heroes-the gentleman thief-themed Lupinrangers and the Police-themed Patrangers. They engage in a three-way battle against an alien criminal organization targeting Earth called the Gangler. It is also the first Super Sentai tv series to not have an ending theme like many of TV Asahi's other shows. ==Schedule== Lupinranger vs Patranger was the last Super Sentai series to air entirely in the Heisei era, premiered on February 11, 2018, and on February 10, 2019, joining Kamen Rider Build and later Kamen Rider Zi-O, in the Super Hero Time line-up on TV Asahi affiliate stations. ==Story== The Lupin Collection, a big collection of dangerous items acquired by the legendary gentleman thief Arsenè Lupin, is stolen by a crime syndicate known as the Gangler. However, they receive opposition from two Super Sentai teams: the Lupinrangers: Kairi Yano, Touma Yoimachi and Umika Hayami. They aim to steal back the collection to live up their namesake's reputation and save those they have lost. The others are Patrangers: Keiichiro Asaka, Sakuya Hikawa and Tsukasa Myoujin. They are tasked with uploading justice by getting back the collection and taking down the Gangler. A human drama unfolds that pits the opposing teams against each other as their late tale is woven. This is made more intricate by the Lupin Collection's mysterious origins and its contributor Noël Takao. He aids the two teams as their fourth member in the hopes of uniting them against the Gangler for his own agenda. After the Gangler are defeated, the Patrangers learn the Lupinrangers' identities and motives while Noël still works to unite the two Super Sentai teams into one. ==Characters== ===Lupinranger=== Actor Name Lupinranger Weapon VS Vehicle Asahi Ito Kairi Yano Lupin Red VS Changer Lupin Sword Red Dial Fighter Shogo Hama Touma Yoimachi Lupin Blue VS Changer Lupin Sword Blue Dial Fighter Hakura Kudo Umika Hayami Lupin Yellow VS Changer Lupin Sword Yellow Dial Fighter ===Patranger=== Actor Name Patranger Weapon VS Vehicle Kousei Yuki Keiichiro Asaka Patren 1-gou VS Changer Pat Megabo Trigger Machine 1-gou Ryo Yokoyama Sakuya Hikawa Patren 2-gou VS Changer Pat Megabo Trigger Machine 2-gou Kazusa Okuyama Tsukasa Myoujin Patren 3-gou VS Changer Pat Megabo Trigger Machine 3-gou ===X=== Actor Name Ranger Weapon VS Vehicle Seiya Motoki Noël Takao Lupin X X Changer X Rod Sword X Train Silver X Train Gold Seiya Motoki Noël Takao Patren X X Changer X Rod Sword X Train Silver X Train Gold ==Cast== * Kairi Yano / Lupin Red: Asahi Ito * Touma Yoimachi / Lupin Blue: Shogo Hama * Umika Hayami / Lupin Yellow: Haruka Kudō * Keiichiro Asaka / Patren 1: Kousei Yuki * Sakuya Hikawa / Patren 2: Ryo Yokoyama * Tsukasa Myoujin / Patren 3: Kazusa Okuyama * Noël Takao / Lupin X / Patren X: Seiya Motoki * Director Hilltop: Ike Nwala * Zamigo Delma: Jingi Irie * Shori Yano: Kōji Shiba * Aya Ohira: Nagisa Yuzuki * Shiho Ichinose: Moka Komatsu * Kogure: Yoichi Nukumizu ===Voice Actors=== * Good Striker: Yūji Mitsuya * Jim Carter: Rie Kugimiya * VS Changer: Rondo Mimura * Narration: Hiroki Yasumoto ===Guest cast=== * Bundorute Peggy (5, 6): Tadashi Mizuno * Shinta Yamaguchi (19): Kazayuki Aijima * Koji Yamada (35): The Touch * Restaurant customers (51): Mai Oishi, Sumiko Tanaka, Yuki Nagata, Michiko Makino ==Opening theme song== * \"Lupinranger VS Patranger\" ** Lyrics: Shoko Fujibayashi ** Composition: Hiroshi Takaki ** Arrangement: Hiroshi Takaki (Project.R) ** Artist: Project.R (Tatsuhiko Yoshida, Hitomi Yoshida) *: This song is a mix of \"Lupinranger, Dial o Mawase\" (\"Lupinranger, Turn the Dial\") by Tatsuhiko Yoshida (Project.R) and \"Chase You Up! Patranger\" by Hitomi Yoshida (Project.R). Category:Super Sentai series Category:2018 television series debuts Category:2019 Japanese television series endings",
 "title": "Kaitou Sentai Lupinranger VS Keisatsu Sentai Patranger"
}