{
 "id": "913678",
 "text": "The Korniakt Tower or Kornyak Tower is an architectural monument in Lviv, Ukraine. It is an important monument to the nation. The tower is located on 9 Pidvalna Street in Lviv. It is a part of the Assumption Church. == History == The tower was built during the Renaissance as a bell tower of the Church of the Assumption. It was designed by architect Peter Barbon from 1572 ro 1578. Paul the Roman help with the design. The cost was paid for by Constantine Kornyakt. He was a merchant of Lviv of Greek origin. According to Vaclav Urban in the Polish Biographical Dictionary, the tower was built instead of writing off 1,000 zlotys of debt . Before the construction was finished, a large bell was hung on the tower. At the time, it was, the largest bell in Galicia. The bell had a diameter of . It was named \"Cyril\". There were problems between the Assumption Brotherhood and the Dominicans, who had their own monastery nearby, over this bell. The Dominicans complained to the magistrate and the king that the bell was larger than all the bells in the Polish state. The monks said that the bell was too loud. This caused them problems with listening to the sermon in the church. Cyril soon began to act as the city's main bell. It was used to announce military danger, fires, natural disasters and the deaths of the most well known people living in Lviv. In 1616, a fire destroyed a large part of the city. It caused a large amount of damage to the street. The tower was also badly damaged: its tin-lead roof melted. == Architecture == The bell tower is square. It was built of broken stone and surrounded by hewn stone. Polychrome is used in the decoration. The tower is connected with the northern facade of the Church of the Assumption. The facades are decorated with pilasters of the Tuscan order . They have long red arched niches with small window openings. Each tier of the tower is smaller than the one below it. The total height of the tower without the cross is . It is thought that the design for the tower was based on the Tower of S. Spirito in Rome. The tower is also similar tothe towers of the churches of Madonna del Orto and St Stephen in Venice. Category:Lviv Category:Buildings and structures in Ukraine",
 "title": "Korniakt Tower"
}