{
 "id": "913681",
 "text": "The Royal Flags of Thailand () are royal flags that can be flown in Thailand. They are also flown with the National flag. They are used to honor the King and Royal Family. Unlike the Royal Standards displayed only in special ceremonies and in particular locations, the Royal Flags are seen in Thailand. They are not usually seen outside of the country. ==Flag of the King== The King's flag is in yellow, the color of Monday, the day of his birth. It always has a symbol in the middle. There are a variety of symbols,Rama IX Art Museum Foundation; symbols of King Bhumibol Adulyadej but recently most king's flags have different symbols, such as the symbol marking King Bhumibol's 80th birthday or the one commemorating the 60th anniversary of King Bhumibol's accession to the throne.Rama IX Art Museum Foundation; Symbol marking the 60th anniversary of King Bhumibol Adulyadej's accession to the throne Both emblems in the center of the flag are quite complex, involving Buddhist iconography and ancient royal symbols of authority as well, such as the multi-tiered white umbrella.The umbrella as a symbol of royalty and authority in Buddhism The king's symbols are always topped by the royal crown. Sometimes light rays are emanating from the top of the crown, these are also an element of royal symbology. In simplified versions of the flag the central symbol may come simply outlined in red. Yellow is the color identified with the king in Thailand (as well as the previous king, both were born on a Monday). Many Thais like to wear yellow shirts as an informal homage to their king, especially on Mondays, the day of his birth. File:Flag of HM King Bhumibol Adulyadej.jpg|Royal flag of King Rama IX. The flag was yellow with personal monogram in the middle. File:Tailandia, varios 1998 01.jpg|The national flag display along with the simplified version of the royal flag of King Rama IX. File:Wat Klongpho Municipal School 10.jpg|Flag on the 60th anniversary of King Bhumibol's ascension to the throne in 2006. File:Royal Flag of King Maha Vajiralongkorn.jpg|Royal flag of King Vajiralongkorn. The flag was yellow with personal monogram in the middle. ==Flag of the Queen== Queen Suthida's flag is purple. It is the color of Saturday, and on her birthday, there is a symbol \"ส.ท.\" in the middle. The symbol is the abbreviation of Queen Suthida (ส.ท. : สุทิดา) under the Royal Crown. This flag has been in effect from June 2019 until now, after the royal coronation ceremony. File:Flag of HM Queen Sirikit.jpg|Royal flag of Queen Sirikit. The flag was blue with personal monogram in the middle. File:บรรยากาศ ณ มณฑลพิธีท้องสนามหลวง ถนนราชดำเนิน 12สิงหาคม2552 (The Official Site o - Flickr - Abhisit Vejjajiva (32).jpg|The simplified version of the royal flag of Queen Sirikit. File:Queen Sirikit's picture with flags.jpg|The displays of the national flag along with the Flag of the Royal Ceremonial of Her Majesty the Queen's 6th Cycle Birthday Anniversary. File:Flag of HM Suthida.jpg|Royal flag of Queen Suthida. The flag was purple with personal monogram in the middle. ==List of royal flags== === In use flags === Royal flag Dates Use Details 2016– Personal flag of King Maha Vajiralongkorn Yellow flag (the King's birthday colour), the middle the depicts the royal cypher \"ว.ป.ร.\", topped by the Great Crown of Victory, in between is the Thai symbol for the numeral 10, signifying his rule as Rama X. 2019– Personal flag of Queen Suthida Purple flag (the Queen's birthday colour), the middle is Queen Suthida's royal cypher, topped by the Crown of the Great Lady. 1950– Personal flag of Queen Mother Sirikit Blue flag (the Queen Mother's birthday colour), the middle is Queen Sirikit's royal cypher, topped by the Crown of the Great Lady. 1977– Personal flag of Princess Maha Chakri Sirindhorn Purple flag (the Princess' birthday colour), the middle is the royal cypher, topped by the medium crown. 1982– Personal flag of Princess Chulabhorn Walailak Orange flag (the Princess' birthday colour), the middle is the royal cypher, topped by the simplified crown. 2001– Personal flag of Princess Ubolratana Rajakanya Red flag (the Princess' birthday colour), the middle is the royal cypher, but not topped by the simplified crown. 1977– Personal flag of Princess Soamsawali Purple flag (the Princess' birthday colour), the middle is the royal cypher, under the Buddhist/Hindu sacred sign of \"Unalome\". 2019– Personal flag of Princess Bajrakitiyabha Orange flag (the Princess' birthday colour), the middle is the royal cypher, topped by the simplified crown. 2019– Personal flag of Princess Sirivannavari Orange flag (the Princess' birthday colour), the middle is the royal cypher, topped by the simplified crown. 2019– Personal flag of Prince Dipangkorn Rasmijoti Blue flag (the Prince's birthday colour), the middle is the royal cypher, topped by the simplified crown. 1982– Personal flag of Princess Siribhachudhabhorn Blue flag (the Princess' birthday colour), the middle is the royal cypher, topped by the glowing tiara. 2016– Personal flag of Princess Adityadhornkitikhun Purple flag (the Princess' favourite colour), the middle is the royal cypher. === Discontinued flags === Royal flag Dates Use Details 1946–2016 Personal flag of King Bhumibol Adulyadej Yellow flag (the King's birthday colour), the middle the depicts the royal cypher \"ภ.ป.ร.\", topped by the Great Crown of Victory, in between is the Thai symbol for the numeral 9, signifying his rule as Rama IX. Unknown–1984 Personal flag of Rambai Barni Square-shaped pink flag (the Queen's birthday colour), the middle is the royal cypher, topped by the crown. Unknown–1995 Personal flag of Princess Srinagarindra Red flag (the Princess birthday colour), the middle is the royal cypher in white variation. 1972–1999 Personal flag of Maha Vajiralongkorn, the Crown Prince Yellow flag (the Prince's birthday colour), the middle is the royal cypher topped by the crown in the blue background. 1999–2016 Personal flag of Maha Vajiralongkorn, the Crown Prince Yellow flag (the Prince's birthday colour), the middle is the royal cypher topped by the crown in the blue background. in between is the royal emblem. Unknown–2011 Personal flag of Princess Bejaratana Rajasuda Pink flag (the Princess birthday colour), the middle is the royal cypher topped by the crown. in between is the Thai symbol for the numeral 6. signifying her status as the princess of Rama VI. 1995– 2008 Personal flag of Princess Galyani Vadhana, the Princess of Naradhiwas Princess Galyani Vadhana (1923 – 2008), king Bhumibol's elder sister, had a navy-blue flag. The personal symbol of the Princess, her acronym surmounted by a simplified crown, is in the middle of the flag. Unlike the other royal flags, which have the color of the day of birth as a background, this flag was in the Princess' favourite colour. 2001– 2014 Personal flag of Princess Srirasmi, Royal Consort to the Crown Prince of Thailand. Orange flag (the Princess birthday colour), the middle is the royal cypher. 1980s Personal flag of Princess Soamsawali, Royal Consort to the Crown Prince of Thailand. Blue flag (the Princess birthday colour), the middle is the royal cypher within a 2-layer pink oval frame. 1995– 2019 Personal flag of Princess Bajrakitiyabha. Orange flag (the Princess birthday colour), the middle is the royal cypher. 1995– 2019 Personal flag of Princess Sirivannavari. Orange flag (the Princess birthday colour), the middle is the royal cypher. 2006– 2019 Personal flag of Prince Dipangkorn Rasmijoti. Blue flag (the Prince's birthday colour), the middle is the royal cypher. 2013–2014 Personal flag of Princess Aditayadorn Kitikhun Plain red flag. 2014– 2016 Personal flag of Princess Aditayadorn Kitikhun Plain purple flag (the Princess birthday colour.) == Special commemoration flags == === In use flags === Special commemoration flags Use Details Period Personal flag of Queen Sirikit Blue flag (the Queen's birthday colour), the middle depicts the Royal Ceremonial Emblem of Her Majesty the Queen's 5th Cycle Birthday Anniversary. 1992 Personal flag of Queen Sirikit Blue flag (the Queen's birthday colour), the middle depicts the Royal Ceremonial Emblem of Her Majesty the Queen's 6th Cycle Birthday Anniversary. 2004 Personal flag of Queen Sirikit Blue flag (the Queen's birthday colour), the middle depicts the Royal Emblem of the Celebrations on the Auspicious Occasion of Her Majesty Queen Sirikit The Queen 80th Birthday Anniversary. 2012 Personal flag of Queen Sirikit Blue flag (the Queen's birthday colour), the middle depicts the Royal Ceremonial Emblem of Her Majesty the Queen's 7th Cycle Birthday Anniversary. 1 January 2016–31 December 2016. (Display along with the Flag of the Royal Ceremonial on the 70th Anniversary of His Majesty the King's Accession to the Throne) Personal flag of Queen Mother Sirikit Blue flag (the Queen's birthday colour), the middle depicts the Royal Emblem of the Celebrations on the Auspicious Occasion of Her Majesty Queen Sirikit The Queen Mother’s 90th Birthday Anniversary. 1 January 2022–31 August 2022 Personal flag of Princess Maha Chakri Sirindhorn Purple flag (the Princess birthday colour), the middle depicts the Royal Emblem of the 60th Anniversary of Princess Maha Chakri Sirindhorn. 1 January 2015–31 August 2015 Personal flag of King Maha Vajiralongkorn Yellow flag (the King's birthday colour), the middle depicts the Royal Emblem of the Auspicious Occasion of the Coronation of King Rama X. 1 January 2019–31 August 2019 Personal flag of King Maha Vajiralongkorn Yellow flag (the King's birthday colour), the middle depicts the Royal Ceremonial Emblem of His Majesty the King's 6th Cycle Birthday Anniversary. 1 January 2024–31 December 2024 === Discontinued flags === Special commemoration flags Use Details Period Personal flag of King Bhumibol Adulyadej Yellow flag (the King's birthday colour), the middle depicts the Royal Emblem of the Royal Ceremonial on the 5th Cycle Birthday Anniversary of His Majesty the King. 1 January 1987–31 December 1987 Personal flag of King Bhumibol Adulyadej Yellow flag (the King's birthday colour), the middle depicts the Royal Ceremonial Emblem on the Grand Celebrations of the Reign, marking the longest reign in the Thai history. 1988 Personal flag of King Bhumibol Adulyadej Yellow flag (the King's birthday colour), the middle depicts the Royal Ceremonial Emblem on the 50th Anniversary of His Majesty the King's Accession to the Throne or the Golden Jubilee. 1996 Personal flag of King Bhumibol Adulyadej Yellow flag (the King's birthday colour), the middle depicts the Royal Ceremonial Emblem of His Majesty the King's 6th Cycle Birthday Anniversary. 1 January 1999–31 December 1999 Personal flag of King Bhumibol Adulyadej Yellow flag (the King's birthday colour), the middle depicts the Royal Ceremonial Emblem on the 60th Anniversary of His Majesty the King's Accession to the Throne. 1 December 2005–31 December 2006 Personal flag of King Bhumibol Adulyadej Yellow flag (the King's birthday colour), the middle depicts the Royal Emblem in Commemoration of the Celebrations on the Auspicious Occasion of His Majesty the King’s 80th Birthday Anniversary. 1 January 2007–31 December 2007 Personal flag of King Bhumibol Adulyadej Yellow flag (the King's birthday colour), the middle depicts the Royal Emblem in Celebration on the Auspicious Occasion of His Majesty the King’s 7th Cycle Birthday Anniversary. 1 January 2011–31 December 2011 Personal flag of King Bhumibol Adulyadej Yellow flag (the King's birthday colour), the middle depicts the Royal Ceremonial Emblem on the 70th Anniversary of His Majesty the King's Accession to the Throne. 9 June 2016–31 December 2017. (Display along with the Flag of the Royal Ceremonial of Her Majesty the Queen's 7th Cycle Birthday Anniversary.) (Discontinued on 13 October 2016 after his death.) Personal flag of Princess Srinagarindra White flag, the middle depicts the emblem of the 100th year celebration of Princess Srinagarindra's birth. 1 January 2000–31 December 2000 Personal flag of Maha Vajiralongkorn, the Crown Prince Yellow flag (the King's birthday colour), the middle depicts the Royal Emblem of the 5th Cycle Birthday Anniversary of the Prince. 2012 Personal flag of Princess Bejaratana Rajasuda Pink flag (the Princess birthday colour), the middle depicts the Royal Emblem of the 7th Cycle Birthday Anniversary of the Princess. 2009 == References == Category:Thai culture Category:Flags of Asia",
 "title": "Royal flags of Thailand"
}