{
 "id": "913721",
 "text": "Fennville is a city in Allegan County, Michigan, United States. In 2020, the city had 1,745 people living in it. == History == === 1800s === The place where Fennville is now was first a small town at a crossing of two wood roads. The first road was built by Harrison Hutchins and James McCormick in 1837. Elam Atwater Fenn from the state of New York entered the nearby place of Manlius in 1851.New Richmond History, Allegan County Parks Commission, c. 2010 The story of how Fennville got its name is that Fenn built a sawmill nearby in 1860. In the 1860s, Fennville had a swamp in the middle of the town and buildings were located on higher ground on the outside. A fire that may have been from the Great Chicago Fire or the Great Michigan Fire destroyed the town in 1871. After the town was rebuilt, the Chicago and Michigan Lake Shore Railroad built a train station. The railroad named the town Fennville with help of Fennville. At the end of the 1800s, farmers drained the swamp in the middle of Fennville. In 1889, Fennville was officialy made a village. === 1900s === In the beginning of the 1920s, the train station became busy with transporting farm products like fruit and mint. The town faced trouble with the economy in the 1930s during the Great Depression like other places at the time. The city began to grow in the 1950s and 1960s after the Interstate Highway System was built. Fennville was officially made a city in 1961. The Hispanic community also started to grow as the city became larger and is still growing today. The United States Department of the Treasury named Fennville an American Viticultural Area (AVA) in 1981. After Fennville was named an AVA, wine from the city became popular and wineries in Fennville started to win awards. In October 1984, Fennville made the Goose Festival to get Amtrak to reopen a train station that had closed. The festival is held every year in October and is named after the hundreds of thousands of geese that rest in nearby fields before they fly south for the winter. === 2000s === In the 2010s, the city was given money by the state of Michigan and made the experience for walking in the city better in the city center. == Education == The Fennville Public Schools district includes: Fennville Public Schools * Fennville High School (9-12) * Fennville Middle School (6-8) * Fennville Elementary School (K-5) * Pearl Alternative/Adult Education School (9-12) The Discovery Elementary School, a chartered public school academy located in Fennville,Discovery Elementary , Accessed 03 May 2009 closed at the end of the 2009 school year.\"Discovery School Announces Closing at End of School Year\" , Accessed 03 May 2009 == References == Category:Cities in Michigan",
 "title": "Fennville, Michigan"
}