{
 "id": "913712",
 "text": "The organ at the Basilica of St. Martin (Weingarten) was built by Joseph Gabler from 1737 to 1750. ==History== Joseph Gabler signed the first contract on July 6, 1737. The organ needed to have four manuals (keyboards), a pedalboard, sixty stops, and some accessory stops. According to his contracts, the organ is supposed to have 6,666 pipes. 6,666 is traditionally the number of lashes Jesus received. This number of pipes was never reached. In 1737, a fire destroyed the abbey. It became more important to rebuild the abbey. This delayed the construction of the organ. Gabler was given another job to build a smaller organ. The main organ was finished in 1750. It was blessed on June 24, 1750. From 1981 to 1983, Orgelbau Kuhn AG (Männendorf on lake Zurich) made changes to the organ. They returned the organ to how it was in 1750. They extended the playing range of the pedal. They changed the temperament of the organ. ==Description== Gabler built the organ in the western gallery of the church. The organ does not cover the windows of the gallery. The console of the organ (the place where the organist plays the organ) is detached from the organ. ===Disposition=== {| border=\"0\" I Hauptwerk \\---- I Hauptwerk \\---- I Hauptwerk \\---- 1\\. Praestant 16′ 2\\. Principal 8′ 3\\. Rohrflaut 8′ 4\\. Octav I-II 4' 5\\. Superoctav II 2′+1′ 6\\. Hohlflaut 2′ 7\\. Mixtur IX-X 2′ 8\\. Cimbalum XII 1′ 9\\. Sesquialter VIII-IX 2′ 10\\. Piffaro V-VII 8′ 11\\. Trombetten 8′ ===Effect stops=== The organ has several effect stops. The Carillon is a stop which plays chimes in the organ. The pedal chimes are placed above the organ. They are arranged like bundles of grapes. ==Legend of the vox humana== There is a legend about the organ's vox humana stop. Gabler tried to make a pipe which sounds like the human voice. He tried different types of woods and metals. But nothing worked. One night, the devil promised Gabler that he would help him. In return, Gabler had to give up his soul. He exchanged his soul for a piece of metal. He used this metal to make the vox humana pipes. The pipes worked. They sounded like the human voice. However, the monks in the abbey soon noticed. Gabler was put on trial. He confessed to his crimes. He was sentenced to be burned at the stake. However, Gabler has to make a replacement of the vox humana pipes. His replacements were so good that the monks did not execute him. ==References== ==Other websites== * Information and historical sound archives from 1938 * Information on the Parish of Weingarten and the organ * Homepage for the Choir organ (archived) * Video Presentation of the main organ (Greifenberger Institute of Musical Instruments) * Panoramic 360° view of the interior Category:Keyboard instruments",
 "title": "Organ of the Basilica of St. Martin (Weingarten)"
}