{
 "id": "913889",
 "text": "Brent Anthony Renaud (October 2, 1971 – March 13, 2022) was an American journalist, documentary filmmaker, and photojournalist. Earlier in his career, he did work for The New York Times. He was killed by Russian troops by a gunshot wound, while reporting inside Ukraine which is currently being invaded by Russian forces. He was the first American and foreign journalist that died during the invasion of Ukraine in 2022. == Life == Brent Renaud was born on October 2, 1971 at Memphis Tennessee from parents Georgann Freasier, mother, and Louis Renaud his father. Renaud was raised at Little Rock, Arkansas. His father worked as a salesman and his mother was a social worker. Brent also lived at New York City. He worked with his brother for several film series related with news. == Journalism == Brent Renaud worked for The New York Time's as a video journalist, he also was a photojournalist whose photographs were featured to National Geographic, The Wall Street Journal, Newsweek and other media outlets through his photographs and videos through his Journalist career he had. === Career === Brent Renaud had a filmmaking career which spanned for over 2 decades with his brother Craig Renaud. Brent's filmmaking not only was in the U.S but the whole world over his filmmaking career. Renaud was a journalist in war zones in Iraq, Afghanistan, and Caribbean countries that have high crime rates as Haiti and Central American countries. Renaud earned his bachelor's degree at Southern Methodist University in English. == Death == According to Ukrainian police the dead person found was Brent Renaud. Renaud's journalist friend who was also shot at, described the events that had happened before they were shot at while trying to film Ukrainian refugees leave. He went to Ukraine to cover the conflict between Russian and Ukrainian forces as he did for decades in the middle east and central America. === Outcry === Ukrainian President Volodymyr Zelensky rebuked the killing of Renaud and mourned his death in a letter to his family members. Brent's friend mourned his death on the BBC, she told the agency that she had spent good times with him. == References == Category:1971 births Category:2022 deaths Category:American photojournalists Category:American movie directors Category:Journalists from Tennessee Category:Writers from Memphis, Tennessee Category:Deaths by firearm in Ukraine Category:2022 Russian invasion of Ukraine",
 "title": "Brent Renaud"
}