{
 "id": "914063",
 "text": "Vildana Selimbegović (born Lolić, July 27, 1963) is a Bosnian journalist, editor-in-chief of the daily Oslobođenje. She lives and works in Sarajevo. ==Early years== Vildana Selimbegović was born in Travnik in 1963. She finished elementary school and high school in her hometown. She completed journalism studies at the Faculty of Political Sciences in Sarajevo in early 1987. Then she began her journalist career at Sarajevo's Vecernji novine in 1989. She initially worked for the Sarajevo Chronicle. Then she began reporting for the domestic political section. She was the youngest journalist in the newsroom, and for the next year and a half she followed the union strikes. ==Works== Since the beginning of the Bosnian War, she has been reporting for Večernje novine from the front line of the Army of the Republic of Bosnia and Herzegovina. During that period, she made about 1,000 field reports from all over Bosnia and Herzgovina. During 1997, as a journalist for Dani magazine, she published excerpts from secret court records from the 1994 trial. At here, the defendants described in detail the murders in Kazani. As a result, she received a death threat on the street and on the phone, and the bomb exploded in front of the office. Through her actions and efforts, she helped to memorize the crimes in Kazani. It is one of the initiators of the erection of a memorial at that site. ===Dani=== From 1994 to 2008 she worked at Dani magazine. She was editor, assistant editor-in-chief, deputy editor-in-chief, executive editor, deputy director, and on two occasions editor-in-chief (2000–2003, 2005– 2008). As the editor-in-chief of this magazine, she was the first woman in that position in a media outlet since the independence of Bosnia and Herzegovina. Since October 2008, Selimbegović has been the editor- in-chief of Oslobođenje, the oldest daily in Bosnia and Herzegovina. ===Awards=== For her professional work and engagement, she was twice named Journalist of the Year in the selection of Women 21 (1997 and 2001). In 1998, she was awarded by the European Union and the USA Government for her works to the development of democracy and respect for human rights. In 2015, she was awarded the SAIS Award for Investigative journalism in the USA. In 2017 she received an award from the Italian association Giavere for her help about respect for human rights, and in the same year she was named Journalist of the Year in Bosnia and Herzegovina. == References == ==Other websites== * Heroina: Vildana Selimbegović Category:1963 births Category:Living people Category:Journalists Category:Bosnia and Herzegovina writers Category:People from Sarajevo",
 "title": "Vildana Selimbegović"
}