{
 "id": "914071",
 "text": "The Municipal Development and Lending Fund, known by its acronym Mdlf, is a Palestinian quasi-governmental institution that works to empower local government bodies through the management of funding to implement the policies of the local government sector. ==Organization== It has financial and administrative independence. It was established in 2005 by the Palestinian government to be the main channel to support the development process. and reform for local bodies. In 2015 the fund law was approved by the President of the State of Palestine, Mahmoud Abbas, in accordance with Decree Law No. (25) of 2016 regarding the Local Authorities Development and Lending Fund. ==Mission and goals== The establishment of the Local Authorities Fund was in line with the national agenda and policies, and was established as part of the Palestinian National Authority's initiative to achieve efficiency, reform, and transparency. The Fund works to translate national policies related to the local government sector into implementable programs and projects. Since its inception, the Fund has been working alongside local authorities to enhance their capabilities and raise performance levels to levels that enable them to contribute to building an independent and wealthy state. == Supervision and Management == The fund’s policies, directions and work are supervised by a board of directors consisting of nine members as follows * Ministry of Local Government (Palestine) as chairman of the board of directors. * A representative of the Ministry of Finance (Palestine). * A representative of the Ministry of Public Works and Housing (Palestine). * President of The Palestinian Federation of Local Authorities. * Two mayors of municipalities are appointed by the Council of Ministers upon the recommendation of the Minister of Local Government. * The Syndicate of Engineers Palestine. * A representative of the Monetary Authority Palestine. * A representative of civil society appointed by the Council of Ministers upon the recommendation of the Minister of Local Government. == Fund Law == President Mahmoud Abbas and based on the provisions of the amended Basic Law of 2003 and its amendments, especially the provisions of Article (43) of it, issued Decree Law No. (25) of 2016 regarding the Local Authorities Development and Lending Fund. ==References== Category:2005 establishments in Asia Category:Organizations based in Palestine",
 "title": "Municipal Development and Lending Fund"
}