{
 "id": "914312",
 "text": "The Armed Forces of Ukraine ( [ЗСУ]; , [ZSU]) are the military forces of Ukraine. They are the main force against any military action against the nation of Ukraine. All military and security forces are under the command of the president of Ukraine. This includes the Armed Forces. They are subject to oversight by a parliamentary commission. ==Contents== Ukraine's armed forces include the Ukrainian Ground Forces, the Ukrainian Air Force, the Ukrainian Navy, the Ukrainian Air Assault Forces and the Special Operations Forces. The navy of Ukraine has its own small Ukrainian Naval Infantry force. It also has its own Ukrainian Naval Aviation force. The Ukrainian Sea Guard is the coast guard service of Ukraine. It is a part of the Border Guard Service. It is not a part of the navy. The Center for National Resistance (CNR) is a branch of AFU, and it was created in 2022.https://www.kyivpost.com/post/38366. Retrieved 2024-09-03 Unmanned Systems Command is part of AFU (as of 2024).https://www.kyivpost.com/post/38445. Retrieved 2024-09-04 ==Size== Because of the Russian military intervention in Ukraine in 2014, the president had the leaders of oblasts of Ukraine create units which are made up of volunteers. These groups are under the control of the government's Territorial Defense Forces. At first, the government gave these units very little money. Most of their funding came from donations. In November 2014, most of the territorial defense battalions were made a part of the Ukrainian Ground Forces. The National Guard of Ukraine is a paramilitary reserve unit of the Armed Forces of Ukraine. After the fighting with Russia in 2014, Ukraine increased the size of its armed forces to 204,000 soldiers. This does not include additional forces such as the border guards, the new National Guard of Ukraine or the security service. The current size of Ukraine's armed forces is 250,000. Of that number, 215,000 are military personnel. It is the second largest in the region. Only Russia has a larger military in the region. In 2022, President Volodymyr Zelenskyy ordered that the size of the military would be increased by 100,000 by 2025. He also ordered that conscription would end in 2024. Conscription will be replaced with short-term military training. Military units of other countries have taken part in military exercises with Ukrainian forces in Ukraine. Many of these exercises have been held under the NATO program Partnership for Peace. ==Notes== ==References== Category:Military of Ukraine",
 "title": "Armed Forces of Ukraine"
}