{
 "id": "914631",
 "text": "Amanda Rose Sacomano (born 16 July 1990), is an American professional wrestler. She is best known for her time in the WWE where she wrestled under the ring name Mandy Rose. Rose began her career in professional fitness competitions in 2013. She became a bodybuilder the next year. In 2015, she finshed the WWE competition Tough Enough in second place. After Tough Enough, she signed a contract with the WWE. Rose became member of the main roster in 2016 after a short time on WWE's development program NXT. Rose worked with Sonya Deville as a member of the tag team \"Fire and Desire\" and with Deville and Paige in the faction Absolution. She then became a member and leader of NXT's faction Toxic Attraction with Gigi Dolin and Jacy Jayne, and was the the third-longest reigning NXT Women's Champion. She was released in December 2022. == Early life == Amanda Rose Sacomano was born in the suburbs of New York City. She is the youngest of four children. Her parents are Irish and Italian parents. As a child, she had he nickname \" Hamburg \". She attended Yorktown High School. She later earned a bachelor's degree in speech pathology from Iona College. Rose entered her first fitness competition in 2013. She won first place at the World Bodybuilding Fitness and Fashion Boston Show. She was also the 2014 World Beauty Fitness and Fashion Bikini Champion. == WWE career == === Tough Enough and NXT (2015–2016) === Rose Sacomano was a contestant in the sixth edition of the WWE Tough Enough competition in 2015. In the July 26 episode, she was at risk of being disqualified. Judge The Miz saved her from dismissal. She professionally adopted the name Mandy Rose just before the end of the event. In that event, she was in second place after winners Sarah Lee and Josh Bradell, who lost a match against Alicia Fox. After Tough Enough, Rose signed a five-year deal with the company. She made her in-ring debut for the NWST, the development part of the WWE, at a live event in Venice, Florida on January 30, 2016. On August 18, Rose teamed up with Rose Daria Berenato and Alexa Bliss in the \"six-woman tag team\". The defeated Carmella, Liv Morgan, and Nikki Glencross. On the September 26 episode of NXT, Rose lost her first television singles match to Ember Moon. === Absolution and Fire and Desire (2016–2020) === In November 2016, on Raw, Rose, Sonya Deville and Paige attacked Sasha Banks, Bayley, Mickie James and Alexa Bliss. A week later, their name was given as \"Absolution\". On 19 December, Rose had her first television match on the main roster. At that years \"Tribute to Troops\" Abolition defeated Baley, James and Banks. On 27 January 2016, Rose was in the first women's Royal Rumble match at the Royal Rumble. She was the first woman to be knocked out of the match after losing to Lita. Rose was in the first \"Women's Elimination Chamber Match\" in February. Alexa Bliss won the match. In April, Paige was forced to stop wrestling because of an injury to her neck. Paige left Absolution and became the general manager of SmackDown. WrestleMania 34 was Rose's first WrestleMania match. she was in the WrestleMania Women's Battle Royal. Naomi won the match. Paige later drafted both Rose and Devil to SmackDown during the 2016 superstar shake-up. It was said that the group Abolition was over. Rose still wrestled in many tag team matches with Deville. At WWE Evolution, Rose eliminated Deville from the Battle Royale. In the Survivor Series in November, Rose was a member of the SmackDown team At the same time, Rose began arguing with Naomi. They argued about Rose having an affair with Naomi's husband. Jimmy Uzo. As they continude to fight, Rose and Naomi eliminated each other in the Women's Royal Rumble on January 26, 2019. Rose had lasted 25:50. In February, the two exchanged victories over each other. ====WWE Women's Tag Team Championship==== On February 1, Rose and Deville were in the six-team Elimination Chamber match for the first WWE Women's Tag Team Championship. They lost to Sasha Bank and Bayley. She was in the second WrestleMania Women's Battle Royale at WrestleMania 35. Rose then competed in the Money in the Bank ladder match on May 19, 2019. During the match, the Deville was at ringside. She climbed the stairs and tried to help Rose win the match. Bayley fought them both and won the match. On the September 3 episode of SmackDown, Rose and Devil , as the tag team \"Fire and Desire\", defeated Alexa Bliss and Nicky Cross. For winning, they got a match at the Clash of Champions pay-per-view for the Women's Tag Team Championship. They lost that match to Banks and Bayley. === Romance (2019-2021) === In December 2019, Rose was helped by Otis during a match. After this, Rose began a romantic affair with Otis. Rose agreed to go on a date with Otis on Valentine's Day. Dolph Ziggler replaces Otis the date. This led to Rose falling in love with Ziggler instead of Otis. A love triangle formed between Otis and Ziggler over Rose. On the 3 April 2020 episode of SmackDown, it was shown that Deville was working with Ziggler to keep Otis away from Rose. At WrestleMania 36, Otis had a match against Ziggler. During the match, Rose attacked Deville and Ziggler. This helped Otis win the match. Rose and Otis kissed after the match. On the May 22 episode of SmackDown, Rose and Otis lost to Deville and Ziggler in a tag team match. ==== Toxic Attraction (2021–2022) ==== In July 2021, Rose returned to the NXT brand and the following month, she formed stable with Gigi Dolin and Jacy Jayne, called Toxic Attraction. She colored her hair brown. At Halloween Havoc on October 26, Rose defeated Raquel González in a Chucky's choice Trick or Street Fight match to win the NXT Women's Championship, the first title in her wrestling career. Earlier that night, Dolin and Jayne won the NXT Women's Tag Team Championship, meaning Toxic Attraction held all women's championships in NXT. On December 5, at WarGames, Rose and Toxic Attraction teamed with Dakota Kai. They were defeated by the team of Cora Jade, Io Shirai, Kay Lee Ray, and González in a WarGames match. On January 4, 2022, at New Year's Evil, Rose defeated Jade and González in a triple threat match to keep the title. At Stand & Deliver, Rose defended her championship against Jade, Ray, and Shirai in a fatal four-way match. During her reign, Rose also defeated Roxanne Perez, Wendy Choo and Zoey Stark. At Worlds Collide, Rose unified the NXT UK Women's Championship with the NXT Women's Championship by defeating NXT UK champion Meiko Satomura and Blair Davenport in a triple threat match. At Halloween Havoc, Rose defeated Alba Fyre. On October 26, Rose became third woman to hold the title for one full year. On the December 13 episode of NXT, Rose lost the NXT Women's Championship to Perez in a rematch, ending her reign at 413 days. The next day, Rose was released from her WWE contract. On January 10, 2023, she addressed her release in an episode of The Tamron Hall Show. == Other media == Rose is has been featured in many fitness magazines. They include Fitness Girls, Fit & Farm, and Fitfame. Rose was a member of cast of the fifth season of the WWE reality television series Total Divas. The fifth season began airing in January 2016. Rose also appeared in four WWE video games: WWE 2K19, 2K20, Battlegrounds and 2K22. == Personal life == Sacomano has participated in yoga, pilates and crossfit. In April 2016, she said that she was dating wrestler Sabatino Pischitelli, better known as Tino Sabbatelli. == List of movies == === Television === Year Title Role Notes 2015 WWE Tough Enough Herself Contestant; runner-up (season 6) 2016 Total Divas Main cast (season 5): 10 episodes 2023 Tamron Hall === Video games === Year Title Notes 2018 WWE 2K19 Video game debut 2019 WWE 2K20 2020 WWE 2K Battlegrounds 2022 WWE 2K22 == Championships and accomplishments == === Fitness and figure competition === * World Bodybuilding Fitness & Fashion ** 2013 WBFF Boston – (first place) ** 2014 WBFF Diva Bikini Pro World Championship – (first place) === Professional wrestling === * Pro Wrestling Illustrated ** Most Improved Wrestler of the Year (2022) ** Ranked No. 21 of the top 150 female singles wrestlers in the PWI Women's 150 in 2022 * Slam Wrestling Awards ** Best NXT Female (2022) * Women's Wrestling Fan Awards ** Best Heel of the Year (2022) * WWE ** NXT Women's Championship (1 time) == References == == Other websites == * * * Category:1990 births Category:Living people Category:American professional wrestlers Category:Female professional wrestlers Category:Former WWE wrestlers Category:Sportspeople from New York (state) Category:Television personalities from New York (state)",
 "title": "Mandy Rose"
}