{
 "id": "914856",
 "text": "\"Free and independent Artsakh\" (, ) was the national anthem of Republic of Artsakh, a country in the South Caucasus that was not recognised by many countries. It was adopted in 1992, after the fall of the Soviet Union. The words of the song were written by Vardan Hakobyan, and the melody was composed by Armen Nasibyan. It was abolished in 2023 following Azerbaijani takeover of the region. ==Lyrics== The anthem is a poem of four stanzas without the use of refrains. It is written in the Armenian language, the official state language of the Artsakh Republic and the mother tongue of nearly all of its people. In 2021, Russian became the next official language. This is likely in part due to the close historical ties the Armenian people had with the Russians. ===Armenian original=== Words of the song in Armenian Spelling of these words using the Latin alphabet Spelling of these words using the Cyrillic alphabet Pronunciation of these words using the IPA Պետական խորհրդանիշները Արտաքին գործերի նախարարություն Արցախի Հանրապետություն Azát u ankáx Artsáx, Kho tun- amrótse kertetsínkh, Patmuthyúne mer yerkrí Mer surb aryámb menkh sertetsínkh. Du berd yes anarrík, Bardzúnkh srbazán, veh anún, Masúnkh astvatzayín, Kheznóv yenkh haverzhanúm. Du mer luys Hayreníkh, Yerkír, Hayrenyáts durr siró Aprír du misht xaghágh, Mer hin u nor Gharabágh. Khajérn yenkh menkh Haykazún, Mrrav yenkh, Khirs yenkh u Tharthárr, Mer vankheróv lerrnapáh, Anhaghthelí mi burr ashxárh. Азат у анках Арцах, Қо тун-амроцә кертецинқ, Патмуҭюнә мер еркри Мер сурб арямб мэнқ сертецинқ. Ду берд ес анаррик, Бардзунқ сәрбазан, веҳ анун, Масунқ астваҵаин, Қезнов енқ ҳавержанум. Ду мер луйс Ҳайрениқ, Еркир, ҳайреняц дурр сиро Априр ду мишт хағағ, Мер ҳин у нор Ғарабағ. Қаҗерн енқ менқ ҳайказун, Мәррав енк, Қирс енқ у Ҭарҭарр, Мэр ванқеров леррнапаҳ, Анҳағҭели ми бурр ашхарҳ. [ɑ.ˈzɑt u ɑŋ.ˈkɑχ ɑɾ.ˈt͡sʰɑχ ǀ] [kʰɔ tun ɑm.ˈɾɔ.t͡sʰə kɛɾ.tɛ.ˈt͡sʰiŋkʰ ǀ] [pɑt.mu.ˈtʰju.nə mɛɾ jɛɾ.ˈkɾi ǀ] [mɛɾ suɾb ɑɾ.ˈjɑmb mɛŋkʰ sɛɾ.tɛ.ˈt͡sʰiŋkʰ ǁ] [du bɛɾtʰ‿ɛs ɑ.nɑ.ˈrik ǀ] [bɑɾ.ˈd͡zuŋkʰ səɾ.bɑ.ˈzɑn vɛh ɑ.ˈnun ǀ] [mɑ.ˈsuŋkʰ ɑst.vɑ.t͡sɑ.ˈjin ǀ] [kʰɛz.ˈnɔv‿ɛŋkʰ hɑ.vɛɾ.ʒɑ.ˈnum ǁ] [du mɛɾ lujs hɑj.ɾɛ.ˈnikʰ ǀ] [jɛɾ.ˈkiɾ hɑj.ɾɛn.ˈjɑt͡sʰ dur si.ˈɾɔ ǀ] [ɑp.ˈɾiɾ du miʃt χɑ.ˈʁɑʁ ǀ] [mɛɾ hin u nɔɾ ʁɑ.ɾɑ.ˈbɑʁ ǁ] [kʰɑ.ˈd͡ʒɛɾn‿ɛŋkʰ mɛŋkʰ hɑj.kɑ.ˈzun ǀ] [mə.ˈrɑv‿ɛŋkʰ kʰiɾs‿ɛŋkʰ u tʰɑɾ.ˈtʰɑr ǀ] [mɛɾ vɑŋ.kʰɛ.ˈɾɔv lɛr.nɑ.ˈpɑh ǀ] [ɑn.hɑʁ.tʰɛ.ˈli mi bur ɑʃ.ˈχɑɾ̥ ǁ] ===English translation=== ===Russian translation=== ==References== Category:Anthems of the Commonwealth of Unrecognised States Category:Asian anthems Category:European anthems Category:Republic of Artsakh",
 "title": "Azat u ankakh Artsakh"
}