{
 "id": "915097",
 "text": "David Osepashvili (; born 3 December 1965) is a Georgian political scientist, politician, public relations and media specialist. nplg.gov.ge ==Early life== ===School=== He graduated from Iv. Javakhishvili Tbilisi State University. He majored in Political Science. ===Early works=== At different times he worked in governmental and state agencies. In both governmental and non-governmental sectors, he worked in information monitoring, including public opinion and policy research. He has relevant organizational experience. He also gives classes to students. In addition, he has a close relationship with the nongovernmental sector and government organizations. ==Career== ===Positions=== David worked for many years in various government agencies as a chief adviser in public relations and communications, political adviser, leading analyst, chief specialist, area coordinator, expert consultant, editor-in-chief, lecturer, and in other positions. nplg.gov.ge ===Institutions=== David Osepashvili worked for such institutions as the Presidential Administration of Georgia, Ministry of Internal Affairs , Ministry of Culture, State Information Service, Tbilisi Office of Assembly, Tbilisi City Hall Administration, State Department of Youth Affairs, Millennium Challenge Georgia (MCG-MCC), Imedi TV , Public Broadcaster “First Channel”, Georgian Radio, etc. ===Projects=== He joined the project “Civil Servant against Corruption\" implemented under the sponsorship of the Open Society Georgia Foundation. He was awarded the educational grant of state employees of Tbilisi local government. He also joined an international program in Tel Aviv. It was organized by the Agency for International Development Cooperation MASHAV of Ministry of Foreign Affairs of Israel for the “Development of small and medium-sized businesses”. ===Experiences=== He has broad experience both in political activities Rustavi 2 and in relations with the press Qronikaplus.ge and television. There are many publications and interviews in the press, comments, and interviews on TV shows. == Authoritative sources == * The Biographical Dictionary of Georgia * Personal profile facebook * Georgia Public Broadcaster * Georgia Public Broadcaster * Georgia Public Broadcaster * TV company \"Rustavi 2\" * Georgian newspaper \"Qronikaplus\" * Georgian newspaper \"Qronikaplus\" * TV company \"Obieqtivi\" ==References== Category:1965 births Category:Politicians from Georgia (country) Category:Living people Category:Political scientists",
 "title": "David Osepashvili"
}