{
 "id": "915023",
 "text": "This is a list of minor planets that have been named officially. They are named by the Working Group Small Body Nomenclature (WGSBN) of the International Astronomical Union (IAU). The list is of pages that are not complete. Each page covers 1000 minor planets. All pages that exist are in . There are hundreds of thousands numbered minor planets. Very few are named, however. , there are 23,081 named minor planets. There are 600,000 numbered ones. Most of the minor planets are named after people. Most of them were astronomers. Many of them are things from mythology or fiction. Many minor planets are also named after places. These can be things like cities, towns, villages, mountains, volcanoes, rivers, observatories, organizations, clubs and astronomical societies. Some are named after animals and plants. A few minor planets are named after other things such as supercomputers and some origins are unknown. The first few thousand minor planets have all been named. The near-Earth asteroid (4596) 1981 QB is the lowest-numbered unnamed minor planet. The first 3 pages in the table contain 1,000 named entries each. The first 13 and 33 pages contain at least 500 and 100 named entries each. The first range to contain no entries is 258001–259000. There are also many name conflicts with other astronomical objects. The name conflicts are usually with with planetary satellites. After the discovering astronomer discovers a planet, they can ask for that planet to be named a specific way. New minor planet names are approved and published by IAU's WGSBN many times every year. The WGSBN has a set of rules for naming minor planets. These are from syntax restrictions to non-offensive meanings. Over the years the rules have changed many times. In the beginning, for example, most minor planets were named after female characters from Greek and Roman mythology. == Index == This is a list of all partial lists on the meanings of minor planets (MoMP). Each table has 100,000 minor planets. Each cell is a list of 1,000 numbered minor planets in order. Grayed out cells do not yet have any named minor planets. For an introduction, see . === Meanings from 1 to 100,000 === === Meanings from 100,001 to 200,000 === === Meanings from 200,001 to 300,000 === === Meanings from 300,001 to 400,000 === === Meanings from 400,001 to 500,000 === === Meanings from 500,001 to 600,000 === === Meanings from 600,001 to 700,000 === == Related pages == * List of minor planets * List of named minor planets (alphabetical) == References == == Other websites == * Asteroids discovered at the observatory of San Marcello Pistoiese in Italy * Asteroids discovered by Uppsala astronomers * Asteroids honoring people associated with Cornell Department of astronomy * Asteroids named after members of staff and graduates of the Department of Astronomy, University of Maryland * Asteroids with Canadian Connections * Asteroids with a Hamburg connection * Hungarian asteroids * In Our Skies journalistic article on asteroid nomenclature * Institute of Applied Astronomy's list of (accented) names * Kleť Numbered Minor Planets * List of \"Dutch\" asteroids (in Dutch) * Planetary Society asteroids * The Ceres Connection (asteroids named after students) * Database of the minor planets * The JPL Small-Body Database Browser * discovery circumstances and minor planets It links to the Harvard University Center for Astronomy MPES (Minor Planet Ephemeris Service) that shows minor planets. * The Minor Planet Center also has a search engine * meanings",
 "title": "Meanings of minor-planet names"
}