{
 "id": "915119",
 "text": "Ferenc Gyurcsány (born 4 June 1961) is a Hungarian politician who served as the Prime Minister of Hungary from 2004 to 2009. He is a member of the Hungarian Socialist Party and was elected to parliament in 2002. Gyurcsány was born on June 4, 1961, in Pápa, Hungary. He studied economics at the Budapest University of Economics and later earned a PhD in the same field from the University of Pécs. Gyurcsány began his political career in the early 1990s, when he was appointed as the Chairman of the Board of Directors of a state- owned construction company. He later became involved in the leadership of the MSZP and was elected to parliament in 2002. In 2004, Gyurcsány was elected as Prime Minister of Hungary after his party won a landslide victory in the parliamentary elections. His government pursued a program of economic and social reforms aimed at reducing Hungary's budget deficit and promoting growth. Gyurcsány's government introduced a number of measures aimed at improving Hungary's fiscal position and stimulating economic growth. These measures included the introduction of a flat tax system, the privatization of state-owned enterprises, and the reform of the pension system. Gyurcsány's government faced several challenges during its time in power, including a series of corruption scandals and accusations of economic mismanagement. In 2006, Gyurcsány was caught on tape admitting that his government had lied to the public about the state of Hungary's economy in the run-up to the 2006 elections. The tape sparked widespread protests and calls for Gyurcsány's resignation. However, he refused to step down and instead called for a referendum on his government's economic policies. The referendum was unsuccessful, and Gyurcsány remained in power until 2009, when his party was defeated in the parliamentary elections. Following his resignation as Prime Minister, Gyurcsány remained active in politics and founded a new political party, the Democratic Coalition, in 2011. The party has since become a prominent opposition force in Hungarian politics, advocating for progressive economic policies and democratic values. Overall, Gyurcsány is a controversial figure in Hungarian politics, with some viewing him as a competent and committed leader, while others criticize him for his role in the economic and political turmoil that characterized his time as Prime Minister. Nonetheless, he remains an influential figure in the Hungarian political landscape and continues to advocate for reform and democratic values. == Early years == Ferenc Gyurcsány is a Hungarian businessman and politician who served as the Prime Minister of Hungary from 2004 to 2009. He was born on June 4, 1961, in Pápa, Hungary. He grew up in a working-class family, and his father was a factory worker. Gyurcsány attended the University of Pécs, where he studied economics and later pursued further studies in the United States. He began his career in business, starting his own company before entering politics in the early 2000s. == Return to politics == After stepping down as Prime Minister of Hungary in 2009, Ferenc Gyurcsány returned to politics in 2010. He founded the Democratic Coalition (DK), a center-left political party, and was elected as its leader. In the 2014 European Parliament elections, DK won two seats, and Gyurcsány became a Member of the European Parliament. He has been a vocal critic of the current Hungarian government and has been involved in various protests and demonstrations against Prime Minister Viktor Orbán's administration. Gyurcsány has been a prominent figure in Hungarian politics, and his return to the political arena has reinvigorated the opposition movement. == Prime Minister == Ferenc Gyurcsány served as the Prime Minister of Hungary from 2004 to 2009. During his tenure, he implemented several economic and social reforms, including the introduction of a flat tax system and the expansion of healthcare coverage. His government also pursued a pro- European Union and pro-Atlantic foreign policy, and Hungary joined the Schengen Area during his time in office. However, his administration was marred by several controversies, including the leaking of a speech in which he admitted to lying about the state of Hungary's economy in order to win the 2006 election. The speech sparked widespread protests and calls for his resignation, and his popularity plummeted. He resigned in 2009, and his party, the Hungarian Socialist Party, was soundly defeated in the subsequent election. == Career after premiership == After stepping down as Prime Minister of Hungary in 2009, Ferenc Gyurcsány has remained active in politics and business. He founded the Democratic Coalition (DK), a center-left political party, and has been a vocal critic of the current Hungarian government led by Prime Minister Viktor Orbán. Gyurcsány has been involved in various protests and demonstrations against the Orbán administration and has been a key figure in the opposition movement. In addition to his political work, he has also been involved in business, serving as the CEO of Altus Zrt., an investment company. Gyurcsány's continued involvement in Hungarian politics and business has made him one of the most prominent and influential figures in the country. == Personal life == Ferenc Gyurcsány was born on June 4, 1961, in Pápa, Hungary. He is married and has four children. His wife, Klára Dobrev, is a politician and member of the European Parliament. Gyurcsány is known for his love of sports, particularly basketball, and he has been involved in several sports-related initiatives in Hungary. He is also a published author, having written several books on politics and economics, including \"Tűzszünet\" (\"Ceasefire\"), which chronicles his time as Prime Minister of Hungary. Gyurcsány's personal life has been relatively private, and he has largely kept his family out of the public eye. == Criticism == Ferenc Gyurcsány has faced significant criticism throughout his political career. One of the most controversial moments came in 2006, when a leaked recording of a speech revealed him admitting to lying about the state of the economy in order to win the election. The admission sparked widespread protests and calls for his resignation, and his popularity plummeted. He was also criticized for his government's handling of the 2008 financial crisis and the subsequent recession. Gyurcsány has also been accused of corruption, with some alleging that he used his position for personal gain. Finally, he has been criticized for his confrontational style and for his vocal opposition to the current Hungarian government, which has led some to accuse him of being divisive and obstructive. Category:Hungarian businesspeople Category:Prime ministers of Hungary Category:1961 births Category:Living people",
 "title": "Ferenc Gyurcsány"
}