{
 "id": "915361",
 "text": "Kamen Rider 555 (officially Masked Rider Φ's, also read Kamen Rider Faiz or Phi's) is a Japanese tokusatsu television drama. It is the 13th installment in the Kamen Rider Series. It is a joint collaboration between Ishimori Productions and Toei, and was broadcast on TV Asahi from January 26, 2003, to January 18, 2004. It aired as a part of TV Asahi's 2003 Super Hero Time block, alongside Bakuryū Sentai Abaranger. ==Story== The Smart Brain corporation, the world's most powerful corporation, is trying to take over the world using Orphnoch, the \"next stage in humanity's evolution\", to covertly kill off the human population. In pursuit of this, they develop three suits of power armor, called Rider Gears (each for Delta, Faiz, and Kaixa), to find and protect the Orphnoch King, who can fix a defect within Orphnoch DNA which causes their genetic structure to break down, leading to death. The Rider Gears are stolen by Hanagata, the Goat Orphnoch and former chief of Smart Brain. He sends them to his foster children (dubbed the \"Ryuseiji\", after the school they attended) so they can stop the Orphnoch from achieving their goal. However, Rider Gears were designed to be worn by Orphnoch, and humans are unable to activate the systems without undergoing genetic generation. A young loner, Takumi Inui, is unwittingly drawn into the conflict between the Orphnoch and humans and becomes Kamen Rider Faiz to save the life of Mari Sonada, one of the Ryuseiji. Smart Brain begins training him in an attempt to retrieve the Faiz Gear. However, there is division amongst the Orphnoch, as those who wish to co-exist with humans rather than kill him, begin resisting the Smart Brain, who in turn targets them as well. Most of these \"renegade\" Orphnochs are either killed, remain neutral or begin siding with the Ryuseiji against the Smart Brain. When the Tokyo police discover the Orphnoch are behind a series of bizarre murders, they begin operations to defeat the creatures, largely unaware of the various factions involved. They even begin performing experiments on captured Orphnoch in an attempt to find ways of destroying them, though this does not go well. The Orphnoch King eventually awakens within a young boy named Teruo Suzuki, whom Naoya Kaido and Keitaro Kikuchi saved and befriended. Now, it is up to the holders of the Rider Gears to band together and fight for humanity's survival. ==Cast== * Takumi Inui / Kamen Rider Faiz: Kento Handa * Mari Sonada: Yuria Haga * Keitaro Kikuchi: Ken Mizorogi * Yuji Kiba: Masayuki Izumi * Yuka Osada: Yoshika Kato * Naoya Kaido / Riotrooper: Mitsuru Karahashi * Masato Kusaka / Kamen Rider Kaixa: Kōhei Murakami * Shuji Mihara / Kamen Rider Delta: Atsushi Harada * Rina Abe: Rie Kasai * Kyoji Murakami: Katsuyuki Murai * Kazufumi Mizuno: Kengo Ohkuchi * Aki Sawada: Gō Ayano * Teruo Suzuki: Kayato Watanabe * Sawamura: Koji Iwakawa * Hikaru Soeno: Manami Miwake * Masahiko Minami: Atsushi Ogawa * J: Kenneth Duria * Itsuko Takuma: Jun Yamasaki * Saeko Kageyama: Waka * Kitazaki: Ray Fujita * Smart Lady: Hitomi Kurihara * Narration, Driver Voice: Takehiko Kano ===Guest actor=== * Chie Morishita (1, 2): Mika Katsumura ===Paradise Lost cast=== * Mina: Mei Kurokawa * Mina (Childhood): Mirai Shida * Mizuhara: Mocomichi Hayami * Leo / Kamen Rider Psyga: Peter Ho * Keitaro Kikuchi / Kamen Rider Kaixa: Ken Mizorogi * Yuji Kiba / Kamen Rider Orga: Masayuki Izumi ==Songs== ; Opening theme * \"Justiφ's\" ** Lyrics: Shoko Fujibayashi ** Composition: Kazuto Sato ** Arrangement: Kōtarō Nagakawa ** Artist: ISSA (of DA PUMP) ** Episodes: 2 - 49 ; Insert themes * \"Dead or alive\" ** Lyrics: Shoko Fujibayashi ** Composition: Katsuya Yoshida ** Arrangement: Akio Kondo ** Artist: Shinichi Ishihara ** Episodes: 2 - 20 * \"The people with no name\" ** Lyrics: Shoko Fujibayashi ** Rap Lyrics: m.c.A.T ** Composition: Cher Watanabe ** Arrangement: RIDER CHIPS ** Artist: RIDER CHIPS featuring m.c.A.T ** Episodes: 21 - 32, 39 * \"EGO ~ eyes glazing over\" ** Lyrics: Shoko Fujibayashi ** Composition & Arrangement: Cher Watanabe ** Artist: ICHIDAI (of ROLL DAYS) ** Episodes: 33 - 38, 41 - 48 * \"Justiφ's -Accel Mix-\" ** Lyrics: Shoko Fujibayashi ** Composition: Kazuto Sato ** Arrangement: Kazunori Miyake ** Artist: ISSA (of DA PUMP) ** Episodes: 40, Movie Category:Japanese science fiction television series Category:2003 television series debuts Category:2004 television series endings",
 "title": "Kamen Rider 555"
}