{
 "id": "915598",
 "text": "Area codes 213 and 323 are area codes for California. Area code 213 was one of the first area codes ever created in 1947. It initially covered the entire southern portion of California, but after it was split multiple times, it now covers Downtown Los Angeles and its surrounding areas, which are overlaid by multiple other area codes. The current 213 area was also split by 323 in 1998, but the 323 area combined with the 213 area to form an overlay plan in 2017.1\\. https://docs.cpuc.ca.gov/PublishedDocs/Published/G000/M165/K075/165075193.PDF It will be overlaid by 738 on November 1, 2024. a new area code, 738, will be introduced as an additional overlay for the 213/323 region to meet growing demand for phone numbers. == Area Codes 213 & 323: History and Future Changes == === Early History of 213 === Area code 213 was one of the original North American area codes introduced in 1947 as part of the first telephone numbering plan. At that time, it covered a vast region in Southern California, including Los Angeles and much of the surrounding areas. === Splits and Changes Over Time === Due to population growth and increased demand for phone numbers, 213 was gradually reduced in size through multiple splits: * 1951 – 714 was created from the southern portion of 213. * 1957 – 805 was split off to serve the coastal and central regions. * 1984 – 818 was introduced for the San Fernando Valley. * 1991 – 310 was split off to serve the Westside, South Bay, and coastal areas. * 1998 – 323 was split from 213 to cover the areas surrounding Downtown Los Angeles. === The 213/323 Overlay (2017) === By 2017, the demand for new numbers led to the decision to overlay 213 and 323, allowing both codes to be assigned within the same geographic area. This eliminated the need for further splits and required 10-digit dialing for all calls in the region. === Upcoming Overlay: 738 (2024) === To accommodate continued growth, a new area code, 738, will be introduced as an overlay for the 213/323 region, starting November 1, 2024. This means: * Existing 213 and 323 numbers will remain unchanged. * New phone numbers may be assigned the 738 area code. * 10-digit dialing will continue to be required for all calls. === Current Areas Covered by 213/323 === Today, 213 and 323 serve central Los Angeles, including: * Downtown Los Angeles * Hollywood * Silver Lake * Echo Park * Koreatown * Boyle Heights * South Los Angeles * East Hollywood == References == 213",
 "title": "Area codes 213 and 323"
}