{
 "id": "91554",
 "text": "Farida Mammadova (August 8, 1936 – December 8, 2021) was an Azerbaijani historian who specialised in the history of ancient Caucasian Albania. ==Career== She was the author of papers, articles and books on Azerbaijani ancient and medieval history. She lectured at the Baku State University, Azerbaijan Pedagogical University. She is the head of the Department of Humanities in the Western University in Baku. Farida Mammadova worked at the Institute of History of the National Academy of Sciences of Azerbaijan. In her research, she was a disciple of the late Azerbaijani historian Ziya Bunyadov. ==Controversies== ===Historical revisionism=== Her theories were criticized for the misinterpretation of historical sources and revisionism.\"Albanian Myth\" (in Russian) / V.A. Shnirelman, \"Voyni pamyati. Mifi, identichnost i politika v Zakavkazye\", Moscow, Academkniga, 2003 Thomas de Waal , Black Garden, chapter \"Urekavank\", in Russian, 2005 According to Thomas de Waal, Mammadova \"has grasped the [Caucasian] Albanian theory to supersede completely Armenians from Caucasus. She has placed the Caucasian Albania in the territory of present Republic of Armenia: all the territories, churches and monasteries in Republic Armenia have appeared Albanian\". He describes Mammadova's theories as \"an improved version of what became a very rough tool in Azerbaijan\". ===Anti-Armenianism=== During her interviews Mammadova has made anti-Armenian statements: > And, it is known, that on whole planet exactly the Armenian people is > distinguished by the absence of spiritual and other human values. [...] In > the world there are only two nations that have national identity, but have > not statehood. They are Jews and Armenians. The difference is that Jews have > created their state on their historical homeland, and Armenians have not > created their state on their historical native land. ==Publications== * The History of Albanians by Moses Kalankaytuk as a source on the social organization of Caucasian Albania, Baku, 1977. * Political history and historical geography of Caucasian Albania, Baku, 1986 * Le problem de l'ethnos alban-caucasien, \"L'antropoloqie sovietique\", Paris, 1990 * Christianity in Caucasian Albania * Caucasian Albania and the history of Albanians, Baku (in Russian), 2005 ==References== Category:1936 births Category:Living people Category:Anti-Armenianism Category:Azerbaijani academics Category:Azerbaijani historians Category:Azerbaijani nationalists Category:21st-century Azerbaijani people",
 "title": "Farida Mammadova"
}