{
 "id": "91579",
 "text": "Shah Mosque (Persian: ﻣﺴﺠﺪ ﺷﺎﻩ , Masjed-e Shāh) is a mosque in Isfahan (Isfahan), Iran. It is on the south side of Naghsh-i Jahan Square. It has been renamed to Imam Mosque after the Islamic Revolution. Built during the Safavids period, it is an excellent example of the Islamic architecture of Iran. Many people see it as the masterpiece of Persian Architecture. The Imam Mosque of Isfahan is one of the everlasting masterpieces of architecture in Iran and all over the world. It is registered along with the Naghsh-i Jahan Square as a UNESCO World Heritage Site. Its construction began in 1611. Its splendor is mainly due to the beauty of its seven-color mosaic tiles and calligraphic inscriptions. == Measurements == The port of the mosque measures 27 meters high. There are two minarets 42 meters tall on top of it. The Mosque it is surrounded with four iwans and arcades. All the walls are ornamented with seven-color mosaic tile. The most magnificent iwan of the mosque is the one facing the Qibla. It is 33 meters high. Behind it is a space which is roofed with the largest dome in the city at 52 meters height. The dome is double layered. There are two seminaries at the southwest and southeast sections of the mosque. == Architects == The architects of the mosque are reported to be the following masters: * Ustad Ali Akbar Isfahani * Ustad Fereydun Naini * Ustad Shoja' Isfahani The mosque is one of the treasures featured on Around the World in 80 Treasures presented by the architecture historian Dan Cruickshank. ==Gallery== File:Shah Mosque at night.jpg|Shah Mosque at night File:Imamsquare2.JPG|Front of the entrance archway File:Shah Mosque, Isfahan 03.jpg|Inner courtyard File:Shah Mosque, Isfahan 05.jpg|Interior decoration File:Mezquita Shah, Isfahán, Irán, 2016-09-20, DD 71-73 HDR.jpg|Inside view of the dome File:Shah Mosque (Isfahan).jpg|Interior view ==Related pages== * Sultan Ahmed Mosque == References == * Mimaran-i Iran by Zohreh Bozorg-nia. 2004. == Other websites == * Google Maps Satellite view Category:Mosques in Asia Category:Religious buildings and structures in Iran Category:17th-century buildings and structures",
 "title": "Shah Mosque"
}