{
 "id": "915880",
 "text": "Datin Paduka Marina binti Mahathir (born 9 June 1957) is a Malaysian socio- political activist and writer. She graduated from the University of Sussex. She is the eldest child of the 4th and 7th Prime Minister of Malaysia, Mahathir Mohamad. ==Career== She is a leader in many non-governmental organizations. She is a leader in the Malaysian AIDS Foundation. She is an active socio-political blogger. She also writes for The Star newspaper since 1989 in her bi-weekly column called Musings'. Some of her pieces in the column have been published in her books such as 50 Days: Rantings by MM, published in 1997 and Telling It Straight. The latter is a selection of her articles published in her column between 2003 and 2012. It includes a special written introduction on the topics discussed in the book. Besides that, it contains two previously unpublished articles. She is an active campaigner for women's rights. In 2006 she has described the status of Muslim women in Malaysia as similar to that of the Black South Africans under apartheid. Marina has called for an end to discrimination based on sexual orientations in 1998 and 1999. She had appeared in Tun Dr Mahathir Mohamad's Documentary released in late 2009 with the rest of the members of the Mahathir Family. In 2010, she was awarded UN Person of The Year for her volunteer work in combatting HIV/AIDS. In 2016 Marina denounced the destruction of Malaysian culture and traditions by what she perceives as Arab colonialism. In January 2018, a viral video of a Muslim man slapping a Muslim woman for not wearing a hijab viral incident, Marina alerted that Islamization of Malaysia will tear the country apart. She referred to Islamization as \"another form of colonisation, a concept that has never been known to being non-violent\". == References == Category:1957 births Category:Living people Category:Malaysian writers Category:Political activists Category:Malaysian activists Category:HIV/AIDS activists Category:Mahathir Mohamad family",
 "title": "Marina Mahathir"
}