{
 "id": "916038",
 "text": "Kiss Me Kosher (alternate title: Kiss Me Before It Blows Up ) is a 2020 German–Israeli movie. It was directed and scripted by Shirel Peleg.\"'Kiss Me Kosher': Sparks fly when an Israeli woman and a German woman fall in love in this cross-cultural farce\" (Feb. 21, 2021) ==Basis== The story is based on the true-life love story of Peleg and her partner.Marric, Linda \"Kiss my culture\" The Jewish Chronicle (Nov. 4, 2021) Accessed Dec. 10, 2021Ping \"Q&A; with writer-director Shirel Peleg on her first feature: Kiss me before it blows up\" Lesflicks (March 27, 2021) Accessed Dec. 10, 2021. The movie is Peleg's first as a director.\"Shirel Peleg\" Israel Film Center (Accessed Dec. 10, 2021). == Plot == While on vacation in Israel, Maria, a German biologist, meets the bar owner Shira and falls in love with her. Shortly after the end of the vacation, Maria has decided to stay in Israel and move in with Shira, when a misunderstanding happens and Shira believes she is being given a wedding proposal. Many complications arise. It is not only about the initial mistaken engagement but also the fact that some members of Shira's family (especially her grandmother Berta) are opposed to her marrying a German. After hearing about the engagement, Maria's parents soon appear in Israel, and two different family worlds collide in Jerusalem. == Background and Production == Kiss Me Kosher was mostly filmed in Tel Aviv, but with some shooting in Jerusalem. The movie was first released in Germany and Austria, and later in Switzerland in late 2020. It has since been show in several international film festivals.\"Kiss Me Kosher - on the big screen and at home\" Outshine LGBTQ Film Festival (Oct. 17, 2021)\"Kiss me kosher\" Atlanta Jewish Film Festival (Feb. 16-27, 2022)\"Kiss me kosher\" Chai Flicks Hannukkah Film Festival (Dec. 2021) == Other websites == * IMDB: Kiss me before it blows up * Kiss Me Kosher bei X Verleih ==References== Category:2020 romantic comedy movies Category:German comedy movies Category:German romance movies Category:Israeli movies Category:Movies set in Israel",
 "title": "Kiss Me Kosher"
}