{
 "id": "91610",
 "text": "Black tea is a kind of tea made from leaves of Camellia sinensis. Often, it is stronger in taste than other varieties of tea, like green tea or oolong. It also has more caffeine. In some parts of the world, like China, it is called red tea, a description of the colour of the liquid. The Western term \"black tea\" comes from the color of the tea leaf. It has been traded a lot because it could be kept longer. It is generally the preferred form of tea in the West. All People Consumed tea in a daily life routine. Tea is the most-consumed thing in the world after water. One of the best tea is Black tea and Its benefits is very effective. ==Producing area and varieties== Unblended black teas are named after the region in which they are produced. ===India=== One of the most famous countries producing black tea, exporting more than 12% of the world's tea. Darjeeling, Assam, and Nilgiri are known as representative producing areas. ;Darjeeling :Darjeeling is grown in Darjeeling district on the foothills of the Himalayas in West Bengal, India. The fragrance is outstandingly good and is compared to the incense of flower or the fruit such as muscatel. It is regarded as the \"Champagne of Teas\". *Assam :Assam district is major producing area in the northeast of India. It has a sweet fragrance and full-bodied taste and suits milk or sugar. The colour of liquid is dark red. *Nilgiri :The Nilgiri region is hilly area in southern India. The liquid is clear red. It is suitable for tea with milk and particularly spice. Nilgiri has fresh and clear fragrance and clean but solid flavor. ===Sri Lanka=== Sri Lanka is next to India in the total production of black tea. The generic name for black tea which grown in Sri Lanka is Ceylon tea. *Uva *Kandy *Dimbula *Nuwara Eliya *Ruhuna ===China=== Tea produced in China has characteristic that the taste is not so bitter. Straight tea is more popular than tea with milk or sugar in China. *Keemun ==Blends== Black tea is often blended with other black tea or various other plants. *English Breakfast :One of the most popular blended tea for breakfast. It is blended to go well with milk or sugar. *Earl Grey :The blended tea sprayed bergamot oil which gives it the smell of a citrus fruit. ==Health== Black tea without milk or sugar contains no calories. Black tea also contains tannin and the caffeine. There is a connection between blood-cholesterol-lowering (BCL) and drinking black tea. According to a 2001 Boston University study, there is a relationship between a more drinking black tea and a decrease in a kind of cardiovascular disease. ==References== Category:Tea",
 "title": "Black tea"
}