{
 "id": "916513",
 "text": "The Ovambo people (), also called Aawambo, Ambo, Aawambo (Ndonga, Nghandjera, Kwambi, Mbalantu), or Ovawambo (Kwanyama) are the main ethnic group in Namibia. They are 49% of the population in Namibia.Namibia: People and Society, CIA Factbook, United States; \"about 50% of the population belong to the Ovambo tribe\", total population: 2.4 million == Ovambo clans == This table has the names, areas, dialect names and the locations of the Ovambo according to T. E. Tirronen's Ndonga-English Dictionary. The table also has information about the of noun class of the Proto-Bantu language for these words.Toivo Emil Tirronen: Ndonga-English Dictionary. Oshinyanyangidho shongeleki ELCIN. Oniipa, 1986. Area Clan Dialect Location Classes 9 (*ny > on-), 11 (uu-/ou-) Class 2 (*wa-, a-) Class 7 (*ki > oshi-) O-ndonga Aa-ndonga Oshi-ndonga Southern Ovamboland Uu-kwambi Aa-kwambi Oshi-kwambi Central Ovamboland Oshakati O-ngadjera Aa-ngandjera Oshi-ngandjera Central Ovamboland Uu- kwaluudhi Aa-kwaluudhi Oshi-kwaluudhi Western Ovamboland O-mbalanhu Aa- mbalanhu Oshi-mbalanhu Western Ovamboland Uu-kolonkadhi Aa-kolonkadhi Oshi- kolonkadhi Western Ovamboland Ou-kwanyama Ova-kwanyama Oshi-kwanyama Northern and Eastern Ovamboland, Southern Angola E-unda Ova-unda Oshi-unda Western Ovamboland, Epalela vicinity O-mbadja Ova-mbadja Oshi-mbadja Southern Angola, Shangalala region ==References== ===Bibliography=== * Karl Angebauer, Ovambo : Fünfzehn Jahre unter Kaffern, Buschleuten und Bezirksamtmännern, A. Scherl, Berlin, 1927, 257 p. * P. H. Brincker, Unsere Ovambo-Mission sowie Land, Leute, Religion, Sitten, Gebräuche, Sprache usw. der Ovakuánjama-Ovámbo, nach Mitteilungen unserer Ovambo-Missionare zusammengestellt, Barmen, 1900, 76 p. * Wolfgang Liedtke & Heinz Schippling, Bibliographie deutschsprachiger Literatur zur Ethnographie und Geschichte der Ovambo, Nordnamibia, 1840–1915, annotiert, Staatliches Museum für Völkerkunde Dresden, Dresde, 1986, 261 p. *Teddy Aarni, The Kalunga concept in Ovambo religion from 1870 onwards, University of Stockholm, Almquist & Wiksell, 1982, 166 p. . *Leonard N. Auala, The Ovambo : our problems and hopes, Munger Africana Library, California Institute of Technology, Pasadena (Cal.), 1973, 32 p. *Allan D. Cooper, Ovambo politics in the twentieth century, University Press of America, Lanham, Md., 2001, 350 p. . *Gwyneth Davies, The medical culture of the Ovambo of Southern Angola and Northern Namibia, University of Kent at Canterbury, 1993 (thesis) *Patricia Hayes, A history of the Ovambo of Namibia, c 1880-1935, University of Cambridge, 1992 (thesis) *Maija Hiltunen, Witchcraft and sorcery in Ovambo, Finnish Anthropological Society, Helsinki, 1986, 178 p. *Maija Hiltunen, Good magic in Ovambo, Finnish Anthropological Society, Helsinki, 1993, 234 p. *Matti Kuusi, Ovambo proverbs with African parallels, Suomalainen Tiedeakatemia, Helsinki, 1970, 356 p. *Carl Hugo Linsingen Hahn, The native tribes of South-West Africa : The Ovambo - The Berg Damara - The bushmen of South West Africa - The Nama - The Herero, Cape Times Ltd., Le Cap, 1928, 211 p. *Seppo Löytty, The Ovambo sermon : a study of the preaching of the Evangelical Lutheran Ovambo-Kavango Church in South West Africa, Luther- Agricola Society, Tampere (Finland), 1971, 173 p. *Giorgio Miescher, The Ovambo Reserve Otjeru (1911–1938) : the story of an African community in Central Namibia, Basler Afrika Bibliographien, Bâle, 2006, 22 p. *Ramiro Ladeiro Monteiro, Os ambós de Angola antes da independência, Instituto Superior de Ciências Sociais e Políticas, Lisbon, 1994, 311 p. (thesis, in ) ==Other websites== *Language Map of Namibia Category:Ethnic groups in Africa Category:Namibia Category:Angola",
 "title": "Ovambo people"
}