{
 "id": "916762",
 "text": "This is a list of minor-planet discoverers for people who have discovered of one or more minor planets (such as near-Earth and main-belt asteroids, Jupiter trojans and distant objects). , the discovery of 612,011 numbered minor planets are from 1141 astronomers and 253 observatories, telescopes or surveys (see ). == Discovering astronomers == Astronomer Discoveries Country Link- label; info, links, and notes Name(s) at MPC Cite Hiroshi Abe (astronomer) 28 1958–pres. H. Abe; H. Abe Masanao Abe 2 1967–pres. M. Abe; disc: and M. Abe Mark Abraham (astronomer) 3 n.a. M. Abraham; amateur, Src M. Abraham — Christopher Aikman 4 1943–pres. G. C. L. Aikman; G. C. L. Aikman — Makio Akiyama 16 1950–pres. M. Akiyama; Susono Observatory M. Akiyama Vladimir Albitsky 10 1891–1952 V. Albitskij; Simeiz Observatory V. Albitskij Gregory Scott Aldering 4 1962–pres. G. Aldering; G. Aldering Heikki A. Alikoski 13 1912–1997 H. Alikoski; Turku Obs. H. Alikoski Éric J. Allen n.a. É. J. Allen; E. J. Allen — Rhiannon Lynne Allen 5 n.a. R. L. Allen; R. Lynne Jones R. L. Allen; L. Allen Martin Altmann 10 n.a. M. Altmann; ARI-Gaia, first disc: M. Altmann — Jeff T. Alu 24 1966–pres. J. Alu; amateur J. Alu Leonard L. Amburgey 2 1945–pres. L. L. Amburgey; amateur, disc: and L. L. Amburgey — Joe Anderson (astronomer) 7 n.a. J. Anderson; , co-disc. w/ #C. Veillet J. Anderson — A. David Andrews 1 1933–pres. A. D. Andrews; A. D. Andrews — Milan Antal 17 1935–1999 M. Antal; M. Antal Plinio Antolini 4 1920–2012 P. Antolini; amateur, (bio-it) P. Antolini — Pierre Antonini 35 1933–pres. P. Antonini; amateur P. Antonini Masakatsu Aoki 2 1957–pres. M. Aoki; amateur; unrelated to M. Aoki — Rolf Apitzsch 89 1943–pres. R. Apitzsch; amateur, (bio-de) R. Apitzsch Masaru Arai 45 1952–pres. M. Arai; amateur M. Arai Hiroshi Araki 3 1935–pres. H. Araki; unrelated to H. Araki — Sylvain Arend 51 1902–1992 S. Arend; S. J. Arend Claire Armstrong n.a. C. Armstrong; amateur, wife of M. Armstrong C. Armstrong James D. Armstrong 1 n.a. J. D. Armstrong; J. D. Armstrong — Mark Armstrong (astronomer) 2 1958–pres. M. Armstrong; amateur, husband of C. Armstrong, unrelated to M. Armstrong — Atsuo Asami 12 n.a. A. Asami; A. Asami — David J. Asher 10 1966–pres. D. J. Asher; D. J. Asher Karl Augustesen 6 1945–pres. K. Augustesen; K. Augustesen Walter Baade 10 1893–1960 W. Baade; W. Baade Ulrika Babiaková 14 1976–2002 U. Babiaková; U. Babiakova Paolo Bacci 1968–pres. P. Bacci; amateur; (bio-it) P. Bacci Hannes Bachleitner 2 1965–pres. H. Bachleitner; also Johannes Bachleitner, amateur, disc: and H. Bachleitner Solon Irving Bailey 1 1854–1931 S. I. Bailey; unrelated to S. I. Bailey — David D. Balam 56 n.a. D. D. Balam; D. D. Balam Loren C. Ball 108 1948–pres. L. Ball; amateur L. Ball Thomas J. Balonek 9 n.a. T. J. Balonek; T. J. Balonek; T. Balonek — Odette Bancilhon 1 1908–1998 O. Bancilhon; disc: O. Bancilhon Susan Banh n.a. S. Banh; (bio-it) S. Banh — Nigel P. Bannister n.a. N. P. Bannister; University of Leicester N. P. Bannister — Yoshiaki Banno 1 1952–1991 Y. Banno; Y. Banno Evelin Bányai n.a. E. Bányai; E. Banyai — Cesare Barbieri 11 1942–pres. C. Barbieri; C. Barbieri John C. Barentine 6 1976–pres. J. C. Barentine; John Caleb Barentine J. C. Barentine Kristina M. Barkume n.a. K. M. Barkume; (bio-it) K. M. Barkume — Ewan Barr 5 n.a. E. Barr; (bio-it) E. Barr — Sergio Barros 7 n.a. S. Barros; (bio-it) S. Barros — Sandro Bartolini 1974–pres. S. Bartolini; unrelated to S. Bartolini Maria A. Barucci 3 n.a. M. A. Barucci; disc: , and M. A. Barucci; M. Barucci James Bauer (astronomer) 1968–pres. J. Bauer; James M. Bauer, James \"Gerbs\" Bauer J. Bauer Ivo Baueršíma 1931–pres. I. Baueršíma; (bio-de) I. Bauersima — Johann M. Baur 15 1930–2007 J. M. Baur; amateur, (bio-de) J. M. Baur David E. Beatty n.a. D. Beatty; (bio-it); unrelated to D. Beatty — D. Beaver n.a. D. Beaver; amateur, co-discoverer with J. Dellinger at Needville, TX D. Beaver — Andrew C. Becker 644 1973–pres. A. C. Becker; (bio-it) A. C. Becker; A. Becker Jim Bedient 8 n.a. J. Bedient; J. Bedient — E. S. Beeson n.a. E. S. Beeson; unrelated to E. S. Beeson — Raoul Behrend 14 1964–pres. R. Behrend; (bio-fr) R. Behrend Bruce Edward Behymer 1983–pres. B. E. Behymer; (bio-it) B. E. Behymer — Sergey Belyavsky 36 1883–1953 S. Belyavskyj; S. Beljavskij — Graham E. Bell 57 n.a. G. Bell; G. Bell — Federico Bellini 1 n.a. F. Bellini; (bio-it), unrelated to F. Bellini — Yuri A. Belyaev 7 n.a. Yu. A. Belyaev; :it:Jurij A. Beljaev, :fr:Iouri Beliaïev, unrelated to Yu. A. Belyaev — Denis Bergeron 2 1956–pres. D. Bergeron; (bio-it) D. Bergeron — Fabrizio Bernardi 23 1972–pres. F. Bernardi; F. Bernardi Laurent Bernasconi 41 1966–pres. L. Bernasconi; amateur, (bio-fr) L. Bernasconi K. Berney n.a. K. Berney; K. Berney — Gary M. Bernstein 3 n.a. G. Bernstein; C/2014 UN271, UPenn G. Bernstein — Emanuel Bettelheim n.a. E. Bettelheim; E. Bettelheim — Francesco Biasci n.a. F. Biasci; F. Biasci — Wolf Bickel 852 1942–pres. W. Bickel; amateur W. Bickel Jamie Biggs n.a. J. Biggs; J. Biggs — Guillaume Bigourdan 1 1851–1932 G. Bigourdan; disc: G. Bigourdan — Harald Bill 1 1964–pres. H. Bill; amateur H. Bill Gary W. Billings 6 n.a. G. W. Billings; amateur, (bio-fr) G. W. Billings Richard P. Binzel 3 1958–pres. R. P. Binzel; R. P. Binzel Kurt Birkle 9 1939–2010 K. Birkle; (bio-de) K. Birkle Mirel Bîrlan 2 1963–pres. M. Birlan; (bio-ro), co-disc. w/ #O. Vaduvescu M. Birlan Peter Birtwhistle 94 1958–pres. P. Birtwhistle; amateur, Src P. Birtwhistle Manolo Blasco 5 n.a. M. Blasco; (bio-it) M. Blasco — Laurent Blind 1 1965–pres. L. Blind; C. R. L. Blind; L. Blind Adam Block (astrophotographer) 1973–pres. A. Block; (bio-it) A. Block Andrea Boattini 296 1969–pres. A. Boattini; A. Boattini Hermann Boehnhardt n.a. H. Boehnhardt; H. Boehnhardt — Andreas Boeker 2 1964–2011 A. Boeker; amateur, disc: and , (bio-it), A. Boeker Michel Bœuf 12 n.a. M. Boeuf; (bio-it), HP M. Boeuf — Henri M. J. Boffin 11 n.a. H. Boffin; H. M. J. Boffin; H. Boffin — Alfred Bohrmann 9 1904–2000 A. Bohrmann; A. Bohrmann Tom Boles 1944–pres. T. Boles; amateur T. Boles Dennis Borgman 1952–pres. D. Borgman; D. Borgman Gennadiy Borisov 1 1962–pres. G. Borisov; discovered 2I/Borisov G. Borisov — Freimut Börngen 538 1930–pres. F. Börngen; F. Borngen Alphonse Borrelly 18 1842–1926 A. Borrelly; A. Borrelly Josep Maria Bosch 7 n.a. J. M. Bosch; amateur, also see J. M. Bosch — Grégoire Bourban 4 n.a. G. Bourban; disc: and G. Bourban — Paul Bourgeois 1898–1974 P. Bourgeois; (bio- it) P. Bourgeois Edward L. G. Bowell 571 1943–pres. E. Bowell; E. Bowell Louis Boyer (astronomer) 40 1901–1999 L. Boyer; L. Boyer Richard P. Boyle 13 1943–pres. R. P. Boyle; disc: and , Src R. P. Boyle Joseph L. Brady n.a. J. L. Brady; (bio-it) J. L. Brady — Nigel Brady (astronomer) 7 n.a. N. Brady; N. Brady — Steve Brady (astronomer) 2 n.a. S. Brady; disc: and , (bio-it) S. Brady — Alexis Brandeker 4 1974–pres. A. Brandeker; A. Brandeker — Vanja Brcic 2 n.a. V. Brcic; (bio-it) V. Brcic — John Broughton 1189 1952–pres. J. Broughton; amateur J. Broughton Jeffery A. Brown n.a. J. A. Brown; Src J. A. Brown — Michael E. Brown 29 1965–pres. M. E. Brown; M. E. Brown Ladislav Brožek 23 1952–pres. L. Brožek; L. Brozek — Jim Bruton 2 n.a. J. Bruton; James Bruton, disc: and , Src J. Bruton — Dan Bruton 5 1967–pres. W. D. Bruton; (bio-fr) W. D. Bruton — Jacobus Albertus Bruwer 4 1915–pres. J. A. Bruwer; (bio-it) J. A. Bruwer Emil Buchar 1 1901–1979 E. Buchar; (bio-it) E. Buchar Marc Buie 1132 1958–pres. M. W. Buie; M. W. Buie Christian Buil 5 n.a. C. Buil; amateur, (bio-fr) C. Buil Todd Burdullis n.a. T. Burdullis; CFHT Src T. Burdullis — Geoffrey Burks n.a. G. Burks; G. Burks — Matthew R. Burleigh n.a. M. R. Burleigh; M. R. Burleigh — Bella A. Burnasheva 13 1944–pres. B. A. Burnasheva; B. A. Burnasheva Robert Burnham Jr. 1931–1993 R. Burnham; R. Burnham Joseph A. Burns 1941–pres. J. A. Burns; J. A. Burns Schelte J. Bus 1683 1956–pres. S. J. Bus; S. J. Bus Matthias Busch 13 1968–pres. M. Busch; amateur Src and Src M. Busch Philippe Buttani 1966–pres. P. Buttani; amateur, (bio-fr) P. Buttani Luca Buzzi 1 1982–pres. L. Buzzi; amateur, (bio-it) L. Buzzi Rodolfo Calanca n.a. R. Calanca; (bio-it) R. Calanca — R. Campbell (astronomer) n.a. R. Campbell; , (obs.697) R. Campbell – Michael P. Candy 3 1928–1994 M. P. Candy; (bio-it) M. P. Candy Albino Carbognani 1965–pres. A. Carbognani; A. Carbognani Luigi Carnera 16 1875–1962 L. Carnera; L. Carnera Don W. Carona n.a. D. W. Carona; D. W. Carona — Alfredo Caronia 4 n.a. A. Caronia; (bio-it) A. Caronia — Rafael Carrasco Garrorena 1 1902–1981 R. Carrasco; (bio-it), unrelated to R. Carrasco — Uri Carsenty 1949–pres. U. Carsenty; (bio-fr) U. Carsenty Claudio Casacci 8 1958–pres. C. Casacci; C. Casacci James Len Casady 3 n.a. L. Casady; L. Casady — Ferrán Casarramona 2 n.a. F. Casarramona; (bio-it) F. Casarramona — Ricard Casas (astronomer) 2 n.a. R. Casas; (bio-it) R. Casas — Flavio Castellani 6 n.a. F. Castellani; (bio-it) F. Castellani — Vincenzo Silvano Casulli 200 1944–pres. V. S. Casulli; amateur V. S. Casulli Gabriele Cattani 18 n.a. G. Cattani; G. Cattani — Cyril Cavadore 5 1969–pres. C. Cavadore; (bio-it) C. Cavadore Marco Cavagna 19 1958–2005 M. Cavagna; amateur M. Cavagna G. Cavalletti n.a. G. Cavalletti; G. Cavalletti — Anthony J. Cecce 18 n.a. A. J. Cecce; (bio-fr) A. J. Cecce — Vasco Cecchini 2 1932–pres. V. Cecchini; amateur, (bio-it) V. Cecchini Edvardas Černis n.a. E. Černis; E. Cernis — Kazimieras Černis 154 1958–pres. K. Černis; K. Cernis — Vincenzo Cerulli 1 1859–1927 V. Cerulli; disc: V. Cerulli Carlos Ulrrico Cesco 19 19XX–1987 C. U. Cesco; C. U. Cesco Mario R. Cesco 6 n.a. M. R. Cesco; son of C. U. Cesco, (bio-it) M. R. Cesco — Brian C. Chaboyer n.a. B. Chaboyer; IAU B. Chaboyer — Jean Chacornac 6 1823–1873 J. Chacornac; J. Chacornac Marcus Tristan Chamberlin 2 n.a. M. T. Chamberlin; disc: , unrelated to M. T. Chamberlin — Zhang Jiaxiang 1932–2019 C.-H. Chang; C.-H. Chang Man-Ti Chang 5 n.a. M.-T. Chang; M.-T. Chang — Zhāng Yùzhé 1902–1986 Y. C. Chang; Y. C. Chang Auguste Charlois 99 1864–1910 A. Charlois; A. Charlois Robin Chassagne 1962–pres. R. Chassagne; (bio-it) R. Chassagne Robert Chemin n.a. R. Chemin; (bio-it) R. Chemin Jun Chen (astronomer) 11 n.a. J. Chen; J. Chen — Tao Chen (astronomer) 3 1980–pres. T. Chen; disc: , Chen Tao, 陈韬 (天文学家) (bio-it), (bio-zh) T. Chen Y.-C. Cheng n.a. Y.-C. Cheng; Y.-C. Cheng — Lyudmila Chernykh 267 1935–2017 L. I. Chernykh; Ludmila I. Chernykh L. I. Chernykh Nikolai Chernykh 537 1931–2004 N. S. Chernykh; Nikolai Stepanovich Chernykh N. S. Chernykh Dennis K. Chesney 38 n.a. D. K. Chesney; D. K. Chesney — Dmitry Chestnov 23 n.a. D. Chestnov; Dmitrij Nikolaevič Čestnov D. Chestnov; D. N. Chestnov — Eugene Chiang 1973–pres. E. Chiang; (bio-it) E. Chiang — Paolo Chiavenna 15 n.a. P. Chiavenna; P. Chiavenna — Jack B. Child 13 1951–pres. J. B. Child; (bio-fr) J. B. Child K.-J. Choo n.a. K.-J. Choo; K.-J. Choo — Per Rex Christensen n.a. P. R. Christensen; (bio-it) P. R. Christensen — Bernard Christophe 96 n.a. B. Christophe; amateur, (bio-fr) B. Christophe — Joseph Churms 2 1926–1994 J. Churms; disc: and , (bio-it) J. Churms — Jacqueline Ciffréo n.a. J. Ciffréo; disc: 108P/Ciffréo; (fr) J. Ciffreo — James L. Clem n.a. J. L. Clem; CV J. L. Clem — Roy Clingan 64 1950–pres. R. Clingan; amateur, (bio-it) R. Clingan Edwin Foster Coddington 3 1870–1950 E. F. Coddington; E. F. Coddington — S. Cofré 11 n.a. S. Cofré; S. Cofre — Jérôme Eugène Coggia 5 1849–1919 J. Coggia; J. Coggia — Seth M. Cohen n.a. S. Cohen; unrelated to S. Cohen — Robert Francis Coker 4 n.a. R. Coker; (bio-it) R. Coker — François Colas 2 1959–pres. F. Colas; (bio-it) F. Colas Simon Collander-Brown 2 n.a. S. Collander-Brown; disc: , Src S. Collander-Brown — Matthew Collier (astronomer) 2 n.a. M. Collier; disc: , unrelated to , (bio-fr) M. Collier — Michael Collins (astronomer) 51 n.a. M. Collins; Myke Collins, unrelated to , (bio-fr) M. Collins — Ermes Colombini 4 1956–pres. E. Colombini; amateur, mentioned: E. Colombini Juan Pablo Colque n.a. J. P. Colque; Juan Pablo Colque Saavedra, co-disc. w/ #F. Pozo J. P. Colque — Enrico Colzani 1956–pres. E. Colzani; amateur, Gruppo Astrofili Brianza (bio-it) E. Colzani Josep Comas i Solà 11 1868–1937 J. Comas i Solà; J. Comas Sola , Paul G. Comba 691 1926–2017 P. G. Comba; amateur P. G. Comba Martin Connors 1954–pres. M. Connors; M. Connors Walter R. Cooney Jr. 47 1962–pres. W. R. Cooney Jr.; amateur W. R. Cooney Jr. Pablo Cottenot 1 n.a. P. Cottenot; disc: P. Cottenot — Fernand Courty 2 1862–1921 F. Courty; disc: and F. Courty — Philip Herbert Cowell 1870–1949 P. H. Cowell; P. H. Cowell Greg Crawford 3 n.a. G. Crawford; at Bagnall Beach Observatory, unrelated to G. Crawford — Lucy D. Crespo da Silva 1978–2000 L. Crespo da Silva; Lucy d'Escoffier Crespo da Silva, (bio-it) L. Crespo da Silva Kiyoshi Kurosu 2 1965–pres. K. Cross; disc: and , (bio-it) K. Cross — Alex Cruz (astronomer) 2 n.a. A. Cruz; amateur, disc: and , unrelated to , (bio-it) A. Cruz — Balázs Csák 3 1979–pres. B. Csák; disc: and , (bio-it) B. Csak — Tibor Csörgei 1 1972–pres. T. Csörgei; T. Csorgei Ignacio de la Cueva 3 n.a. I. d. l. Cueva; C85 I. d. l. Cueva — Steve Cullen n.a. S. Cullen; LightBuckets S. Cullen — Leland E. Cunningham 4 1904–1989 L. E. Cunningham; Leland Erskin Cunningham L. E. Cunningham Heber Doust Curtis 1872–1942 H. D. Curtis; unrelated to H. D. Curtis — Karl F. J. Cwach n.a. K. F. J. Cwach; amateur, (bio-it) K. F. J. Cwach — Germano D'Abramo 3 1973–pres. G. D'Abramo; G. D'Abramo Heinrich Louis d'Arrest 1 1822–1875 H. d'Arrest; disc: H. d'Arrest Ivano Dal Prete n.a. I. Dal Prete; amateur, (bio-it) I. Dal Prete — Gergely Dálya 1 n.a. G. Dálya; G. Dalya — Nichole M. Danzl 6 n.a. N. Danzl; (bio-it) N. Danzl Juliet C. Datson 3 1980–pres. J. C. Datson; Juliet Clare Datson, assumed GER nat' J. C. Datson E.-M. David n.a. E.-M. David; E.-M. David — Donald R. Davis 2 n.a. D. Davis; D. Davis Richard G. Davis 4 n.a. R. G. Davis; (bio-fr) R. G. Davis — B. C. Dawson n.a. B. C. Dawson; assumed B. C. Dawson — Matt Dawson (astronomer) 6 1959–pres. M. Dawson; amateur, Src M. Dawson Leo Anton Karl de Ball 1 1853–1916 K. de Ball; disc: K. de Ball — Peter De Cat 23 n.a. P. De Cat; (bio-it) P. De Cat — Annibale de Gasparis 9 1819–1892 A. de Gasparis; A. de Gasparis David R. De Graff 2 n.a. D. R. De Graff; disc: and , (bio-it) D. R. DeGraff — Fiore De Luise 3 1977–pres. F. De Luise; Campo Imperadore F. D. Luise Miguel de Pascual Martínez n.a. M. de Pascual; disc: , (bio-it) M. de Pascual — José De Queiroz 3 1954–pres. J. De Queiroz; amateur J. De Queiroz Charles P. de Saint-Aignan 12 1977–pres. C. P. de Saint-Aignan; C. P. de Saint-Aignan Giovanni de Sanctis 42 1949–pres. G. DeSanctis; G. De Sanctis James A. DeYoung n.a. J. DeYoung; USNO-astronomer,Src (bio-it) J. DeYoung — Henri Debehogne 743 1928–2007 H. Debehogne; H. Debehogne Catherine E. Delahodde 1974–pres. C. E. Delahodde; C. E. Delahodde Ian dell'Antonio 10 n.a. I. dell'Antonio; Ian P. dell'Antonio, Deep Lens Survey I. Dell'Antonio — Joseph A. Dellinger 83 1961–pres. J. Dellinger; amateur, (bio-it) J. Dellinger Eugène Joseph Delporte 66 1882–1955 E. Delporte; E. Delporte Audrey C. Delsanti 2 1976–pres. A. C. Delsanti; disc: and . Src A. C. Delsanti; A. Dalsanti — Christophe Demeautis 13 n.a. C. Demeautis; amateur, (bio-fr) C. Demeautis Alíz Derekas 3 1977–pres. A. Derekas; (bio-it) A. Derekas — Alexander Nikolaevich Deutsch 1 1901–1986 A. Deutsch; Aleksandr Nikolaevič Dejč, disc: A. Deutsch — Harlan Devore n.a. H. Devore; (bio-it) H. Devore — Dennis di Cicco 60 1950–pres. D. di Cicco; D. di Cicco Aldo Di Clemente 1948–pres. A. Di Clemente; amateur A. Di Clemente Mario Di Martino 2 1947–pres. M. Di Martino; Turin Observatory M. Di Martino Andrea Di Paola 20 1970–pres. A. Di Paola; A. Di Paola; A. D. Paola Mario Di Sora 5 1961–pres. M. Di Sora; amateur, (bio-it) M. Di Sora; M. DiSora Wilhelm Dieckvoß 2 1908–1982 W. Dieckvoß; disc: and , (bio-de) W. Dieckvoss Elizabeth R. Dillon n.a. E. R. Dillon; amateur, (bio-it) E. R. Dillon William G. Dillon 58 1957–pres. W. G. Dillon; (bio-it) W. G. Dillon Alessandro Dimai 1962–pres. A. Dimai; amateur, (bio-it) A. Dimai Bojan Dintinjana 1 n.a. B. Dintinjana; B. Dintinjana — David S. Dixon 25 1947–pres. D. S. Dixon; amateur, at Jornada Observatory , (bio-it) D. S. Dixon Petar Đurković 2 1908–1981 P. Đurković; see P. Djurkovic — Jerzy Dobrzycki 1927–2004 J. Dobrzycki; disc: , (bio-it) J. Dobrzycki — Fabio Dolfi 3 1966–pres. F. Dolfi; amateur F. Dolfi Sauro Donati 22 1959–pres. S. Donati; amateur, (bio-it) S. Donati Alain Doressoundiram 2 1968–pres. A. Doressoundiram; (bio-fr) A. Doressoundiram Eric Dose 2 n.a. E. Dose; Farpoint E. Dose — François Dossin 5 1927–1998 F. Dossin; (bio-fr) F. Dossin — Adam Draginda 2 n.a. A. Draginda; CFHT A. Draginda — Luiz Duczmal 2 n.a. L. Duczmal; Luiz Henrique Duczmal, disc: and , (bio-it) L. Duczmal — Raymond Smith Dugan 16 1878–1940 R. S. Dugan; R. S. Dugan R. Scott Dunbar 10 n.a. R. S. Dunbar; Roy Scott Dunbar, (bio-it) R. S. Dunbar; S. Dunbar A. Dunlap-Smith n.a. A. Dunlap-Smith; A. Dunlap-Smith — A. Dunn n.a. A. Dunn; inferred, unrelated to A. Dunn — Philippe Dupouy 2 1952–pres. P. Dupouy; amateur, (bio-it) P. Dupouy Douglas Tybor Durig 52 1961–pres. D. T. Durig; (bio-it) D. T. Durig — Chris F. Durman n.a. C. F. Durman; (bio-it), discovery with Bev M. Ewen-Smith C. F. Durman — Wolfgang J. Duschl 1 n.a. W. J. Duschl; W. J. Duschl — Marino Dusić 2 n.a. M. Dusić; disc: and , (bio-de) M. Dusic — Ron Dyvig 1 n.a. R. Dyvig; (bio-it) R. Dyvig — Max Eastman (astronomer) 9 n.a. M. Eastman; amateur, , Src M. Eastman — J. Edmonds n.a. J. Edmonds; inferred J. Edmonds — Ilgmārs Eglītis 21 1951–pres. I. Eglītis; (bio-fr) I. Eglitis Norbert Ehring 5 1937–pres. N. Ehring; amateur, (bio-de), N. Ehring — Leonid Elenin 122 1981–pres. L. Elenin; amateur L. Elenin — James L. Elliot 29 1943–2011 J. L. Elliot; J. L. Elliot Eric Walter Elst 3870 1936–pres. E. W. Elst; E. W. Elst; E. Elst Gary P. Emerson (astronomer) n.a. G. Emerson; (bio- it), unrelated to G. Emerson — Mark Emmerich 2 1967–pres. M. Emmerich; amateur, Guidestar , disc: and with Sven Melchert M. Emmerich — Kin Endate 625 1960–pres. K. Endate; amateur K. Endate Emil Ernst 1 1889–1942 E. Ernst; (bio-de) E. Ernst — Gilbert A. Esquerdo 2 1976–pres. G. A. Esquerdo; disc: and G. A. Esquerdo N. Wyn Evans n.a. W. Evans; Src, unrelated to W. Evans — Bev M. Ewen-Smith n.a. B. M. Ewen-Smith; (bio-it), co-discovery with Chris F. Durman B. M. Ewen-Smith — Giancarlo Fagioli 22 1940–pres. G. Fagioli; amateur, (bio-it) G. Fagioli Norman Falla 22 n.a N. Falla; amateur, (bio-it), Src N. Falla — Anikó Farkas–Takács 4 n.a. A. Farkas; , Src A. Farkas — Tony L. Farnham 3 1964–pres. T. L. Farnham; disc: , and T. L. Farnham K. L. Faul n.a. K. L. Faul; inferred K. L. Faul — Gina Fedon 3 n.a. G. Fedon; (bio-it) G. Fedon — James Ferguson (American astronomer) 3 1797–1867 J. Ferguson; USNO-astronomer,Src J. Ferguson Antonio Ferragamo n.a. A. Ferragamo; (Src) A. Ferragamo — M. Ferrando 38 n.a. M. Ferrando; co-discoverer with R. Ferrando M. Ferrando — Rafael Ferrando 235 1966–pres. R. Ferrando; R. Ferrando Joan Lluís Ferrer n.a. J. L. Ferrer; C85 J. L. Ferrer — Walter Ferreri 15 1948–pres. W. Ferreri; W. Ferreri Mario A. Ferrero 2 1904–1965 M. Ferrero; disc: and , (bio-it) M. Ferrero Ignacio Ramón Ferrín Vázquez 12 1943–pres. I. R. Ferrín; (bio-it) I. R. Ferrin; I. Ferrin — Martin Fiedler 5 1978–pres. M. Fiedler; amateur, (bio-de) M. Fiedler — Greg Fisch n.a. G. Fisch; (bio-it) G. Fisch — Alan Fitzsimmons 17 n.a. A. Fitzsimmons; (bio-it); (HP and Src) A. Fitzsimmons Ellen Fletcher n.a. E. Fletcher; inferred Src E. Fletcher — Jean-Christophe Le Floch 1 1965–pres. J.-C. Le Floch; L. Floch Hans Jørn Fogh Olsen 4 1943–pres. H. J. Fogh Olsen; (bio-it) H. J. Fogh Olsen Sergio Foglia 3 1972–pres. S. Foglia; amateur, disc: and , related: (197P/LINEAR-it) S. Foglia Wilhelm Julius Foerster 1 1832–1921 W. Förster; Wilhelm Foerster, MPC-typo: Forster W. Forster Peter Forshay 2 n.a. P. Forshay; inferred; data analyst, at CFHT; co-discoverer #M. Micheli: Src P. Forshay — Giuseppe Forti 49 1939–2007 G. Forti; Beppe Forti, at Arcetri Observatory G. Forti Filip Fratev 28 1974–pres. F. Fratev; founder F. Fratev — Richard Fredrick 1953–pres. R. Fredrick; amateur R. Fredrick T. F. Fric n.a. T. F. Fric; inferred, co-discovery with R. J. Gilbrech T. F. Fric — Royal Harwood Frost 1 1879–1950 R. H. Frost; disc: R. H. Frost — Hiroshi Fujii 2 n.a. H. Fujii; wrong person? H. Fujii — Tetsuya Fujii 22 1960–pres. T. Fujii; amateur T. Fujii Yasuhide Fujita 3 1961–pres. Y. Fujita; amateur, Kuma Kogen Astronomical Observatory Y. Fujita Hideo Fukushima 2 1953–pres. H. Fukushima; (bio-it) H. Fukushima Gábor Fűrész 1978–pres. G. Fűrész; (bio-it) G. Furesz — Toshimasa Furuta 82 n.a. T. Furuta; T. Furuta — Fumihiko Futaba 2 n.a. F. Futaba; inferred; disc: and F. Futaba — Marissa Gahran 2 n.a. M. Gahran; disc and (bio-it) M. Gahran — Steven L. Gaiser n.a. S. L. Gaiser; inferred S. L. Gaiser — Štefan Gajdoš 15 1959–pres. Š. Gajdoš; (bio-it) S. Gajdos Avishay Gal-Yam 1970–pres. A. Gal-Yam; (bio-it) A. Gal-Yam — Adrián Galád 81 1970–pres. A. Galád; A. Galad Emanuela Galliani n.a. E. Galliani; amateur, (bio-it) E. Galliani — Paul Garossino 14 1953–pres. P. Garossino; Paul G. A. Garossino P. Garossino; P. G. A. Garossino Gordon J. Garradd 33 1959–pres. G. J. Garradd; Gordon John Garradd, amateur G. J. Garradd Antonio Garrigós- Sánchez 1961–pres. A. Garrigós-Sánchez; amateur, , Src and Src A. Garrigos — Romain Gauderon 5 n.a. R. Gauderon; (bio-it), co-discoveries with R. Behrend R. Gauderon — Michael Geffert 5 1953–pres. M. Geffert; (bio-de), Src, Src, Src , not to be confused with Martin Geffert M. Geffert Tom Gehrels 4661 1925–2011 T. Gehrels; T. Gehrels Teddy George n.a. T. George; Observing Assistant at CFHT during 2003–2008 Src T. George — Oleg Geraščenko 2 n.a. O. Geraščenko; Oleg Gerashchenko, (bio-it), first: O. Gerashchenko — Vladimir Gerke 13 n.a. V. Gerke; amateur, Src V. Gerke — Herta Gessner n.a. H. Gessner; (bio-it) H. Gessner — Pierangelo Ghezzi 18 1956–pres. P. Ghezzi; amateur, variable stars (bio-it) P. Ghezzi Alex R. Gibbs 2 1967–pres. A. R. Gibbs; with Catalina Sky Survey, discoverer of comets, disc: , (bio-it) A. R. Gibbs James B. Gibson (astronomer) 27 n.a. J. Gibson; (bio-it) J. Gibson Henry L. Giclas 17 1910–2007 H. L. Giclas; H. L. Giclas Richard Gierlinger 43 1967–pres. R. Gierlinger; amateur at , (bio-it) R. Gierlinger Richard J. Gilbrech n.a. R. J. Gilbrech; inferred, co-discovery with T. F. Fric R. J. Gilbrech — Alan C. Gilmore 42 n.a. A. C. Gilmore; A. C. Gilmore Ricardo Gil-Hutton 1958–pres. R. Gil-Hutton; co-disc. w/ J. Licandro R. Gil-Hutton Valter Giuliani 22 1960–pres. V. Giuliani; (bio-it) V. Giuliani — Alessio Giunta 1 n.a. A. Giunta; INAF A. Giunta — Brett J. Gladman 20 1966–pres. B. Gladman; B. Gladman Mitch Glaze n.a. M. Glaze; inferred, amateur, at M. Glaze — Arianna E. Gleason 5 1980–pres. A. Gleason; A. Gleason Tom Glinos 21 1960–pres. T. Glinos; amateur, (bio-it) T. Glinos Hermann Goldschmidt 14 1802–1866 H. Goldschmidt; amateur H. Goldschmidt David B. Goldstein (astronomer) n.a. D. B. Goldstein; unrelated to , (bio-it) D. B. Goldstein — Josep Juliá Gómez Donet n.a. J. J. Gomez; (bio-it) J. J. Gomez François Gonnessiat 2 1856–1934 F. Gonnessiat; F. Gonnessiat Luis E. González 2 n.a. L. E. González; Luis Eduardo González, disc: , , and , Img, (bio-it) L. E. Gonzalez — Vittorio Goretti 32 1939–2016 V. Goretti; Src V. Goretti Paul Götz 20 1883–1962 P. Götz; Max Wolf's assistant P. Gotz Andrew Graham (astronomer) 1 1815–1908 A. Graham; disc: A. Graham — Albert D. Grauer 4 1942–pres. A. D. Grauer; (bio-it) A. D. Grauer Tommy Grav 4 1973–pres. T. Grav; (bio-de) T. Grav Mauro Graziani 2 n.a. M. Graziani; amateur, disc: and , co-discoverer w/ F. Tozzi, (bio-it) M. Graziani — Robert Greimel n.a. R. Greimel; inferred, Src R. Greimel — Dave Grennan 2 n.a. D. Grennan; disc: , HP, chng Dave to David Grennan D. Grennan — Markus Griesser (astronomer) 10 1949–pres. M. Griesser; amateur, Eschenberg Observatory, (bio-de) M. Griesser Ian P. Griffin 28 1958–pres. I. P. Griffin; (bio-de) I. P. Griffin — A. Grigsby 2 n.a. A. Grigsby; inferred, disc: and A. Grigsby — John Gross (astronomer) 7 1959–pres. J. Gross; amateur J. Gross Arie William Grossman n.a. A. Grossman; unrelated to , (bio-it) A. Grossman — Gavril Grueff n.a. G. Grueff; (bio-it) G. Grueff — C. Gualdoni n.a. C. Gualdoni; C. Gualdoni — Joan Guarro i Fló 5 n.a. J. Guarro i Fló; (bio-it) J. Guarro — Daria Guidetti 2 1978–pres. D. Guidetti; D. Guidetti Ernesto Guido 6 1977–pres. E. Guido; E. Guido Amanda Sickafoose Gulbis 2 1975–pres. A. Gulbis; disc: (parents) and A. Gulbis Sun Guoyou 1984–pres. G. Sun; also Guoyou Sun, amateur, disc: C/2015 F5 (SWAN-XingMing), supernovae, novae, variable/double stars, planetary nebulae at Xingming Obs. G. Sun Cynthia Gustava 3 n.a. C. Gustava; (bio-it) C. Gustava — Knut Anton Walter Gyllenberg 1 1886–1952 K. Gyllenberg; (bio-it) K. Gyllenberg — Bernhard Häusler 1958–pres. B. Häusler; amateur, Src B. Haeusler — Olivier R. Hainaut 12 1966–pres. O. R. Hainaut; O. R. Hainaut Mark Hammergren 2 1964–pres. M. Hammergren; (bio-it) M. Hammergren Terry Handley 7 1952–2015 T. Handley; amateur T. Handley A. T. Hansen n.a. A. T. Hansen; Src A. T. Hansen — Leif Hansen (astronomer) n.a. L. Hansen; (bio-it) L. Hansen — M. W. Hansen n.a. M. W. Hansen; inferred M. W. Hansen — D. S. Hardage n.a. D. S. Hardage; co-disc. w/ D. T. Durig, Cordell-Lorenz D. S. Hardage — Karl Ludwig Harding 1 1765–1843 K. Harding; disc: K. Harding Eugene A. Harlan 2 1921–2014 E. A. Harlan; (bio- it) E. A. Harlan — Malcolm Hartley 3 1947–pres. M. Hartley; cometary discoveries, Siding Spring, UK Schmidt Telescope M. Hartley Johannes Franz Hartmann 3 1865–1936 J. Hartmann; unrelated to J. Hartmann — Takashi Hasegawa n.a. T. Hasegawa; unrelated to T. Hasegawa — Nariyasu Hashimoto 7 n.a. N. Hashimoto; co-discoverer with #T. Sakamoto N. Hashimoto — Shuji Hayakawa 41 1958–pres. S. Hayakawa; Syuji Hayakawa, (bio-it) S. Hayakawa David Healy (astronomer) 231 1936–2011 D. Healy; D. Healy Zsuzsanna Heiner 15 1949–pres. Z. Heiner; (bio-it) Z. Heiner — Joseph Helffrich 13 1890–1971 J. Helffrich; J. Helffrich Eleanor F. Helin 903 1932–2009 E. F. Helin; E. F. Helin Stephan Hellmich 9 1981–pres. S. Hellmich; DLR–Asteroids and Comets, Src , Img S. Hellmich Karl Ludwig Hencke 2 1793–1866 K. L. Hencke; K. L. Hencke Arne Henden 1950–pres. A. Henden; A. Henden Prosper-Mathieu Henry 7 1849–1903 P. M. Henry; P. M. Henry — Paul- Pierre Henry 7 1848–1905 P. P. Henry; P. P. Henry — David R. Herald 3 n.a. D. Herald; amateur D. Herald Carl W. Hergenrother 33 1973–pres. C. W. Hergenrother; C. W. Hergenrother Kenneth E. Herkenhoff 2 n.a. K. Herkenhoff; (bio-it) K. Herkenhoff — Ejnar Hertzsprung 2 1873–1967 E. Hertzsprung; E. Hertzsprung Merrill Hess 2 1955–pres. M. Hess; amateur M. Hess Michael Hibbs 2 n.a. M. Hibbs; Mike Hibbs, , Tarleton State University Obs. (I43) M. Hibbs – David Higgins (astronomer) 1961–pres. D. Higgins; David J. Higgins; amateur, disc: D. Higgins Richard E. Hill 7 1949–pres. R. Hill; Richard Erik Hill, Richard Rik Hill, (bio-it), Src R. Hill John Russell Hind 10 1823–1895 J. R. Hind; J. R. Hind Tsutomu Hioki 56 n.a. T. Hioki; (bio-it) T. Hioki Masanori Hirasawa 52 n.a. M. Hirasawa; M. Hirasawa — Joe Hobart 47 1944–pres. J. Hobart; chng to Joseph R. Hobart J. Hobart Gabriella Hodosán 9 n.a. G. Hodosán; inferred G. Hodosan – Sebastian F. Hönig 571 1977–pres. S. F. Hönig; (bio-it), Src S. F. Hoenig Cuno Hoffmeister 5 1892–1968 C. Hoffmeister; C. Hoffmeister , Mark Hollands 1 n.a. M. Hollands; M. Hollands — William Holliday (astronomer) n.a. W. Holliday; inferred W. Holliday — Matthew J. Holman 11 1967–pres. M. J. Holman; M. J. Holman Robert Holmes (astronomer) 125 1956–pres. R. Holmes; Robert E. Holmes Jr., amateur, Astronomical Research Inst. Src, (bio-it) R. Holmes Henry E. Holt 690 1929–pres. H. E. Holt; H. E. Holt Paulo R. Holvorcem 424 1967–pres. P. R. Holvorcem; Paulo Holvorcem P. R. Holvorcem; P. Holvorcem Ulrich Hopp n.a. U. Hopp; (bio-it) U. Hopp — H. Hori 3 n.a. H. Hori; disc: , and .Possibly Hiroshi Hori; see Geodesy with the World's Smallest (3-m) VLBI Telescope H. Hori — Felix Hormuth 117 1975–pres. F. Hormuth; F. Hormuth Kamil Hornoch 1972–pres. K. Hornoch; amateur K. Hornoch Irwin K. Horowitz n.a. I. Horowitz; (bio-it) I. Horowitz — Tara Houlden n.a. T. Houlden; with Emily Ross T. Houlden — Léo Houziaux 3 1932–pres. L. Houziaux; (bio-fr) L. Houziaux Meredith Howard n.a. M. Howard; inferred, unrelated to M. Howard — Ellen Howell 1961–pres. E. Howell Bus; former wife of S. J. Bus; discoverer of comet 88P/Howell; ; (bio-it); E. Howell Bus Steve Howell 1 n.a. S. Howell; PSI S. Howell — Xiangyao Hsiao 17 n.a. X. Y. Hsiao; disc: ; grandfather X. Y. Hsiao; H.-Y. Hsiao — Edwin Hubble 1889–1953 E. Hubble; E. Hubble John Huchra 1948–2010 J. Huchra; J. Huchra Gary Hug 340 n.a. G. Hug; amateur G. Hug — Joseph Hunaerts 2 1912–1979 J. Hunaerts; Joseph J. Hunaerts, disc: and , (bio-fr) J. Hunaerts — Kiichirō Furukawa 92 1929–2016 K. Furukawa; MPC-typo: Hurukawa K. Hurukawa Dieter Husar 1947–pres. D. Husar; (bio-it) D. Husar Robert Hutsebaut 10 1941–pres. R. Hutsebaut; amateur, (bio-it) R. Hutsebaut Ho Seong Hwang 2 n.a. H. S. Hwang; H. S. Hwang — Giampiero Iatteri 1941–2004 G. Iatteri; amateur, (bio-it) G. Iatteri Jorge Iglesias Páramo n.a. J. Iglesias-Paramo; Jorge Iglesias- Páramo, co-disc. w/ #O. Vaduvescu J. Iglesias-Paramo — Yasukazu Ikari 20 n.a. Y. Ikari; (bio-it) Y. Ikari — Kustaa Aadolf Inkeri 1908–1997 K. Inkeri; (bio- it), unrelated to K. Inkeri — Shigeru Inoda 17 1955–2008 S. Inoda; amateur, (bio-de) S. Inoda Masaru Inoue (astronomer) 12 n.a. M. Inoue; unrelated to , (bio-it) M. Inoue — Sergei I. Ipatov 8 1952–pres. S. I. Ipatov; Sergij Ivanovič Ipatov, Sergueï Ivanovitch Ipatov S. I. Ipatov; S. Ipatov Michael J. Irwin 8 n.a. M. J. Irwin; unrelated to , (bio-fr) M. J. Irwin; M. Irwin — Koichi Itagaki 3 1947–pres. K. Itagaki; amateur, (bio-it) K. Itagaki Kazuyoshi Itō n.a. K. Itō; K. Ito — Miguel Itzigsohn 15 18XX–1978 M. Itzigsohn; (bio-es) M. Itzigsohn Nikolaj Ivanov (astronomer) 3 n.a. N. Ivanov; (alt. Nikolay Ivanov; Николай Иванов) unrelated to , (bio-it) N. Ivanov — Violeta G. Ivanova 14 n.a. V. G. Ivanova; V. G. Ivanova; V. Ivanova Jurij Mykolajovyč Ivaščenko 21 1961–pres. Y. Ivaščenko; Yuri Ivaščenko, disc: , (bio-it) Y. Ivashchenko — Masayuki Iwamoto 6 1954–pres. M. Iwamoto; M. Iwamoto Shun-ei Izumikawa 2 n.a. S. Izumikawa; S. Izumikawa — Gerhard Jackisch n.a. G. Jackisch; (bio-it) G. Jackisch — Cyril Jackson (astronomer) 72 1903–1988 C. Jackson; C. Jackson Cristóvão Jacques (astronomer) 6 n.a. C. Jacques; (bio-it) C. Jacques — Herve Jacquinot 1 n.a. H. Jacquinot; Observatoire des Terres Blanches, H. Jacquinot — Jost Jahn 9 1959–pres. J. Jahn; amateur, discovery of aka 2013 KN6 at SATINO Remote Obs.; Src; (bio-it) J. Jahn Quentin Jamieson 3 n.a. Q. Jamieson; Q. Jamieson — David James (astronomer) 2 n.a. D. James; first disc. , co-disc. w/ #R. L. Allen D. James — Robert Jedicke 9 1963–pres. R. Jedicke; 179P/Jedicke, 269P/Jedicke, (bio-it) R. Jedicke Hamilton M. Jeffers 1893–1976 H. M. Jeffers; Hamilton Moore Jeffers H. M. Jeffers Emmanuël Jehin n.a. E. Jehin; TRAPPIST, U Liège E. Jehin — Peter Jekabsons 2 1943–1990 P. Jekabsons; amateur, (bio-it) P. Jekabsons Benjamin Jekhowsky 12 1881–1975 B. Jekhovsky; B. Jekhovsky Kåre S. Jensen n.a. K. S. Jensen; (bio-it) K. S. Jensen — Poul Jensen (astronomer) 98 n.a. P. Jensen; at Brorfelde Observatory P. Jensen Young-Beom Jeon 45 n.a. Y.-B. Jeon; Y.-B. Jeon — David C. Jewitt 52 1958–pres. D. C. Jewitt; D. C. Jewitt; D. J. Jewitt Jin Zhangwei 2 1968–pres. Z.-W. Jin; Zhang-Wei Jin, first disc: , (bio-it) Z.-W. Jin; Z. Jin Ernest Leonard Johnson 18 18xx–1977 E. L. Johnson; E. L. Johnson — Michael L. Johnson 2 n.a. M. L. Johnson; disc: and , (bio-it) M. L. Johnson — David Jones (astronomer) n.a. D. Jones; La Palma (IAU , Bio) D. Jones — Gilbert R. Jones 7 n.a. G. R. Jones; inferred, disc: G. R. Jones — Richard E. Jones 2 n.a. R. E. Jones; disc: and , (bio-it) R. E. Jones — Amy B. Jordan (astronomer) 30 n.a. A. B. Jordan; A. B. Jordan — Charles W. Juels 475 1944–2009 C. W. Juels; amateur C. W. Juels Mario Jurić 125 1979–pres. M. Jurić; M. Juric — Anlaug Amanda Kaas n.a. A. A. Kaas; A. A. Kaas — Tetsuo Kagawa 115 1969–pres. T. Kagawa; at Gekko Observatory T. Kagawa Franz Kaiser 21 1891–1962 F. Kaiser; Heidelberg astronomer F. Kaiser Watari Kakei 3 1947–pres. W. Kakei; (bio-fr) W. Kakei — Dušan Kalmančok 7 1945–pres. D. Kalmančok; D. Kalmancok Lars Kamél 2 1960–pres. L. Kamél; disc: and L. Kamel Karl Walter Kamper 3 1941–1998 K. W. Kamper; (bio-it) K. W. Kamper — Kiyotaka Kanai 1951–pres. K. Kanai; amateur K. Kanai Ethan Kandler 3 n.a. E. Kandler; (bio-it) E. Kandler — Jens Kandler 25 1973–pres. J. Kandler; (bio-de) J. Kandler; J. Kander Hiroshi Kaneda 705 1953–pres. H. Kaneda; orbit computer H. Kaneda Lyudmila Karachkina 130 1948–pres. L. G. Karachkina; L. G. Karachkina Y. Karavaev 1 n.a. Y. Karavaev; Y. Karavaev — Stefan Karge 61 1963–pres. S. Karge; amateur S. Karge Ádám Kárpáti 2 n.a. Á. Kárpáti; disc: and , unrelated to A. Karpati — Galina Ričardovna Kastel' 9 n.a. G. R. Kastel'; ITA astronomer, (bio-it) G. R. Kastel' John J. Kavelaars 11 1966–pres. J. J. Kavelaars; J. J. Kavelaars Kōyō Kawanishi 13 1959–pres. K. Kawanishi; K. Kawanishi Nobuhiro Kawasato 105 n.a. N. Kawasato; N. Kawasato James Edward Keeler 2 1857–1900 J. E. Keeler; J. E. Keeler János Kelemen 4 1951–pres. J. Kelemen; Piszkéstető Stn., Src, Src J. Kelemen Stephen Kent (astronomer) 1 n.a. S. Kent; S. Kent — Susan D. Kern 63 1977–pres. S. D. Kern; Susan D. Benecchi (née Kern), at Space Telescope Science Institute, (bio-it) S. D. Kern James W. Kessel 26 n.a. J. W. Kessel; J. W. Kessel — B. Khafizov n.a. B. Khafizov; B. Khafizov — Pamela M. Kilmartin 41 n.a. P. M. Kilmartin; P. M. Kilmartin Seung-Lee Kim n.a. S.-L. Kim; inferred S.-L. Kim — A. Király 5 n.a. A. Király; A. Kiraly — Randolph L. Kirk n.a. R. Kirk; (bio-it) R. Kirk — Karsten Kirsch 3 n.a. K. Kirsch; co-disc: , and , (bio-it) K. Kirsch — László L. Kiss 56 1972–pres. L. Kiss; (bio-it) L. Kiss Minoru Kizawa 12 1947–pres. M. Kizawa; M. Kizawa — Marcel Klein 6 1984–pres. M. Klein; amateur, disc: and , Src M. Klein — Arnold Richard Klemola 16 1931–2019 A. R. Klemola; (bio-de) A. R. Klemola Jan T. Kleyna 8 n.a. J. Kleyna; (bio-it) J. Kleyna — Rainer Kling 88 1952–pres. R. Kling; amateur, (bio-de) R. Kling Alain Klotz 7 1947–pres. A. Klotz; amateur, (bio-fr) A. Klotz Mary Ellen Knewston n.a. M. Knewtson; (vs. Knewston), inferred, amateur M. Knewtson — Zoran Knežević (astronomer) 1949–pres. Z. Knežević; Z. Knezevic André Knöfel 18 1963–pres. A. Knöfel; amateur, (bio-de) A. Knofel Viktor Knorre 4 1840–1919 V. Knorre; Victor Karlovich Knorre V. Knorre Jurō Kobayashi 2 1949–pres. J. Kobayashi; amateur, (bio-it) J. Kobayashi Takao Kobayashi 2479 1961–pres. T. Kobayashi; T. Kobayashi Michal Kočer 8 n.a. M. Kočer; disc: , (bio-it) M. Kocer — Bernd Koch 3 1955–pres. B. Koch; amateur, (bio-it) B. Koch Peter Kocher 113 1939–pres. P. Kocher; amateur, (bio-fr), HP P. Kocher Michael König 2 1966–pres. M. König; amateur, disc: , Src M. Koenig — Luboš Kohoutek 76 1935–pres. L. Kohoutek; L. Kohoutek Masahiro Koishikawa 19 1952–pres. M. Koishikawa; M. Koishikawa Takuo Kojima 45 1955–pres. T. Kojima; amateur, (bio-it) T. Kojima Ales Kolář 2 n.a. A. Kolář; disc: and , (differs from Jan Kolář , ) A. Kolar — Eberhard Koldewey 2 1937–pres. E. Koldewey; disc: and , (bio-it) E. Koldewey Peter Kolény 35 n.a. P. Kolény; P. Koleny — Arthur König (astronomer) 1895–1969 A. König; son of Arthur Peter König, (bio-it) A. Konig August Kopff 68 1882–1960 A. Kopff; A. Kopff Korado Korlević 1295 1958–pres. K. Korlević; amateur K. Korlevic Leonard Kornoš 37 1956–pres. L. Kornoš; (bio-it) L. Kornos Stanislav Alexandrovich Korotkiy 2 1983–pres. S. Korotkiy; amateur, (bio-it) S. Korotkiy Hiroki Kosai 93 1933–pres. H. Kosai; at Tokyo Astronomical Observatory H. Kosai Alexander Kostin 5 n.a. A. Kostin; (Houston, TX, U.S.A.), comets A. Kostin — Michael C. Kotson n.a. M. C. Kotson; (CV) M. C. Kotson — Georgiy U. Koval'chuk 2 n.a. G. Koval'chuk; disc: and G. Kovalchuk — Charles T. Kowal 22 1940–2011 C. T. Kowal; Charles Thomas Kowal C. T. Kowal — Richard Kowalski 14 1963–pres. R. A. Kowalski; disc: R. A. Kowalski Rainer Kracht 3 1948–pres. R. Kracht; amateur, HP, (bio-it) R. Kracht Thilo Kranz n.a. T. Kranz; Src T. Kranz — Rainer Kresken 13 n.a R. Kresken; disc: R. Kresken — Mike Kretlow 8 1967–pres. M. Kretlow; (bio-it) M. Kretlow Charles J. Krieger 1898–pres. C. J. Krieger; Charles John Krieger, (bio-it) C. J. Krieger — A. Kriete n.a. A. Kriete; inferred A. Kriete — Richard Kron 1 n.a. R. Kron; R. Kron — Timur Valer'evič Krjačko 104 1970–pres. T. V. Kryachko; amateur, (bio-it) T. V. Kryachko; T. Kryachko; c. Kryachko Marcin Kubiak n.a. M. Kubiak; M. Kubiak — Jeremy Martin Kubica 22 n.a. J. Kubica; disc: J. Kubica — Kazuo Kubokawa 1903–1943 K. Kubokawa; K. Kubokawa François Kugel 410 1959–pres. F. Kugel; Observatoire Chante-Perdrix F. Kugel; C. R. F. Kugel Zoltán Kuli 161 1977–pres. Z. Kuli; Zoltán \"Zoli\" Kuli, amateur astronomer, Src Z. Kuli György Kulin 21 1905–1989 G. Kulin; G. Kulin Pratibha Kumar 3 n.a. P. Kumar; wife of V. Reddy, disc: , and , Src, Src P. Kumar — Nikolaj Efimovič Kuročkin 2 1923–2003 N. E. Kuročkin; disc: and , (bio-it) N. E. Kurochkin — Hirohisa Kurosaki 13 1970–pres. H. Kurosaki; H. Kurosaki Stefan Kürti 9 1960–pres. S. Kürti; amateur, Src S. Kurti Lothar Kurtze 1972–pres. L. Kurtze; amateur, L. Kurtze — Reiki Kushida 1 n.a. R. Kushida; amateur, wife of Y. Kushida, disc: R. Kushida Yoshio Kushida 56 1957–pres. Y. Kushida; amateur, husband of R. Kushida Y. Kushida Michał Kusiak 23 1986–pres. M. Kusiak; Src M. Kusiak Peter Kušnirák 294 1974–pres. P. Kušnirák; P. Kusnirak Jaroslav Květoň 2 n.a. J. Květoň; disc: , (bio-it) J. Kveton — Andrzej Kwiek n.a. A. Kwiek; disc: , (bio-fr) A. Kwiek — Peter Kyrylenko 15 1987–pres. P. Kyrylenko; at Andrushivka Astronomical Observatory P. Kyrylenko Juan Lacruz 64 n.a. J. Lacruz; (bio-it) J. Lacruz — Claes-Ingvar Lagerkvist 146 1944–pres. C.-I. Lagerkvist; at Uppsala Astronomical Observatory C.-I. Lagerkvist; C. Lagerkvist Joanny- Philippe Lagrula 1 1870–1941 J. Lagrula; disc: J. Lagrula Luciano Lai 13 1948–pres. L. Lai; (bio-it) L. Lai Peter B. Lake n.a. P. B. Lake; amateur P. B. Lake – Carl Otto Lampland 1 1873–1951 C. O. Lampland; disc: C. O. Lampland Werner Landgraf 7 1959–pres. W. Landgraf; W. Landgraf Marco Langbroek 1 1970–pres. M. Langbroek; M. Langbroek Jeffrey A. Larsen 2 1967–pres. J. A. Larsen; (bio-fr) J. A. Larsen Stephen M. Larson 2 n.a. S. M. Larson; (bio-fr) S. M. Larson Tod R. Lauer 2 1957–pres. T. Lauer; Tod Richard Lauer T. Lauer Vygandas Laugalys 8 n.a. V. Laugalys; (bio-it) V. Laugalys — Marguerite Laugier 21 1896–1976 M. Laugier; M. Laugier Joseph Jean Pierre Laurent 1 1823–1900 J. J. P. Laurent; \"J.J.P.\" vs \"J.\", disc: , (bio-fr) J. J. P. Laurent Stephen P. Laurie 50 n.a. S. P. Laurie; amateur S. P. Laurie — Kenneth J. Lawrence 33 1964–pres. K. J. Lawrence; of Palomar Planet-Crossing Asteroid Survey K. J. Lawrence Susannah Lazar 1982–pres. S. Lazar; amateur, (bio-it) S. Lazar — Charles le Morvan 1 1865–1933 C. le Morvan; disc: , (bio- fr) C. le Morvan — Carlos Leal (astronomer) 9 n.a. C. Leal; unrelated to , (bio-fr) C. Leal — Byung-Chol Lee 37 n.a. B.-C. Lee; (bio-it) B.-C. Lee — L. Lee n.a. L. Lee; inferred L. Lee Tae-Hyung Lee 1964–pres. T. H. Lee; (bio-it) T. H. Lee Jonathan P. Leech n.a. J. P. Leech; inferred J. P. Leech — Gerhard Lehmann 23 1960–pres. G. Lehmann; amateur, (bio-de) G. Lehmann Hubert Lehmann 1 n.a. H. Lehmann; H. Lehmann — Gregory J. Leonard 11 n.a. G. J. Leonard; (bio-it) G. J. Leonard — Riccardo Leoni 1 n.a. R. Leoni; R. Leoni — Otto Lesser 1 1830–1887 O. Lesser; disc: O. Lesser — Ken Levin 11 1953–pres. K. Levin; physicist and amateur at BlackBird Obs. K. Levin Stephen Levine (astronomer) 1965–pres. S. Levine; Stephen E. Levine S. Levine David H. Levy 65 1948–pres. D. H. Levy; D. H. Levy; D. Levy Wendee Levy 4 1948–pres. W. Levy; Wendee Esther Wallach Levy, wife of D. H. Levy, (bio-it) W. Levy Javier Licandro 1966–pres. J. Licandro; co-disc. w/ R. Gil-Hutton J. Licandro William Liller 2 1927–pres. W. Liller; W. Liller Lin Qisheng (astronomer) 65 1964–pres. C.-S. Lin; a.k.a. Lin Chi-Sheng, (bio-it) C.-S. Lin; C. S. Lin Hung-Chin Lin 88 n.a. H.-C. Lin; (林宏欽), H.-C. Lin — B. Linderholm n.a. B. Linderholm; also see #R. Linderholm B. Linderholm — Robert Linderholm 26 1933–2013 R. Linderholm; R. Linderholm — Bernadet Linero 2 n.a. B. Linero; B. Linero — V. Linkov n.a. V. Linkov; co-disc. #K. Polyakov V. Linkov — Tim Lister (astronomer) 2 n.a. T. Lister; (544116); Las Cumbres Obs.; Src T. Lister — Karl Lohnert 4 1885–1944 K. Lohnert; Karl Julius Lohnert, (bio-it) K. Lohnert A. Lokalov 1 n.a. A. Lokalov; disc: A. Lokalov — Vladimir O. Lokot' 2 n.a. V. Lokot'; disc: and V. Lokot — Dinesh Loomba 6 n.a. D. Loomba; Src D. Loomba — Álvaro López-García 12 1941–pres. Á. López-G.; (bio-it) A. Lopez Ángel López Jiménez 58 1955–pres. Á. López J.; (bio-it) A. Lopez — Jean-Marie Lopez 7 n.a. J.-M. Lopez; amateur J.-M. Lopez; J. M. Lopez — Joachim Lorenz 6 1955–pres. J. Lorenz; amateur, disc: , J. Lorenz — Wilhelm Lorenz (astronomer) 4 1886–1918 W. Lorenz; Karl Wilhelm Lorenz, (bio-it), (bio-de) W. Lorenz — Miklós Lovas 2 1931–pres. M. Lovas; at Konkoly Observatory, (bio-it) M. Lovas Jessica Lovering 25 n.a. J. R. Lovering; Jessica R. Lovering, co-disc.: and , CV J. R. Lovering — Andrew Lowe 511 1959–pres. A. Lowe; amateur, orbit computer, (bio-it), HP A. Lowe Percival Lowell 1 1855–1916 P. Lowell; disc: P. Lowell Paul Luckas 2 1962–pres. P. Luckas; amateur, (bio-it) P. Luckas Christian B. Luginbuhl 3 1955–pres. C. B. Luginbuhl; (bio-it) C. B. Luginbuhl Kjell Lundgren 2 1950–pres. K. Lundgren; at Uppsala Astronomical Observatory K. Lundgren Federica Luppi n.a. F. Luppi; F. Luppi — Robert Luther 24 1822–1900 R. Luther; R. Luther Jane Luu 39 1963–pres. J. X. Luu; J. X. Luu Lucas M. Macri 1972–pres. L. Macri; (bio-it) L. Macri — Hiroshi Maeno 7 n.a. H. Maeno; (bio-it) H. Maeno — John Mahony (astronomer) 10 n.a. J. Mahony; amateur, Src J. Mahony — Marie Mahrová 4 1947–pres. M. Mahrová; (bio-it) M. Mahrova — Renu Malhotra 1961–pres. R. Malhotra; R. Malhotra Franco Mallia 15 1961–pres. F. Mallia; amateur, (bio-it) F. Mallia Francesco Manca 26 1966–pres. F. Manca; amateur F. Manca Jan Karel Mánek 1961–pres. J. Manek; amateur J. Manek Brian G. W. Manning 19 1926–2011 B. G. W. Manning; amateur B. G. W. Manning Massimiliano Mannucci 1970–pres. M. Mannucci; amateur, unrelated to ; (bio-it) M. Mannucci — José Manteca 13 1959–pres. J. Manteca; Pepe Manteca, (bio-it) J. Manteca Ilan Manulis 1947–pres. I. Manulis; inferred I. Manulis Frédéric Maréchal 2 1952–pres. F. Maréchal; amateur, (bio-it) F. Marechal — Wladimiro Marinello 3 n.a. W. Marinello; amateur, (bio-it) W. Marinello Mark Scott Marley n.a. M. S. Marley; (bio-it) M. S. Marley — Brian G. Marsden 1937–2010 B. G. Marsden; B. G. Marsden Albert Marth 1 1828–1897 A. Marth; disc: A. Marth — Axel Martin 3 1968–pres. A. Martin; amateur, (bio-it) A. Martin Pierre Martin (astronomer) 1964–pres. P. Martin; Rene Pierre Martin, CFHT/WIYN Src P. Martin Terry Martin (astronomer) n.a. T. Martin; Src T. Martin — Carlos T. Martinez 6 n.a. C. T. Martinez; Src C. T. Martinez; C. Martinez — Gábor Marton (astronomer) n.a. G. Marton; (IAU ) G. Marton — Gianluca Masi 30 1972–pres. G. Masi; discoverer of variable stars G. Masi Joseph Masiero 63 1982–pres. J. Masiero; J. Masiero Egisto Masotti 3 1947–pres. E. Masotti; amateur, (bio-it) E. Masotti Adam Massinger 7 1888–1914 A. Massinger; (bio-de) A. Massinger Giuseppe Massone n.a. G. Massone; inferred G. Massone — Mary Alice Mathison n.a. M. A. Mathison; inferred, (bio-it) M. A. Mathison — Stanislav Matičič 16 n.a. S. Matičič; inferred S. Maticic Damir Matković 2 n.a. D. Matković; (bio- it) D. Matkovic — Robert D. Matson 189 1962–pres. R. Matson; Robert Matson, Rob Matson, (bio-it) R. Matson Masanori Matsuyama 19 1950–pres. M. Matsuyama; amateur, , (bio-de) M. Matsuyama Daniel Matter 7 1957–pres. D. Matter; amateur, (bio-it) D. Matter Alain Maury 9 1958–pres. A. Maury; A. Maury Deronda Mayes 1957–pres. D. Mayes; inferred D. Mayes Emiliano Mazzoni 2 1953–pres. E. Mazzoni; amateur, (bio-it) E. Mazzoni Michele Mazzucato 6 1962–pres. M. Mazzucato; Michele T. Mazzucato, (bio-it) M. Mazzucato John V. McClusky 157 n.a. J. V. McClusky; J. V. McClusky — Billy D. McCormack n.a. B. D. McCormack; B. D. McCormack — Jennie McCormick n.a. J. McCormick; J. McCormick — Alric D. McDermott n.a. A. D. McDermott; A. D. McDermott — David McDonald (astronomer) 2 1964–pres. D. McDonald; Dave McDonald, amateur D. McDonald Stephen W. McDonald n.a. S. McDonald; S. McDonald — James E. McGaha 6 1946–pres. J. McGaha; amateur, (bio-it) J. McGaha P. McKenzie n.a. P. McKenzie; inferred P. McKenzie — David McLeish (astronomer) n.a. D. McLeish; (bio-it) D. McLeish — Robert H. McNaught 491 1956–pres. R. H. McNaught; R. H. McNaught Jeffrey S. Medkeff 10 1968–2008 J. Medkeff; J. Medkeff Karen Jean Meech 15 1959–pres. K. J. Meech; K. J. Meech Carol Neese 1958–pres. C. Neese; Carol Lynn Neese, MPC-typo: Meese C. Meese Denis Mégevand n.a. D. Megevand; Geneva Obs., HARPS, Src D. Megevand — Sven Melchert 2 1968–pres. S. Melchert; amateur, Guidestar , disc: and with Mark Emmerich S. Melchert — Philibert Jacques Melotte 1 1880–1961 P. Melotte; disc: P. Melotte — J. Dave Mendenhall n.a. J. D. Mendenhall; (bio-it) J. D. Mendenhall — Jean- Claude Merlin 75 1954–pres. J.-C. Merlin; (bio-fr) J.-C. Merlin Szabolcs Mészáros 5 1981–pres. S. Mészáros; (bio-it) S. Meszaros — Joel Hastings Metcalf 41 1866–1925 J. H. Metcalf; J. H. Metcalf , Natal'ja Vital'evna Metlova n.a. N. V. Metlova; (bio-it) N. V. Metlova — Michel Meunier 1964–pres. M. Meunier; amateur, (bio-it), C/1997 J2 (Meunier–Dupouy) M. Meunier Erich Meyer 22 1951–pres. E. Meyer; amateur E. Meyer Maik Meyer 16 1970–pres. M. Meyer; amateur, (bio-de), Src M. Meyer J. Michaud n.a. J. Michaud; inferred J. Michaud — Marco Micheli 23 1983–pres. M. Micheli; ESA/Pan-STARRS1 (news- it), (bio-it) M. Micheli René Michelsen 8 n.a. R. Michelsen; R. Michelsen Celina Mikolajczak 4 n.a. C. Mikolajczak; (bio-it) C. Mikolajczak — Blaž Mikuž 5 n.a. B. Mikuž; at Črni Vrh B. Mikuz — Herman Mikuž 32 n.a. H. Mikuž; at Črni Vrh, (bio-it) H. Mikuz — R. Miles n.a. R. Miles; inferred R. Miles Robert L. Millis 129 n.a. R. Millis; occultation, at Lowell Observatory, (bio-it), (bio- fr) R. Millis; R. L. Millis Elia Millosevich 2 1848–1919 E. Millosevich; E. Millosevich Matt Mills (astronomer) n.a. M. Mills; inferred M. Mills — Rudolph Minkowski 1895–1976 R. Minkowski; R. Minkowski Alberto Miranda 2 n.a. A. Miranda; co-disc #I. P. Griffin A. Miranda — Tetsuyasu Mitani 1 1927–2004 T. Mitani; disc: , (bio-it) T. Mitani Seidai Miyasaka 4 1955–pres. S. Miyasaka; S. Miyasaka Takashi Mizuno (astronomer) 1955–pres. T. Mizuno; amateur, (bio-it) T. Mizuno Yoshikane Mizuno 52 1954–pres. Y. Mizuno; at Kani Observatory Y. Mizuno Teo Močnik 1 1989–pres. T. Močnik; CV T. Mocnik Marko Moilanen n.a. M. Moilanen; (bio-it) M. Moilanen — Lawrence Alan Molnar 86 1959–pres. L. A. Molnar; (bio-it) L. A. Molnar Jean Montanne n.a. J. Montanne; (bio-it) J. Montanne — Nico Montigiani n.a. N. Montigiani; (bio-it) N. Montigiani — Didier Morata 1954–pres. D. Morata; amateur, (bio-it) D. Morata Stéphane Morata 1977–pres. S. Morata; amateur, (bio-it) S. Morata Zdeněk Moravec 94 1968–pres. Z. Moravec; Z. Moravec — Hiroshi Mori (astronomer) 45 1958–pres. H. Mori; amateur, (bio-it) H. Mori Paul Mortfield 1 n.a. P. Mortfield; P. Mortfield — Nicholas Moskovitz 1981–pres. N. Moskovitz; N. Moskovitz Patrick M. Motl 9 n.a. P. M. Motl; disc: , (bio-it) P. M. Motl — Stefano Mottola 21 n.a. S. Mottola; (bio-it) S. Mottola Antonín Mrkos 274 1918–1996 A. Mrkos; at Kleť Observatory A. Mrkos Jean Mueller 13 1950–pres. J. E. Mueller; at Second Palomar Sky Survey J. E. Mueller Masaru Mukai 13 1949–pres. M. Mukai; unrelated to M. Mukai — Gustavo Muler 25 1967–pres. G. Muler; G. Muler John-Derral Mulholland 1934–2008 J.-D. Mulholland; (bio- it) J. D. Mulholland — Ulisse Munari 49 1960–pres. U. Munari; at the Astronomical Observatories of Padua and Asiago U. Munari J. Muñoz n.a. J. Muñoz; inferred, (Manteca-it) J. Munoz — Osamu Muramatsu 73 1949–pres. O. Muramatsu; O. Muramatsu Juan Carlos Muzzio 2 1946–pres. J. C. Muzzio; at La Plata Institute of Astrophysics, (bio-it) J. C. Muzzio Atsushi Nakajima (astronomer) 15 n.a. A. Nakajima; disc: A. Nakajima — Akimasa Nakamura 112 1961–pres. A. Nakamura; at the Kuma Kogen Astronomical Observatory A. Nakamura Tsuko Nakamura 3 1943–pres. T. Nakamura; (bio-it) T. Nakamura Akio Nakanishi 3 1964–pres. A. Nakanishi; amateur A. Nakanishi Orlando A. Naranjo 38 1951–pres. O. A. Naranjo; (bio-it) O. A. Naranjo — Michael Nassir n.a. M. Nassir; M. Nassir — Akira Natori 32 1956–pres. A. Natori; at Nihondaira Observatory, (bio-it) A. Natori Edgar Rangel Netto 8 n.a. E. R. Netto; at Valongo Observatory, (bio-de) E. R. Netto Grigory Neujmin 74 1885–1946 G. N. Neujmin; G. N. Neujmin Vitali Nevski 15 1974–pres. V. Nevski; amateur, , image, Comet ISON, alt: Vitaliy Nevskiy and Vitaly Nevsky V. Nevski — Phil Nicholson 1951–pres. P. Nicholson; Philip D. Nicholson, Sycorax P. Nicholson Seth Barnes Nicholson 2 1891–1963 S. B. Nicholson; disc: and S. B. Nicholson Tsuneo Niijima 32 1955–pres. T. Niijima; amateur T. Niijima Kota Nishiyama 6 1965–pres. K. Nishiyama; Nishiyama Kota, Bisei Spaceguard Center K. Nishiyama V. L. Nixon n.a. V. L. Nixon; V. L. Nixon — Michael C. Nolan 1963–pres. M. C. Nolan; at Arecibo Observatory, (bio-it) M. C. Nolan Jaume Nomen 55 1960–pres. J. Nomen; at Observatorio Astronomico de Mallorca J. Nomen Toshiro Nomura 13 1954–pres. T. Nomura; T. Nomura Hans Ulrik Nørgaard-Nielsen 2 n.a. H. U. Nørgaard-Nielsen; disc: , (bio-it) H. U. Norgaard-Nielsen Artyom Novichonok 26 1988–pres. A. Novichonok; Comet ISON, Src A. Novichonok; A. O. Novichonok — Andrew J. Noymer 7 1971–pres. A. J. Noymer; (bio-it) A. J. Noymer Donal O'Ceallaigh 3 n.a. D. O'Ceallaigh; Src D. O'Ceallaigh — Erwin Obermair 7 1946–2017 E. Obermair; amateur E. Obermair Pieter van Oers n.a. P. v. Oers; P. v. Oers — Eran O. Ofek 1972–pres E. O. Ofek; HP E. O. Ofek Warren B. Offutt 18 1928–2017 W. Offutt; W. Offutt Youhei Ohba 3 n.a. Y. Ohba; at ISAS Y. Ohba — Okuro Oikawa 8 1896–1980 O. Oikawa; O. Oikawa Gregory Wayne Ojakangas 2 n.a. G. Ojakangas; disc: and , (bio-it) G. Ojakangas — Arto Oksanen n.a. A. Oksanen; amateur A. Oksanen — Shin-ichiro Okumura 3 n.a. S. Okumura; Bisei SG, IAU S. Okumura — Tomimaru Okuni 130 1931–pres. T. Okuni; amateur T. Okuni Heinrich Wilhelm Matthias Olbers 2 1758–1840 H. W. Olbers; H. W. Olbers R. M. Olivera 3 n.a. R. M. Olivera; amateur, also see R. M. Olivera — C. Michelle Olmstead 46 1969–pres. C. M. Olmstead; at Lowell Observatory C. M. Olmstead Andrey Oreshko 41 n.a. A. Oreshko; (also see Timur Kryachko and A. Oreshko — Csilla Orgel 2 n.a. C. Orgel; inferred C. Orgel — José Luis Ortiz Moreno 2 1967–pres. J. L. Ortiz; disc: , unofficial discoverer J. L. Ortiz Michel Ory 251 1966–pres. M. Ory; amateur M. Ory Yoshiaki Oshima 61 1952–pres. Y. Oshima; at Gekko Observatory Y. Oshima P. Ostafijchuk 2 n.a. P. Ostafijchuk; Andrushivka Observatory P. Ostafijchuk — Liisi Oterma 54 1915–2001 L. Oterma; at Turku Observatory L. Oterma Satoru Otomo 148 1957–pres. S. Otomo; amateur S. Otomo Rafael Pacheco 57 1954–pres. R. Pacheco; amateur R. Pacheco Deborah Lynne Padgett n.a. D. Padgett; inferred D. Padgett — András Pál (astronomer) 8 1981–pres. A. Pál; A. Pal Johann Palisa 122 1848–1925 J. Palisa; J. Palisa Ernesto Palomba 2 1967–pres. E. Palomba; disc: and E. Palomba Amanda Papadimos 4 n.a. A. Papadimos; inferred A. Papadimos — Sensi Pastor n.a. S. Pastor; La Murta Observatory S. Pastor — Praskov'ja Georgievna Parchomenko 2 1886–1970 P. Parchomenko; Praskoviya Georgievna Parchomenko, (bio-it) P. Parchomenko Yun-Ho Park 2 n.a. Y.-H. Park; (bio-it) Y.-H. Park Joel W. Parker 3 1962–pres. J. W. Parker; at Southwest Research Institute, inferred J. W. Parker Quentin A. Parker n.a. Q. A. Parker; Quentin Andrew Parker, Siding Spring, disc.: comet 119P/Parker–Hartley Src Q. A. Parker – Alois Paroubek n.a. A. Paroubek; (bio-it) A. Paroubek — André Patry 9 1902–1967 A. Patry; at Nice Observatory A. Patry Thierry Pauwels 152 1957–pres. T. Pauwels; at Uccle Observatory T. Pauwels Thomas Payer 4 1978–pres. T. Payer; amateur, T. Payer — Fernando Pedichini n.a. F. Pedichini; F. Pedichini — Jean-Claude Pelle 10 1942–pres. J.-C. Pelle; Jean Claude George Pelle, amateur, (bio-fr) J. C. Pelle Randy Pepper 2 n.a. R. Pepper; amateur, Fort Bend Astronomy Club, (bio- it) R. Pepper — Zenón M. Pereyra n.a. Z. Pereyra; disc: , (bio-it) Z. Pereyra — Davide Perna 1 n.a. D. Perna; D. Perna — Bernard Pernier n.a. B. Pernier; Geneva Obs. B. Pernier — Henri Joseph Anastase Perrotin 6 1845–1904 J. Perrotin; J. Perrotin Christian Heinrich Friedrich Peters 48 1813–1890 C. H. F. Peters; C. H. F. Peters George Henry Peters 3 1863–1947 G. H. Peters; USNO-astronomer,Src G. H. Peters — Jean-Marc Petit 7 1961–pres. J.-M. Petit; (bio-fr) J.-M. Petit; J. Petit Holly Phaneuf 2 n.a. H. Phaneuf; amateur, (bio-it) H. Phaneuf — Jeffrey L. Phinney 4 1957–pres. J. Phinney; disc: , , and J. Phinney Giuseppe Piazzi 1 1746–1826 G. Piazzi; disc: G. Piazzi Paolo Pietrapiana 2 n.a. P. Pietrapriana; amateur, disc: , (bio-it) P. Pietrapiana — Michael Pietschnig 3 n.a. M. Pietschnig; amateur, Src M. Pietschnig — Giuliano Pignata 4 n.a. G. Pignata; ADAS G. Pignata — Jana Pittichová 9 1972–pres. J. Pittichová; inferred J. Pittichova Guido Pizarro (astronomer) 8 n.a. G. Pizarro; brother of Oscar Pizarro, at La Silla, (bio- it) G. Pizarro Oscar Pizarro n.a. O. Pizarro; brother of Guido Pizarro, (bio- it) O. Pizarro Gianpaolo Pizzetti 4 1961–pres. G. P. Pizzetti; amateur, (bio- it) G. P. Pizzetti; G. Pizzetti John Platt (computer scientist) 2 1963–pres. J. Platt; J. Platt C. E. Plunkett n.a. C. E. Plunkett; inferred C. E. Plunkett — G. A. Plyugin 7 1925–pres. G. A. Plyugin; Gurij Antonovič Pljugin, (bio-it) G. A. Plyugin — Regina Podstanická 1928–2000 R. Podstanická; (bio-it) R. Podstanicka — N. R. Pogson 8 1829–1891 N. R. Pogson; Norman Robert Pogson N. R. Pogson Radosław Poleski n.a. R. Poleski; R. Poleski — David Polishook 16 1976–pres. D. Polishook; David L. Polishook, MIT and Tel Aviv University, (bio-it) D. Polishook Isidre Pòlit 1880–1958 I. Pòlit; Isidre Pòlit i Boixareu, (bio-it) I. Polit Christian Pollas 26 1947–pres. C. Pollas; at Côte d'Azur Observatory, (bio-fr) C. Pollas K. Polyakov n.a. K. Polyakov; co-disc. #V. Linkov K. Polyakov — Hejno Iogannović Potter 1 1929–2007 H. Potter; Kheino Potter, disc: , (bio-it) H. Potter Francisco Pozo 1986–pres. F. Pozo; Francisco Javier Pozo Núñez, (bio-es), F. Pozo — Valentino Pozzoli 4 n.a. V. Pozzoli; inferred V. Pozzoli — Alexander Pravda 52 1961–pres. A. Pravda; (bio-it) A. Pravda Petr Pravec 355 1967–pres. P. Pravec; P. Pravec Donald P. Pray 3 1949–pres. D. P. Pray; at Carbuncle Hill Obs.Src and Sugarloaf Obs. Src, (bio-it) D. P. Pray Gerrit Proffe 2 n.a. G. Proffe; DLR inferred G. Proffe — Enrico Prosperi 1954–pres. E. Prosperi; Castelmartini Obs. E. Prosperi S. Prosperi n.a. S. Prosperi; S. Prosperi – Milorad B. Protić 7 1911–2001 M. B. Protić; M. B. Protitch Timo Prusti 10 n.a. T. Prusti; ESA-Gaia, first disc: T. Prusti — Andrew W. Puckett 22 1977–pres. A. W. Puckett; Andrew Wayne Puckett A. W. Puckett Ulisse Quadri 1953–pres. U. Quadri; amateur, (bio-it) U. Quadri Herbert Raab 1969–pres. H. Raab; amateur, Src H. Raab David L. Rabinowitz 36 1960–pres. D. L. Rabinowitz; D. L. Rabinowitz; D. Rabinowitz Petar Radovan n.a. P. Radovan; (bio-it) P. Radovan — Rajgopalan Rajamohan 6 n.a. R. Rajamohan; (bio-it) R. Rajamohan — David Rankin (astronomer) 1 1984–pres. D. Rankin; amateur D. Rankin Vishnu Vardhan Reddy 23 1978–pres. V. Reddy; (bio-it) V. Reddy Karl Wilhelm Reinmuth 395 1892–1979 K. Reinmuth; K. Reinmuth Guy Reiss 5 1904–1964 G. Reiss; at Algiers Observatory and Nice G. Reiss José Antonio Reyes (astronomer) n.a. J. A. Reyes; La Murta Observatory J. A. Reyes — Tomáš Rezek (astronomer) n.a. T. Rezek; inferred T. Rezek — Joseph Rheden 3 1873–1946 J. Rheden; J. Rheden — Hans Rickman 2 1949–pres. H. Rickman; at Uppsala Observatory, (bio-it) H. Rickman Judit Györgyey Ries 3 n.a. J. G. Ries; Src J. G. Ries Wolfgang Ries 176 1968–pres. W. Ries; amateur W. Ries Jim Riffle 2 n.a. J. Riffle; inferred J. Riffle — Fernand Rigaux 8 1905–1962 F. Rigaux; at Uccle Observatory F. Rigaux Claudine Rinner 157 1965–pres. C. Rinner; amateur, at Ottmarsheim Observatory C. Rinner Keith Rivich 5 n.a. K. Rivich; amateur, (bio-it) K. Rivich — Irving Robbins (astronomer) n.a. I. Robbins; Src and Src I. Robbins Adrienne M. Robbins n.a. A. Robbins; Adrienne Makita Robbins, (bio-it) A. Robbins Larry Robinson (astronomer) 18 n.a. L. Robinson; amateur, at Sunflower Observatory, (bio-it) L. Robinson Heiner Roclawski 1963–pres. H. Roclawski; H. Roclawski — Greg Rodgers n.a. G. Rodgers; G. Rodgers — Tim A. Rodriquez n.a. T. Rodriquez; (bio-it) T. Rodriquez — Henry G. Roe 1975–pres. H. G. Roe; (bio-it) H. G. Roe James M. Roe 102 1943–pres. J. M. Roe; (bio-it) J. M. Roe — Elizabeth Roemer 2 1929–2016 E. Roemer; E. Roemer John E. Rogers 3 n.a. J. E. Rogers; (bio-it) J. E. Rogers Brian P. Roman 11 n.a. B. Roman; B. Roman E. S. Romas 3 n.a. E. S. Romas; first disc: ; at Kislovodsk Stn. (C20) E. S. Romas — Amy E. Rose 2 1987–pres. A. E. Rose; A. E. Rose Perry Rose (astronomer) 4 1966–pres. P. Rose; Perry J. Rose, at Palomar Planet Crossing Asteroid Survey P. Rose Emily Ross n.a. E. Ross; inferred; with Tara Houlden E. Ross — René Roy (astronomer) 9 1938–pres. R. Roy; amateur, (bio-fr) R. Roy Jiangao Ruan 2 1986–pres. J. Ruan; (阮建高), Ruan Jiangao; amateur, co-discovery with Gao Xing, supernovae, novae, C/2009 G1 (STEREO), 80+ SOHO comets J. Ruan Eric P. Rubenstein n.a. E. P. Rubenstein; E. P. Rubenstein — A. Rudd 2 n.a. A. Rudd; disc: and A. Rudd — Marian Rudnyk 3 n.a. M. Rudnyk; (bio-it) M. Rudnyk — Donald James Rudy n.a. D. Rudy; (bio-it) D. Rudy — Jose Maria Ruiz 9 n.a. J. M. Ruiz; inferred, disc: J. M. Ruiz — Vasilij Rumyantsev n.a. V. Rumyantsev; V. Rumyantsev — Kenneth S. Russell 2 n.a. K. S. Russell; (bio-it) K. S. Russell John Ruthroff n.a. J. Ruthroff; (bio-it) J. Ruthroff — Erin Lee Ryan 9 n.a. E. L. Ryan; IAU , (547073) and (548758) E. L. Ryan — William H. Ryan (astronomer) 28 1962–pres. W. H. Ryan; at MRO, (bio-it) W. H. Ryan;W. Ryan Eileen V. Ryan 1960–pres. E. V. Ryan; wife and collaborator of William Ryan at MRO; Src E. V. Ryan John Sachs (astronomer) 2 n.a. J. Sachs; amateur, disc and , Src, Src, unrelated to J. Sachs — Tsuyoshi Sakamoto 11 1975–pres. T. Sakamoto; Bisei Spaceguard Center, first disc: T. Sakamoto Giuseppe A. Sala 2 n.a. G. A. Sala; disc: and G. A. Sala — Paolo Sala (astronomer) 3 1954–pres. P. Sala; amateur, disc: , and , P. Sala — George C. Sallit n.a. G. Sallit; (bio-it) G. Sallit — Stephen L. Salyards n.a. S. L. Salyards; (bio-it) S. L. Salyards — A. G. Samuel n.a. A. G. Samuel; (bio-it) A. G. Samuel — Salvador Sánchez (astronomer) 3 n.a. S. Sánchez; unrelated to , (bio-it) S. Sanchez — Allan Sandage 1926–2010 A. R. Sandage; A. R. Sandage Hans-Ullrich Sandig 1909–1979 H.-U. Sandig; (bio-de) H.-U. Sandig — Robert G. Sandness 6 n.a. R. G. Sandness; amateur, (bio-it) R. G. Sandness — Luigi Sannino 2 1981–pres. L. Sannino; amateur, disc: and , (bio-it) L. Sannino Matteo M. M. Santangelo 21 n.a. M. M. M. Santangelo; Matteo Santangelo, (bio-it) M. M. M. Santangelo — Pablo Santos-Sanz 1 n.a. P. Santos-Sanz; P. Santos-Sanz — Krisztián Sárneczky 627 1974–pres. K. Sárneczky; K. Sarneczky Lenka Kotková 262 1973–pres. L. Kotková; Lenka Šarounová (née), at Ondřejov Observatory L. Sarounova Goro Sasaki n.a. G. Sasaki; unrelated to , (bio-it) G. Sasaki — Isao Satō (astronomer) 6 1963–pres. I. Satō; asteroid occultation, (bio-it) I. Sato Naoto Satō 142 1953–pres. N. Satō; amateur N. Sato Boris Satovski 42 n.a. B. Satovski; discovered , different from B. Satovski — Paul Sava n.a. P. Sava; at Needville P. Sava — Giulio Scarfì 1964–pres. G. Scarfì; amateur Src , observatories: (126) and (K78) G. Scarfi Robert D. Schaldach n.a. R. D. Schaldach; co-discovered 61P/Shajn–Schaldach; (bio-fr) R. D. Schaldach — Alexandre Schaumasse 2 1882–1958 A. Schaumasse; A. Schaumasse Giovanni Schiaparelli 1 1835–1910 G. Schiaparelli; disc: G. Schiaparelli Christine J. Schiff n.a. C. J. Schiff; amateur, wife of J. L. Schiff, (bio-it) C. J. Schiff — Joel L. Schiff n.a. J. L. Schiff; amateur, husband of C. J. Schiff, unrelated to , (bio-it) J. L. Schiff — Thomas Schildknecht 3 n.a. T. Schildknecht; (bio-it), Src T. Schildknecht — Frank Schiralli Jr. n.a. F. Schiralli Jr.; Src F. Schiralli Jr. — Lutz D. Schmadel 245 1942–2016 L. D. Schmadel; ARI-astronomer L. D. Schmadel; L.D. Schmadel Alfred Schmitt 4 1907–1973 A. Schmitt; at Algiers and Strasbourg observatories A. Schmitt Hans Scholl (astronomer) 56 1942–pres. H. Scholl; ARI-astronomer H. Scholl Richard Schorr 2 1867–1951 R. Schorr; R. Schorr Martin Schroedter n.a. M. Schroedter; VERITAS M. Schroedter — Joachim Schubart 2 1928–pres. J. Schubart; (bio-de), Src J. Schubart Lipót Schulhof 1 1847–1921 L. Schulhof; L. Schulhof Hans- Emil Schuster 25 1934–pres. H.-E. Schuster; at La Silla H.-E. Schuster Erwin Schwab 98 1964–pres. E. Schwab; amateur E. Schwab Megan Schwamb 16 1984–pres. M. E. Schwamb; (bio-fr) M. E. Schwamb; M. Schwamb Michael B. Schwartz 254 1950–pres. M. Schwartz; amateur, at Tenagra Observatory, (bio-it) M. Schwartz Friedrich Karl Arnold Schwassmann 22 1870–1964 A. Schwassmann; A. Schwassmann James V. Scotti 1 1960–pres. J. V. Scotti; at Spacewatch J. V. Scotti George Mary Searle 1 1839–1918 G. Searle; disc: G. Searle — William Lawrence Sebok 2 n.a. W. Sebok; disc: and , (bio-it) W. Sebok — Bruce A. Segal 2 1959–pres. B. A. Segal; amateur, disc: and , (bio-it) B. A. Segal Carlos Segarra n.a. C. Segarra; Algimia-Valencia C. Segarra — Sadao Sei n.a. S. Sei; at Chirorin Observatory S. Sei — Nalin Samarasinha 1958–pres. N. Samarasinha; N. Samarasinha Tsutomu Seki 225 1930–pres. T. Seki; T. Seki Alexey V. Sergeyev n.a. A. Sergeyev; inferred A. Sergeev — Carl Sexton 9 n.a. C. Sexton; inferred, amateur C. Sexton — Grigory Shajn 3 1892–1956 G. Shajn; G. Shajn Pelageya Shajn 19 1894–1956 P. F. Shajn; P. F. Shajn , R. Shank 3 n.a. R. Shank; assumed, also R. Shanks (!), co-discoveries with C. Veillet R. Shank; R. Shanks Scott S. Sheppard 27 1977–pres. S. S. Sheppard; S. S. Sheppard; S. Sheppard Edwin E. Sheridan 38 n.a. E. E. Sheridan; (bio-it) E. E. Sheridan; E. Sheridan; E. Sherdian — Jia You Shih 3 n.a. C.-Y. Shih; disc: , and C.-Y. Shih Yoshisada Shimizu 311 1943–pres. Y. Shimizu; amateur Y. Shimizu Hitoshi Shiozawa 29 n.a. H. Shiozawa; amateur, (bio-it) H. Shiozawa — Seiji Shirai (astronomer) 3 n.a. S. Shirai; , , S. Shirai Vladimir Shkodrov 7 1930–2010 V. G. Shkodrov; at the Bulgarian National Observatory V. G. Shkodrov; V. Shkodrov Carolyn S. Shoemaker 377 1929–2021 C. S. Shoemaker; C. S. Shoemaker Eugene M. Shoemaker 183 1928–1997 E. M. Shoemaker; E. M. Shoemaker Sergey E. Shurpakov 2 1966–pres. S. Shurpakov; Sergey Eduardovich Shurpakov, amateur S. Shurpakov Piero Sicoli 43 1954–pres. P. Sicoli; amateur, at Sormano Observatory P. Sicoli Stephen Singer-Brewster 6 1945–pres. S. Singer-Brewster; at Palomar Planet Crossing Asteroid Survey S. Singer-Brewster Amanjot Singh 1988–pres. A. Singh; A. Singh Russell Sipe 2 n.a. R. Sipe; inferred, disc: and R. Sipe — Brigitta Sipőcz 42 1984–pres. B. Sipőcz; (bio-de) B. Sipocz Michael L. Sitko n.a. M. L. Sitko; inferred M. L. Sitko — Brian A. Skiff 62 n.a. B. A. Skiff; at Lowell Observatory B. A. Skiff David R. Skillman 17 1945–pres. D. R. Skillman; D. R. Skillman; D. Skillman Jure Skvarč 20 1964–pres. J. Skvarč; (bio-it) J. Skvarc Evgenij Fëdorovič Skvorcov 3 1882–1952 E. Skvorcov; Evgenij Skvortsov, (bio-it) E. Skvortsov Sonia Keys 1961–2018 K. Smalley; Kyle Smalley, amateur, Powell Observatory K. Smalley Tamara Smirnova 135 1935–2001 T. M. Smirnova; T. M. Smirnova Suzanne Smrekar n.a. S. Smrekar; Suzanne Elizabeth Smrekar; (bio-it) S. Smrekar — Bogdan Sobczuk n.a. B. Sobczuk; Src B. Sobczuk — Adam Sodor 1 n.a. A. Sodor; A. Sodor — Andrea Soffiantini n.a. A. Soffiantini; Carezza, Trentino (NASA) A. Soffiantini — Patrick Sogorb 6 1971–pres. P. Sogorb; amateur, (bio-fr) P. Sogorb — Vladimir Jakovlevič Solov'ëv n.a. V. Y. Solovyov; (bio-it) V. Y. Solovyov Y. Sorimachi (astronomer) 2 n.a. Y. Sorimachi; disc: and Y. Sorimachi — Giovanni Sostero 1964–2012 G. Sostero; amateur G. Sostero Alfredo Sota 4 n.a. A. Sota; inferred, at Sierra Nevada Observatory A. Sota Guy Soulié 2 1920–pres. G. Soulié; amateur, (bio-fr) G. Soulie Timothy B. Spahr 59 1970–pres. T. B. Spahr; Timothy Bruce Spahr, at Bigelow Sky Survey T. B. Spahr Stefano Sposetti 166 1958–pres. S. Sposetti; amateur S. Sposetti; Stefano Sposetti Tom Stafford (astronomer) 40 n.a. T. Stafford; T. Stafford — Anton Staus 1 1872–1955 A. Staus; disc: A. Staus — Duncan Steel 12 1955–pres. D. I. Steel; D. I. Steel W. A. Stein n.a. W. A. Stein; inferred W. A. Stein Édouard Stephan 2 1837–1923 É. Stephan; disc: and E. Stephan Peter B. Stetson 1952–pres. P. B. Stetson; Peter Brailey Stetson, (bio-it) P. B. Stetson Berton L. Stevens 59 1951–pres. B. L. Stevens; amateur, Desert Moon Observatory , (bio-it) B. L. Stevens Janet A. Stevens 1950–pres. J. Stevens; amateur, née Madenberg, wife of B. L. Stevens (bio-it) J. Stevens Carlton F. Stewart n.a. C. F. Stewart; (bio-it) C. F. Stewart DeLisle Stewart 1 1870–1941 D. Stewart; disc: D. Stewart Lacey Stewart n.a. L. Stewart; Src L. Stewart Jürgen Stock (astronomer) 3 1923–pres. J. Stock; J. Stock M. Stockmaster n.a. M. Stockmaster; inferred M. Stockmaster — Reiner Michael Stoss 9 1975–pres. R. M. Stoss; amateur, at Starkenburg Observatory R. M. Stoss; R. Stoss Luca Strabla 1963–pres. L. Strabla; Luca Pietro Strabla, amateur, (bio-it) L. Strabla Louis-Gregory Strolger n.a. L.-G. Strolger; inferred L.-G. Strolger — Gyula Strommer 1920–1995 G. Strommer; (bio-it) G. Strommer Otto Struve 2 1897–1963 O. Struve; O. Struve Antonio Stucchi n.a. A. Stucchi; inferred A. Stucchi — Jeffrey Sue n.a. J. Sue; inferred, at RAS Observatory , Src J. Sue Uwe Süßenberger 4 n.a. U. Süßenberger; U. Suessenberger — Matsuo Sugano 4 1939–pres. M. Sugano; amateur M. Sugano Atsushi Sugie 122 n.a. A. Sugie; at Dynic Astronomical Observatory A. Sugie Rafael Suvanto 1909–1940 R. Suvanto; (bio-it) R. Suvanto Kenzo Suzuki (astronomer) 42 1950–pres. K. Suzuki; amateur K. Suzuki Shōhei Suzuki 52 n.a. S. Suzuki; S. Suzuki — Steven Roger Swanson 2 n.a. S. R. Swanson; inferred, disc: and S. R. Swanson Frédéric Sy 2 1861–19xx F. Sy; at Algiers and Paris observatories; disc: and F. Sy Gyula M. Szabó 9 1979–pres. G. Szabó; (bio-fr) G. Szabo Tamás Szalai (astronomer) 6 n.a. T. Szalai; inferred, disc: and T. Szalai Dorottya Szám n.a. D. Szám; amateur, (bio-it) D. Szam — Péter Székely (astronomer) 3 n.a. P. Székely; Piszkéstető Station P. Szekely — Attila Szing 6 n.a. A. Szing; inferred A. Szing — D. Taeymans n.a. D. Taeymans; inferred D. Taeymans — Laurence G. Taff 10 1947–pres. L. G. Taff; (bio-fr) L. G. Taff — Ugo Tagliaferri 2 n.a. U. Tagliaferri; amateur, disc: and , (bio-it) U. Tagliaferri — Atsushi Takahashi 22 1965–pres. A. Takahashi; amateur, at Kitami Observatory A. Takahashi Masanori Takeishi 13 1950–pres. M. Takeishi; amateur, (bio-de) M. Takeishi A. W. Taylor (astronomer) n.a. A. W. Taylor; , Cordell-Lorenz Obs. (see D. T. Durig) A. W. Taylor — D. Team (astronomer) 2 n.a. D. Team; , Kitt Peak D. Team — Noéline Teamo 240 n.a. N. Teamo; amateur, Hibiscus Observatory N. Teamo — Wilhelm Tempel 5 1821–1889 E. W. Tempel; E. W. Tempel Luciano Tesi 192 1931–pres. L. Tesi; amateur L. Tesi; L. esi Augusto Testa 31 1950–pres. A. Testa; amateur A. Testa Holger Thiele 4 1878–1946 H. Thiele; son of Thorvald N. Thiele H. Thiele Bernd Thinius 2 1959–pres. B. Thinius; amateur, disc: and , B. Thinius — David J. Tholen 68 1955–pres. D. J. Tholen; D. J. Tholen; D. C. Tholen Norman G. Thomas 55 1930–pres. N. G. Thomas; N. G. Thomas William Thuillot 1951–pres. W. Thuillot; inferred W. Thuillot Dan Tibbets 3 n.a. D. Tibbets; inferred, disc: and D. Tibbets — Jana Tichá 119 1965–pres. J. Tichá; J. Ticha Miloš Tichý 240 1966–pres. M. Tichý; M. Tichy Jürgen Tiedtke 1966–pres. J. Tiedtke; amateur, co-disc. with M. Klein, FB J. Tiedtke — Friedrich Tietjen 1 1832–1895 F. Tietjen; ARI-astronomer, disc: F. Tietjen Michael Todd (astronomer) 5 n.a. M. Todd; inferred M. Todd — Clyde Tombaugh 15 1906–1997 C. W. Tombaugh; C. W. Tombaugh Maura Tombelli 199 1952–pres. M. Tombelli; amateur M. Tombelli Kōichirō Tomita 9 1925–2006 K. Tomita; at the Tokyo Astronomical Observatory K. Tomita Mario Tonincelli 5 n.a. M. Tonincelli; inferred M. Tonincelli — John L. Tonry 2 1953–pres. J. L. Tonry; University of Hawaii, disc: and , (bio-de) J. L. Tonry Carlos Torres (astronomer) 37 1929–2011 C. Torres; Carlos Torres R. (not Carlos Guillermo Torres), Src C. Torres Y. Torres n.a. Y. Torres; inferred Y. Torres Juraj Tóth 16 1975–pres. J. Tóth; at Comenius University J. Toth Suzanne W. Tourtellotte 16 1945–2013 S. Tourtellotte; inferred S. Tourtellotte — Fabrizio Tozzi 153 1970–pres. F. Tozzi; amateur, (bio-it) F. Tozzi — Richard Trentman 3 1939–pres. R. Trentman; amateur, Powell Observatory Near-Earth-Object program; disc: and R. Trentman David E. Trilling 52 1972–pres. D. E. Trilling; disc: and D. E. Trilling Paul J. Tristram n.a. P. J. Tristram; MJUO, Src P. J. Tristram Chad Trujillo 65 1973–pres. C. Trujillo; C. A. Trujillo; C. Trujillo; C. W. Trujillo Yuan-Sheng Tsai (astronomer) 1 n.a. Y.-S. Tsai; inferred Y.-S. Tsai Akira Tsuchikawa 4 n.a. A. Tsuchikawa; (bio-it) A. Tsuchikawa — Roy A. Tucker 737 1951–pres. R. A. Tucker; R. A. Tucker; R. Tucker D. Tuma n.a. D. Tuma; inferred D. Tuma — Horace Parnell Tuttle 2 1837–1923 H. P. Tuttle; H. P. Tuttle Andrzej Udalski 2 1957–pres. A. Udalski; disc: and A. Udalski — Seiji Ueda 705 1952–pres. S. Ueda; amateur S. Ueda Seitaro Urakawa 4 1975–pres. S. Urakawa; at Bisei S. Urakawa Takeshi Urata 642 1947–2012 T. Urata; amateur T. Urata Fumiaki Uto 22 n.a. F. Uto; F. Uto; T. Uto — Ovidiu Vaduvescu 8 n.a. O. Vaduvescu; first: O. Vaduvescu — Antonio Vagnozzi 46 1950–pres. A. Vagnozzi; amateur A. Vagnozzi Marja Väisälä 2 1916–2011 M. Väisälä; Marja Ilmatar Väisälä, daughter of Y. Väisälä, disc: and , (bio-it) M. Vaisala — Yrjö Väisälä 128 1891–1971 Y. Väisälä; at Turku Observatory Y. Vaisala , Mallory Vale 3 1986–pres. M. Vale; M. Vale Jan Vales 5 n.a. J. Vales; at Črni Vrh, J. Vales — George Van Biesbroeck 16 1880–1974 G. Van Biesbroeck; G. Van Biesbroeck Hendrik van Gent 39 1899–1947 H. van Gent; H. van Gent Cornelis Johannes van Houten 4643 1920–2002 C. J. van Houten; C. J. van Houten Ingrid van Houten-Groeneveld 4644 1921–2015 I. van Houten-Groeneveld; I. van Houten-Groeneveld; I. Groeneveld Andre van Staden n.a. A. van Staden; inferred A. van Staden Andrew Vanden Heuvel 3 n.a. A. Vanden Heuvel; (bio-it) A. Vanden Heuvel — Luděk Vašta n.a. L. Vašta; inferred L. Vasta — Zdeňka Vávrová 115 1945–pres. Z. Vávrová; Z. Vavrova Christian Veillet 161 1954–pres. C. Veillet; C. Veillet Graziano Ventre 4 1954–pres. G. Ventre; amateur, (bio-it) G. Ventre Krisztián Vida 1983–pres. K. Vida; (IAU ), co-disc. #K. Sarneczky K. Vida — Antoni Vidal n.a. A. Vidal; amateur, (bio- it) A. Vidal — Ester Vigil n.a. E. Vigil; amateur, (bio-it) E. Vigil — Jozef Világi 12 n.a. J. Világi; inferred J. Vilagi — Walter Augustin Villiger 1872–1938 W. Villiger; W. Villiger George R. Viscome 33 1956–pres. G. R. Viscome; G. R. Viscome David Voglsam n.a. D. Voglsam; Src D. Voglsam — Heinrich Vogt (astronomer) 1 1890–1968 H. Vogt; disc: H. Vogt Luigi Volta 5 1876–1952 L. Volta; (bio-it) L. Volta Tomáš Vorobjov 15 1984–pres. T. Vorobjov; amateur T. Vorobjov Christel Vuissoz 5 n.a. C. Vuissoz; inferred, disc: C. Vuissoz — Libor Vyskočil n.a. L. Vyskočil; inferred L. Vyskocil — Arno Arthur Wachmann 3 1902–1990 A. Wachmann; A. Wachmann Sahil Wadhwa n.a. S. Wadhwa; S. Wadhwa — Joe Wagner (astronomer) 6 1964–pres. J. Wagner; (bio- it) J. Wagner — R. Mark Wagner 9 n.a. R. M. Wagner; IAU R. M. Wagner — Duncan Waldron 2 n.a. J. D. Waldron; amateur, disc: and , (bio-it) J. D. Waldron — Jasper V. Wall n.a. J. V. Wall; (bio-it) J. V. Wall — Åke Wallenquist 1904–1994 Å. A. E. Wallenquist; at Kvistaberg Station A. A. E. Wallenquist Brian D. Warner 3 1952–pres. B. D. Warner; photometrist, (bio-it), Src B. D. Warner Archibald Warnock 7 n.a. A. Warnock; (bio-it) A. Warnock — Lawrence H. Wasserman 295 n.a. L. H. Wasserman; occultation, (bio-it) L. H. Wasserman Kazuro Watanabe 671 1955–pres. K. Watanabe; amateur K. Watanabe James Craig Watson 22 1838–1880 J. C. Watson; J. C. Watson Martin Watt 4 n.a. M. Watt; (bio-it) M. Watt — J. Scott Weaver 2 1940–2008 J. S. Weaver; (bio-it) J. S. Weaver; S. Weaver Robert Weber (astronomer) 8 1926–2008 R. Weber; R. Weber Katrina Wefel 2 n.a. K. Wefel; at Baton Rouge, disc: and K. Wefel — Don J. Wells 21 1965–pres. D. Wells; amateur, (bio-it) D. Wells Lisa Wells (astronomer) 5 n.a. L. Wells; inferred; remote observer for CFHT; co-discoverer #M. Micheli: Src L. Wells — Jim Wentworth n.a. J. Wentworth; inferred J. Wentworth — Wolfgang Wenzel (astronomer) 1929–pres. W. Wenzel; (bio-de) W. Wenzel Richard Martin West 40 1941–pres. R. M. West; R. M. West Fred Lawrence Whipple 1906–2004 F. L. Whipple; F. L. Whipple Minor White (astronomer) 45 n.a. M. White; (bio-it) M. White — Robert J. Whiteley 12 1971–pres. R. J. Whiteley; (bio-it) R. J. Whiteley Paul Wiegert 85 1967–pres. P. A. Wiegert; P. A. Wiegert Patrick Wiggins (astronomer) 5 1949–pres. P. Wiggins; amateur, (bio-it) P. Wiggins Paul Wild (Swiss astronomer) 94 1925–2014 P. Wild; P. Wild Peter D. Wilder n.a. P. D. Wilder; (bio-it) P. D. Wilder — Iwan P. Williams 7 n.a. I. P. Williams; (bio-it) I. P. Williams James G. Williams n.a. J. G. Williams; Src J. G. Williams Kenneth A. Williams 14 1956–pres. K. A. Williams; Lake Clear N.Y.; astrophotographer K. A. Williams Ryan M. Williams n.a. R. M. Williams; (bio-it) R. M. Williams — John E. Willis n.a. J. Willis; USNO-astronomer, Src (bio-it) J. Willis — Albert George Wilson 5 1918–2012 A. G. Wilson; A. G. Wilson Carl A. Wirtanen 8 1910–1990 C. A. Wirtanen; C. A. Wirtanen Edith Wirtanen n.a. E. Wirtanen; Edith Rand Wirtanen, wife of Carl Wirtanen, (bio- it) E. Wirtanen Carl Gustav Witt 2 1866–1946 G. Witt; G. Witt David Wittman 3 n.a. D. Wittman; David M. Wittman D. Wittman — Christian Wolf (astronomer) n.a. C. Wolf; assumed C. Wolf — Marek Wolf 19 1957–pres. M. Wolf; M. Wolf — Max Wolf 248 1863–1932 M. F. Wolf; M. F. Wolf Chris Wolfe 29 n.a. C. Wolfe; (bio-it) C. Wolfe — Ulrich Wolff 2 1964–pres. U. Wolff; amateur, Berlin, Src U. Wolff — Harry Edwin Wood 12 1881–1946 H. E. Wood; H. E. Wood Gao Xing 8 1974–pres. X. Gao; first disc: , obscode:C42 X. Gao Naotaka Yamamoto n.a. N. Yamamoto; (bio-it) N. Yamamoto — Masayuki Yanai 27 1959–pres. M. Yanai; M. Yanai Yang Tingzhang 12 n.a. T.-C. Yang; (bio-it) T.-C. Yang — Ye Quan-Zhi 213 1988–pres. Q.-z. Ye; also: Quan-Zhi Ye, (bio-it), Src Q.-z. Ye; Q.-Z. Ye; Q. Ye B. Yeung 1 n.a. B. Yeung; B. Yeung — William Kwong Yu Yeung 2049 1960–pres. W. K. Y. Yeung; amateur, (bio-it) W. K. Y. Yeung; W. K. Yeung M. Yoshimi n.a. M. Yoshimi; M. Yoshimi James Whitney Young 267 1941–pres. J. W. Young J. W. Young; J. Young Jure Zakrajšek 7 n.a. J. Zakrajšek; Src J. Zakrajsek — O. Zamora n.a. O. Zamora; co-disc. #O. Vaduvescu O. Zamora — Fulvio Zanardini 2 n.a. F. Zanardini; disc: and , (bio-it) F. Zanardini — Luciano Zannoni n.a. L. Zannoni; L. Zannoni — Vincenzo Zappalà 9 1945–pres. V. Zappalà; at Pino Torinese Observatory V. Zappala Justas Zdanavičius 114 n.a. J. Zdanavičius; (bio-it) J. Zdanavicius — Kazimieras Zdanavičius 1938–pres. K. Zdanavičius; (bio-it) K. Zdanavicius Kenneth W. Zeigler 3 n.a. K. W. Zeigler; disc: , (bio-it) K. W. Zeigler — David S. Zelinsky n.a. D. Zelinsky; inferred D. Zelinsky O. Zeloyniy 2 n.a. O. Zeloyniy; inferred, first: O. Zeloyniy – Xu Zhijian 4 1989–pres. Z. Xu; amateur, , co-discoveries with Gao Xing, supernovae, novae, 300+ SOHO comets Z. Xu Lyudmila Zhuravleva 213 1946–pres. L. V. Zhuravleva; Lyudmila Vasil'evna Zhuravleva; ITA-astronomer L. V. Zhuravleva Massimo Ziboli 4 n.a. M. Ziboli; amateur, disc: , (bio-it) M. Ziboli — Pavel Zigo n.a. P. Zigo; inferred P. Zigo — Ute Zimmer 24 1964–pres. U. Zimmer; amateur, U. Zimmer — Michał Żołnowski 16 1975–pres. M. Żołnowski; amateur, Rantiga Osservatorio M. Zolnowski Frank B. Zoltowski 229 1957–pres. F. B. Zoltowski; amateur F. B. Zoltowski Giovanni Zonaro n.a. G. Zonaro; amateur, (bio-it) G. Zonaro — Cristina Zurita n.a. C. Zurita; inferred C. Zurita — Anna N. Żytkow 7 1947–pres. A. Żytkow; A. Zytkow — back to top == Discovering dedicated institutions == Institution Discoveries Country Link- label; info, links, and notes Name(s) at MPC Air Force Maui Optical and Supercomputing observatory 299 608, 605 AMOS; AMOS Altschwendt Observatory 11 A44 Altschwendt Obs.; cite: Altschwendt Ametlla de Mar Observatory 12 946 Ametlla de Mar Obs.; Ametlla de Mar Andrushivka Astronomical Observatory 124 A50 Andrushivka Obs.; Andrushivka Apache Point Observatory 9 645 Apache Point Obs.; Apache Point Asiago Observatory 8 098 Asiago Obs.; Cima Ekar Asiago-DLR Asteroid Survey 219 209 ADAS; Asiago-DLR Asteroid Survey; ADAS Astronomical Research Observatory 96 H55, H21 ARO; Astronomical Research Observatory moved from Charleston (H55) to Westfield (H21) in 2009. Src Astronomical Research Observatory; Charleston; Westfield Astrovirtel 5 I03 Astrovirtel; ASTROVIRTEL Sierra Remote Observatories 3 G53, G80 Sierra Remote Obs.; Auberry Stardome Observatory 1 466, 467 Stardome Obs.; Auckland Bisei Asteroid Tracking Telescope for Rapid Survey 441 300 BATTeRS; BATTeRS Badlands Observatory 7 918 Badlands Obs.; Badlands Jonathan B. Postel Observatory 9 201 Jonathan B. Postel Obs.; Bareggio Bassano Bresciano Observatory 3 565 Bassano Bresciano Obs.; aka Osservatorio Astronomico (di) Bassano Bresciano, private, it:wiki Bassano Bresciano Bastia Observatory 1 197 Bastia Obs.; Bastia Highland Road Park Observatory 1 747 Highland Road Park Obs.; Baton Rouge Bédoin Observatory 1 132 Bédoin Obs.; Observatoire de Bédoin Bedoin Begues Observatory 2 170 Begues Obs.; () Begues Bélesta Observatory 2 A05 Bélesta Obs.; at Bélesta-en- Lauragais, ADAGIO society Belesta Beijing Schmidt CCD Asteroid Program 1304 327 SCAP; Beijing Schmidt CCD Asteroid Program; NAOC Schmidt CCD Asteroid Program Bergen-Enkheim Observatory 1 A74 Bergen-Enkheim Obs.; Bergen-Enkheim Bergisch Gladbach Observatory 11 621 Bergisch Gladbach Obs.; Bergisch Gladbach Bohyunsan Optical Astronomy Observatory 31 344 Bohyunsan Obs.; Bohyunsan Boyden Observatory 4 074 Boyden Obs.; Boyden Observatory Bulgarian National Observatory 10 071 Bulgarian National Obs.; Bulgarian National Observatory Cala d'Hort Observatory C85 Cala d'Hort Obs.; (Observatorio Cala d'Hort) Observatiorio Cala d'Hort CBA-East Observatory 1 H86 CBA-East Obs.; CBA-East CERGA Observatory 24 010 CERGA; Centre de recherches en géodynamique et astrométrie CERGA Catalina Sky Survey 30578 703 CSS; CSS Calar Alto Observatory 8 493 Calar Alto Obs.; Calar Alto Calvin–Rehoboth Observatory 114 G98 Calvin–Rehoboth Obs.; in NM, cite: , disc: to Prairie School, all others to Calvin College Calvin College; Prairie School Campinas Observatory 1 870 Campinas Obs.; Observatório de Campinas Campinas Campo Catino Astronomical Observatory 5 468 Campo Catino Obs.; Osservatorio Astronomico Campo Catino Campo Catino Campo Catino Austral Observatory Survey 5 I10 CAOS; Campo Catino Austral Observatory Survey Campo Imperatore Near Earth Object Survey 1734 599 CINEOS; CINEOS; Campo Imperatore; Campo Imperatore Near Earth Object Survey Canada–France Ecliptic Plane Survey 2 568 CFEPS; Src, presumably conducted at CFHT, using generic Mauna Kea obs. code (568) Canada-France Ecliptic Plane Survey Catalina Station 1 693 Catalina Stn.; Catalina Station Cavezzo Observatory 7 107 Cavezzo Obs.; Cavezzo Cavriana Observatory 2 571 Cavriana Obs.; Osservatorio di Cavriana Cavriana Alianza S4 Observatory 126 I08 Alianza S4 Obs.; Cerro Burek Cerro El Roble Observatory 1 805 Cerro El Roble Stn.; Cerro El Roble Paranal Observatory 5 309 Paranal Obs.; Cerro Paranal Cerro Tololo Inter-American Observatory 249 807 Cerro Tololo Obs.; Cerro Tololo Cerro Tololo-LCO 1 W85, W86, W87 CTIO-LCO; Las Cumbres Observatory (LCO) node at CTIO Cerro Tololo-LCO B Chante-Perdrix Observatory 162 A77 Chante-Perdrix Obs.; Observatoire Chante-Perdrix Chante- Perdrix Cielo Profundo Observatory 1 J01 Cielo Profundo Obs.; Observatorio Cielo Colleverde di Guidonia Observatory 2 596 Colleverde Obs.; Osservatorio Colleverde di Guidonia Colleverde Copenhagen University Observatory 8 035 Copenhagen Obs.; Copenhagen Observatory Cordell–Lorenz Observatory 30 850 Cordell–Lorenz Obs.; Cordell-Lorenz Crimean Astrophysical Observatory 13 095 Crimean Astrophysical Obs.; Crimean Astrophysical Observatory Črni Vrh Observatory 427 106 Črni Vrh; Crni Vrh Dark Energy Camera 81 W84 CTIO-DECam; DECam Dark Energy Survey 6 W84 CTIO-DES; Dark Energy Survey Dax Observatory 8 958 Dax Obs.; Observatoire de Dax Dax Deep Ecliptic Survey 9 695 DES; Deep Ecliptic Survey Deep Lens Survey 80 807 DLS; Deep Lens Survey Drebach Observatory 16 113 Drebach Obs. Drebach; Volkssternwarte Drebach Doc Greiner Research Observatory 1 G48 Greiner Obs.; Doc Greiner Research Observatory European Near Earth Asteroids Research 12 809 EURONEAR; EURONEAR Desert Wanderer Observatory 2 G78 Desert Wanderer Obs.; El Centro Farpoint Observatory 137 734 Farpoint Obs.; cite: , NEKAAL, Kansas Farpoint; Eskridge Walter Hohmann Observatory 11 636 Walter Hohmann Obs.; Essen European Southern Observatory 2 809 ESO; European Southern Observatory Everstar Observatory 3 849 Everstar Obs.; Everstar Eygalayes Observatory 1 B44 Eygalayes Obs.; Eygalayes Farra d'Isonzo Observatory 225 595 Farra d'Isonzo; Farra d'Isonzo Faulkes Telescope Educational Project 3 608 Faulkes Project; Faulkes Telescope Educational Project Faulkes Telescope North 5 F65 Haleakala- Faulkes; Haleakala Félix Aguilar Observatory 63 808 Félix Aguilar Obs.; Felix Aguilar Observatory Fountain Hills Observatory 35 678 Fountain Hills Obs.; Fountain Hills Frasso Sabino Observatory 2 157 Frasso Sabino Obs.; Osservatorio di Frasso Sabino Frasso Sabino Goodricke-Pigott Observatory 75 683 Goodricke-Pigott Obs.; Goodricke-Pigott Great Shefford Observatory 10 J95 Great Shefford Obs.; Great Shefford Harvard College Observatory 55 800, 802 Harvard Obs.; Harvard Observatory Haute-Provence Observatory 5 511 Haute- Provence Obs.; Haute Provence; Institute d'Astrophysics Hawkeye Observatory 1 H52 Hawkeye Obs.; Hawkeye Herrenberg Observatory 1 240 Herrenberg Obs.; Herrenberg Hibiscus Observatory 3 F84 Hibiscus Obs.; Hibiscus Hormersdorf Observatory 6 A35 Hormersdorf Obs.; Hormersdorf Hunters Hill Observatory 1 E14 Hunters Hill Obs.; Hunters Hill IAA-AI Atacama 2 I16 IAA-AI; IAA-AI International Near-Earth Asteroid Survey 8 675 INAS; INAS Infrared Astronomical Satellite 4 500 IRAS; IRAS International Scientific Optical Network 10 H15 ISON; ISON ASC-Kislovodsk Observatory 11 D00 ASC-Kislovodsk; ASC-Kislovodsk; ISON-Kislovodsk Observatory Indiana Asteroid Program 119 760 Indiana University; Indiana University Ishigakijima Astronomical Observatory 2 D44 Ishigakijima Obs.; disc: and Ishigakijima JATE Asteroid Survey 461 JATE Asteroid Survey; JATE Asteroid Survey Japan Spaceguard Association 1 381 JSGA; Japan Spaceguard Association Jarnac Observatory 168 G92 Jarnac Obs.; Jarnac John J. McCarthy Observatory 1 932 John J. McCarthy Obs.; John J. McCarthy Jonathan B. Postel Observatory 1 201 Jonathan B. Postel Obs.; Jonathan B. Postel Junk Bond Observatory 53 701 Junk Bond Obs.; Junk Bond Jura Observatory 6 185 Jura Obs.; Vicques Kepler (spacecraft) 1 C55 Kepler; KEPLER Klet Observatory near Earth and other unusual objects observations team and telescope 36 246 KLENOT; KLENOT Kachina Observatory 5 G89 Kachina Obs.; Kachina Kambah Observatory 1 415 Kambah Obs.; Kambah Kiso Observatory 3 381 Kiso Obs.; Kiso Kitt Peak National Observatory 104 695 Kitt Peak Obs.; Kitt Peak Kleť Observatory 301 046 Kleť Obs.; Klet Kvistaberg Observatory 6 049 Kvistaberg Obs.; Kvistaberg Lincoln Near-Earth Asteroid Research 150558 704 LINEAR; LINEAR Lowell Observatory Near-Earth-Object Search 22852 688 LONEOS; LONEOS; Lowell Observatory Near-Earth Asteroid Survey Lulin Sky Survey 305 D35 LUSS; LUSS Roque de los Muchachos Observatory 39 950 La Palma Obs.; La Palma La Plata Observatory 5 839 La Plata Obs.; La Plata La Silla Observatory 27 I05 La Silla Obs.; La Silla Mount John University Observatory 5 474 Mount John Obs.; Lake Tekapo Las Campanas Observatory 1 304 Las Campanas Obs.; Las Campanas Les Engarouines Observatory 3 A14 Les Engarouines Obs.; Observatoire des Engarouines, Laurent Bernasconi, Les Engarouines Lick Observatory 4 662 Lick Obs.; Lick Observatory LightBuckets Observatory 4 B10, H11 LightBuckets Obs.; LightBuckets Lincoln Laboratory's Experimental Test Site 8 704 Lincoln Lab ETS; Lincoln Laboratory ETS; Socorro Davidschlag Observatory 5 540 Davidschlag Obs.; Linz Observatory Linz Loiano Observatory 1 598 Loiano Obs.; Osservatorio Astronomico di Loiano Loiano Los Molinos Observatory 2 844 Los Molinos Obs.; Los Molinos Lowell Observatory 3 690 Lowell Obs.; Lowell Observatory Lowell Discovery Telescope 1 G37 Lowell Discovery Tel.; Flagstaff Lulin Observatory 24 D35 Lulin Obs.; Lulin OGS Telescope 203 J04 ESA OGS; ESA OGS Lumezzane Observatory 1 130 Lumezzane Obs.; Osservatorio Astronomico Serafino Zani Lumezzane Madonna di Dossobuono Observatory 7 560 Madonna di Dossobuono Obs.; (Osservatorio Madonna di Dossobuono) Madonna di Dossobuono Majdanak Observatory 3 188 Majdanak Obs.; Majdanak Málaga Observatory 1 J40 Málaga Obs.; Malaga Consell Observatory 2 176 Consell Obs.; (Observatorio Astronómico de Consell) Consell Marxuquera Observatory 1 952 Marxuquera Obs.; Observatori Astronòmic Marxuquera Marxuquera MASTER-SAAO Telescope K95 MASTER; at South African Astronomical Observatory MASTER Mauna Kea Observatories 476 568 Mauna Kea Obs.; Mauna Kea iTelescope Observatory 43 H06, H10 iTelescope Obs.; Mayhill McDonald Observatory 2 711, V37 McDonald Obs.; McDonald Observatory Llano del Hato National Astronomical Observatory 1 303 Llano del Hato Obs.; Merida Mirasteilas Observatory 1 B67 Mirasteilas Obs.; Falera Modra Observatory 15 118 Modra Obs.; Modra Molėtai Astronomical Observatory 43 152 Molėtai Obs.; Moletai Monte Viseggi Observatory 4 126 Monte Viseggi Obs.; Osservatorio Monte Viseggi Monte Viseggi Moriyama Observatory 1 900 Moriyama Obs.; Moriyama Mount Lemmon Survey 89589 G96 Mount Lemmon Survey; Mt. Lemmon Survey; Mount Lemmon Survey Mount Lemmon Sky Center 1 G84 Mount Lemmon Sky Center; lowest Mount Lemmon SkyCenter; Mount Lemmon SkyCe Near-Earth Asteroid Tracking 44263 566, 644 NEAT; NEAT Nachi-Katsuura Observatory 1 905 Nachi- Katsuura Obs.; Nachi-Katsuura SFA Observatory 4 740 SFA Obs.; Nacogdoches Nakagawa Observatory 1 D74 Nakagawa Obs.; Nakagawa Nanchuan Observatory 1 D14 Nanchuan Obs.; Nanchuan George Observatory 220 735 Needville Obs.; Needville Network of European Observatories in the North 1 J50 NEON; La Palma Obs. La Palma-NEON New Horizons KBO Search 2 250, 266–269 New Horizons KBO Search; first discovery (516977); lowest numbered discovery (486958) New Horizons KBO Search; New Horizons Search Team John J. McCarthy Observatory 3 932 John J. McCarthy Obs.; New Milford Nyrölän observatorio 1 174 Nyrölä; Nyrola Mount Nyukasa Station 116 408 Mount Nyukasa Stn.; Nyukasa Astronomical Observatory of Mallorca 2869 620 Mallorca Obs.; OAM; OAM Observatory OCA-Anza Observatory 1 643 OCA-Anza; Orange County Astronomers - Anza OCA-Anza OCA-DLR Asteroid Survey 1089 910 ODAS; ODAS Oak Ridge Observatory 38 801 Oak Ridge Observatory; Oak Ridge Observatory Oakley Observatory 3 916, E09 Oakley Obs.; Oakley Observatory Naef Épendes 24 A13 Naef Obs.; Observatoire Naef Montcabre Observatory 1 213 Montcabre Obs.; Observatorio Montcabre Observatorio Montcabre Sunflower Observatory 10 739, 849 Olathe; Olathe Ondřejov Observatory 25 557 Ondřejov Obs.; (Observatoř Ondřejov), cite Ondrejov Nihondaira Observatory Oohira Station 6 385 Oohira Stn.; Oohira Cima Rest Observatory 1 B11 Cima Rest Obs.; Osservatorio Cima Rest Osservatorio Cima Rest Polino Observatory 2 609 Polino Obs.; Osservatorio Polino Osservatorio Polino San Vittore Observatory 99 552 San Vittore Obs.; Osservatorio San Vittore Osservatorio San Vittore Ottmarsheim Observatory 15 224 Ottmarsheim Obs.; Observatoire d'Ottmarsheim Ottmarsheim Outer Solar System Origins Survey 40 568 OSSOS; lowest numbered discovery: Outer Solar System Origins Survey Oukaïmeden Observatory 1 J43 Oukaïmeden Obs.; Oukaimeden Palomar Planet-Crossing Asteroid Survey 20 675 PCAS; PCAS PMO NEO Survey Program 761 330 PMO NEO; PMO NEO Survey Program; PMO Neo Survey Program Palomar Observatory 60 675 Palomar Obs.; Palomar Palomar Transient Factory 143 I41 PTF; Palomar Transient Factory Pan-STARRS 23414 F51 Pan-STARRS; Pan-STARRS 1; Pan-STARRS1 Pan-STARRS 2 52 F52 Pan-STARRS 2; first discovery Pan-STARRS 2 Beijing Astronomical Observatory 1 324, 327 Peking Obs.; Peking Observatory Perth Observatory 29 319, 322 Perth Obs.; Perth Observatory Pic du Midi Observatory 9 586 Pic du Midi Obs.; , cite: Pic du Midi Pises Observatory 44 122 Pises Obs.; Observatoire des Pises Pises Piszkéstető Station 5 461, 561 Piszkéstető Stn.; Piszkesteto Pla D'Arguines Observatory 43 941 Pla D'Arguines Obs.; Observatorio Astronomico Pla D'Arguines Pla D'Arguines Pleiade Observatory 1 H96 Pleiade Obs.; Pleiade Powell Observatory 22 649 Powell Obs.; Powell Prairie Grass Observatory 2 H59 Prairie Grass Obs.; Prairie Grass Puckett Observatory 1 752, 764 Puckett Obs.; Puckett Purple Mountain Observatory 150 330 Purple Mountain Obs.; Purple Mountain Observatory Q. s. observers 7 G96, 691, F51, D03 Q. s. observers; Q. s. observers; observers, q.-s.; observers, Q. s.; q.-s. observers Rantiga Observatory 1 D03 Rantiga Obs.; Rantiga Osservatorio, Carpineti Tincana Reedy Creek Observatory 1 428 Reedy Creek Obs.; Reedy Creek Remanzacco Observatory 9 473 Remanzacco Obs.; Remanzacco Royal Observatory Edinburgh 7 277 Edinburgh Obs.; Royal Observatory Edinburgh Santa Lucia Stroncone Astronomical Observatory 55 589 Santa Lucia Obs.; Stroncone Santa Maria de Montmagastrell Observatory 3 B74 Montmagastrell Obs.; Observatory Santa Maria de Montmagastrell SM Montmagastrell Saint-Sulpice Observatory 19 947 Saint- Sulpice Obs.; Saint-Sulpice Saji Observatory 22 867 Saji Obs.; Saji Pistoia Mountains Astronomical Observatory 36 104 Pistoia Mountains Obs.; Italian: Osservatorio Astronomico della Montagna Pistoiese San Marcello National Astronomical Observatory (Mexico) 1 679 OAN Mexico; San Pedro Martir Sandlot Observatory 6 H36 Sandlot Obs.; Sandlot Schiaparelli Observatory 7 204 Schiaparelli Obs.; Schiaparelli SDSS Collaboration 706 645 (705) SDSS Collaboration; , , HP SDSS Collaboration; S. Collaboration Shandong University Observatory 16 D39 Shandong University Obs.; Shandong University Shishikui Observatory 1 342 Shishikui; Shishikui Siding Spring Observatory 4 413 Siding Spring Obs.; Siding Spring Siding Spring Survey 3505 E12 SSS; Siding Spring Survey Sierra Nevada Observatory 5 J86 Sierra Nevada Obs.; Sierra Nevada Sierra Stars Observatory 8 G68 Sierra Stars Obs.; Sierra Stars Silver Spring Observatory 2 H85 Silver Spring Obs.; Silver Spring Simeiz Observatory 1 094 Simeiz Obs.; Simeis Skylive Observatory 1 B40 Skylive Obs.; Skylive Sloan Digital Sky Survey 1874 645 SDSS; Sloan Digital Sky Survey; Sloan Digital Sky Survey Linked Object Catalog team SONEAR Observatory 3 Y00 SONEAR Obs.; SONEAR Sormano Astronomical Observatory 1 587 Sormano Obs.; Sormano Spacewatch 176020 691 Spacewatch; Spacewatch Space Surveillance Telescope 10 G45 Space Surveillance Telescope; lowest numbered discovery : Space Surveillance Telescope Observatory of Saint-Veran 45 615 Saint-Véran Obs.; St. Veran Saint Pardon de Conques Observatory I93 St Pardon de Conques Obs.; St Pardon de Conques Starkenburg Observatory 53 611 Starkenburg Obs.; Starkenburg; Heppenheim Steward Observatory 1 692 Steward Obs.; if code 691, its Kitt-Peak Spacewatch Steward Stony Ridge Observatory 2 671 Stony Ridge Obs.; Stony Ridge Sub-Kilometer Asteroid Diameter Survey 21 695 SKADS; HP SKADS Suno Observatory 4 147 Suno Obs.; Osservatorio Astronomico di Suno Suno; Osservatorio Astronomico di Suno Sutherland-LCO 1 K91, K92, K93 SAAO-LCO; Las Cumbres Observatory at South African Astronomical Observatory Sutherland-LCO C Table Mountain Observatory 2 673, 673 Table Mountain Obs.; Wrightwood Taunus Observatory 3 B01 Taunus Obs.; Taunus Teide Observatory 6 954 Teide Obs.; Teide Tenagra Observatory 6 848 Tenagra Obs.; Tenagra; Cottage Grove Tenagra II Observatory 117 926 Tenagra II Obs.; Tenagra II Oakley Observatory 1 H22 Oakley Obs.; Terre Haute Terskol Observatory 3 B18 Terskol Obs.; Terskol Three Buttes Observatory 2 G90 Three Buttes Obs.; Three Buttes Tiki Observatory 2 F85 Tiki Obs.; Puna'auia Tiki Cégep de Trois-Rivières Observatory 1 924 Cégep de Trois-Rivières Obs.; Observatoire du Cégep de Trois-Rivières Trois-Rivieres Turtle Star Observatory 2 628 Turtle Star Obs.; cite: , disc: , Turtle Star; Mulheim-Ruhr Tzec Maun Observatory 18 D25, H10 Tzec Maun Obs.; Tzec Maun Uppsala–ESO Survey of Asteroids and Comets 1123 809 UESAC; UESAC; UESAC, Comets Royal Observatory of Belgium 13 012 Uccle Obs.; Uccle Uenohara Observatory 2 376 Uenohara Obs.; Uenohara National Astronomical Observatory (Chile) 3 805 University of Chile; University of Chile Uppsala–DLR Asteroid Survey 262 049 UDAS; Uppsala-DLR Asteroid Survey Uppsala–DLR Trojan Survey 62 809 UDTS; Uppsala-DLR Trojan Survey Valinhos Observatory 2 860 Valinhos Obs.; Valinhos Vallemare di Borbona Observatory 2 A55 Vallemare di Borbona Obs.; Osservatorio Astronomico Vallemare di Borbona Vallemare Borbona Valmeca Observatory 6 184 Valmeca Obs.; Valmeca Vatican Advanced Technology Telescope 7 290, G83 VATT; code 290, prolematic Mt. Gramham also for LBT (G83) Mount Graham Village-Neuf Observatory 2 138 Village-Neuf Obs.; Village-Neuf Višnjan Observatory 108 120 Višnjan Obs.; Visnjan Wide-field Infrared Survey Explorer 4639 C51 WISE; WISE Wildberg Observatory 1 198 Wildberg Obs.; Wildberg Wise Observatory 19 097 Wise Obs.; Wise Xinglong Station (NAOC) 5 327 Xinglong Stn.; Xinglong; Peking Yamagata Astronomical Observatory 2 D89 Yamagata Obs.; Yamagata Zelenchukskaya Station 8 114 Zelenchukskaya Stn.; Zelenchukskaya Stn Zvezdno Obshtestvo Observatory 2 A79 Zvezdno Obshtestvo Obs.; Zvezdno Obshtestvo Zwicky Transient Facility 1 I41 ZTF; Zwicky Transient Facility 7300 Observatory 4 H07 7300 Obs.; 7300 back to top == References == == Other websites == * Data Available from the Minor Planet Center, (File: \"NumberedMPs.txt\", 53 MB) * Discovery Circumstances: Numbered Minor Planets, Minor Planet Center Category:Lists of minor planets",
 "title": "List of minor planet discoverers"
}