{
 "id": "916805",
 "text": "Carlos Rivera Guerra, better known as Carlos Rivera (born March 15, 1986), is a Mexican singer. Rivera has released four studio albums and participated in six theatre productions. == Career == In 2005, he signed with Sony Music and began working on a self-titled album. That year he recorded \"Y Si tu Supieras\" for the feature film Mar de Sueños. The song was nominated for Best Original Song at the 2006 Diosas de Plata, an annual Mexican award ceremony hosted by the Mexican Film Journalism Association. While working on the album, Rivera worked in theater. In 2006, he starred in the musical Besame Mucho, and the following year performed in Orgasmos La Comedia. By 2008, at 22 years old, Rivera had become the world's youngest actor to play the male lead in Beauty and the Beast, the first major Broadway-like production produced by Disney in Mexico. Rivera starred in his fourth theater production, Mamma Mia! in 2009. The project garnered him a nomination in the Best Co-Actor of the Year category by the Association of Journalists Theater. His second studio album, Mexicano, was recorded in 2010 and like its predecessor, which includes hits like \"Te me vas\" and \"No soy el aire,\" it was certified gold. The project was produced by Kiko Campos. == Filmography == Year Title Role Notes 2010 Héroes verdaderos Carlos Navarro Voice role 2016 El hotel de los secretos Andrés Salinas 80 episodes 2019 El Rey León Simba adulto Voice/Singing Role 2020 Yo vivo: Documental El mismo Protagonista 2020 A Celebration of the Music of Coco Himself Recording of live concert at the Hollywood Bowl == Awards == ; Premios TVyNovelas Year Category Nominated works Result 2017 Best Co-lead Actor El hotel de los secretos 2017 Best Male Revelation El hotel de los secretos == Discography == === Studio albums === * 2007: Carlos Rivera * 2010: Mexicano * 2013: El Hubiera No Existe * 2016: Yo Creo * 2018: Guerra * 2020: Si Fuera Mia EP * 2021: Crónicas de una Guerra * 2021: Leyendas Vol. 1 ==Theatre== * 2006: Bésame Mucho * 2007: Orgasmos La Comedia * 2008: La Bella y la Bestia * 2009: Mamma Mia! * 2011: El Rey León (Spain) * 2015: El Rey León (México) == References == == Sources == * Profile at the La Academia site * CarlosRivera.com.mx Official Site * CarlosRivera.com.mx/foro Official Forum == Other websites == * Category:1986 births Category:Living people Category:Mexican singers Category:Tenors Rivera Guerra Category:Mexican television actors",
 "title": "Carlos Rivera"
}