{
 "id": "917184",
 "text": "Cannibal! The Musical is a 1993 American independent musical black comedy movie directed, written, produced, co-scored by and starring Trey Parker in his directorial debut while studying at the University of Colorado Boulder, before reaching fame with South Park alongside his friend Matt Stone who also stars in and produces the movie. It is loosely based on the true story of Alferd Packer and the sordid details of the trip from Utah to Colorado that left his five fellow travelers dead and partially eaten. Parker stars as Alferd Packer, with frequent collaborators Stone, Dian Bachar and others playing the supporting roles. ==Cast== * Trey Parker as Alferd Packer (credited as \"Juan Schwartz\") * Toddy Walters as Polly Pry ** Moira Kelly was to be cast as the above role, but it was decided not to use her as it might damage serious Hollywood aspirations. Various screenings credit \"M.K.\" as \"The Dropout\". * Matt Stone as James Humphrey and the \"Hang the Bastard\" woman * Dian Bachar as George \"California\" Noon * David Schwimmer as Frank Miller * Hank Azaria as Israel Swan * Abraham Benrubi as Shannon Wilson Bell ==Production== The film was originally titled Alferd Packer: The Musical in 1993. The movie premiered on October 31, 1993 in Boulder, Colorado, at a cinema near the University of Colorado campus. A fake protest organized by friend of Parker and Stone, organized along the lines of an animal rights demonstration, took place in front of the theater. The film then played at the Raindance Film Festival in October 2004. Parker and Stone attended. ==Reception== Cannibal! currently holds a 63% \"Fresh\" approval rating on Rotten Tomatoes based on 19 reviews, with a weighted average of 5.2/10. The site's critical consensus says: \"If you're only going to watch one black comedy about a real-life explorer whose fellow travelers ended up eaten, make it Cannibal! The Musical.\" Category:1990s American musical movies Category:1990s comedy movies Category:American black comedy movies",
 "title": "Cannibal! The Musical"
}