{
 "id": "917173",
 "text": "Ljupčo Kocarev (Skopje, February 25, 1955), is a scientist, academician and professor of physics. == Education == He completed his primary, secondary and higher education (Faculty of Electrical Engineering) in his hometown Skopje, North Macedonia. He holds doctorate from the Institute of Physics of the Faculty of Science in Skopje. ==Career== From 1999 to 2016 he worked at the University of California, San Diego in USA. He was educated in the United States, Germany, Italy, Hungary, Spain and Japan. In 2006, he was elected as a member of the IEEE. He became an associate member of the Macedonian Academy of Sciences and Arts on May 27, 2003, and a full member on May 1, 2007. As of January 1, 2020. Currently, he is the President of the Macedonian Academy of Sciences and Arts. See Macedonian Academy official page . == Works == Works of Ljupčo Kocarev includes several fields in physics and technical sciences. This includes nonlinear physics, complex systemsKocarev, L. (2005). Complex dynamics in communication networks. Springer Science & Business Media.Kocarev, L. (Ed.). (2013). Consensus and synchronization in complex networks. Springer.Kocarev, L., Galias, Z., & Lian, S. (Eds.). (2009). Intelligent computing based on chaos (Vol. 184). Springer. and networks (electrical circuits and systems) to information theory, cryptography,Kocarev, L. (2001). Chaos-based cryptography: a brief overview. IEEE Circuits and Systems Magazine, 1(3), 6-21. machine learningTang, Y., Kurths, J., Lin, W., Ott, E., & Kocarev, L. (2020). Introduction to Focus Issue: When machine learning meets complex systems: Networks, chaos, and nonlinear dynamics. Chaos: An Interdisciplinary Journal of Nonlinear Science, 30(6), 063151. and data processing. Since 1986, he has published more than 140 publications in international journals and more than 150 publications in proceedings of peer- reviewed papers from international conferences. He is one of the most cited scientists in Macedonia.Google Scholar == Rewards == He is the winner of the National Macedonian award for life's work \"October of 11th\".See in Macedonian duratsoski-i-lupcho-kotsarev/ == References == Category:1955 births Category:Living people Category:Physicists Category:People from Skopje",
 "title": "Ljupčo Kocarev"
}