{
 "id": "917215",
 "text": "Aai Kuthe Kay Karte is an Indian television drama fiction series. ==Cast== ===Main=== * Madhurani Gokhale Prabhulkar as Arundhati \"Aru\" Joglekar(formerly Deshmukh) – Vidya's daughter; Sudhir's sister; Aniruddh's former wife; Abhishek, Yash and Isha's mother. (2019–present) * Omkar Govardhan as Ashutosh Kelkar – Sulekha's son; Arundhati's college friend. (2021–present) * Milind Gawali as Aniruddh Deshmukh – Vinayak and Kanchan's elder son; Vishaka and Avinash's brother; Arundhati's former husband; Sanjana's husband; Abhishek, Yash and Isha's father. (2019–present) * Deepali Pansare / Rupali Bhosale as Sanjana Deshmukh (formerly Dixit) – Rajni's sister; Shekar's former wife; Aniruddh's wife; Nikhil's mother; Gauri's aunt. (2019-2020) / (2020–present) === Recurring === * Abhishek Deshmukh as Yash Deshmukh – Arundhati and Aniruddh's younger son; Abhishek and Isha's brother; Gauri's fiancé. (2019–present) * Gauri Kulkarni as Gauri Karkhanis – Rajni's daughter; Sanjana's niece; Yash's fiancé. (2020–present) * Ashwini Mahangade as Anagha Deshmukh – Abhishek's wife. (2020–present) * Niranjan Kulkarni as Dr. Abhishek \"Abhi\" Deshmukh – Arundhati and Aniruddh's elder son; Yash and Isha's brother; Ankita's former husband; Anagha's husband. (2019–present) * Apurva Gore as Isha Deshmukh – Arundhati and Aniruddh's daughter; Abhishek and Yash's sister. (2019–present) * Kishore Mahabole as Vinayak Deshmukh – Kanchan's husband; Aniruddh, Vishaka and Avinash's father; Abhishek, Yash and Isha's grandfather. (2019–present) * Archana Patkar as Kanchan Deshmukh – Tatya and Sulu's sister; Vinayak's wife; Aniruddh, Vishaka and Avinash's mother; Abhishek, Yash and Isha's grandmother. (2019–present) * Poonam Chandokar as Vishakha Deshmukh – Vinayak and Kanchan's daughter; Aniruddh and Avinash's sister; Kedar's wife. (2020–present) * Ashish Kulkarni as Kedar – Vishaka's husband. (2020–present) * Shantanu Moghe as Avinash Deshmukh – Vinayak and Kanchan's younger son; Vishakha and Aniruddh's brother; Nilima's husband. (2021–present) * Sheetal Kshirsagar as Nilima Deshmukh – Avinash's wife. (2020–2021) ===Others=== * Ila Bhate as Sulekha Kelkar – Ashutosh's mother. (2021–present) * Raseekraj as Nitin Shah – Arundhati and Ashutosh's business partner. (2021–present) * Seema Ghogale as Vimal – Deshmukh's domestic help. (2019–present) * Radha Kulkarni as Ankita Kulkarni – Revati and Pramod's daughter; Abhishek's former wife. (2019–present) * Advait Kadane as Sahil Salvi – Isha's love interest. (2021–present) * Medha Jambotkar as Vidya Joglekar – Arundhati and Sudhir's mother; Abhishek, Yash and Isha's grandmother. (2019–present) * Kedar Shirsekar as Sudhir Joglekar – Vidya's son; Arundhati's brother. (2020–present) * Mayur Khandage as Shekhar Dixit – Sanjana's former husband; Nikhil's father; Gauri's uncle. (2020–present) * Unknown as Nikhil Shekhar Dixit – Sanjana and Shekhar's son, Gauri's cousin. (2020–present) * Sushma Murudekar as Rajni Karkhanis – Sanjana's sister; Gauri's mother. (2020–present) * Pooja Pawar Salunkhe / Reshma Polekar as Revati Pramod Kulkarni – Pramod's wife; Ankita's mother. (2019–2020) * Sanjay Shemkalyani as Pramod Kulkarni – Revati's husband; Ankita's father. (2019–2020) * Radhika Deshpande as Devika – Arundhati's best friend. (2020–present) * Vasanti Deshpande as Sulu – Kanchan and Tatya's sister. (2019–2020) * Jayant Savarkar as Tatya – Kanchan and Sulu's brother. (2020-2023) * Mugdha Godbole Ranade as Dr. Vasudha Sardesai – Arundhati's gynecologist; Abhi's senior doctor. (2020–present) === Cameo appearance=== * Nilesh Moharir as himself. He recorded Arundhati's first commercial song produced by Ashutosh. (2022) Category:2019 Indian television series debuts",
 "title": "Aai Kuthe Kay Karte"
}