{
 "id": "917274",
 "text": "F3: Fun and Frustration is a 2022 Indian Telugu-language romantic comedy movie. ==Production== It is written and directed by Anil Ravipudi. It is a standalone sequel to the 2019 movie F2: Fun and Frustration, the second movie in the Fun and Frustration series, and it is produced by Sri Venkateswara Creations. It stars Venkatesh, Varun Tej, Tamannaah, and Mehreen Pirzada, who reprise their roles from the previous movie. It features music composed by Devi Sri Prasad. Dil Raju announced F2's sequel F3 following its success in February 2019. Principal photography of the movie began in December 2020 and completed in January 2021. The movie was shot in Hyderabad. The production and release of F3 were delayed multiple times by the COVID-19 pandemic. The movie was finally theatrically released on 27 May 2022. A sequel titled F4 is also in development and is expected to be released in 2023 or 2024. ==Plot== Venky, who works as an agent at a Regional Transport Office in Hyderabad, struggles to meet his ends. His friend Varun Yadav, an orphan, schemes various plans to make money. Venky has night blindness and Varun stutters, however, Venky hides his disability from everyone. Venky, along with his friend, loses a lot of their money after investing in Harika's family restaurant. In a search for money, Varun mistakes Honey (Harika's sister) for a rich woman and plans to marry her. Venky agrees to fund Varun's plan, failing to recognize Honey due to his night blindness. Venky and Varun take a huge amount of loan from Pala Baby by pledging their property. After spending lakhs of rupees by giving expensive gifts and cash to Honey, they realize their mistake while Harika's family lose all their money in shares. Pala Baby, who worships women, drops his plans to waive off the loan after realizing the guile methods of Harika's family. They all reach the police station to settle their issue. However, CI Nagaraju, an honest policeman who is on the brink of losing his job, hatches a plan to raid his commissioner's house with them to steal the illegally acquired cash and diamonds. They successfully execute their plan and hide the valuables in the boot of a scrap car. While doing so, they also rescue a kidnapped girl. The following morning, they confess their robbery to the commissioner out of fear. However, the car goes missing and the commissioner threatens their life if they fail to return the stolen amount. When Venky, Varun, Harika and Nagaraju are about to commit suicide, they receive news that billionaire Anand Sharma was looking for his prodigal son. They all reach his place in Vizianagaram. Venky, Varun, Harika (in a male disguise), and a junior artist hired by Nagaraju present themselves as Anand's son. Unsure of who the right person is, Anand lets everyone stay in his palace. They scheme against each other and utterly fail to impress Anand. All the contenders endure the toughest of the tests given by Anand. As a final effort, Anand announces that whoever brings his F3 toy factory to profits shall be declared as his heir. Putting their differences aside, all the contenders team up together to create a new kind of toy in order to achieve profit. They develop a set of interactive toys by merchandising popular Telugu film characters, namely, Baahubali, Gabbar Singh, Ajay Krishna, Veera Raghava, Chitti Babu and Pushpa. The sales skyrocket and the factory earns a bumper profit. They together elect Varun and present him to Anand as his rightful heir. Anand, however, reveals that his son died by suicide several years ago after earning money by fraudulent means. Since they have rescued his granddaughter, Anand gave them an opportunity to prove themselves and offers them the profit they earned. Venky, Varun and others realize their mistakes and give up the money. Later, Anand is kidnapped by his subordidates who demand a ransom of crore. Venky, Varun and others arrive at the place but they are attacked by the goons. Initially, they try to confuse them but when the plan fails, Venky dresses up as Narappa while Varun as Vakeel Saab and thrash the goons together. When they are trying to leave, the police arrive and arrest everyone. Meanwhile, the thief who stole the car reveals to the commissioner that he sold all the diamonds at a cheap rate mistaking them as regular gemstones. He later gets elected as an MLA with the support of his buyers, and the commissioner who is ousted out of his job joins him as an assistant. == Cast == * Venkatesh as Venky * Varun Tej as Varun Yadav * Tamannaah as Harika * Mehreen Pirzada as Honey * Rajendra Prasad as C.I. Nagaraju * Murali Sharma as Anand Prasad * Sunil as Katthi Seenu * Sonal Chauhan as American girl * Ali as Pala Baby * Sampath Raj as Commissioner Dileep Chandra * Tulasi as Venky's step mother * Goparaju Ramana as Venky's father * Sathvik Varma as Venky's step brother * Satya as the thief * Pragathi as Padma, mother of Harika and Honey * Pradeep Kondiparthi as father of Harika and Honey * Y. Vijaya as the maternal grandmother of Harika and Honey * Annapoorna as the paternal grandmother of Harika and Honey * Vennela Kishore as Junior Artist, Gudivada Gurunatham's son * Raghu Babu as Venky's companion * Srikanth Iyengar as Sharma, Anand Prasad's assistant * Prudhvi Raj as Palace Incharge * Tanikella Bharani as Police officer * Gundu Sudarshan as Land owner * Rajitha as Land Owner's wife * Vasu Inturi as Honey's driver * Rajendran as Gudivada Gurunatham * Srinivasa Reddy as goon's henchmen * Divya Sripada as Vishal Mitthal's daughter * Getup Srinu as Bull Chittibabu's breeder * Duvvasi Mohan as Bull Chittibabu's breeder * Pooja Hegde as herself (cameo appearance in the song \"Life Ante Itta Vundaala\") * Anil Ravipudi as himself (cameo appearance) ==References== Category:2020s Indian movies Category:Telugu-language movies Category:2022 movies",
 "title": "F3 (movie)"
}