{
 "id": "917319",
 "text": "Walter Burley Griffin (November 24, 1876February 11, 1937) was an American architect and landscape architect. He designed Canberra, Australia. He also designed the New South Wales towns of Griffith and Leeton. He made the L-shaped floor plan. The L-shaped floor plan was the carport and an innovation of reinforced concrete. == Major works == === India === * Library in University of Lucknow, in Lucknow city in the state of Uttar Pradesh in India * Dr Bhatia's Residence, is still extant in Lucknow city in the state of Uttar Pradesh in India === United States === * G.B. Cooley House, 1908 South Grand St., Monroe, Louisiana * Alfred W. Hebert House Remodeling, 1902, Evanston, Illinois * W.H. Emery House, 1903, Elmhurst, Illinois * Adolph Mueller House, 1906 * John Dickinson House, 10034 Cienega Road Hollister, California 1906 * Mary H. Bovee Apartment, 1907 * John Gauler House, 5917-5921 N. Magnolia Ave., Chicago, Illinois, 1908 * William S. Orth House, 1908, Winnetka, Illinois * Edmund C. Garrity House, 1909 * Ralph Griffin House, 1909, Edwardsville, Illinois * Edmund C. Garrity House, 1712 W. 104th Place, Chicago, Illinois, 1909 * William B. Sloan House, 1910 * Frank N. Olmstead House, 1624 W. 100th Place, Chicago, Illinois, 1910 * Harry N. Tolles House, 10561 S. Longwood Drive, Chicago, Illinois, 1911 * Harry G. Van Nostrand House, 1666 W. 104th Place, Chicago, Illinois, 1911 * Russell L. Blount House I, 1724 W. 104th Place, Chicago, Illinois, 1911 * Benjamin J. and Mabel T. Ricker House, 1510 Broad Street, Grinnell, Iowa, 1911-1912 * Joshua Melson House, 1912, Mason City, Iowa * Russel L. Blount House II, 1950 W. 102nd Street, Chicago, Illinois, 1912–1913 * Jenkinson House, 1727 W. 104th Place, Chicago, Illinois, 1912–1913 * Walter D. Salmon House, 1736 W. 104th Place, Chicago, Illinois, 1912–1913 * Newland house, 1737 W. 104th Place, Chicago, Illinois, 1913 * Ida E. Williams House, W. 104th Place, Chicago, Illinois (based on the Von Nostrand plans, built by Blount), 1913 * William R. Hornbaker House, 1710 W. 104th Place, Chicago, Illinois, (based on the Von Nostrand plans, built by Blount), 1914 * James Frederic Clarke House, 1731 W. 104th Place, Chicago, Illinois, (based on the Von Nostrand plans, built by Blount), 1913 * Harry C. Furneaux House, 1741 W. 104th Place, Chicago, Illinois, (based on the Salmon House plans, built by Blount), 1913 * James Blyth House, Mason City, Iowa * Stinson Memorial Library, Anna, Illinois === Australia === * Canberra plan, 1914–1920 * Leeton town plan, 1914 * Griffith town plan, 1914 * Eaglemont town plan, 1915 * Paris Theatre, Sydney, 1915 (demolished 1981) * Newman College, University of Melbourne, 1916–1918 * Café Australia, Melbourne, 1916 * Pholiota, in Eaglemont, Victoria 1920 * Capitol Theatre, Melbourne 1924 * Palais de danse, St Kilda 1925 (destroyed by fire) * Leonard House, Elizabeth Street Melbourne 1925 (demolished) * Ranelagh, town plan, 1924 * Langi Flats, Toorak 1925-26 * Castlecrag, suburb plan, 1925 * Fishwick House, completed in 1929 * Castle Cove, suburb plan, 1930 * Willoughby Incinerator, completed 1932 * Duncan House (Castlecrag), completed 1934 * Eric Pratten House, in Pymble, Sydney, completed 1936 * Hindmarsh Incinerator, South Australia, completed 1936Building Details - Architects of South Australia > Hindmarsh Incinerator Accessed May 13, 2014. * Pyrmont Incinerator, completed 1936 (demolished 1992) * Thebarton Incinerator, South Australia, completed 1937Building Details - Architects of South Australia > Thebarton Incinerator Accessed May 13, 2014. * Walter Burley Griffin Incinerator, Ipswich, completed 1992 == Gallery == File:Newman College - Dining from courtyard.JPG|Newman College, Melbourne File:Newman College - Dining interior archway wider.JPG|Newman College: interior of the dining room File:Capitol Theatre, Swanston Street, Melbourne.JPG|Capitol Theatre, Melbourne File:GnlBridgesGrave.jpg|Grave of General Bridges in Canberra File:Hindmarsh Incinerator.JPG|The incinerator in the suburb of Brompton, South Australia, known by the name of the adjacent suburb, Hindmarsh File:The incinerator at Thebarton, South Australia, designed by Walter Burley Griffin (square image).jpg|The incinerator in the suburb of Thebarton, South Australia (1)Coppins-1.jpg|Eric Pratten House, also called Coppins, in , Sydney == References == === References === === Citations === * * === General references === * Birrell, James. 1964. Walter Burley Griffin. University of Queensland Press * Gebhard, David & Gerald Mansheim, Buildings of Iowa, Oxford University Press, New York, 1993 * Gebhard, David. \"The Suburban House and the Automobile.\" The Car and the city: The Automobile, the Built Environment and Daily Urban Life. Ann Arbor: University of Michigan Press, 1991: 106,123. * Kruty, Paul. 2000. Griffin, Walter Burley. American National Biography Online. Oxford University Press * * Mason City Iowa, An Architectural Heritage, Department of Community Development, City of Mason, Iowa, 1977 * Maldre, Mati and Paul Kruty, Walter Burley Griffin in America, University of Illinois Press, Urbana, 1996 * McGregor, Alasdair, 'Grand Obsessions: The life and work of Walter Burley Griffin and Marion Mahony Griffin, Penguin/Lantern, Camberwell, Victoria, 2009 * Walker, M., Kabos, A. and Weirick, J. (1994) Building for nature : Walter Burley Griffin and Castlecrag, Castlecrag, N.S.W. : Walter Burley Griffin Society () * Wilson, Richard Guy and Sidney K. Robinson, The Prairie School in Iowa, Iowa State University Press, Ames, 1977 == Further reading == * Brooks, H. Allen, Frank Lloyd Wright and the Prairie School, Braziller (in association with the Cooper-Hewitt Museum), New York 1984; * Brooks, H. Allen, The Prairie School, W.W. Norton, New York 2006; * Brooks, H. Allen (editor), Prairie School Architecture: Studies from \"The Western Architect\", University of Toronto Press, Toronto, Buffalo 1975; * Brooks, H. Allen, The Prairie School: Frank Lloyd Wright and his Midwest Contemporaries, University of Toronto Press, Toronto 1972; * Griffin, Dustin (editor), The Writings of Walter Burley Griffin, Cambridge University Press, Melbourne 2008; * * * McGregor, Alasdair, 'Grand Obsessions: The life and work of Walter Burley Griffin and Marion Mahony Griffin', Penguin/Lantern, Camberwell, Victoria, 2009 * Turnbull, J. and Navaretti, P. (eds), The Griffins in Australia and India: the complete works of Walter Burley Griffin and Marion Mahony Griffin, Miegunyah Press, Melbourne 1998; == Other websites == * Walter Burley Griffin Society (Australia) * Walter Burley Griffin and Marion Mahony Griffin architectural drawings, circa 1909-1937 .Held by the Department of Drawings & Archives, Avery Architectural & Fine Arts Library, Columbia University. * The Griffin Legacy, National Capital Authority * Imagining Canberra in Chicago from the ABC * Reading the past in the Walter Burley Griffin Incinerator and Fishwick House at Willoughby, NSW (educational resources) * Castlecrag Progress Association * [CC-By-SA] * Great Buildings Online: works of Walter Burley Griffin (includes links to W.H.Emery House, 1903; Ralph Griffin House, 1909; Adolph Mueller House, 1906; Joshua Melson House, 1912; and Stinson Memorial Library, 1913) * Walter Burley Giffiin, The Prairie School of Architecture * Stinson Memorial Public Library (includes history of Stinson Library construction) * The Walter Burley Griffin Society of America * Mary Mahoney Griffin's Manuscript, The Magic of America: Ryerson & Burnham Libraries: Archives Collection * National Library of Australia: * Eric Milton Nicholls collection * Papers of Walter Burley Griffin and Marion Mahony collected by Eric Nicholls, 1900–1947 * The Donald Leslie Johnson collection of Walter and Marion Griffin documents, 1901–1988 * The work of Walter Burley Griffin and Marion Mahony Griffin in Melbourne, 1975 a collection of photographs by Wolfgang Sievers of works by Walter Burley Griffin and Marion Mahony Griffin taken in 1975 === Online exhibitions === * Walter Burley Griffin: in his own right, Public Broadcasting Service * An Ideal City? The 1912 Competition to Design Canberra an online exhibition developed by the National Archives of Australia, National Library of Australia and the National Capital Authority Category:1876 births Category:American architects Category:1937 deaths",
 "title": "Walter Burley Griffin"
}