{
 "id": "917514",
 "text": "Johann George Adam Forster, also known as Georg Forster (, 27 November 1754 – 10 January 1794), was a German naturalist, ethnologist, travel writer, journalist and revolutionary. When he was young, he went with his father. Johann Reinhold Forster on many scientific trips. One of these was James Cook's second trip to the Pacific. Forster wrote about this trip in the book A Voyage Round the World. The book helped contribute to the ethnology to people in Polynesia. It still is a respected work. Because of this book, Forster was let into the Royal Society when he was 22. He was thought to be one of the founders of modern scientific travel literature. Forster went back to Continental Europe after his trips. Forster decided then to have many jobs in education and learning. He taught natural history at the Collegium Carolinum in the Ottoneum, Kassel (1778–84). He then worked at the Academy of Vilna (1784–87). In 1788, he was the head librarian at the University of Mainz. Here, he did lot of scientific work on essays on botany and ethnology . He also translated and wrote a lot of books about travel and exploration. For example, he wrote a German translation of Cook's diaries. Forster was a large figure in the Enlightenment in Germany. He talked closely with many of his close friends. His ideas, writings and personality influenced Alexander von Humboldt. Humboldt was a famous scientist in the 19th century. When France took control of Mainz in 1792, Forster played a big role in the Mainz Republic (the earliest republican state in Germany). During July 1793 and while he was in Paris as a delegate of the young Mainz Republic, Prussian and Austrian coalition forces regained control of the city and Forster was declared an outlaw. Forster was not able to go back to Germany. He was separated from his friends and family. In early 1794, he died in Paris of illness. == Early life == Georg Forster was born in Nassenhuben on 27 November 1754. Nassenhuben is a village near Danzig which is now Mokry Dwór, Poland. Georg was the oldest of seven surviving children of Johann Reinhold Forster, a Reformed Protestant pastor and scholar, and his wife Justina Elisabeth, . When George was young, Georg liked the study of nature. When his father learned natural history from the books of Carl Linnaeus, he taught his son biology. He also taught George Latin, French and religion. In 1765, Reinhold got a commission(a written instruction) by the Russian government to inspect colonies that were near Saratov on the Volga River. They were mostly settled by German colonists. Ten- year old Georg went his father on this journey. The journey was long. It led to the Kalmyk Steppe and Lake Elton where they got collected hundreds of samples plants. George helped his father with naming and identification. On October 1765, George Forster went to Saint Peter's School in St Petersburg. While Forster was in school, his father made reports about the colony. His report was very critical of the voivode(the military leader) of Saratov. He also thought the conditions of the colony were bad. Because of this, the Forsters left Russia without payment because they were angry at Grigory Orlov. The Forsters went on a journey from Kronstadt to London. On the journey, Georg learned English and practiced Russian. They got to London on 4 October 1766. Georg was 12 when they got to London. Georg translated Lomonosov's history of Russia into English. He also added on to the book to include recent events. The book was printed and was presented to the Society of Antiquaries on 21 May 1767. In June 1767, father moved to Warrington to became a teacher at Warrington Academy. He succeeded Joseph Priestley. This left Georg behind in London. He became an apprentice there with a merchant. He was an apprentice until the rest of the family got to England in September 1767. He moved to Warrington. In Warrington, Georg learned classics and religion from John Aikin. He learned mathematics from John Holt. He learned French and natural history from his father. == Around the world with Captain Cook == The Forsters moved back to London in 1770. Reinhold Forster got many scientific contacts and became a member of the Royal Society in 1772. When Joseph Banks left Cook's expedition, Reinhold was invited by the British Admiralty to join James Cook's second expedition to the Pacific Ocean(1772–75). Georg Forster went with his father in the expedition. He became the draughtsman to his father. Reinhold had to work on scientific reports of any discoveries that they made. It was published when they got back from the expedition. They got onto the HMS Resolution for Cook's second expedition on 13 July 1772, in Plymouth. The ship got them first to the South Atlantic. Then it went through the Indian Ocean and the Southern Ocean. While they were around the Southern Ocean, they went to the islands of Polynesia. They finally went around Cape Horn back to England on 30 July 1775. On their journey, they went to New Zealand, the Tonga islands, New Caledonia, Tahiti, the Marquesas Islands and Easter Island. They went the most south anyone has ever been. They almost discovered Antarctica. The journey disproved the Terra Australis Incognita theory. The Terra Australis theory claimed there was a big continent in the South that people were able to live in. Georg Forster first studied zoology and botanics of the southern seas with his father. He did this mostly by drawing animals and plants. Georg, however, also went with his own interests. It led to to independent missions in geography and ethnology. He quickly learned the languages of the Polynesian islands. He wrote many reports on the people of Polynesia. They are very popular today. In his reports, he talks about the people of the southern islands with empathy, sympathy and without Western or Christian bias. Louis Antoine de Bougainville went to Tahiti a few years before Forster's trip. His reports said that the people there were a type of noble savage romanticism. Forster, however, thought that the South Pacific Islands were very intelligent. He wrote about many different social structures and religions that he saw on the Society Islands, Easter Island, Tonga and New Zealand. He wrote about the differences with the different people. He also noticed that the languages of the islands were all scattered but were usually alike. He wrote that the Nomuka islands had languages, vehicles, weapons, furniture, clothes, tattoos, beards were almost exactly the same with tribes on Tongatapu.Forster, Georg. A Voyage Round the World, Book II, Chapter VIIIThe journey had many scientific results that were very helpful. However, the Forsters and Cook and his officers were very unkind to each other. This was because Reinfield Forster had a large temper. Cook also didn't allow for the Forsters to spend more on botany and the Forster's science. Cook didn't allow scientists on his third journey because of the Forsters. == Founder of modern travel literature == People was annoyed with the Forsters after his trip as well. Lord Sandwich was annoyed with Johann Reinhold Forster's first chapter in his book. He tried to change. Forster, however, said that him being corrected However, Forster did not want to have his writing corrected \"like a theme of a School-boy\". He wouldn't allow any compromise. Because of this, the book was written by Cook. The Forsters were not allowed to compile the book. They did not get payment for the work, either. While Lord Sandwich and Reinhold Forster were arguing, Georg put out an unofficial book on their travel. In 1777, the book A Voyage Round the World in His Britannic Majesty's Sloop Resolution, Commanded by Capt. James Cook, during the Years, 1772, 3, 4, and 5 was published. It was published six weeks before the official version came out. The unofficial version was very popular. Georg got lots of fame from this. In 1778–80, Georg, published it in German. The poet Christoph Martin Wieland like the book. He said it was the most important one of his time. Even today, it was one of the most important journey descriptions written. The book changed German literature, culture and science. It inspired many scientists such as Alexander von Humboldt. It also inspired many modern ethnologists. Forster's German translation was seen as very looked-through. It was scientifically correct. It was also seen as exciting and easy to read. Most travel literature of this time was a basic writing of data. Georg's book was, however seen as, colourful and reliable ethnographical. They were very detailed and sympathetic. He also wrote about philosophy in books in his observations. He focused on the behaviour of people, their customs, habits, religions and social organization. In A Voyage Round the World he wrote about the songs from Polynesian people. He included lyrics and notation. The book is one of the most important writings that is about the Southern Pacific from before European influence had become more significant.Ruth P. Dawson, “Navigating Gender: Georg Forster in the Pacific and Emilie von Berlepsch in Scotland.“ In: Weimar Classicism, ed. David Gallagher. Lampeter, Wales: Edwin Mellen Press, 2011. 39-64. == Forster at universities == A Voyage Round the World made Georg Forster have scientific recognition in Europe. The Royal Society made him a member on 9 January 1777. He was not even 23 years old at the time. He also got other titles from academies from Berlin to Madrid. Georg, however didn't get any money from getting these titles. He went to Paris to look for the American revolutionary Benjamin Franklin in 1777. He wanted to talk with him. In 1778, he went to Germany become a natural history professor at the Collegium Carolinum in Kassel. Georg met Therese Heyne there. She was the daughter of the classicist Christian Gottlob Heyne. Heyne later became one of the first independent female writers in Germany. Georg later married Heyne in 1785(at that time, Georg had already left Kassel). Their marriage was seen as not very happy. They had had two surviving children, Therese Forster and Clara Forster. While Forster was still in Kassel, Forster like to talk with many people who were important in the Enlightenment. Some people he talked to was Lessing, Johann Gottfried Herder, Christoph Martin Wieland and Goethe. He also got cooperation with the Collegium Carolinum in Kassel and the University of Göttingen where his friend Georg Christoph Lichtenberg worked. Together, they founded and published the scientific journal Göttingisches Magazin der Wissenschaften und Litteratur. By 1783, Forster saw that talking with all of with these people led him away from science. It was also pushing him into deeper debt. He was known to not be very good with money. Because of this, Forster was happy to get a job from the Polish–Lithuanian Commonwealth Commission of National Education. He became the Chair of Natural History at Vilnius University in 1784. At first, he did well in Vilnius. After some time, however, he began to feel isolated. Most of the people that he knew were still scientists from Germany that he met before. In 1785, Forster went to Halle where put in a thesis on the plants of the South Pacific for a doctorate in medicine. Forster's plans to build a natural history scientific centre could not get enough financial support from authorities in Polish–Lithuanian Commonwealth. His famous speech about natural history in 1785 went wouldn't be noticed or even printed until 1843. Eventually, he broke the contract six years before it was over. This is because Catherine II of Russia had asked Forster to go around the world with him on his journey(the Mulovsky expedition). If he came with him, he would be paid as a professor in Saint Petersburg. This made a conflict between Forster and the Polish scientist Jędrzej Śniadecki. Catherine II of Russia, however, decided to not let him go on his journey. After that, Forster left Vilnius. He then went in Mainz. Here he became the head librarian at the University of Mainz. He succeeded Johannes von Müller who was a friend of Forster. He made sure that Forster would succeed him when Müller moved to become the administration of Elector Friedrich Karl Josef von Erthal. While Forster was a librarian, he published essays very often on explorations. He continued to be a very good translator. For example, he wrote about Cook's third journey to the South Pacific. He also wrote and about the Bounty expedition. He translated Cook's and Bligh's diaries from those journeys into German. Forster was also interested in indology. When he was going to go on his failed expedition that was funded by Catherine II, one of his main goals was to go to India. He translated the Sanskrit play Shakuntala with a Latin version that was written by Sir William Jones. This helped influence Johann Gottfried Herder. It improved German interest in indology. == Views from the Lower Rhine == In mid 1790, Forster and Alexander von Humboldt went on a long journey through the Southern Netherlands, the United Provinces, and England. The finished in Paris. Forster wrote about this journey in a three volume book series called Ansichten vom Niederrhein, von Brabant, Flandern, Holland, England und Frankreich im April, Mai und Juni 1790 (Views of the Lower Rhine, from Brabant, Flanders, Holland, England, and France in April, May and June 1790). It was published in 1791–94. Goethe said about that this book makes someone to read if again and travel the journey themself. The book talks about the history of art that were influential for art as A Voyage Round the world was for ethnology. Forster's biggest interest, however, was with the behaviour of people. The uprisings in Flanders and Brabant and the revolution in France made him very interested in that. His journey through the Netherlands and England where people were developed made him make a political opinion. Because of this, he became a confident opponent of the ancien régime. Like many other German scholars, he welcomed the revolution as a result of the Enlightenment. A little bit after he heard about the Storming of the Bastille in 30 July 1789, he wrote to his father-in-law. In his note he wrote about how beautiful to see the philosophy that happened. == Life as a revolutionary == === Foundation of the Mainz Republic === The French revolutionary army that was under General Custine got control of Mainz on 21 October 1792. Two days after this, Forster joined in creating a Jacobin Club. It was called \"Freunde der Freiheit und Gleichheit\" (\"Friends of Freedom and Equality\"). He helped in organizing the Mainz Republic in 1793. The first one made in Germany was a democracy. Forster became the vice-president the their administration. He was a candidate in the election for the local parliament, the (Rhenish-German National Convention). He was an editor of (The new Mainz newspaper or The People's Friend) from January to March 1793.Harpprecht, Das Abenteuer der Freiheit, p. 33 In his first article that he made, he wrote: This freedom did not last very long. In July 1973, French troops ended the Mainz Republic. Forster was not in Mainz when France took over. Since he was part of the Mainz National Convention, he and Adam Lux went to Paris to apply for Mainz to become a part of the French Republic. The application was accepted, but didn't have any effect since Mainz was took over by France. Forster lost his library and his things. He decided to stay in Paris. === Death in revolutionary Paris === Emperor Francis II made a decree(or law) that would give punishments on German people who helped the French French Revolutionary government. Forster became an outlaw because of this. He was placed under the Imperial ban. 100 ducats were put on his head. Because of this, he could not go back to Germany. He did not have his wife because she stayed in Mainz with her children and future husband Ludwig Ferdinand Huber. He also did not have any way to make money. He stayed in Paris. Paris had just started the Reign of Terror under the rule of Maximilien Robespierre. Forster was able to see the difference between the promises of the revolution of happiness and its cruel practices. Many German supporters of the revolution like Friedrich Schiller turned back from their opinions from the terror. Forster, however did not turn back from his revolutionary ideals from the Reign of Terror. He saw what happened in France as a force that could not be slowed. Forster thought that had to become calmer and if they didn't, France could destroy even more. In January 1794 when he was 39, Forster died from rheumatic illness before the Reign of Terror was its peak. He was planning to go to India at the time. == Views on nations and their culture == Forster had some Scottish family. He was born in born in Polish Royal Prussia. This made him a Polish subject by birth. He worked in Russia, England, Poland and in German countries of his time. Finally, he died in France. He worked in different places. He travelled a lot from when he was a youth. His thoughts made very big scientific discoveries from the Enlightenment. It also people different views on ethnic and national communities. In his opinion, all human beings had some feelings and imagination. They are used in different ways, however. These different ways makes different cultures and civilizations. Forster said cultures like Tierra del Fuego is at a lower level of development than European culture. He also said that living on places like that is harder and there is less chance to have higher culture. This opinions were one of the biggest examples of 18th- century German cosmopolitanism. He used insulting words against Poles with prejudice in his letters when he was in Vilnius and in a diary from when he when through Poland. He, however, but he never showed it in his publications. It was only known after he had died when these conversations and diaries were shown to the public. Forster's writings were seen as scientifically based. Forster's prejudice against Poland usually taken as factual in Imperial Germany and Nazi Germany. The \"Polnische Wirtschaft\" (Polish economy) stereotype was probably because of his letters. * Forster's thoughts and attitude got him into trouble with other countries. It made not welcome by anyone. He wanted a revolution too much in Germany. He was too proud in England. He didn't like Polish science in Poland. He wasn't popular enough and was ignored in France. == Legacy == After Forster's died, most of his books were forgotten. The only place they were remembered were in some circles. This was mostly because he was a part of the French Revolution. People like him differently throughout history. Their opinion on usually changed with their political beliefs. After the Napoleonic era, he Germans thought that he was a traitor. People thought this even though people like Karl Wilhelm Friedrich Schlegel wrote good things about him.Schlegel, Friedrich. Kritische Schriften, ed. W. Rasch, 2nd ed., Munich: Hanser 1964, translated by T. Saine in the preface to Georg Forster His life was revived a little bit in the buildup to the 1848 revolution. He was, however, forgotten in Wilhelm II and Nazi Germany. Here, the only interest in Forster was from his thoughts of Poland. In the1960s in East Germany, however, people began to remember him more. This is because people thought that he showed class struggle. The GDR research station in Antarctica that was opened on 25 October 1987 was named after him. The Alexander von Humboldt foundation named a scholarship program after him. The scholarship was for foreign people from developing countries. He was a very good German ethnologist. His works are seen as very helpful in Germany's ethnology. The ethnographical items collected by Georg and Johann Reinhold Forster are now presented as the Cook-Forster-Sammlung (Cook–Forster Collection) in the Sammlung für Völkerkunde anthropological collection in Göttingen. Another collection of items collected by the Forsters is on display at the Pitt Rivers Museum in Oxford. == Works == * A Voyage Round the World in His Britannic Majesty's Sloop Resolution, Commanded by Capt. James Cook, during the Years, 1772, 3, 4, and 5 (1777) Internet Archive scans: Vol. I and II; modern publication with commentary: (preview) * Characteres generum plantarum, quas in Itinere ad Insulas Maris Australis, Collegerunt, Descripserunt, Delinearunt, annis MDCCLXXII-MDCCLXXV Joannes Reinoldus Forster et Georgius Forster (1775/76), archive.org * De Plantis Esculentis Insularum Oceani Australis Commentatio Botanica (1786) available online at Project Gutenberg * Florulae Insularum Australium Prodromus (1786) available online at Project Gutenberg and Biodiversity Heritage Library (DOI:10.5962/bhl.title.10725) * Essays on moral and natural geography, natural history and philosophy (1789–97) * Views of the Lower Rhine, Brabant, Flanders (three volumes, 1791–94) * Georg Forsters Werke, Sämtliche Schriften, Tagebücher, Briefe, Deutsche Akademie der Wissenschaften zu Berlin, G. Steiner et al. Berlin: Akademie 1958 * Werke in vier Bänden, Gerhard Steiner (editor). Leipzig: Insel 1965. ASIN: B00307GDQ0 * Reise um die Welt, Gerhard Steiner (editor). Frankfurt am Main: Insel, 1983. * Ansichten vom Niederrhein, Gerhard Steiner (editor). Frankfurt am Main: Insel, 1989. * Georg Forster, Briefe an Ernst Friedrich Hector Falcke. Neu aufgefundene Forsteriana aus der Gold- und Rosenkreuzerzeit, Michael Ewert, Hermann Schüttler (editors). Georg-Forster-Studien Beiheft 4. Kassel: Kassel University Press 2009. == Notes == == References == === Sources === * * * * * * * * * * * * * * * * Jovanović, Lazar, (2020). “The Cosmopolitan Circumnavigator of the South Seas: A Biography of Georg Forster”, in BEROSE – International Encyclopaedia of the Histories of Anthropology, Paris. * == Other websites == * The Forster Collection at the Pitt Rivers Museum * Georg Forster society in Kassel * Letter recommending Georg Forster to the Royal Society (archived link, 21 October 2006) * Biography at the Australian Dictionary of Biography * * * * Resources related to research : BEROSE – International Encyclopaedia of the Histories of Anthropology. \"Forster, Georg (1754–1794)\", Paris, 2020. (ISSN 2648-2770) Category:1754 births Category:1794 deaths Category:Fellows of the Royal Society Category:People of the French Revolution Category:German explorers Category:German botanists Category:German zoologists Category:Ethnologists",
 "title": "Georg Forster"
}