{
 "id": "917581",
 "text": "Baalbek (; * * * ; Syriac-Aramaic: ܒܥܠܒܟ) is a city located east of the Litani River in Lebanon's Beqaa Valley. It is about northeast of Beirut. It is the capital of Baalbek-Hermel Governorate. In 1998, Baalbek had a population of 82,608, mostly Shia Muslims, followed by Sunni Muslims and Christians. The town is known for its historical sites and tourist attractions, including several ancient Roman temples, a Great Mosque from the Umayyad period, and a Roman quarry site named Hajar al-Hibla. Before it was a city, it was known as Heliopolis of Phoenicia. It was a colony of the Roman Empire. The name was Colonia Julia Augusta Felix Heliopolitana. It is a Unesco world heritage siteUNESCO: Heliopolis/Baalbeck ==History== Ancient Baalbek (under its Hellenic name Heliopolis) formed part of the kingdoms of Egypt & Syria. It was annexed by the Romans during their eastern wars. The Italic settlers of the Roman colony \"Colonia Julia Augusta Felix Heliopolitana\" may have arrived as early as the time of Caesar but were more probably the veterans of two Roman Legions under Augustus, during which time it hosted a Roman garrison. Indeed the veterans of two Roman legions were established in the city (and region) of Berytus (actual Beyrut) by emperor Augustus: the \"Legio V Macedonica\" and the \"Legio III Gallica\".,Roman Berytus: a colony of legionaries and Heliopolis from 15 BC to 193 AD formed part of the territory of Berytus. The population was mainly local in the second century under Hadrian with a few descendants of the Roman colonists and likely varied seasonally with market fairs and the schedules of the Camel caravans to the coast and interior. The present \"Temple of Jupiter\" presumably replaced an earlier one using the same foundation. The presence of a huge quarry was one of the reasons for the Roman decision to create a huge \"Great Court\" of a big pagan temple complex in this mountain site, located at nearly 1100 meters of altitude and on the eastern borders of the Roman Empire: it took three centuries to create this colossal Roman paganism's temple complex, called Sanctuary of Heliopolis.Video-Panoramas of the Sanctuary temples at Discover Lebanon: Heliopolis temples Heliopolis was a noted oracle and pilgrimage site, whence the cult spread far afield, with inscriptions to the Heliopolitan god discovered in Athens, Rome, Pannonia, Venetia, Gaul, and near the Wall in Britain.Cook Arthur 552 The Roman temple complex grew up from the early part of the reign of Augustus in the late 1st century until the rise of Christianity in the 4th century. The 6th-century chronicles of John Malalas of Antioch, which claimed Baalbek as a \"wonder of the world\"Cook Arthur 471 credited most of the complex to the 2nd-century Antoninus Pius. By that time, the complex housed three temples on Tell Baalbek: one to Jupiter Heliopolitanus (Baʿal), one to Venus Heliopolitana (Ashtart), and a third to Bacchus. On a nearby hill, a fourth temple was dedicated to the third figure of the Heliopolitan Triad, Mercury (Adon).Cook Arthur 554 Ultimately, the site vied with Praeneste in Italy as the two largest sanctuaries in the Western world. The emperor Trajan consulted the site's oracle twice. In 193 AD, Septimius Severus granted the city the famous ius Italicum rightsUlpian, De Censibus, Bk. I. and the city grew in importance in all the Roman Levant. In the third century Heliopolis had a population of nearly 20000 inhabitants and there was an hippodrome with even a theater, just outside the \"Great Court\" area of the temples. Additionally a temple of Mercury stood on top of the hill outside the ramparts. A long staircase led up to it from the town, as is shown on coins of Heliopolis struck under emperor Philip the Arab. Remains of the temple, the line of the staircase, and parts of its parapet have been found. Still remain some sections of the Roman walls, with square forts around the old cityTreccani: Heliopolis (in Italian) The town became a battleground upon the rise of Christianity, because it was an important center of Roman paganism. Early Christian writers such as Eusebius (from nearby Caesarea) repeatedly execrated the practices of the local pagans in their worship of the Heliopolitan Venus. In the early 4th century, the deacon Cyril defaced many of the idols in Heliopolis; he was killed and (allegedly) cannibalised Around the same time, Constantine, though not yet a Christian, demolished the goddess's temple, raised a basilica in its place, and outlawed the locals' ancient custom of prostituting women before marriage. The enraged locals responded by raping and torturing Christian virgins. The city was so noted for its hostility to the Christians, that Alexandrians were banished to it as a special punishment. The Temple of Jupiter, already greatly damaged by earthquakes, was partially demolished under Theodosius in 379 AD and replaced by another basilica (now lost), using stones scavenged from the pagan complex. The Easter Chronicles states he was also responsible for destroying nearly all the lesser temples and shrines of the city.Chron. Pasch., CCLXXXIX. Around the year 400 AD, Rabbula, the future bishop of the diocese of Edessa, attempted to have himself martyred by disrupting the pagans of Baalbek but was only thrown down the temple stairs along with his companion. It became the seat of its own bishop as well. Under the reign of Justinian, eight of the complex's Corinthian columns were disassembled and shipped to Constantinople for incorporation in the rebuilt Hagia Sophia sometime between 532 and 537 AD. Michael the Syrian claimed the golden idol of Heliopolitan Jupiter was still to be seen during the reign of Justin II (560s & 570s),and, up to the time of its conquest by the Muslims in 637 AD, it was renowned for its palaces, monuments, and gardens. The Arabs under Abu Ubaidah -who conquered the city after a damaging siege- renamed the city as \"Baalbeck\" (that in ancient Lebanese Arab language probably meaned \"Bacchus ruins\"). The Christians left the city, that lost importance in the next centuries (even because of the growth of nearby Damascus, that was chosen as the capital of the Umayyad Caliphate from 661 AD) and in the tenth century was reduced to be just a small village. In 1170 AD the arab city of Baalbeck was hit by a terrible earthquake that fully destroyed the Temple of Jupiter, leaving only a few columns standing, and heavily damaged the \"Great Court\" of ancient Heliopolis's temple complex. ==Related pages== * Lebanon ==Notes== ==Bibliography== * Idejian, Nina (1975). Baalbek: Heliopolis: \"City of the Sun\". Beirut: Dar el-Machreq Publishers. ISBN 978-2-7214-5884-1 Category:World Heritage Sites in Asia Category:Phoenicia ==Notes==",
 "title": "Baalbek"
}