{
 "id": "917661",
 "text": "Pambai (Tamil: பம்பை) is a local musical instrument of Tamil Nadu, South India. It looks a lot like a drum. It is commonly used in festivals and folk music of various temples in the state. Traditionally, it is used in rural rituals to worship local gods at their shrines. It is also prevalent in a small community in the southern part of Andhra Pradesh outside Tamil Nadu. Pambai is also played at the traditional fair Nayandi Melam. File:A_Pambai.JPG|Pambai (single) File:A close-up of Pambai.JPG|Close up File:A close-up of Pambai 1.JPG|Close up == Types and uses == Pambai is played by tying two Damru-shaped drums together. The instrument of two drums is placed near the player's waist or on the floor. They are beaten with sticks or with hands and sticks. Pambai players are called 'Pambaikaran' in Tamil Nadu and 'Pambala' in Andhra Pradesh. There are two types of drums based on the material used to make them. Among the simplest varieties, the pambai of both wooden drums is known as 'Bhiru Vanam'. One is made of wood and the other is made of brass or metal. In the early days, it was made of metal such as bronze and brass, but now it is also used in metal such as iron (galvanized) plate. It is commonly used in wedding, festivals, religious ceremony and folk music of various temples in Tamil Nadu. The instrument is also used as a background instrument for folk games such as satire, karagam, kavadi, poikkal kudirai etc. Angalaparameswari sings folk songs to the tune of pamaba at folk temple festivals such as Shakti Karagam Invitation. A tamil pambai consists of two percussion instruments, two tambourines, two pumps, an urn, a snare drum, and a hammer. File:Dance_musicians,Karakattam,TamilNadu355.jpeg|Pambai File:A_video_on_Tamil_Karakattam.ogv ==References== * South Asia : The Indian Subcontinent. (Garland Encyclopedia of World Music, Volume 5). Routledge; Har/Com edition (November 1999). * Bigamudre Chaitanya Deva: Musical Instruments. National Book Trust, Neu-Delhi 1977, S. 35 * Stichwort: Pambai. In: Late Pandit Nikhil Ghosh (Hrsg.): The Oxford Encyclopaedia of the Music of India. Saṅgīt Mahābhāratī. Vol. 3 (P–Z) Oxford University Press, Neu-Delhi 2011, S. 788 ==Other websites== * Category:Tamil Nadu Category:Drums",
 "title": "Pambai"
}