{
 "id": "917790",
 "text": "A video editing software, also called a video editor, is software (a program) that allows users to edit videos and images. Popular video editing softwares include Sony Vegas, Adobe Premiere Pro, and DaVinci Resolve. Video editing software can be used to change the time when a video is played or to cut videos into many parts. It can also be used to put music and sounds at the same time as the video. When the person editing the video is done, the software can _export_ the file— to change it into a video file. == Parts of a video editing software == === Timeline === A video editor has many parts. There is a part which is called the timeline. This part is used to move the videos, sounds, and pictures into different parts. Other than videos, sounds, and pictures, a person can add writing on the video, using a text clip. This writing can be used as the title of the video, or as the credits at the end of the video. When you go to the right side of the timeline, the video moves forward, but when you go to the left side, the video moves backwards. Videos can be added above and below another video. This lets you play two videos together at the same time. The timeline can be used to add a _fade_ effect. This will make a video turn into another video smoothly. Without the fade effect, videos will change suddenly. === Visual effects === The video editor can be used to add visual effects. A visual effect is something not real that looks real. For example, there is a green wall behind a man. The video editor can take the man out of the green wall, and make the man look like he is inside another place. === Color editing === A video editing software can be used to edit the colors of a video. This can make the video look more good. For example, the colors can be made bright or dark. == Hardware needs == To use video editing software, a strong computer is needed, but sometimes it is possible to use a weak computer. A video uses a lot of capacity, so a big hard disk or solid-state drive needs to be used to put the video. If the capacity is not big enough, the video will not fit. == Common video editing software == Many companies make video editing software. Here are a few examples: * Sony Vegas * Blender (program) * iMovie * Kdenlive * Windows Movie Maker * DaVinci Resolve * Capcut * YouTube Create * Adobe Premiere Pro * Filmora * Kapwing * Veed * InShot * Edits == Related pages == * Video editing == References == Category:Software Category:Video",
 "title": "Video editing software"
}