{
 "id": "917725",
 "text": "Adobe Premiere Pro CC (CC stands for Creative Cloud) is a video editing software. It was created by Adobe Inc. The software was first released in 2003. Premiere Pro lets users edit videos. For example, words can be added to the video or the speed of the video can be changed. The software is based on Adobe Premiere. The original Adobe Premiere was released in 1991. It was replaced by Premiere Pro in 2002 as part of Adobe's change to Creative Cloud. Adobe Premiere Elements was released in 2013 as a simpler version of Premiere Pro. It is easier to learn and good for beginner editors. == Features == Premiere Pro lets users add effects to videos and images. Users can remove certain colors from the video. This is called chroma keying. Premiere Pro can edit videos at up to 32,768 x 32,768 pixels. Keyframing is a feature that makes effects change over time. For example, making a video move to a different place or make the video smaller over time. === Editing === When editing in Premiere Pro, the user can import video, audio and images, and use the software to create new, edited versions of videos which can be exported to the users files directly using Adobe Media Encoder. When creating videos in Premiere Pro, different videos, images and sounds can be edited together. Text can be added, and the user can change the font, size, and color of the text. Filters can be added to videos, images, and audio. ==== Keyframing ==== Keyframing is making a starting and ending point in an animation. Premiere Pro uses Keyframe interpolation to fill in the points in between the two keyframes. == Reception == Upon release, Premiere Pro was used to make many movies. Premiere Pro is very liked and is considered by some to be the best editing software of all time, rated 4.5/5 by PCMag. Some people think it is too complex, and because it costs a month. == Popular uses == Premiere Pro was been used to make well known movies, including Deadpool and Avatar. Premiere Pro was also used to edit Act of Valor, A Liar's Autobiography: The Untrue Story of Monty Python's Graham Chapman, Superman Returns, Terminator: Dark Fate, Dust to Glory and Sharknado 2. == References == == Other websites == * Category:Adobe software",
 "title": "Adobe Premiere Pro"
}