{
 "id": "91777",
 "text": "The New York City Subway is a rapid transit system in New York City, United States. It is run by the Metropolitan Transportation Authority (MTA). It is one of the biggest rapid transit systems in the world, with 472 stations.\"MTA Subway Fast Facts \" Retrieved June 28, 2007. It has 245 miles (or 394 km) of routes on 691 miles (or 1112 km) of railway track. The New York City Subway almost never closes; the trains run 24 hours a day, 7 days a week, all year. The system has only closed three times, most notably during the September 11 attacks and when Hurricane Sandy flooded its tracks. The first elevated trains started working on October 9, 1863, and the first underground trains started working on October 27, 1904. ==History== Alfred Ely Beach built an underground subway tunnel to test in 1869. His Beach Pneumatic Transit only extended under Broadway in Lower Manhattan. The subway car in the tunnel was pneumatic, or pushed by air. The tunnel was never made longer. It could have gone to Battery Park to the south and the Harlem River to the north. (extract from Scientific American March 5, 1870) The first underground subway line opened on October 27, 1904. The oldest elevated train line in the subway system opened in 1885. The oldest right-of-way was a steam railroad called the Brooklyn, Bath and Coney Island Rail Road. That railroad opened in 1863. By the time the first subway opened, there were two private subway companies. They were the Brooklyn Rapid Transit Corporation (BRT) and the Interborough Rapid Transit Company (IRT). Most subway lines built after 1913 were built by the New York City government. These tracks were leased to the companies. The first line of the city-owned and city-run Independent Subway System (IND) opened in 1932. In 1940, the two private systems were bought by the city. Some elevated train lines closed and were destroyed. The New York City Transit Authority (NYCTA) was made in 1952 to run subway, bus, and streetcar operations. It was made part of Metropolitan Transportation Authority in 1968. By the 1970s and 1980s, the New York City Subway was really bad to ride.nycsubway.org — The New York Transit Authority in the 1970snycsubway.org — The New York Transit Authority in the 1980s There were very few people riding the subway. There was a lot of graffiti and crime on the subway. This was fixed in the 1990's. After the September 11 attacks, there were train disruptions on lines running through Lower Manhattan.Kennedy, Randy. \"Tunnel Vision; With Station's Reopening, Even Commuters Smile\", The New York Times, September 17, 2002. Accessed October 6, 2007.Brian Abbott. September 11: Three Years Later. Several maps showing changes in lower Manhattan from July 2001 to September 2002. One line remained out of service for a year. In 2012, Hurricane Sandy flooded the subway system. It closed many lines for a few days, then recovered. == Stations == There are subway stations in Manhattan, Brooklyn, Queens, and the Bronx. About 40% of the tracks are above ground and the other 60% are below ground. Every day about 5,076,000 people take rides on the subway. 463 out of the system's 472 stations are always open. Many stations have \"mezzanines\". These are the levels of the station where you pay a fare before entering the subway platforms. Everyone must pay a fare to enter the subway system. They are usually between street level and platform level. Many station entrances and exits have lamp posts. At the top of the lamp posts are colored balls. Green globes identify that the entrance is open 24/7, 365. Red globes can show two things. An entrance lamp post with a red globe can show that the entrance is either part-time open or is an exit only entrance. Some of the globes do not show the right information about an entrance or exit. Most subway stations have waiting platforms that are from long. People wait for trains on these platforms. All new stations have platforms with air conditioning. Many stations also have artwork on the subway station walls. Most of the stations wers built before 1990. That is when a new law said that many new buildings, like subway stations, should have elevators and ramps so people with wheelchairs can enter these buildings. The MTA has run the \"Music Under New York\" (MUNY) program in the subway since 1987.MTA's Arts for Transit's Music Under New York (MUNY) Section MTA.info website. People must compete in order to be allowed to play music in a station. There are now more than 100 musicians and performers in the subway system. There are only 129 open restrooms in 77 of the system's stations. Some platforms have newspaper stands as well. They sell many things, including newspapers and food. There are also stores in some stations.Trendy Shops in the Subway MTA.info website. Made August 26, 2010. Retrieved September 2, 2010. ==Lines and routes== In other cities' subway systems, a train \"line\" is the same as a train \"route\". In New York City's subway system, however, the \"line\" is the actual tracks, which a train \"route\" uses. \"Routes\", also called \"services\", have a letter or a number, such as \"1\" or \"A\". \"Lines\" have names, like BMT Broadway Line. There are 24 train services. This includes 3 \"shuttle\" routes. Each route has a color. Raleigh D'Adamo, a lawyer who entered a contest in 1964, planned the colors that are used on subway maps now. Before, subway maps used different colors for every route.Polytechnic University Cable 34:2 Winter 2007 p.7 People who live in New York City do not call lines and services by color (such as, Blue Line or Green Line). However, tourists often use colors to tell between routes. There are three different types of subway services. \"Local\" trains make all stops at \"local\" stations as well as at \"express\" stations. \"Express\" trains skip local stations, but stop at \"express\" stations. There is one \"skip-stop\" service, the J/Z, where two train routes run on the same line; each route only stops at every other station along the line. The subway system runs 24 hours a day and 7 days a week, but some routes do not run when not many people ride the subway. When a line is closed, the transit authority uses free shuttle buses.Finnegan, Jack, Belden Merims and Jennifer Cecil. Newcomer's Handbook for Moving to and Living in New York City: Including Manhattan, Brooklyn, the Bronx, Queens, Staten Island, and Northern New Jersey. First Books Inc., Portland, Oregon. 2007. . Page 336. The transit authority shows planned service changes on its website, on station walls, inside subway cars, and through its Twitter page.https://twitter.com/NYCTSubway NYCT Subway Service: Official source for NYC Transit news & planned subway service changes ===Trunk lines=== ===Routes=== There are many routes on the subway. Many people who have never ridden on the subway get confused because there are so many routes going to so many different places. The subway has signs that hang from the stations' ceilings to show the routes and where they go. Routes on the \"A Division\", which used to be the Interborough Rapid Transit Company, are: Route Name Broadway-Seventh Avenue Local Broadway-Seventh Avenue Express Broadway-Seventh Avenue Express Lexington Avenue Express Lexington Avenue Express Lexington Avenue Local Flushing Local/Express 42nd Street Shuttle Routes on the \"B Division\", which used to belong to the Brooklyn–Manhattan Transit Corporation and Independent Subway System, are: Route Name Route Name Eighth Avenue Express Canarsie Local Sixth Avenue Express Sixth Avenue Local Eighth Avenue Local Broadway Express Sixth Avenue Express Broadway Express Eighth Avenue Local Broadway Local Sixth Avenue Local Franklin Avenue Shuttle Crosstown Local Rockaway Park Shuttle Nassau Street Local/Express Broadway Local == Fares == From 1904 until 1948, people paid a nickel to go into the subway., p. 28 On July 1, 1948, the fare was raised to a dime. In July 1953, the fare was raised to 15 cents. The MTA gave out subway tokens, which people used to enter the subway. People stopped using tokens in 2003. The fare is $2.90. Riders must pay with MetroCards or OMNY. The subway started using MetroCards in 1994. At subway stations, riders can buy MetroCards from the station booth or from vending machines. Riders can also buy MetroCards from many places in New York City, like convenience stores and newspaper sellers. ONMY later came out in 2019 as a testing fare for credit/debit cards on the 4/5/6 lines, to use for another way to pay for your subway fare. Once it succeeded, it expanded all throughout the NYCTA. Currently, it is planning to replace the MetroCard by 2024. == Rider safety == Riders are allowed to take pictures using cameras, but are not allowed to take pictures with cameras that flash or with cameras that are on tripods. Subway police can search riders to make sure they do not have weapons or other items that could be used to hurt other people. When riders get hurt, usually it is because they slip when they are getting on or off the train. This is because there is a gap between the train and the platform. In recent times, workers have made the gaps smaller to prevent people from slipping. Often messages are played from loudspeakers that say \"Please watch the gap when entering and exiting the train\". == Train safety == The MTA makes sure that New York City Subway trains run without accidents. There are railroad switches, railroad signals, and speed limits on the subway. All tracks also have a stopper on the side. If the train passes a red signal, the stopper will stop the train. A black-and-white striped board hangs above the middle of each platform. The conductor has to point to the board in front of him or her. After the conductor points to the board, the train doors will open. The subway has had over 56 train accidents since 1918. The Malbone Street Wreck on November 1, 1918 was the most deadly. That crash killed 93 people. Since the late 1990s and early 2000s, the MTA has experimented with Automatic train operation. New York City Subway trains normally run with a train conductor and a train operator. In 2006, the L train was the first route to be run by computers. The 7 train is becoming the second route to be run by a computer. There are computers both on the train and along the side of the tracks. The computer does the engineer's job by driving and stopping the train. == References == Category:Rail transport in the United States Category:1863 establishments in the United States Category:1860s establishments in New York (state)",
 "title": "New York City Subway"
}