{
 "id": "917935",
 "text": "Prakash Rai, better known by his stage name Prakash Raj, is an Indian film actor producer and television presenter who primarily appears in South Indian film industry and known for his works in Tamil, Telugu, Kannada, Malayalam and Hindi-language films. Prakash made his debut in Tamil cinema during mid 1990s through Duet (1994). He has received several multiple awards including Filmfare Awards South, SIIMA Awards, CineMAA Awards. ==Early life== Prakash Raj was born as Prakash Rai on 26 March 1965 in Bangalore, Karnataka, India. He belongs to a Kannada-speaking family. He studied at St. Joseph's Indian High School in Bangalore. Later, he went to St. Joseph’s College of Commerce in Bangalore for higher studies. He started acting in theatre and television during his early years. ==Career== Prakash Raj began his acting career with Kannada stage plays and TV serials. He performed in more than 2,000 street theatre shows. His strong acting in Kannada television helped him get roles in Kannada movies. In 1994, director K. Balachander gave him a big break in Tamil cinema with the film Duet. After that, he became popular in the Tamil, Telugu, Malayalam, Kannada and Hindi film industries. He acted in many hit movies as a villain, supporting actor and sometimes as a hero. He is known for movies like Iruvar (Tamil), Anthapuram (Telugu), Singham (Hindi), and Naanu Nanna Kanasu (Kannada). He has acted in over 300 films. ==As a director and producer== Prakash Raj started his own production company called Duet Movies. He directed movies such as Naanu Nanna Kanasu (Kannada), Dhoni (Tamil/Telugu), and Tadka (Hindi). His films often talk about family, education and society. ==Awards== Prakash Raj has won many awards for his acting. These include: * National Film Awards * Filmfare Awards South * SIIMA Awards * CineMAA Awards He is praised for his natural acting and powerful dialogue delivery. ==Social and political work== Prakash Raj is also active in social issues. He speaks about freedom of speech, education, and human rights. In 2019, he took part in politics and contested as an independent candidate in the Lok Sabha elections from Bangalore Central. He did not win but continues to raise his voice on public matters. ==External links== * Prakash Raj on IMDb == Sources == Category:1965 births Category:Living people Category:Indian movie actors",
 "title": "Prakash Raj"
}