{
 "id": "918014",
 "text": "The tinging frog, dyeing poison arrow frog, dyeing poison frog, blue poison frog, blue poison arrow frog, or giant poison frog (Dendrobates tinctorius) is a frog that lives in Guyana, French Guiana, Suriname, and Brazil. ==Appearance== For some time, scientists thought this frog was two species: Dendrobates azureus and Dendrobates tinctorius. Now they know it is one species that can be two different colors. These two types of frog in the same species are called morphs. The blue color morph (azureus) is bright blue-black legs and back, light blue sides, a light blue belly with spots, and spots on its head and back. Sometimes it has a dark stripe on its belly. The other morph has yellow color on its body. The adult male frog has bigger disks on its toes for climbing than adult female frogs have. Both frogs are poisonous, but the blue frogs have more poison than the yellow ones. Scientists studied the colors on this frog using computers with a learning algorithm. They wanted to know how different predators, for example humans, reptiles, and birds, could see the frog against the dead leaves on the ground. They found that, at a short distance, frogs of both color morphs were easy to see. But further away, both color morphs were hard to see. Both the blue and yellow colors acted like camouflage. Scientists think that, because the frog is poisonous, it has bright colors to tell any nearby predator not to eat it. ==Home== This frog lives in forests that are not too high above sea level. These forests have rocky streams and water in the air. ==Actions== The adult male frog sits on the ground or on leaves and sings for the female frog. The female frog comes near the male frog and touches his nose. Then the male leads the female to a body of water, where she lays 2 to 6 eggs. Usually, the male frog guards the eggs until they hatch. Sometimes the female frog does. The eggs take 14 to 18 days to hatch into tadpoles. Then the male and female frogs carry them away. They take the tadpoles to small bodies of water, for example in the leaves of a bromeliad plant. The frogs take them very far away. Sometimes the parent frogs will walk right past other pools of water to get to ones further away. Scientists think it is good for the frog's survival to spread out over a wide distance so the new frogs will not have to fight each other for food as much. Inside the new body of water, the tadpoles fight. Sometimes they eat each other. Usually, only one tadpole per body of water lives to become a new frog. But sometimes there are two. Scientists studied the fighting tadpoles. They found that when one tadpole was much bigger than the other, they usually did not fight. They believe this is because both tadpoles knew who would lose. They also found that when two tadpoles in the same pool had the same parents, they only fought half as often as tadpoles that were not related to each other. ==References== Category:Frogs of South America",
 "title": "Dyeing poison dart frog"
}