{
 "id": "91847",
 "text": "The Epic of Gilgamesh is an epic poem from ancient Mesopotamia. It is one of the earliest works of literary fiction known. The most complete version that exists today was preserved on twelve clay tablets in the library collection of the 7th century BC Assyrian king Ashurbanipal. A series of Sumerian legends and poems about the mythological hero-king Gilgamesh were probably gathered into a longer Akkadian poem some time before the 7th century BC. The essential story is about the relationship between Gilgamesh, a king who has become distracted and disheartened by his rule, and a friend, Enkidu, who is half- wild and who undertakes dangerous quests with Gilgamesh. Much of the epic focuses on Gilgamesh's thoughts of loss following Enkidu's death. It is often credited as being one of the first literary works with emphasis on immortality. The epic is widely read in translation, and the hero, Gilgamesh, has become an icon of popular culture. == History == Gilgamesh was the fifth king of Uruk, an ancient city of Sumer. His supposed historical reign is believed to lie within the period 2700 to 2500 BC, 200–400 years before the earliest known written stories. His father was the third king, Lugalbanda. The Epic of Gilgamesh was about him. == Bibliography == === Editions === * * * * Glossary, Appendices, Appendix (Chapter XII=Tablet XII). A line-by-line translation (Chapters I-XI). * * * * Sandars, N. K. (2006). The Epic of Gilgamesh (Penguin Epics). - re-print of the Penguin Classic translation (in prose) by N. K. Sandars 1960 () without the introduction. * (Volume 1) in the original Akkadian cuneiform and transliteration; commentary and glossary are in English * === Other === * Damrosch, David (2007) The Buried Book: The Loss and Rediscovery of the Great Epic of Gilgamesh. Henry Holt and Co, * Jacobsen, Thorkild (1976) The Treasures of Darkness, A History of Mesopotamian Religion, New Haven: Yale University Press, * West, Martin (1997) The East Face of Helicon: West Asiatic Elements in Greek Poetry and Myth, New York: Clarendon Press, == Other websites == * Translations for several legends of Gilgamesh in the Sumerian language can be found in Black, J.A., Cunningham, G., Fluckiger- Hawker, E, Robson, E., and Zólyomi, G., The Electronic Text Corpus of Sumerian Literature (http://www-etcsl.orient.ox.ac.uk/ ), Oxford 1998-. * Babylonian (Akkadian) texts: ETCSL ** Gilgamesh and Huwawa , version A - (the adventure of the cedar forest) ** Gilgamesh and Huwawa , version B ** Gilgamesh and the Bull of Heaven ** Gilgamesh and Aga ** Gilgamesh, Enkidu and the nether world ** The death of Gilgamesh * The Project Gutenberg eBook, An Old Babylonian Version of the Gilgamesh Epic, by Anonymous, Edited by Morris Jastrow, Translated by Albert T. Clay * Epic of Gilgamesh, summary by M. McGoodwin * Gilgamesh by Richard Hooker (wsu.edu) * The Epic of Gilgamesh: A Spiritual Biography (theosophy-nw.org) ;Tablets * Tablet XI (The Flood Chapter) ;Flood * Comparison of equivalent lines in six ancient versions of the flood story (noahs-ark-flood.com) * Comparison of The Epic of Gilgamesh to the Genesis flood (religioustolerance.org) * Comparison of the Flood in Genesis to the Epic of Gilgamesh and related literature (Christian-thinktank.com) Category:Mythology Category:Mesopotamia Category:Fiction books Category:8th- century BC books",
 "title": "Epic of Gilgamesh"
}