{
 "id": "918535",
 "text": "Nungthel Leima is a goddess in Meitei mythology and religion. She is an adopted daughter of God Koupalu (Koubru) and Goddess Kounu.Session, North East India History Association (1995). Proceedings of North East India History Association. The Association. p. 96. She is a wife of God Loyalakpa.Session, North East India History Association (1982). Proceedings of the North East India History Association. The Association. She is regarded as the deity of the Khunjahanba. She is one of the incarnations of Leimarel Sidabi. == Etymology == The name \"Thoudu Nungthel Leima\" (ꯊꯧꯗꯨ ꯅꯨꯡꯊꯦꯜ ꯂꯩꯃ, /tʰəu.du núŋ.tʰel lə́i.ma/) or \"Thoudu Nungthen Leima\" (ꯊꯧꯗꯨ ꯅꯨꯡꯊꯦꯟ ꯂꯩꯃ, /tʰəu.du núŋ.tʰen lə́i.ma/) is made up of three Meitei language words, \"Thoudu Nung\" (ꯊꯧꯗꯨ ꯅꯨꯡ, /tʰəu.du núŋ/), \"Thel\" (ꯊꯦꯜ, /tʰel/) or \"Then\" (ꯊꯦꯟ, /tʰen/) and \"Leima\" (ꯂꯩꯃ). In Meitei language (Manipuri language), \"Thoudu Nung\" (ꯊꯧꯗꯨ ꯅꯨꯡ, /tʰəu.du núŋ/) means stone. This term is typically used in poems and verses. In Meitei language (Manipuri language), \"Thel\" (ꯊꯦꯜ, /tʰel/) or \"Then\" (ꯊꯦꯟ, /tʰen/) means \"to display\" or \"to show\". In Meitei language (Manipuri language), \"Leima\" (ꯂꯩꯃ, /lə́i.ma/) means queen. The word \"Leima\" (ꯂꯩꯃ, /lə́i.ma/) itself is made up of two words, \"Lei\" (ꯂꯩ, /lə́i/) and \"Ma\" (ꯃ, /ma/). \"Lei\" (ꯂꯩ, /lə́i/) means land and \"Ma\" (ꯃ, /ma/) means mother. == Description == Goddess Thoudu Nungthel Leima is described as the deity of the Khunjahanba. \"Khunjahanba\" means \"the first villager\" or \"the first citizen of a place\". In Meitei language (Manipuri language), \"khunja\" (ꯈꯨꯟꯖꯥ, /kʰun.ja/) means \"a villager\". Morphologically, \"khunja\" (ꯈꯨꯟꯖꯥ, /kʰun.ja/) is divided into \"khun\" (ꯈꯨꯟ, /kʰun/) and \"-ja\" (ꯖꯥ, /ja/). \"Khun\" (ꯈꯨꯟ, /kʰun/) means \"village\" and \"-ja\" (ꯖꯥ, /ja/) literally means \"offspring\". In Meitei language (Manipuri language), \"Ahanba\" (ꯑꯍꯥꯟꯕ, /ə.han.bə/) means \"the first\" or \"the initial\". == Mythology == === Birth, adoption and naming === Goddess Leimarel Sidabi incarnated herself as a little girl and laid herself on a stone slab in the riverbed. On the very day, God Koubru and Goddess Kounu were walking on a nearby place. God Koubru got very thirsty. So, he went down the riverside to drink water. He found the girl on the river bed. Koubru shouted three times asking if there was anyone for the baby girl. Since no one responded, Koubru and Kounu brought the girl to their divine home. The girl was adopted as their own daughter. She was given three names. She was named \"Ipok Leima\" (\"Eepok Leima\") because she was found in the stream. She was also named \"Thoudu Nungthel Leima\" because she was found lying on the stone slab. She was given her final name as \"Taipang Nganpi\" (\"Taibang Nganbi\") because she was beautiful as well as bright. === Husband and suitor === Nungthel Leima is married to God Loyalakpa. However, she was once admired by God Khoriphaba. Once Khoriphaba was offered a chance by God Koubru to choose any lady of his own desire from the latter's place. Unfortunately, Goddess Nungthel Leima was chosen by Khoriphaba. But since Nungthel Leima was already married, God Koubru could not give Khoriphaba the chosen lady. Koubru did not want to take back his own words. So, he asked Khoriphaba to choose a lady once again but he should do it blindfolded. Blindfolded Khoiriphaba tried to choose but could not get Goddess Nungthel Leima. This event is enacted by the maibis in the Lai Haraoba festival till present times. == Festival == The sacred Lai Haraoba festival is annually celebrated in honor of goddess Thoudu Nungthel Leima, besides other deities. == Cults and Pantheons == On the 19th of January, 2018, a newly built temple to Ema Nungthel Leima was opened at Top Siphai by Oinam Lukhoi, the then MLA of Wangoi Assembly Constituency. During the ceremony, Oinam Lukhoi made a proposal to Manipur State Government to re-develop the existing sacred temples in the Wangoi AC, including other temples of goddess Nungthel Leima. == In popular culture == Nungthel Leima Tollomkhombada Thajaba is a book written by Naoroibam Khamba. It was released on the 17th of January, 2021. == Related pages == * Incarnations of Leimarel Sidabi * Khoriphaba == References == == Other websites == * Tensuba, Keerti Chand (1993). Genesis of Indian Tribes: An Approach to the History of Meiteis and Thais. Inter-India Publications. ISBN 978-81-210-0308-7. * Category:Meitei gods and goddesses Category:Leima Category:Gods and goddesses of beauty",
 "title": "Nungthel Leima"
}