{
 "id": "91866",
 "text": "Ghettos were originally separate, closed-off areas where Jewish people were forced to live, apart from everyone else. Today, it is common for the word ghetto to be used for describing any poverty-stricken urban area with a concentration of minority groups. ==Etymology== The word ghetto was first used in 1516 to describe the part of Venice, Italy where Jews had to live. The word has a few possible sources. It may come from the word getto, the Venetian word for foundry slag, because Jews were only allowed to live in the area around the iron foundries. It might also come from the Italian word borghetto, meaning a little borgo (borough).The New Oxford American Dictionary, Second Edition, Erina McKean, Oxford University Press, ==History== According to the Britannica: > One of the earliest forced segregations of Jews was in Muslim Morocco when, > in 1280, [Jews] were transferred to segregated [areas] called millahs. In > some Muslim countries, rigid ghetto systems were enforced with [limits] on > the sizes of houses and doors. However, these areas were not called \"ghettos\". That word was first used in 1516 to describe the Venetian Ghetto, where Christian watchmen stood guard to make sure no Jews left. Over the next 200 years, Jews were segregated into ghettos throughout Europe - in Rome, Prague, Frankfurt, and other cities. (The ghetto in Prague was called Judenstadt: \"Jew Town\".) By the 1800s, Jews were no longer legally required to live in ghettos. However, between the 1930s and 1945, Nazi Germany forced Jews to live in ghettos throughout Nazi-controlled parts of Europe. ===The Holocaust === See the main page: Ghettos in Europe during the Holocaust The Nazis established around 1,500 ghettos during the Holocaust and forced Jews to live there. Some Roma people, Greeks, and Soviets were also forced into Nazi ghettos.Nobody was allowed to leave the ghettos without special permission. Many (like the Warsaw Ghetto) were surrounded by walls or barbed wire. Tens of thousands of Jews died in ghettos from starvation, disease, freezing to death, and the terrible conditions. In some ghettos, one in every five people died. Eventually, the Nazis used the ghettos to collect people before deporting them to concentration camps. The Nazis liquidated nearly all of these ghettos before losing World War II in 1945. Sometimes \"liquidation\" meant sending everyone to concentration camps and shooting people who resisted. In other cases, the Nazis executed all of the people inside the ghetto. ==Related pages== * Antisemitism * Racial segregation * Ghettos in Europe during the Holocaust ==References== Category:Life Category:Racism Category:Ghettos Category:Society Category:Human rights Category:Antisemitism Category:The Holocaust Category:Discrimination Category:Antisemitism in Europe Category:Antisemitism in Germany",
 "title": "Ghetto"
}