{
 "id": "91870",
 "text": "ECW (which at one time stood for Extreme Championship Wrestling) was a professional wrestling brand of World Wrestling Entertainment (WWE), based on the independent Extreme Championship Wrestling promotion that lasted from 1992 to 2001. It started on June 13, 2006 with a weekly television series. The ECW brand was one of WWE's three brands, the other two being Raw and SmackDown. ==Show history== ===Original format=== WWE got Extreme Championship Wrestling and its video library in 2003 and later began reintroducing ECW through a series of DVDs and books. The big popularity of ECW merchandise made WWE organize ECW One Night Stand, an ECW reunion pay-per-view, in 2005. The financial and critical success of the event encourages WWE to start a second One Night Stand the next year. With new interest in the ECW product, WWE began exploring the possibility of restarting the promotion full-time. On May 26, 2006, WWE announced the start of ECW as a stand-alone brand, alongside Raw and SmackDown!, with its own show on the Sci Fi Channel. Despite worries that professional wrestling would not be accepted by the Sci Fi Channel's demographic, network President Bonnie Hammer said that she believed ECW would fit the channel's theme of \"stretching the imagination\". Sci Fi Channel is owned by NBCUniversal, parent company of USA Network and exclusive cable broadcaster of WWE programming at that time. The ECW brand directly tried to make itself feel different from WWE's other brands. The hard cameras were placed in a different location and the ring mat had an ECW logo on it. The male performers were also called \"Extremists\" instead of \"Superstars\", and female performers were called \"Vixens\" instead of\" Divas\". It also had the first ECW talent. Later however, changes were made to make it different from the original ECW promotion, including changing the original promotion's rules where weapons were legal in all matches and there were rarely any count outs or disqualifications. WWE had such matches fought under \"Extreme Rules\", and they were only fought when announced. The only pay-per-view event hosted exclusively by the ECW brand was December to Dismember in December 2006. On March 14, 2007, before another one could be scheduled, WWE announced that all future pay-per-views would feature all three brands. Former ECW owner Paul Heyman was the on-air \"ECW Representative\". According to an interview in the UK newspaper The Sun, Heyman wrote the brand's weekly scripts and gave them to writers for possible changes, and then Vince McMahon for final approval. After the December to Dismember event, Heyman was removed from both his on and off- air work with WWE. After Heyman left, there was no authority figure on ECW until August 14, 2007, when Armando Estrada was announced as the General Manager. ===ECW on Sci Fi=== ECW's weekly series was first given a thirteen episode run as a \"summer series\" on the Sci Fi Channel. The first episode got a 2.79 rating, making it the highest rated show on cable in its time slot. Because of its good ratings it was given an extended run through the end of 2007. On October 23, 2007, the network renewed the series through 2008. While the show started out a ratings success, fans of the original ECW criticised it early on. This was most evident by the negative crowd reaction \"old school\" fans gave the main event of Batista vs. Big Show at the August 1, 2006 episode from Hammerstein Ballroom. On October 16, 2007 a \"talent exchange\" was started between the SmackDown! and ECW brands, allowing their respective talent to appear on either brand. In February 2010, McMahon announced that ECW would be replaced by NXT. ===Online presence=== At ECW's launch, WWE.com introduced Hardcore Hangover, a video feature which allowed fans only in the United States to stream or download video footage from the weekly show. On October 16, 2007 it was replaced by a new feature which made full episodes of the show available for streaming on WWE.com the day after they were shown. After making a list of names from fans and conducting an online poll, the feature was named ECW X-Stream on October 31, 2007. ==Production== ECW brand shows were held in big arenas as a part of the SmackDown! brand's tuesday taping schedule. This was unlike the original Extreme Championship Wrestling, which held most of its events in smaller venues. The show usually aired live on Tuesdays, directly before – when touring the west coast – or after SmackDown! was taped, although it has been recorded and placed on a broadcast delay until later in the night depending on the circumstances. ECW's first theme song was \"Bodies\" by Drowning Pool, which had been used by WWE for ECW since before the brand was created. Since then the theme song has changed between a number of different songs before \"Don't Question My Heart\", sung by Saliva and Brent Smith was chosen. This was the show's last theme song. Starting with the January 22, 2008 version, ECW began broadcasting in HD, along with a new HD set, which was shared among all three WWE brands. ===Television Finale=== On February 2, 2010, WWE Chairman Vince McMahon announced that ECW would be going off the air and would be replaced with a new weekly program in its slot in what McMahon announced as \"the next evolution of WWE; the next evolution of television history.\" It was later announced that the show would air its final episode on February 16, 2010. On the February 4, 2010 episode of WWE Superstars, the new show's name was announced as WWE NXT. The ECW brand no longer existed, with every ECW wrestler becoming a free agent after the show ended. ===Special episodes=== Episode Title Date Rating Note Best of ECW 2006 December 26, 2006 1.4 Best of ECW 2007 December 25, 2007 0.9 ECW on SciFi 100th Episode Spectacular May 6, 2008 1.08 ==On-air personalities== ===Champions=== Championship Last champion Date won ECW Champion Ezekiel Jackson July 26, 2009 ===Authority figures=== Authority figures Position Date started Date finished Notes Vince McMahon Owner, Chairman, and CEO May 22, 2006 February 16, 2010 Paul Heyman Representative May 22, 2006 December 5, 2006 Armando Estrada General Manager August 14, 2007 June 3, 2008 Theodore Long General Manager June 3, 2008 April 7, 2009 Tiffany General Manager April 14, 2009 February 16, 2010 ===Commentators=== Commentators Date started Date finished Joey Styles, Tazz, Jim Ross, and Jerry Lawler June 7, 2006 Joey Styles and Elijah Burke November 14, 2006 Joey Styles and Tazz June 13, 2006 April 8, 2008 Mike Adamle and Tazz April 15, 2008 July 22, 2008 Todd Grisham and Tazz July 29, 2008 Todd Grisham and Matt Striker August 5, 2008 September 16, 2008 September 30, 2008 March 31, 2009 Jim Ross and Matt Striker September 23, 2008 Josh Mathews and Matt Striker April 7, 2009 October 20, 2009 Josh Mathews and Byron Saxton October 27, 2009 February 16, 2010 ===Ring announcers=== Ring announcers Date started Date finished Lilian Garcia June 7, 2006 Justin Roberts June 13, 2006 September 4, 2007 September 29, 2009 Tony Chimel September 11, 2007 September 22, 2009 November 24, 2009 December 8, 2009 Lauren Mayhew October 6, 2009 November 17, 2009 Savannah December 15, 2009 February 16, 2010 ===Recurring segments=== Segments Hosts Year(s) Notes Kelly's Exposé Kelly Kelly 2006 Striker's Classroom Matt Striker 2006–2007 Extreme Exposé Kelly Kelly, Layla, and Brooke Adams 2007 15 Minutes of Fame John Morrison 2007 The Dirt Sheet John Morrison and The Miz 2008–2009 The Peep Show Christian 2009–2010 The Abraham Washington Show Abraham Washington 2009–2010 ==International broadcasters== In addition to being broadcast on Syfy in the United States, ECW was broadcast on a number of channels in many different countries. Country Network Ref Algeria and The Middle East Showtime Argentina, Brazil, Chile, Costa Rica and Mexico FX Latin America Australia Fox8 Bangladesh, India, and Pakistan TEN Sports Cambodia MyTV Canada Global TV France Action Germany Sky Deutschland Italy Sky Italia Malaysia Astro Super Sport New Zealand The Box Philippines Jack TV Portugal SportTV 3 South Africa e.tv Taiwan Videoland Max-TV United Kingdom and Ireland Sky Sports 3 ==References== ==Related pages== * WWE NXT * WWE Raw * WWE SmackDown ==Other websites== * ECW at SciFi.com Category:2006 American television series debuts Category:2010 American television series endings Category:American television series Category:English-language television programs Category:World Wrestling Entertainment television programs",
 "title": "ECW (WWE)"
}