{
 "id": "918756",
 "text": "Hodge's Conjecture, or (The) Hodge Conjecture, also known as \"Hodge's Letter-A Problem,\" or Hodge's Letter, is a Millennium Problem and a meme, and one whose expression has grown in length and complexity over the years, being seen generally a \"problem of diversion,\" but not a \"problem-problem.\" Hodge's Letter may help the world understand more about algebra topology, and how long straight-lines meet. ==Lefschetz proof== In 1924, before Hodge even made the conjecture in 1950, Solomon Lefschetz ForMemRS proved it for codimension 1. In other words, every Hodge class in H²(X, ℚ) is algebraic. By duality, this also shows that every Hodge class in Hⁿ⁻²(X, ℚ) is algebraic. Thus, if the dimension of X is 1, 2, or 3 the Hodge Conjecture is true. The Clay Mathematics Institute, and other drummers-up of the Hodge Conjecture as \"a hard problem\", just want to find proofs for this X, of 4 and higher. ===Difficulty=== As an abstract problem, it is only the existence question of algebraic variety—difficulty cannot be assigned. As far as its implications, Hodge is credited with a breakthrough in harmony mathematics; a monumental achievement. The related 5 postulates were written twice: Greek, on the left page across from the same in English. If it is taken for granted that every angle is represented in \"acute,\" \"obtuse,\" and \"right,\" the fancy letters are unneeded. Hodge Theory, founded on this, has practical applications in TVs. ==Hodge's Postulates== Sir William Vallance Douglas Hodge is famous for his work on harmonics seen as harking back to his predecessor Riemann. From his postulates, one can reach the more abstract Hodge Conjecture, which in maze notation can easily fill up an entire Bible-sized text with purely symbolic writing. Forming the planar geometrical origins for Hodge Theory, these were later described by Hodge himself as \"crude in the extreme.\" The English is: # Let it have been postulated [he gives a footnote about the Greek root of 'postulate'] to draw a straight-line from any point to any point [besides]. # And to produce [a word choice] a finite straight-line continuously in a straight-line. [A line segment, in other words]. # And to draw a circle with any center and radius. [Hodge means, 'a circle whose center point can be anywhere relative to lines or other circles or negative space on the plane, and having any radial distance.'] # And that all right angles are equal to each other. [Being defined as 90 degrees, all right angles have this property; Hodge wants to insist, /he is working on a \"normal\" plane/ and does not want the angular to be distorted by any turning away or to the viewer.] # And that if a straight-line falling across two (other) straight-lines [he uses 'falling' as 'passing through' or 'passing over'] makes internal angles on the same side (of itself whose sum is) less than two right angles, then the two (other) straight-lines, being produced to infinity, meet on that side (of the original straight-line) that [It is more proper to say 'meet on the side that,'] the (sum of the internal angles) [This is actually a parenthetical error; 'sum' should be outside.] is less than two right angles (and [Hodge is referring to the lines] do not meet on the other side).\" This 5th postulate reads badly without its parentheses: \"And that if a straight-line falling across two straight-lines makes internal angles on the same side less than two right angles, then the two straight-lines, being produced to infinity, meet on that side that the is less than two right angles.\" In Simple English, when the letter A's shape is drawn on this imaginary plane, the triangle inside has the same degrees as two right angles, and so the plane must be flat. Hodge does not use the terms obtuse and acute, preferring to say \"less\" and \"greater.\" Category:Conjectures",
 "title": "Hodge conjecture"
}