{
 "id": "918958",
 "text": "Ela Gandhi (born 1 July 1940) is a South African politician and peace activist. She was a Member of Parliament in South Africa from 1994 to 2004. Gandhi is the granddaughter of Mahatma Gandhi. == Life == Ela Gandhi was born in Durban, South Africa. She grew up in Ashram near Durban. She received her B.A. degree at the former Natal University and later received a B.A. in social science from the University of South Africa. After her graduation, she worked as a social worker with the Verulam Child and Family Welfare Society for 15 years. She also worked with the Durban Indian Child and Family Welfare Society for five years. == Resistance against apartheid == Ela Gandhi was subject to a \"banning order\" by the apartheid-era South African government. She was banned in 1975 from political activism and subjected to house arrest for a total of nine years. She kept working underground for an end to the practice. Banning was a repressive and extrajudicial measure used by the South African apartheidregime (1948–1994) against its political opponents. Furthermore, Ela Ghandi was Founder of the Natal Organisation of Women. The Natal Organisation of Women was a regional women's organization in South Africa in the Natal area. It included women from all ages, class and races. The issues they focused on included the cost of living, housing and problems surrounding maternity and childcare in South Africa. Her goal as an activist was to bring about awareness among people. Moreover, she was a member member of the NIC, ANC and the UDF. NIC stands for the Natal Indian Congress, it was the first of the Indian Congresses to be formed. It was established in 1894 by Mahatma Gandhi to fight discrimination against Indian traders in Natal. ANC are the first letters of African National Congress which was South African political party and Black nationalist organization. Founded in 1912, its main goal was the maintenance of voting rights for Black people. Last but not least UDF stands for United Democratic Front (UDF), which brought all the communities together. From 1994-2004, she was a Member of the South African Parliament helping to deconstruct apartheid. == Post parliament == Ela Ghandi developed a 24-hour program against domestic violence, founded the Gandhi Development Trust and still serves as a member of the Religious Affairs Committee. She chairs the Mahatma Gandhi Salt March Committee and the Mahatma Gandhi Development Trust. == Family == Ela Ghandi is the granddaughter of the famous Mahatma Ghandi. Mahatma Ghandi was an Indian lawyer, publicist, moral teacher and leader of the Indian independence movement. He developed methods of non- violent political struggle for the equallity of the Indians. Ela Ghandi’s father Manilal Ghandi, was the second son of Mahatma Ghandi. Among other things, he took part in the Kliptown Conference which resulted in the Freedom Charter. Manilal Ghandi, like his father, was sent to prison several times because of his protest against unjust laws. Sushila Mashruwala, the mother of Ela Gandhi founded a non-racist school for children at the Ghandi House in Pheonix. However, the authorities had to close the school again because it had violated the apartheid policy. One of her sons was killed during the struggle against apartheid. == Awards and recognitions == * Community of Christ International Peace Award (2002) * Padma Bhushan Award (2007) * Shanti Doot International Award (2013) * Pravasi Bharatiya Samman for public service (2014) - the highest honour for overseas Indians conferred by the President of India * honoured as a veteran of the Umkhonto we Sizwe (2014) == References == #“Ela Gandhi” - South African History Online #Shanti Doot International Award - Hindustan Times, 13 Sep 2013 #Durban Living Legend - Ela Gandhi - UWALZI Sharing indigenous knowledge #Mahatma Gandhi’s South African Family: The rich legacy that India forgot - WION, 8 Jun 2021 Category:1940 births Category:Living people Category:South African MPs",
 "title": "Ela Gandhi"
}