{
 "id": "919117",
 "text": "Rhapsody in Blue is a 1999 American hand-drawn-animated short film produced by Walt Disney Feature Animation and written and directed by Eric Goldberg. Rhapsody in Blue premiered on June 18, 1999. ==Story== The short, which shows four individuals who wish for a better life. Duke is a construction worker who dreams of becoming a jazz drummer; Joe is a down-on-his-luck unemployed man who wishes he could get a job; Rachel is a little girl who wants to spend time with her busy parents instead of being shuttled around by her governess; and John is a harried rich husband who longs for a simpler, more fun life. The segment ends with all four getting their wish, though their stories interact with each other's without any of them knowing. It was set in New York City in 1932, and designed in the style of Al Hirschfeld's known caricatures of the time. ==Production== It originated in 1992 when director and animator, Eric Goldberg approached Al Hirschfeld about the idea of an animated short set to Gershwin's composition in the style of Hirschfeld's illustrations. Hirschfeld agreed to serve as animation consultant and allowed the animators to use and adapt his previous works for the short film. Goldberg's wife Susan was art director. Goldberg does allow the animators from the production hiatus of Kingdom of the Sun (which was reworked into The Emperor's New Groove) were reassigned to work on the short film. Duke is named after jazz artist Duke Ellington. The bottom of his toothpaste tube reads \"NINA\", an Easter egg referencing Hirschfeld's daughter Nina. John is based on animation historian and author John Culhane. Goldberg took Hirschfeld's original design of Gershwin and designed it to make him play the piano. Featured in the crowd emerging from the hotel are depictions of Brooks Atkinson, Hirschfeld, along with his wife Dolly Haas and Eric and Susan Goldberg. The segment was completed five months ahead of schedule from December 1998 to May 1999. Despite this, the sequence was so chromatically complex that the rendering process using the CAPS system delayed work on Tarzan. Category:Short movies",
 "title": "Rhapsody in Blue (short movie)"
}