{
 "id": "919297",
 "text": "Dummy tanks are real-size models that are made to look like real tanks. They are deceptive. Early models were simple: they were made of wood, or they were inflatable. It was easy to see that the tank wasn't real, when getting close. From a distance, it looked real, though. Modern designs are more advanced, and more difficult to detect. They have several purposes: * They can make enemy forces believe that they are real. These forces then get a wrong number of tanks that are in use, or they are made to believe a certain model of tank is used, when it isn't. * They can be used for training: One example is using them as a target for shooting practice, another one (which requires a partly- functional model) is for example to teach people how to drive tanks. * As of 2020, there are models that can trick radar systems. Unmanned aerial vehicles are usually better at detecting dummy tanks than real fighter aircraft. == World War I == During World War I, Allied forces used dummy versions of the British heavy tanks. These were constructed from a wooden framework and covered with painted Hessian cloth. The tracks were non-functional so some were fitted with concealed wheels underneath and were towed from place to place by a pair of horses. The Germans also constructed dummy tanks, that looked like Allied models. They used only a small number of real tanks, though. It is possible they were used in training, rather than for military deception. == World War II == During World War II, both the Allies and the Axis used dummy tanks more. Before the war started, German forces utilized mock tanks for practice and training exercises. Their use in military deception was pioneered by British forces, who called them \"spoofs\". One of the first uses of dummy tanks during the Second World War was in the North African Campaign. The Royal Engineers stationed there constructed two per day. Between April and June 1941, they were able to build three dummy Royal Tank Regiments, and another in November that same year. These were foldable, and could be moved easily. The Royal Engineers improved them further. Jeeps were used to make the \"spoofs\" more mobile: a steel frame covered with canvas was placed on them. This made a dummy tank that could move by itself. The Jeep did not realistically simulate the noise or movement of a tank, but allowed the dummy to be deployed quickly. The other direction was also done: Tanks were made to look like trucks. There was also a system to create simulated tank tracks or remove them. Inflatable dummies consisted of a fabric covering supported by a network of pressurized rubber tubes that formed a kind of \"pneumatic skeleton\". These were generally preferred in the field, despite their tendency to rapidly deflate if punctured by accident or shellfire. In one operation in September 1944, the British deployed 148 inflatable tanks close to the front line and around half were \"destroyed\" by fragments from German mortar and artillery fire, and by Allied bombs falling short. Dummy tanks were used in Operation Fortitude before the landings at the Normandy Beaches. During this operation, they were used to confuse German intelligence in two ways. First, they made it seem that the Allies had more tanks than they really did. Secondly, they were able to hide and downplay the importance of the location of their real tanks. The idea was to make it seem that the invasion would occur at Pas-de-Calais rather than at Normandy. However, dummy vehicles played only a small part of the overall deception plan. At that stage of the war, the Germans were unable to fly reconnaissance planes over England and such effort would have been wasted. Dummy landing craft were stationed at ports in eastern and southeastern England where they might be observed by the Germans but the Fortitude deception was largely carried out using double agents and false radio traffic. During Operation Shingle at Anzio, Italy, inflatable Sherman tanks were deployed when the real tanks were elsewhere. In the Pacific Theater of Operations, the Japanese also utilized decoys; one recorded instance was during the Battle of Iwo Jima. A \"tank\" was surrounded by American infantry, which had been under artillery bombardment: they found it was not real, but merely a sculpture carved out of volcanic ash. The Red Army employed dummy tanks to increase their apparent numbers and mask their true movements. == Modern era == During the Kosovo War, the Serbian army regularly placed dummy tanks in Kosovo. This led NATO forces believe that they were destroying far more tanks than they really were. The United States Army has developed a modern dummy tank. It imitates the M1 Abrams tank not only in appearance, but also in its heat signature, in order to appear real to infrared detectors. One of these can take fire from the enemy and still appear to be operational. This will delay the enemy by as much as an hour, as they are forced to destroy the decoy. These M1 decoys cost only $3,300, compared to $4.35 million for a real M1. The decoy is also practical: when disassembled, it weighs only , and is roughly the same size as a duffel bag. Its generator-- about the size of a televisionmake it easier to inflate, so that two people can install the decoy in a few minutes. Occasionally, real tanks carry a dummy on board, to deploy when needed. During the Battle of Mosul (2016–17), the Islamic State of Iraq and the Levant constructed and deployed wooden mockups of various vehicles in order to distract Coalition airstrikes. Dummy tanks, manufactured by the Czech company Inflatech, are also being used by the Armed Forces of Ukraine during the Russian invasion of Ukraine, in order to waste Russian resources by attracting missile and drone attacks. == References == Category:Tanks Category:Military tactics Category:Pages with unreviewed translations",
 "title": "Dummy tank"
}