{
 "id": "919289",
 "text": "Unit 731 was a unit of the Imperial Japanese Army that performed biological and chemical warfare research and development. Its members did deadly experiments on humans during the Second Sino-Japanese War (World War II). It was responsible for some of the most notorious war crimes committed by the armed forces of Imperial Japan. It has been called one of the worst atrocities in World War II. The unit was originally based in the Pingfang district of Harbin, the largest city in the puppet state of Manchukuo. The location changed in 1945, when the Soviet Union invaded in what would be known as the Soviet Invasion of Manchuria of 1945. It was active throughout China and Southeast Asia. Estimates say that up to half a million people were killed by Unit 731 and its related programs, on the orders of the camp's director Shirō Ishii. ==Establishment== Unit 731 was officially known as the Epidemic Prevention and Water Purification Department of the Kwantung Army. It was originally set up by the military police of the Empire of Japan. Later, Unit 731 was taken over and commanded until the end of the war by General Shirō Ishii, a combat medic officer in the Kwantung Army. The program received generous support from the Japanese government until the end of the war in 1945. Unit 731 and other units operated biological weapon production, testing, deployment, and storage facilities. They routinely conducted tests on human beings (who were internally referred to as \"logs\"). Additionally, biological weapons were tested in the field on cities and towns in China. ==Disestablishment== Unit 731 researchers arrested by Soviet forces were put on trial. However, members who were captured by the United States were secretly given immunity in exchange for the data gathered during their experiments.Hal Gold, Unit 731 Testimony, 2003, p. 109. The Americans co-opted the researchers' bioweapons information and experience for use in their own biological warfare program, much as they had done with German researchers in Operation Paperclip. Harris, S.H. (2002) Factories of Death. Japanese Biological Warfare, 1932–1945, and the American Cover-up, revised ed. Routledge, New York. == Recognition == In 2002 a Tokyo court admitted that Japan had engaged in germ warfare and killed thousands of Chinese civilians. This was the first time that the Japanese government had acknowledged this publicly. ==References== Category:Chemical warfare Category:Military of Japan Category:20th century in Japan Category:20th century in China Category:World War II Category:Second Sino-Japanese War Category:War crimes Category:Crimes against humanity Category:Crimes against prisoners of war",
 "title": "Unit 731"
}