{
 "id": "919303",
 "text": "The Lost City is a 2022 American action-adventure movie directed by The Nee Brothers. The brothers Oren Uziel and Dana Fox co-wrote the screenplay for the film from a story by Seth Gordon. The film stars Sandra Bullock, Channing Tatum, Daniel Radcliffe, Da'Vine Joy Randolph, and Brad Pitt. The project was announced in October 2020, with Bullock joining as producer and star and Tatum joining that December, while the rest of the cast was announced the following year. The filming took place in the Dominican Republic from May to August 2021. The movie had its world premiere at South by Southwest on March 12, 2022. It was released in the United States on March 25,2022, by Paramount Pictures. ==Plot== Loretta Sage is a grumpy middle-aged author who writes romance-adventure novels centered around a fictional hero named Dash McMahon, who is portrayed by cover model Alan Caprison. Her publisher, Beth, insists that she must embark on a book tour with Alan as an effort to get Loretta to go out more. After a disastrous start, mostly due to the popularity of Dash, Loretta is met by eccentric billionaire Abigail Fairfax. Fairfax realizes that Loretta has based her books on actual historic research she did with her deceased archaeologist husband. Fairfax has discovered a lost city on a remote Atlantic island and is convinced that this is the location of 'The Crown of Fire,' a priceless treasure. When Loretta does not help decipher an ancient map to the treasure, Fairfax, who fears the site will be destroyed by an active volcano, kidnaps Loretta and takes her to the island. Alan, who is secretly in love with Loretta, witnesses her kidnapping. He gets Jack Trainer, an ex-Navy SEAL turned CIA operative, to meet him at the island for a rescue attempt. Jack, with no assistance from Alan, breaches Fairfax's compound and frees Loretta, but is shot in the head before he, Loretta and Alan can make it to the airport, forcing the two to escape into the jungle. Loretta and Alan spend a day fighting off Fairfax's men before reaching a nearby village. when she hears a folk song from a local, Loretta decides that the crown is hidden in a sinkhole in the jungle. The pair are kidnapped again and forced to tell Fairfax. When they get there they discover the tomb of a queen, whose 'Crown of Fire' was made of red seashells gathered by her husband who is buried with her. The actual treasure of the legend wasn't a priceless jewel but the inseparable love between the king and queen. Fairfax is angry and forces them into the tomb as the volcano erupts, but one of his men has a change of heart and leaves a crowbar to help them escape before abandoning Fairfax on the island. Beth arrives with the local Coast Guard and Fairfax, who pretended to be stranded to get rescued, is arrested for his crimes. Loretta's next book, based on their adventures, is a hit, and she and Alan share a kiss while on vacation. In a mid-credits scene, Jack, having survived his assassination attempt, attends a yoga class alongside Loretta and Alan, surprising them. ==Cast== * Sandra Bullock as Loretta Sage / Angela, a frustrated yet depressed best-selling romance novelist. * Channing Tatum as Alan Caprison / Dash McMahon, a dimwitted cover model for Loretta's novel The Lost City of D. * Daniel Radcliffe as Abigail Fairfax, an eccentric billionaire and international criminal who kidnaps Loretta in order to find the lost city, on which her novel is based. * Da'Vine Joy Randolph as Beth Hatten, Loretta's publicist. * Patti Harrison as Allison, Loretta's social media manager. * Oscar Nuñez as Oscar, an eccentric cargo plane pilot. * Brad Pitt as Jack Trainer, human tracker and action man. Additionally, Raymond Lee appears as Officer Gomez, Bowen Yang as Ray the Moderator, and co-director Adam Nee as Officer Sawyer. ==References== Category:2022 action movies Category:2022 adventure movies Category:2022 romantic comedy movies Category:2020s American action movies Category:American adventure movies Category:American romantic comedy movies Category:Paramount Pictures movies Category:Movies set on islands Category:Movies about volcanoes",
 "title": "The Lost City"
}