{
 "id": "919512",
 "text": "This is a list of things created by Nickelodeon Animation Studios. This article contains a list of productions made by Nickelodeon Animation Studio, which is a part of Nickelodeon Networks and owned by Paramount Global. This list includes animated television series, shorts, specials and other projects. == Television series == # Title Creator(s) / Developer(s) Year(s) Co- production(s) Network Notes 1990s 1 Doug Jim Jinkins: Jim Jinkins, David Campbell, and Joe Aaron August 11, 1991–January 2, 1994 Jumbo Pictures Ellipse Programmé Nickelodeon Seasons 1–4 only; Disney acquired the series in 1996 and produced three more seasons, which aired on ABC. 2 Rugrats Arlene Klasky, Gábor Csupó, and Paul Germain August 11, 1991–August 1, 2004 Klasky Csupo 3 The Ren & Stimpy Show John Kricfalusi August 11, 1991–October 20, 1996 Spümcø (seasons 1–2) Nickelodeon (1991–95) MTV (1996) Oversaw the production of seasons 1–2, directly produced seasons 3–5 and credited as Games Animation Inc. 4 Rocko's Modern Life Joe Murray September 18, 1993–November 24, 1996 Joe Murray Productions Nickelodeon Credited as Games Animation Inc. 5 Aaahh!!! Real Monsters Gábor Csupó and Peter Gaffney October 29, 1994–December 6, 1997 Klasky Csupo 6 Hey Arnold! Craig Bartlett: Craig Bartlett, Joe Ansolabehere, and Steve Viksten October 7, 1996–June 8, 2004 Snee-Oosh, Inc. Credited as Games Animation Inc. for the first two seasons. 7 The Angry Beavers Mitch Schauer: Mitch Schauer and Keith Kaczorek April 19, 1997–August 27, 2006 Gunther-Wahl Productions, Inc. Nickelodeon (1998–2003) Nicktoons (2006) Credited as Games Animation Inc. for season 1 and Nicktoons for rest of its run. 8 CatDog Peter Hannan April 4, 1998–June 15, 2005 Peter Hannan Productions Nickelodeon (1998–2004) Nicktoons (2004–05) 9 The Wild Thornberrys Arlene Klasky, Gábor Csupó, Steve Pepoon, David Silverman, and Stephen Sustarsic September 1, 1998–June 11, 2004 Klasky Csupo Nickelodeon 10 SpongeBob SquarePants Stephen Hillenburg: Derek Drymon, Tim Hill, and Nick Jennings May 1, 1999–present United Plankton Pictures 11 Rocket Power Arlene Klasky and Gábor Csupó: Victor Wilson, Eryk Casemiro, Michael Bloom and Andy McElfresh August 16, 1999–July 30, 2004 Klasky Csupo 2000s 12 As Told by Ginger Emily Kapnek: Kate Boutilier and Eryk Casemiro October 25, 2000–November 14, 2006 Klasky Csupo Nickelodeon (2000–04) Nicktoons (2004–06) 13 The Fairly OddParents Butch Hartman March 30, 2001– July 26, 2017 Frederator Incorporated Billionfold Inc. (seasons 6–10) Nickelodeon (2001–16) Nicktoons (2017) 14 Invader Zim Jhonen Vasquez March 30, 2001–August 19, 2006 Nickelodeon (2001–02) Nicktoons (2006) 15 Action League Now! Robert Mittenthal, Will McRobb, and Albie Hecht November 18, 2001–February 10, 2002 Flying Mallet, Inc. Chuckimation Nickelodeon Spin-off of KaBlam!. 16 ChalkZone Bill Burnett and Larry Huber March 22, 2002–August 23, 2008 Frederator Incorporated 17 The Adventures of Jimmy Neutron, Boy Genius John A. Davis July 20, 2002–November 25, 2006 O Entertainment DNA Productions Follow-up to the film Jimmy Neutron: Boy Genius. First CGI series 18 All Grown Up! Arlene Klasky, Gábor Csupó, and Paul Germain : Kate Boutilier, Eryk Casemiro, and Monica Piper April 12, 2003–August 17, 2008 Klasky Csupo Spin-off of Rugrats. 19 My Life as a Teenage Robot Rob Renzetti: Rob Renzetti, Alex Kirwan, Joseph Holt, Jill Friemark, and Dan Krall August 1, 2003–May 2, 2009 Frederator Incorporated Nickelodeon (2003–05) Nicktoons (2008–09) 20 Danny Phantom Butch Hartman: Steve Marmel April 3, 2004–August 24, 2007 Billionfold Inc. Nickelodeon 21 Avatar: The Last Airbender Michael Dante DiMartino and Bryan Konietzko February 21, 2005–July 19, 2008 22 Catscratch Doug TenNapel July 9, 2005–February 10, 2007 23 The X's Carlos Ramos November 25, 2005–November 25, 2006 24 El Tigre: The Adventures of Manny Rivera Sandra Equihua and Jorge R. Gutierrez February 19, 2007 (sneak peek) March 3, 2007–September 13, 2008 Mexopolis Nickelodeon (2007–08) Nicktoons (2008) 25 Tak and the Power of Juju Avalanche Entertainment : Jed Spingarn, Nick Jennings, and Mitch Watson August 31, 2007–January 24, 2009 THQ Nickelodeon Based on the video game series of the same name. 26 Back at the Barnyard Steve Oedekerk September 29, 2007–November 12, 2011 Omation Animation Studio Nickelodeon (2007–10) Nicktoons (2011) Follow-up to the film Barnyard. 27 The Mighty B! Amy Poehler, Cynthia True, and Erik Wiese April 26, 2008–June 12, 2011 Paper Kite Productions Polka Dot Pictures Nickelodeon (2008–10) Nicktoons (2010–11) 28 Making Fiends Amy Winfrey October 4-November 1, 2008 Nicktoons Based on the web series of the same name. 29 The Penguins of Madagascar Tom McGrath and Eric Darnell : Mark McCorkle and Bob Schooley November 28, 2008–December 19, 2015 DreamWorks Animation Nickelodeon (2008–12) Nicktoons (2013–15) Based on Madagascar. 30 Fanboy & Chum Chum Eric Robles October 12, 2009–July 12, 2014 Frederator Studios Nickelodeon (2009–12) Nicktoons (2014) 2010s 31 Planet Sheen Keith Alcorn and Steve Oedekerk: Steven Banks October 2, 2010–February 15, 2013 Omation Animation Studio Nickelodeon (2010–11) Nicktoons (2012–13) Spin-off of The Adventures of Jimmy Neutron, Boy Genius. 32 T.U.F.F. Puppy Butch Hartman October 2, 2010–April 4, 2015 Billionfold Inc. Nickelodeon (2010–13) Nicktoons (2013–15) 33 Winx Club (revival) Iginio Straffi June 27, 2011–April 10, 2016 Rainbow S.p.A. Nickelodeon (2011–14) Nick Jr. Channel (2014–16) Seasons 5–7 and four specials were co-produced in- house at Nick Animation. 34 Kung Fu Panda: Legends of Awesomeness Ethan Reiff and Cyrus Voris : Peter Hastings September 19, 2011–June 29, 2016 DreamWorks Animation Nickelodeon (2011–14) Nicktoons (2016) Based on Kung Fu Panda. 35 The Legend of Korra Bryan Konietzko and Michael Dante DiMartino April 14, 2012–December 19, 2014 Ginormous Madman Nickelodeon (2012–14) Nick.com (2014) Sequel to Avatar: The Last Airbender. 36 Robot and Monster Dave Pressler, Joshua Sternin, and J.R. Ventimilia August 4, 2012–March 5, 2015 Smasho! Productions Lowbar Productions Nickelodeon (2012) Nicktoons (2013–15) Noggin (app) (2015) 37 Teenage Mutant Ninja Turtles (reboot) Kevin Eastman and Peter Laird : Ciro Nieli, Joshua Sternin, and J.R. Ventimilia September 28, 2012–November 12, 2017 Lowbar Productions Nickelodeon (2012–17) Nicktoons (2017) Reboot of the original 1987 animated series. 38 Monsters vs. Aliens Conrad Vernon and Rob Letterman : Mark McCorkle, Bob Schooley and Bret Haaland March 23, 2013–February 8, 2014 DreamWorks Animation Nickelodeon Based on the franchise of the same name. Distributed by 20th Century Fox Television. 39 Sanjay and Craig Jim Dirschberger, Jay Howell, and Andreas Trolf May 25, 2013–July 29, 2016 Forest City Rockers 40 Breadwinners Steve Borst and Gary \"Doodles\" DiRaffaele February 17, 2014–September 12, 2016 Titmouse, Inc. Nickelodeon (2014–15) Nicktoons (2016) 41 Harvey Beaks C. H. Greenblatt March 28, 2015–December 29, 2017 Nickelodeon (2015–16) Nicktoons (2017) 42 Pig Goat Banana Cricket Dave Cooper and Johnny Ryan July 16, 2015–August 11, 2018 Nickelodeon (2015–16) Nicktoons (2016–18) 43 The Loud House Chris Savino May 2, 2016–present Nickelodeon 44 Bunsen Is a Beast Butch Hartman January 16, 2017–February 10, 2018 Billionfold Inc. Nickelodeon (2017) Nicktoons (2017–18) 45 Welcome to the Wayne Billy Lopez July 24, 2017–May 31, 2019 Yowza! Animation Nickelodeon (2017) Nicktoons (2018–19) Based on the web series of the same name. Produced by the New York studio. 46 The Adventures of Kid Danger Dan Schneider January 15-June 14, 2018 Powerhouse Animation Studios Schneider's Bakery Nickelodeon Animated spin-off of Henry Danger. Final series produced in association with Schneider's Bakery. 47 Rise of the Teenage Mutant Ninja Turtles Kevin Eastman and Peter Laird : Andy Suriano and Ant Ward July 20, 2018–August 7, 2020 Nickelodeon (2018–19) Nicktoons (2019–20) Second reboot of the original 1987 animated series. 48 Pinky Malinky Chris Garbutt and Rikke Asbjoern January 1-July 17, 2019 Jam Filled Entertainment Netflix Originated as a Cartoon Network-rejected pilot. Originally planned to air on Nickelodeon, it was later released on Netflix. 49 Middle School Moguls Gina Heitkamp and Jenae Heitkamp September 2-29, 2019 Gengirl Media Nickelodeon Miniseries. 50 The Casagrandes Chris Savino and Miguel Puga : Michael Rubiner and Miguel Puga October 14, 2019–September 30, 2022 Spin-off of The Loud House. 2020s 51 It's Pony Ant Blades January 18, 2020–May 26, 2022 Blue Zoo Animation Studio Nickelodeon (2020) Nicktoons (2021–22) 52 Glitch Techs Eric Robles and Dan Milano February 21–August 17, 2020 Netflix Originally planned to air on Nickelodeon, it was later released on Netflix. 53 Kamp Koral: SpongeBob's Under Years Stephen Hillenburg : Vincent Waller, Marc Ceccarelli, Mr. Lawrence, Kaz, Luke Brookshier and Andrew Goodman March 4, 2021–July 10, 2024 United Plankton Pictures Paramount+ Spin-off of SpongeBob SquarePants. Released on Paramount+ and later on Nickelodeon. 54 Rugrats (reboot) Arlene Klasky, Gábor Csupó and Paul Germain May 27, 2021–March 22, 2024 Klasky Csupo Paramount+ (2021–23) Nicktoons (2024) Reboot of the original 1991 animated series. Released on Paramount+ and later on Nickelodeon. 55 The Patrick Star Show Stephen Hillenburg : Luke Brookshier, Marc Ceccarelli, Andrew Goodman, Kaz, Mr. Lawrence and Vincent Waller July 9, 2021–present United Plankton Pictures Nickelodeon Second spin-off of SpongeBob SquarePants. 56 Middlemost Post John Trabbic III: Dave H. Johnson and John Trabbic III July 9, 2021–October 21, 2022 Yowza! Animation 57 Star Trek: Prodigy Gene Roddenberry Kevin and Dan Hageman October 28, 2021–July 1, 2024 Secret Hideout Roddenberry Entertainment Brothers Hageman Productions CBS Eye Animation Productions Paramount+ (2021–22) Nickelodeon (2021–22) Netflix (2024) Based on the Star Trek franchise. Released on Paramount+ and later on Nickelodeon for season 1. 58 Big Nate Lincoln Peirce : Mitch Watson February 17, 2022–August 26, 2024 John Cohen Productions Paramount+ Nickelodeon Based on the comic strip series of the same name. Released on Paramount+ and later on Nickelodeon. 59 Monster High Garrett Sander Mattel : Shea Fontana October 6, 2022–October 24, 2024 Mattel Television Nickelodeon Based on the toyline of the same. 60 Transformers: EarthSpark Hasbro : Dale Malinowski, Ant Ward and Nicole Dubuc November 11, 2022–present Entertainment One (season 1) Hasbro Entertainment (season 2–present) Paramount+ Nickelodeon Based on the toyline of the same name. 61 Rock Paper Scissors Kyle Stegina and Josh Lehrman February 12, 2024–present Nickelodeon 62 The Fairly OddParents: A New Wish Butch Hartman : Daniel Abramovici, Ashleigh Crystal Hairston, Lindsay Katai and Dave Stone May 20, 2024–present FredFilms Billionfold Inc. Sequel to The Fairly OddParents. 63 Tales of the Teenage Mutant Ninja Turtles Kevin Eastman and Peter Laird : Christopher Yost and Alan Wan August 9, 2024–present Point Grey Pictures Paramount+ Follow-up to the film Teenage Mutant Ninja Turtles: Mutant Mayhem. 64 Max & the Midknights Lincoln Pierce : Sharon Flynn and David Skelly October 30, 2024–present Jane Startz Productions Nickelodeon Based on the children's book series of the same name. Upcoming 65 Wylde Pak Paul Watling and Kyle Marshall Summer 2025 Nickelodeon 66 Avatar: Seven Havens Michael Dante DiMartino and Bryan Konietzko TBA Avatar Studios Sequel to The Legend of Korra === Anthology series === # Title Creator Years Co-production(s) Network Notes 67 KaBlam! Robert Mittenthal, Will McRobb, and Chris Viscardi October 11, 1996–May 27, 2000 Flying Mallet, Inc. Nickelodeon 68 Oh Yeah! Cartoons Fred Seibert July 19, 1998–August 30, 2002 Frederator Incorporated 69 Nicktoons Film Festival September 1, 2004–November 20, 2009 Nicktoons 70 Random! Cartoons December 6, 2008–December 20, 2009 === Nick Jr. shows === # Title Creator(s) / Developer(s) Years Co-production(s) Network Notes 1990s 71 Blue's Clues (original series) Traci Paige Johnson, Todd Kessler, and Angela Santomero September 8, 1996–August 6, 2006 Out of the Blue Enterprises Nickelodeon Produced by Nick Digital. First Nickelodeon animated show made for Nick Jr. 72 Little Bill Bill Cosby and Varnette P. Honeywood : Fracaswell Hyman November 28, 1999–August 6, 2004 Smiley, Inc. Produced by Nick Digital. 2000s 73 Dora the Explorer Chris Gifford, Valerie Walsh Valdes, and Eric Weiner August 14, 2000–June 5, 2014; July 7–August 9, 2019 Nickelodeon Co-produced with the New York studio. 74 Oswald Dan Yaccarino: Lisa Eve Hubman and Dan Yaccarino August 20, 2001–September 19, 2003 HIT Entertainment 75 The Backyardigans Janice Burgess October 11, 2004–July 12, 2013 Nelvana 76 Go, Diego, Go! Chris Gifford and Valerie Walsh Valdes September 6, 2005–September 16, 2011 Spin-off of Dora the Explorer. Co-produced with the New York studio. 77 Wonder Pets! Josh Selig March 3, 2006–October 17, 2016 Little Airplane Productions Nickelodeon (2006–2011) Nick Jr. Channel (2009–2016) 78 Ni Hao, Kai-Lan Karen Chau: Mary Harrington, Karen Chau, Judy Rothman, and Sascha Paladino February 7, 2008–August 21, 2011 Harringtoons Productions Nickelodeon Nick Jr. Channel 2010s 79 Team Umizoomi Soo Kim, Michael T. Smith, and Jennifer Twomey January 25, 2010–April 24, 2015 Curious Pictures Nickelodeon Nick Jr. Channel 80 Bubble Guppies Jonny Belt and Robert Scull January 24, 2011–June 30, 2023 Wildbrain Entertainment (season 1) Nelvana (seasons 2–4) Jam Filled Toronto (seasons 5–6) Nickelodeon Co-produced with the New York studio. 81 Wallykazam! Adam Peltzman February 3, 2014–September 9, 2017 Nickelodeon (2014–2016) Nick Jr. Channel (2016–2017) Produced by the New York studio. 82 Dora and Friends: Into the City! Chris Gifford and Valerie Walsh Valdes August 18, 2014–February 5, 2017 Nickelodeon Second spin-off and sequel to Dora the Explorer. Produced by the New York studio. 83 Blaze and the Monster Machines Jeff Borkin and Ellen Martin: Clark Stubbs, Jeff Borkin and Ellen Martin October 13, 2014–present Nerd Corps Entertainment (season 1) WildBrain Studios (season 2–present) Nickelodeon Nick Jr. Channel 84 Fresh Beat Band of Spies Nadine van der Velde and Scott Kraft: Michael Ryan June 15, 2015–February 24, 2016 Nelvana 6point2 Nickelodeon (2014) Nick Jr. Channel (2015–2016) Animated spin-off of The Fresh Beat Band. 85 Shimmer and Shine Farnaz Esnaashari-Charmatz August 24, 2015–February 9, 2020 Nickelodeon (2015–2018) Nick Jr. Channel (2018–2020) 86 Nella the Princess Knight Christine Ricci February 6, 2017–July 20, 2021 Brown Bag Films Nickelodeon (2017) Nick Jr. Channel (2018–2019) Paramount+ (2021) 87 Sunny Day Abie Longstaff: Paula Rosenthal August 21, 2017–March 1, 2020 Pipeline Studios Silvergate Media Nickelodeon (2017–2019) Nick Jr. Channel (2017–2019) Amazon Prime Video (2020) 88 Butterbean's Café Jonny Belt and Robert Scull November 12, 2018–November 1, 2020 Brown Bag Films Nickelodeon Nick Jr. Channel Co-produced with the New York studio. 89 Blue's Clues & You! Traci Paige Johnson, Todd Kessler, and Angela Santomero: Traci Paige Johnson and Angela Santomero November 12, 2019–present 9 Story Media Group Brown Bag Films Nickelodeon (2019–2023) Nick Jr. Channel (2023–2024) YouTube (2024–present) Reboot of Blue's Clues. 2020s 90 Santiago of the Seas Niki Lopez, Leslie Valdes, and Valerie Walsh Valdes October 9, 2020–July 27, 2023 Walsh Valdés Productions (season 1) Nickelodeon (2020–2023) Nick Jr. Channel (2023) 91 Baby Shark's Big Show! Pinkfong: Whitney Ralls, Gary \"Doodles\" DiRaffaele and Tommy Sica December 11, 2020–present SmartStudy Pinkfong Nickelodeon (2020–2023) Nick Jr. Channel (2024–present) 92 Face's Music Party Nickelodeon: Jonas Morganstein and David Kleiler June 3, 2022–December 11, 2023 Jonas & Co. Nickelodeon 93 The Tiny Chef Show Rachel Larsen, Adam Reid and Ozlem Akturk September 9, 2022–present Imagine Kids+Family Dunshire Productions Factory (season 1) ShadowMachine (season 2–present) Tiny Chef Productions 94 Bossy Bear David Horvath and Sun-Min Kim : Jason Hopley and Jeff D'Elia March 6, 2023–present Imagine Kids+Family Renegade Animation 95 Dora Chris Gifford, Valerie Walsh Valdes, and Eric Weiner Chris Gifford and Valerie Walsh Valdes April 12, 2024–present Little Coop Walsh Valdés Productions Pipeline Studios Paramount+ Reboot of Dora the Explorer. 96 Wonder Pets: In The City Josh Selig : Jennifer Oxley December 13, 2024–present Snowflake Films NYC Kavaleer Productions Apple TV+ Revival to Wonder Pets!. Released on Apple TV+. 97 Super Duper Bunny League Jamie Smart: Jonny Belt and Robert Scull April 19, 2025 Scull + Belt Gigglebug Entertainment Nickelodeon Based on the comic book series of the same name. 98 Tim Rex in Space Mint Copenhagen May 5, 2025 JAM Media Milkshake! Mint Copenhagen This is the first global co-production with Channel 5 Broadcasting Limited.https://hollywoodreporter.com/tv/tv-news/dinosaurs-tim- rex-in-space-nickelodeon-milkshake-paramount-1235944376/ Upcoming 99 HexVets and Magic Pets Sam Davies : Nicole Dubuc Summer 2025 Boom! Studios TeamTO Pipeline Studios Based on the graphic novel series of the same name. === Other Paramount networks === Title Network Creator(s) / Developer(s) Years Co- production(s) Notes Play with Me SesamePlay with Me Sesame credits. Credit for Nick Digital appears at 0:12 seconds. Noggin Joan Ganz Cooney and Lloyd Morrisett : Jocelyn Hassenfeld and Karen Kuflik 2002–07 Sesame Workshop Nick Digital created the animated graphics for this series. Stripperella Spike TV Stan Lee 2003–04 The Firm, Inc. Nick Digital is credited for the CGI animation. Fatherhood Nick at Nite Bill Cosby and Charles Kipps 2004–05 Smiley, Inc. === Digital short series === Title Creator(s) / Developer(s) Years Co-production(s) Notes Nick Jr. Just for Me Stories 2001 Released on television and nickjr.com. Produced by Nick Digital. Welcome to the Wayne (web shorts) Billy Lopez 2014 Yowza! Animation Released on Nick.com. Bug Salad Carl Faruolo 2018 Released on YouTube. Mr. Sheep & Sleepy Bear Alan Foreman Space Kid and Cat Greg Nix and David Kantarowicz MooseBox Mike Scott 2019 Kinderwood Otto Tang 2020–21 Titmouse, Inc. Released on Noggin. === Short pilots === ==== Nickelodeon (greenlit to series) ==== Title Episode Creator(s) / Developer(s) Year Co- production(s) Notes Rugrats \"Tommy Pickles and the Great White Thing\" Arlene Klasky, Gábor Csupó, and Paul Germain 1990 Klasky Csupo Ren & Stimpy \"Big House Blues\" John Kricfalusi Carbunkle Cartoons Spümcø Doug \"Doug Can't Dance\" Jim Jinkins Jumbo Pictures Rocko's Modern Life \"Trash-O-Madness\" Joe Murray 1992 Joe Murray Studios Company Aaahh!!! Real Monsters N/A Gábor Csupó and Peter Gaffney 1993 Klasky Csupo Psyched for Snuppa Michael Pearlstein Stretch Films, Inc. Jumbo Pictures Pilot for the KaBlam! segment Sniz & Fondue. Arnold Craig Bartlett 1994 Later screened theatrically during the release of Harriet the Spy in 1996. Greenlit as Hey Arnold!. The Angry Beavers \"Snowbound\" Mitch Schauer Gunther- Wahl Productions, Inc. CatDog \"Dog Gone\" Peter Hannan 1995 Peter Hannan Productions SpongeBob SquarePants \"Help Wanted\" Stephen Hillenburg 1997 ChalkZone N/A Bill Burnett and Larry Huber 1998 Frederator Incorporated Aired as part of Oh Yeah! Cartoons. The Wild Thornberrys Arlene Klasky, Gábor Csupó, Steve Pepoon, David Silverman, and Stephen Sustarsic Klasky Csupo The Fairly OddParents! Butch Hartman Frederator Incorporated Aired as part of Oh Yeah! Cartoons. Jimmy Neutron: Boy Genius \"Runaway Rocketboy!\" John A. Davis O Entertainment DNA Productions First Nicktoon based on a feature-length movie. Greenlit as The Adventures of Jimmy Neutron, Boy Genius. As Told by Ginger \"The Party\" Emily Kapnek Klasky Csupo Rocket Beach N/A Arlene Klasky and Gabor Csupo Klasky Csupo Greenlit as Rocket Power. My Neighbor Was a Teenage Robot Rob Renzetti 1999 Frederator Incorporated Aired as part of Oh Yeah! Cartoons. Greenlit as My Life as a Teenage Robot. Invader Zim Jhonen Vasquez Wumberlog Productions All Growed Up Arlene Klasky, Gábor Csupó, and Paul Germain 2001 Klasky Csupo Greenlit as All Grown Up!. Danny Phantom Butch Hartman 2003 Billionfold Inc. Avatar: The Last Airbender Michael Dante DiMartino and Bryan Konietzko 2004 Catscratch Doug TenNapel El Tigre \"A Fistful of Nickels\" Sandra Equihua and Jorge R. Gutierrez 2005 The X's N/A Carlos Ramos Super Scout Cynthia True and Amy Poehler 2006 Frederator Incorporated Polka Dot Pictures Paper Kite Productions Aired as part of Nicktoons Film Festival. Greenlit as The Mighty B!. Umizumiz Soo Kim, Michael T. Smith and Jennifer Twomey Greenlit as Team Umizoomi. Fanboy Eric Robles 2008 Frederator Incorporated Aired as part of Random! Cartoons. Greenlit as Fanboy & Chum Chum. T.U.F.F. Puppy Butch Hartman Billionfold Inc. Planet Sheen Keith Alcorn and Steve Oedekerk 2010 O Entertainment Omation Animation Studio Pig Goat Banana Mantis! Dave Cooper and Johnny Ryan 2012 Nick Cross Animation Greenlit as Pig Goat Banana Cricket. Breadwinners Steve Borst and Gary Doodles Released as part of Nickelodeon's 2012 animated shorts program. Bad Seeds C. H. Greenblatt 2013 Released as part of Nickelodeon's 2013 animated shorts program. Greenlit as Harvey Beaks. The Loud House Chris Savino Released as part of Nickelodeon's 2013 animated shorts program. \"The Loudest Mission: Relative Chaos\" 2017 Pilot for The Casagrandes. Rock, Paper, Scissors \"TV Time\" Kyle Stegina and Josh Lehrman 2023 Released as part of Nickelodeon's Intergalactic shorts program. Wylde Pak Paul Watling and Kyle Marshall 2025 ==== Nickelodeon (not greenlit to series) ==== Title Creator(s) / Developer(s) Year Co-production(s) Notes Christmas in Tattertown Ralph Bakshi 1988 Bakshi Animation Originally was a pilot for a show named Tattertown. Eventually shown on Nickelodeon as a Christmas special until 1992. The Crowville Chronicles Brian Cosgrove 1990 Cosgrove Hall Films Trash Big Beast Quintet Joey Ahlbum and Marc Catapano Ahlbum Animation, Inc. Thunder Lizards The Weasel Patrol Ken Macklin and Lela Dowling Mark Zander Productions The Louie & Louie Show Gary Baseman 1993 Curious Pictures Aired as part of KaBlam!. Kid Komet and Galaxy Gal Bob Camp and Jim Gomez 1997 Hector the Get- Over Cat John R. Dilworth 1998 Stretch Films, Inc. The Carmichaels Arlene Klasky and Gábor Csupó 1999 Klasky Csupo Originally planned as a spin-off of Rugrats, it was eventually made into A Rugrats Kwanzaa. The Proud Family Bruce W. Smith Hyperion Animation Later picked up as a series by Disney Channel. Simply Sisters Mitch Schauer Gunther-Wahl Productions, Inc. Planned spin-off of The Angry Beavers. Stewy the Dog Boy Dennis Messner Flying Mallet, Inc. Aired as part of KaBlam!. Terrytoons Presents: Crubside\"Terrytoons\" Pilot - YouTube Paul Terry and Frank Moser : Mary Harrington and Robert Taylor Planned Terrytoons reboot for the network. Garbage Boy Produced by Nick Digital. Constant Payne Micah Wright 2001 Psyko Ferret Atul Rao, Kim Saltarski, and Greg van Riel: Atul Rao, Kim Saltarski, Greg van Riel, Karen Krenis, Brian Strause, Emily Kapnek, and Paul Greenberg Klasky Csupo Skeleton Key Andi Watson Slave Labor Graphics Sunbow Entertainment Crash Nebula Butch Hartman and Steve Marmel 2004 Frederator Incorporated Planned spin-off of The Fairly OddParents. The Patakis Craig Bartlett Snee-Oosh, Inc. Planned spin-off of Hey Arnold! What's Cooking? Arlene Klasky Klasky Csupo Chicken Town Niko Meulemans 2005 Commander Bunsworth Aglaia Mortcheva Junkyard Teddies Arlene Klasky Kung Fu Spy Troll David Fremont Rollin' Rock Starz Gábor Csupó Klasky Csupo SCHMUTZ James Proimos and David Hale Wiener Squad Niko Meulemans Zeek & Leo Ace Bogart: Space Ape Neal Sopata 2006 Big Babies Arlene Klasky Eggheads Grampa and Julie: Shark Hunters Jef Czekaj Little Freaks Erin Ehrlich My Stupid Cat Everett Peck Ricky Z Arlene Klasky Ronnie Biddles John Matta and Ken Daly The Modifyers Lynne Naylor and Chris Reccardi 2007 Aired as part of Shorts in a Bunch. Adventure Time Pendleton Ward 2008 Frederator Incorporated Aired as part of Random! Cartoons. Later picked up as a series by Cartoon Network. Mall Spies Al Madrigal Space Animals Fabrice Sénia Planktoon Studios The Bravest Warriors Pendleton Ward 2009 Frederator Incorporated Aired as part of Random! Cartoons. Later picked up as a series by Cartoon Hangover and VRV. Leroy Dorsalfin Mike Geiger Mike Geiger Animation Star and the Forces of Evil Daron Nefcy Later picked up as a series by Disney XD and Disney Channel. Super Macho Fighter Jorge R. Gutierrez 2012 Mexopolis Level 15 Wolf-Rüdiger Bloss Sky Rat Craig Bartlett 2013 Snee-Oosh, Inc. Crazy Block Iginio Straffi 2014 Rainbow S.p.A. (co-owned by Viacom) Harpy Gee Brianne Drouhard Planet Panic Gene Goldstein 2018 ==== Produced for other Paramount-owned networks ==== Title Creator(s) / Developer(s) Year Co-production(s) Network Status Notes Sugarless Arlene Klasky Erin Ehrlich 2005 Klasky Csupo Noggin/The N Failed Twinkle Dora Nagy Nick Jr. Chickiepoo and Fluff: Barnyard Detectives 2007 Noggin Produced by Nick Digital == TV movies and specials == === Broadcast releases === # Title Year Co- production(s) Notes 1 Globehunters: An Around the World in 80 Days Adventure 2000 DIC Entertainment Frederator Incorporated Originally planned to premiere in 2000, the film eventually premiered as part of Nickelodeon Sunday Movie Toons in December 2002. 2 The Electric Piper Frederator Incorporated Originally planned to premiere in 2000, the film eventually premiered in 2003. 3 Maniac Magee 2003 Edmonds Entertainment Visual effects by Nick Digital 4 The Alan Brady Show Produced by Nick Digital 5 Holly Hobbie & Friends 2006–07 American Greetings Miniseries of animated specials 6 Winx Club: The Secret of the Lost Kingdom (Nickelodeon version) 2012 Rainbow S.p.A. Nickelodeon produced edited versions of these Winx Club movies. The plots were changed slightly, and the movies were re-dubbed to use the voice cast from the Nickelodeon revival of the series. 7 Winx Club: Magical Adventure (Nickelodeon version) 2013 8 Half-Shell Heroes: Blast to the Past 2015 Special based on Teenage Mutant Ninja Turtles toy line Half-Shelf Heroes. 9 Albert 2016 10 Hey Arnold!: The Jungle Movie 2017 Snee-Oosh, Inc. Sequel to Hey Arnold!: The Movie and The Journal. Revival film and series finale of Hey Arnold!. 11 Lucky 2019 12 Baby Shark's Big Movie! 2023 Pinkfong Released simultaneously on Nickelodeon and Paramount+. 13 No Time to Spy: A Loud House Movie 2024 N/A Released simultaneously on Nickelodeon and Paramount+. === Digital releases === # Title Release date Co- production(s) Notes 1 Rocko's Modern Life: Static Cling 2019 Joe Murray Productions Revival special of Rocko's Modern Life. Originally planned to air on Nickelodeon, it was later released on Netflix. 2 Invader Zim: Enter the Florpus Maven Animation Studio Revival film of Invader Zim. Originally planned to air on Nickelodeon, it was later released on Netflix. 3 The SpongeBob Movie: Sponge on the Run 2020 Paramount Animation Nickelodeon Movies United Plankton Pictures MRC Distributed by Paramount+ and premium VOD services in the U.S. in 2021. Released on Netflix worldwide on November 5, 2020. Originally planned for a summer 2020 theatrical release, but moved to streaming due to the COVID-19 pandemic. Released in Canadian theaters on August 14, 2020. 4 The Loud House Movie 2021 Nickelodeon Movies Originally planned for a 2020 theatrical release, it was later released on Netflix. 5 Rise of the Teenage Mutant Ninja Turtles: The Movie 2022 Released on Netflix. 6 Blue's Big City Adventure Nickelodeon Movies 9 Story Media Group Brown Bag Films Line By Line Media Boxel Animation Released on Paramount+. 7 Baby Shark's Big Movie! 2023 Pinkfong Released simultaneously on Nickelodeon and Paramount+. 8 The Casagrandes Movie 2024 Nickelodeon Movies Mighty Studios Released on Netflix. 9 No Time to Spy: A Loud House Movie N/A Released simultaneously on Nickelodeon and Paramount+. 10 Saving Bikini Bottom: The Sandy Cheeks Movie Nickelodeon Movies United Plankton Pictures Released on Netflix. 11 Plankton: The Movie 2025 Released on Netflix. === Direct-to-video === All the films (except the international release of Charlotte's Web 2: Wilbur's Great Adventure) were distributed to home video by Paramount Home Entertainment. # Title Release date Co-production(s) Notes 1 Blue's Big Musical Movie 2000 2 Charlotte's Web 2: Wilbur's Great Adventure 2003 Universal Pictures Universal Cartoon Studios Paramount Pictures 3 As Told by Ginger: The Wedding Frame 2004 Klasky Csupo Series finale of As Told by Ginger. Originally planned to air on television, it was later released on VHS and DVD instead in the United States. 4 Rugrats Tales from the Crib: Snow White 2005 5 Rugrats Tales from the Crib: Three Jacks and a Beanstalk 2006 == Theatrical films == All the films are distributed by Paramount Pictures. # Title Release date Co-production(s) Budget Gross Rotten Tomatoes Metacritic 1 The Rugrats Movie Nickelodeon Movies Klasky Csupo $24,000,000 $140,894,675 59% 62 2 Rugrats in Paris: The Movie Nickelodeon Movies Klasky Csupo $30,000,000 $103,291,131 76% 62 3 Jimmy Neutron: Boy Genius Nickelodeon Movies O Entertainment DNA Productions $30,000,000 $102,992,536 74% 65 4 Hey Arnold!: The Movie Nickelodeon Movies Snee-Oosh, Inc. $3–4,000,000 $15,249,308 29% 47 5 The Wild Thornberrys Movie Nickelodeon Movies Klasky Csupo $25,000,000 $60,694,737 80% 69 6 Rugrats Go Wild Nickelodeon Movies Klasky Csupo $55,405,066 39% 38 7 The SpongeBob SquarePants Movie Nickelodeon Movies United Plankton Pictures $30,000,000 $140,161,792 68% 66 8 Barnyard Nickelodeon Movies O Entertainment $51,000,000 $116,755,080 22% 42 9 The SpongeBob Movie: Sponge Out of Water Nickelodeon Movies Paramount Animation United Plankton Pictures $74,000,000 $323,400,000 80% 62 10 Wonder Park Nickelodeon Movies Paramount Animation Ilion Animation Studios $100,000,000 $119,559,110 34% 45 11 The SpongeBob Movie: Sponge on the Run Nickelodeon Movies Paramount Animation United Plankton Pictures MRC $60,000,000 $4,810,790 68% 63 12 Teenage Mutant Ninja Turtles: Mutant Mayhem Nickelodeon Movies Point Grey Pictures $70,000,000 $179,311,239 96% 74 13 The SpongeBob Movie: Search for SquarePants Nickelodeon Movies United Plankton Pictures MRC 14 The Legend of Aang: The Last Airbender Nickelodeon Movies Avatar Studios 15 Untitled Teenage Mutant Ninja Turtles: Mutant Mayhem sequel Nickelodeon Movies Point Grey Pictures == References == category:Lists of movies Category:Television lists Category:Nickelodeon",
 "title": "List of Nickelodeon Animation Studio productions"
}