{
 "id": "919552",
 "text": "Neil Swarbrick is an English retired football referee who officiated primarily in the Premier League having been promoted to the Select Group of Referees in 2011. He is based in Preston, Lancashire and a member of the Lancashire County Football Association. He was formerly the Head of VAR in the Premier League but will remain in his post until the end of the 2022/23 season. He was the Premier League Head of VAR since he retired as a referee in the Premier League at the end of the 2017—18 Premier League season. ==Career== He took up refereeing relatively late, at the age of 29. Within six years, he was promoted to the National List of assistant referees. He fulfilled this role for four years before being added to the Referees' List. He refereed in the Football Conference until moving up into the Football League. He has also officiated the FA Cup and EFL Cup matches. His first PL appointment came in December 2010 when he took charge of a goalless draw between Fulham and Sunderland. During his second PL appointment in February 2011, he issued his first red card in England's top division DJ Campbell of Blackpool as they lost 4–0 away to Wolves. He retired from refereeing at the end of the 2017/18 season and worked as the Head of VAR in the Premier League. He will remain in his post until the end of the 2022—23 Premier League season. ==Statistics== Season: 2005/06: Games: 29. Total (yellow card): 57. per game (yellow card): 1.97. Total (red card): 2 and per game (red card) 0.07. Season: 2006/07: Games: 34. Total (yellow card): 96. per game (yellow card): 2.82. Total (red card): 9 and per game (red card): 0.26. Season: 2007/08: Games: 38. Total (yellow card): 76. per game (yellow card): 2.00. Total (red card): 8 and per game (red card): 0.21. Season: 2008/09: Games: 36. Total (yellow card): 82. per game (yellow card): 2.28. Total (red card): 4 and per game (red card): 0.11. Season: 2009/10: Games: 35. Total (yellow card): 104. per game (yellow card): 2.97. Total (red card): 8 and per game (red card): 0.23. Season: 2010/11: Games: 40. Total (yellow card): 108. per game (yellow card): 2.70. Total (red card): 8 and per game (red card): 0.20. Season: 2011/12: Games: 30. Total (yellow card): 107. per game (yellow card): 3.57. Total (red card): 7 and per game (red card): 0.23. Season: 2012/13: Games: 31. Total (yellow card): 111. per game (yellow card): 3.58. Total (red card): 1 and per game (red card): 0.03. ==Other websites== *Neil Swarbrick Referee Statistics at Soccerbase.com Category:English football referees Category:Living people Category:1965 births Category:People from Preston, Lancashire Category:Premier League Category:Sportspeople from Lancashire",
 "title": "Neil Swarbrick"
}