{
 "id": "919783",
 "text": "Lev Davidovich Landau (Russian: Лев Давидович Ландау) (22 January 1908 – 1 April 1968), was a famous Soviet physicist for contributing to theoretical physics. He was elected as a member of the USSR Academy of Sciences in 1946. He was a Foreign Member of Royal Society of London (1960), National Academy of Sciences of the United States of America (1960), Royal Danish Academy of Sciences and Letters (1951), Royal Dutch Academy of Arts and Sciences (1956), American Academy of Arts and Sciences (1960) and German National Academy of Sciences Leopoldina (1964), French Physical Society and the London Physical Society. He won the 1962 Nobel Prize in Physics for his contribution to the Mathematical Theory of Superfluidity. He also got titles or awards: Hero of Socialist Labor (1954). Max Planck Medal (Germany, 1960), Fritz London Prize (1960), USSR State Prize: Lenin Prize (1962) and Stalin Prizes (1946, 1949, 1953). == Other websites == * Lev Davidovich Landau (Russian) * Gershtein, Semyon Solomonovich Великий ал XX века (к 100-летию Льва Давидовича андау) (Russian) * Khalatnikov, Isaak Markovich Дау, авр и другие. авы (Russian) * Berestetsky, Vladimir Borisovich Лев Давидович Ландау (К пятидесятилетию со дня рождения) // Physical Sciences, 1958. (Russian) * Ginzburg, Vitaly Lazarevich Лев авидович Ландау (К со дня рождения) // Advanced Physical Sciences, January 1968. (Russian) * «Десять заповедей Ландау» — Documentary (Russian) * «ДЕЛО УФТИ» (published by Yu. N. Raniuk) (Russian) * Документы дела 1938 года на сайте, посвящённом Моисею Корецу (Russian) * Как рождался «Курс теоретической физики», Gorelik, Gennady Efimovich (Russian) * Теорминимум Ландау (Russian) * Из досье КГБ а академика Ландау (Russian) (Записка КГБ ЦК КПСС, 1957 год ) Category:Nobel Prize in Physics winners Category:Russian inventors Category:Theoretical physicists Category:Russian Nobel Prize winners Category:Russian physicists Category:1968 deaths Category:1908 births",
 "title": "Lev Landau"
}