{
 "id": "91971",
 "text": "Sweeney Todd, the Demon Barber of Fleet Street is a musical with a book by Hugh Wheeler and music and lyrics by Stephen Sondheim. The musical is based on the 19th century legend of Sweeney Todd and is similar to the 1973 play The String of Pearls, by Christopher Bond.\"Sweeney Todd\". Sondheim.com. Retrieved on January 18, 2008. A movie based off the play was made in 2007, starring Johnny Depp as Sweeney Todd. Sweeney Todd opened on Broadway at the Uris Theatre on March 1, 1979. It was directed by Harold Prince with musical staging by Larry Fuller, and starred Len Cariou as Sweeney Todd and Angela Lansbury as Mrs. Lovett. The musical played 557 times.\"Sweeney Todd The Demon Barber of Fleet Street\". IBDB.com. Retrieved on January 17, 2008. It won the Tony Award for Best Musical. ==Principal roles== Character Voice Description Sweeney Todd bass-baritone A barber who has just arrived back in London after 15 years in a penal colony. Mrs. Nellie Lovett contralto A shopkeeper who sells 'the worst pies in London'. She falls in love with Sweeney Todd. Anthony Hope tenor A young man who makes friends with Todd. Johanna soprano A beautiful girl, Todd's daughter. Tobias Ragg tenor A servant boy. He works first for Pirelli, then for Mrs. Lovett, but never trusts Todd. Judge Turpin bass An evil judge, who uses his power just to get what he wants. Beadle Bamford tenor or countertenor Turpin's helper in his crimes. Beggar Woman mezzo-soprano A mad old woman. Adolfo Pirelli tenor An Italian barber. ==Musical numbers== ;Prologue * \"Organ Prelude\" * \"The Ballad of Sweeney Todd\" – Ensemble ;Act I * \"No Place Like London\" – Todd, Anthony & Beggar Woman * \"The Barber and His Wife\" – Todd * \"The Worst Pies in London\" – Mrs. Lovett * \"Poor Thing\" – Mrs. Lovett & Todd * \"My Friends\" – Todd & Mrs. Lovett * \"The Ballad of Sweeney Todd (Reprise)\" – Ensemble * \"Green Finch and Linnet Bird\" – Johanna * \"Ah, Miss\" – Anthony, Johanna & Beggar Woman * \"Johanna\" – Anthony * \"Pirelli's Miracle Elixir\" – Tobias Ragg, Todd, Mrs. Lovett & Ensemble * \"The Contest\": ** \"Pirelli's Entrance\" – Pirelli ** \"Shaving Sequence\" – Pirelli ** \"Tooth-Pulling Sequence\" – Pirelli & Tobias * \"The Ballad of Sweeney Todd (Reprise 2)\" – Ensemble * \"Wait\" – Mrs. Lovett, Beggar Woman & Todd * \"Pirelli's Death\" – Pirelli * \"The Ballad of Sweeney Todd (Reprise 3)\" – Three tenors * \"Johanna (Judge's Song): Mea Culpa\" – Judge Turpin * \"Kiss Me\" – Johanna & Anthony * \"Ladies in their Sensitivities\" – Beadle Bamford * \"Kiss Me (Reprise/Quartet)\" – Beadle Bamford, Johanna, Anthony & Judge Turpin * \"Pretty Women\" – Todd & Judge Turpin * \"Epiphany\" – Todd * \"A Little Priest\" – Todd & Mrs. Lovett ;Act II * \"God, That's Good!\" – Tobias, Mrs. Lovett, Todd & Ensemble * \"Johanna (Quartet)\" – Anthony, Todd, Johanna & Beggar Woman * \"By the Sea\" – Mrs. Lovett & Todd * \"Wigmaker Sequence/The Ballad of Sweeney Todd (Reprise 4)\" – Todd & Anthony/Ensemble * \"The Letter (Quintet)\" – Ensemble * \"Not While I'm Around\" – Tobias & Mrs. Lovett * \"Parlour Songs\": ** \"Sweet Polly Plunkett\" – Beadle Bamford & Mrs. Lovett ** \"Tower of Bray\" – Beadle Bamford, Mrs. Lovett & Tobias ** \"Sweet Polly Plunkett (Reprise)\" – Mrs. Lovett * \"Final Sequence\": ** \"The Ballad of Sweeney Todd (Reprise 5)\" – Ensemble ** \"Fogg's Asylum\" – Ensemble ** \"City on Fire/Searching\" – Ensemble, Johanna & Anthony/Todd, Mrs. Lovett & Beggar Woman ** \"Ah, Miss (Reprise)\" – Anthony & Johanna ** \"Beggar Woman's Lullaby\" – Beggar Woman ** \"The Judge's Return\" – Todd & Judge Turpin ** \"The Ballad of Sweeney Todd (Reprise 6)\" – Ensemble ** \"Final Scene\" – Todd, Mrs. Lovett & Tobias ;Epilogue * \"The Ballad of Sweeney Todd (Reprise 7)\" – Ensemble ==Story== The story is about Sweeney Todd, who was first named Benjamin Barker. Todd comes back from the prison camps in Australia, where he was sent for fifteen years on false charges by a judge named Turpin. He then learns from a lonely pie-maker known as Mrs. Lovett that his wife poisoned herself after being raped by Judge Turpin. He also finds out that the Judge is keeping his daughter. Todd decides to take revenge. Sweeney and Mrs Lovett become partners in a plan that ends in murder, and increasing business for Lovett's pie shop, which they make pies. The show starred Josh GrobanHttps://en.m.wikipedia.org/wiki/Josh_Groban and Annaleigh Ashford ==Awards and nominations== Original Broadway production *Tony Award for Best Musical (Winner) *Tony Award for Best Book of a Musical (Winner) *Tony Award for Best Original Score (Winner) *Tony Award for Best Actor in a Musical (Leonard Cariou, Winner) *Tony Award for Best Actress in a Musical ( Angela Lansbury, Winner) *Tony Award for Best Direction of a Musical (Winner) *Tony Award for Best Scenic Design (Winner) *Tony Award for Best Costume Design (Winner) *Tony Award for Best Lighting Design (Nominee) *Theatre World Award (Ken Jennings and Sarah Rice, Winners) *Drama Desk Award *Outstanding Musical (Winner) *Outstanding Book (Winner) *Outstanding Actor in a Musical (Leonard Cariou, Winner) *Outstanding Actress in a Musical (Angela Lansbury, Winner) *Outstanding Featured Actor in a Musical (Ken Jennings, winner) *Outstanding Featured Actress in a Musical (Merle Louise, winner) *Outstanding Choreography (Nominee) *Outstanding Director of a Musical (Winner) *Outstanding Lyrics (Winner) *Outstanding Music (Winner) *Outstanding Costume Design (Nominee) *Outstanding Lighting Design (Nominee) *Outstanding Set Design (Nominee) 1989 Broadway revival *Tony Award for Best Actor in a Musical ( Bob Gunton, Nominee) *Tony Award for Best Actress in a Musical (Beth Fowler, Nominee) *Tony Award for Best Direction of a Musical (Nominee) *Tony Award for Best Revival (Nominee) *Drama Desk Award *Outstanding Actor in a Musical (Bob Gunton, Nominee) *Outstanding Actress in a Musical (Beth Fowler, Nominee) *Outstanding Lighting Design (Nominee) *Outstanding Set Design (Nominee) *Outstanding Revival (Nominee) 2005 Broadway revival *Tony Award for Best Revival of a Musical (Nominee) *Tony Award for Best Actress in a Musical (Patti LuPone, Nominee) *Tony Award for Best Actor in a Musical (Michael Cerveris, Nominee) *Tony Award for Best Featured Actor in a Musical (Manoel Felciano, Nominee) *Tony Award for Best Direction of a Musical (Winner) *Tony Award for Best Orchestrations (Jonathan Tunick, Winner) *Drama Desk Award *Outstanding Revival of a Musical (Winner) *Outstanding Actor in a Musical (Michael Cerveris, Nominee) *Outstanding Actress in a Musical (Patti LuPone, Nominee) *Outstanding Featured Actor in a Musical (Alexander Gemignani, Nominee) *Outstanding Director of a Musical (Winner) *Outstanding Orchestrations (Jonathan Tunick, Winner) *Outstanding Set Design of a Musical (Nominee) *Outstanding Lighting Design (Winner) *Outstanding Sound Design (Nominee) 2007 Film *Golden Globe for Best Picture (Musical or Comedy) (Winner) *Golden Globe for Best Actor in a Musical or Comedy (Johnny Depp, Winner) *Academy Award for Best Achievement in Art Direction (Nominee) *Academy Award for Best Performance by an Actor in a Leading Role (Johnny Depp, nominee) *Academy Award for Best Achievement in Costume Design (Nominee) == Related pages == * City on Fire, a song from the musical Sweeney Todd, the Demon Barber of Fleet Street, but Cityonfire (City + on + fire), is a asian cinema website on cityonfire.com. An article on this subject in Wikipedia English is also available. ==References== ==Other websites== *Stage and Screen Online Exclusive audio interview with Sondheim about Sweeney Todd movie *Sweeney Todd at The Internet Broadway Database * *The Stephen Sondheim Reference Guide page for Sweeney Todd *Sweeney Todd at Sondheim.com *MTI shows detailed plot and production information *Opening Night: 'Sweeney Todd', interviews and footage from the 2005 production (6 minutes, Flash video) |- |- Category:1970s musicals Category:Broadway musicals Category:West End musicals Category:London in fiction Category:Tony Award winning musicals Category:Laurence Olivier Award winning musicals Category:1970 works",
 "title": "Sweeney Todd, the Demon Barber of Fleet Street"
}