{
 "id": "919893",
 "text": "The Manipur bush rat (, ) or Hume's rat or Hume's hadromys is a species of rodent. It belongs to the family Muridae. It is found in Manipur and other Northeastern Indian regions. It is an endangered species. == Home == The species lives only in Northeast India. It has been recorded from several localities. These are: # Bishnupur in Manipur # Imphal in Manipur # Senapati in Manipur # Karong (specimen FMNH 76562) in Manipur. # Angarakhata in Kamrup district (Assam) The Manipur bush rat lives at places with medium altitudes from above sea level. It lives in tropical evergreen, moist deciduous and evergreen forests. It is also found in secondary forests in Northeastern India. == Finding out == The murid was described by Oldfield Thomas in 1886. The description was from specimens in the Manipur collection of Allan Octavian Hume. It was donated to the British Museum (Natural History) after Hume's life's work in ornithological notes were sold by a servant as waste paper. The Manipur Bush Rat was named in honour of him. The collection has two male and two female specimens. It was recorded to be collected on 23 March 1881 from Moirang in Manipur. It was the type locality for this species. == Description == The specimen has been described by Thomas (1886) as: The length of the head and the body of the largest specimen was that of a female. It was long. The length of its tail was long. Elsewhere, the head and body length has been given as head and body length as , the tail length as . The weight has been recorded as ranging from . == Safeguarding level == The species has been given safeguarding level (conservation status) of \"Endangered - B1ab(iii)+2ab(iii)\" in IUCN Red List ver 3.1. The rules for this rating include: * maximum area of living (less than ). * maximum geographical area of span (less than ). * less than five reported areas. * continuing decline in areas and destruction of homes. The main causes of damages to the conditions of this species are found to be loss of and destruction of home, separation, and overpass. Other than these, hunting and firing are also the contributing causes. == References == Category:Flora and fauna of Manipur Category:Old World rats and mice Category:Animals of India Category:Mammals of Asia",
 "title": "Manipur bush rat"
}