{
 "id": "919853",
 "text": "Mao Zedong Thought (MZT) is a political thought and ideology that develops similarly to Maoism. It is based around the theories, practices, and concepts developed by the Communist Party of China (CPC) and Mao Zedong, whom was Chairman of the Communist Party of China until his death in 1976. It separates from Maoism due to differences with Marxism–Leninism–Maoism. Mao Zedong Thought is an application of Marxism and Leninism through Marxism–Leninism in China. MZT was the driving force behind the Cultural Revolution from 1966 to 1976. == History == === Early development === Mao Zedong, the father of Mao Zedong Thought, published his first work in April of 1917. It was titled A Study of Physical Education. Analysis of the Classes in Chinese Society is a notable work Mao Zedong published prior to the start of the Chinese Civil War, being published in March of 1926. The Report on an Investigation of the Peasant Movement In Hunan was published just a month before the Chinese Civil War began. === Chinese Civil War === Following the start of the Chinese Civil War between the Communist Party of China and the Kuomintang in 1927, Mao Zedong continued publishing political works. Among these were Why is it that Red Political Power can Exist in China?, The Struggle in the Chingkang Mountains, The Second Anniversary of An Wu-ching's Martyrdom, and On Correcting Mistaken Ideas in the Party. These four works were published between 1928 and 1929. === Cultural Revolution === The Cultural Revolution was considered a major cultural movement in the development of Mao Zedong Thought by the Socialist Unity Centre of India. The Red Guards, a group primarily consisting of young students, were pivotal in enforcing Mao Zedong Thought throughout the Cultural Revolution. They used violent tactics to uphold MZT and targeted anyone deemed anti-revolutionary. By the end of the Cultural Revolution in 1976, there were more than 500,000 estimated fatalities. ==References== Category:History of China Category:Socialism Category:Communism Category:Marxism",
 "title": "Mao Zedong Thought"
}