{
 "id": "919992",
 "text": "Trachycephalus dibernardoi is a frog that lives in Brazil and Argentina. Scientists think it might also live in Paraguay. == Taxonomy == ; First scientific paper Scientists wrote the first paper about this species in 2008. Herpetologists Axel Kwet and Mirco Solé wrote it.Kwet, Axel and Mirco Solé (2008). A new species of Trachycephalus (Anura: Hylidae) from the Atlantic Rain Forest in southern Brazil. Zootaxa 1947: 53–67. ISSN 1175-5326. ; First place found Officially, scientists first found this species here: \"Centro de Pesquisas e Conservação da Natureza (CPCN) Pró Mata, at these map numbers: , at 950 meters above sea level, in the town of São Francisco de Paula in the state of Río Grande del Sur, Brazil.\" ; First frog looked at Scientists wrote about the first sample this way: MCP 2422; an adult female frog that Kewt and Marcos Di Bernardo found on January 20, 1996. They put it in the PUCRS Museum of Science and Technology in Porto Alegre. ; Name The genus name Trachycephalus comes from the Greek word Trachy for \"rough\" and cephalus for \"head.\" The species name dibernardoi is for the last name of the frog scientist Marcos Di Bernardo. The other scientists named the frog after him because he found so much knowledge about the frogs and other amphibians of Río Grande del Sur. Di-Bernardo was a teacher of zoology at the Pontifical Catholic University of Río Grande do Sul (PUCRS). He and the other scientists caught the first sample frog. Together, they wrote the book Pró-Mata: Anfíbios da Serra Gaúcha, Sul do Brasil, or Amphibians of Serra Gaucha in English.Kwet, A., R. Lingnau, and M. Di Bernardo† (2010). Pró-Mata: Anfíbios da Serra Gaúcha, Sul do Brasil – Amphibien der Serra Gaúcha, Südbrasilien – Amphibians of the Serra Gaúcha, South of Brazil. 148 pp.; 200 figures. 2nd Edition, revised and enlarged; Brasilien-Zentrum de Universität Tübingen, Tübingen, Germany, and EDIPUCRS, Porto Alegre, Brazil. In 2006, Di Bernardo died of skin cancer when he was 42 years old.Beolens, B.; M. Watkins and M. Grayson (2013). The Eponym Dictionary of Amphibians. Pelagic Publishing Ltd. == Characteristics == This frog is very large for a hylid. The adult male frog is 57.2 mm long from nose to rear end and the adult female frog is 77.6 mm long. The iris of the frog's eye is yellow. It has black lines that make a pattern coming out from a circle. There are four clear marks that look like petals from a flower. The skin of its back looks brown or olive in color. It has a pattern of marks that look like eyes and other patches. There are black and white bands on its legs. Unlike T. imitatrix, it has a white parallelogram from each eye down its body. == Distribution and habitat == Within Brazil, scientists have seen this frog in the states of Río Grande do Sul (towns of São Francisco de Paula, at 950 m, and Machadinho, at 760 m) and in the western part of the state of Santa Catarina (town of Seara, at 550 m). It also lives in the most northeastern part of Argentina, in the province of Misiones, according to material from El Soberbio (departament of Guaraní, at 190 m). In those papers, the frog is called Phrynohyas imitatrix.Carrizo, G. R. (1989) Un nuevo hílido (Amphibia: Anura) para la Argentina, Phrynohyas imitatrix (Miranda Ribeiro, 1926), Boletin de la Asociación Herpetológica Argentina, 5(1–2), 9–10.Lavilla, E. O. and Cei, J. M. (2001). Amphibians of Argentina. A second update, 1987-2000. Monografia Museo Regionale Scienze Naturali, Torino, 177 pp.Lavilla, E. O., Barrionuevo, J. S. & Baldo, J. D. (2002). Los anfibios insuficientemente conocidos en Argentina. Una reevaluación. Cuadernos de Herpetología 16, 99–118. Scientists think this frog lives in many places. It lives no lower than 150 meters above sea level and no higher than 1100 meters above sea level through all of the Sierra Geral mountains and places nearby. Scientists think it could also live in western Paraguay and in the state of Paraná in Brazil. == Threats == The International Union for the Conservation of Nature (IUCN), says this species is \"not in much danger of dying out\" in its Red List of Endangered Species. ==References== Category:Frogs of South America",
 "title": "Trachycephalus dibernardoi"
}