{
 "id": "920177",
 "text": "Thomas Jane (born Thomas Elliott III; February 22, 1969) is an American actor. Born and raised in Maryland, Jane's film career started with the Telugu- language romantic comedy Padamati Sandhya Ragam (1987). His other early films included the well-received Nemesis (1992), Face/Off, Boogie Nights (both 1997), The Thin Red Line (1998), and Magnolia (1999), among others. For his role in Deep Blue Sea (1999), Jane was seen as \"a genuine new action star\".https://variety.com/1999/film/reviews/deep-blue-sea-1200458318/ After receiving critical acclaim as baseball player Mickey Mantle in 61* (2001), he appeared in leading roles beginning with André Stander in the South African biographical film Stander (2003), for which he gained further critical acclaim.https://www.rottentomatoes.com/celebrity/thomas_jane He played the title role in the vigilante action film The Punisher (2004), where he performed most of his stunts.http://www.blackfilm.com/20040806/features/thomasjane.shtmlhttps://www.latimes.com/archives/la- xpm-2004-apr-11-ca-olsen11-story.html He went on to star in the comedy slasher film The Tripper (2006) and the cosmic horror film The Mist (2007), which was a commercial success. From the late 2000s onwards, his career shifted to mostly direct-to-video productions. He made his directorial debut with the crime thriller Dark Country (2009), in which he also starred. He starred in the well-received films 1922 (2017) and Bosco (2024).https://www.rottentomatoes.com/celebrity/thomas_jane For his work in the television series Hung, Jane was nominated for three Golden Globe Awards. https://goldenglobes.com/person/thomas-jane/ His voice acting work includes the video games The Punisher and Gun (both 2005).https://www.rottentomatoes.com/celebrity/thomas_jane In addition to his screen work, Jane has appeared several times on stage, and received strong critical reviews as Tom in Tennessee Williams' The Glass Menagerie, and as Chris in Arthur Miller's All My Sons. Outside his acting career, he has edited and written various comic books, the first of which was Bad Planet. He has also modelled for various magazines, including Men's Health and Da Man.https://daman.co.id/action-man-thomas-jane-takes-a-kick-as-our-august- september-2018-cover-star ==Personal life== For the film The Punisher (2004), Jane underwent intense military-style preparation, learning multiple martial arts and military psychology, including studying the ways of the Samurai. During filming, he stood at a height of 5 ft 10 in and weighed 170 pounds, having bulked up by 20 pounds.https://whatculture.com/film/12-most-radical- body-transformations-for-comic-book-movies?page=3 https://www.latimes.com/archives/la-xpm-2004-apr-11-ca-olsen11-story.html Jane is known for his preference for going barefoot, including at film premieres and while on set.Thomas Jane's Feet Were the Stars of The Predator's Comic-Con PanelThomas Jane hates shoes ==References== Category:1969 births Category:Living people Category:American movie actors Category:American television actors Category:American stage actors Category:American voice actors Category:American comics writers Category:Movie directors from Maryland Category:Musicians from Baltimore Category:Writers from Baltimore Category:Movie producers from Maryland Category:Screenwriters from Maryland Category:Actors from Baltimore",
 "title": "Thomas Jane"
}