{
 "id": "920290",
 "text": "Bunsen is a Beast is an American comedy animated Television Series created by Butch Hartman for Nickelodeon aired in January 16, 2017 to February 10, 2018. It revolves around a small eccentric monster named Bunsen who begins attending a middle school that previously only admitted humans. In spite of prejudice against beasts, Bunsen befriends a human boy named Mikey Munroe and his homeschooled companion, Darcy. Together, Bunsen and his friends attempt to navigate through school life while outsmarting a student named Amanda who wants to rid society of Bunsen's kind. ==Cast== * Jeremy Rowley as Bunsen * Ben Giroux as Mikey Munroe * Kari Wahlgren as Amanda, Beverly, Stephanie * Carlos Alazraqui as The Do-Not, Mr. Crocker * Tara Strong as Timmy Turner, Poof, Shopper, Tooth Fairy * Cheri Oteri as Miss Flap, additional voices * Cristina Milizia as Darcy * Jennifer Hale as Amazing Eric * Jeff Bennett as Bob, General Lanca * Kevin Michael Richardson as Wolfie, additional voices * Marieve Herington as Beast mom * Rachel Dratch as Wilda * Phil LaMarr as Ken, additional voices * Chris Hardwick as Officer Steve Stevenson * Jerry Trainor as Commander Cone * Daniel Ross as Bald man, additional voices * Butch Hartman as Kitten * Carly Kaplan as Helen, additional voices * Susanne Blakeslee as Wanda, Mom * Daran Norris as Cosmo, Dad, Trolls, Fuzzy Fred Friendly * Max Beaudry as The Screams-A-Lot == Production notes== *the show originally as a picture book, later adapted of the animated series. *Bunsen was originally voiced by Maile Flanagan of Naruto fame, literally replaced by Jeremy Rowley, also similar Miss Flap originally voiced by April Stewart alongside with Tara Strong originally as Amanda, Rachael MacFarlane originally as Darcy, Jennifer Hale originally as Mikey, Jessica DiCicco originally as Beverly, John DiMaggio originally as Wolfie and Jill Talley originally as Bunsen's mom, ironically as for Jill Talley is the later role in a upcoming Fairly OddParents reboot series. == Episodes == ==References== Category:2010s American animated television series Category:Canadian animated television series Category:Nickelodeon television series Category:American television series revived after cancellation Category:2017 American television series debuts Category:2018 American television series endings Category:Television series created by Butch Hartman Category:English-language television programs Category:Flash animation",
 "title": "Bunsen is a Beast"
}