{
 "id": "920326",
 "text": "Geoff Marshall is a video producer and author from London. He runs a YouTube channel about transport. He lived in the United States from 2006 to 2009. == London Underground station visit records == Marshall got the world record for the Tube Challenge: travelling to all London Underground stations in the fastest time possible twice. His first world record time to visit the then 275 stations was set with Neil Blake in May 2004, on his seventh attempt. This beat the previous world record that was listed by Jack Welsby in April 2002. ===2nd record time=== His second record time of 16 hours, 20 minutes and 27 seconds, was set in August 2013. A prior attempt which came close was covered by BBC News as part of London Underground's 150 year celebrations. ===Writings=== Marshall wrote a show revealing his multiple attempts which he performed at the Edinburgh Festival Fringe in 2014 and several times since at the London Transport Museum. == TV and radio appearances == Marshall gives interviews on London TV and radio. He gives his analysis of transport stories. ===The Tube=== He first appeared on TV in series 1 of ITV documentary The Tube. The second episode shows his failed attempt to beat Jack Welsby's Tube Challenge world record. This was later followed in 2003 by Race Around The Underground, part of Carlton Television's \"Metroland\" documentary series, where Marshall would have broken the record had the Richmond Branch of the District Line not suffered a signal failure. ===The Fanatics=== He also appeared on Sky 1's quiz show The Fanatics. He answered questions about the London Underground and then found himself in an episode of More4's The World's Most Beautiful Railway in September 2019 investigating the Caledonian Sleeper in the Scottish highlands. == YouTube == Marshall was a publisher between 2013-2019 for Londonist Ltd, an online London themed company. One of the more popular video series is Secrets of the Underground - a YouTube series presented by Marshall that talks about obscure facts of the London Underground. The 17-episode series first featured the 11 London Underground lines, but later episodes were produced for other London networks and for bonus episodes. ===Solo channel=== Marshall's solo YouTube channel publishes mostly transport-related content in the UK. One notable series is Least Used Stations, where he uses Office of Rail and Road statistics to discover which station in a given county had the lowest use in the previous year, then visits that station to review its limited features. He is also planning to go to all of the UK's request stops. ===Others=== Other notable series include Six Stations, Tube Challenge, London's Lost Railways, Secrets Of... other transport systems across the UK and Geoff's Top Twenty discussing favourite videos on the channel but is slightly inaccurate as 15 of them are from late 2021 onwards . == Projects == All the Stations was a project organised by Marshall and Vicki Pipe, to visit all 2,563 UK railway stations in the summer of 2017. The pair filmed most of the journey with daily updates posted on YouTube. They also posted updates to other platforms during the journey. An online hour documentary about the journey was produced in 2018. Funded by Kickstarter, the journey started on 7 May in Penzance and lasted 105 days where it stopped in Wick. 59 main videos were uploaded with 12 bonus videos too. They visited every station in Great Britain whilst gaining publicity along the way, like at lesser used Shippea Hill station. ===All The Stations Ireland=== In 2019, Marshall and Pipe did All The Stations Ireland. They spent three weeks visiting all 198 railway stations in Northern Ireland and the Republic of Ireland during March and April 2019, they then spent three days in July 2019 visiting the Isle of Man to travel to every station on the island too. ===Underground: USA=== Underground: USA was a 12-week documentary road trip. Marshall took it between June and September 2009 where he went to all 48 mainland states of the US and in each one visited an area that shared a name with a station on the tube map, for example, Epping, Maine, where the journey started. He had his filming equipment stolen during the trip but eventually turned the story into a one-hour YouTube documentary as well as publishing a related book Underground: USA. == Charity events == Marshall led a tube-based charity event in 2005 with Tube Relief. It was in response to the 7 July 2005 London bombings. Around 50 people took part, raising over £11,000 for charity. Marshall later did a series of Walk The Tube events to raise money for charities, by getting a group of people to visit every tube station but not as a record attempt. These events took place for three years following 2013. == References == Category:Living people Category:British YouTubers Category:People from London Category:1972 births",
 "title": "Geoff Marshall"
}