{
 "id": "92032",
 "text": "Harold Frederick Shipman (14 January 1946 – 13 January 2004) was a British general practitioner (a type of doctor) and serial killer. He is thought to have killed 250+ of his patients. He was a psychopath. He committed suicide on 13 January 2004 one day short of his 58th birthday. ==Early life and career== Shipman was born on 14 January 1946, in Bestwood council estate in Nottingham. He studied Medicine at the Leeds School of Medicine on scholarship. He graduated in 1970. In 1974, he became a GP in Todmorden. In 1993 he started his own doctors' surgery in Hyde. ==Crimes== In 1975, he was convicted of forging prescriptions for pethidine, to which he was addicted. Shipman was arrested on 4 September 1998. ==Trial and conviction== On 5 October 1999, he was put on trial and found guilty of 15 murders. On 31 January 2000, he was sentenced to life imprisonment for each murder. On 10 February 2000, exactly 10 days after his conviction, he was struck off from the General Medical Council Register. An investigation identified another 235 suspicious deaths. His usual way of killing was using morphine. Most of the patients he killed were old women. His other offence was the forged will of Kathleen Grundy by a typewriter. ==Death and suicide== While he was an inmate in Wakefield prison, West Yorkshire, he committed suicide with bedsheets on the day before his 58th birthday on 13 January 2004. He was discovered hanged at 6.20am (0620 GMT), prison staff tried to revive him but he was pronounced dead at 8.10am (0810 GMT). It is not known why. At the time of his death he was still married to Primrose Shipman. Shortly after 11am, an undertaker's van took Shipman's body from HM Wakefield Prison to the Medico Legal Mortuary Centre for identification. He was cremated in a secret location. ==Aftermath== A garden in memory of Shipman's victims was opened in Hyde Park on 30 July 2005, one year since his prison suicide. ==In popular culture== Post-punk band The Fall released a song about Shipman called \"What About Us?\". Actor James Bolam portrayed Harold Shipman in the ITV crime drama Harold Shipman. ==Related pages== * John Bodkin Adams - British general practitioner and suspected serial killer * Michael Swango - American doctor and serial killer ==References== Category:1946 births Category:2004 deaths Category:British people convicted of murder Category:British prisoners Category:English physicians Category:English serial killers Category:Fraudsters Category:People from Nottingham Category:People who committed suicide in prison custody Category:People with antisocial personality disorder Category:Prisoners sentenced to life imprisonment Category:Serial killers who committed suicide Category:Suicides by hanging in the United Kingdom Category:People from Tameside",
 "title": "Harold Shipman"
}