{
 "id": "920592",
 "text": "Johann Philipp Kirnberger (24 April 1721 27 July 1783) was a composer and music theorist. == Life == Kirnberger was born on 24 April 1721 in Saalfeld. He learned to play the violin and harpsichord at his home. He learned to play the organ with J. P. Kellner. In 1739, he went to Leipzig. He studied music with Johann Sebastian Bach for two years. In 1741 he went to Poland, where he worked as a musician. He returned to Germany in 1751. That year, he became a violinist (somebody who plays the violin) in the Prussian court chapel. In 1758, he became the music director for Princess Anna Amalia of Prussia. He worked as a composer and music teacher for Princess Anna. During this time, he started writing about music theory. Kirnberger died on 27 July 1783 in Berlin after a period of sickness. == Writings == Kirnberger was a famous music theorist. He wrote about counterpoint, music theory, tuning, and figured bass. However, he was not a good writer. He had to ask other people to help him write and edit his ideas. His writing is often confusing to read. He often praised J. S. Bach's in his writing. He thought that Bach's way of writing music is the best way. He tried to explain Bach's way of writing music in his book, (English: \"Art of Pure Writing\"). He created three musical temperaments. A musical temperament is how each note in an instrument is tuned. His first temperament is based on Pythagoras' temperament. His third temperament is often used to play baroque music. He created a way to write music using a pair of dice. This was published in (English: \"The polonaise and minuet composer who is always ready\"). A pair of dice is thrown. Then, the numbers on the dice is used to search a bar of melody from a table. This bar is added to the music. There are 11^{32} minuets from Kirnberger's original table. == References == Category:1721 births Category:1783 deaths Category:18th-century German composers Category:Writers from Berlin Category:Music theorists",
 "title": "Johann Philipp Kirnberger"
}