{
 "id": "920579",
 "text": "The Adventures of Rocky and Bullwinkle is a 2000 American live-action/animated adventure slapstick comedy movie directed by Des McAnuff and produced by Universal Pictures, based on the television series of the same name by Jay Ward. The animated characters Rocky and Bullwinkle share the screen with live actors portraying Fearless Leader (Robert De Niro, who also co-produced the movie), Boris Badenov (Jason Alexander) and Natasha Fatale (Rene Russo) along with Randy Quaid, Piper Perabo, Kenan Thompson and Kel Mitchell. June Foray reprises her role as Rocky, while Keith Scott (no relation to original voice actor Bill Scott) voiced Bullwinkle and the movie's narrator. It also features cameo appearances by performers including James Rebhorn, Paget Brewster, Janeane Garofalo, John Goodman, David Alan Grier, Don Novello, Jon Polito, Carl Reiner, Whoopi Goldberg, Max Grodénchik, Norman Lloyd, Jonathan Winters and Billy Crystal. The movie follows a young rookie FBI agent named Karen Sympathy enlisting the help of Rocky and Bullwinkle to stop Boris, Natasha and Fearless Leader from taking over the United States. Released on June 30, 2000, the movie was a box office bomb, grossing $35.1 million worldwide against its $76 million budget and received generally mixed reviews with criticism towards its writing, plot, and humor while praising the performances, visual effects and faithfulness to its source material. ==Cast== * June Foray as the voice of Rocky, animated Natasha Fatale and The Narrator's mother. * Keith Scott as the voice of Bullwinkle, animated Fearless Leader, animated Boris Badenov, The Narrator and RBTV Announcer * Piper Perabo as Karen Sympathy ** Sara Paxton as young Karen * Jason Alexander as Boris Badenov * Rene Russo as Natasha Fatale * Robert De Niro as Fearless Leader * Randy Quaid as Cappy \"Frank\" von Trapment * Paget Brewster as Jenny Spy * Janeane Garofalo as Minnie Mogul * Carl Reiner as P.G. Biggershot * Jonathan Winters as Whoppa Chopper Pilot, Ohio Cop with Bullhorn and Old Jeb * John Goodman as Oklahoma State Trooper * John Brandon as General Admission * Kenan Thompson as Lewis * Kel Mitchell as Martin * James Rebhorn as President Signoff * David Alan Grier as Measures * Ed Gale as The Mole * Lily Nicksay as Sydney * Jon Polito as Schoentell * Don Novello as Fruit Vendor Twins * Victor Raider-Wexler as Igor * Phil Proctor as RBTV Floor Director * Dian Bachar as RBTV Studio Technician * Drena De Niro as RBTV Lackey * Jeffrey Ross as District Attorney * Wesley Mann as Clerk * Jason Marsden as Ole ** Courtland Mead as young Ole * Harrison Young as General Foods * Max Grodénchik and Eugene Alper as Horse Spies * Alexis Thorpe as Supermodel * Taraji P. Henson as Left-Wing Student * Norman Lloyd as Wossamotta U. President * Mark Holton as FBI Agent - Potato * Doug Jones as FBI Agent - Carrot * Arvie Lowe Jr. as Sharp-Eyed Student * Tress MacNeille as the voice of a cartoon weasel * Chip Chinery and Robin Williams as Security Guards * Will Ryan (uncredited) as \"You've got mail\" announcer * Whoopi Goldberg (uncredited) as Judge Cameo * Billy Crystal (uncredited) as Mattress Salesman ==Production== In October 1998, it was announced that Monica Potter had been cast as the lead role of Karen Sympathy. Robert De Niro was also announced to be in negotiations for the role of Fearless Leader, with Des McAnuff set to direct from Kenneth Lonergan's screenplay. In November 1998, Jason Alexander was cast as Boris Badenov. In January 1999, Rene Russo was cast as Natasha Fatale. In February 1999, Potter dropped out from playing Karen and was replaced by Piper Perabo. ==Other websites== * Category:2000 movies Category:2000s comedy movies Category:2000 adventure movies Category:American animated movies Category:American comedy movies Category:Movies set in Los Angeles Category:English-language movies Category:Universal Pictures movies",
 "title": "The Adventures of Rocky and Bullwinkle"
}