{
 "id": "920641",
 "text": "Far Cry is a franchise of first-person shooter games published by Ubisoft. The first game to the franchise, named Far Cry, was developed by Crytek to show their CryEngine software, which was released in March 2004. Ubisoft later got the rights to the franchise and began making newer games using a modified version of CryEngine. Far Cry is known for its open world gameplay. ==History== ===Origins=== The first Far Cry game was made by German studio Crytek using their CryEngine software. Crytek wanted to create a realistic outdoor spaces with their game engine, which was advanced compared with other game engines at the time. Far Cry released in March 2004 for Microsoft Windows and sold 730,000 units in the first four months. After the release, Crytek stopped working with Ubisoft and signed a deal in July 2004 to make a gaming franchise with another publisher called Electronic Arts, which became the Crysis franchise. In March 2006, Ubisoft got the legal rights to the Far Cry series and a license for the CryEngine version used in the making of Far Cry. Ubisoft Montreal became the main studio for making all future Far Cry games. ===Continued development=== Far Cry 2 was announced by Ubisoft in July 2007, with two large changes from the previous Far Cry games. First, the game use the Dunia Engine, a modified version of the licensed CryEngine by Ubisoft Montreal. The Dunia Engine creates a completely open-world game with realistic physics and destroyable environments. Secondly, Far Cry 2 is more open-ended than Far Cry, that means the player get to create their own stories with the other characters using an advanced artificial intelligence system. Far Cry 2 was released in October 2008 and sold over 2.9 million units by 2009. ===Expansion=== After the release of Far Cry 2, Ubisoft Montreal made a newer version of the Dunia Engine to allow some open-world features such as weather system, which was shown in the next game of the series. Far Cry 3 was announced in 2011 and released in November 2012, it still received positive reviews and had sold more than 10 million units by 2014. ==References== Category:Ubisoft games",
 "title": "Far Cry"
}