{
 "id": "920682",
 "text": "The Great Plains wolf (Canis lupus nubilus) is an extinct subspecies of grey wolf. It is also called the buffalo wolf or loafer. It once lived in the Great Plains. The subspecies was declared extinct in 1926.Cook (6 July 1964). \"News Release\" (PDF). Fish and Wildlife Service. United States Department of the Interior. p. I. Retrieved 26 January 2018. \"Extinct Mammals of the United States: Plains wolf, Canus lupus nubilus (1926) — Great Plains\" == Taxonomy == Thomas Say documented the Great Plains wolf in 1823. He was the first person to record \"prairie wolves\" (coyotes) and Great Plains wolves as different animals. He named it Canis nubilus. Say wrote that the Great Plains wolf was more fierce and powerful than the red wolf or coyote.Say, T. et al. (1823) Account of an expedition from Pittsburgh to the Rocky Mountains, performed in the years 1819 and '20 : by order of the Hon. J.C. Calhoun, sec'y of war: under the command of Major Stephen H. Long. From the notes of Major Long, Mr. T. Say, and other gentlemen of the exploring party. Philadelphia : H.C. Carey and I. Lea ... p. 169-173 == Description == The Great Plains wolf once lived in the Great Plains, from southern Manitoba and Saskatchewan to northern Texas. The Great Plains wolf was described as a large wolf with light-colored fur. However, some of them had fur that was all white or all black. The body length is 1.7 m (5.6 ft). The average weight of a male was 100lb (45 kg). The heaviest one recorded was 150 lb (58kg). The Native Americans of North Dakota told stories about how only three of these wolves could bring down a bison.A Biological Survey of North Dakota, Vernon, B., (1926), North American Fauna: Number 49: pp. 150–156 There used to be many of these wolves living in the Great Plains. When the American bison was being killed, Great Plains wolves were also being poisoned and trapped for their pelts. Alexander Henry wrote that they were bold around humans, and fed on the dead bodies of bison. He recorded that Native Americans dug up wolf pups from their dens in the prairie. They also dug large pitfalls to capture wolves and foxes. Members of Henry's group dug up wolf pups and found them very tame and easy to train. In 1833, the explorer Maximilian of Wied-Neuwied recorded that these wolves were common in the upper part of Missouri. There, Native Americans had wolf pits and traded wolves to him for tobacco. He thought that the Native American's dogs were more dangerous to humans than the wolves. In 1856, Lt. G. K. Warren studied Great Plains wolf skulls and found that some of them were not full- blooded wolves. There have been many stories about violent hybrid wolf-dogs. It is possible that the Great Plains wolf's tameness and lack of fear of humans might be because they were mixed with domestic dogs. In North Dakota, by 1875 sightings of the wolf became rare, and by 1877 they were almost all gone. In North Dakota, two were sighted in 1915 by Remington Kellogg. The last known wolf was shot in 1922. The Great Plains wolf was officially declared extinct in 1926. == References == Category:Wolves Category:Extinct mammals",
 "title": "Great Plains wolf"
}