{
 "id": "920680",
 "text": "Beast is a 2022 Indian Tamil-language action comedy movie written and directed by Nelson and produced by Sun Pictures. The movie stars Vijay and Pooja Hegde in lead roles. Selvaraghavan, Yogi Babu, and Redin Kingsley play supporting roles. It revolves around an ex-RAW agent's crusade to rescue people held hostage in a shopping mall by terrorists. ==Production== The production rights of Vijay's 65th movie as lead actor were acquired by Sun Pictures in early January 2020. It was titled Thalapathy 65. The movie was set to be written and directed by AR Murugadoss. However, the producers ousted Murugadoss from the movie in October 2020, after he refused to cut his renumeration. Nelson was later hired and he wrote a new script for the movie. ==Schedule== With an official announcement during December 2020, the movie began principal photography in April 2021. It wrapped in December. The movie was shot across various locations in Chennai, including a specially designed set resembling that of a shopping mall where most of the movie was shot. Sporadic schedules took place in Delhi and Georgia. The music was composed by Anirudh Ravichander, cinematography was handled by Manoj Paramahamsa, editing by R. Nirmal and production design supervised by D. R. K. Kiran. The movie was released in theaters on 13 April 2022. It received mixed reviews from critics and the audience. ==Cast== *Vijay as Veera Raghavan *Pooja Hegde as Preethi *Selvaraghavan as Althaf Hussain *Shine Tom Chacko as a terrorist who sides with Veera *Yogi Babu as Jill *Redin Kingsley as Jack *VTV Ganesh as Dominic Irudhayaraj *Shaji Chen as the Home Minister *Aparna Das as Aparna *Sathish Krishnan as Ramachandran *Lilliput as Umar Farooq *Ankur Ajit Vikal as Umar Saif *Prudhvi Raj as Veera's psychiatrist *Sunil Reddy as Mahaali *Shiva Arvind as Killi *Sujatha Babu as Aparna's mother *Subbalakshmi as a hostage *Gayathri Shan as a hostage *Smruthi as a hostage *Janani Durga as a hostage *Madhuri Watts as a hostage *Hasini Pavithra as a hostage *Bjorn Surrao in a cameo appearance as a drummer in the song \"Jolly O Gymkhana\" Additionally, director Nelson, music composer Anirudh and choreographer Jani appear in cameo appearances as themselves in the song \"Jolly O Gymkhana\". ==References== Category:2022 movies Category:2020s Indian movies Category:2022 action movies Category:2022 comedy movies",
 "title": "Beast (2022 Indian movie)"
}