{
 "id": "920652",
 "text": "Tea was first introduced in the 17th century and ever since associated with the British culture. It became one of Britain's favorite brewing drinks with about 2 kilograms of consumed dry tea per person a year. Today tea is Britain's national drink and it belongs to one of Britain's common stereotypes. It is so integrated into the lives of British people to the point they invented the word \"cuppa\" for \"a cup of tea\". == History == In the early 17th century, Dutch and Portuguese traders were shipping tea from various Asian countries to Europa. Tea became more and more popular and was introduced to a larger crowd in the year 1651. A few years later in 1657, Thomas Garway was the first person who sold tea in his coffee house in London. At that time tea was not consumed for recreational but more for medical purposes, against illnesses and diseases. Tea was an exclusive product that only a small group of wealthy people could afford. In the year 1662, as Queen Catherine of Braganza brought tea to the royal court, it became trendy among monarchs and wealthy people. At this point, tea was not just consumed for medical purposes anymore, but as a lifestyle product. In 1664, the British East India Company placed its first order of Chinese tea. Even though only a few people could afford the expensive product, it gained popularity, and by 1750 they imported Chinese tea worth millions of pounds. As the popularity of tea is growing the British Crown saw a new source of income, and because of that reason, they increased the tax on imported tea to 119%. Due to high import taxes on tea, people started to smuggle tea or sell low-quality tea which could be dangerous to consume. Most of these problems were gone, after decreasing the taxes on imported tea to 12.5% in the year 1784. In the 19th century, tea became much cheaper, because of the low import taxes, also they began growing tea in their colonies in India and Sri Lanka. Its popularity reaches working-class households, where tea was served with the main meal. This meal has become known as high tea. == Afternoon tea == Nowadays Afternoon tea or low tea is a rare occasion, due to the lack of time in modern society. But in the 18th century, wealthy women would meet up at around 4 p.m. and drink tea together. Anna Russell the 7th Duchess of Bedford made the afternoon tea fashionable, because of her unregulated dinner time she would drink a cup of tea served with bread and butter, in the afternoon as a dinner replacement. The afternoon tea was extremely popular among her and her royal friends, so they also held their own afternoon tea ceremony. A formal tea set is made of fine bone china, porcelain, or silver and includes a teapot, cups and saucers, a creamer for holding milk, and a sugar bowl, all carried on a tray. == Varieties == There are more than 3000 varieties of tea with completely different taste profiles in this world. These are the 6 most consumed tea types in Great Britain. Black tea has its famous dark color because of the long oxidation process of the leaves. The taste is bold and brisk and the tea contains caffeine that perfectly can replace coffee. Usually, you can add milk, sugar, or lemon to your black tea. Earl Grey is a black tea variety, but it has a fruitier flavor, because of the bergamot. This tea is usually served without milk. Its name came from the Prime Minister of the United Kingdom Charles Grey in 1830, after China gifted him this tea. English breakfast is a blend of black tea. The taste may be slightly sweet, bitter, or malty and is served with milk and sugar Green tea is popular for its health benefits. Consumers describe its tastes as less bitter and refreshing and without the need for sweetening. Oolong tea is a semi-fermented Chinese Tea with a woody to fruity flavor, depending on the manufacturing process. Herbal tea is currently trending among younger people, because of its high health beneficial effects. Herbal teas are made of fruit extracts and herbal-based plants. == Other websites == *www.blackteaworld.com *www.learnenglish.de *tv-english.club *wirhd.de/teesorten *topictea.com/blogs/tea-blog/popular-teas-in-britain/ *linguapress.com/advanced/tea-in-britain.htmt. *All About Tea (thespruceeats.com) tea Category:Tea",
 "title": "Tea in the United Kingdom"
}