{
 "id": "920894",
 "text": "The Indian textile industry dates back to over 4000 years ago and can be classified broadly into 3 stages -pre-colonial period, colonial period and post independence period. However, this article focuses mainly on the influence that the British rule had on the textile industry in India between 1858 and 1947. == Pre-colonial period == Around the 3rd century BC, during the Indus Valley Civilization, textiles were manufactured from animal hair, wool, cotton, and silk. Numerous small kingdoms and dynasties contributed to the development of the textile industry in India. At that time, the Indian products were highly appreciated by the Romans, Chinese and other Asian traders but since several religions such as Buddhism, Jainism and Sikhism encouraged people to give up luxurious items as a path to enlightenment, the textile industry declined. Still, a significant expansion of the textile trade took place in India during the medieval period (12th-15th century). Large quantities of North Indian silk were traded to Western countries via the Silk Road in China. The Indian silks were often traded with the western countries for their spices in the exchanged barter system. == Colonial period == The British rule in India, the so-called \"Raj\", lasted from 1858 until 1947. During that period the British modernized the country, but completely decimated its economy. Just to give an example: In 1700, India was the world’s richest country, accounting for some 27% of global GDP. But in 1947, when India achieved its independence, India had been reduced to one of the world’s poorest countries, with just over 3% of global GDP. The British took over thriving industries - such as textiles, shipbuilding and steel - and destroyed them through force, taxes, import duties and the imposition of their exports and products on the backs of Indian consumers. During the late 17th and 18th centuries, Indian cotton was widely exported to Western countries to meet the needs of European industries during the industrial revolution. Hence there was no industrial revolution in India. Due to the abolition of slavery in America, England started looking for another source of cheap cotton and saw India as the right place for it. They convinced many farmers to switch from subsistence farming to the production and export of large quantities of cotton after a long period of protectionism against the English textile industry. == Post independence period == The Indian textile industry has gone through a number of changes since Independence in 1947, and after liberalisation in the 1990s, it is one of today's most vibrant industries. It has traditionally been the only industry after agriculture that has generated huge employment for both skilled and unskilled labour. The textile industry remains the second largest employment sector in India. It provides direct employment to over 35 million people in the country. == References == *https://asiancenturyinstitute.com/development/1568-britain-s-shameful- colonisation-of-india *https://www.bpb.de/themen/asien/indien/44384/epochen- der-indischen-geschichte-bis-1947/ *https://www.textilesphere.com/2022/04/history-of-indian-textile-industry.html *https://library.oapen.org/handle/20.500.12657/51090 *Dr. Anette Leithner- Brauns, Dresden; Ingrid Becker-Ross, Krefeld; Prof. Hellmut Schwarz, Mannheim (2019), Context Ausgabe Baden-Württemberg Basis- und Leistungsfach, 1. Aufl. textile Category:Textile arts",
 "title": "History of the Indian textile industry"
}