{
 "id": "920845",
 "text": "Winona is a city in southeast Shannon County, Missouri, United States. The population was 950 at the 2020 census. ==History== A post office was started in 1888. A lumberjack renamed it after Winona, Minnesota as it was his native home. The name is also a Sioux word. It means 'first born.' ==Geography== Winona is located in the Ozarks of southern Missouri. The city is at the intersection of US Route 60 and Missouri Route 19. The city is within the Mark Twain National Forest. Birch Tree is eight miles to the west, Eminence is about eight miles to the north on Route 19, and Van Buren is approximately 18 miles to the east in adjacent Carter County.Missouri Atlas & Gazetteer, DeLorme, 1998, First edition, p. 65, The city has a total area of , all land. ===Climate=== Winona has a humid warm-temperate climate (Ch3). Summer is usually hot and muggy. Fall and spring are usually mild. Winter is moderately cold. The USDA Plant Hardiness Zone is 6b. Snowfall changes a lot. In some winters, there is light snow. In other winters, there are many blizzards. Most years, snowfall is about . Snow sometimes falls in November or April. The yearly snowfall has ranged from in 2017-18 to in the winter of 2009–10. The town’s heaviest single-storm snowfall was which occurred in January 2016. Precipitation is generally spread throughout the year, with eight to eleven wet days per month, at an average yearly rate of . In recorded history, it has ranged from in 1953 to in 1973. The most rain recorded in one day occurred on November 24, 1987, when fell. The January daily average temperature is , but the temperature often rises to or falls to for 2 or 3 nights in a normal winter. July averages , but heat waves with high humidity are common, and temperatures reach on 40 days of the year. The average period for freezing temperatures is November 6 thru April 2, allowing a growing season of 217 days. Winters are generally dry, and February has the lowest average precipitation at . The highest recorded temperature was on August 4, 2011. Temperatures at or above are not common, with an average of only 2 days of the year. The lowest officially recorded temperature was on February 2, 1951. Temperatures at or below are rare, and last occurred on February 19, 2021. The record low maximum is on February 12, 1899, while the record high minimum is on August 1, 1934. ==Demographics== ===2020 census=== In the 2020 census, there were 950 people, 414 households, and 248 families living in Winona. The population density was 249.5 people per square mile (96.3/km²). There were 497 housing units. The breakdown by race was 90.2% White, 1.3% from one other race, and 8.5% from two or more races (mostly Native American and white). Hispanics and Latinos made up 2.4% of the people. The median (middle) age was 44.6 years. The age breakdown was 24.1% under age 18, 55.9% from 18 to 65, and 20.0% over 65. The gender breakdown was 48.3% male and 51.7% female. Of the 414 households, 28.0% had children under age 18, 38.6% had a married couple, 7.2% had an unmarried couple, 31.4% had a woman with no partner, 22.7% had a man with no partner, and 33.8% had one person living alone. The average household size was 2.28 people. === Income and jobs === The 2022 census estimates said that the median income was $30,768 for households and $36,250 for families. The per capita income was $19,107. Of all people over age 16, 42.4% of them were working or looking for work. The unemployment rate was 4.0%. The most common fields of work were: * retail trade (29.3%) * manufacturing (22.8%) * agriculture, forestry, fishing, and mining (16.6%) * educational services, and health care and social assistance (14.1%) === Racial breakdown by year === Race or ethnicity 2000 2010 2020 White (non-Latino) 94.6% 95.7% 89.5% Black/African-American (non-Latino) 0.0% 0.1% 0.0% Native American (non-Latino) 1.9% 0.8% 0.4% Other races (non-Latino) 0.0% 0.1% 0.1% Two or more races (non-Latino) 3.1% 1.7% 7.6% Hispanic or Latino 0.4% 1.5% 2.4% === Age breakdown by year === Age (years) 2000 2010 2020 Less than 5 8.9% (115) 8.9% (119) 6.9% (66) 5 to 17 21.5% (277) 21.1% (282) 17.2% (163) 18 to 24 8.2% (106) 9.1% (121) 5.9% (56) 25 to 34 13.3% (171) 11.8% (157) 9.9% (94) 35 to 44 12.9% (166) 12.1% (162) 10.5% (100) 45 to 54 12.7% (164) 12.6% (170) 12.2% (116) 55 to 64 8.6% (111) 11.3% (151) 17.4% (165) 65 to 74 6.9% (89) 7.5% (100) 10.6% (101) 75 or more 7.1% (91) 5.5% (73) 9.4% (89) ==Education== Public education in Winona is done by the Winona R-III School District. Winona has a lending library, the Winona Public Library. ==References== ==Other websites== * City of Winona & Winona Chamber of Commerce Category:Cities in Shannon County, Missouri",
 "title": "Winona, Missouri"
}