{
 "id": "921159",
 "text": "This is a list of members of the Senate of Canada (), the upper house of the Canadian Parliament. , there are 90 senators. 41 senators are part of the Independent Senators Group. 16 are part of senate caucus of the Conservative Party of Canada. 14 senators are part of the Progressive Senate Group. 12 are part of the Canadian Senators Group. 7 are not part of any group. 15 seats are empty. == Current senators == Name Senate political affiliation Province (Division) Date appointed Appointed on the advice of Mandatory retirement date Titles and notes Progressive Senate Group Northwest Territories Trudeau, J. Independent Senators Group Saskatchewan Trudeau, J. Conservative Ontario (Toronto) Harper Independent Senators Group Quebec (De Salaberry) Trudeau, J. Conservative Saskatchewan Harper Expelled from the national Conservative caucus on November 16, 2021 but remains a member of the Senate Conservative Caucus. Progressive Senate Group Quebec (Alma) Harper Legislative Deputy to Government Representative Peter Harder until she joined the ISG, November 14, 2019. Progressive Senate Group Nova Scotia (East Preston) Trudeau, J. Canadian Senators Group Ontario (Centre Wellington) Trudeau, J. Independent Senators Group Ontario Trudeau, J. Conservative Quebec (La Salle) Harper Independent Senators Group Ontario Trudeau, J. Progressive Senate Group Manitoba Trudeau, J. Independent Senators Group Ontario Trudeau, J. Non- affiliated Quebec (Repentigny) Harper Independent Senators Group British Columbia Trudeau, J. Canadian Senators Group British Columbia (Vancouver) Martin Conservative Quebec (Mille Isles) Harper former Representative of the Government and former Opposition Leader Independent Senators Group Nova Scotia Trudeau, J. Independent Senators Group Ontario Trudeau, J. Progressive Senate Group Nova Scotia Chrétien Progressive Senate Group Leader Independent Senators Group New Brunswick Trudeau, J. Independent Senators Group Saskatchewan Trudeau, J. Independent Senators Group Nova Scotia (Antigonish) Trudeau, J. Canadian Senators Group Quebec (Victoria) Harper Progressive Senate Group Quebec (De Lorimier) Trudeau, J. Independent Senators Group Ontario Trudeau, J. Progressive Senate Group Quebec (Lauzon) Martin Progressive Senate Group Deputy Leader Independent Senators Group Nova Scotia Trudeau, J. Independent Senators Group Ontario (Waterloo Region) Trudeau, J. Independent Senators Group Ontario Trudeau, J. Canadian Senators Group Prince Edward Island (Charlottetown) Chrétien Independent Senators Group Yukon Trudeau, J. Independent Senators Group Quebec (The Laurentides) Trudeau, J. Independent Senators Group Quebec (Gulf) Trudeau, J. Progressive Senate Group Prince Edward Island Trudeau, J. Non-affiliated Newfoundland and Labrador Chrétien Speaker Non-affiliated Manitoba Trudeau, J. Legislative Deputy to Government Representative Marc Gold as of January 31, 2020 Independent Senators Group Quebec (Bedford) Trudeau, J. Progressive Senate Group Quebec (Rigaud) Trudeau, J. Progressive Senate Group Quebec (Kennebec) Trudeau, J. Non-affiliated Quebec (Stadacona) Trudeau, J. Representative of the Government in the Senate as of January 24, 2020 Canadian Senators Group Nova Scotia (Halifax — The Citadel) Harper Progressive Senate Group Ontario (Ottawa) Trudeau, J. former Representative of the Government from March 23, 2016 to December 31, 2019. Independent Senators Group New Brunswick Trudeau, J. Conservative Quebec (Wellington) Harper former Speaker Independent Senators Group British Columbia Chrétien Progressive Senate Group Saskatchewan Trudeau, J. Independent Senators Group Nova Scotia Trudeau, J. Non-affiliated Alberta Trudeau, J. Government Liaison (whip) as of January 31, 2020 Independent Senators Group Ontario Trudeau, J. Independent Senators Group Quebec (Shawinegan) Trudeau, J. joined the ISG on November 7, 2019 Progressive Senate Group New Brunswick Martin Conservative Nova Scotia (Cape Breton) Harper Conservative Newfoundland and Labrador Harper Conservative Newfoundland and Labrador Harper Conservative British Columbia (Vancouver) Harper Opposition Deputy Leader Independent Senators Group Ontario Trudeau, J. Independent Senators Group Quebec (De Lanaudière) Chrétien Non-Affiliated Manitoba Trudeau, J. Non-Affiliated Manitoba Trudeau, J. Left the Independent Senators Group in October, 2021 prior to a private hearing to determine if McPhedran should be expelled from the group. Independent Senators Group Quebec (Rougemont) Trudeau, J. Progressive Senate Group Nova Scotia (Northend Halifax) Chrétien Whip of the Progressive Senate Group Independent Senators Group Quebec (Inkerman) Trudeau, J. Conservative New Brunswick (St. Leonard) Harper Independent Senators Group Ontario Trudeau, J. Independent Senators Group Ontario Trudeau, J. Conservative Ontario (Mississauga) Harper Independent Senators Group Ontario Trudeau, J. Independent Senators Group Ontario Trudeau, J. Canadian Senators Group Nunavut Harper Independent Senators Group Quebec (Grandville) Trudeau, J. Conservative Manitoba (Landmark) Harper Opposition Leader Conservative New Brunswick (Saint-Louis-de-Kent) Harper Canadian Senators Group New Brunswick Trudeau, J. Independent Senators Group Newfoundland and Labrador Trudeau, J. Canadian Senators Group New Brunswick Trudeau, J. Independent Senators Group New Brunswick Chrétien Independent Senators Group Quebec (De la Vallière) Trudeau, J. Conservative Québec (De la Durantaye) Harper Opposition Whip as of November 14, 2019 Independent Senators Group Alberta Trudeau, J. Conservative Quebec (Saurel) Harper former Opposition Leader Independent Senators Group Alberta Trudeau, J. Canadian Senators Group Alberta Harper In an interview with The Hill Times in July 2017, Senator Tannas \"...has made it clear he will stay no longer than a decade.\" which would put his retirement date no later than March 25, 2023. Canadian Senators Group Quebec (Montarville) Harper Canadian Senators Group Saskatchewan Harper Conservative Newfoundland and Labrador Harper Independent Senators Group Ontario Trudeau, J. Canadian Senators Group Ontario Harper Upon his appointment, Senator White said that he would step down after nine years (no later than February 20, 2021). Independent Senators Group British Columbia Trudeau, J. Facilitator of the Independent Senators Group Independent Senators Group Ontario Trudeau, J. == Vacancies == == Standings == Members of the Senate of Canada can be the representatives of a political party if agreed by themselves and their party.The current party standings in the Senate of Canada these: Party BC AB SK MB ON QC NB NS PE NL YT NT NU Total Independent Senators Group 3 2 2 0 15 10 3 4 0 1 1 0 0 41 Conservative 1 0 1 1 2 5 2 1 0 3 0 0 0 16 Progressive Senate Group 0 0 1 1 1 5 1 3 1 0 0 1 0 14 Canadian Senators Group 1 1 1 0 2 2 2 1 1 0 0 0 1 12 Non-affiliated 0 1 0 3 0 2 0 0 0 1 0 0 0 7 Vacant 1 2 1 1 4 0 2 1 2 1 0 0 0 15 Total 6 6 6 6 24 24 10 10 4 6 1 1 1 105 == Membership changes since the last election == == Standings changes since the last election == == Appointment breakdown == Prime Minister Term ISG Cons. PSG CSG N-A Total Jean Chrétien 1993–2003 3 0 2 1 1 7 Paul Martin 2003–2006 0 0 2 1 0 3 Stephen Harper 2006–2015 0 16 1 7 1 25 Justin Trudeau 2015–present 39 0 9 4 4 56 Total 42 16 14 13 6 91 == Upcoming retirements == Twenty-five current senators are scheduled to retire before the end of 2025: # Terry Mercer, May 6, 2022, Progressive Senate Group (Chrétien) - Nova Scotia (Northend Halifax) # Howard Wetston, June 3, 2022, Independent Senators Group (J. Trudeau) - Ontario # Larry Campbell, February 28, 2023, Canadian Senators Group (Martin) - British Columbia (Vancouver) # Sandra Lovelace Nicholas, April 15, 2023, Progressive Senate Group (Martin) - New Brunswick # George Furey, May 12, 2023, Non-affiliated (Chrétien) - Newfoundland and Labrador # Patricia Bovey, May 15, 2023, Progressive Senate Group (J. Trudeau) - Manitoba # Dennis Patterson, December 30, 2023, Canadian Senators Group (Harper) - Nunavut # Renée Dupuis, January 17, 2024, Independent Senators Group (J. Trudeau) - Quebec (The Laurentides) # Pierre- Hugues Boisvenu, February 12, 2024, Conservative (Harper) - Quebec (La Salle) # Percy Mockler, April 14, 2024, Conservative (Harper) - New Brunswick (St. Leonard) # Victor Oh, June 10, 2024, Conservative (Harper) - Ontario # Mobina Jaffer, August 20, 2024, Independent Senators Group (Chrétien) - British Columbia # Dennis Dawson, September 28, 2024, Progressive Senate Group, (Martin) - Quebec (Lauzon) # Diane Bellemare, October 13, 2024, Progressive Senators Group (Harper) - Quebec (Alma) # Ratna Omidvar, November 5, 2024, Independent Senators Group (J. Trudeau) - Ontario # Stephen Greene, December 8, 2024, Canadian Senators Group (Harper) - Nova Scotia (Halifax — The Citadel) # Brent Cotter, December 18, 2024, Independent Senators Group (J. Trudeau) - Saskatchewan # Nancy Hartling, February 1, 2025, Independent Senators Group (J. Trudeau) - New Brunswick # Jean-Guy Dagenais, February 2, 2025, Canadian Senators Group (Harper) - Quebec # Don Plett, May 14, 2025, Conservative (Harper) - Manitoba (Landmark) # Marc Gold, June 30, 2025, Independent Senators Group (J. Trudeau) - Quebec (Stadacona) # Jane Cordy, July 2, 2025, Progressive Senate Group (Chrétien) - Nova Scotia # Judith Seidman, September 1, 2025, Conservative (Harper) - Québec (De la Durantaye) # Marie-Françoise Mégie, September 21, 2025, Independent Senators Group (J. Trudeau) - Quebec (Rougemont) # David Adams Richards, October 17, 2025, Canadian Senators Group (J. Trudeau) - New Brunswick == Longest jobs == Furthest year of retirement of existing senators, by prime minister * Dennis Dawson, appointed by Paul Martin, is due to retire on September 28, 2024 * Pierrette Ringuette, appointed by Jean Chrétien, is due to retire on December 31, 2030 * Michèle Audette, appointed by Justin Trudeau, is due to retire on July 20, 2046 * Patrick Brazeau, appointed by Stephen Harper, is due to retire on November 11, 2049 == Notes == == References == Category:Parliament of Canada Category:Lists of Canadian people Category:Lists of politicians",
 "title": "List of current senators of Canada"
}