{
 "id": "921140",
 "text": "The medal \"People's Gratitude\" () is a state award of the Republic of Kazakhstan. It was established by the Decree of the President of the Republic of Kazakhstan Kassym-Jomart Tokayev dated June 8, 2020. == Rules == The medal is given to Kazakh civilians for their works in education, health care, social protection and for their works to COVID-19 pandemic response. The Medal is given by the President of the Republic of Kazakhstan, as well as on behalf of and by order of the President, the State Secretary, Akims of provinces and cities of Nur-Sultan, Almaty and Shymkent and other officials. The medal is awarded publicly in a ceremony. Before the awards ceremony, a decree of the President on awarding is announced. Every medal has a certificate issued during the ceremony. == Design == The medal has a coin-like medallion and a suspension brooch. The round shape medallion is 32 mm in diameter. It is made of goldish brass. There is the \"Birgemiz\" logo on the obverse of the medal in the foreground. The upper part of the medal is decorated with a Kazakh ornamental pattern. There is an inscription (People’s Gratitude) at the bottom. The reverse of the medal is decorated with a Kazakh ornamental pattern around the circumference. There is an inscription (the Republic of Kazakhstan 2020) in the centre. The medallion is connected to a rectangular 32 mm wide suspension brooch made of goldish brass with an eye and a suspension ring. The central part is decorated with a Kazakh ornamental pattern. The background of the suspension brooch is covered with blue enamel. All the images and inscriptions on the medal are convex. The medallion edge is rimmed. The reverse of the suspension brooch includes a pin with lock. == Recipients == A total of 60 doctors and 39 policemen, 30 servicemen, 41 volunteers and 34 philanthropists were awarded the medal. In addition, the medal was given to 38 artists and educators, as well as 25 media representatives. == References == Category:Kazakhstan Category:Orders, decorations, and medals",
 "title": "People’s Gratitude medal"
}