{
 "id": "921161",
 "text": "Multiculturalism is the presence of several distinct cultural or ethnic groups within a Multiculturalism in the UK has its roots in the early seventeenth century. The UK had the biggest Empire in the history of the world - the British Empire. In the nineteenth century, it covered roughly 25% of the world's land surface and ruled around one-fifth of the entire population of the world. In the age of colonialism, the culture of all the colonies, like India, Australia, New Zealand, Egypt, and many other countries collided together. From 1801-81, the United Kingdom saw many immigrants arrive on British shores due to a booming economy domestically. In this period, over 2,000,000 people from Ireland moved to Great Britain, and over 1,500,000 from Germany and other parts of Europe arrived as well. Since the time of the British Empire, many people have moved to the UK. After World War II, the UK needed more people to fill labour shortages, so it motivated Commonwealth citizens to come to Britain; viewed by many as the \"mother country\". During the Great War, one quarter of a million Belgians came to Britain to escape the wrath of the war. During the 1930s before World War II, Jews started to migrate to the UK with the rise of Hitler and fascism across the continent. During the 1940s to 1960s, Polish people were invited to come and stay in the United Kingdom with the promise of jobs and a house. Due to the massive migration of Polish people since, the Polish community is deeply anchored in present society. From the 1950s to 1960s immigrants from Pakistan and India settled in the UK. The year 1972 saw a further increase in Asian arrivals in the United Kingdom, those who had been expelled by dictator Idi Amin of Uganda. Though the immigrants helped the UK by contribution to the workforce, racism was a big problem in British society. Since 2016, immigration from outside Europe has increased considerably in the UK, as it has in most European countries. Most immigrants come and live in cities, where there are other people from their community. In the past they mostly settled in seaports. Immigrant communities in London, Liverpool and Glasgow are very old, and were started by sailors. Chinese people moved out of the cities and started laundries and restaurants, often in small country towns where they were the only immigrants. George Formby made several songs about \"Mr. Wu\", a Chinese laundry man in the 1930s. In the 1960s, the UK made a change to immigration policy. The immigration policy of Britain became more about tolerating immigrants, but not actively caring about integration. In 1962, the Commonwealth Immigrants bill was passed to restrict immigration. There was quite a lot of discrimination against immigrants. The punk singer John Lydon, who was born in London in 1956, called his autobiography No Irish, No Blacks, No Dogs. His parents were poor Irish immigrants who settled in North London. People say these words were used by landlords then. That may not be true, but there were certainly signs saying “no West Indians”. As Lydon says, Irish people blend in better than the Jamaicans.Lydon, John, with Zimmerman, Keith, & Zimmerman, Kent. (1994). Rotten – No Irish, No Blacks, No Dogs, p. 12. London: Hodder & Stoughton Enoch Powell, when he was Minister for Health, recruited nurses for the NHS from the Caribbean. Later, in 1968 he made a speech and said that if the United Kingdom let too many immigrants in, there would be bloodshed in the streets. The Race Relations Act 1965 was the first law in the UK to say that discrimination on the \"grounds of colour, race, or ethnic or national origins\" in public places in Great Britain was prohibited. It was followed by more, stronger, laws. Today, there is still a strong connection with many of the old colonies and most of them are still part of the Commonwealth of Nations. Due to this history, immigrants from all over the world come to the UK and bring with them their food, religion, and music; this forms the multicultural society of the UK. About 14.4% of the people in the United Kingdom in 2021 were born overseas. About 3,346,000 of them lived in London. 18% of people counted in the 2021 Census said they belonged to a Black, Asian, mixed or other ethnic group. In the Community Life Survey 2019/20 84% of these people said they felt strongly that they belonged to Britain. Although 'multiculturalism' initially seemed like a good idea on paper, it has proven difficult in practice given some new groups' desire for greater recognition and rights in recent years. The UK has increased its multicultural representation in recent years as well but is still struggling with issues related to 'multiculturalism'. Overall, it's important to understand and respect each cultural group without giving them preferential treatment- doing so can help create a more unified nation that is far richer from a cultural perspective. == The multicultural face of the UK == The following table shows that the UK is home to numerous ethnic minorities. Most immigrants come from India, Poland, Pakistan, and Ireland. Around 90% of immigrants who entered the UK went to England. They settled in English cities, giving England the largest number of cultural districts. Ethnic group Population (2011) Percentage of population Whites 55,1 millions 87,2 % Asians 4,4 millions 7,0 % Blacks - African, Caribbean and British backgrounds 1,9 million 3,0 % member of several ethnic groups 1,25 million 2,0 % other ethnic groups 600.000 0,9 % total 63,2 millions 100 % Language plays an important part in the multicultural aspect of Britain. English is the main language for 92% of the UK (48.9M people). Less than 5% of the population aged 3 to 15 had a main language other than English in 2011. Foreign languages are concentrated in London, where 21% of people don't speak English, or at least not well. These are the top 5 languages spoken at home other than English: Polish, Indian dialect, Arabic, French, and all other Chinese. However, in the UK, 1.6% of the British population doesn't speak English at all. There are numerous cultural districts in which immigrants of a nation have settled and brought their culture with them to their new homeland. In Brick Lane, in London's East End, mainly people from Bangladesh have settled. There, for example, there are also street names that have been translated into Bengali under the English sign. The street is best known these days for its South Asian restaurants and street markets. Since the 19th century, the Richmond district has been shaped primarily by German immigrants. After a German school was founded there, the district became even more attractive as an emigration destination for Germans. Multiculturalism can also be seen in food. From 2018 to 2019, there was a total of 103,379 hate crimes recorded by the police in England and Wales, and 8% of hate crimes were related to religion. This multiculturalism is also caused by the increasing birth rate of other ethnic groups in England: in 2016, 90,500 births from other ethnic groups and in 2020, 158,000. == London; a multicultural area? == ethnic group percentage of population White British 43.4% Other White 14.6% Black African 7.9% In London, we find over 200 languages spoken and nearly one-third of the population was born abroad. It is considered the most multicultural city in Europe for some. As seen in the table above, only 43.4% are white British. This is because most of them are moving to the countryside instead of the city, which is a rural migration. It is a city filled with culturally diverse areas, especially Chinatown with its Chinese bakeries, restaurants, and supermarkets/stores, Camden Town and Brixton that was declared as the unofficial capital of British, African, and Caribbean descent. It is also home to many religions. ==References== ==Other websites== *https://strawberrytours.com/london/neighbourhoods/the-multicultural *https://www.ucl.ac.uk/students/news/2020/dec/ucl-heart-multicultural-london *https://www.multiculturaluk.com Category:British culture",
 "title": "Multiculturalism in the United Kingdom"
}