{
 "id": "921563",
 "text": "The Bikini atoll is a group of islands (an atoll) in the Pacific Ocean. It is part of the Ralik chain. Today, it is part of the Marshall Islands. It used to be known as Eschscholtz Atoll. The atoll is made of 23 islands, which have a surface area of . The lagoon is about by , and has a surface area of about . The lagoon has a depth of up to . The two biggest islands are Bikini, at and Enyu, at . Majuro, the capital of the Marshall Islands, is about to the south. New Guinea is about to the southwest. == Nuclear tests == Today, the atoll is mostly known for many nuclear tests, done by the US government in the 1940s, and 1950s. In 1946, about 200 people were moved from these two islands, all other islands of the atoll were uninhabited. The people were moved to the smaller Rongerik Atoll, which was uninhabited at the time. Over 42.000 people were taking part in the nuclear tests. In total, 67 tests were done. In the 1970s, about 100 people again moved to the islands, but they had to leave again, because high levels of Strontium-90 and Caesium-137 were found. Today, the atoll is largely uninhabited, except for a few caretakers. == Problems with islanders returning == Even though the atoll may be habitable again soon, there's a problem: Many of the Bikini islanders (or their offspring) have never lived on the island, and haven't even visited it. There's a high unemployment rate on the Marshall islands. As the Marshall islands have a special agreement with the United States, unemployed people from the Marshall islands can go look for jobs in the United States. It is therefore unclear how many of the original islanders or their offspring will return to the atoll. == Gallery == File:Bikini Atoll Nuclear Test Site-115009.jpg|American bunker located in the island File:Bikini Atoll Nuclear Test Site-115011.jpg|Rear of bunker File:Bikini Atoll Nuclear Test Site-115013.jpg|The island seen from above File:Bikini Atoll Nuclear Test Site-115015.jpg|Entrance sign to the island File:Bikini Atoll Nuclear Test Site-115017.jpg|View of the coast from above Category:Marshall Islands",
 "title": "Bikini Atoll"
}