{
 "id": "9217",
 "text": "1923 (MCMXXIII) was a common year starting on Monday in the Gregorian calendar. Beginning in February of this year, the Julian calendar was relegated to church use only. This happened after Greece adopted the Gregorian calendar. 1923 was the first year to be in the public domain under the Copyright Extension Act. It entered the public domain in 2019. == Events == * January 1 – Grouping of all UK railway companies into four larger companies * January 10 – Lithuania seizes and annexes Memel * January 11 – Troops from France and Belgium occupy the Ruhr area to force Germany to pay its reparation payments * February 16 – Howard Carter unseals the burial chamber of Pharaoh Tutankhamun * February 22 – Barcelona (Catalonia): Albert Einstein visits the city, invited by the scientist Esteban Terradas i Illa, as part of the monografics course of High Studies and Exchange organized by the Mancomunitat de Catalunya and conducted by Rafael de Campalans. * March – Antigone by Jean Cocteau appears on a Paris stage. Settings by Pablo Picasso, music by Arthur Honegger, and costumes by Gabrielle Chanel. Antonin Artaud played the part of Tiresias. * March 1 – USS Connecticut decommissioned * March 2 – Time Magazine hits newsstands for the first time * March 9 – Vladimir Lenin suffers a stroke, his third, which renders him bedridden and unable to speak; consequently he retires his position as Chairman of the Soviet government. * April – End of Irish Civil War * April 12 – Kandersteg International Scout Centre came into existence. * April 23 – Ceremonial inauguration of Gdynia Seaport * April 26 – Wedding of Prince Albert and Lady Elizabeth Bowes-Lyon in Westminster Abbey * May 23 – Launch of Belgium's SABENA Airlines * May 27 – Ku Klux Klan defies law requiring publication of its members * June 9 – Military coup in Bulgaria – prime minister Aleksandar Stamboliyski is ousted (he is killed June 14) * June 18 – Etna volcano erupts – 60.000 made homeless == Births == === January === * January 15 – Lee Teng-hui, 4th President of the Republic of China (d. 2020) * January 25 – Arvid Carlsson, Swedish neuroscientist (d. 2018) * January 31 – Norman Mailer, American writer and journalist (d. 2007) === February === * February 4 - Conrad Bain, Canadian- American actor (d. 2013) * February 4 – Belisario Betancur, 26th President of Colombia (d. 2018) * February 12 – Franco Zeffirelli, Italian film director (d. 2019) === March === * March 22 – Marcel Marceau, French actor (d. 2007) === April === * April 5 – Nguyễn Văn Thiệu, 2nd President of South Vietnam (d. 2001) * April 22 – Bettie Page, American model (d. 2008) === May === * May 7 – Anne Baxter, American actress (d. 1985) * May 10 – Heydar Aliyev, 3rd President of Azerbaijan (d. 2003) * May 14 – Alfredo Pieroni, Italian writer and journalist (d. 2011) * May 27 – Henry Kissinger, 56th United States Secretary of State (d. 2023) * May 28 – N. T. Rama Rao, Indian actor, director and politician (d. 1996) * May 31 – Rainier III, Prince of Monaco (d. 2005) === June === * June 25 – Sam Francis, American painter (d. 1994) === July === * July 6 – Wojciech Jaruzelski, 1st President of Poland (d. 2014) * July 11 – Richard Pipes, Polish-American academic and political expert (d. 2018) * July 25 – Estelle Getty, American actress (d. 2008) === August === * August 2 – Shimon Peres, 9th President of Israel (d. 2016) * August 10 – Rhonda Fleming, American actress (d. 2020) === September === * September 16 – Lee Kuan Yew, 1st Prime Minister of Singapore (d. 2015) === October === * October 4 – Charlton Heston, American actor and political activist (d. 2008) * October 5 – Glynis Johns, Welsh stage and film actress, dancer, pianist and singer (d. 2024) * October 15 – Italo Calvino, Italian writer (d. 1985) === November === * November 18 – Alan Shepard, American astronaut (d. 1998) === December === * December 13 – Philip W. Anderson, American Nobel physicist (d. 2020) == Deaths == * February 10 – Wilhelm Röntgen, German physician and Nobel Prize laureate == Nobel Prize == * Nobel Prize in Physiology or Medicine won by Frederick Banting, Canadian doctor, and John James Rickard Macleod, Scottish physiologist",
 "title": "1923"
}