{
 "id": "921971",
 "text": "Rajesh Singh Dayal (born 1968) is an Indian businessperson, movie producer and renowned social worker. He is the founder and managing director of Dayal Group. Rajesh Singh Dayal is a renowned Indian social worker and philanthropist, widely recognized as the \"Medicine Man of Uttar Pradesh\" for his tireless efforts in providing free healthcare services to marginalized communities. He is also noted for producing Hindi movies, Fareb (2005) and Anwar (2007). Dayal received the Mahatma Gandhi Award in the House of Commons of the United Kingdom. The Chief Minister of Uttar Pradesh state Yogi Adityanath awarded him the Uttar Pradesh Ratna Award in 2020. == Early life and education == He was born in 1968 in Varanasi, India and was raised in Lucknow. His education is BSC, LLM . He ventured into business in 1997 and founded his company, Dayal Group of Companies, which is into real estate, education, health and movie production. In 2005, Singh produced the Bollywood movie, Fareb, starring Manoj Bajpayee. He produced the romantic thriller Anwar in 2007. He founded Kunwar's Global School in Lucknow, which is run by Kunwar's Education Foundation, where Singh serves as the chairman. == Filmography == Year Movie Notes 2005 Fareb Producer 2007 Anwar Producer == Social Work and Healthcare Initiatives == Mr. Rajesh Kumar Singh, always had a soft side whenever called on the social front and this cause gained further strength when his son Kunwar left for heavenly abode at the tender age of 20. Mr. Rajesh gradually rose to become one of the pioneering social activist and educationist of Lucknow. He has established Kunwar Lives and Kunawar’s Educational Foundation in Lucknow in the memory of his son Kunwar with a purpose to spread education among the young generation, belonging to rural areas, and more specifically, to underprivileged classes of the society. Dayal's journey as a social worker founded Rajesh Singh Dayal Foundation, a non-profit organization aimed at providing accessible healthcare services to rural and underprivileged populations. == Achievements == * 2 Lakh+ Beneficiaries: Provided free healthcare services to over 200,000 individuals. * Rural Outreach: Established free health camps in 500+ rural villages, improving access to medical care. * Community Empowerment: Trained 500+ community health workers, promoting health literacy and self- sustainability.https://www.bhaskar.com/local/uttar-pradesh/ballia/news/free- health-facility-camp-of-rajesh-singh-dayal-foundation-132537551.html == Awards == * the Mahatma Gandhi Award in the House of Commons of the United Kingdom * The Chief Minister of Uttar Pradesh state Yogi Adityanath awarded him the Uttar Pradesh Ratna Award in 2020. * Quality mentor award in social service and education field by hon. Prime minster of Sri Lanka. * Visionaries Award 2017 by Deputy CM of UP Dr Dinesh Sharma. * Education Excellence Award Gold Award Dainik Jagran UP * In January 2022, he was given the Uttar Pradesh Ratna by Smriti Irani, the Minister of Women and Child Development in the Union Cabinet of India, for his contribution to education. * Rajesh Singh was awarded the Uttar Pradesh Ratna Award 2020 by UP Chief Minister Yogi Adityanath for his contribution to the field of education. * He was awarded the Distinguished Alumnus Award from Lucknow University in 2018. The award was given by UP Governor Ram Naik. * He was given the Mahatma Gandhi Award by the NRI Association of India in the House of Commons in London, United Kingdom. * In 2018, Singh was awarded the World Icon Award by the Prime Minister of Thailand in Bangkok. == References == ==Other websites== * * Official website Category:1968 births Category:Living people Category:Indian businesspeople Category:Indian movie producers Category:People from Lucknow",
 "title": "Rajesh Singh"
}