{
 "id": "92207",
 "text": "Citizenship of the European Union was started by the Maastricht Treaty signed in 1992. It is extra to being a citizen of one of the member countries of the European Union, and gives extra rights to nationals of European Union Member States. == History == Before the Maastricht Treaty (1992), the European Communities treaties allowed workers, and their families, to travel and live in any member country. This idea started when the European Coal and Steel Community was set up by the Treaty of Paris in 1951.Treaty of Paris Article 69 . This allowed workers in the coal and steel industries to move to another country for work. In 1957, the European Economic Community was set up by the Treaty of Rome. That treaty allowed all workers to move freely.Treaty of Rome Title 3 . The European Court of Justice took a wider idea of freedom of movement. The Court said people should be allowed to move to another country to get a better life style, not just to earn more money by working.Case 53/81 D.M. Levin v Staatssecretaris van Justitie. The law made by the European Court, the reason the reason a worker wanted to move abroad does not matter, they could start part-time and full-time work, and get extra help from the new country. Case 139/85 R. H. Kempf v Staatssecretaris van Justitie. Other decisions of the ECJ allowed any citizen of a member country live anywhere in the EU Joined cases 286/82 and 26/83 Graziana Luisi and Giuseppe Carbone v Ministero del Tesoro. Case 186/87 Ian William Cowan v Trésor public. and be treated the same as a citizen of the new country.Advocate General Jacobs' Opinion in Case C-274/96 Criminal proceedings against Horst Otto Bickel and Ulrich Franz at paragraph [19]. == Start of EU Citizenship == The idea of EU citizenship was started by the Maastricht Treaty, and was extended by the Treaty of Amsterdam. The Treaty of Amsterdam said that union citizenship will not replace national citizenship, but only be extra it.This rendered the provision to the same effect in Protocol no. 5 on the position of Denmark in the Treaty on the European Union superfluous. See == Who is an EU citizen? == Article 17 (1) of the amended EC TreatyTreaty of Rome (consolidated version) states that > Citizenship of the Union is hereby established. Every person holding the > nationality of a Member State shall be a citizen of the Union. Citizenship > of the Union shall complement and not replace national citizenship. == Rights of EU citizens == === Specific rights === The amended EC Treaty provides the following rights to EU citizens: * The right to be treated the same as citizens of the country where they live. (Article 12); * The right to move and live anywhere in the EU, and to apply for any job. EU citizens have the right to work for the government too, but not for some jobs in areas like defence and national security. (Article 18); * The rights to vote or be a candidate in local and European elections in any Member State under the same conditions as the nationals of that state (Article 19); * the right to protection by the diplomatic or consular authorities of any EU country when in a non-EU Member Country, if there are no diplomatic or consular authorities from the citizen's own country (Article 20); * The right to ask for help from the European Parliament, or from the European Ombudsman if any EU body has acted badly. (Article 21);This right also extends to \"any natural or legal person residing or having its registered office in a Member State\": Treaty of Rome (consolidated version), Article 194. * The right to contact the EU bodies in one of the official languages and to get a reply in that same language (Article 21); and * The right to get European Parliament, Council and Commission documents (Article 255). Citizens of new countries which join the EU can have some of the rights limited for up to seven years after they join. == Brexit == The United Kingdom has left the European Union. It is still unclear whether UK citizens will continue to enjoy EU citizenships after Brexit.Brexit: How would no deal affect UK citizens in the EU? - BBC News ==Related pages== * Treaty of Lisbon == Further reading == * * * * * == References == Category:Law in Europe Category:European Union Category:International law Category:Citizenship",
 "title": "Citizenship of the European Union"
}