{
 "id": "922114",
 "text": "José Andrade (22 November 1901 - 5 October 1957) is an Uruguayan footballer. He enjoyed great success as a player for the Uruguay national football team, with which he also won the first World Cup. Andrade was described as an intelligent and calm player who never celebrated his goals exuberantly. He was a dynamic, fast and highly technical player who was able to dominate on the pitch without influencing his teammates. During his prime he was considered as one of the greatest defensive midfielders in the world. ==Early days== Andrade was born in Salto in 1901 to an Argentine mother. José Ignacio Andrade, who is said to have been his father, is listed on his birth certificate as a witness. The elder Andrade, who was 98 years old when José Leandro Andrade was born, was an expert in African magic and is said to be an African-born slave who escaped from Brazil. At an early age, Andrade went to live with his aunt in a slum in Montevideo. Prior to the introduction of professional football in Uruguay, Andrade held a number of jobs. At one point he worked as a carnival musician, playing mainly the drums. At various times in his life he also worked as a shoe shiner and as a newsboy. ==Club career== In addition to his passion for music, Andrade was an avid footballer. In youth he played football for Miramar Misiones. In the early 1920s, Andrade signed with Bella Vista, where he went on to play 71 games and score 7 goals. It was at Bella Vista that Andrade was first selected to the national team. Andrade later moved to Nacional where he became four-time Uruguayan champions and three national cups. In 1930, Andrade moved to CA Peñarol, where he played 88 games in the years that followed. Andrade had previously trained with the club as a teenager but was not hired at the time. From the mid - 1930s, Andrade played for several Argentine clubs including CA Atlanta and CA Lanús CA Talleres. He also played a short stint with Wanderers in Uruguay before ending his career. ==International career== Andrade played 34 caps for the Uruguay national football team between 1923 and 1930, scoring once. ===South American Championship=== Andrade won the South American Championship (predecessor to the Copa América ) of 1923, 1924 and 1926. ===1924 Summer Olympics=== Andrade won his first Olympic gold medal at the 1924 Summer Olympics in Paris. He was recognized as the first black international footballer in the Olympics. He was nicknamed maravilla negra ( the black miracle ), a nickname later used for Pelé. After winning the Summer Olympics, the Uruguayans were challenged by Argentina to a diptych. In the second game at the Estadio Sportivo Barracas in Buenos Aires, Andrade was pelted with stones by the Argentine crowd, to which Andrade and his teammates responded by throwing the stones back. In the ensuing riots, a teammate was arrested and the Uruguayans refused to play out the rest of the game. ===1928 Summer Olympics=== In 1928 Andrade won his second Olympic gold medal at the 1928 Summer Olympics, held in Amsterdam. During the semi-final against Italy, Andrade collided with one of the goal posts, resulting in a serious injury to his eye. This later deteriorated to the point that he became blind in that eye. ===1930 FIFA World Cup=== Despite not being at his peak, Andrade managed to become one of Uruguay's best players in the tournament, which the Uruguayans won. At the end of the tournament, he was named to the \"All-Star team\". In 1994 he was selected by France Football as number ten in their World Cup Top 100. A plaque was placed in the Estadio Centenario in honor of his achievements. ==Life after football== Andrade was a guest at the 1950 World Cup, when Uruguay won the tournament for the second time. His cousin Víctor Rodríguez Andrade, a member of the 1950 winning team, had adopted Andrade as his middle name in honor of José Leandro Andrade. In 1956, when he was discovered by the German journalist Fritz Hack, he had descended from alcoholism and was living in a small flat in a poor area of Montevideo. Andrade died in 1957 in the Piñeyro del Campo nursing home in Montevideo from the effects of tuberculosis. His burial took place at Cementerio del Cerro, Montevideo. ==Honours== ===Club=== ;Nacional *Primera División Uruguaya *1924: Winner *1929: Runner-up ;Peñarol *Primera División Uruguaya *1932: Winner, 1935: Winner *1933: Runner-up, 1934: Runner-up ===International=== ;Uruguay *Olympic Games *Gold medal: 1924, 1928 *FIFA World Cup *Winner: 1930 *South American Championship *Winner: 1923, 1924, 1926 *Runner-up: 1927 *Third place: 1929 ===Individual=== *IFFHS World Player of the 20th Century: 29th place *South American Championship: Best Player 1926 *FIFA World Cup: Bronze Ball 1930 *FIFA World Cup: All-Star Team 1930 *France Football's World Cup Top-100 1930–1990: 10th ==References== ==Other websites== Category:1901 births Category:1957 deaths Category:Uruguayan footballers Category:Association football midfielders Category:Olympic medalists for Uruguay Category:Olympic gold medalists Category:Olympic medalists in football Category:Deaths from tuberculosis Category:1930 FIFA World Cup players",
 "title": "José Andrade"
}