{
 "id": "922233",
 "text": "Bridgerton is an American series created by Chris Van Dusen and produced by Shonda Rhimes. It is based on Julia Quinn's novels set in the Regency era. It is Rhimes's first scripted Netflix show. Bridgertons first season was released on Netflix on December 25, 2020. In April 2021, it was announced the series had been renewed for a third and fourth season. In May 2023, Queen Charlotte: A Bridgerton Story, a spin-off series focused on Queen Charlotte, was released. ==Plot== The Bridgerton siblings – Anthony, Benedict, Colin, Daphne, Eloise, Francesca, Gregory and Hyacinth – navigate the high London society in search of love, surrounded by friends and rivals . Each episode includes narration by Julie Andrews, who voices the anonymous and scandalous newsletter writer known as Lady Whistledown, who has knowledge of all the information in London, drawing everyone's interest, even Queen Charlotte. Unlike the novel, the show is set in a racially integrated London where people of color are members of the high society of London at that time , some with titles granted by the queen. Van Dusen says the series is not \"color-blind\" because \"that would imply that color and race were never considered, when color and race are part of the show.\" ==Cast and characters== ===Main=== * Adjoa Andoh as Lady Danbury, a sharp-tongued, insightful lady in the London society * Lorraine Ashbourne as Mrs. Varley, the Featheringtons' housekeeper * Jonathan Bailey as Anthony, Viscount Bridgerton, the eldest Bridgerton son and head of the family * Ruby Barker as Lady Marina Crane (née Thompson) (season 1; guest season 2), a Featherington cousin * Sabrina Bartlett as Siena Rosso (season 1), an opera singer and Anthony's lover * Harriet Cains as Philippa Finch (née Featherington), the middle Featherington daughter * Bessie Carter as Prudence Featherington, the eldest Featherington daughter * Nicola Coughlan as Penelope Featherington, the youngest Featherington daughter and close friend of Eloise Bridgerton * Phoebe Dynevor as Daphne Basset, Duchess of Hastings (née Bridgerton), the fourth Bridgerton child and eldest daughter * Ruth Gemmell as Violet, Dowager Viscountess Bridgerton, mother of the Bridgerton children * Florence Hunt as Hyacinth Bridgerton, the eighth and youngest Bridgerton child * Claudia Jessie as Eloise Bridgerton, the fifth Bridgerton child and second daughter * Ben Miller as Archibald, Baron Featherington (season 1), the patriarch of the Featherington family * Luke Newton as Colin Bridgerton, the third Bridgerton son * Regé-Jean Page as Simon Basset, Duke of Hastings (season 1), one of London's most eligible bachelors who has refused to marry * Golda Rosheuvel as Queen Charlotte, Queen of the United Kingdom of Great Britain and Ireland * Luke Thompson as Benedict Bridgerton, the second Bridgerton son and an artist * Will Tilston as Gregory Bridgerton, the seventh Bridgerton child and youngest son * Polly Walker as Portia, Baroness Featherington, the matriarch of the Featherington family * Dame Julie Andrews as the voice of Lady Whistledown, the author of the scandalous-based newsletter * Simone Ashley as Kathani \"Kate\", Viscountess Bridgerton (née Sharma) (season 2) * Charithra Chandran as Edwina Sharma (season 2) * Shelley Conn as Lady Mary Sheffield Sharma (season 2) * Rupert Young as Lord Jack Featherington (season 2) * Martins Imhangbe as Will Mondrich (season 2; recurring season 1), a boxer and a close friend of the Duke of Hastings based on the real-life Bill Richmond * Calam Lynch as Theo Sharpe (season 2), a worker at the print shop where Lady Whistledown is published, as well as a friend-turned-love interest of Eloise ===Recurring=== * Ruby Stokes as Francesca Bridgerton, the sixth Bridgerton child and third daughter. * Molly McGlynn as Rose Nolan, Daphne's loyal maid and friend * Joanna Bobin as Lady Cowper, Cressida's mother * Jessica Madsen as Cressida Cowper * Jason Barnett as Jeffries * Hugh Sachs as Brimsley, the Queen's gossip-mongering secretary * Geraldine Alexander as Mrs. Wilson, the Bridgerton housekeeper * Kathryn Drysdale as Genevieve Delacroix, a high society (dressmaker) * Simon Ludders as Humboldt * Julian Ovenden as Sir Henry Granville, an artist who befriends Benedict. ==Filming== Filming for the first season commenced in July 2019 and ended in late February 2020. Bridgerton was filmed in London and Bath, as well as at various estates and parks around England. Although the series takes place in London, most street scenes were filmed in Bath, York, and Chatham. The grounds of Wilton House were used for Hyde Park and the grounds of Somerley were used for Hampstead Heath. Garden scenes were filmed at Painshill near Cobham and the Commissioner's House in Chatham. Filming locations included Ranger's House in Greenwich (standing in for the Bridgerton House exterior); Halton House at RAF Halton (Bridgerton House interior, Featheringtons' interior); Wilton House (Simon's Hastings House, Clyvedon estate interior, throne room); Syon House and Badminton House (Hastings House); Castle Howard (Clyvedon estate); Coneysthorpe (Clyvedon village); Hampton Court Palace and Lancaster House (St. James's Palace); Holburne Museum (Lady Danbury's estate); Hatfield House (Featheringtons' interior); No. 1 Royal Crescent Production on the second season began in March 2021. Production for the second season ended on November 20, 2021. The third season began principal filming in July 2022 and ended in March 2023. ==Music== Kris Bowers arranged the songs and soundtrack of the series. The series included contemporary covers from popular songs such as Ariana Grande's \"Thank u next\" and Taylor Swift's \"Wildest dream\". The first season of the series featured 19 songs and soundtracks. ==Release== The first season of Bridgerton was released on December 25, 2020. The teaser and promotional posters were released in the months prior. The second season was released on March 25, 2022. The first part of season 3 premiered on May 16, 2024, with four episodes. The second and final part premiered on June 13, 2024. ==Reception== For the first season, the website Rotten Tomatoes reported an approval rating of 87% based on 97 reviews, with an average rating of 7.9/10. For the second season, Rotten Tomatoes reported an approval rating of 79% based on 76 reviews, with an average rating of 7.1/10. For part one of the third season, Rotten Tomatoes reported an approval rating of 87% based on 71 reviews, with an average rating of 7.0/10. ===Awards and Nominations=== Year Award Category Nominees Result Ref. 2021 AFI Awards Top Television Program Bridgerton British Academy Television Awards Virgin TV's Must-See Moment \"Penelope is revealed as Lady Whistledown\" Costume Designers Guild Awards Excellence in Period Television Ellen Mirojnick and John W. Glaser III (for \"Diamond of the First Water\") Directors Guild of America Awards Outstanding Directorial Achievement in Dramatic Series Julie Anne Robinson (for \"Diamond of the First Water\") Hollywood Critics Association TV Awards Best Streaming Series, Drama Bridgerton Best Actor in a Streaming Series, Drama Regé-Jean Page Hollywood Music in Media Awards Best Original Score in a TV Show/Limited Series Kris Bowers Make-Up Artists and Hair Stylists Guild Awards Best Television Series, Limited or Miniseries or New Media Series – Best Period and/or Character Make- Up Marc Pilcher, Lynda J. Pearce, Claire Matthews and Louise Bannell Best Television Series, Limited or Miniseries or New Media Series – Best Period and/or Character Hair Styling Marc Pilcher, Lynda J. Pearce, Adam James Phillips and Tania Couper Motion Picture Sound Editors Awards Outstanding Achievement in Sound Editing – Music Score and Musical for Episodic Long Form Broadcast Media Brittany DuBay (for \"Shock and Delight\") MTV Movie & TV Awards Best Show Bridgerton Best Breakthrough Performance Regé-Jean Page Best Kiss Regé-Jean Page and Phoebe Dynevor NAACP Image Awards Outstanding Drama Series Bridgerton Outstanding Actor in a Drama Series Regé-Jean Page Outstanding Supporting Actress in a Drama Series Adjoa Andoh Primetime Emmy Awards Outstanding Drama Series Chris Van Dusen, Shonda Rhimes, Betsy Beers, Scott Collins, Alison Eakle, Sara Fischer, Julia Quinn, Leila Cohan-Miccio, Jonathan Igla, Janet Lin, Holden Chang, Sarah Dollard and Sarada McDermott Outstanding Lead Actor in a Drama Series Regé-Jean Page Outstanding Directing for a Drama Series Julie Anne Robinson Primetime Creative Arts Emmy Awards Outstanding Character Voice-Over Performance Julie Andrews Outstanding Casting for a Drama Series Kelly Valentine Hendry Outstanding Cinematography for a Single-Camera Series (One Hour) Jeffrey Jur Outstanding Period Costumes Ellen Mirojnick, John W. Glaser III, Sanaz Missaghian and Kenny Crouch Outstanding Period and/or Character Hairstyling Marc Pilcher, Lynda J. Pearce, Claire Matthews, Adam James Phillips, Tania Couper and Lou Bannell Outstanding Music Composition for a Series (Original Dramatic Score) Kris Bowers Outstanding Original Main Title Theme Music Kris Bowers and Michael Dean Parsons Outstanding Music Supervision Alexandra Patsavas Outstanding Production Design for a Narrative Period or Fantasy Program (One Hour or More) Will Hughes- Jones, Dominic Devine and Gina Cromwell Producers Guild of America Awards Norman Felton Award for Outstanding Producer of Episodic Television – Drama Chris Van Dusen, Shonda Rhimes, Betsy Beers, Scott Collins, Alison Eakle, Sara Fischer, Sarada McDermott, Holden Chang and Tom Verica Satellite Awards Best Actor in a Drama Series Regé-Jean Page Best Actress in a Drama Series Phoebe Dynevor Screen Actors Guild Awards Outstanding Performance by an Ensemble in a Drama Series Cast of Bridgerton Outstanding Performance by a Male Actor in a Drama Series Regé-Jean Page Television Critics Association Awards Program of the Year Bridgerton Outstanding Achievement in Drama Outstanding New Program Rose d'Or Drama 2022 Grammy Awards Best Score Soundtrack for Visual Media Kris Bowers ==Impact== Fashion and interior design trends inspired or made popular by the series have been called \"Regencycore\" or \"the Bridgerton effect.\" Lyst saw an increase in searches for items such as corsets, headpieces, and elbow-length gloves after the series' premiere. The series' female leads, Daphne and Kate, were also connected to a popularity in the colors sky blue and lilac respectively. ==References== ==Other websites== * Category:2010s American drama television series Category:2020 American television series debuts Category:Netflix original series *[Ref.]: Reference",
 "title": "Bridgerton"
}