{
 "id": "922672",
 "text": "Mickey Mouse Funhouse is an American computer-animated children's TV series created by Phil Weinstein and Thomas Hart. It's on Disney Junior. ==Schedule== The series debuted with a special on July 16, 2021, and was followed by the official premiere on Disney Junior on August 20. In October 2021, the series was renewed for a second season. Disney Junior created the series to continue its pattern of original pre-school animated series set within the Mickey Mouse universe. Many key members of the creative team of Mickey Mouse Mixed-Up Adventures developed the series. ==Premise== Mickey Mouse returns with his friends Minnie Mouse, Donald Duck, Daisy Duck, Goofy and Pluto. The friends meet Funny, an energetic playhouse. Funny magically moves the group of friends to a range of destinations which allows them to embark on adventures unique to that land. He can also change his shape and to match the new surroundings. He can even project his face on any surface to talk with Mickey and friends. ==Cast and characters== ===Main=== * Bret Iwan as Mickey Mouse and Martian Mickey * Kaitlyn Robrock as Minnie Mouse and Martian Minnie * Tony Anselmo as Donald Duck * Tress MacNeille as Daisy Duck and Chip * Bill Farmer as Goofy, Pluto, Horace Horsecollar and Mayor McBeagle * Harvey Guillén as Funny, an enchanted talking playhouse. * Jim Cummings as Pete * Corey Burton as Ludwig Von Drake and Dale * April Winchell as Clarabelle Cow and Hilda * Nika Futterman as Cuckoo Loca ===Recurring=== * Jan Johns as Farfus, Goldie and Sunny * Brock Powell as Teddy, Sneezel, Lefty and Magic Mirror * Frank Welker as Figaro * Dee Bradley Baker as Yeti and additional voices * Richard Kind as Cheezel * Jenifer Lewis as Wheezelene * Rogelio Douglas Jr. as Royal Troubadour * Kayvan Novak as Trolland * Mickey Guyton as Wanda Warbler * Will Ryan as Willie the Giant * Maurice LaMarche as Mortimer Mouse * Sivan Alyra Rose as Crystal Clearwater ===Guest appearances=== * Daniel Ross as Zoop Bloop * John Stamos as Captain Salty Bones * Jaime Camil as Rocket Mouse * Amanda Seales as Annie ==Episodes== ===Series overview=== ===Special (2021)=== ===Season 1 (2021–22)=== ==References== ==Other websites== * * Category:2020s American animated television series Category:American children's television series Category:2021 American television series debuts Category:English- language television programs Category:2020s American television series Category:Television series by Disney",
 "title": "Mickey Mouse Funhouse"
}