{
 "id": "92261",
 "text": "The Golden Horse Film Festival and Awards or simply Golden Horse is a movie festival and awards ceremony held annually in Taiwan. The ceremony usually takes place in November or December in Taipei. The awards, contested by movies submitted from Taiwan, Hong Kong, China and elsewhere, are generally held to be the most prestigious for Chinese language movies outside the People's Republic of China. The awards ceremony is held after the month-long movie festival, which showcases some of the nominated movies for the awards. Winners are selected by a jury of judges during the week before the ceremony is held. Winners are awarded with a golden horse statuette. Under current rules and regulations, every movie made primarily in any dialect of Chinese language is eligible for competition. Since 1996, almost any artist or movie from mainland China was allowed to enter the movie festival. ==Awards ceremonies== Ceremony Date Host(s) Location Television channel 1st 31 October 1962 Wang Yun-wu Taipei Guo Guang Cinema 2nd 31 October 1963 — 3rd 30 October 1965 James Shen Taipei Zhongshan Hall 4th 30 October 1966 — 5th 30 October 1967 BCC (Live) 6th 30 October 1968 Huang Shao-ku 7th 30 October 1969 Chung Chiao-kuang 8th 30 October 1970 — 9th 30 October 1971 Lo Yun-ping 10th 30 October 1972 — 11th 30 October 1973 12th 30 October 1975 13th 30 October 1976 Ting Mao-shih — 14th 30 October 1977 Hsu Ching-chung 15th 31 October 1978 Wang Hao, Ivy Ling Po 16th 2 November 1979 Chiang Kuang Chao, Sylvia Chang Sun Yat-sen Memorial Hall (Taipei) 17th 3 November 1980 18th 30 October 1981 Li Tao, Josephine Siao Kaohsiung Cultural Center CTS 19th 24 October 1982 Terry Hu, Chiang Kuang-chao Sun Yat-sen Memorial Hall (Taipei) CTV 20th 16 November 1983 Sun Yueh, Tien Niu Kaohsiung Cultural Center TTV 21st 18 November 1984 Wang Kuan-hsiung, Yao Wei Sun Yat-sen Memorial Hall (Taipei) CTS 22nd 3 November 1985 Sun Yueh, Terry Hu Kaohsiung Cultural Center 23rd 30 November 1986 Chang Hsiao-yen, Eric Tsang Taipei Cultural Center 24th 29 October 1987 Chang Hsiao-yen, David Tao CTS 25th 5 November 1988 Sylvia Chang, David Tao Taipei Gymnasium TTV 26th 9 December 1989 Ba Ge, Yin Shia National Theater and Concert Hall, Taipei CTV 27th 10 December 1990 Chang Hsiao-yen, James Wong CTS 28th 4 December 1991 Raymond Lam, Sibelle Hu TTV 29th 12 December 1992 Chang Hsiao-yen, Lawrence Cheng Sun Yat-sen Memorial Hall (Taipei) CTV 30th 4 December 1993 Sun Yueh, Fang Fang-fang 31st 10 December 1994 Regina Tsang, Kenny Bee, Chang Shih 32nd 9 December 1995 Chang Hsiao-yen, Sylvia Chang 33rd 14 December 1996 Hu Gua, Cally Kwong Kaohsiung Cultural Center CTS, Star Chinese Movies 34th 13 December 1997 Hsui Hao-ping, Sandra Ng Sun Yat-sen Memorial Hall (Taipei) ETTV 35th 12 December 1998 Isabel Kao, Jacky Wu CTV, Star Chinese Movies 36th 12 December 1999 Wakin Chau, Matilda Tao TVBS Entertainment Channel 37th 2 December 2000 Matilda Tao, Stephen Fung, Nicky Wu Much TV 38th 8 December 2001 Kevin Tsai, Isabel Kao Hualien Stadium EBC 39th 16 November 2002 Carol Cheng, Kevin Tsai Kaohsiung Cultural Center TVBS Entertainment Channel 40th 13 December 2003 Tainan Municipal Cultural Center 41st 4 December 2004 Kevin Tsai, Lin Chi-ling Zhongshan Hall (Taichung) 42nd 13 November 2005 Hu Gua, Patty Hou Keelung Cultural Center Azio TV 43rd 25 November 2006 Kevin Tsai, Patty Hou Taipei Arena 44th 8 December 2007 Pauline Lan, Blackie Chen, Angela Chow Star Chinese Movies, Phoenix Television 45th 6 December 2008 Carol Cheng, Blackie Chen Zhongshan Hall (Taichung) Star Chinese Movies 46th 28 November 2009 Matilda Tao New Taipei City Hall Azio TV 47th 20 November 2010 Kevin Tsai, Dee Hsu Taoyuan Arts Center TTV 48th 26 November 2011 Eric Tsang, Bowie Tsang Hsinchu Performing Arts Center 49th 24 November 2012 Bowie Tsang, Huang Bo Luodong Cultural Factory 50th 23 November 2013 Kevin Tsai Sun Yat-sen Memorial Hall (Taipei) 51st 22 November 2014 Mickey Huang, Ella Chen 52nd 21 November 2015 Mickey Huang, Lin Chi-ling 53rd 26 November 2016 Matilda Tao 54th 25 November 2017 55th 17 November 2018 56th 23 November 2019 57th 21 November 2020 58th 27 November 2021 Austin Lin 59th 19 November 2022 Hsieh Ying-xuan 60th 25 November 2023 Lulu Huang Lu Zi Yin ==Award categories== ===Current categories=== English name First awarded Best Narrative Feature 1962 Best Documentary Feature 1962 Best Animated Feature 1977 Best Live Action Short Film 1996 Best Documentary Short Film 2021 Best Animated Short Film 2016 Best Director 1962 Best Leading Actor 1962 Best Leading Actress 1962 Best Supporting Actor 1962 Best Supporting Actress 1962 Best New Director 2010 Best New Performer 2000 Best Original Screenplay 1962 Best Adapted Screenplay 1962 Best Cinematography 1962 Best Visual Effects 1995 Best Art Direction 1965 Best Makeup & Costume Design 1981 Best Action Choreography 1992 Best Original Film Score 1962 Best Original Film Song 1979 Best Film Editing 1962 Best Sound Effects 1962 English name First awarded Outstanding Taiwanese Filmmaker of the Year 1997 Lifetime Achievement Award 1993 English name First awarded Audience Choice Award 1992 FIPRESCI Prize 2007 NETPAC Award 2007 Observation Missions for Asian Cinema Award 2015 ===Old categories=== English name First awarded Last awarded Outstanding Taiwanese Film of the Year 1997 2010 Best Director (Documentary) 1986 1988 Best Planning (Documentary) 1962 1980 Best Cinematography (Documentary) 1962 1980 Best News Film 1968 1970 Best Directing (News Film) 1968 1969 Best Cinematography (News Film) 1968 1969 Best Direction (Animation) 1977 1980 Best Child Star 1962 1984 Piaget Award for Best Original Screenplay 2013 2017 ==References== == Other websites == * 金馬獎官方網站 Golden Horse Official Website * The 42nd Golden Horse Film Festival and Awards * Cri.CN * Golden Horse 2005 * Golden Horse 2004 Category:Movie awards Category:Movie festivals Category:Taipei Category:Festivals in Asia",
 "title": "Golden Horse Film Festival and Awards"
}