{
 "id": "92287",
 "text": "{{Infobox writer | name = Langston Hughes | image = Langston Hughes by Carl Van Vechten (cropped).jpg | caption = 1942 portrait | birth_name = James Mercer Langston Hughes | birth_date = | birth_place = Joplin, Missouri, U.S. | death_date = | death_place = New York City, U.S. | occupation = | education = | period = 1926–1964 | relatives = }} James Mercer Langston Hughes (February 1, 1901 – May 22, 1967) was an American poet, novelist, playwright and short story writer. Hughes was one of the writers and artists whose work was called the Harlem Renaissance. Hughes grew up as a poor boy from Missouri, the descendant of African people who had been taken to America as slaves. At that time, the term used for African-Americans was \"negro\" which means a person with black skin. Most \"negroes\" did not remember or think about their link with the people of Africa, even though it was a big influence on their culture and, in particular, their music. Hughes was unusual for his time, because he went back to West Africa to understand more about his own culture. Through his poetry, plays, and stories, Hughes helped other black Americans to see themselves as part of a much bigger group of people, so that now the term \"African-American\" is used with pride. Hughes became a famous writer, but all his life he remembered how he started out, and he helped and encouraged many other struggling writers. == Life == === Childhood === Langston Hughes was born on February 1, 1901 in Joplin, Missouri. His parents were James Hughes and Carrie Langston Hughes who was a teacher. Langston's father, James Hughes, was so upset about the racism towards African-Americans that he left his family and moved to Mexico.West.Encyclopedia of the Harlem Renaissance, 2003, p.160 During his childhood, Hughes was cared for by his grandmother, in Lawrence, Kansas while his mother worked to support the family. Langston's grandmother was a great story teller. She told stories that made him feel proud to be an African-American. After his grandmother died, Hughes and his mother moved about 12 times until settling in Cleveland, and then, as a teenager went to live in Lincoln, Illinois with his mother, who had remarried. He was often left alone because his mother was at work. Even though his childhood was difficult and had lots of changes, he was able to use these things in the poetry that he started to write while he was at school. He never forgot the stories of his grandmother and tried to help other African-Americans when they were having problems. These were the people that he later wrote about in his own stories. When Hughes went to school in Lincoln, there were only two African-American children in the class. The teacher talked to them about poetry. She said that what a poem needed most was rhythm. Langston later said that he had rhythm in his blood because, \"as everyone knows\", all African-Americans have rhythm. The children made him the \"class poet\".Langston Hughes, Writer, 65, Dead. (May 23, 1967). The New York Times At high school in Cleveland, Ohio, Langston learned to love reading. He loved the poetry of the American poets Paul Laurence Dunbar and Carl Sandburg. He wrote articles for the school newspaper, he edited the school yearbook and he wrote his first short stories and plays. === Hughes' father and Columbia University === When Langston Hughes was 17, he went to spend some time with his father in Mexico. He was so unhappy while he was there that he thought about committing suicide. Hughes could not understand how his father felt. He said: \"I had been thinking about my father and his strange dislike of his own people. I didn't understand it, because I was a Negro, and I liked Negroes very much!\"Langston Hughes, The Big Sea (1940), pp.54-56 Hughes later wrote this poem: ::\"The night is beautiful, ::So the faces of my people. ::The stars are beautiful, ::So the eyes of my people ::Beautiful, also, is the sun. ::Beautiful, also, are the souls of my people.\"My People: First published as Poem in Crisis (Oct.1923), p. 162, and The Weary Blues (1926). The title My People was used in The Dream Keeper (1932) and the Selected Poems of Langston Hughes (1959). Rampersad, Arnold & Roessel, David (2002). In The Collected Poems of Langston Hughes. p.36 & p.623, Knopt. When he was finished at high school in Lincoln in 1920, he went back to Mexico, to ask his father to pay for him to go to university. Hughes' father was a lawyer and a wealthy landowner. He could afford to send his son to university but he made difficulties about it. He said that Hughes could only go to university if he went overseas and studied engineering. Hughes wanted to go to a university in the US. After a time, they made an agreement that he should go to Columbia University but study engineering, not an arts degree. He went to Columbia in 1921 but left in 1922, partly because of the racism in the university.Rampersad.vol.1, 1986, p.56 === Adult life === Until 1926 Hughes did many different types of work. In 1923 he went as a crewman on the ship \"S.S.Malone\" and went to West Africa and Europe. He left the ship and stayed for a short time in Paris where he joined several other African-Americans who were living there. In November 1924, Hughes returned to the U.S. to live with his mother in Washington, D.C.. In 1925 he got a job as an assistant to Carter G. Woodson who worked with the Association for the Study of African American Life and History. Hughes did not enjoy his work because he did not have enough time to write, so he left and got a job as a \"busboy\", wiping tables and washing dishes at a hotel. Hughes is sometimes called \"The Busboy Poet\". Meanwhile, some of his poems were published in magazines and were being collected together for his first book of poetry. While he was working at the hotel he met the poet Vachel Lindsay, who helped to make Hughes known as a new African-American poet. In 1926 Hughes began studying at Lincoln University, Pennsylvania. He had help from patrons, Amy Spingarn, who gave him $300 and \"Godmother\" Charlotte Osgood Mason.Rampersad. vol.1,1986,p.156 Hughes graduated with a Bachelor of Arts in 1929 and became a Doctor of Letters in 1943. He was also given an honorary doctorate by Howard University. For the rest of his life, except when he travelled to the Caribbean or West Indies, Hughes lived in Harlem, New York. Langston Hughes sometimes went out with women, but he never married. People who have studied his life and poetry are sure that he was homosexual. In the 1930s it was harder to be open about being gay than it is nowadays. His poetry has lots of symbols which are used by other homosexual writers. Hughes thought that men who had very dark skin were particularly beautiful. It seems from his poetry that he was in love with an African-American man. He also wrote a story which might tell of his own experience. Blessed Assurance is the story of a father's anger because his son is \"queer\" and acts like a girl.Nero, Charles I. (1997). \"Queer Representations: Reading Lives, Reading Cultures.\" In Martin Duberman (Ed.), Re/Membering Langston, p.192. New York University PressYale Symposium, Was Langston Gay? commemorating the 100th birthday of Hughes in 2002Schwarz, pp.68-88 Hughes' life and work were an important part of the Harlem Renaissance of the 1920s, alongside those Zora Neale Hurston, Wallace Thurman, Countee Cullen, Richard Bruce Nugent, and Aaron Douglas, who together started a magazine Fire!! Devoted to Younger Negro Artists. Hughes and these friends did not always agree with the ideas of some of the other African-American writers who were also part of the Harlem Renaissance because they thought their ideas were Middle class and that they treated others who had darker skin, less education and less money with discrimination.Berry, 1983 & 1992, p.60 All his life, Hughes never forgot the lessons that he learned about poor and uneducated African-Americans in the stories that his grandmother told. In 1960, the NAACP awarded Hughes the \"Spingarn Medal\" for \"distinguished achievements by an African American\". Hughes became a member of the National Institute of Arts and Letters in 1961. In 1973, an award was named after him, the \"Langston Hughes Medal\", awarded by the City College of New York. Hughes became a famous American poet, but he was always ready to help other people, particularly young black writers. He was worried that many young writers hated themselves, and expressed these feelings to the world. He tried to help people feel pride, and not worry about the prejudice of other people. He also tried to help young African-Americans not to express hatred and prejudice towards white Americans. Hughes wrote: ::\"The younger Negro artists who create now intend to express ::our individual dark-skinned selves without fear or shame. ::If white people are pleased we are glad. If they are not, ::it doesn't matter. We know we are beautiful. And ugly, too. ::The tom-tom cries, and the tom-tom laughs. If colored people ::are pleased we are glad. If they are not, their displeasure ::doesn't matter either. We build our temples for tomorrow, ::strong as we know how, and we stand on top of the mountain ::free within ourselves.\" :::(A tom-tom is an African drum) === Death === On May 22, 1967, Hughes died in New York City at the age of 65 after having surgery for prostate cancer. His ashes are buried under the floor of the Langston Hughes Auditorium in the Arthur Schomburg Center for Research in Black Culture in Harlem.Whitaker, Charles.Ebony magazine In Langston Hughes:100th birthday celebration of the poet of Black America. April 2002. Over his ashes is a circle with an African design called \"Rivers.\" At the centre of the design are words from a poem by Hughes: \"My soul has grown deep like the rivers.\" ::The Negro speaks of Rivers ::I've known rivers: ::I've known rivers ancient as the world and older than the ::flow of human blood in human veins. ::My soul has grown deep like the rivers. ::I bathed in the Euphrates when dawns were young. ::I built my hut near the Congo and it lulled me to sleep. ::I looked upon the Nile and raised the pyramids above it. ::I heard the singing of the Mississippi when Abe Lincoln ::went down to New Orleans, and I've seen its muddy ::bosom turn all golden in the sunset. ::I've known rivers: ::Ancient, dusky rivers. ::::::::My soul has grown deep like the rivers.The Negro Speaks of Rivers: First published in Crisis (June 1921), p.17. Included in The Weary Blues, Langston Hughes Reader, and Selected Poems. In The Weary Blues, the poem is dedicated to W.E.B. Du Bois. The dedication does not appear in later printings of the poem. Hughes' first and last published poems appeared in The Crisis; more of his poems appeared in The Crisis than in any other journal. Rampesad, Arnold & Roessel, David (2002). In The Collected Poems of Langston Hughes. p.23 & p.620, Knopf == Works by Langston Hughes == === Poetry === * The Weary Blues. Knopf, 1926 * Fine Clothes to the Jew. Knopf, 1927 * The Negro Mother and Other Dramatic Recitations, 1931 * Dear Lovely Death, 1931 * The Dream Keeper and Other Poems. Knopf, 1932 * Scottsboro Limited: Four Poems and a Play. N.Y.: Golden Stair Press, 1932 * Shakespeare in Harlem. Knopf, 1942 * Freedom's Plow. 1943 * Fields of Wonder. Knopf,1947 * One-Way Ticket. 1949 * Montage of a Dream Deferred. Holt, 1951 * Selected Poems of Langston Hughes. 1958 * Ask Your Mama: 12 Moods for Jazz. Hill & Wang, 1961 * The Panther and the Lash: Poems of Our Times, 1967 * The Collected Poems of Langston Hughes. Knopf, 1994 * Let America Be America Again 2005 === Fiction === * Not Without Laughter. Knopf, 1930 * The Ways of White Folks. Knopf, 1934 * Simple Speaks His Mind. 1950 * Laughing to Keep from Crying, Holt, 1952 * Simple Takes a Wife. 1953 * Sweet Flypaper of Life, photographs by Roy DeCarava. 1955 * Simple Stakes a Claim. 1957 * Tambourines to Glory (book), 1958 * The Best of Simple. 1961 * Simple's Uncle Sam. 1965 * Something in Common and Other Stories. Hill & Wang, 1963 * Short Stories of Langston Hughes. Hill & Wang, 1996 === Non-fiction === * The Big Sea. New York: Knopf, 1940 * Famous American Negroes. 1954 * Marian Anderson: Famous Concert Singer. 1954 * I Wonder as I Wander. New York: Rinehart & Co., 1956 * A Pictorial History of the Negro in America, with Milton Meltzer. 1956 * Famous Negro Heroes of America. 1958 * Fight for Freedom: The Story of the NAACP. 1962 === Major plays === * Mule Bone, with Zora Neale Hurston. 1931 * Mulatto. 1935 (renamed The Barrier, an opera, in 1950) * Troubled Island, with William Grant Still. 1936 * Little Ham. 1936 * Emperor of Haiti. 1936 * Don't You Want to be Free? 1938 * Street Scene (opera)|Street Scene, contributed lyrics. 1947 * Tambourines to glory. 1956 * Simply Heavenly. 1957 * Black Nativity. 1961 * Five Plays by Langston Hughes. Bloomington: Indiana University Press, 1963. * Jericho-Jim Crow. 1964 === Works for children === * Popo and Fifina, with Arna Bontemps. 1932 * The First Book of the Negroes. 1952 * The First Book of Jazz. 1954 * The First Book of Rhythms. 1954 * The First Book of the West Indies. 1956 * First Book of Africa. 1964 === Other === * The Langston Hughes Reader. New York: Braziller, 1958. * Good Morning Revolution: Uncollected Social Protest Writings by Langston Hughes. Lawrence Hill, 1973. * The Collected Works of Langston Hughes. Missouri: University of Missouri Press, 2001. == Notes == == References == : The references which follow are those used in the writing of the original article. * Aldrich, Robert (2001). Who's Who in Gay & Lesbian History. Routledge. * Bernard, Emily (2001). Remember Me to Harlem: The Letters of Langston Hughes and Carl Van Vechten, 1925-1964. Knopf. * Berry, Faith (1983.1992,). Langston Hughes: Before and Beyond Harlem. In On the Cross of the South, p. 150; & Zero Hour, p. 185-186. Citadel Press * Hughes, Langstong (2001). Fight for Freedom and Other Writings on Civil Rights (Collected Works of Langston Hughes, Vol 10). In Christorpher C. DeSantis (Ed). Introduction, p. 9\\. University of Missouri Press * Hutson, Jean Blackwell; & Nelson, Jill (February 1992). \"Remembering Langston\". Essence magazine, p. 96\\. * Joyce, Joyce A. (2004). A Historical Guide to Langston Hughes. In Steven C. Tracy (Ed.), Hughes and Twentieth-Century Genderracial Issues, p. 136\\. Oxford University Press * Nero, Charles I. (1997).Queer Reprensentations: Reading Lives, Reading Cultures. In Martin Duberman (Ed.), Re/Membering Langston, p. 192\\. New York University Press * Nero, Charles I. (1999).Columbia Reader on Lesbians and Gay Men in Media, Society, and Politics. In Larry P. Gross & James D. Woods (Eds.), In Free Speech or Hate Speech: Pornography and its Means of Production, p. 500\\. Columbia University Press * Nichols, Charles H. (1980). Arna Bontempts-Langston Hughes Letters, 1925-1967. Dodd, Mead & Company. * Hans Ostrom|Ostrom, Hans (1993). Langston Hughes: A Study of the Short Fiction. New York: Twayne. * Hans Ostrom|Ostrom, Hans (2002). A Langston Hughes Encyclopedia. Westport: Greenwood Press, 2002. * Arnold Rampersad|Rampersad, Arnold (1986). The Life of Langston Hughes Volume 1: I, Too, Sing America. Oxford University Press * Arnold Rampersad|Rampersad, Arnold (1988). The Life of Langston Hughes Volume 2: I Dream A World. In Ask Your Mama!, p. 336\\. Oxford University Press * Schwarz, Christa A.B. (2003). Gay Voices of the Harlem Renaissance. In Langston Hughes: A \"true 'people's poet\",pp. 68–88. Indiana University Press * West, Sandra L. (2003). Encyclopedia of the Harlem Renaissance. In Aberjhani & Sandra West (Ed.), Langston Hughes, p. 162\\. Checkmark Press ==Related pages== * Harlem Renaissance *List of poets from North America == Other websites == * Poems by Langston Hughes at PoetryFoundation.org * A selection of Langston Hughes's more political poetry * The Negro Artist and The Racial Mountain by Langston Hughes * Beinecke Library,Yale University, Langston Hughes at 100 * Langston Hughes in Lawrence, KS: Photographs & Biographical Resources * Phat African American Poetry Book * Langston Hughes Papers on deposit at Yale * America's Library, Library of Congress, Langston Hughes * I Hear America Singing, PBS.ORG * Obituary of Langston Hughes, The New York Times * Atrium where the ashes of Langston Hughes reside in the Schomburg Center for Research in Black Culture in Harlem * List of previewable works on Google Book Search by and concerning Langston Hughes Category:1902 births Category:1967 deaths Category:African-American writers Category:American children's writers Category:American communists Category:American LGBT people Category:American novelists Category:American playwrights Category:American poets Category:Cancer deaths in New York City Category:Deaths from prostate cancer Category:Deaths from surgical complications Category:Gay men Category:LGBT African-Americans Category:LGBT novelists Category:LGBT playwrights Category:LGBT poets Category:People from Joplin, Missouri Category:Writers from Missouri Category:People from Lawrence, Kansas",
 "title": "Langston Hughes"
}