{
 "id": "922956",
 "text": "Mickey's Once Upon a Christmas is a 1999 direct-to-video animated Christmas anthology comedy fantasy film produced by Walt Disney Television Animation. ==Voice cast== * Wayne Allwine as Mickey Mouse Check marks indicates role has been confirmed using screenshots of closing credits and other reliable sources. * Russi Taylor as Minnie Mouse, Check marks indicates role has been confirmed using screenshots of closing credits and other reliable sources. Huey, Dewey, and Louie * Tony Anselmo as Donald Duck Check marks indicates role has been confirmed using screenshots of closing credits and other reliable sources. * Diane Michelle as Daisy Duck Check marks indicates role has been confirmed using screenshots of closing credits and other reliable sources. (singing voice in the finale. This was her final time voicing the character, before passing the role to Tress MacNeille.) * Tress MacNeille as Daisy Duck (speaking voice), Chip, Check marks indicates role has been confirmed using screenshots of closing credits and other reliable sources. and Aunt Gertie Check marks indicates role has been confirmed using screenshots of closing credits and other reliable sources. * Alan Young as Scrooge McDuck Check marks indicates role has been confirmed using screenshots of closing credits and other reliable sources. * Bill Farmer as Goofy, Check marks indicates role has been confirmed using screenshots of closing credits and other reliable sources. Pluto Check marks indicates role has been confirmed using screenshots of closing credits and other reliable sources. * Corey Burton as Dale Check marks indicates role has been confirmed using screenshots of closing credits and other reliable sources. * Shaun Fleming as Max Goof Check marks indicates role has been confirmed using screenshots of closing credits and other reliable sources. * Jim Cummings as Peg Leg Pete, Check marks indicates role has been confirmed using screenshots of closing credits and other reliable sources. Police, Mailman, Fire Chief, Dad, onlooker, shop owner, and Santa Claus * Jeff Bennett as Dad Firefighter #2, Mortimer Mouse, Check marks indicates role has been confirmed using screenshots of closing credits and other reliable sources. Store Announcer, Man, and Costumer * Gregg Berger as Mr Anderson and Shopper * Kylie Dempsey as Kid #2 and Little Girl * Taylor Dempsey as Little Jimmy, and Kid #1 * Andrew McDonaugh as Boy * Pat Musick as Distressed Woman, Angry Woman, Eccentric Lady, Shopper and Mrs Anderson * Frank Welker as Turkey Check marks indicates role has been confirmed using screenshots of closing credits and other reliable sources. and Figaro Check marks indicates role has been confirmed using screenshots of closing credits and other reliable sources. * Mae Whitman as Girl * April Winchell as Mom, Old Woman, Firewoman, and Firefighter #1 * Kelsey Grammer as The Narrator * Tommy Morgan provides Mickey's harmonica solos * Randy Crenshaw, Rick Logan, Bobbi Page, and Norman Large as Christmas Carols Medley ==Home media== The film was originally released on VHS and DVD on November 9, 1999. It was later re-released on VHS and on DVD (as part of the Walt Disney Gold Classic Collection) on November 7, 2000. The film was released in a 2-Movie Collection Blu-ray and DVD with Mickey's Twice Upon a Christmas on November 4, 2014. ==References== ==Other websites== * * Category:1999 animated movies Category:American comedy movies Category:1999 comedy movies Category:American family movies Category:Christmas movies Category:Disney animated movies Category:Disney direct-to-video movies Category:Direct-to- video movies Category:English-language movies Category:Movies based on short stories",
 "title": "Mickey's Once Upon a Christmas"
}