{
 "id": "923084",
 "text": "The ruins of Gedi (also known as Gede) are a historical and archaeological site on the Indian Ocean coast in Kenya near of Malindi. == Overview == The site of Gedi includes a walled town and its outlying area. The earliest evidence for occupation at Gedi is a grave dating to between 1041 to 1278.Reynolds, David West. \"Swahili Ghost Town.\" Archaeology vol. 54 no. 6 (November/December 2001): 46.Schofield, J. F. \"The City of Gedi: Presidential Address.\" The South African Archaeological Bulletin vol. 10 no. 38 (June 1955): 35. Gedi was abandoned in the middle of the seventeenth century. The Gedi ruins were first discovered by colonialists in 1884 after a British resident of Zanzibar, Sir John Kirk, visited the site. However, Gedi remained unknown to most of British East Africa's colonists until the 1920s. == Gallery == Gede3.JPG|Ruins of a mosque in Gedi GEDE RUINS IMGL0190 02.jpg|Ruins of Gedi Ruins of Gedi 30.JPG|Ruins of Gedi Ruins of Gedi 40.JPG|Ruins of Gedi == 3D Model == Most of the Gedi Ruins were spatially documented in 2010. A 3D model can be viewed here. == Administration == Gedi was made a historic monument in 1927. The site was declared a protected monument in 1929. Gedi and the surrounding forest was declared a national park in 1948.James Kirkman, \"Gedi\", 8th edition, 1975, Rodwell Press The site is currently administered by the museum's Department of Coastal Archaeology of Kenya.Reynolds, David West. \"Swahili Ghost Town.\" Archaeology vol. 54 no. 6 (November/December 2001): 44. ==In popular culture== *The final scene of the 1992 film \"Nel continente nero\" (\"On the Black Continent\") directed by Marco Rizi takes place and was filmed among the ruins of Gedi. \"Nel continente nero\", IMDb.com. \"Nel continente nero\", Allmovie.com *The ruins of Gedi are described and repeatedly mentioned in Andrei Gusev's 2020 novel “Our Wild Sex in Malindi”. Review of \"Our Wild Sex in Malindi\" on the site of public fund \"Union of writers of Moscow\", 2020Andrei Gusev “Our Wild Sex in Malindi” , 2020 «Наш жёсткий секс в Малинди» by Andrei Gusev, 2020 ==See also== *Jumba la Mtwana *Mnarani ruins ==References== Category:Kenya Category:Archaeological sites in Kenya",
 "title": "Ruins of Gedi"
}