{
 "id": "923046",
 "text": "Mohammed Ismail Sherif (born 9 January 2002), professionally known as Black Sherif, formerly Blacko, is a Ghanaian singer and rapper. He initially gained popularity in 2021 with his song \"First Sermon,\" which he released that May. This was followed up with the \"Second Sermon\" in July. His breakthrough came in March 2022 with his hit single \"Kwaku the Traveller,\" which reached Number 1 on the Ghanaian and Nigerian Apple Music charts. (Its music video has been viewed 17 million times.) He then released his debut album, The Villain I Never Was, on October 5, 2022. == Early life and education == Mohammed Ismail Sherif was born and raised in Konongo-Zongo, in the Ashanti Region of Ghana. As both his parents worked mostly overseas, he started living with his aunt and other extended family members at the age of 10. His nomadic lifestyle exposed him to multiple influences and different cultures at a very early age. Sherif attended his basic education at Konongo Zongo Islamic Basic School and later at Pinamang Educational Complex, where he graduated junior high school. He then later completed his secondary education at Kumasi Academy, where he picked up an interest in music and dancing. A former student of the University of Professional Studies (UPSA), he was studying at the University of Ghana as of October 2022. == Career == Black Sherif began his career in 2019 with the release of his song \"Cry for Me\" on YouTube. His debut single \"Money\" was released on May 25, 2020, along with a music video. In May 2021, his single \"First Sermon\" was released, further increasing his audience. The song's sequel, \"Second Sermon,\" was released in July and received a remix with fellow African artist Burna Boy. Black Sherif breakthrough came in March 2022 with his single \"Kwaku the Traveller,\" which reached Number 1 on the Ghanaian and Nigerian Apple Music charts and became his most popular song. He released his debut album, The Villain I Never Was, in October, supported by the singles \"45\" and \"Soja\". Black Sherif have worked on songs by Sarkodie, Stormzy, Amerado, DJ Breezy, Larry Gaaga and others. Black Sherif performed at the 25th anniversary of the Music of Black Origin (MOBO) Awards, which took place at the OVO Arena in Wembley, London. In December 2022, he hosted his debut concert, the \"Mozama Disco Concert,\" in Accra. On 20 February 2023, Black Sherif won the Best Hip Hop award at the Soundcity MVP Awards, which were held at the Eko Convention Centre in Lagos. He played the Palladium Times Square in New York City on May 20.https://www.jambase.com/venue/palladium-times-square Since March 2023 Black Sherif has performed at the Wireless Festival in Abu Dhabi, Something In The Water Festival in Virginia Beach and Afronation Miami. He is the first Ghanaian to perform at the Wireless Festival in the UK. == Artistry == Black Sherif's music is a blend of highlife, reggae, and hip-hop, specifically UK drill, a subgenre of drill music and road rap, borrowing from the U.S. Chicago styles that originated in Brixton, London, from 2012 onwards that are often about violent and hedonistic criminal lifestyles. Many of his lyrics are in an Akan dialect, Twi, his native tongue. He has stated his musical influences are rappers Kanye West, Travis Scott, Saint Jhn, Dave, Stormzy, J Hus, and Ghanaian artists Mugeez and Sarkodie. == Controversies == On 11 April 2022, a lawsuit was filed against Black Sherif for alleged breach of contract after he signed a deal with Empire Shadrach Agyei Owusu; the CEO of Waynes Chavis Consult, was seeking the court to restrict Black Sherif from performing at events without his authorization. The Accra High Court (Commercial Division) dismissed the injunction filed against him which sought to prevent the singer from performing music he released under his old management. == Discography == Albums * The Villain I Never Was (2022) == Awards and nominations == Year Event Prize Work Result Ref 2023 Ghana Music Awards USA Hip Hop/Hiplife Artist of the Year Himself The Headies West African Artiste of The Year Himself Vodafone Ghana Music Awards Artist of The Year Himself Best Hiphop Song of the Year Himself Best Music Video Konongo Zongo Most Popular Song of the Year Kweku The Traveller Best Collaboraton of the Year Country Side (with Sarkodie) 2022 Entertainment Achievement Awards Entertainment Personality of the Year Himself 3Music Awards Hip hop song of The Year Second Sermon Breakthrough Act of The Year Himself Hip life/Hip hop Artiste of The Year Himself Song of the Year Second Sermon Artiste of the Year Himself Ghana Music Awards Artiste of the Year Himself Vodafone Most Popular Song Second Sermon Best New Artiste Himself Best Hip life/Hip pop Artiste Himself Best Hip pop Song Second Sermon International Collaboration of the Year Second Sermon Remix (ft. Burna Boy) Male Vocal Performance of the Year Gold Digga 2022 Ghana Music Awards UK Artiste of the Year Himself 2023 Soundcity MVP Awards Best Hip Hop Himself BET Hip Hop Awards Best International Flow Himself ==Personal life== Black Sherif is a muslim. ==References== == Other websites == * Official Instagram account * All new updates from Black Sherif Category:Ghanaian rappers Category:Living people Category:2002 births Category:Kumasi Academy alumni Category:21st-century Ghanaian musicians Category:University of Professional Studies alumni Category:University of Ghana alumni Category:Ghanaian Muslims Category:People from Ashanti Region Category:Ghanaian musicians Category:Musicians from Kumasi",
 "title": "Black Sherif"
}