{
 "id": "923111",
 "text": "Plants vs. Zombies is a tower defense video game developed and published by PopCap Games. It was created in 2009. Plants vs. Zombies was first released for Windows and Mac OS X, and it has been ported to consoles, handhelds, and mobile devices. In this game, the player is a homeowner who must defend against a zombie apocalypse. Zombies appear on multiple lanes that can reach the player's house. The player defends by placing plants that attack zombies. Plants can be bought with a currency called sun. If a zombie makes it to the house on any lane, the player loses and must restart the level. Plants vs. Zombies was designed by George Fan. He initially was going to make a game that would be a more defense-oriented game sequel to his fish simulator game Insaniquarium. During development, he converted it into a tower defense game featuring plants fighting against zombies. The game takes inspiration from multiple games and movies. It took three and a half years to make Plants vs. Zombies. Rich Werner was the main artist, Tod Semple programmed the game, and Laura Shigihara composed the game's music. In order to make the game interesting for casual and hardcore gamers, the tutorial was designed to be simple and spread throughout Plants vs. Zombies. Plants vs. Zombies was given positive reviews by critics. The game was also nominated for multiple awards, including \"Download Game of the Year\" and \"Strategy Game of the Year\" as part of Golden Joystick Awards 2010. Reviewers praised the game's humorous art style, simplistic but engaging gameplay, and soundtrack. When it was released in May 2009, it was the fastest-selling video game developed by PopCap Games and quickly became their best-selling game, much faster than Bejeweled and Peggle. By 2010, Plants vs. Zombies had sold over a million copies worldwide. In 2011, PopCap was bought by Electronic Arts (EA). Electronic Arts had fired George Fan and 49 other employees. Since then, it has marked the transition to mobile and social gaming. After EA bought PopCap Games, Plants vs. Zombies has grown into an entire franchise. This includes two direct sequels, three third- person shooters, and two spin-offs. ==Gameplay== In Plants vs. Zombies, the player takes on the role of a homeowner in a suburban neighborhood who must defend their house from zombies with the help of various plants. There are six lanes to defend. The game is divided into several levels, each taking place in a different location around the house. The player must plant various types of plants, each with their own unique abilities, to defend against waves of zombies that approach from the right side of the screen. Each lane has a lawn mower, If zombies eat the plants and get to the house, a lawn mower goes off, killing all zombies in that row. If a zombie make it to the house in that lane again, it is game over. ==Notes== ==References== Category:2009 video games Category:Electronic Arts video games Category:Android (operating system) games Category:Casual games Category:DSiWare games Category:Flash games Category:IOS games Category:MacOS games Category:Multiplayer and single-player video games Category:Nintendo DS games Category:PlayStation 3 games Category:PlayStation Network games Category:PlayStation Vita games Category:Video games about plants Category:Video games developed in the United States Category:Windows games Category:Xbox 360 games Category:Xbox 360 Live Arcade games",
 "title": "Plants vs. Zombies (video game)"
}