{
 "id": "923389",
 "text": "There is the idea that everyone has the right to a minimum standard of health. Some people have called this right to health. They said it is an economic, social, and cultural right. There are several international agreements which have included this idea. Some of these agreemenrs are the Universal Declaration of Human Rights, International Covenant on Economic, Social and Cultural Rights, and the Convention on the Rights of Persons with Disabilities. There are still some discussions, as people do not fully agree on things like the exact definition of health. They also do not agree about what a minimum standard of health should be, and who should be responsible to ensure this right to health. The Human Rights Measurement Initiative measures the right to health for countries around the world, based on their level of income. == Definition == There are different definitions of what health is: * The preamble of the consitution of the World Health Organisation defines it as \"a state of complete physical, mental and social well-being and not merely the absence of disease or infirmity.\" It says that the right to health is fullfilled, when the person enjoys the highest attainable standard of health. It also lists some examples, such as healthy child development, spreading medical knowledge among all people in the population, and a government providing social measures to provide adequate health. * The Universal Declaration of Human Rights states that \"Everyone has the right to a standard of living adequate for the health and well-being of himself and of his family, including food, clothing, housing and medical care and necessary social services.\" The declaration also talks about some extras, such as security in case of disability, and makes special mention of care given to those in motherhood or childhood. == References == == Related pages == *Universal health care == Other websites == * Joint Fact Sheet WHO/OHCHR/323 * The Right to Health cartoon * Right to health on the Children's Rights Portal * General Comment No. 14. The right to the highest attainable standard of health CESCR, 2000 * The right to health and the European Social Charter Secretariat of ESC, 2009 * The Right to Health: Fact Sheet No. 31 WHO and UN HCHR * 25 Questions & Answers on Health and Human Rights, WHO == Bibliography == * Andrew Clapham, Mary Robinson (eds), Realizing the Right to Health, Zurich: rüffer & rub, 2009. * Bogumil Terminski, Selected Bibliography on Human Right to Health, Geneva: University of Geneva, 2013. * Judith Paula Asher, The Right to Health: A Resource Manual for Ngos, Dordrecht: Martinus Nijhoff Publishers, 2010. I Category:Health",
 "title": "Right to health"
}