{
 "id": "923316",
 "text": "Kumyks (Kumyk: къумукълар, qumuqlar, ) are a Turkic people living in north- eastern Dagestan. The territories traditionally populated by Kumyks, and where their historical states used to exist, are called Kumykia.Валерий Александрович Тишков, Вадим Александрович Александров -Народы России: энциклопедия Науч. изд-во Большая российская энциклопедия, 1994 — С.214А. Л. Нарочницкий. И90 История народов Северного Кавказа (конец XVIII в. — 1917 г.). — М.: Наука, 1988, стр. 605АДМИНИСТРАТИВНОЕ УПРАВЛЕНИЕ ШАМХАЛЬСТВА ТАРКОВСКОГО В XVII–ХVIII веках, АБДУСАЛАМОВ Магомед-Паша Балашович, стр. 9 The land inhabited by Kumyks once used to be a part of a Kumyk statehood Tarki Shamkhalate.Тhe Territory and the People of Tarkovsky Shamkhalstvo in the Works of Russian and West European Authors of XVIII–XIXth Centuries, Абдусаламов М.-П. Б., 2012, Известия Алтайского государственного университета Цитата: \"...четко выделил границы ряда кумыкских феодальных владений, в том числе шамхальства Тарковского...\" Their origins can be traced to Sunni-Kipchak Cossacks and the Borchali (or Burjoglu), originally the name of a seventeenth century Turkic tribe that settled in Caucasian Georgia with Turkic-Khazar roots.Aliyev Kamil: Kumyk Scientific and Cultural Society, KSCS: Proceedings, №5. pp.35-42, Makhachkala. Montclair State University professor H. Mark Hubey traces the origins of the Kumyk people to the Bronze/Iron Age tribe Kumukku of the Ancient Near East.H.M. Hubey: \"A Story of Life & Death and Love & War\", in: Studia Turkologia, Воронежский Тюркологический сворник [Voronezh Türkological Symposium], Voronezh, 2008. - Vol.7-8. page 57. Kumyks are divided into six clans: Arpali (connected with the Árpád dynasty), Sarali, Targulu, Zhan-Ahmetli, Chagarli and Ulashli. The dialects of the Kumyks are: Kaitag, Terek, Buynaksk and Xasavyurt. Kaitag (Mountain Kayı), which for ten centuries (10–19 cc.) was a lingua franca in the North Caucasus, is the Russified name of the Kayı tribe who played a prominent role in the history of the Caucasus. Kaitag principality was a leading component of the Shamkhalate of Kazi-Kumukh state on the Caspian western seaboard that, in different forms, lasted from the 8th to the 19th centuries.Ethnographic Review, 1910, No. 1-2, pp. 37-45; No. 3-4, pp. 283-284, In \"To the question of the origin of the kayaks\" // Academician V. V. Bartold. Works, Volume V. Works on the History and Philology of the Turkic and Mongolian Peoples. M. Nauka. 1968N.Kisamov: Kayi and Gelons, Nasidze 2010. Proceedings of the Academy of DNA Genealogy, ISSN 1942-7484, Volume 5, No. 8 August 2012, pp. 1013-1019. Appendix: W.W. Bartold, ON THE ORIGIN OF KAYITAKS, Vol 3, pp. 411 - 413 Kaitag textiles, stamped out under Soviet rule, their artistry and artistry remain distinct. ==References== == Other websites == Category:Ethnic groups in Russia",
 "title": "Kumyk people"
}