{
 "id": "923495",
 "text": "James David Vance (born James Donald Bowman; August 2, 1984) is an American politician and Marine Corps veteran serving as the 50th vice president of the United States under the second administration of President Donald Trump since 2025. He was the U.S. senator from Ohio from 2023 to 2025. Vance is the third- youngest vice president and the first Millennial vice president in U.S. history. After high school, Vance joined the United States Marine Corps, where he served as a military journalist from 2003 to 2007 and was deployed to Iraq for six months in 2005. He graduated from Ohio State University with a bachelor's degree in 2009 and Yale Law School with a law degree in 2013. He practiced as a corporate lawyer working in the tech industry as a venture capitalist. His memoir, Hillbilly Elegy, was published in 2016 and became a movie in 2020. Vance won the 2022 United States Senate election in Ohio, defeating Democratic nominee Tim Ryan. After initially opposing Donald Trump's candidacy in the 2016 election, Vance became a strong Trump supporter during Trump's first presidency. In July 2024, Trump picked Vance as his running mate during the Republican National Convention. Vance has been characterized as a national conservative and right-wing populist. He opposes abortion, same-sex marriage, and gun control. ==Early life== Vance was born on August 2, 1984, in Middletown, Ohio, to Donald Bowman and Beverly (née Vance). Vance's mother and father divorced when Vance was a toddler. Shortly afterward, he was adopted by his mother's third husband. Vance and his sister Lindsey were raised mainly by his grandparents, James and Bonnie (née Blanton) Vance. J. D. later went by the name James Hamel, his stepfather's surname, until adopting his grandparents' surname, Vance. Vance went to Middletown High School. After graduating, he joined the U.S. Marine Corps and served as a combat correspondent (military journalist) in the Iraq War. Vance later attended the Ohio State University, graduating in 2009 with a Bachelor of Arts degree summa cum laude in political science and philosophy. After graduating from Ohio State, Vance went to Yale Law School. Vance graduated from Yale in 2013 with a Juris Doctor. ==Writing and business career== Vance moved to San Francisco to work in the tech industry as a venture capitalist. He was a principal at Peter Thiel's firm, Mithril Capital, between 2016 and 2017. In 2016, Vance's book, Hillbilly Elegy: A Memoir of a Family and Culture in Crisis, was published. It was on The New York Times Best Seller list in 2016 and 2017. It was a finalist for the 2017 Dayton Literary Peace Prize and winner of the 2017 Audie Award for Nonfiction. The New York Times called it \"one of the six best books to help understand Trump's win\". Vance was criticized from some Eastern Kentuckians who said he was \"not a hillbilly\", while others supported him. During the 2016 presidential election, Vance was a well known critic of Republican nominee Donald Trump. In a February 2016 USA Today column, he wrote that \"Trump's actual policy proposals, such as they are, range from immoral to absurd.\" In the Atlantic and on the PBS show hosted by Charlie Rose, Vance called Trump \"cultural heroin\". In October 2016, he called himself a \"never- Trump guy.\" In a private message on Facebook he called Trump \"America's Hitler\". In December 2016, Vance said he wanted to move back to Ohio and would think about starting a nonprofit or running for office. In January 2017, Vance became a CNN contributor. In April 2017, Ron Howard signed on to direct a movie version of Hillbilly Elegy, which Netflix released in 2020. In 2019, Vance co-founded Narya Capital in Cincinnati. In 2020, he raised $93 million for the firm. == U.S. Senate (2023–25) == In July 2021, Vance announced his candidacy for the United States Senate in the 2022 election to replace retiring U.S. Senator Rob Portman. In April 2022, former President Donald Trump announced his support for Vance. He won the Republican nomination in May 2022. In November 2022, he was elected U.S. Senator after defeating U.S. Representative Tim Ryan in the general election. Vance was the only candidate in the seven statewide general election races funded by former President Trump's PAC to win. He was sworn-in on January 3, 2023. In the Senate, Vance has been seen as a supporter of economic populism. On social issues, Vance supported the overturning of Roe v. Wade and is against abortion rights even in cases of rape or incest, but supports exceptions when a mother's life is in danger. On foreign policy, Vance has been against U.S. military aid for Ukraine. Vance is a strong supporter of U.S. support for Israel amid the Israel–Hamas war. On February 26, 2023, Vance wrote an opinion piece in The Washington Post supporting parts of PPP style funds to those affected by the East Palestine train derailment, which some Republican senators criticized. On March 1, 2023, Vance, Brown, and Senators John Fetterman, Bob Casey, Josh Hawley, and Marco Rubio proposed bipartisan legislation to prevent derailments like the one in East Palestine, Ohio. Vance was among the 31 Senate Republicans who voted against final passage of the Fiscal Responsibility Act of 2023. In 2023, Vance introduced a bill that would make English the official language of the United States. Vance was against the Respect for Marriage Act and has said, \"I believe that marriage is between one man and one woman, but I don't think the gay marriage issue is alive right now. I'm not one of these guys who's looking to try to take people's families and rip them apart.\" Vance resigned from the Senate at midnight on January 10, 2025 before his inauguration as the 50th vice president of the United States on January 20, 2025. ==2024 vice presidential campaign== In July 2024, former President Donald Trump picked Vance to be his running mate in the 2024 presidential election. He is the first millennial to be on a presidential ticket of a major party in the United States. Vance is the first Ohioan to appear in a major party presidential ticket since John Bricker (who was Thomas Dewey's running mate in 1944), the first person to have facial hair since Dewey himself in his 1948 upset loss as presidential nominee, and the first combat veteran since John McCain in 2008, all of which were Republican politicians. If elected, he will be the first Ohio native to be elected to the vice presidency since Charles Dawes in 1924, the first to have facial hair since Charles Curtis in 1928 —both of which were also Republicans– and the first combat veteran since Democrat Al Gore in 1992. Shortly after being named Trump's running mate, many people criticized Vance for saying in a 2021 Fox News interview, \"we are effectively run in this country [by] the Democrats, [by] our corporate oligarchs, by a bunch of childless cat ladies who are miserable at their own lives and the choices that they've made and so they want to make the rest of the country miserable too.\" On July 26, 2024, Vance clarified his remarks on while being interviewed by Megyn Kelly, saying, \"It's not a criticism of people who don't have children\" and adding, \"this is about criticizing the Democratic Party for becoming anti-family and anti-child\". More people criticized Vance for his response and his other comments from a 2020 podcast interview where he said \"being childless makes people more sociopathic and ultimately our whole country a little bit less mentally stable\". In a March 2021 interview on The Charlie Kirk Show, he said that people without children should be taxed at a higher rate than those with children. The week after the Republican convention, opinion polls showed Vance with very low approval numbers, some of the worst since 1980. The week after the convention, some Republicans began to think that Vance was a bad choice to be Trump's running mate while others believed that Trump should quickly replace him.Multiple sources: * * * * In November 2024, the Trump-Vance ticket won the election, making Vance the Vice President-elect of the United States. == Vice presidency (2025–present) == On January 20, 2025, Vance was sworn in as the 50th vice president of the United States. Before his inauguration, Vance met with China's vice president Han Zheng in which they discussed China–United States relations. Vance is the third youngest person to serve as vice president and the first from the Millennial generation. He is also the first Marine Corps veteran to serve as vice president, becoming the highest-ranking Iraq War veteran in the U.S. government. Vance's first acts as vice president was swearing in Senator Marco Rubio as Secretary of State on January 21. On January 24, he cast the tie-breaking vote to confirm Pete Hegseth as Secretary of Defense. ==Personal life== Vance married his former law school classmate, Usha Chilukuri, in 2014. They have three children. During the mid-2010s, Vance and his wife lived in San Francisco. ==Works== * ==Notes== ==References== ==Other websites== * * *JD Vance official U.S. Senate website *Campaign website * Category:Living people Category:1984 births Category:American political commentators Category:United States senators from Ohio Category:Writers from Cincinnati Category:Businesspeople from Cincinnati Category:Politicians from Cincinnati Category:Republican Party (United States) politicians Category:American political writers Category:Military people from Ohio Category:CNN people Category:21st-century American politicians Category:2024 United States vice-presidential candidates",
 "title": "JD Vance"
}