{
 "id": "923520",
 "text": "Huirem Seema (full name: Huirem Ningol Laimayum Ongbi Seema; 8 November 1970 - 17 September 2011) was an Indian actress from Imphal, Manipur. She had appeared in more than 100 movies in Meitei language (Manipuri language). Besides, she had also produced four movies. She was best remembered for her roles in movies like Kanaga Hinghouni, Chang Shi Chang, Lakhipurgi Lakhipyari, Naoshum, Yumleima Lamleima and Thasi Thanou. Two of her movies Yenning Amadi Likla (feature) and Ngaihak Lambida (non-feature) made entries into the Indian Panorama of the International Film Festival of India. Many of her movies including Tolenkhomba (Lakhpati), Amamba Sayon, Naoba Naobi and Langon were released after her death. == Early life and career == Seema started her movie career at a young age of five years. Her father was a popular theatre artiste. She also acted in a few plays of the top leading theatre group, \"Rupmahal Theatre\" and teleplays for \"Doordarshan\" Television. It was before she shaped her career in movies. Her appearance in movies started since the times of celluloid era of Meitei cinema (Manipuri cinema). She acted in 15 celluloid movies and around 100 digital movies. Her first movie was 31st December. It was directed by L. Surjakanta. Her notable celluloid movies include Nongju Ahing, Aroiba Bidai and Kanaga Hinghouni. Her appearance in video format movies include Mantri Dolansana and One Way. In digital movies, Seema generally played as supporting roles. But her acting talents and versatility could be seen clearly in digital movies where she took leading roles. Yumleima Lamleima, Sanahanbi and Thasi Thanou were such examples of the movies. Besides acting, she had produced four films under the banner of Seema Productions (SF). The movies were Asha, Kalpana, Thamoinungda and Yumleima Lamleima. She co-directed Yumleima Lamleima with Homen D' Wai. She was recognized as an approved artiste in the \"All India Radio, Imphal\". == Appeared movies == Year Film Role Director 1993 Mantri Dolansana Samuma Dinesh Tongbram 1996 Kanaga Hinghouni Mamta Chan Heisnam 1999 Aroiba Bidai Ibeyaima Oken Amakcham 2002 Nongju Ahing L. Surjakanta Thawanmichakna Kenkhrabada Meera Ksh. Kishorekumar 2003 Kalpana Kalpana Ksh. Kishorekumar 2004 Chang Shi Chang Memi Eepu Asha Shila Ishomani 2005 Thamoinungda Rani Ishomani Amuktang Chamthoknashi Achouba's mother Diya Khwairakpam 2006 Nakenthana Ngairi Bem Dinesh Tongbram Best Friend (Eta Chanabi) Langlen's sister O. Sanou Ngaihak Lambida Manileima Haobam Paban Kumar Payal Rani Amar Raj Lakhipurgi Lakhipyari Thambal L. Surjakanta Eedom Chatcharage Punshiba's sister-in-law Amar Raj 2007 Naoshum Leibaklei Oinam Gautam Singh Yenning Amadi Likla Leibaklei Makhonmani Mongsaba Akhunba Mani Thasana Romi Meitei 2008 Nungshibi Ahing Homen D' Wai Tayai Tharo K. Bimol Sharma 2009 Yumleima Lamleima Sanahanbi Seema & Homen D' Wai Kaboklei Kaboklei's mother Pilu H. Paachaa Panthoi's sister Bishwamittra Dharmagi Mingda Imagidamak Ganga Romi Meitei 2010 Thasi Thanou Thagoi Eepu Hayengna Kanana Pangani Hemba's mother L. Surjakanta Tillaikhombee Likla Bishwamittra Lambidudei Sakhen's mother K. Bimol Sharma Mamado Leisabido Angaobido Lalita Romi Meitei 2011 Meehatpa Ningthem's sister-in-law Ksh. Kishorekumar Loibataare Ta Raju Soochi's mother Pilu H. Punshi Chuppa Nangshe Eigini Thaja's mother Premanda Ishwar Masu Angaobani Leichil's sister-in-law L. Prakash 2012 Tolenkhomba (Lakhpati) Leimahan L. Rajesh Lanphamda Ibeni Judge's wife Romi Meitei Mangalsigee Ashada Naoba's mother Suvas E. 2013 Amamba Sayon Priestess Johnson Mayanglangbam 80,000 Meiraba Romio Thasana Premanda 2019 Langon Khamnu L. Surjakanta == Awards and honours == * Best Actress in a Leading Role for the role of Mamta in Kanaga Hinghouni (1996) at 3rd Manipur State Film Awards 1999. * Best Supporting Role for her role in Aroiba Bidai (1999) at the 4th Manipur State Film Awards. * Best Actress in a Leading Role for Nongju Ahing (2002) at 6th Manipur State Film Festival. * Best Supporting Role - Female for her role in Lakhipurgi Lakhipyari (2006) at the First Festival of Manipuri Cinema 2007. * Best Supporting Actress for the role of Leibaklei in Naoshum (2007) at the 7th Manipur State Film Festival 2010. * Best Actress in a Leading Role for the role of Thagoi in Thasi Thanou (2010) at 1st Sahitya Seva Samiti MANIFA 2012. The award was given posthumously. == References == Category:Meitei people Category:1974 births Category:2011 deaths Category:Indian actors",
 "title": "Huirem Seema"
}