{
 "id": "923689",
 "text": "Dasvi () is a 2022 Indian Hindi-language social comedy film written by Ritesh Shah and directed by Tushar Jalota. The film is produced by Dinesh Vijan under his banner Maddock Films in collaboration with Jio Studios and Bake My Cake Films. The film stars Abhishek Bachchan, Yami Gautam and Nimrat Kaur. Bachchan plays the role of an uneducated politician, with Gautam as an IPS officer. The film premiered on Netflix and JioCinema on April 7, 2022. The script and dialogue of the film is doctored by famous poet Dr Kumar Vishwas. The movie received mixed reviews from critics and positive response from the audiences. == Plot == Ganga Ram Chaudhary, the charismatic and arrogant Chief Minister of the fictional state of Harit Pradesh, is implicated in a scam and remanded to judicial custody. He appoints his wife Bimla Devi \"Bimmo\" Chaudhary interim CM until he can post bail. Initially meek and subservient, Bimmo quickly learns the ropes and establishes herself as a powerful politician, undergoing an image makeover in the process. Meanwhile, Chaudhary's popularity and street-smarts gain him a following in jail and he receives preferential treatment. When Jyoti Deswal, a new superintendent, arrives at the jail, Chaudhary's life takes a turn for the worse. Incorruptible and no-nonsense, Jyoti revokes Chaudhary's privileges and treats him like any other prisoner. Chaudhary's attempts to bribe a judge fail, and his immediate bail request is denied. Following a confrontation, Jyoti embarrasses Chaudhary by evoking his lack of education - he dropped out in 8th grade - and puts him to work in the prison workshop making chairs as he is unqualified for any other work. Spurred by this and by the fact that prisoners attempting to gain a 10th-grade diploma are exempt from work, Chaudhary resolves to study and clear the 10th-grade exams to gain his high-school diploma. Jyoti believes this is a scam, but her hands are tied as Indian Law grants Chaudhary the right to complete his education. Chaudhary struggles to stay engaged in his studies, frequently falling asleep, until he is inspired by a history textbook detailing India's struggle for independence; he begins to take his studies much more seriously. He declares that if he cannot clear his exams, he will never accept the post of Chief Minister again. Meanwhile, Bimmo grows ambitious and plots to make her interim post permanent, suggesting to Chaudhary that he feign mental illness to gain asylum in a lavish hospital. Jyoti foils this by exposing Chaudhary's lies, saving his career in the process (as people proved to be mentally unfit are disqualified from contesting elections). When Chaudhary suffers a minor heart attack, Jyoti saves him by performing CPR, drawing Bimmo's ire. Chaudhary progresses in his studies with help from inmates he has befriended, but struggles in Hindi as he is practically illiterate and cannot visualize the alphabet. Bimmo exacerbates this problem by arranging the release of the prisoner who is helping him with Hindi. Jyoti, beginning to see the change in character that the focus on education has brought on in Chaudhary, agrees to help him. As they make progress, they develop mutual respect. Chaudhary's bail application is processed and he is cleared for release, but Jyoti hides this from him so he can focus on his studies. Chaudhary appears for his exams but is uncertain of how he has performed. When he is released, he finds out about Jyoti's deceit. Irate, he threatens her and warns her that he'll never change; Jyoti is disappointed by his intransigence. When Chaudhary returns to the political arena, he discovers that Bimmo has usurped the CM chair and he has no support in his own party. He aligns with a rival party and contests the upcoming election making education his primary agenda. The election results and exam results are due on the same day. While votes are being counted, Chaudhary rushes back to jail to discover that he has passed the exams. As a token of gratitude, he gifts Jyoti a chair that he'd made in the workshop as her Gurudakshina (traditionally a gift given by a student to a teacher). His new party wins the election and Chaudhary reconciles with Bimmo. He refuses the Chief Minister post and chooses to become the Minister of Education instead. During his oath ceremony, he makes it a point to convey his gratitude to Jyoti and the other inmates who helped him clear the exams. == Cast == * Abhishek Bachchan as Ganga Ram Chaudhary * Yami Gautam as IPS Jyoti Deswal * Nimrat Kaur as Chief Minister Bimla Devi \"Bimmo\" Chaudhary * Manu Rishi as Satpal Tomar * Arun Kushwah as Ghanti * Chittaranjan Tripathy as Tandon; IAS officer and Ganga Ram's secretary * Danish Husain as Rai Bareli; librarian * Sumit Shekhar Rai as Prem Qaidi * Rohit Tiwari as Imandar * Dhanveer Singh as Atul Chaudhary, Ganga Ram's brother * Sachin Shroff as Opposition party leader * Aditi Vats as Bimla Devi's manager * Shivankit Singh Parihar as Kavish Kumar * Shakti Singh as Chandra Shekhar Azad ==References== Category:Netflix movies Category:Hindi-language movies Category:2020s Indian movies Category:2022 movies Category:Indian movies",
 "title": "Dasvi"
}