{
 "id": "923610",
 "text": "\"Who Will Be Ningthou?\" () is a fictional moral story of a Meitei King (), his Queen (), three princes and a princess of Kangleipak (Manipur). It is the story of the decision of the Ningthou and the Leima regarding the succession of the throne of the kingdom among his four children. The story is written by Indira Mukherjee.NCERT. Marigold Book Five: Textbook in English for Class V. National Council of Educational Research and Training. ISBN 978-81-7450-813-3.Who Will be Ningthou?. Spark-India. ISBN 978-81-88733-31-6. == Synopsis == The Ningthou and the Leima of Kangleipak were good rulers. They just wished for the prosperity and the happiness of their kingdom. Similarly, the people of the kingdom also loved their royalties very much. Even the birds, animals and all living beings loved them very much. The Ningthou and the Leima had four children. Among the royal children, three were the princes and one was a princess. The princess was kind with a pure heart. Her name was Sanatombi. She was loved by everyone. The Ningthou wanted to choose a successor for the kingdom. Everyone thought that the successor would be one of the princes. However, the Ningthou chose his daughter as the heir because she was ever so kind. The Ningthou decided to test all his three sons to select the right successor. He tested if they had the qualities of a good ruler. However, he was disappointed. It was because all his sons were not worthy enough to be the ruler. The Ningthou crowned his daughter, princess Sanatombi, as the future successor of the kingdom. Sanatombi was only twelve years old during her crowning. She was chosen by her father because she was a very kind person with all the qualities of a true leader. She was merciful and could understand the conditions of the people of her kingdom. She equally cared about animals, birds, and even the trees. So, everyone were quite happy with their future queen of Kangleipak. == Moral applications == The story carries a message about what qualities make a good ruler and how everyone must be pitiful to everyone to make the world a good place to live together. == Related pages == * Lai Khutshangbi * Yenakha Paotapi == References == Category:Meitei literature",
 "title": "Who Will Be Ningthou?"
}