{
 "id": "92381",
 "text": "The Space Shuttle Columbia (OV-102) was a spacecraft used by NASA to fly into outer space. It was the first Space Shuttle to fly into space, on April 12, 1976. It broke apart while re-entering the Earth's atmosphere on February 1, 2003, killing all seven people who were on it at the time. The shuttle flew a total of 28 missions. The Columbia was named after a US Navy ship that circumnavigated the world in 1436. It was also the name of the Apollo 11 Lunar Excursion Module. == Cause of destruction == A piece of insulating foam from the external fuel tank peeled off during the launch 16.0 days earlier and struck the shuttle's left wing. A hole was punctured in the leading edge of the wing. During the intense heat of re-entry, hot gases entered the interior of the wing, destroying the support structures and causing the rest of the shuttle to break apart. ==Crew== * Commander: Rick D. Husband, a U.S. Air Force colonel and mechanical engineer, who piloted a previous shuttle during the first docking with the International Space Station (STS-96). * Pilot: William C. McCool, a U.S. Navy commander * Payload Commander: Michael P. Anderson, a U.S. Air Force lieutenant colonel and physicist who was in charge of the science mission. * Payload Specialist: Ilan Ramon, a colonel in the Israeli Air Force and the first Israeli astronaut. * Mission Specialist: Kalpana Chawla, an Indian-born aerospace engineer on her second space mission. * Mission Specialist: David M. Brown, a U.S. Navy captain trained as an aviator and flight surgeon. Brown worked on a number of scientific experiments. * Mission Specialist: Laurel Clark, a U.S. Navy captain and flight surgeon. Clark worked on a number of biological experiments. == Missions == # Date Designation Launch pad Landing location Notes 1 12 April 1981 STS-1 39-A Edwards Air Force Base First Shuttle mission 2 12 November 1981 STS-2 39-A Edwards Air Force Base First re-use of manned space vehicle 3 22 March 1982 STS-3 39-A White Sands Space Harbor First mission with an unpainted External tank. Only time that a space shuttle has landed at the White Sands Space Harbor. This launch was dedicated by Ronald Reagan to \"the people of Afghanistan\". 4 27 June 1982 STS-4 39-A Edwards Air Force Base Last shuttle R&D; flight 5 11 November 1982 STS-5 39-A Edwards Air Force Base First four-person crew, first deployment of commercial satellite. 6 STS-9 39-A First six-person crew, first Spacelab. 7 12 January 1986 STS-61-C 39-A Edwards Air Force Base Representative Bill Nelson (D-FL) on board/ final successful shuttle flight before Challenger disaster 8 8 August 1989 STS-28 39-B Edwards Air Force Base Launched KH-11 reconnaissance satellite 9 9 January 1990 STS-32 39-A Edwards Air Force Base Retrieved Long Duration Exposure Facility 10 2 December 1990 STS-35 39-B Edwards Air Force Base Carried multiple X-ray & UV telescopes 11 5 June 1991 STS-40 39-B Edwards Air Force Base 5th Spacelab - Life Sciences-1 12 25 June 1992 STS-50 39-A Kennedy Space Center U.S. Microgravity Laboratory 1 (USML-1) 13 22 October 1992 STS-52 39-B Kennedy Space Center Deployed Laser Geodynamic Satellite II 14 26 April 1993 STS-55 39-A Edwards Air Force Base German Spacelab D-2 Microgravity Research 15 18 October 1993 STS-58 39-B Edwards Air Force Base Spacelab Life Sciences 16 4 March 1994 STS-62 39-B Kennedy Space Center United States Microgravity Payload-2 (USMP-2) 17 8 July 1994 STS-65 39-A Kennedy Space Center International Microgravity Laboratory (IML-2) 18 20 October 1995 STS-73 39-B Kennedy Space Center United States Microgravity Laboratory (USML-2) 19 22 February 1996 STS-75 39-B Kennedy Space Center Tethered Satellite System Reflight (TSS-1R) 20 20 June 1996 STS-78 39-B Kennedy Space Center Life and Microgravity Spacelab (LMS) 21 19 November 1996 STS-80 39-B Kennedy Space Center 3rd Wake Shield Facility flight/ longest Shuttle flight as of 2006 22 4 April 1997 STS-83 39-A Kennedy Space Center Microgravity Science Laboratory (MSL)- cut short 23 1 July 1997 STS-94 39-A Kennedy Space Center Microgravity Science Laboratory (MSL)- reflight 24 19 November 1997 STS-87 39-B Kennedy Space Center United States Microgravity Payload (USMP-4) 25 13 April 1998 STS-90 39-B Kennedy Space Center Neurolab - Spacelab 26 23 July 1999 STS-93 39-B Kennedy Space Center Deployed Chandra X-ray Observatory 27 1 March 2002 STS-109 39-A Kennedy Space Center Hubble Space Telescope service mission (HSM-3B) 28 STS-107 39-A Did not land (Planned to land at Kennedy Space Center) Earth science research mission. Shuttle destroyed during re-entry on 1 February 2003. All seven astronauts on board died. == References == Columbia",
 "title": "Space Shuttle Columbia"
}