{
 "id": "92384",
 "text": "{{Infobox rocket |image = Atlas V(401) launches with LRO and LCROSS cropped.jpg |image_size = |caption = Launch of an Atlas V 401 carrying the Lunar Reconnaissance Orbiter and LCROSS space probes on June 18, 2009 |name = Atlas V |function = EELV/medium-heavy launch vehicle |manufacturer = United Launch Alliance |country-origin = United States |pcost = |cpl = in 2016 |alt-cpl = |height = |diameter = |width = |mass = |stages = 2 |capacities = |family = Atlas (rocket family) |derivatives = |comparable = |status = Active |sites = Cape Canaveral SLC-41 |launches = 97 (401: 41, 411: 6, 421: 9 431: 3) (501: 7, 521: 2, 531: 5, 541: 9, 551: 12, N22: 2) |success = 95 (401: 39, 411: 6, 421: 9, 431: 3) (501: 7, 521: 2, 531: 5, 541: 9, 551: 12 N22: 2) |partial = 2 (401 – low orbit, customer declared success)Gunter's Space Page – Atlas V (401). Space.skyrocket.de. Retrieved on 2011-11-19. |other_outcome = |first = 21 August 2002 (Hot Bird 6) |last = 10 November 2022 (JPSS-2, LOFTID) |only = |payloads = |stagedata = }} Atlas V is an orbital launch vehicle used by the United Launch Alliance (made of two companies, Boeing and Lockheed Martin) to place satellites into orbit. It is a rocket tall, and wide. It has flown 79 times, since its first flight on August 21, 2002. It was developed from the Atlas (missile). Unlike the Space Shuttle, Atlas V is only used once, with a new rocket being built for each flight. The rocket is made of the first stage, a Common Core Booster with an RD-180 engine from Russia. Every Atlas V has this as the first stage. The second stage is called Centaur, and has one/two RL-10 engines from Aerojet Rocketdyne. On top is a wide fairing covering the spacecraft during launch. == Flights == As of 2023 Atlas V has made 97 flights. The most famous ones carried the New Horizons, Mars Science Laboratory (which had the Curiosity rover in it), Juno, the Mars Reconnaissance Orbiter, the Lunar Reconnaissance Orbiter/LCROSS, the Boeing X-37B, the Mars 2020 mission which carried the Perseverance rover and the Mars Helicopter Ingenuity, Boeing's CST-100 Starliner. == Variants == The Atlas V has a special way of naming the different kinds. The Atlas V nomenclature for numbering the variants goes like this: The first number says how wide the fairing is. A 400 series Atlas V has a 4-meter wide fairing. A 500 series Atlas V has a 5-meter wide fairing. An Atlas V N22 have no fairing since it will be the launch configuration for the Boeing's CST-100 Starliner. second number says how many strap-on solid rocket boosters the rocket has. An Atlas V 501 has no strap-on boosters, an Atlas V 441 has 4 strap-on boosters, while the Atlas V N22 has two strap-on boosters, which will be the Boeing Starliner launch configuration. The last number says how many engines the Centaur second stage has. All of the Atlas V rockets flown have had only 1 engine on the Centaur, but in the future other Atlas V rockets will have 2 engines on the Centaur upper stage, such as the Atlas V N22 that I frequently mentioned in this article. There is also the HLV which has two of the first stage (Common Core Booster) strapped on like strap-on boosters, but it has never flown. == Related pages == * Juno * Mars Reconnaissance Orbiter * Mars Science Laboratory * NASA * New Horizons == References == Category:Rockets",
 "title": "Atlas V"
}