{
 "id": "923974",
 "text": "Alicia Escalante (born 1933) became one of the leading activists in the Chicano Movement in the 1960s. == Early life == Escalante was born in El Paso, Texas, USA. Her family had seven children. She was the second born. Her mother divorced her father. He was not a kind person. Because her mother did not have a job, her father gained custody of all the children. Escalante's mother moved to Los Angeles, California, USA, to live with her sister. Escalante was close to her mother and did not want to live with her father. At age nine, she got on a train to try to get to her mother. The police found her, but her father let her go to California. She moved to Lost Angeles with her mother. She moved during World War II. == Works == Escalante fought for welfare rights, women's rights, and economic equality during the Chicano Movement. In 1967 she created the East Los Angeles Welfare Rights Organization with her family doctor, Doctor Carlo. It was one of the first Chicana organizations. This organization taught people about welfare rules and rights. They gave information in Spanish and English. It also helped people to apply for welfare and fix problems. In 1968 she participated in the Salvador Castro's East Los Angeles Walkouts. She was arrested. In 1969 she participated in Ricardo Cruz's Catolicos por la Raza's demonstration. Escalante’s activism and involvement in the Chicano Movement made her friends with other activists: Gloria Arellanes and poet Rodolfo \"Corky\" Gonzalez. She taught Spanish and Welfare rights at Gonzalez’s Escuela Tlatelolco. She also created a bilingual Spanish and English newspaper, La Causa De Los Pobres. The newspaper helped Spanish speakers understand the government and Welfare rights. She wrote for several other newspapers to try to enable people to create change. Escalante wrote a lot of speeches, articles, and letters. She also protested police hurting people, the Vietnam War, and world hunger. Escalante also participated in the Poor People’s Campaign March on Washington. Escalante was very good at creating partnerships with other activists. She partnered with many African American organizations.Vásquez, I.,E. (2015). Black and brown tumbling the walls together. Kalfou, 2(1), 70-87. doi:https://doi.org/10.15367/kf.v2i1.52 For example, she worked with Catherine Jermany and the Los Angeles County Welfare Rights Organization. She worked with many student groups. Her work was featured in the documentary called \"Chicana,\" made in 1979 by Sylvia Morales.Zongker, B. (2022, 01). The national film registry of the library of congress welcomes is newest class. USA Today, 150, 70-77. Her papers are at the University of California, Santa Barabara's California Ethnic and Multicultural Archives. == Personal life == Escalante had five children. She was a single mother. The family lived in East Lost Angeles, California, USA. They moved to Sacramento in 1974. == References == Category:1933 births Category:American activists",
 "title": "Alicia Escalante"
}