{
 "id": "923970",
 "text": "Bo Thao-Urabe (born 1973) is the founder and network director for the Coalition of Asian American Leaders (CAAL). The group's goal is to unite Asian American leaders across different generations and ethnicities. CAAL works for justice, peace, and prosperity. Bo Thao-Urabe was Senior Director at Asian Americans/Pacific Islanders in Philanthropy (AAPIP). She created social justice initiatives. She has been recognized for her work for women's rights. Thao-Urabe's goal is to make Minnesota an welcoming place for all people. == Recognition == She has improved the community by working with local and national businesses and non-profit businesses by serving on the Boards of Nonprofits, Drake Bank, and the Minneapolis Foundation. She has won numerous awards; the National Philanthropy Day Award from the Association of Fundraising Professionals-Minnesota's Chapter, the Newsmaker Award from Minnesota's Women Press, the Impact Award from Hmong National Development, the Courageous Woman Award from Augsburg College, and the Facing Race Award from the Saint Paul Foundation. She also received a Buck fellowship award in 2019 in honor of her work to improve the community. == Early life == Bo Thao-Urabe was born on 1973 in Laos. She was born during America's war in Vietnam. Bo's family fled to Thailand. They spent three years in a refugee camp. In December 1797, she came to Chicago, IL, America, as an immigrant. She learned English quickly. She helped her mother use the public bus system. She moved to St. Paul, MN. In St. Paul Thao-Urabe found people who had similar life experiences. They talked about their experiences in a similar way. As she got older, she felt angry about the racism she saw. She believed that racism made it harder for her family to live in the United States. For example, it meant she needed to be the English interpreter for her parents. Also, it meant her family did not have help taking care of her sister, so she had to do it. == References == Category:Living people Category:1973 births Category:People from Saint Paul, Minnesota Category:Businesspeople from Chicago Category:Naturalized citizens of the United States Category:Laotian people",
 "title": "Bo Thao-Urabe"
}