{
 "id": "924359",
 "text": "Sue Ko Lee (March 9, 1920 – May 15, 1996) was a labor organizer with the Chinese Ladies’ Garment Workers’ Association. In 1938, she joined the longest strike in San Francisco’s Chinatown's (at the time) history. This strike was a fifteen week long strike against the National Dollar Stores factory. Lee and the other workers who striked were tired of the low wages and poor working conditions they were given. They did not have many job options to choose from, so were forced to take the work they could get at the National Dollar Stores factory. This was because many white owned businesses would not hire them due to the fact that they were Chinese American. She helped organize and lead the strike and delivered speeches. The Dollar Store Strike was successful, in part due to her efforts. The workers got a 5 percent raise, and the conditions in which they were working also started to improve. This strike directly impacted the workers at the National Dollar Stores factories. In addition, after the company closed, more companies, even those that were previously made up of only white people, were willing to hire Chinese Americans. After the strike, Lee also became a leader of the International Ladies’ Garment Workers’ Union. == Personal Life == Lee was born in Honolulu, Hawaii on March 9, 1920. She moved to Watsonville, California, as a child. She was the oldest of ten children. At eighteen, she married Lee Jew Hing. He was an immigrant from China. He worked as a bookkeeper for National Dollar Stores, causing Lee to eventually work at the same factory. Sue Ko Lee and Lee Jew Hing had two children together. Lee saved all of her memories, documents, and items from the strike in a scrapbook, and participated in an interview before she died. The interview and scrapbook helped give much of the currently known information about the strike. Lee died in El Cerrito, California on May 15, 1996. == References == Category:1920 births Category:1996 deaths Category:People from Honolulu",
 "title": "Sue Ko Lee"
}