{
 "id": "924366",
 "text": "Elizabeth \"Betita\" Martínez (December 12, 1925 – June 29, 2021) was a Chicana civil rights activist. Martínez fought alongside other women fighting for their voting rights. She was also a writer. In 1960, she joined the Student Nonviolent Coordinating Committee (SNCC) where she helped design a book on civil rights.SCHUDEL, M. (2021, July 14). Feminist writer and activist for Mexican Americans - Elizabeth Martinez was prominent campaigner who helped shape the Chicana sociopolitical movement in the 1960s. Independent, The/The Independent on Sunday: Web Edition Articles (London, England), 35. Available from NewsBank: Access World News – Historical and Current. She also reported on the Delano Grape Strike. Additionally, she participated in the Civil Rights movement, however, she felt lonely as she was a non-black woman. She decided to go home and help people of Mexican descent or heritage. It was in New Mexico that she founded a bilingual newspaper named El Grito del Norte which translates to \"The Cry of the North.\" Another reason she moved to Mexico was to fight for land rights agreed upon in the Treaty of Guadalupe. PERRANCE Guest Contributor, R. (2022, March 18). Faribault AAUW tribute to Women in History: Betita Martinez. Faribault Daily News (MN). Available from NewsBank: Access World News – Historical and Current.She lead protests and marches fighting for women's rights. She used her platform to better failing systems around her and helped raise awareness of the sexism and homophobia surrounding Latino culture. She reclaimed the term “Chicana” which was a derogatory term at the time. She did this to fight back against racist ideologies and norms. She worked to unite people that were black and brown and encouraged them to form alliances as they were the main minority populations in the United States. In her writings, she talked about how Chicana women were suppressed by Chicano men. Her writings often had themes of freedom and power for all people of color, specifically women. == References == Category:1925 births Category:2021 deaths Category:American civil rights activists Category:Writers from Washington, D.C. Category:Deaths from vascular dementia",
 "title": "Elizabeth Martínez"
}