{
 "id": "924409",
 "text": "Katherine A. Flores (born 1953) is a American doctor of Mexican descent. She develops programs to train more Latin American doctors in the United States. She is a Professor of Family Medicine at the University of California, San Francisco School of Medicine.Morales, Natalie (2009). \"Making a Difference, NBC Nightly News\". NBC. Retrieved 28 July 2021. She helped start the National Hispanic Medical Association. Flores works to have more and better doctors serving the Latin American communities in California's Central Valley. She encourages students to pursue careers in medicine and education. The students she works with are not usually encouraged to get education or pursue these jobs. She founded the California Borders Health Education and Training Center (HETC) program, Partnerships for Health Professions Education (PHPE), and the Hispanic Centers of Excellence (HCOE), the California Health Professions Consortium, and the Latino Center for Medical Education and Research. The Latino Center for Medical Education and Research offer the Junior Doctors Academy and Doctors Academy. Both academies support middle and high school students as they get education and study for careers in medical fields. She received a James Irvine Foundation Leadership Award in 2010. == Childhood and family life == Flores' family moved from Mexico to the United States. They worked on farms. Flores was born in Fresno, California. Her mother died when she was an infant. She was raised by her grandparents. She worked with them in farm jobs from about age four to age 16. After earning admission and full scholarship to Stanford University, Flores found college a struggle. In particular, she missed her family and community. Flores says support from two classmates kept her in school. She also got involved with advocacy for Latin American farmworkers' rights, including marching with Cesar Chavez. She began working with Latin American organizations in California and the whole United States. She wanted to convince more Latin American people to become doctors. Then Flores decided to go to medical school. She decided that helping other students succeed would also be part of her life's work. She married a professor of teacher education, Juan Flores. They have two children. == Education == Flores studied in Human Biology at Stanford University in 19701-1975. She graduated from University of California, Davis School of Medicine in 1979. After medical school, Flores returned to Fresno. She eventually started her own doctor's office there in 1983. == Career == Flores serves a diverse population. Her medical practice works in English and Spanish. Her area has many Latin American people, but very few Latin American doctors or nurses. She leads several large medical education programs. To help fight against that problem. In 1984, Flores took on her roll as a professor at UCSF School of Medicine, Department of Family and Community Medicine. In 1996, she founded the Latino Center for Medical Education and Research at UCSF, and is still the director there in 2021. From 1993-1999 Flores was the assistant dean of the University of California, San Francisco Fresno Medical Education Program. After attending the White House Health Care Reform Task Force meetings in 1993-1994, Flores was one of the ten Latin American participants who went on to found the National Hispanic Medical Association. She was one of the Association's Leadership Fellows in 1999, and went on to serve on the board of the organization, including serving as Secretary and later Chairwoman. In 2013, California Governor Jerry Brown appointed Flores to the California Healthcare Workforce Policy Commission. == References == == Other websites == *Latino Center for Medical Education and Research - UCSF, Fresno Category:1953 births Category:Living people Category:Educators from California Category:American physicians Category:Scientists from Fresno, California",
 "title": "Katherine A. Flores"
}