{
 "id": "924645",
 "text": "Marinel Sumook Ubaldo is a Filipinos climate activist from the Philippines. She helps to organise the first youth climate strike in her country. She proves as a community witness for the Philippines Commission on Human Rights. It was done as a part of her checking on the responsibly helping each other of people. Besides, she was also checking whether the effects of climate change can be considered violations of Filipinos’ human rights or not. == Activism == Ubaldo stands against the usage of the single-use plastics, the reduction of carbon emissions and in renewable energy. In 2015, Ubaldo spoke at the United Nations (UN) Climate Conference. In the meeting, she said, ‘\"please think about us, think about the coming generations who will suffer because you did not make decisions in time\"'. Ubaldo said that fighting climate change was the ‘purpose of her life’. At the same year, she was also shown in a documentary movie directed by Christoph Schwaiger. The movie was named \"Girl and Typhoons\". In October 2019, Ubaldo participated in a climate leadership training event in Yokohama, Japan. The event was established by Al Gore. She also spoke at various Japanese universities. In one of the occasions, Ubaldo said: > First World countries… [could] stop fueling climate change, and change > business practices so your carbon emission could be lessened…These countries > should be responsible and be held accountable. It’s so unfair for people, > for nations like the Philippines, to suffer from a phenomenon that we > haven’t caused. Ubaldo says that fossil fuel companies should not be allowed to do whatever they want in name of climate change. She sahd that she was an optimistic person. Her strategies were to stand for the effects of climate change that can be developed. == Career == Presently, she is working as an Advocacy Officer for Ecological Justice and Youth Engagement in Living Laudato Si’ Philippines. == References == == Other websites == * https://plan-uk.org/ * https://www.amnesty.org/en/get-involved/take-action/w4r-2019-philippines- marinel-ubaldo/ Category:Living people Category:People from Eastern Samar",
 "title": "Marinel Sumook Ubaldo"
}