{
 "id": "924748",
 "text": "Norma Meras Swenson (born 1932 as Norma Meras died 15 May 2025) is an expert on health for mothers and children. She started the organization Our Bodies, Ourselves (OBOS) along with thirteen other women. It which aims to educate women about women's health including, birth control, contraceptives, and reproductive and sexual health. Swenson co-authored the organization's book Our Bodies, Ourselves and currently serves as the chair for their Latina Health Initiative Committee. In this position, she works with female rights activists to help solve Puerto Rico's humanitarian crisis (an event that puts many people in danger) and with groups and individual Latina people who have needed to leave their homelands. Swenson also helped lead three women-led acts: maternity care, feminist health and sexuality, and global health and human rights. During the United Nations' World Conferences on Women, Swenson was a representative for OBOS. She helped shape and create the information about reproductive and sexual health that is accessible today. == Education == Norma Meras Swenson went to the Boston Girls' Latin Day School and graduated in the Tufts University class of 1953. == Career == Before joining Our Bodies Ourselves (formerly called the Boston Women's Health Collective), Swenson served as the president of the International Childbirth Education Association. She is the tenth founder of OBOS. In 1970 they published a booklet called Women and Their Bodies, which Swenson co-authored. A year later, it was republished as a book, Our Bodies, Ourselves. For over twenty years, Swenson worked at at Harvard's T.H. Chan School of Public Health. She taught medical students about issues involving women's health and reproductive rights as well as gender. Swenson is a board member of Refugee Place, an organization located at the center of the Ebola outbreak in Liberia. The organization helps with care for mothers and children. She also co-taught the Graduate Consortium in Women's Studies at MIT. == Written works == * Women and Their Bodies * Our Bodies, Ourselves Swenson co-authored Women and Their Bodies (later Our Bodies, Ourselves) along with the other founding members of the Boston Women's Health Collective. == References == Category:1932 births Category:Living people",
 "title": "Norma Meras Swenson"
}