{
 "id": "924747",
 "text": "Rose Schneiderman (April 6, 1882 - August 11, 1972) was the president of the New York Women’s Trade League from 1917 to 1949. She was also the president of the National Women’s Trade Union League (WTUL) from 1926 through 1950. She was the first-ever woman elected into a labor union in national office. She changed the American labor system and improved the lives of many American workers. In 1933, Franklin Delano Roosevelt put her on the National Labor Advisory Board. She was the only woman on the National Labor Advisory Board. She fought to include domestic workers in social security and for equal pay for female workers. Also, from 1937 to 1943 she was secretary of the New York State Department of Labor. Also, throughout the 1930s and 1940s, she worked to help Jewish refugees escape Europe during the Holocaust. Specifically, she helped relocate Jews to the United States and Palestine. Before becoming president of the New York Women’s Trade League, she was a full-time organizer for the league. She worked in the garments industry. In 1949, she began to spend time writing memoirs and speaking on radio shows. == Early life == Schneiderman was born on April 6, 1882, in Saven, Poland. In 1990, she moved to New York City with her family, and lived on the Lower East Side of Manhattan. Her parents valued education, and she knew Yiddish, English, Hebrew, and Russian. Her father died at an early age, so she left school to support her family. She first worked at a department store, then found better paying work at a garment factory. == Career == === Jewish work and legacy === In the later 1930's through the 1940's, Schneiderman worked to became very involved in moving European Jews to both Palestine and the United States. This worked was praised by Albert Einstein, and he is quoted saying, > It must be a source of deep gratification to you to be making so important a > contribution to rescuing our persecuted fellow Jews from their calamitous > peril and leading them toward a better future. - Albert Einstein, 1939 === Triangle Shirtwaist Factory fire === The Triangle Shirtwaist Factory fire caused an outburst of anger from labor activists demanding safer work environments and better safety requirements for workplaces. In the aftermath of the Triangle Shirtwaist Factory fire, in which 146 workers died trapped in the burning building, Schneiderman presented a speech > I would be a traitor to these poor burned bodies if I came here to talk good > fellowship. We have tried you good people of the public - and we have found > you wanting...This is not the first time girls have been burned alive in the > city. Every week I must learn of the untimely death of one of my sister > workers. Every year thousands of us are maimed. The life of men and women is > so cheap and property is so sacred. There are so many of us for one job it > matters little if 143 of us are burned to death. \\- Rose Schneiderman, 1909 This further strengthened her role as an activist for women's labor unions. === Women's suffrage === Schneiderman helped start the Wage Earner's League in 1911, then later toured in Ohio during 1912 during the 1912 Ohio women's suffrage vote. She also participated in a tour sponsored by the National Woman Suffrage Association. In 1917, after lots of work from Schneiderman and other suffragettes, the right to vote was given to New York Women. Her campaign and activism during World War I to stop the New York state assembly from suspending labor laws that protected women caused conservative members of the state legislature to dislike her. She was called “the Red Rose of Anarchy” by many of those conservative members. === Relationship with the Roosevelts === Schneiderman became friends with Eleanor Roosevelt through the New York Women's Trade Union League. She often came over to dinner with the Roosevelts, and helped Roosevelt connect to the working class. Schneiderman helped Franklin Delano Roosevelt come up with labor laws. == Legacy == > The woman worker needs bread, but she needs roses too \\- Rose Schneiderman, > 1911 This quote became a representation of what Schneiderman worked for her whole career. She worked tirelessly for basic human rights, like living wages, better hours of work, and better working conditions. Roses represented the extra, but still very important things she worked for in her life. Roses would include schools, more job opportunities, enjoyment of the arts, and exercise facilities. The phrase also became the name and lyrics of a song written by John Oppenheim and Farina Mimi, performed by Judy Collins and John Dever, among other artists. == References == Category:1882 births Category:1972 deaths Category:Women's rights Category:American labor leaders",
 "title": "Rose Schneiderman"
}