{
 "id": "924991",
 "text": "May Ying Chen (born 1948) is a labor organizer who specializes in immigrant workers rights. For more than twenty years, she has been actively advocating for immigrant and women’s worker rights. == Early life == Born and raised in Boston, MA, she went to Radcliffe College, receiving a BA, and UCLA attaining her MA in Education. After her graduation, she worked as a high school and adult education teacher while staying in California. ==Career== She founded a day care center that aimed on employing mainly immigrant women. Chen also taught Asian and Asian American Studies at California State University. She was inspired by the Third World Liberation movement in California from 1968-1969. Wong, D. (2019). Shop talk and everyday sites of resistance to gentrification in Manhattan's Chinatown. Women's Studies Quarterly, 47(1), 132-148. Retrieved from ProQuest. Chen started her own labor movement in 1983 where she was a member in the International Ladies Garment Workers Union(ILGWU).Later she worked on their Immigration Project in 1984. Working on The Immigrant Project, Chen helped thousands of members apply for U.S. citizenship. She organised sponsorship petitions on behalf of relatives, among other things. Chen began a full-time position at Local 23-25’s Education Department in 1989. She worked on numerous things like coordinating labor education programs, English and Civics classes, voter registration and political action projects and various other union and community activities for members. She also became active in other labor-related groups. She served on the Coalition of Labor Union Women’s National Executive Board from 1984 to 1993. She also participated in the Asian Labor Committee of New York City Central Labor Council. She was a founding member and officer of AFL-CIO’s Asian Pacific American Labor Alliance (APALA). Up until June 2009 when she retired, Chen served as the International Vice President of UNITE HERE, manager of Local 23-25 and as Secretary of the New York Metropolitan Area Joint Board. == References == Category:1948 births Category:Living people Category:People from Boston Category:American civil rights activists",
 "title": "May Ying Chen"
}