{
 "id": "925014",
 "text": "This is a list of the most expensive pieces of art made by artists that are still alive. The highest price for a piece of art by a living artist was for Jasper Johns's 1958 painting Flag. It was sold privately for what is thought to be $110 million USD ($ million in dollars). == All-time == This is a list of highest prices paid for an artist when they were living when the sale happened. Adjusted price (in millions of USD) Original price (in millions of USD) Work Artist Date Venue Ref. 110 Private sale 100 Private sale 91.1 90.3 80 Private sale 62 Sacha Jafri Humanity Inspired Royal Charity Auction, Dubai British artist sells world's largest painting The Journey of Humanity for $62m, The Guardian, March 22, 2021Sophie Prideaux, World's largest painting created in Dubai by Sacha Jafri sells for record-breaking $62 million, The National, March 23, 2021 58.4 == History of sales records == This is a list of the most expensive pieces of art at the time in an auction by a living artist. Adjusted price (in millions of USD) Original price (in millions of USD) Work Artist Date Auction house Ref. 91.82 91.1 Rabbit Christie's 92.48 90.3 Portrait of an Artist (Pool with Two Figures) Christie's 64.68 58.4 Balloon Dog (Orange) Christie's 41.11 37.1 Domplatz, Mailand Sotheby's 38.16 34.2 Abstraktes Bild (809-4) (1994) Sotheby's 40.03 33.6 Benefits Supervisor Sleeping Christie's 28.98 23.6 Hanging Heart (Magenta/Gold) Sotheby's 23.91 19.3 Lullaby Spring Sotheby's 36.48 17 False Start Sotheby's 15.02 7 White Flag Christie's 9.18 4.18 Diver Christie's 8.28 3.63 (tied) Pink Lady Sotheby's 8.49 3.63 (tied) Out the Window Sotheby's 3.23 1.2 Two Women Christie's 2.19 0.8 L'Enigme du Desir/Ma Mere, Ma Mere, Ma Mere Christie's 4.13 0.53 Mother and Child Sotheby's 1.88 0.22 Death of Harlequin/Woman in a Garden Sotheby's 1.34 0.15 (tied) La Belle Hollandaise Sotheby's \"Auction Records Broken in London: A Picasso Sold for £55, 000.\" Illustrated London News, May 16, 1959, p. 835. \"... at Sotheby's on May 6, an early Picasso nude... was sold ... for £55,000, the highest price ever paid in an auction room for the work of a living artist. Prior to this the record had been held by another Picasso, a Mother and Child, which was sold last November in New York for £54,000. 1.34 0.15 (tied) Mother and Child Sotheby's 0.066 Friedland, 1807 Stewart estate sale 0.045 Les Communiantes Mary J. Morgan estate sale Lettres, sciences, arts: Encyclopédie universelle du XXe siècle. 1908. 3: 85. \"... les Communiantes (Salon de 1884): 227,500 fr. C'est l'enchère la plus considèrable qui ait été atteinte jusqu'alors par un tableau d'artiste vivant\"Methodist Magazine. January 1901. p. 81: \"For the painting of 'The First Communion,' by Breton, [Lord Strathcona] paid the sum of $45,000, the highest price, it is said, ever paid for a modern picture sold at auction.\" * == References == == Notelist == Category:Lists Category:Works of art",
 "title": "List of most expensive artworks by living artists"
}