{
 "id": "925033",
 "text": "The Prince and the Pauper is a 1990 American animated comedy action-adventure featurette. It was produced by Walt Disney Feature Animation and directed by George Scribner. Featuring the voice of Wayne Allwine as Mickey Mouse, it is inspired by Mark Twain's 1881 novel of the same name. It was Disney's final use of the traditional ink-and-paint and camera process, before the CAPS digital-ink-and-paint process rendered the traditional techniques and equipment obsolete. Some objects, such as the carriage, were created on computers before being printed out on paper and photocopied onto animation cels.Tina Price | Facebook ==Release== The film was released on November 16, 1990, as the first animated short produced by Disney to accompany the original release of a Disney animated feature, accompanying the original release of Walt Disney Feature Animation's 29th animated feature film The Rescuers Down Under, a sequel to the 1977 animated film, The Rescuers. ==Voice cast== *Wayne Allwine as Mickey Mouse and the Prince *Arthur Burghardt as Captain Pete *Tony Anselmo as Donald Duck *Bill Farmer as Goofy, Pluto, Horace Horsecollar and Weasel #1 *Elvia Allman as Clarabelle Cow *Charlie Adler as Weasel #2, Pig Driver, Peasant and Man in Street *Frank Welker as the King and Archbishop *Trevor Eyster as Kid #1 * Rocky Krakoff as Kid #2 *Roy Dotrice as the Narrator ==Home media== ===VHS/LaserDisc=== The short was released on VHS several times. The VHS and LaserDisc counterparts were first released on June 4, 1991 as part of the Walt Disney Mini-Classics line. On January 28, 1994, the Disney Favorite Stories line was introduced a couple of months after the discontinuation of the Mini-Classics line and that same date, \"The Prince and the Pauper\" was one of the first few Disney short films that returned to VHS as part of it. The Favorite Stories version was later re-released on April 21, 1995 and May 21, 1996. ===DVD=== The short was later released on May 18, 2004 on Walt Disney Treasures: Mickey Mouse in Living Color, Volume Two: 1939-Today. ==References== ==Other websites== * * Category:1990 movies Category:1990s animated movies Category:Disney animated movies Category:Movies set in England",
 "title": "The Prince and the Pauper (1990 movie)"
}