{
 "id": "925106",
 "text": "The 2022 United States Senate election in Utah was held on November 8, 2022. The election was between Republican nominee Mike Lee and independent candidate Evan McMullin. Mike Lee won the election. This was the first Senate election in Utah's history where there was no Democratic nominee. ==Republican primary== ===Candidates=== ====Declared==== * Evan Barlow, assistant professor at Weber State University * Loy Arlan Brunson, candidate for U.S. Senate in 2012 and 2018 * Becky Edwards, former state representative (2009–2018) * Jeremy Friedbaum, candidate for U.S. Senate in 2010, 2012 and 2018 * Laird Hamblin, children's songwriter * Ally Isom, business executive, former director of institutional messaging for The Church of Jesus Christ of Latter- day Saints, and former Deputy Chief of Staff and Communications Director to former Governor Gary Herbert * Mike Lee, incumbent U.S. Senator (2011–present) File:Becky Edwards (Politician) (cropped).JPG| File:Ally Isom (41162310741) (cropped).jpg| File:Mike Lee (50544016376) (cropped).jpg| ====Did not file==== * Tyrone Jensen, political podcaster, candidate for U.S. Senate in 2018 and in 2020 * Benjamin Davis ====Withdrawn==== * Brendan Wright, area planning manager for The Church of Jesus Christ of Latter-day Saints (endorsed Edwards) ====Declined==== * Henry Eyring, assistant professor of accounting at London School of Economics and grandson of Henry B. Eyring * Erin Rider, attorney * Thomas Wright, real estate broker, former chair of the Utah Republican Party (2011–2013) and candidate for Governor of Utah in 2020. ===Results=== == Democratic convention == The Utah Democratic Party state convention took place on April 23, 2022. However, as opposed to nominating Kael Weston, the only Democrat running in the convention, the party chose to support Evan McMullin's independent campaign, following encouragement from many Democrats in the state, including former Rep. Ben McAdams and Salt Lake County Mayor Jenny Wilson. === Candidates === ==== Eliminated at convention ==== * Kael Weston, former U.S. State Department official and nominee for Utah's 2nd congressional district in 2020 ==== Did not file ==== * Austin Searle, musician ==== Withdrew ==== * Nicholas Mitchell, scientist and business owner (running for Utah's 2nd congressional district) * Allen Glines, community activist and writerhttps://twitter.com/AllenBGlines/status/1501305985545039872?t=UxcWUzEoI5AyT5vftGAZbg&s;=19 ==== Declined ==== * Ben McAdams, former U.S. Representative for (2019–2021) (endorsed McMullin) * Steve Schmidt, political commentator for MSNBC, founder of The Lincoln Project, and former Republican political strategist === Convention vote === The Utah Democratic Party held a state convention on April 23, 2022. At here they endorsed candidates for state offices. Supporters of Evan McMullin, led by Salt Lake County mayor Jenny Wilson, introduced a motion for the state party to forgo nominating a Democratic candidate for the U.S. Senate and to instead \"join Evan McMullin’s independent coalition to beat Mike Lee\". They contended that not doing so would split the anti-Lee vote in the general election. The motion was opposed by supporters of Kael Weston, the lone Democratic candidate for the seat who thus would have received the nomination had the motion failed. The delegates passed the motion by a 57%–43% margin. Motion to endorse independent candidate Evan McMullin Option Votes % Yes 782 56.83% No 594 43.17% Total 1,376 100.00% ==Libertarian primary== ===Candidates=== ====Declared==== * Lucky Bovo * James Hansen ===Results=== == Independent American primary == === Candidates === ====Declared==== * Tommy Williams, perennial candidate ==Independents== ===Candidates=== ====Declared==== * Evan McMullin, political activist, former CIA operations officer, and candidate for President of the United States in 2016 File:Evan McMullin October 2019.png| ==References== Utah Utah Category:2020s in Utah",
 "title": "2022 United States Senate election in Utah"
}