{
 "id": "925186",
 "text": "This is a list of men and women who are (or have been) the tallest people in the world. The tallest in the world is Robert Waldow. *Angus MacAskill () 7 ft 9 in. *Siddiqa Parveen (born 1985) is the tallest living woman in the world since 2021. She is tall. *Nellie Lambert (born 1894) is the tallest woman in history, in 1913, it claimed that Nellie was 8 feet 5 inches (256.54 cm) tall, she was the tallest bride ever at only 19 years old. Name Lifespan Height Picture Known for Robert Wadlow 1918-1940 8ft 11.1in (272 cm) Tallest verified person. He was 6 ft by age 8 and in 1940, he was measured as 8 ft 11 in and 200 kg. John Rogan 1867-1905 8 ft 9 in (267 cm) 2nd tallest person. Tallest African-American. Couldn't stand up due to ankylosis. Doctors measured his height while sitting down at 8 ft 9 in at it's least. John F. Carroll 1932-1969 8 ft 7 in (264 cm) His standing height was 8 ft (244 cm). Franz Winkelmeier 1860-1887 8 ft 6 in (259 cm) Tallest Austrian. Leonid Stadnyk 1970—2014 8 ft 5.5 in (258 cm) Tallest person from Ukraine. His record was never verified because he refused to be measured. He was probably 7 ft 8 in. Trijntje Keever 1616-1633 8 ft 4 in (254 cm) Tallest female person and tallest person from the Netherlands. The Netherlands is the only place where the tallest person is a woman. Vaino Myllyrinne 1909-1963 8 ft 3 in (252 cm) Tallest Finnish. Sultan Kösen 1982- 8 ft 3 in (251 cm) Tallest Turkish and tallest person alive. He also possesses the record for the largest hands ever. Parimal Barman 1962-1991 No picture Tallest Bangladeshi. Contested against Jinnat Ali (below) Jinnat Ali 1996-2020 8 ft 2 in (249 cm) Tallest Bangladeshi. He had to eat 1 kg of food every day. He weight 298 kg (656 lb) before he succumbed to a brain tumor in 2020. Contested against Parimal Barman. Don Koehler 1925-1981 No Picture Zeng Jinlian 1964 - 1982 8 ft 1.75 in (248 cm) Julius Koch 1872-1902 8 ft 1 in (246 cm) Brahim Takioullah 1982- 8 ft 1 in No picture Morteza Mehrzad Selakjani 1987- 8 ft 1 in Jorge Gonzalez 1966-2010 8 ft 0 in Abiodun Adegoke 2000 7 ft 11 in Naseer Soomro 1970 - 2025 7 ft 9 in (236 cm) Bao Xishun 1951- 7 ft 9 in Radhouane Charbib 1968- 7 ft 9 in Abiodun Adegoke 1992- 7 ft 9 in Broc Brown 1997- 7 ft 8 in Gheorghe Muresan 1971- 7 ft 7 in Manute Bol 1962-2010 7 ft 7 in Robert Bobroczky 2000- 7 ft 7 in Olivier Rioux 2006- 7 ft 7 in Matthew McGrory 1973-2005 7 ft 6 in Tacko Fall 1995- 7 ft 5 in Jamarion Sharp 2001- 7 ft 5 in Zach Edey 2002- 7 ft 4in André the Giant 1946-1993 7 ft 4 in Victor Wembanyama 2004- 7 ft 4 in Peter Mayhew 1944 - 2019 7 ft 3 in (221 cm) Jeison Hernandez ?- 7 ft 2.5 in == Disputed Claims == Name Lifespan Height Picture Jose Punlos 1907- ? 10 ft 6 in (320 cm) Abou El Sayed 1924- 10 ft 2 in (309 cm) Spanish Giant ?-? 9 ft 6 in (289 cm) Giant Soldier ?-? 9ft 5in (287 cm) Feodor Machnow 1878-1912 9 ft 4 in (285 cm) Ho Van Trung 1985-2019 9 ft 0 in (274 cm) Pornchai Saosri 1989 - 2015 8 ft 10 in (269 cm) == Various Sports == Sport Name Height Lifespan Basketball Alexander Sizonenko 7 ft 11 in 1959-2012 Football Kristof van Hout 6 ft 10 in 1987- Volleyball Morteza Mehrzad Selakjani 8 ft 1 in 1987- ==References== Category:Lists of people",
 "title": "List of tallest people in the world"
}