{
 "id": "925351",
 "text": "In some places, very few children are in a large area. These people usually live far apart. If there are settlements, they are also far apart. In most places of the world, children of a certain age need to go to school. School of the Air is a phrase which describes children being taught using radio, or other technologies. The children do not need to travel, they stay at home. The phrase was first used for a kind of distance learning, which is targeted at chldren going to primary or secondary schools. It was first used in remote areas of Australia, especially the outback. In these areas, people live too far apart, and there are too few school-age children to run a normal school in a village. == History == Around 1929, Alfred Traeger invented a radio that could be run by human power, it was called the pedal radio. With Adelaide Miethke, who was a teacher, they made up a programme for schools, which also used the radio communication services of the Royal Flying Doctor Service. These were important milestones that helped develop the School of the Air. The first School of the Air lessons were officially sent from the Royal Flying Doctor Service in Alice Springs on 8 June 1951. The service celebrated its 50th jubilee on 9 May 2001, ahead of the real jubilee on 8 June;Ashton, Jean (1978) School of the air. Adelaide : Rigby, 1978 Previously published as Out of the silence, Adelaide: Investigator Press, 1971. and its 70th year on 8 June 2021. Each state of Australia that uses this means of training has well- documented checks and overviews of the service. == Method == There are School of the Air programmes in all states except Tasmania.http://australia.gov.au/about-australia/australian-story/school-of- the-air In 2005, there were more than sixteen schools of the air located around Australia, a network covering more than 1.5 million square kilometres. In fact, Tasmania and the Australian Capital Territory are the only states who do not have a School of the Air. These schools also teach children who are travelling around Australia or who can't, for medical or other reasons, attend a regular school. School classes were conducted via shortwave radio from 2003 until 2009. After 2009, most schools switched to wireless internet technologies: The lessons include live one-way video feeds and clear two-way audio.Bond, Donald S & Publishing and Broadcasting Ltd (1978). In Satellite communications for the school of the air in Australia. Publishing and Broadcasting Ltd, Sydney Each student has direct contact with a teacher in an inland town such as Broken Hill, Alice Springs or Meekatharra. Each student typically spends one hour per day receiving group or individual lessons from the teacher. The rest of the day, the students spend working through the assigned materials with a parent, older sibling or a hired home-stay tutor. Originally the students got their course materials and returned their written work and projects to their hub centre using either the Royal Flying Doctor Service or post office services. However the extension of Internet services into the outback now allows for more rapid review of each child's homework. The children using this kind of training are living far away from other people. Very often, the School of the Air is their first chance to get to know other children who are not part of their family. Three or four times a year, the children travel to the school, where they spend a week with their teacher and classmates. Studies have shown that in most cases, this kind of schooling has the same quality as traditional methods of schooling; in some cases it was even better than the traditional methods. == Awards == In 2009 as part of the Q150 celebrations, the School of the Air was announced as one of the Q150 Icons of Queensland for its role as an iconic \"innovation and invention\". == Schools of the Air == Schools of the Air operate from: === New South Wales === * Broken HillGibb, Phyllis (1986). In Classrooms a world apart : the story of the founding of the Broken Hill School of the Air. Spectrum, Melbourne. (pbk.) * Tibooburra === Northern Territory === * Alice Springs * Katherine === Queensland === * Cairns * Charleville * Charters Towers * Longreachhttp://www.abc.net.au/rn/science/ss/stories/s140221.htm about Longreach * Mount Isahttp://www.mtisasde.eq.edu.au// School of the Air – Mount Isa === South Australia === * Port Augusta – now part of Open Access College === Victoria === * Thornbury === Western Australia === * Carnarvon * Kalgoorlie * Kimberley region, in Derby * Meekatharra * Port Hedland == Notes == == Other websites == * Category:Types of educational institutions",
 "title": "School of the Air"
}