{
 "id": "925380",
 "text": "Texas v. Pennsylvania, 592 U.S. ___ (2020), was a lawsuit filed at the United States Supreme Court saying that the 2020 presidential election in certain states were rigged and that Joe Biden did not beat President Donald Trump. This was one of the many attempts by Trump to overturn the election results. The case was filed by Texas State Attorney General Ken Paxton on December 8, 2020. Texas v. Pennsylvania said that Georgia, Michigan, Pennsylvania, and Wisconsin violated the United States Constitution by changing election rules through non-legislative means. Three days later, the United States Supreme Court said they will not hear the case thus ending the lawsuit. ==Purpose== This case was filed by Trump supporters to stop the certified vote count from these four states before the Electoral College vote on December 14. The suit was filed after about 90 lawsuits from disputes over the election results filed by Trump and the Republican Party had failed in many state and federal courts. ==Creation== The suit had been created by a team of lawyers with ties to the Trump presidential campaign. Paxton agreed to file the case after other state attorneys general declined to do so. The Solicitor General of Texas Kyle D. Hawkins did not support the suit and refused to let his name be added. Within one day of Texas's filing, Trump, over 100 Republican Representatives, and 18 Republican state attorneys general filed motions to support the case. Trump called this case as \"the big one\" of the election-challenging lawsuits. Many who were against this case urged the Court to refuse the case, with Pennsylvania's brief calling it a \"seditious abuse of the judicial process\". Many legal experts did not believe this case would be successful to Trump. ==Supreme Court decision== The Supreme Court said on December 11, 2020 that they would not hear the case because there was no \"legal standing\" to challenge the results of the election held by another state. ==References== Category:2020 United States presidential election Category:Donald Trump Category:Joe Biden Category:December 2020 events",
 "title": "Texas v. Pennsylvania"
}