{
 "id": "925423",
 "text": "use both this parameter and |birth_date to display the person's date of birth, date of death, and age at death) --> | death_place = | death_cause = | body_discovered = | resting_place = | resting_place_coordinates = | burial_place = | burial_coordinates = | monuments = | nationality = Romanian | other_names = | siglum = | citizenship = | education = | alma_mater = | occupation = environmental activist and journalist | years_active = | era = | employer = | organization = CEE Bankwatch Network | agent = | known_for = Energy Campaigns Coordinator of CEE Bankwatch Network | notable_works = | style = | net_worth = | height = | television = | title = | term = | predecessor = | successor = | party = | movement = | opponents = | boards = | criminal_charges = | criminal_penalty = | criminal_status = | spouse = | partner = | children = | parents = | mother = | father = | callsign = | awards = | website = | module = | module2 = | module3 = | module4 = | module5 = | module6 = | signature = | signature_size = | signature_alt = | footnotes = }} Ioana Ciută is a Romanian environmental activist and journalist. She lives in Bucharest. She works as the Energy Campaigns Coordinator of the CEE Bankwatch Network. It is a global network operating in Central and Eastern Europe. It is one of the largest networks of environmental NGOs in that country.Xing, Li (2021-06-14). China-EU Relations in a New Era of Global Transformation. Routledge. ISBN 978-1-000-40756-3.Memoirs of the Section of Philological Sciences, Literature and Arts of the Academy of the Socialist Republic of Romania (in Romanian). Editura Academiei Române. 1989.Marineasa, Viorel (1990). În pasaj: roman (in Romanian). Editura Militară. ISBN 978-973-32-0129-8. == Professional Career == Ciută joined Bankwatch in 2014 as coordinator of the \"Balkan Without Coal\" campaign. It was preventing the construction of new coal mines in the Western Balkans. Ciută covered nuclear energy development in Romania and Bulgaria. It was before joining Bankwatch. She followed international negotiations on global warming. She holds a degree in journalism. However, her environmental activism long preceded her journalistic work. == Roles in International politics == Ioana Ciută builds a close relationship with her groups of members as well as project partners from different countries including Serbia, Bosnia and Herzegovina, Montenegro and Macedonia. She supported them to the national campaigns. Besides, she also supported them for stricter environmental regional policies. == Related pages == * Monika Sadkowska — Former actress and environmental activist * Tishiko King — Indigenous Australian climate activist == References == Category:People from Bucharest Category:Romanian journalists Category:Environmentalists",
 "title": "Ioana Ciută"
}