{
 "id": "925534",
 "text": "use both this parameter and |birth_date to display the person's date of birth, date of death, and age at death) --> | death_place = | death_cause = shot 4 times for protecting the Kiambu Forest in Kenya | body_discovered = | resting_place = | resting_place_coordinates = | burial_place = | burial_coordinates = | monuments = | nationality = Kenyan | other_names = | siglum = | citizenship = Kenyan | education = | alma_mater = | occupation = land and environmental rights defender (LED) activist | years_active = | era = | employer = | organization = | agent = | known_for = land and environmental rights defender (LED) activism | notable_works = | style = | net_worth = | height = | television = | title = | term = | predecessor = | successor = | party = | movement = | opponents = | boards = | criminal_charges = | criminal_penalty = | criminal_status = | spouse = | partner = | children = | parents = | mother = | father = | callsign = | awards = | website = | module = | module2 = | module3 = | module4 = | module5 = | module6 = | signature = | signature_size = | signature_alt = | footnotes = }} Joannah Stutchbury was a Kenyan land and environmental rights defender (LED) activist. She was the one of the leading conservationists of the environment of Kenyan forests. She was remembered for her dedicated efforts to protect Kiambu forest from encroachment. She helped a lot to the Kenya Forest Service during her lifetime. She raised her voice against the destruction of the Kiambu forests. She was shot multiple times and was killed on 15 July 2021. She died at the age of 67. Joannah was the great-niece of Jim Corbett. == Activism and Murder == Joannah Stutchbury was campaigning against the developer businessmen encroaching on the Kiambu Forest near Nairobi. She had spoken out against land-grabbers and famous private developers. In 2018, she hit the headlines when she single-handedly confronted those developers. The developers were felling trees in the Kiambu Forests. Due to her intense activism, Stutchbury was threatened to be killed many times. However, she received no protection from police. She was told by unknown people that they would kill her if she continued intervening and destroying their plans. They warned her not to stop them in constructing a roadway through the forest. On 15 July 2021, Joannah Stutchbury was shot dead near her home in Kenya, because of her campaign against the development of wetlands in a national park. On the day of the incident, she stopped her car to clear branches blocking her driveway. Then, suddenly, she was shot several times. Later, her neighbours found her body in her car. Her car engine was still running. Surprisingly, her valuables were still in the vehicle. From that, it was confirmed that the attack was not a robbery. Stutchbury had raised her voice against the local businessmen, against the encroachment and building up of structures on the nearby Kiambu Forest. Before the incident, she had received multiple death threats, but nevertheless continued to stand for the environment until her death. According to a report from \"Permaculture\", Joannah Stutchbury was shot four times during her murder. The World Forest Organisation petitioned to the President of Kenya, to protect an area of the forest at national level, in honour of Joannah. == References == == Other websites == * https://www.america-times.com/joannah-stutchbury-she-lived-for-her-forest/ * https://www.american-times.com/ Category:Kenyan activists Category:2021 deaths",
 "title": "Joannah Stutchbury"
}