{
 "id": "925698",
 "text": "Funland (Rehoboth Beach) is a family owned amusement park in Rehoboth Beach, Delaware. It has 19 rides. There are also family style games and an arcade. The park is off the Rehoboth Beach boardwalk. It opened in 1939 as The Rehoboth Beach Sports Center. It was purchased by the Faschnacht family in 1962., They changed the name to Funland. In 2023, it is owned and run by the Faschnacht family. Funland has some rides that were there when it was purchased. The two oldest rides are The Boats and The Fire Engines. Both of them were likely opened in 1946 or 1947. The park is known for its cheaply priced tickets and its Haunted Mansion ride. It is the only amusement park in the state of Delaware. Funland opened for its 61st season on May 7, 2022. == History == Before the name was changed to Funland in 1962, the park was known as The Rehoboth Beach Sports Center. It was owned by the Dentino family. On March 6, 1962, nine days before the sale was final, the Ash Wednesday Storm of 1962 started. The storm lasted three days. The Rehoboth Beach Sports Center was one of the few business that were not destroyed by the storm. It was damaged but the Faschnacht family decided they still wanted buy it. Funland gets between 250,000 and 350,000 visitors each year. == Rides == Funland has 19 rides. It also has a play area for children. Five of the nineteen rides were there when Funland was bought. These rides are the Merry Go Round, Boats, Fire Engines, Sky Fighters, and Helicopters. Rides Attraction Type Year Ride Opened Boats Likely 1946 or 1947 Fire Engines 1946 or 1947 Merry Go Round Carousel 1960 Sky Fighters Between 1956 and 1962 Cycles 1971 Swinger Swing 1984 Kiddie Wheel Kiddie Ferris Wheel 2005 Trucks 2000 Cruisers Music Express 1988 Helicopters Red Baron 1961 Crazy Dazys Teacups 1964 Free Spin Kiddie drop tower 2022 Paratrooper Paratrooper 1982 Gravitron Gravitron 1984 Bumpler Cars Bumper cars 2001 Sea Dragon Pirate Ship 1990 Superflip 360 Pendulum 2017 Haunted Mansion Haunted house 1979 ==References== Category:Theme parks in the United States Category:1962 establishments in the United States Category:Sussex County, Delaware Category:20th-century establishments in Delaware",
 "title": "Funland, Rehoboth Beach"
}