{
 "id": "925761",
 "text": "use both this parameter and |birth_date to display the person's date of birth, date of death, and age at death) --> | death_place = | death_cause = | body_discovered = | resting_place = | resting_place_coordinates = | burial_place = | burial_coordinates = | monuments = | nationality = Colombian | other_names = | siglum = | citizenship = Colombia | education = | alma_mater = | occupation = * UNESCO Human Rights and Peace Advisor * Politician, Indigenous Leader and Social Leaderof the Nasa people * Senate of the \"Republic by the Special Indigenous Constituency\" * Leader of the \"Alternative Indigenous and Social Movement\" (MAIS) * Health Promoter and Health Program Coordinator for the \"Cauca Indigenous Association\" (AIC) * Health Program Coordinator for the \"Regional Indigenous Council of Huila\" (CRIHU) * Senior Counselor of the \"Regional Indigenous Council of Cauca\" (CRIC) | years_active = | era = | employer = | organization = * Regional Indigenous Council of Cauca (CRIC) * Republic by the Special Indigenous Constituency * Alternative Indigenous and Social Movement (MAIS) * Cauca Indigenous Association (AIC) * Regional Indigenous Council of Huila (CRIHU) | agent = | known_for = * leading the 2008 Indigenous Minga * winning the National Award for the Defense of Human Rights in Colombia | notable_works = | style = | net_worth = | height = | television = | title = | term = | predecessor = | successor = | party = | movement = | opponents = | boards = | criminal_charges = | criminal_penalty = | criminal_status = | spouse = | partner = | children = | parents = | mother = | father = | callsign = | awards = | website = | module = | module2 = | module3 = | module4 = | module5 = | module6 = | signature = | signature_size = | signature_alt = | footnotes = }} Aída Marina Quilcué Vivas (born in Páez , Cauca) is a Colombian politician, indigenous leader and social leader of the Nasa people. She belongs to the \"Regional Indigenous Council of Cauca\" (CRIC). She had been a UNESCO human rights and peace advisor. In 2022, she was elected to be the Senate of the \"Republic by the Special Indigenous Constituency\". Her party, the Alternative Indigenous and Social Movement (MAIS), was given assurance. == Activism == In the 1990s, she was a health promoter for the Cauca Indigenous Association (AIC). In 2000, she was coordinator of the health program at the AIC and at the Regional Indigenous Council of Huila (CRIHU). Between 2003 and 2009, she was appointed Senior Counselor of the Regional Indigenous Council of Cauca (CRIC). She was one of the organizers of the 2008 Indigenous Minga. In the event, thousands of indigenous people marched to the city of Bogotá in protest. Her husband, Edwin Legarda, died on December 16 in a hospital in Popayán after receiving three rifle shots. Her husband was fired by soldiers on the highway connecting Inzá with Totoró, in the department of Cauca . During the trial and in the following years, Quilcué and her daughter have been victims of death threats and attacks. == Awards and Honours == In 2021, she was the winner of the National Award for the Defense of Human Rights in Colombia. It was in the category \"Defense for a Whole Life\". == References == Category:Colombian politicians Category:People from Cauca Category:Living people Category:Year of birth missing (living people)",
 "title": "Aida Quilcué"
}