{
 "id": "926053",
 "text": "Philipp Köhn (born 2 April 1998) is a Swiss football player. He plays for Monaco in Ligue 1 as a goalkeeper. ==Club career== He played in the youth teams of SuS 09 Dinslaken, MSV Duisburg, Schalke 04 and VfB Stuttgartprofile Philipp Köhn 2017 he went on to RB Leipzig and 2018 to FC Red Bull Salzburg in the Austrian Bundesliga.FC Red Bull Salzburg Homepage (German) He played for the farmteam FC Liefering. 2020 he went to FC Wil on loan.Spox.com (German) There he played 32 matches in the Swiss Challenge League. 2021 he came back to Salzburg and became number one goalkeeper of FC Red Bull Salzburg. ==National team== From 2012 to 2018 he played for the German U15, U16, U17 and U18 national teams. In August 2019 he debuted for the Swiss U19 national team versus Slovakia. 2019 he played his first match for the Swiss U21 team. He was in the team for the U21-European Championship but did not play. In November 2021 he was in the Swiss squad for the first time. ==Career statistics== Appearances and goals by club, season and competition Club Season League National cup Continental Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Liefering 2018–19 2. Liga 12 0 — — — 12 0 Red Bull Salzburg 2019–20 Austrian Bundesliga 0 0 0 0 0 0 — 0 0 2021–22 Austrian Bundesliga 28 0 3 0 10Appearance(s) in UEFA Champions League 0 — 41 0 2022–23 Austrian Bundesliga 32 0 2 0 8Six appearances in UEFA Champions League, two appearances in UEFA Europa League 0 — 42 0 Total 60 0 5 0 18 0 — 83 0 FC Wil (loan) 2020–21 Swiss Challenge League 32 0 1 0 — — 33 0 Monaco 2023–24 Ligue 1 1 0 0 0 — 0 0 1 0 Career total 105 0 6 0 18 0 0 0 129 0 ==Honours== *Austrian Bundesliga: 2019-20, 2021-22, 2022-23 *Austrian Cup: 2019–20, 2021-22 ==References== Category:1998 births Category:Living people Category:Swiss association football goalkeepers Category:German association football goalkeepers Category:FC Red Bull Salzburg players Category:FC Liefering players Category:2022 FIFA World Cup players Category:Austrian football champions",
 "title": "Philipp Köhn"
}