{
 "id": "926044",
 "text": "Gabriela Baeza Zamora is a Mexican environmental activist, speaker and expert in sustainable development. She is recognised for popularising the zero waste movement in Latin America. She used the documentary short movie El Reto (July 8, 2017) as an instrument of her career. Since then, Baeza has spoken at meetings in important events on environmental issues. Examples include those of the Green Expo, the Ecofest and the Circular Economy Congress of Mexico. In July 2019, the newspaper El País included her in its list of the \"10 world leaders who do not give up\". == Early life and studies == Baeza was born in Mexico City. She studied Environmental Sciences. Later, she did a specialization in Environmental and Ecological Economics at the National Autonomous University of Mexico UNAM. She got a master's degree in Sustainable Development from the Universities of Utrecht and Leipzig. During her stay in Europe, she had spoken on conservation in countries such as Austria, Serbia and Croatia. == Career == After obtaining her master's degree, Baeza became professionally connected to the German Cooperation for Sustainable Development GIZ. She was serving as an advisor to the waste energy use program. In 2016, she started using the concepts about the zero waste movement in her everyday life. The ideas are based on the reuse of waste that is normally stored or burned. It contributes to the purification of the planet earth. In 2017, Baeza achieved fame in her native country and in Latin America. She produced and directed the documentary short movie El Reto (The Challenge). In the movie, she shows her experience since she embraced this lifestyle. It had a strong impact on social networks, getting millions of views. Since that time, Baeza has appeared many times in social media. She explained the ideology of the movement and advised for it to be applied effectively in homes. As a lecturer, she has participated in important environmental events such as the Mexico Circular Economy Congress, the Green Expo and the Ecofest, among others. Baeza is considered an Internet celebrity in the Mexican environmental movement. The method proposed by Baeza involves the use of glass containers and paper bags, bulk purchases, reuse and recycling. On her blog, Baeza advised people on the subject and offers environmental awareness content. == Movie production == 2017 - El Reto (The Challenge) - documentary short movie. == References == == Other websites == * El Reto (The Challenge) - documentary short film * Cero Basura project on Facebook * Cero Basura project on Instagram Category:Year of birth missing (living people) Category:Living people Category:Environmentalists Category:Mexican activists Category:Ecologists",
 "title": "Gabriela Baeza"
}