{
 "id": "926041",
 "text": "Zuhal Atmar is an Afghan entrepreneur and environmentalist. She is the first woman to owe and to manage a recycling plant in Afghanistan. She is also a researcher as well as an economic affairs analyst. She was included in BBC's list of 100 influential and inspiring women for 2021. == Early life and career == Atmar was born in Afghanistan. An account cited that she was a refugee in Pakistan. In Pakistan, she completed her education. She came back to Afghanistan after the fall of the Talibans. She started her career as a researcher. She worked for the Afghanistan Research and Evaluation Unit. She promoted women's education, community voice, equal opportunities and access to livelihood. == Activism == Atmar's environmental work began with a desire to say something about the climate change. She created a recycling plant to help in controlling the pollution rate in Kabul. In an interview, she highlighted the problems of the one-time use of plastic. According to her, such plastic contribute to the 308 tons of garbage generated in Kabul everyday. This facility is called Gul-Mursal Waste Paper Recycling Factory. It processed 33 tons of garbage every week. Her leading work at the recycling facility exposed her to gender discrimination and harassment. She said that it was difficult to set up her company as women in Afghanistan do not have access to loans. The reason for such discrimination is that they fail to complete requirements such as guarantor, business partner and collateral. She operated her company after getting a $100,000 loan from the United States Agency for International Development (USAID). Atmar also struggled with patriarchy. She said she was harassed by male competitors. In a report, Atmar said that “there’s a lot of judgment and many people are bothered by me running my own business.” Atmar was included in BBC's list of 100 influential and inspiring women for 2021. == References == Category:People from Kabul Category:Environmentalists Category:Living people Category:Afghan activists Category:Climate activists Category:1984 births Category:BBC 100 Women Category:Refugees Category:21st- century Afghan people",
 "title": "Zuhal Atmar"
}