{
 "id": "926154",
 "text": "Patricia Espinosa Cantellano (born October 21, 1958) is a Mexican politician and ambassador. She is currently serving as the executive secretary of the United Nations Framework Convention on Climate Change. Previously, she served as the Mexican Ambassador to Austria, Germany, Slovenia and Slovakia. Besides, she served as Secretary of Foreign Affairs in the cabinet of President Felipe Calderón. She completed her graduation in International Relations from El Colegio de México. She got a diploma in International Law at the Graduate Institute of International and Development Studies in Switzerland. She is married and has two children. == Career == Espinosa joined the Foreign Service on September 16, 1981. She served at the Mexican delegation to the United Nations in Geneva. From 1992 to 1997, she worked at the Mexican delegation to the United Nations at New York City. She also served as general director of the Ibero-American Summit and the Summit of the Americas. She was promoted to Ambassador within the Foreign Service in 2000. She served at the Mexican Embassy in Germany from January 2001 to June 2002. She left the post to serve as Ambassador to Austria. It was concurrent with a number of international organisations in Vienna, from June 2002 to November 2006. On November 28, 2006, President-elect Felipe Calderón announced that she would serve as his Secretary of Foreign Affairs starting on December 1, 2006. Her importance included the diversification of the United States-Mexico agenda (heavily concentrated on immigration and security issues). It also includes the rebuilding of diplomatic relations with Cuba and Venezuela. These were strained during the previous administration. In May 2016, she was selected by United Nations Secretary-General Ban Ki-moon to be the Executive Secretary of the United Nations Framework Convention on Climate Change (UNFCCC). == Other works == * International Gender Champions (IGC), MemberMembers International Gender Champions (IGC). == References == == Other websites == *Secretariat of Foreign Affairs Category:Living people Category:1958 births Category:Ambassadors of Mexico Category:Politicians from Mexico City",
 "title": "Patricia Espinosa"
}