{
 "id": "926376",
 "text": "Richard Crafus, known as King Dick January 15, 1783 - 1835), was an American imprisoned by the British in Dartmoor Prison during the War of 1812. King Dick was a privateer who had been captured during the war. Although the prison held non-Americans, these were released around the end of the war. The Americans were held longer. In the prison, this tall African-American became the leader of black inmates after the white Americans successfully petitioned the prison administration for segregation. The prison division that King Dick led was Prison Number Four. According to memoirs written by white inmates, he ruled strictly and fairly. This meant that life in Prison Number Four more desirable than elsewhere in Dartmoor Prison. Because King Dick allowed whites to transfer to Number Four, many whites did so. In 1815, the British released the American prisoners of war. Apparently, Crafus went to Boston. In that city, an African-American named King Dick taught boxing from 1826 through 1835. He also served as an auxiliary on the police department. \"He led an annual procession around Boston Common on Election Day, after which he gave a patriotic speech.\" https://www.newenglandhistoricalsociety.com/richard-crafus-black-captive-king- of-war-1812/ ==Physical description== King Dick was at least six foot three, whereas the average height in the prison was only five foot six. He was \"physically powerful and a masterful bare-knuckle boxer. He wore a bearskin grenadiers’ cap as a symbol of his authority.\" https://www.newenglandhistoricalsociety.com/richard-crafus-black-captive-king- of-war-1812/ ==Death== \"Richard Crafus probably died around 1835.\" https://www.newenglandhistoricalsociety.com/richard-crafus-black-captive-king- of-war-1812/ == References == ==Other sources== * Guyatt, Nicholas (2022) The Hated Cage: An American Tragedy in Britain’s Most Terrifying Prison. Basic Books: New York. * Horsman, Reginald (February 1975) \"The Paradox Of Dartmoor Prison,\" American Heritage. https://www.americanheritage.com/paradox-dartmoor- prison * Lipke, Alan Thomas (2013) The Strange Life And Stranger Afterlife Of King Dick including His Adventures in Haiti and Hollywood With Observations On The Construction Of Race, Class, Nationality, Gender, Slang Etymology and Religion. (M.A. Thesis, University of South Florida) https://digitalcommons.usf.edu/etd/4530 / https://scholarcommons.usf.edu/cgi/viewcontent.cgi?referer=&httpsredir;=1&article;=5727&context;=etd * Stephen B.Luce Library (February 11, 2015) Black History Month 2015: Prolific African Americans in Maritime History, Society and Industry. https://www.slideshare.net/LuceLibrary/black-history-month-2015 Category:1783 births Category:1835 deaths Category:Privateers Category:People from Boston",
 "title": "Richard Crafus"
}