{
 "id": "92646",
 "text": "The John F. Kennedy Space Center (KSC) is a spaceport in Merritt Island, Florida. It is one of the ten field centers of NASA. It was originally known as Launch Operations Center. Since December 1968, KSC has been the main launch site of human spaceflight, research, and technology of the United States. Its Launch Complex 39 has been used to launch spacecraft under Apollo, Skylab and Space Shuttle programs. KSC borders Cape Canaveral Space Force Station (CCSFS), which works with KSC. The first Apollo flights and all flights under Project Mercury and Project Gemini took off from Cape Canaveral Space Force Station. It was known as Cape Canaveral Air Force Station (CCAFS) when the flights took place. Launch Operations Directorate, and later Kennedy Space Center, looked after after their launches. Since the fourth Gemini flight, the Mercury Control Center (MCC), later the Launch Control Center (LCC), looks after a space vehicle until the vehicle takes off. After that, the Christopher C. Kraft Jr. Mission Control Center (MCC-H) in Houston looks after the vehicle. Before the fourth Gemini flight, the Mercury Control Center looked after the vehicle for the entire flight. Additionally, KSC looks after the launch of robotic and commercial crew flights. It also researches on food production and in-situ resource utilization to explore outside our Earth. Since 2010, KSC has worked to become a multi-user spaceport through industry partnerships. It also adds new launch pads, for example Launch Complex 39C and Launch Complex 48. There are about 700 facilities and buildings in the of KSC. The unique facilities of KSC are the tall Vehicle Assembly Building (VAB) to assemble rockets, the Launch Control Center (LCC) to start space launches, the Operations and Checkout Building (O&C;) for astronauts, the Space Station Processing Facility (SSPF) and the long Launch and Landing Facility (LLF). There is also a Visitor Complex open to the public. ==Location== Kennedy Space Center is on Merritt Island, Florida. It is northwest of Cape Canaveral on the Atlantic Ocean and east of Orlando. It is in the middle of Miami and Jacksonville on Florida's Space Coast. It is long and roughly wide. It covers an area of . KSC is a major tourist attraction of Central Florida. It is approximately one hour's drive from Orlando. The visitor center offers public tours of KSC and the nearby Cape Canaveral Space Force Station (CCSFS). ==Past programs== ===Apollo program=== From 1967 to 1973, there were 13 launches of the Saturn V rocket from Kennedy Space Center. All Apollo flights after Apollo 7 took off with Saturn V. The first Saturn V launch, Apollo 4, was also the first rocket launch from Kennedy Space Center. It launched on November 9, 1967. The first Saturn V launch carrying people was on December 21, 1968. It sent Apollo 8 to an orbit around the Moon. The next two flights tested the Apollo Lunar Module: Apollo 9 and Apollo 10. Apollo 11 launched from Launch Complex 39A on July 16, 1969. It carried astronauts Neil Armstrong, Buzz Aldrin and Michael Collins to the Moon. Apollo 11 landed on the Moon on July 20, 1969. About 650 million people watched the event on television. All Apollo flights from 12 to 17 launched from KSC and all of them went to the Moon. === Skylab === The last Saturn V rocket put the Skylab space station around Earth from Launch Complex 39A. It took off on May 14, 1973. The launch pads 34 and 37 at Cape Kennedy were used for Saturn IB before the Skylab program. When the space station was launched, the two launch pads were destroyed. Launch Complex 39B was changed to fit the small rocket. It was used to launch three flights to Skylab with people in 1973. The launch pad was also used to launch the Apollo spacecraft under the Apollo–Soyuz Test Project in 1975. ===Space Shuttle=== When NASA was designing the Space Shuttle, the agency got proposals to build more places to launch and land the vehicle outside Kennedy Space Center. KSC has important advantages, for example its existing facilities, its position on the Intercoastal Waterway, and its southern latitude. The southern latitude gives more velocity to the flights taking off from the spaceport. But the spaceport also has disadvantages, for example it cannot launch military missions into polar orbit because the rocket stages would fall on North Carolina, South Carolina, or Cuba. NASA had once seriously thought to build a new spaceport at White Sands Missile Range in New Mexico. But the agency decided in April 1972 to use KSC for Space Shuttle flights. The Space Shuttle could not land automatically or using remote control. So, the STS-1 flight took off on April 12, 1981 with two people. In 1976, the VAB's south parking area was the site of Third Century America, a science and technology display for the U.S. Bicentennial. At the time, the U.S. flag was painted on the south side of the VAB. During the late 1970s, the Launch Complex 39 was changed to support the Space Shuttle. Two Orbiter Processing Facilities (OPFs) were built near the VAB to store the spacecraft. Another OPF was added in the 1980s. The long Shuttle Landing Facility (SLF) was used to land the Space Shuttle at the end of its journey. The first Space Shuttle to land on SLF was Challenger on February 11, 1984. At the time, the Edwards Air Force Base in California was the main landing site for Space Shuttles. The SLF also had a return to launch site (RTLS) option. If a Space Shuttle launch was failed, the spacecraft could turn around to land on the SLF. But the option was never used. The SLF had one of the longest runways in the world.Shuttle Landing Facility (SLF) . Science.ksc.nasa.gov. Retrieved on May 5, 2012. ===Constellation program=== NASA had planned to take off Ares I and Ares V rockets from Kennedy Space Center under the Constellation program. Ares I-X was a prototype (model) of Ares I. It took off on October 28, 2009 from Launch Complex 39B. It was the first rocket launch from KSC without people since Skylab in 1973. The Obama administration canceled the Constellation program in 2010. ==Active programs== ===Artemis program=== NASA's Space Launch System (SLS) rocket takes off from Kennedy Space Center Launch Complex 39B under the agency's Artemis program. The first time the rocket took off was on November 16, 2022 under Artemis 1. ===Commercial Crew Program=== Kennedy Space Center prepares astronauts and sends them into space under the Commercial Crew Program. As of 2024, SpaceX's Crew Dragon carries astronauts to the International Space Station. The Falcon 9 rocket takes off with Crew Dragon from Kennedy Space Center Launch Complex 39A. === Space station processing === The design of the International Space Station (ISS) modules began in the early 1990s. KSC began to work with other NASA facilities and international partners to be ready for processing before sending the modules to space. In the past, KSC had processed 22 Spacelabs in the Operations and Checkout Building (O&C;). That experiences were put into the design of the Space Station Processing Facility (SSPF). KSC started building the facility in 1991. The Space Station Directorate started in 1996. KSC continues processing ISS payloads from different parts of the world before sending them into space. NASA has proposed to build and process the Lunar Gateway space station at SSPF. ==Facilities== === Launch Complex 39 === Launch Complex 39 (LC-39) was originally made for the Saturn V rocket and the Apollo program. Since the end of the Apollo program in 1972, LC-39 has been used for Skylab (1973), the Apollo–Soyuz Test Project (1975) and the Space Shuttle (1981–2011). The launch pads 39A, 39B and 39C are parts of LC-39. , pad 39A is used for SpaceX's Falcon 9 and Falcon Heavy rockets. Pad 39B is used for NASA's Space Launch System (SLS) rocket. Pad 39C was added in 2015 for small rockets, although it is not active. The Launch Control Center (LCC) is a building at Launch Complex 39. It controls the rocket launches from launch pad 39B. === Launch and Landing Facility === The Launch and Landing Facility (LLF), once known as the Shuttle Landing Facility (SLF) is an airport of KSC. It was used for landing of the Space Shuttle until 2011. It is also used for take offs and landings for NASA airplanes, for example the Shuttle Carrier Aircraft and some civilian airplanes. === Factories === Several factory buildings are on-site at KSC, for the manufacture and processing of space station components. They include the Space Station Processing Facility (SSPF), and the Neil Armstrong Operations and Checkout Building (O&C;). === Visitor Complex === The Visitor Complex is the visitor center of KSC. It has exhibits and displays, historic spacecraft and memorabilia, movies, and a bus tour of the KSC. , about 1,700,000 people visited the center. == Total launches == == Related pages == *Baikonur Cosmodrome *Cape Canaveral Space Force Station *List of tallest structures in the world *NASA == References == === Sources === * . * Middleton, Sallie. \"Space Rush: Local Impact of Federal Aerospace Programs on Brevard and Surrounding Counties,\" Florida Historical Quarterly, Fall 2008, Vol. 87 Issue 2, pp. 258–289. * * ==Other websites== * * KSC Visitor Complex Website * Streaming audio of KSC radio communications * Astronauts Memorial Foundation Website * \"America's Space Program: Exploring a New Frontier\", a National Park Service Teaching with Historic Places lesson plan * \"Aviation: From Sand Dunes to Sonic Booms\", a National Park Service Discover Our Shared Heritage travel itinerary * A Field Guide to American Spacecraft * Documentary of the U.S. Space Program in Florida Category:NASA Category:Spaceports Category:Buildings and structures in Florida Category:John F. Kennedy",
 "title": "Kennedy Space Center"
}