{
 "id": "926545",
 "text": "Imperial presidency is a term applied to the modern Presidency of the United States. The term means the accumulation of powers and self-imposed rule by the President within a constitutionally established government. It was first used in the 1960s, and the American historian Arthur Schlesinger Jr popularized the term \"imperial presidency\" during the Nixon presidency in his 1973 book The Imperial Presidency, to address three concerns: that the President has become too powerful, uncontrollable and that he has exceeded his constitutional limits. According to American professor of political science Thomas E. Cronin, author of The State of the Presidency, the imperial presidency is a term used to define a danger to the American constitutional system by allowing presidents to create and abuse presidential powers during national emergencies and crisis. This was based on: (1) presidential war powers vaguely defined in the United States Constitution, and (2) secrecy – a system used that shielded the Presidency from the usual checks and balances by the legislative (United States Congress) and judicial (Supreme Court of the United States) branches. Issuing many Executive orders, in order to bypass the Congress, if it does not make laws that the President wants, is a common feature of an imperial presidency. Most would consider the United States government to be democratically controlled, but it is the Constitution of the United States's 3 branches (Executive, Judiciary, and Legislative) that create and impose the of constitutionally upheld rule of law. The United States is considered a democracy because of its constitution, which is a living document and changeable according to the interest of a democratically elected Congress. While only the Congress and the Administrative branches (President, Governor, Mayor, etc.) are democratically elected by its legal voting citizens, the inclusion of all its people such as women, slaves, indentured servants, and men who didn't own land was only made possible 121 years after the Constitution came into force in 1789. This excludes The Voting Rights Act of 1965. ==References== Category:Politics of the United States",
 "title": "Imperial presidency"
}