{
 "id": "926539",
 "text": "Marcelo Hugo Tinelli (born April 1, 1960, San Carlos de Bolívar) is an Argentine television presenter, businessman, actor, radio host, sports journalist, sports director, philanthropist and television producer. He was the 20th president of Club Atlético San Lorenzo de Almagro from December 18, 2019 until his resignation on April 30, 2022. During his television career, Tinelli has been the host and producer of humor and entertainment programs such as Rhythm of the night and Showmatch (ex Videomatch). Likewise, he began his career on the radio at a very young age, being a cadet in a sports program at the time. In addition, he is also one of the main audiovisual producers on various television channels in his country, among them, El Trece, which, first with the products of his former production company, Ideas del Sur, of which he was its founder and currently it is with LaFlia Contents, its new production company. ==Personal life== Marcelo is the only child of the marriage that was formed by María Esther Domeño (teacher, died in 1994) and Dino Tinelli (sports journalist, died in 1971); furthermore, he is the cousin of the musician Luciano \"Tirri\" Giugno; and grandson of José Domeño, who owned two newspapers. In 1986, Tinelli married his first wife, Soledad Aquino, who comes from one of the most traditional families in San Isidro. They both met on Badía y Compañía, a program by the well-remembered announcer and host Juan Alberto Badía, when he was doing the sports notes and she was working for the production, with the audience in what, at that time, was the main studio of the channel El Thirteen. With her he had two older daughters: Micaela (1988) and Candelaria (1990). In 1993 the couple separated. In 1997 he married for the second time with the dancer and actress Paula Robles, whom he met during the recordings of the program he hosted, Rhythm of the night, where she was one of the members of the dance group called \"Las Tinelli\". The couple had their children Francisco (1998) and Juana (2002). After 12 years, the couple divorced in 2009. Some time later, in 2012, Marcelo currently met his current partner, the model and actress Guillermina Valdés, with whom they had Lorenzo, his fifth child. ==Companies== He is the creator and president of production companies that generate unitary series, soap operas, and programs of general interest for television in his country and international television. * Ideas del Sur (1996—2017) * LaFlia Contents (2018—present) ==References== ==Other websites== * Tinelli's TV history (archive) Category:Spanish journalists Category:Argentine television presenters Category:Television producers",
 "title": "Marcelo Tinelli"
}