{
 "id": "926523",
 "text": "Kehkashan Basu (Meritorious Service Medal (Canada)) (born June 5, 2000) is an Emirati environmental and human rights activist. She also works for peace, children’s rights, education for sustainable development, nuclear disarmament, gender equality and climate justice. She is the Founder-President of Green Hope Foundation. It is the youngest Councillor of World Future Council. It is the youngest Trustee of the Parliament of the World's Religions. She is a KidsRights Youngsters member and winner of the International Children's Peace Prize 2016. == Life == ===Early life=== Kehkashan was born on June 5. At the age of 8, she started planting trees and organising young people for recycling programs. At the age of 11, she spoke at the TUNZA Children and Youth Conference in Indonesia. At the age of 12, she set a record as the youngest delegate to speak at a press conference at the United Nations Conference on Sustainable Development (Rio+20). ===Education=== Basu attended the Deira International School in Dubai. She moved to Canada to study further. As of December 2020, it was a third-year for her at the University of Toronto. She is studying in environmental studies and minoring in gender studies and physical and environmental geography. ===Career=== She founded the Green Hope Foundation in 2012. Her goal is teaching and regulating the UN's Sustainable Development Goals (SDGs). It includes grassroots action such as tree plantations. The organization also involves young people globally in the SDGs. It is through the community-focused projects in climate justice. It is associated with land degradation, sustainable consumption and renewable energy, and biodiversity conservation, as well as gender equality and social justice. As of now, it has more than 3000 members in total. Members are from across Canada, Suriname, United Arab Emirates, Oman, Qatar, Bahrain, United States, Indonesia, Malaysia, Cambodia, Australia, Kenya, The Bahamas, Chile, Vietnam, Seychelles, Sweden, The Netherlands, Democratic Republic of the Congo, Peru, Sri Lanka, India, Nepal, Bangladesh, Kiribati and Liberia. The organization works by conducting workshops and conferences around the regulation of the SDGs. In 2017, she published the short story book \"The Tree of Hope\". It was in association with the illustrator Karen Webb-Meek. In the book, a young girl creates an oasis in a desert. She does so by planting trees and requesting friends to help her. In 2021, Basu was a keynote speaker at the first annual Peace Education Day Conference, held online. == Awards and Honours == * Basu won the International Children's Peace Prize in 2016. * Basu was recognised as a UN Human Rights Champion in 2016. *Basu was named as one of Canada's Top 25 Women of Influence in 2018. * Basu was listed as a National Geographic Young Explorer in spring 2020. *Basu was named as a Forbes 30 Under 30 in 2021 – the youngest in the category of Education. *Basu won the World Literacy Award for Significant Contribution to Literacy by a Youth in 2021. *Basu was awarded the Meritorious Service Medal of Canada (Civil Division) in 2022. == References == == Other websites == * * Category:Living people Category:2000 births Category:Environmentalists Category:University of Toronto alumni Category:Human rights activists",
 "title": "Kehkashan Basu"
}