{
 "id": "926640",
 "text": "Alexandre François Marie, Viscount of Beauharnais (28 May 1760 — 23 July 1794) was a French politician and general during the French Revolution. He was the first husband of Joséphine de Beauharnais, who later became Empress of the French through her marriage to Napoleon. == Early Life == Beauharnais was born in Fort-Royal (now Fort-de-France), Martinique. He was the son of a governor, François de Beauharnais, Marquess de la La Ferté-Beauharnais, and his wife Marie Anne Henriette Françoise Pyvart de Chastullé. Beauharnais’ parents decided that it would be a good idea to arrange him to marry someone. And so he did on On 13 December 1779, in Paris to the 16 year old Joséphine Tascher de la Pagerie. There marriage was not happy as Beauharnais said he was only marrying because his father forced him to do so. They had 2 children together, Eugène and Hortense. == Career == Beauharnais fought in Louis XVI’s army during the American Revolutionary War. He represented the French nobility in the Estates-General and was president of the National Constituent Assembly from June 19, 1791 to July 3, 1791 and again from 31 July to 14 August 1791. He was then made a general in 1792, during the French Revolutionary Wars. In 1793, he refused to become Minister of War. Later the same year, he was named General-in-Chief of the Army of the Rhine. == Death == On 2 March 1794, the Committee of General Safety ordered his arrest, accusing him of poorly defending Mainz during the siege of 1793, and because he was a part of the nobility. He was jailed at Carmes Prison and was sentenced to death during the Reign of Terror. His wife, Joséphine was arrested in the same prison on 21 April 1794. Joséphine survived, but Beauharnais was guillotined, together with his cousin Augustin, on the Place de la Révolution, only a week before the trial and execution of Maximilien Robespierre. Category:1760 births Category:1794 deaths Category:French politicians",
 "title": "Alexandre de Beauharnais"
}