{
 "id": "926662",
 "text": "Aleta Baun is an Indonesian environmental activist. She is known as the \"Indonesian Avatar\". She won the 2013 Goldman Environmental Prize. It was for organizing hundreds of local villagers to peacefully live in the marble mining sites in “weaving protests”. It stopped destruction of sacred forest lands on Mutis Mountain on the island of Timor. She is a leader of indigenous Mollo people. She was born to a family of farmers. She lost her mother at a young age. She was raised by other women and elders in the village. She was taught to respect the environment as a source of the spiritual identity and livelihood. As a community leader, she shares the traditional knowledge with others. She was also known as “Mama Aleta.” Mama Aleta's work made her a target for the mining interests and local authorities. She survived from an attempt to be killed. Once Mama Aleta even went into hiding in a forest with her baby. Mama Aleta grew the movement to include hundreds of villagers. It is associated with a weaving occupation. 150 women spent a year sitting on the marble rocks at the mining site. They quietly wove their traditional clothes in protest. Women were traditionally responsible for getting food, dye and medicine from the mountains. Mining in these mountains would have directly impacted their livelihoods. While the women protested at the mine, the men provided domestic support at home, cooking, cleaning and caring for the children. Among the villagers’ peaceful presence, marble mining became increasingly undeniable for the companies involved. Public awareness of the weaving occupation was growing. Indonesian government officials took notice. By 2010, the mining companies started reacting to the pressure. They started mining at all four sites within the Mollo territories. They stopped their operations. Mama Aleta now helps communities across West Timor to map their traditional forests. She works in water security and indigenous peoples' natural resource management and land rights. == References == Category:Living people Category:Environmentalists Category:Indonesian activists Category:Goldman Environmental Prize awardees Category:1965 births",
 "title": "Aleta Baun"
}