{
 "id": "926668",
 "text": "Niloufar Bayani (born 1986; ) is an Iranian wildlife conservationist, researcher and activist. She was sentenced in 2019 of spying by Iranian authorities in a secret trial in Iran. She received a 10-year prison sentence. == Early life and educational career == Niloufar Bayani was born in 1986 in Tehran, Iran. Bayani completed her graduation in 2009 from McGill University in Canada. Her degree was in BSc in Biology. She got an MA degree in Conservation Biology from Columbia University. After graduation, Bayani worked as a consultant and project adviser to United Nations Environment Programme (UNEP) between 2012 and 2017. In the summer of 2017, she joined the Persian Wildlife Heritage Foundation (PWHF). It was an Iranian environmental organization. It was co-founded by Kavous Seyed-Emami and other Iranian environmentalists. PWHF is a not-for-profit organization. It is controlled by a board of trustees and an executive board. These members are well talented in conservation techniques and natural resource management. In Iran, she worked on the wildlife projects. It was setting camera traps in 7 places to look after the critically endangered Asiatic cheetah. == Arrest and imprisonment == Bayani was arrested in January 2018 by the Islamic Revolutionary Guard Corps. She was charged of spying. Others arrested and imprisoned from PWHF are Seyed- Emami, Amir Hossein Khaleghi, Abdolreza Kouhpayeh, Hooman Jokar, Morad Tahabaz, Sam Rajabi, Sepideh Kashani and Taher Ghadirian. In 2019, Bayani wrote an open letter to Ayatollah Khamenei. In the letter, she was describing her extremely bad treatment by her investigators. On February 18, 2020, BBC Persia published letters that Bayani wrote from Evin Prison. In the letter, she detailed the tortures she suffered. According to a report from the BBC, she was separated for eight months and her questioners tortured and threatened her with sexual assault. Bayani said that her investigators showed her a photo of Seyed-Emami. The body of Seyed-Emami was found in his prison cell two days after his arrest. The associated officials claimed that Seyed-Emami had committed suicide. She was sentenced in 2020 without a lawyer. It was despite her claims. == International pressure == On March 14, 2019 the European Parliament announced that the Iranian government is violating the human rights, freedom of expression, fair trial, freedom of the press, freedom of thought and freedom of religion. In particular, the document refers to the case of Bayani and the other environmentalists in point 14. They were asking the Iranian authorities to release all the individuals. These individuals were unfairly tortured in their prisons for false charges of crimes. The United Nation's Human Rights Council, on January 28, 2020, published a Report on the conditions of human rights in Iran. It expresses the concern of the Special Rapporteur. It was regarding the conditions of respect of the fundamental human rights. It relates to the case of the eight unlucky environmentalists, including Bayani. She is accused of \"collaborating with the United States enemy state\". She also been charged to refund the income received as a consultant and project adviser to United Nations Environment Programme (UNEP) between 2012 and 2017. The Rapporteur invited the Iranian authorities to ensure the respect of the work. It was followed by the scientific community for the benefits of the Iranian country. Scholars at Risk (SAR) is an international network of institutions and individuals. It promotes academic freedom and protect scholars from academic freedom threats. SAR has been actively supporting Bayani. They were sending letters to public authorities in Iran. They were running many meetings in universities. They were organising many online activities through social networks. == Iranian reactions == Following Bayani's exposition of the sexual and psychological harassment of the investigators, the Tehran Prosecutor's Office rejected the charges. The Office was claiming that all the questioning procedures had been videotaped. They further said that the videos were linked with the issue to accusations and planned actions just before the election. It claimed that the judiciary was sensitive to the honour of defendants, convicts and prisoners. The exposition of the behavior of the intelligence investigators to Bayani was widely reported on social media. In a statement on Twitter, the Iranian reformist political activist Mostafa Tajzadeh called for the truth in Bayani's case. He was also asking for the punishment of the violators. == References == == Other websites == * Scholars at Risk - Niloufar Bayani Category:Living people Category:Prisoners Category:Iranian environmentalists Category:1986 births Category:Iranian academics Category:Columbia University alumni",
 "title": "Niloufar Bayani"
}