{
 "id": "926703",
 "text": "Anglophone nationalism in Cameroon is a nationalist movement in the Northwest and Southwest regions of Cameroon. It wants greater autonomy for those regions, if not outright independence. It tries to preserve and promote English-speaking Cameroon's distinctive identity and values. Its legal, administrative, educational and cultural institutions were left by British colonialism. == Rise of Anglophone nationalism in Cameroon == On 1 September 1961, the Franco-Cameroonian parliament voted in favour of the new constitution. It was essentially the version for the Foumban conference, drafted beforehand by Ahidjo and his French advisers. To be binding under international law, it should also have been voted on by the parliament of the Southern Cameroons. This did not happen. The absence of intergovernmental agreement and compromise is cited by pro-independence representatives of Ambazonia as a key feature of the illegality of the union. Another concern mentioned is that the federal constitution gives the impression that former French Cameroon has taken over Southern Cameroons. The French president at the time, Georges Pompidou, referred to Southern Cameroons as a small gift from the Queen of England to France. Contrary to the United Nations General Assembly's binding resolution 1514 (XV) of December 14, 1960, on the granting of independence to all colonial peoples and countries, Britain transferred Southern Cameroons to the sovereignty of a foreign country, French Cameroon, and not to the government of Southern Cameroons, as required by international law. On September 30 1961, the British administrators left the Southern Cameroons. The next day, the French-Cameroonian army crossed the border. They disarmed the armed police in Southern Cameroons. It is described as a seizure of power by force. A Franco-Cameroonian official was appointed to the position of Governor General of Southern Cameroons. His official title was Federal Inspector of Administration. He reported directly to the President of French Cameroon. A series of other Franco-Cameroonian officials followed, including later his police force, which literally took over Southern Cameroons. In a memorandum dated March 20, 1985, the Anglophone lawyer and president of the Cameroonian Bar Association, Fongum Gorji Dinka, wrote that Biya's government was unconstitutional. He said that the former Southern Cameroons should become independent as the Republic of Ambazonia. Dinka was imprisoned the following January without trial and thus became a \"martyr\" to the separatist cause. . The name Ambazonia was used in 1984 by Fongum Gorji Dinka, when the parliament and government of the Republic of Cameroon changed the name of the country from the \"United Republic of Cameroon\" to the \"Republic of Cameroon\", based on the name of the pre-reunification French-speaking Cameroon, the \"République du Cameroun\". For some, including Gorji-Dinka, Bernard Fonlon and Carlson Anyangwe this meant the dissolution of the personal union of 1961. Ambazonia was declared by the people of Southern Cameroon to restore the statehood of the former British territory of Southern Cameroon. Ambazonia saw it as an opportunity to engage the two states in a \"constitutional review\" of their relations. The Gorji-Dinka group believed that \"by operation of law\" there should be equal participation of the two states. In the document, called the \"New Social Order\", Ambazonia's proposal for the Confederation of Independent Cameroon-Ambazonia Nations was rejected by the Republic of Cameroon. Instead, the leader of the Ambazonia Restoration Council, Gorji-Dinka, was arrested and tried for treason for demanding the continued sovereignty of \"Southern Cameroonians\" in the Republic of Ambazonia. In 1992, Gorji Dinka, on behalf of the State of the Republic of Ambazonia, filed a lawsuit against the Republic of Cameroon and President Paul Biya on the main charge of illegal and forced occupation of the Republic of Cameroon. This trial was registered in the High Court of Bamenda, in the northwestern region of Cameroon, under number HCB28/92. There are conflicting reports on the outcome of this case. In 1994, John Ngu Foncha and Salomon Tandeng Muna, both former prime ministers of Western Cameroon, returned to the United Nations in New York and called for autonomy for English-speaking Cameroon. The mission to the UN was before the All Anglophone Conference held in Buea, which brought together all the citizens of Anglophone Cameroon. They all called for the restoration of statehood to Western Cameroon. . A second Anglophone conference was held in Bamenda, where the decisions of the first conference were repeated. French Cameroon was given \"reasonable time\" to accept a return to the federation of the two states. If that failed the people of English-speaking Cameroon would have no choice but to restore their statehood and independence. The brutal arrests and imprisonment of AAC leaders and the flight into exile of several others stopped this from happening. In 2005, the Republic of Ambazonia became a member of the Unrepresented Nations and Peoples Organization. This was renewed in 2018. In 2005 the UN Court of Human Rights ruled in favor of compensating Fon Gorji-Dinka for the human rights violations committed against him and for the assurances he received regarding the enjoyment of his civil and political rights. On August 31, 2006, the Southern Cameroons Peoples Organisation formally proclaimed the independence of the Republic of Ambazonia, which includes the disputed territory of Bakassi. == Related pages == * Anglophone Crisis * Ambazonia Category:Politics of Cameroon Category:Ambazonia",
 "title": "Anglophone nationalism in Cameroon"
}