{
 "id": "926891",
 "text": "Kathryn Linn Cottingham is an ecologist, evolutionist, environmentalist and social scientist. She is a Professor of Ecology, Evolution, Environment and Society in the John Sloan Dickey Center for International Understanding at Dartmouth College. She is a Fellow of the Ecological Society of America and American Association for the Advancement of Science. From 2020, she serves as editor-in-chief of the journal Ecology. == Education == Cottingham got her bachelor's degree at Drew University in 1990. Here, she studied mathematics and biology. === Sports === She played lacrosse and field hockey. Cottingham played Lacrosse in the National Collegiate Athletic Association Division III Tournament during her first season. She was on the team that won the 1988 Middle Atlantic Conference championship. She was the only NCAA Division III athlete to earn one of the Disney Scholar-Athlete Awards. === University of Wisconsin–Madison === She went to the University of Wisconsin–Madison for her graduation. She got her master's and doctoral degrees at there. Her supervisor was Steve Carpenter. She was supported by a National Collegiate Athletic Association postgraduate fellowship. Her PhD research in the Center for Limnology evaluated the effects of nutrients and the food web structure on freshwater plankton. She was one of the first groups of the postdoctoral researchers at the National Center for Ecological Analysis and Synthesis. Here, she made early warning indicators. She also made many ways to study community activities. == Research and career == Cottingham studies the activities of lake plankton communities and relationships between terrestrial and aquatic ecosystems. She joined the teaching staffs at Dartmouth College in 1998. She has studied the reasons that cyanobacteria bloom occur. She also studied about the results of the algal blooming in low nutrient clear-water lakes. She has studied many ways to manage the growth of these blooms and control the negative effects of them on ecosystems. Cottingham showed that cyanobacterial blooms create their own favourable environments. It is driving nitrogen and phosphorus cycling. Else, the results are low nutrient lakes. She has started work with computer scientists to use big information and artificial intelligence. It is to know about the cyanobacteria across the East Coast. The information will be collected using robotic boats, buoys and drones along with cameras. === Environmental health === Cottingham also works on environmental health. She worked about the occurrence of arsenic in food and drinking water. Her 2012 research on pregnant women's rice consumption and arsenic exposure was selected by the National Institute of Environmental Health Sciences (NIEHS) as one of the most important papers of the year. According to her studies, women who ate rice had considerably higher urinary arsenic concentrations than those who did not eat rice. She went on to show that white wine, beer, Brussels sprouts and salmon increased arsenic levels in humans. === Academic services === From 2017 to 2019 Cottingham was a National Science Foundation Program Director in the Division of Environmental Biology. She returned to Dartmouth College in 2019. Cottingham is involved with several public engagement projects. It includes acting as Vice Chair of the Science Advisory Boards of the Lake Sunapee Protective Association and Jefferson Project at Lake George. == Awards and Honours == * 2015 Elected Fellow of the Ecological Society of America * 2019 Elected Fellow of the American Association for the Advancement of Science == Selected publications == * * * Cottingham is the Editor-in-Chief of Ecology. == References == Category:Living people Category:Year of birth missing (living people) Category:American ecologists Category:American environmentalists Category:American biologists Category:Drew University alumni Category:Dartmouth College faculty Category:University of Wisconsin–Madison alumni Category:American editors",
 "title": "Kathryn L. Cottingham"
}