{
 "id": "926840",
 "text": "Ana Čolović Lešoska (born c.1979) is a Macedonian biologist. Since 2011, she has campaigned against the construction of dams for hydroelectric power production in the Mavrovo National Park. It was in order to protect the threatened species, including the Balkan lynx. This led to the removal of loans from the World Bank and the European Bank for Reconstruction and Development (EBRD). It was convincing the Government of North Macedonia to hold on the further works on dams in the national park. For her works, in April 2019, she was awarded the Goldman Environmental Prize. ==Activities== Colovic Lesoska heard about plans to create hydroelectric power facilities in Mavrovo in 2010. They included the 33m-high Boškov Most dam and the 70m-high Lukovo Pole dam. She was an executive director of Eko-svest. It was a Macedonian environmental research centre. It was in collaboration with other NGOs and activists. She launched the \"Save Mavrovo\" campaign. In November 2011, she complained about the ERBD. She explained that they had approved a loan for the Boškov Most project without conducting the required biodiversity assessment. She encouraged the ambassadors of countries with representatives on the EBRD board. She encouraged them to push for an end to the funding. A petition she launched was urging the government. They were urging the ERBD and the World Bank to bring the projects to a close. It was supported by almost 100,000 signatures. In 2013, she complained to the Berne Convention on the Conservation of European Wildlife and Natural Habitats. She explained that the Boškov Most hydropower project \"could have a decisive negative impact on the lynx\". In December 2015, the Berne Convention ordered the ERBD and the World Bank to hold on the financing as the project could have \"a decisive negative impact on the lynx\". The World Bank immediately remove funding. During the following month of May, a court decided to stop the environmental permit for the Boškov Most project. In January 2017, the EBRD cancelled financing. For her achievements, in April 2019 Ana Colovic Lesoska was given the Goldman Environmental Prize. It was the first time the prize had been awarded to a North Macedonian. == References == == Other websites == *Ana Colovic-Lesoska's profile on LinkedIn Category:1979 births Category:Living people Category:People from Skopje Category:Environmentalists Category:Biologists Category:Goldman Environmental Prize awardees",
 "title": "Ana Colovic Lesoska"
}