{
 "id": "926955",
 "text": "Nina Gualinga (born June 1993) is an Ecuadorian environmental and indigenous rights activist. She is part of the Kichwa-speaking community. She has spent most of her life working for better environmental protection of the Ecuadorian Amazon and the living wildlife. She also worked for the people who are depending on this environment. == Early life and career == Gualinga was born and raised in her mother's Kichwa-speaking community of Sarayaku in the Ecuadorian Amazon. in a wooden house in Puyo, Pastaza. Since the age of seven, she has worked for climate justice and indigenous rights. She got her knowledge of the forest from her parents and grandparents. She is a granddaughter of Cristina Gualinga. Gualinga’s sister, Helena Gualinga, and mother, Noemí Gualinga are also environmental activists. Her aunt Patricia is also a land defender. Her uncle Eriberto is a movie maker. He documents the Sarayaku resistance. She is currently studying human rights at Lund University. == Activism == Her family was active in the Kichwa Sarayaku community's fight against the exploitation of the Amazon rainforest. The forest was exploited by companies and the Ecuadorian government. Gualinga's works for indigenous and territorial rights started when an oil company with the help of Ecuadorian government military troops violently started exploiting her community's indigenous land. This intrusion led to a legal battle between the Ecuadorian government and Sarayaku community before the Inter-American Court of Human Rights, which eventually resulted to a victory for the Sarayaku community. At the age of 18, Gualinga represented the youth of Sarayaku at the final hearing of the case. Gualinga had an indigenous fellowship at Amazon Watch. She developed the proposal for her own non-governmental organization. She aimed at empowering indigenous Sarayaku’s youth and women. She wanted protect the Southern Ecuadorian Amazon. Her organization, Hakhu Amazon Design, sells handmade artisanal jewelry and accessories. She demands that the Ecuadorian government acknowledge the Amazon forest itself as a property. She also demands the government to end its contracts with major oil and mining companies. She is also active as an indigenous rights activist on an international level. She focused on protecting homes and land against corporate interests. She was part of a global call to stop fossil fuel extraction at the 2014 People’s Climate March. She was also among the delegates working for \"Living Forests\" protection. It was at the global climate conferences COP20 and COP21, in Lima and Paris respectively. In the course of COP21, she drew attention to her people’s demands by sailing down the river Seine in Paris in a canoe from her village. In 2016, she was among a group of indigenous women from 7 nationalities. They united to march in defense of indigenous rights and territories. Gualinga drew more attention on the effects of climate change on the Kichwa people at the COP22 in Marrakech. She encouraged the government to prioritize climate actions to reduce carbon emissions for the indigenous people. She was part of the Women’s Earth and Climate Action Network (WECAN), Amazon Watch and Sarayaku Delegation to COP23 in Bonn and a speaker at the event. Nina was also part of the WECAN delegation at the COP25 climate discussion in Madrid in 2019. At the event, she called for the world to stop extracting fossil fuel. She also called to listen to indigenous peoples. These people have protected their lands for millennia, for solutions to the climate crisis: \"If we don’t listen to indigenous peoples, if we don’t listen to indigenous women we are not going to get out of this crisis.\" She gave a lecture on Indigenous People of the Amazon: The Guardians of Our Future at IAAC Auditorium, Barcelona on 25th of February 2020. == Awards == * 2018 WWF International President’s Youth award == References == == Other website == * *Ecuador: One year after decisive ruling, Sarayaku struggle goes on Category:Ecuadorian environmentalists Category:1993 births Category:Living people Category:Lund University alumni",
 "title": "Nina Gualinga"
}