{
 "id": "926921",
 "text": "Mery Beatriz Antonieta Godigna Collett (b. April 8, 1959 in Caracas, Venezuela) is a Venezuelan artist, writer, humanitarian and environmental advocate. She lives in Austin, Texas. == Early life == The Godigna Collet family from Venezuela to Europe when she was 3 years old. She spent her childhood and adolescence in Spain, France and Italy. Godigna Collet returned to Caracas to study art, design and architecture. She got a bachelor's degree in architecture in 1987 from Universidad Central de Venezuela. In the early 1970s, she had returned to live in Madrid, Spain. She attended the Real Academia de Bellas Artes de San Fernando as an unregistered student. This was because of her young age. While there, she learned that art could be used to communicate and promote causes. == Life as an Artist == Since the start of her career, Godigna Collet tried to find a balance between people and environment. She found it through social and political issues. Her art work uses many different types of materials. This is seen in her paintings, sculptures, photography and video. Her work challenged the viewers through the use of new techniques and lesser known materials. She is also a minimalistic conceptualist. Her use of materials and techniques shows that concepts translate through matter. === Environmental works === Her work is based in promoting a conscious use of natural resources and technology. Since 2007, for her exhibitions, she used to discuss with her panels. It was usually just before the show. It brings together the community and experts in diverse fields as well as workshops. It promotes ecological awareness. During interviews on radio, television or magazines, she makes a call for reflection over environmental issues. In the year 2012, her work was selected to be displayed. It was selected to be the image of a meeting about issues of dependence on oil as an energy source and on the human rights consequences of that reliance. The meeting was held at the University of Texas at Austin. It was organized by the Center for Global Energy, International Arbitration, and Environmental Law and the Bernard and Audre Rapoport Center for Human Rights and Justice. In the year 2016, her artwork \"Let's Talk Volume\" was selected by the City of Austin, Texas. It was through the program of Art in Public Places. It was installed for the occasion of celebrating International Environment Day. == Life as a humanitarian == Collet uses her art and its visual power to provoke thought. She supports several causes related to human rights. From Venezuela, Miami, Italy and Texas, she had shown her work to raise funds to promote support for women and children victims of violence, residencies for artists in need, victims of AIDS and indigenous populations. In 2007, she traveled through the Venezuelan Amazon. She was collecting several legends from indigenous cultural lore. These are usually told to the next generation. Ensuring their documentation and preservation, she has held exhibitions about the subject in Venezuela, Italy, France and the United States. She has preserved them at the archives of the Nettie Lee Benson Latin American Collection at the University of Texas at Austin. She gives free lectures about the subject. == Life as a Writer == Mery Godigna Collet has published in limited edition. She has published in Spanish two books; \"Nightly Exercises Notebook\" (1995) and \"Made with Fiber\" (2003). She has also published three art research studies, \"Matter, Time, and Space\" (1997), \"Metallic Light\" (2006), \"Extra Virgin Petrus Oil\", 2008. She was connected with Le Club monthly magazine in Caracas, Venezuela. La Gazette du Jeudi is a weekly publication in Paris, France. She currently contributes to Viceversa magazine in New York. == Career == Mery Godigna Collet has participated in 26 solo and 36 group exhibitions in Venezuela, Colombia, Mexico, Spain, Italy, France, Germany, the Netherlands, Belgium, New York, Miami, New Mexico and Texas. In 1985 and 1986, she was an assistant professor in Design 07 and Taller Ventrillon (hand free drawing) at Universidad Central. In 1990, she founded the Utilitarian Art Firm Neo-Arkhos. She served as Director until 1994 promoting contemporary designers. From 2007 to 2009, she served as Director for Fundaya Foundation a nonprofit organization. Its goal was to help indigenous populations in Venezuela. 2014 is part of the Board of International Woman's Foundation based in Marfa, Texas. It provides homes for artists and promotes their work. In 2014, she co-founded the \"Crosswalk Project\" to improve pedestrian and handicap safety for the urban environment. She has given several art lectures and workshops in Venezuela, Texas and Italy. She is a member of the Accademia di Arte di la Citta di Ferrara, Italy and of Mexic-Arte Museum in Austin Texas. == Solo exhibitions == * 1995 Dimelo Tu. Galeria El Muro, Caracas, Venezuela * 1996 Blue. Galeria El Muro, Caracas, Venezuela * 1997 Retratos. Galeria Ars Forum, Caracas, Venezuela * 1998 De Suenos, Ilusiones, Laberintos y Temores, Galeria Ars Forum, Caracas, Venezuela * 2000 Penelope's Tapestries. Venezuelan Consulate in N.Y., N.Y. * 2000 Penelope's Tapestries. Eastern National Bank, Miami, Florida * 2001 Aqua. 1221 Brickell Ave. Miami, FL * 2002 Windows. Galeria Punto de Arte, Caracas, Venezuela * 2002 Windows. Museo del Discurso de Angostura, Ciudad Bolivar, Venezuela * 2003 En Tono de Fibra. Sala de Arte Sidor (Siderurgica del Orinoco) Puerto Ordaz, Venezuela * 2007 Mares Metalicos. Monumento Historico La Rocca, Cento, Italy * 2007 Mares Metalicos. Galleria Il Carbone, Ferrara, Italy * 2008 Mares Metalicos. Gallerie Expression Libre, Paris, France * 2011 Extra Virgin Petrus Oil. Petroleum Museum, TX * 2012 Extra Virgin Petrus Oil. Rapoport Center for Human Rights & Energy Center University of Texas, Austin, Texas * 2012 El Dorado. Benson Collection University of Texas, Austin, Texas * 2012 El Dorado. Delizia di Belriguardo, Ferrara, Italy * 2013 Extra Virgin Petrus Oil. Nina Torres Fine Art Miami, FL * 2013 Evpo. Caridi Gallery, Miami, Florida * 2014 Marfa's Phantoms. Historic Landmark & Museum Building 98, Marfa, Texas * 2014 Extra Virgin Petrus Oil. LUHCA, Lubbock, Texas * 2014 Wandering Skin. OBE, Austin, Texas * 2015 No Particular Shape. Ferrara, Italy, presented by Galleria Dil Carbone. Ferrara, Italy * 2015 Evpo. Greasewood Gallery, Marfa, Texas * 2015 Extra Virgin Petrus Oil. Warehouse 1–10, Magdalena, New Mexico * 2016 \"Petro Poems\" ESB-MACC, Austin, Texas == Museum collections == * MexicArte Museum, Austin TX * Museo de Arte Contemporáneo del Zulia, Maracaibo, Venezuela. * Latin American Art Museum, Miami, Florida. * Galleria D'Arte Moderno di Cento, Bologna, Italy * Petroleum Museum, Midland, Texas == References == == Other websites == * https://web.archive.org/web/20160206162804/http://www.godignacollet.com/ *http://www.lib.utexas.edu/benson *http://www.mexic-artemuseum.org/ *http://www.internationalwomansfoundation.org/ *http://marfapublicradio.org/blog/west-texas-talk/artist-mery-godigna-collet- at-building-98/ Category:Living people Category:1959 births Category:Environmentalists Category:Venezuelan artists Category:20th-century artists Category:21st-century artists",
 "title": "Mery Godigna Collet"
}