{
 "id": "926901",
 "text": "Martha Delgado Peralta (born April 26, 1969) is a Mexican environmentalist and civil servant. Since December 1, 2018, she has served as Undersecretary for Multilateral Affairs and Human Rights of the Ministry of Foreign Affairs.Simón Muciño, Hansi Roberto. Trascender y apropiar: el marketing gubernamental del sistema ECOBICI en la Ciudad de México. MS thesis. Benemérita Universidad Autónoma de Puebla, 2016.Política de movilidad sustentable en la CDMX. Hacia un nuevo modelo. (2018). (n.p.): Proyecto M2050. == Education == Martha Delgado has a degree in Pedagogy from the Intercontinental University. She graduated from the Program for Advanced Studies in Sustainable Development and the Environment LEAD from El Colegio de México. She has a certificate in Environmental Policy and International Development from Harvard University. She is currently doing graduation. ==Works== Martha Delgado has carried out uninterrupted work in the environmental sector. It was both in the Federal Public Administration (1991 to 1998). It was directing civil society organizations. It was dedicated to the environment (1998 to 2003) and was an Independent Deputy in the III Legislature of the Assembly Legislative of the Federal District (2003 to 2006). From 1993 to 1998, she served as advisor to the Presidency of the National Institute of Ecology. She was in charge of the process of decentralization of environmental management. Later, she participated in the social management of new decrees of Natural Protected Areas. During her working, an important stage of environmental management at the subnational level was founded. A legal protection of important ecosystems was also founded in Mexico. Some of the orders in which she participated were the Huatulco National Park and the Sierra Gorda Biosphere Reserve. Between 1998 and 2003, she chaired the organizations Presencia Ciudadana Mexicana AC. It is one of the main associations for citizen participation and electoral observation in Mexico. It is the Union of Environmental Groups IAP. It brings together a hundred environmental organizations from all over the country. In Citizen Presence, she organized the deployment of 1,500 electoral observers. It was achieving the most accurate independent quick count in the 2000 Presidential election. She was leading the Union of Environmental Groups. She was able to stop the construction of the largest salt mine in the world in Baja California, in the Laguna de San Ignacio. It was the birthplace of gray whales, a threatened and endangered species. She was an Independent Deputy from 2003 to 2006 in the III Legislature of the Legislative Assembly of the Federal District. It is a position she has under the extinct Mexico Possible party. As an Independent Deputy, she created and chaired the Special Commission for Integrated Water Management. She presided over the Secretariat of the Environment of the Federal District from 2006 to 2012.Simón Muciño, Hansi Roberto. Trascender y apropiar: el marketing gubernamental del sistema ECOBICI en la Ciudad de México. MS thesis. Benemérita Universidad Autónoma de Puebla, 2016.Política de movilidad sustentable en la CDMX. Hacia un nuevo modelo. (2018). (n.p.): Proyecto M2050. == References == Category:1969 births Category:Living people Category:Environmentalists Category:Civil servants",
 "title": "Martha Delgado Peralta"
}