{
 "id": "927289",
 "text": "Dinosaur Train is an American-Canadian-Singaporean Computer animated television series. The show was created by the same creator, Craig Bartlett, who created the Nickelodeon show Hey Arnold!. It aired on PBS Kids from September 7, 2009 until June 15, 2020. ==Main cast== * Phillip Corlett as Buddy Tyrannosaurus (seasons 1-2) * Sean Thomas as Buddy Tyrannosaurus (season 3) * Dayton Wall as Buddy Tyrannosaurus (season 4) * Chance Hurstfield as Buddy Tyrannosaurus (season 5) * Claire Corlett as Tiny Pteranodon, Polly Polycotylus * Ian James Corlett as Mr. Conductor, Adam Adocus, Alan Alamosaurus, Elliott Enantiornithine (in \"Now with Feathers!\"), Morris Stegosaurus, Mr. Argentinosaurus, Mr. Daspletosaurus, Mr. Elasmosaurus, Quentin Qianzhousaurus, Stuart Stygimoloch, Travis Troodon, Triceratops, Troodon Official, Vincent Velociraptor, Teddy Pterodaustro, Frankie Fruitafossor, Troodon Waiter * Erika-Shaye Gair as Shiny Pteranodon, Annie Tyrannosaurus, Cory Corythosaurus * Ellen Kennedy as Mrs. Pteranodon, Mrs. Einiosaurus, Mrs. Elasmosaurus, Grandma Pteranodon * Alexander Matthew Marr as Don Pteranodon (seasons 1-3), Tank Triceratops * Laura Marr as Don Pteranodon (seasons 4-5), Quincy Quetzalcoatlus * Colin Murdock as Mr. Pteranodon, Announcer, Elliott Enantiornithine, Hank Ankylosaurus, Ralph Einiosaurus, Station Master, Stuart Styracosaurus, Ziggy Zhejiangopterus, Carson Carcharodontosaurus, Grandpa Pteranodon, Gary Goniopholis * Carla Tassara as the Influencer (who asks questions about dinosaurs after the episode) * Various Kids who answer the Influencer's questions about dinosaurs ==Broadcast== The show is set on PBS Kids in the US and TVOKids in Canada, On 2012, The International Singaporean Media Athority sold this show to PBS stations, In 2014, The show is also broadcast on Netflix. == Other == The show is also set on DSN in the United States but defunct, On 2019, their show premiered on Disney Channel in Singapore. Category:2009 American television series debuts Category:2000s American animated television series Category:2010s American animated television series Category:2020 American television series endings Category:2020 Canadian television series endings Category:PBS Kids shows",
 "title": "Dinosaur Train"
}