{
 "id": "927310",
 "text": "Rodolfo Hernández Suárez (26 March 1945 - 2 September 2024) was a Colombian politician, businessman and engineer. Hernández was a presidential candidate in the 2022 election. Hernández Suárez was mayor of Bucaramanga from 2016 to 2019. In 2022, he became Senator of Colombia. His political views are seen as right-wing populism. He was compared to former U.S. President Donald Trump for his anti-corruption stance and his background as a businessman. ==Political career== In May 2022, he advanced to the June run-off election against left- wing Senator Gustavo Petro after coming in second place in the first round voting. He was called the \"King of TikTok\" for using the app many times during his presidential campaign. In June 2022, he lost the election to Petro by a 47% to 50% vote margin. After losing the election, Hernández Suárez applied for his party to become a legal party by the National Electoral Council. LIGA became a party on 4 August 2022 and Hernández became the party's president. On 23 June 2022, Hernández Suárez accepted a senate seat offered to the runner-up in a presidential election. However, he said he wished to run for office in Santander in 2023 and said that his senate tenure may last for no more than a few months. He, along with all members of Congress, were sworn in on 20 July. Hernández claimed his time in the senate was like having Lionel Messi as a goalkeeper. However, he resigned from the upper house on 25 October, saying that the position was \"not right\" for him. ==Controversy== In a 2016 interview, Hernández Suárez said that he was \"a follower of a great German thinker, named Adolf Hitler.\" He later apologized and said he meant to say Albert Einstein. ==Personal life== Hernández Suárez was born in Piedecuesta, department of Santander, in 1945, and was raised in nearby Bucaramanga. His father was kidnapped and held for 135 days by the Revolutionary Armed Forces of Colombia (FARC-EP), and Juliana, one of his four children, was kidnapped and possibly killed by a guerrilla group in 2004, after he refused to pay the ransom, saying it would put the rest of his family at a higher risk of kidnapping. Hernández Suárez died of problems caused by liver surgery and colon cancer at a clinic in Piedecuesta, Colombia on 2 September 2024, aged 79.Fallecio Rodolfo Hernández, excandidato presidencial == References == Category:1945 births Category:2024 deaths Category:Mayors Category:Colombian politicians Category:Colombian engineers Category:Colombian businesspeople Category:Civil engineers Category:Santander Department Category:Deaths from colorectal cancer Category:Deaths from surgical complications Category:Deaths from liver cancer",
 "title": "Rodolfo Hernández Suárez"
}