{
 "id": "927342",
 "text": "Dobbs v. Jackson Women's Health Organization is a landmark decision by the US Supreme Court that ruled that abortion in the United States is not a protected right in the country. The Court heard the case in December 2021 and decided that the law, passed by Mississippi in 2018, is constitutional. It made all abortions after the first 15 weeks of pregnancy illegal. ==Leak== On May 2, 2022, Politico published a leaked draft opinion. Someone found Supreme Court Justice Samuel Alito's notes and gave them to Politico. The notes looked like a majority opinion and so they would probably match the final decision. In the draft, Alito decided to overturn Roe v. Wade and Planned Parenthood v. Casey and rejected those earlier Supreme Court cases. Those court cases made abortion legal in the United States. With those decisions gone, each state would decide for itself whether it would make abortion legal or not. ==Decision== On June 24, 2022, the Supreme Court ruled in a 6-3 decision that abortion is not a protected right in the United States. Justices Samuel Alito, Clarence Thomas, Brett Kavanaugh, Neil Gorsuch, and Amy Coney Barrett wrote the majority opinion. Stephen Breyer, Elena Kagan and Sonia Sotomayor wrote the dissenting opinion. Chief Justice John Roberts wrote a concurring opinion, which declared the law constitutional but did not overturn Roe v. Wade, which allowed abortion. ==Reactions== ===After leak=== After the leak, members of the US Senate tried to make a new law to allow abortion in the whole country. The law would stop any states from making abortion illegal, but it did not pass. On May 14, protesters marched and held up signs in more than 380 cities across the United States, and 20,000 people marched in Washington, DC. That was called the \"Bans off Our Bodies\" protests. ===After decision=== US President Joe Biden said, \"It's a sad day for the Court and for the country,\" and that \"the health and life of women in this nation are now at risk.\" In a statement, former President Donald Trump took credit for the decision and called it \"the biggest WIN for LIFE in a generation.” Many world leaders and diplomats are against the decision and support abortion as a human right like UN High Commissioner for Human Rights Michelle Bachelet, Canadian Prime Minister Justin Trudeau, British Prime Minister Boris Johnson, Belgian Prime Minister Alexander De Croo, French President Emmanuel Macron, Danish Prime Minister Mette Frederiksen, New Zealand Prime Minister Jacinda Ardern, and Greek Prime Minister Kyriakos Mitsotakis. Massachusetts Governor Charlie Baker, a Republican, signed an executive order protecting abortion rights in the state. Democrat Governors Jay Inslee, Kate Brown, and Gavin Newsom, respectively of Washington State, Oregon, and California, also announced a creation of the \"West Coast offense,\" a joint policy to allow and protect abortion rights. In Florida, a new law restricts abortions to 15 weeks of pregnancy, down from 24, with no exceptions for rape or incest. ==References== Category:May 2022 events Category:June 2022 events Category:Court cases and laws about abortion Category:United States Supreme Court cases Category:Abortion in the United States",
 "title": "Dobbs v. Jackson Women's Health Organization"
}