{
 "id": "927599",
 "text": "A developmental disability is a disability that starts when someone is very young and limits progress with the developmental milestones that mark different ages of childhood and the transition from childhood to adolescence and then to adulthood. The result is that the person has a mental age that's lower than their chronological age. Some examples of developmental disabilities are: * Autism * Attention deficit hyperactivity disorder * Down syndrome * Cerebral palsy * Dyspraxia * Learning disabilities such as dyslexia, dysgraphia, dyscalculia * Fragile X syndrome * Intellectual disability * Fetal alcohol syndrome Developmental disabilities can make some things harder. Some people can't speak out loud. Some people need extra help learning how to read. Developmental disabilities can be mental or physical or both. Sometimes developmental disability can be diagnosed when someone is young. For example, if a child has trouble walking, they might have a developmental disability. Sometimes developmental disability isn't diagnosed until later. For example, some autistic people are diagnosed as adults. They were still autistic as babies, but it is hard to tell sometimes. == Causes == There are many causes for developmental disabilities. Doctors don't know most of the causes. Many developmental disabilities are genetic. You inherit genes from both of your parents. Sometimes when you inherit genes from your parents, there is a mutation. A mutation is an unexpected change in your genes. Some mutations cause developmental disabilities like Down syndrome and Fragile X syndrome. Some developmental disabilities are caused by outside conditions. For example, fetal alcohol syndrome can be caused by the mother drinking alcohol while pregnant. Sometimes lead poisoning can also cause developmental disabilities. == Associated disabilities == === Physical disabilities === Many people with developmental disabilities also have physical issues or disabilities as well. Some issues are symptoms of the condition. For example, dyspraxia is a disability where someone has trouble with movement and coordination. Other conditions or disabilities are commonly associated with developmental disabilities. For example, people with Down syndrome are more likely to have epilepsy than someone without the condition. === Mental health disabilities (dual diagnoses) === People with developmental disabilities are more likely to develop mental illnesses or other mental health issues than people without developmental disabilities. When someone has both a developmental disability and a mental illness, this is called a dual diagnosis. An estimated 30 to 35% of people with developmental disabilities also have a mental illness There are a couple reasons for that: * Trauma from abuse, bullying, harassment and other incidents * Lack of opportunities for employment, education, recreation, and other fulfilling life activities * Genetic and biological factors People with developmental disabilities are more likely to develop: * Depression * Anxiety * Post Traumatic Stress Disorder == Societal attitudes == === Throughout history === Throughout history, society considered people with developmental disabilities as \"lesser\" and used that justification to treat people with developmental disabilities badly. People with developmental disabilities were considered a \"problem\" or a \"burden\" that needed to be solved. ==== Ancient Era ==== In ancient Europe, people with developmental disabilities were considered lesser. In Greece and Rome, children with developmental disabilities were often left to die. Aristotle wrote, \"as to the exposure and rearing of children, let there be a law that no deformed child shall live.\" In the medical field, Greek scholars like Hippocrates and Galen proposed that the source of disability is a problem in the brain. In the Bible, Jesus was kind to people with disabilities and often performed \"miracle cures\" such as restoring a blind person's sight. In 1 Thessalonians 5:14, Paul wrote: \"comfort the feeble-minded.\" Some Christians saw it as charity to care for people with developmental disabilities. ==== Institutional and Reform Eras ==== The Middle Ages saw the beginning of institutions. Former places for people with leprosy were converted to house people considered deviant, which included people with disabilities. The Catholic Church established orphanages for abandoned infants. In England, \"poor laws\" created places for people to live and work. Conditions in all of these institutions was inhumane and many died. Most societies thought that people with disabilities should be segregated and imprisoned. In the 1800s and 1950s, institutions became common. Some hoped to educate people with developmental disabilities and others were just warehouses to keep people. Regardless of intent, the conditions were often very poor. Jean-Etienne Dominique Esquirol (1782-1840) provided the first classification system for intellectual disability, dividing people into \"idiots\" and \"imbeciles.\" Imbeciles were \"generally well formed, and their organization is nearly normal. They enjoy the use of the intellectual and affective faculties, but in less degree than the perfect man, and they can be developed only to a certain extent.\" Idiots were \"Incapable of attention, idiots cannot control their senses. They hear, but do not understand; they see, but do not regard. Having no ideas, and thinking not, they have nothing to desire; therefore have no need of signs, nor of speech.\" While these classifications seem to be based on intellectual capacity, it is not that simple. Anyone who could not speak would be considered an \"idiot.\" Many people who today would not be diagnosed with an intellectual disability, were considered an \"imbecile\" or \"idiot\" under the terms of the day. Dorothea Dix, an American reformer, petitioned Congress for better care for people with disabilities. She asked for 5 million acres to care for people with disabilities, which Congress gave. Despite her good intentions, this began the era of public institutions. == References == Category:Disability",
 "title": "Developmental disability"
}