{
 "id": "927502",
 "text": "Zlatko Junuzović ( born 26 September 1987) is an Austrian former professional footballer. From 2006 to 2017 he played in the Austrian national team. ==Early life== Junuzović moved with his parents to Austria in 1992. He played for the youth teams of Grazer AK. ==Club career== In 2015, he made his debut for Grazer AK in the Bundesliga. In summer 2007 Junuzović moved to SK Austria Kärnten and 2009 to FK Austria Wien. In 2010, he was awarded by the managers of the league teams Austrian Footballer of the Year and the fans voted him \"Player of the Year\" in the annual award of the newspaper Kronen Zeitung. In January 2012, Junuzović went to Bundesliga club SV Werder Bremen and played till 2018 for the team. In 2015 Junuzović was voted as \"Player of the Season\" by Werder's fans. In April 2018, he left Bremen after six and half years at the club. He joined FC Red Bull Salzburg in the Austrian Bundesliga. He played there until 2022 and then his contract was not extended.Salzburg24.at Junuzovic verlässt Salzburg (German) He ended his career and became assistant coach of FC Liefering.Sladdi bleibt Salzburger redbullsalzburg.at, 10. Juni 2022, abgerufen am 10. Juni 2022 (German) ==Personal life== Junuzović was born in the Serbian town of Loznica to a Bosnian family. ==International career== Junuzović played for Austria at the 2007 FIFA U-20 World Cup. where they reached the fourth place. In March 2006, he made his debut for the Austria national football team in friendly match against Canada. He also played for Austria at the 2016 Euros. In October 2017, Junuzović retired from the national team. ==Honours== ===Club=== Red Bull Salzburg *Austrian Football Bundesliga: 2018, 2019, 2020, 2021, 2022 *Austrian Cup: 2019, 2020, 2021, 2022 ===Individual=== *Austrian Footballer of the Year: 2010 *Werder Bremen Supporters' Player of the Season: 2014–15 ==References== ==Other websites== * * Profile at UEFA.com * Profile and Statistics at Guardian's Stats Centre Category:1987 births Category:Living people Category:Austrian footballers Category:FC Red Bull Salzburg players Category:Association football midfielders Category:Werder Bremen players Category:Players of the Austrian national football team Category:Austrian football champions Category:Austrian football midfielders",
 "title": "Zlatko Junuzović"
}