{
 "id": "928038",
 "text": "General elections took place on 2 October 2022 in Brazil to elect the President, Vice President, and the National Congress. A run-off was held on 30 October. There were more than 146 million registered voters in Brazil when this election took place, making the country the second largest democracy in the Americas and one of the largest in the world.Electorate statistics , Superior Electoral Court . On 5 May 2022, President Jair Bolsonaro ordered an audit on the country's voting machines, five months before the election, with people believing should he lose the election he would not accept defeat. On 2 October 2022, former President Luiz Inácio Lula da Silva advanced to the run- off election on 30 October against President Bolsonaro. Lula won 48.43% of the vote against Bolsonaro's 43.20%. On 30 October, Lula defeated Bolsonaro winning 50.90% of the vote against Bolsonaro's 49.10%. Two days later, Bolsonaro did not say he lost the election however agreed to a transition of power. After Bolsonaro lost, his supporters began blocking several roads and bridges. On 8 January 2023, one week after Lula's inauguration, supporters of Bolsonaro stormed and invaded the Supreme Court of Brazil, the National Congress of Brazil and the Planalto Presidential Palace in the Praça dos Três Poderes plaza in Brasília, the federal capital. ==Voting rules== To vote in Brazil, voters must be citizens over 16 years old and is mandatory for those between 18 and 70 years old. Those who do not vote in an election and do not show a reason why must pay a fine, normally R$3.51Electoral fine , Regional Electoral Court of Rio de Janeiro. (same as US$0.67 as of June 2022).Resolution no. 23.659, of 26 October 2021 , Superior Electoral Court. Articles 127 and 133 . Brazilian citizens living abroad may only vote for president and vice president.Voter abroad , Superior Electoral Court . Portuguese citizens legally living in Brazil for more than three years may also register to vote in Brazilian elections. ==Other elections== Other national elections will be held at the same time as the presidential election. Governors and Vice Governors of Brazil's states and of the Federal District will also be elected at the same time. One-third of the 81 members of the Federal Senate will be elected, the other two-thirds having been elected in 2018. All 513 members of the Chamber of Deputies (Federal Deputies) will be elected. The Chamber elections are held using open list proportional representation.How does the proportional system work? , Superior Electoral Court . ==Main presidential candidates== === Candidates in runoff === Party Party Presidential candidate Presidential candidate Vice presidential candidate Vice presidential candidate Coalition (PT13) Luiz Inácio Lula da Silva Luiz Inácio Lula da Silva (campaign) President of Brazil (2003–2010) Federal Deputy for São Paulo (1987–1991) Geraldo Alckmin (PSB) Governor of São Paulo (2001–2006, 2011–2018) Vice Governor of São Paulo (1995–2001) Brazil of Hope: * FE Brasil (PT, PCdoB, PV) * PSOL REDE (PSOL, REDE) * Brazilian Socialist Party (PSB) * Solidariedade * Avante * Act (AGIR) * Republican Party of the Social Order (PROS) (PL22) Jair Bolsonaro (campaign) President of Brazil (since 2019) Federal Deputy for Rio de Janeiro (1991–2018) Walter Braga Netto Minister of Defence (2021–2022) Chief of Staff of the Presidency (2020–2021) For the Good of Brazil: * Liberal Party (PL) * Republicans * Progressistas (PP) ===Eliminated in first round=== File:Simone Tebet em 15 de julho de 2019 (2; recorte).jpg| File:Ciro Gomes na Carta Capital 2015 (foto 2) (cropped2).jpg| File:Soraya Thronicke em 29 de maio de 2019 (recorte).jpg| File:Luiz-felipe-davila retrato (cropped).jpg| File:Roberto Jefferson.jpg| File:Léo Pericles.jpg| File:Sofia Manzano 2022 (cropped).jpg| File:Vera Lúcia no Dia Internacional da Mulher Trabalhadora 2018 - PSTU (cropped 2).jpg| File:José Maria Eymael no senado.jpg| ===Withdrawn=== File:Abertura do ano judiciário - Supremo Tribunal Federal (STF) (cropped).jpg| File:2020-07-21 João Doria em Entrevista ao Jornal das 10 GloboNews 03 (cropped).jpg| File:Luciano Bivar em 19 de junho de 2019 (recorte).jpg| File:AndreJanones1.jpg| ==Debates== As of April 2022, the following TV stations confirmed presidential debates: 2022 Brazilian presidential election debates 2022 Brazilian presidential election debates 2022 Brazilian presidential election debates 2022 Brazilian presidential election debates 2022 Brazilian presidential election debates 2022 Brazilian presidential election debates 2022 Brazilian presidential election debates 2022 Brazilian presidential election debates 2022 Brazilian presidential election debates 2022 Brazilian presidential election debates 2022 Brazilian presidential election debates Date, time and location Hosts Moderators Participants Participants Participants Participants Participants Participants Participants Key: Key: Key: Key: Key: Key: Key: Key: Bolsonaro Lula d'Avila Gomes Tebet Thronicke Souza 1.1 Sunday, 28 August 2022, 21:00, São Paulo Bandeirantes, TV Cultura, Folha, UOL Adriana Araújo, Eduardo Oinegue, Fabíola Cidral, Leão Serva 1.2 Saturday, 24 September 2022, 18:15, Osasco SBT, CNN Brazil, Estado, Veja, Terra, NovaBrasil FM Carlos Nascimento 1.3 Thursday, 29 September 2022, 22:30, Rio de Janeiro Globo William Bonner 2.1 Sunday, 16 October 2022, 20:00, São Paulo Bandeirantes, TV Cultura, Folha, UOL Adriana Araújo, Eduardo Oinegue, Fabíola Cidral, Leão Serva colspan=5 2.2 Monday, 17 October 2022, Osasco RedeTV! TBD colspan=5 2.3 Friday, 21 October 2022, 21:30, Osasco SBT, CNN Brazil, Estado, Veja, Terra, NovaBrasil FM Carlos Nascimento colspan=5 2.4 Sunday, 23 October 2022, São Paulo Record TBD colspan=5 2.5 Friday, 28 October 2022, 21:30, Rio de Janeiro Globo TBD colspan=5 ==Opinion polling== === First round === ====Polling average==== Aggregator Last update Jair Bolsonaro Luiz Inácio Lula da Silva Ciro Gomes Simone Tebet Others Abst. Undec. Lead Aggregator Last update Others Abst. Undec. The Economist 1 Oct 2022 38% 51% 5% 6% (N/A) (N/A) Lula +13.0 Veja 1 Oct 2022 33.7% 44.7% 6.8% 4.7% (N/A) (N/A) Lula +11.0 Estadão 1 Oct 2022 33% 47% 5% 6% 2% 7% Lula +14.0 CNN Brasil 1 Oct 2022 34% 48% 5% 6% 2% 6% Lula +14.0 PollingData 1 Oct 2022 37.5% 43.7% 5.1% 5.3% 1.9% 6.5% Lula +6.2 El Pais 1 Oct 2022 35.3% 46.7% 6.0% 4.9% (N/A) (N/A) Lula +11.4 El Electoral 1 Oct 2022 38.5% 48.5% 5.5% 5.0% (N/A) (N/A) Lula +10.0 Pollstergraph 1 Oct 2022 37.1% 44.8% 5.6% 4.7% Lula +7.7 === Second round === ==== Polling average==== Aggregator Last update Jair Bolsonaro Luiz Inácio Lula da Silva Blank/Null/ Undec. Lead The Economist 16 Oct 2022 48% 52% (N/A) Lula +4.0 Estadão 14 Oct 2022 41% 49% 10% Lula +8.0 PollingData 14 Oct 2022 44.3% 47.4% 8% Lula +3.1 CNN Brasil 12 Oct 2022 42% 50% 8% Lula +8.0 ==Bolsonaro's claims of fraud== Bolsonaro has said that Brazilian electronic ballots might make vote rigging easier. During the 2018 elections, many social media platforms had fake claims that electronic ballots had been set up to support candidates other than Bolsonaro, and that he had won the presidential election in the first round. However none of these claims were proven true. As president, Bolsonaro kept on saying that the 2022 election will have fraud voting and wanted to have an election audit. In July 2022, Bolsonaro said that the voting system in Brazil was weak and that it was possible for voter fraud and rigging to happen in the 2022 election. Brazilian and international law experts, political analysts, and authorities have said Bolsonaro's claims are not true. Many worry that Bolsonaro's false fraud claims might be seen as a self-coup, such as the 2021 United States Capitol attack, should Bolsonaro lose the election. Bolsonaro has looked for police and military support, which many saw as him planning a coup should he lose. ==2023 invasion of the Brazilian Congress== On 8 January 2023, supporters of former President Jair Bolsonaro stormed and invaded the Praça dos Três Poderes in Brasília, taking over the offices of the Supreme Federal Court, National Congress of Brazil and the Palácio do Planalto. The event was seen as an attempted coup d'état to overturn the election results of the 2022 general election. ==Results== ==Notes== ==References== Category:Brazilian general elections Category:2022 in Brazil Category:2022 elections Category:October 2022 events Category:Luiz Inácio Lula da Silva",
 "title": "2022 Brazilian general election"
}