{
 "id": "928166",
 "text": "The cassock or soutane is a type of clothing. It is a Christian clerical coat used by the Oriental Orthodox Church, Eastern Orthodox Church and the Catholic Church, it is also used by Protestants such as Anglicans and Lutherans. == Catholic Cassock == In the Catholic Church, the cassock is an important part of the dress for priests and bishops. The ordinary Roman cassock is black, but in tropical countries, it is often white and usually without a shoulder cape (pellegrina). The cassock has buttons down the front. Coloured piping (narrow decorative trim) and buttons are added in accordance with rank: black for priests, purple for chaplains of His Holiness; purple for bishops, protonotaries apostolic, and Honorary Prelates; and scarlet red for cardinals. File:7 Sutanna BiskupaRzymu.png|Pope (Often with pellegrina. His coat of arms is embroidered at the bottom of his fascia.) File:6 Sutanna Kardynala.png|Cardinal (Often with pellegrina.) File:5 Sutanna Biskupa.png|Bishop (Often with pellegrina.) (Also worn by Protonotaries Apostolic and Honorary Prelates, but without pellegrina and zucchetto.) File:SutannaKapelanaJegoSwiatobliwoscibyKacperKluczyk.png|Chaplain of His Holiness File:Cassock (Catholic Priest).svg|Priest/Deacon/ Seminarian == Orthodox Cassock == In the Orthodox Church, the cassock is also worn by priests and monks. It is often called the riassa. The riassa is usually black and has a simple design. There are two types of cassocks: the inner cassock, worn under vestments, and the outer cassock, worn as regular clothing. === Eastern Catholic and Orthodox examples === File:Eastern Orthodox Bishop.png|Bishop File:Orthodox Priest Kontorasion.png|Priest with grey Zostikon, a Kontorasson, and a Skufia. File:Eastern Orthodox Priest.png|Priest (married) File:Orthodox Monk-Priest.png|Hieromonk (celibate Priest) File:Monk.png|Monk File:Eastern Orthodox Reader.png|Chanter/Subdeacon/Deacon dressed in the Zostikon === Oriental Orthodox examples === File:Syriac Orthodox Patriarch.png|Syriac Patriarch File:Syriac Orthodox Bishop.png|Syriac Bishop File:Coptic Orthodox Priest.png|Coptic Priest File:Syriac Orthodox Priest.png|Syriac Priest File:Syriac Orthodox Priest-Monk.png|Coptic & Syriac Priest (monk) == Anglican Cassock == In the Anglican Church, the cassock is worn by clergy during services. The Anglican church uses single and double-breasted cassocks. The single-breasted (one row of buttons) version is common in the Anglo-Catholic tradition, while the double-breasted (two rows of buttons) version is often worn in the evangelical part of the church. Black is the most common color for priests, readers, vergers, and server cassocks. File:Cassock (Anglican Bishop).svg|Bishop File:Cassock (Anglican Canon).svg|Canon (cassock colour may vary) File:Cassock (Anglican Priest).svg|Presbyter/Deacon/Layperson cassock colour may vary if worn by, for instance, a chorister == Related pages == * Bishop * Archbishop == Notes == == References == Category:Christian clothing",
 "title": "Cassock"
}