{
 "id": "92811",
 "text": "Costa Coffee is a British multinational coffeehouse and retail company headquartered in Dunstable, Bedfordshire, and a wholly owned subsidiary of Coca Cola. It is the largest coffeehouse chain in the world behind Starbucks and the largest in Britain.[2] Costa Coffee was founded in London in 1971 by the Costa family as a wholesale operation supplying roasted coffee to caterers and specialist Italian coffee shops. Acquired by Whitbread in 1995 for £19M, it has since grown to over 3,277 stores across 31 countries. The business has 2,121 UK restaurants, over 6,000 Costa Express vending facilities and a further 1,280 outlets overseas (including 395 in China).[1][3] == History == Italian emigrant brothers Bruno and Sergio Costa founded a coffee roastery in Lambeth, London, in 1971, supplying local caterers. The family having moved to England in the 1960s.[4][5] Costa branched out to selling coffee in 1978, when its first store opened on Vauxhall Bridge Road, London. In 1985, Sergio bought out Bruno's share of the company. Bruno went on to found a tableware company.[6] By 1995, the chain had 41 stores in UK.[7] In 1995, the business was acquired by Whitbread for £19M, UK's largest hotel and coffee shop operator, becoming a wholly owned subsidiary. In 2009, Costa opened its 1,000th store - in Cardiff. In December 2009, Costa Coffee agreed to acquire Coffee Heaven for £36 million, adding 79 stores in central and eastern Europe.[8] On 31 August 2018, Coca Cola paid US$4.9 billion for the Costa chain worldwide. After approval from regulatory authorities in the European Union and China, the deal went ahead, extending Coca-Cola's presence in the coffee and restaurant market. ==Related pages== *Starbucks *Caffè Nero ==References== ==Other websites== *Costa Coffee at Motorway Services *Costa Coffee website *Costa Book Awards website *Costa Foundation website Costa Coffee Category:1971 establishments in the United Kingdom Category:Dunstable",
 "title": "Costa Coffee"
}