{
 "id": "928175",
 "text": "Kim Anderson is an associate professor at the University of Guelph. She works in the Department of Family Relations and Human Development in the College of Social and Applied Human Sciences. Anderson is an Indigenous (Metis) scholar. She researches Indigenous mothering, Indigenous feminism, Indigenous masculinities, and Indigenous knowledge in cities. She holds the Canada Research Chair in Indigenous Relationships, and leads a research team exploring the Indigenous concept of “all my relations\" - an Indigenous expression of gratitude and connection - and how these relationships are developed and maintained among urban Indigenous populations. She got her PhD in History from the University of Guelph in 2010. She had studied the role of Anishinaabek life stage teachings among northern Algonquin women. These helped Indigenous peoples to decolonise and make healthier lives. Her M.A. is in Adult Education and Sociology and Equity Studies from University of Toronto's Ontario Institute for Studies in Education. She earned an Honours B.A. as an English Specialist from the University of Toronto. == Career == Anderson joined the Department of Family Relations and Applied Nutrition at University of Guelph in 2017. She became the Canada Research Chair in Indigenous Relationships in 2018. She planss to \"Indigenize the campus\" with programs including language training, food and medicine gardens, and ceremonial spaces. Prior to joining the faculty at University of Guelph, Anderson was Associate Professor in Indigenous Studies at Wilfrid Laurier University from 2011-2016. == Publications == *A Recognition of Being: Reconstructing Native Womanhood (2d Edition, Canadian Scholars, 2016) *Life Stages and Native Women: Memory, Teachings and Story Medicine (University of Manitoba Press, 2011) *Indigenous Men and Masculinities: Legacies, Identities, Regeneration (with Robert Alexander Innes; University of Manitoba Press, 2015) *Mothers of the Nations: Indigenous Mothering as Global Resistance, Reclaiming and Recovery (with Dawn Lavell- Harvard; Demeter Press, 2014) ==References== Category:Living people Category:Year of birth missing (living people) Category:University of Guelph alumni Category:North American anthropologists Category:Canadian academics",
 "title": "Kim Anderson"
}