{
 "id": "928275",
 "text": "Will Wood is an American musician from New Jersey. When in a studio or performing live with a band, he is usually accompanied by \"the Tapeworms\", which includes Mike Bottiglieri on guitar, Matt Berger on saxophone, Mario Conte on drums, and Vater Boris on bass. Before forming \"Will Wood and the Tapeworms\", he was performing with other bands, such as Jamface, Strange Thick, A Verbal Equinox and The Stereosexuals. He also performs by himself. His live shows include a mix of music, talking, and comedy. == Style == Wood's style of piano often changes from one song to the next, drawing from folk, pop, jazz, rock and roll, latin music, and Klezmer, which is the traditional music of the Ashkenazi Jews of Central and Eastern Europe. == Body of Work == Wood has released 7 albums since 2015, Everything is a Lot (2015), Self-Ish (2016), The Normal Album (2020) \"In case I make it,\" (2022), 2 live albums, The Real Will Wood (2020) and IN CASE I DIE (2023), and a remix album The New Normal (Normal Album 2024 Edit) (2024). He has also written music for the podcast, Camp Here and There. He also directed the \"The Real Will Wood\", a part mockumentary, part documentary film promoting his live tour, as well as the documentary following the stages of production for \"The Normal Album\", called \"What Did I Do? (The Making of the Normal Album)\" Will also takes part in a comedy podcast called \"Life in the World to Come\" with Chris Dunne. == Personal life == Will doesn't like to share details of his personal life and avoids social media. During old live shows and interviews, he would play a distasteful and high energy character and often lie about his personal life, including about having a daughter named Millie after Eleven from Stranger Things. Will is very open with past struggles with drug addiction and mental illness. He was diagnosed with bipolar disorder early in his career and donates large amounts of live show performances to mental health charities. == Discography == === Studio Albums === * Everything is a Lot (2015) Released as Will Wood and the Tapeworms * SELF-iSH (2016) * The Normal Album (2020) * \"In case I make it,\" (2022) === Live Albums === * The Real (2018)Re-released in 2020 as The Real Will Wood (Music from the Award-Winning Concert Film) * IN CASE I DIE: (Live) (2023) === Soundtrack Albums === * Camp Here and There (Original Series Soundtrack) (2021) * Camp Here and There Soundtrackː Campfire Songs Edition (2022) === Remix Album === * The New Normal! (The Normal Album 2024 Edit) (2024) Singles Title Date Album Chemical Overreaction / Compound Fracture May 15, 2015 Everything is a Lot Mr. Capgras Encounters a Secondhand Vanity: Tulpamancer's Prosopagnosia / Pareidolia (As Direct Result of Trauma to Fusiform Gyrus) July 8, 2016 SELF-iSH Dr. Sunshine is Dead July 28, 2016 SELF-iSH 2012 August 9, 2016 SELF-iSH Alma Mater May 10, 2016 Non-album single Love, Me Normally May 29, 2020 The Normal Album Laplace's Angel (Hurt People? Hurt People!) June 12, 2020 The Normal Album ..Well, Better Than the Alternative June 26, 2020 The Normal Album Mr. Fregoli and the Diathesis- Stress Supermodel, Or: How I Learned to Stop Worrying and Love the Con (An Untitled Track) July 7, 2020 Non-album single Sex, Drugs, Rock 'n' Roll September 20, 2021 \"In case I make it,\" Your Body, My Temple January 18, 2022 Camp Here & There Tomcat Disposables April 29, 2022 \"In case I make it,\" Cicada Days May 27, 2022 \"In case I make it,\" You Liked This (Okay, Computer!) June 10, 2022 \"In case I make it,\" Euthanasia June 17, 2022 \"In case I make it,\" White Noise July 8, 2022 \"In case I make it,\" == References == Category:American filmmakers Category:American singer-songwriters Category:Living people Category:Musicians from New Jersey Category:People with bipolar disorder",
 "title": "Will Wood"
}