{
 "id": "928291",
 "text": "In the United States, abortion was federally legal under Roe v. Wade (the 1973 court case with which abortion was no longer a criminal act) until 2022. In 2022, the Supreme Court decided Dobbs v. Jackson Women's Health Organization, ending federal abortion rights.In several states, there are trigger laws under which made abortion illegal, and these laws came into effect when Roe vs. Wade ended. The decision also impacted abortion rights in Alabama, Arkansas, Missouri, Iowa, Wisconsin, Oklahoma, Texas, and Mississippi, most of which are Republican. Most anti-abortion movement officials are conservative Republicans in a number of U.S. states. Few, however, are anti-abortion while advocating for the rights of lesbian, gay, bisexual, and transgender individuals (examples include the Pro-Life Alliance of Gays and Lesbians, PLAGAL for short). ==Hyde amendment== The Hyde amendment (enacted in 1976) doesn't allow Medicare, Medicaid, or other federal funds to be used for abortion except if the mother's life is in danger, the mother was raped/sexually assaulted, or became pregnant through incest. This applies to thirty-two out of fifty states. They include Iowa, Pennsylvania, Kansas, Virginia, and Michigan. ==Related pages== *Abortion *Roe v. Wade == Abortion legality in other countries == The table below lists in chronological order the United Nations member states that have legalized abortion on request in at least some initial part of the pregnancy, or that have fully decriminalized abortion. As of July 2022, 65 countries have legalized or decriminalized abortion on request. Note: In some countries or territories, abortion laws are modified by other laws, regulations, legal principles or judicial decisions. This map shows their combined effect as implemented by the authorities. Abortion laws specify under what circumstances a woman can get an abortion. Getting an abortion means that the pregnancy is ended early, without the birth of a child. These laws vary widely, by country, and sometimes by area. They have also changed over time. Year legalized Countries 1955 ( as part of the Soviet Union) 15 15 1957 1 16 1965 1 17 1973 Penal Code, 2012. Article 214 . 2 19 1974 2 21 1975 3 24 1977 ( as part of Yugoslavia) 6 30 1978 2 32 1979 1 33 1983 1 34 1984 1 35 1986 2 37 1987 ( as part of Czechoslovakia) 2 39 1988 1 40 1989 1 41 1990 3 44 1992 1 45 1993 Penal Code of Guinea-Bissau, Judicial Police of Guinea-Bissau, 20 May 2019. Article 112 .Portuguese Penal Code of 1886, University of Coimbra, 1919. Article 358 . 1 46 1995 1 47 1996 1 48 1997 2 50 2002 2 52 2007 1 53 2010 1 54 2012 Penal Code, Government of São Tomé and Príncipe, 2012. Book II, title I, chapter II . 2 56 2015 1 57 2018 1 58 2019 2 60 2020 1 61 2021 3 64 2022 2 66 ==References== == Notes == Category:United States law Category:Controversies in the United States United States Category:Healthcare in the United States United States",
 "title": "Abortion in the United States"
}