{
 "id": "928408",
 "text": "The bedrock of Scotland is very ancient rock. Archean gneiss, metamorphic beds with granite intrusions were laid down when the Caledonian mountains were built. Coal, oil and iron-bearing carboniferous deposits are there, and so are remains of Palaeogene volcanoes. So the rocks of Scotland north of the Highland Boundary Fault are generally older, and mostly much older, than the rocks of England. This part of Scotland is known as the Highlands and Islands. It includes the Scottish Highlands, plus Orkney, Shetland and Outer Hebrides (the Western Isles). Much of Shetland's economy depends on oil and gas production from fields in the surrounding seas.Keay J. & Keay J. 1994. Collins Encyclopaedia of Scotland. London. HarperCollins, page 867. To this might be added tourism, which has become increasingly important. The Midland Valley, or Central Lowlands, has the big cities of Edinburgh and Glasgow. They are in an area known as the central belt, or valley. The economy of Scotland used to depend almost entirely on these two cities, because of their importance in ship building (Glasgow) and general commerce (Edinburgh). Coal mining was also important in the 19th and early 20th centuries. Now ships can be built more cheaply elsewhere (for example, South Korea), and yet much still much depends on these two cities, and on Aberdeen, which acts as a port for the North Sea oil rigs. The geology of the Central Valley is quite different from the Highlands and Islands. For one thing, it is in the exact place of an ancient and once large sea, the Iapetus Ocean. == The Iapetus Ocean == Sandstone, mudstone and limestone were laid down in the area which is now the Midland Valley. This occurred in shallow tropical seas on the edge of the once-great Iapetus Ocean. The Iapetus Ocean closed 480-430 million years ago, when the volcanic island arc collided with Laurentia. By the end of the Silurian period (c. 420 million years ago), the Iapetus Ocean had completely disappeared. The combined mass of three continents formed the \"new\" continent of Laurasia.See for paleogeographic reconstructions of the collisions for example ; This would become the northern part of the supercontinent Pangaea. == References == Category:Geology by country Category:Geography of Scotland",
 "title": "Geology of Scotland"
}