{
 "id": "92868",
 "text": "Charles V (21 January 1338 — 16 September 1380), called the Wise (French: le Sage) was the King of France from 1364 until his death in 1380. He was a member of the House of Valois and was the third french king to rule under the dynasty. He was born in Vincennes, the son of the future King John II of France (then known as Dauphin John) and Bonne of Luxembourg. Charles was 11 years old when his mother Bonne of Luxembourg died. A year later when Charles was 12, his grandfather, King Philip VI died. John then became the King of France and Charles became the Dauphin. Also, his father got remarried to Joan I, Countess of Auvergne. After his father was captured by the English at the Battle of Poitiers in 1356, Charles acted as the Regent of France until his father's death in 1364. His reign marked a high point for France during the Hundred Years' War. His armies recovered large parts of the territory from King Edward III of England that had been given to England under the reign of his predecessors at the Treaty of Brétigny. He and his armies also defeated Edward III's fleet and kicked the English troops out of France. Charles died on 16 September 1380 at the age of 42 in Beauté-sur-Marne near Vincennes and was succeeded by his 12 year old son, Charles VI. He was buried in Saint Denis Basilica. Charles was a successful king. He was very capable and was also very intelligent. He was very popular around France and was undoubtedly one of France's greatest kings. These reasons eventually gave him the nickname, \"the Wise\". He also improved the economy of France and stabilized and centralized the country and left a stable throne and a stable country for his son and successor, Charles VI. However, under the reign of Charles VI, the country lad lost lands allowing the English to regain it and that the country became destabilized and decentralized. Category:1338 births Category:1380 deaths Category:House of Valois Category:Kings of France Category:Vincennes Category:People from Val-de-Marne",
 "title": "Charles V of France"
}