{
 "id": "928745",
 "text": "Santa Claus (born Thomas Patrick O'Connor; May 1947) is an American politician, monk, and child welfare activist. He was a member of the North Pole, Alaska City Council from 2015 to 2022. Claus was re-elected to the council in 2019, with 100 votes. He was also the mayor pro tem. He was a candidate for the United States House of Representatives in the 2022 special election. ==Personal life== Claus is a Christian monk of the Celtic Anglican order Anam Cara. He changed his name to match the legendary character in 2005, to help bring awareness for his activism about children's health and welfare. Claus has a stepson, but is not currently married. He has confirmed that he has had multiple cancers, but has not shared any specific diagnoses. ==Politics== Claus is a supporter of democratic socialism, including support for medicare-for-all, coronavirus relief, a wealth tax, and student loan cancellation. Claus supported Joe Biden's presidential campaign in the 2020 election after Bernie Sanders dropped out of the Democratic primary. Claus is a supporter of medical marijuana. He says that his views are similar to those of Bernie Sanders, sharing the same views as Sanders on racial justice, corporate taxes, and election freedoms. In April 2022, Claus announced his candidacy for the United States House of Representatives in the 2022 special election. He wanted to finish the rest of Congressman Don Young's term, but after having a lot of support, he said he would run for a full two year term in November 2022. Claus was among 48 candidates running in the non-partisan June primary, including former Alaskan Governor Sarah Palin. However, he lost in the June primary and did not advance to the run-off primary. ==References== Category:1947 births Category:American political activists Category:American socialists Category:Democratic socialists Category:Independent politicians in the United States Category:Living people Category:Christian monks Category:Politicians from Alaska Category:Politicians from Washington, D.C.",
 "title": "Santa Claus (politician)"
}