{
 "id": "928770",
 "text": "빼갈닷컴. == History == Construction began in 1980. The first section of Line 3 opened (Gupabal–Yangjae; Jichuk opened in 1990) after work was finished in two stages during 1985. In October 1993, a second extension to the south was opened (Yangjae–Suseo). In March 1996, the Korail Ilsan Line opened. This lets Line 3 trains go all the way to the city of Goyang. There are 2 depots near Jichuk station and Suseo station for both Korail and Seoul Metro. A 3 km extension opened on February 18, 2010. It goes from Suseo to Garak Market (Line 8) and Ogeum (Line 5). On December 27, 2014, Wonheung station opened between Wondang and Samsong stations. == Stations == Station Number Station Name English Station Name Hangul Station Name Hanja Transfer Line Name Distance in km Total Distance Location Daehwa Juyeop Jeongbalsan Madu Baekseok (Ilsan Hospital) Daegok Hwajeong Wondang Wonheung Samsong Jichuk Gupabal Yeonsinnae 연신내 Bulgwang Nokbeon Hongje (Seoul Culture Arts Univ.) Muakjae 재 Dongnimmun Gyeongbokgung (Government Complex-Seoul) Anguk Jongno 3(sam)-ga 3 Euljiro 3(sam)-ga 3 Chungmuro Dongguk University Yaksu Geumho Oksu Apgujeong (Hyundai Department Store) Sinsa Jamwon Express Bus Terminal 터미널 Seoul Nat'l Univ. of Education (Court & Prosecutor's Office) Nambu Bus Terminal (Seoul Arts Center) 터미널 Yangjae (Seocho-gu Office) Maebong 매봉 Dogok Daechi Hangnyeoul 학여울 Daecheong 대청 Irwon Suseo Garak Market National Police Hospital Ogeum == Rolling stock == === Current === * VVVF inverter-controlled electric car ** First generation – since 2009 ** Second generation – since 2022 * Korail Class 3000 ** Second generation – since 2023 ** Third generation – since 2023 File:SMSC_EMU3000_VVVF_301.jpg|Seoul Metro 3000 series VVVF inverter- controlled (First generation) File:20240518 한국철도공사 3000호대.jpg|Korail Class 3000 (Second generation) File:20240518 한국철도공사 3000호대 - 2.jpg|Korail Class 3000 (Third generation) === Former === * Seoul Metro 3000 series ** Chopper- controlled from GEC Traction electric car (from 1989–2022, some transferred from Seoul Subway Line 4) ** Chopper-controlled from GEC Traction electric car (rebuilt cars) (from 2010–2022) * Korail Class 3000 ** First generation (from 1995–2024) File:Seoul_Metro_Line_3_train_(GEC)_arriving_at_Oksu.jpg|Seoul Metro 3000 series Chopper-controlled EMU File:옥수역에 진입하는 오금행 3x74편성.jpg|Korail Class 3000 (First generation) == Related pages == * Seoul Metropolitan Subway == References == == Other websites == * Seoul Metropolitan Government's Line 3 extension page includes a route map and status information for the extension from Suseo to Garak Market. * UrbanRail.Net's Seoul Subway Page * Map, station and route finder Category:1985 establishments in South Korea Category:Buildings and structures in Seoul",
 "title": "Seoul Subway Line 3"
}