{
 "id": "928834",
 "text": "Essential tremor (ET), also called benign tremor, familial tremor, and idiopathic tremor, is a disorder of the nervous system that causes the patient to experience involuntary movements, producing involuntary and rhythmic jerks. It often affects the hands, although it can sometimes affect the voice or the head. Although it is the most common type of tremor, its causes have not yet been identified. It is not usually a dangerous condition, but essential tremor can progress over time, worsening the patient's condition. Essential tremor is a progressive neurological disorder, and the most common movement disorder. Its onset is usually after age 40, but it can occur at any age. The cause is unknown. Diagnosis is by observing the typical pattern of the tremor coupled with the exclusion of known causes of such a tremor. ==Causes== During maturation, a process occurs that involves progressive neurodegeneration and/or the death of neurons. This process, which can be normal and natural during normal aging, involves the fundamental cells of the nervous tissue and its internal components, which are the ones that prevent effectiveness in conducting information in the human brain, with the appearance of tremors, such as in Parkinson's disease. Essential tremor is the result of abnormal communication between certain areas of the brain, including the cerebellum, thalamus, and brainstem. ==Features== This ailment affects men and women, being more frequent in people over 65 years of age. Although the exact cause of essential tremor is unknown, some work indicates that the part of the brain that controls muscle movements does not work correctly in patients with essential tremor. Half of the cases of essential tremor are the consequence of a genetic mutation, although the specific gene has not been identified. This type is called familial tremor. It is unknown what causes essential tremor in people who do not have a genetic mutation. ==Diagnosis== The diagnosis is usually made on clinical grounds. Tremors can begin at any age, from birth to old age (senile tremor). Any voluntary muscle in the body can be affected, although tremor is most commonly seen in the hands and arms and slightly less on the neck (which makes the person's head move), tongue, and legs. A resting tremor of the hands is sometimes present. Tremor occurring in the legs may be diagnosed as orthostatic tremor. ET occurs within multiple neurological disorders in addition to Parkinson's disease. This includes migraine disorders, where co-occurrences between ET and migraines have been examined. ===Treatment=== Essential tremor is usually treated with medication. == References == Category:Genetic disorders Category:Neurology Category:Symptoms",
 "title": "Essential tremor"
}