{
 "id": "928942",
 "text": "Shireen Abu Akleh (3 April 1971 – 11 May 2022) was a Palestinian-American journalist. She worked as a reporter for the Arabic-language channel of Al Jazeera for 25 years until her assassination. She was born in Jerusalem. She was seen as a role model by many upcoming talented Palestinian and Arab journalists, particularly women. ==Early life== Abu Akleh was born on 3 April 1971 in Jerusalem to an Arab Christian family. She spent time in the United States, obtaining U.S. citizenship through members of her mother's family who lived in New Jersey. As a child, her parents would often tell her stories of a Palestine that existed before Israel was established. This inspired her to be a voice for Palestine. After graduating with a Bachelor's degree in Journalism from Yarmouk University in Jordan, Abu Akleh returned to Palestine. ==Assassination== Abu Akleh was assassinated on 11 May 2022 by an Israeli soldier. At the time of her killing she was wearing a blue Press vest and covering a israeli raid on the Jenin refugee camp in the Israeli-occupied West Bank. She was aged 51. ==Reactions== * One year after Shireen was killed; Committee to Protect Journalists said that there was a 'deadly pattern' in the way Israel had killed 20 journalists since 2001 and had not hold any of the perpetrators accountable. * Kuwait’s foreign ministry said in a statement that,\"the country strongly condemned Israeli forces’ killing of Palestinian journalist Abu Akleh.\" * Lebanese President, Michel Aoun said: \"The Israeli occupation adds the murder of journalist Shireen Abu Akleh to its bloody history, a new chapter of abuse, aggression and disregard for life and justice.\" * Omar Shakir, the Israel and Palestine director for Human Rights Watch said,\"It’s, of course, not a one-off event, we know that Israeli forces systematically have used excessive force. This is an event that needs to be understood in the context of this systemic practice and the killings of many other Palestinian journalists.\" ==References== ==Other websites== *Kaamil Ahmed, Lydia McMullan, Elena Morresi, Garry Blight and Harry Fischer, 'The killing of Shireen Abu Akleh: what one morning in the West Bank reveals about the israeli occupation,' The Guardian, March 21, 2023. Category:1971 births Category:2022 deaths Category:American war correspondents Category:Palestinian writers Category:Writers from Jerusalem Category:Murders by firearm Category:Assassinated Palestinian people Category:Palestinian journalists Category:Palestinian Americans Category:Palestinian Christians",
 "title": "Shireen Abu Akleh"
}