{
 "id": "928933",
 "text": "Ingrid van den Benden (born 1951) is a former Dutch Paralympic swimmer. She won three gold medals and one silver medal at the 1968 Summer Paralympics. She won four gold medals at the 1972 Summer Paralympics in Heidelberg. == Biography == When Van den Bende was two, she moved with her parents from Indonesia to the Netherlands. Shortly before she arrived in the Netherlands, she had polio. For her rehabilitation she started swimming when she was four. At the time, she walked with suspenders and high shoes. During the swimming competitions of the 60th anniversary of the “Amsterdamse Specialisten Vereniging” in 1966 she swam very fast. Her performance was noticed and so she was able to compete the same year and the following year at the Stoke Mandeville Games, the annual competitions for athletes with disabilities in Great Britain. In both years she won three times. At first he trained every Thursday night at the ZAR. She was a member of the ISA swimming club in Amsterdam. She was selected to compete in the 1968 Summer Paralympics in Tel Aviv, in Israel. She has won two individual gold medals, a silver medal and a gold medal in the 3x 50m relay. After the Paralympics she was awarded in her school. It was a festive event, including a speech from the mayor. She received several gifts, including a swimming diploma: At the 1969 Dutch National Championships she swam four world records. At the 1972 Dutch National Championships she swam two world records. In the years preceding the 1972 Summer Paralympics in Heidelberg she intensified her training to a professional level, having three training sessions per day, five days a week, plus Saturday as match-day. As result she swam several long-lasting World Records and won three individual gold medals plus another gold medal as part of the 4x 100m relay. == References == == Other websites == * De Nederlandse deelnemers aan de Olympische Spelen voor gehandicapten zijn vanavond op Schiphol teruggekeerd. Op de foto drie succesvolle deelnemers, v.I n.r. INGRID VAN DER BENDEN, PIET MAKKES en ARJA NOORDE Category:Paralympic gold medalists for the Netherlands Category:1951 births Category:Living people",
 "title": "Ingrid van der Benden"
}