{
 "id": "928948",
 "text": "Hendrik Groot (22 April 1938 – 11 May 2022) was a Dutch footballer. He played as a forward and attacking midfielder.Henk Groot 75 jaar , Ajax.nl, Retrieved 28 May 2013 (Dutch) He made 39 appearances with the Netherlands national football team with 12 goals from 1960 until 1969. Henk Groot was renowned for prolific scoring, especially with headers. His most famous goal was a header against Real Madrid in 1967. In the 1960s, Groot was regarded as one of the best goal scorers in the Netherlands. In 1960 and 1961 he was the top scorer in the Eredivisie with 38 and 41 goals not achieved since. With a total of 195 goals, he is the sixth-best scorer in the Eredivisie of all time. At Ajax, he is the fourth-best goalscorer in the club's history, third-best in the Eredivisie era. Considered to be one of the best Dutch football players of all time. He is also known as a renowned penalty and free-kick taker. ==Early career== Henk Groot grew up in the village of Zaandijk. In his youth he played football at the local club ZVV Zaandijk. At the age of seventeen, he reached the first team, where he scored goals continuously. A short time later, the club Stormvogels reported, where he started playing football as a semi- professional. His brother Cees, who was six years older, was also involved in the deal and so both brothers played for the club from IJmuiden. ==Club career== In 1959, the two brothers switched to Ajax. On his debut, against NAC, Henk Groot managed to find the net. Ajax won the match 3–0 and Henk scored all the goals. He continued to score and became the league's top scorer that 1959/60 season with 38 goals, 9 more than his brother Cees who finished third on the top scorers' list. In his first season, he won his first national championship with Ajax. A season later, Groot set a record within Ajax that is still unparalleled in 2023 by scoring 41 goals in the 1960/61 competition. In total, he scored 65 goals that 1960/61 season, including the goals in the cup (fourteen in eight games) and Intertoto tournament (nine in five games). In the Eredivisie, only Coen Dillen has scored more in one season (43 goals in the 1956/57 season). The Italian Lanerossi Vicenza, which played in the highest division, wanted to take over Groot in 1961. Groot was interested in it. Ajax asked for a transfer fee of 250,000 guilders, but Lanerossi Vicenza thought that was too much. Groot then had himself put on the transfer list at Ajax, because the club had not done anything with an offer from the Italians. Because of the transfer system, it was also more advantageous if the player put himself on the transfer list. With mixed feelings, Groot heard that he was taken over by Feijenoord in 1963 for an amount of 250,000 guilders. He played there for two seasons and scored 34 goals in the league. In his second season with the Rotterdam club, he won his second national championship. In the meantime, Ajax was doing less and less (13th in 1964/65), until the arrival of Jaap van Praag as chairman. For a hefty sum of 375,000 guilders at the time, Ajax bought the striker back. The return was a requirement of the new coach Rinus Michels. As a veteran, Henk Groot had a different role to play than in his first period at Ajax. As a constructive midfielder, he brought peace to the selection with young players such as Johan Cruijff, Wim Suurbier and Barry Hulshoff. His brother Cees had meanwhile returned to his old club in Zaandijk. He scored his goals mainly as a surefire penalty kick specialist. In 1969, he injured his knee in a death kick he received from Polish player Zygfryd Szołtysik during an international match with the Dutch national team. This injury ended his sporting career in 1970 after several operations and rehabilitation. Groot received compensation for pain and suffering through the KNVB. He went to work as a representative at a construction company and at Michels' request he went as a scout to analyze opponents for Ajax. Groot became Ajax's sporting director or coordinator of professional football in January 1973, but stepped down on October 1, 1973 due to a lack of appreciation and uncertainty about how he would fill his position. ==International career== On April 3, 1960, he made his debut as part of the national team. In Amsterdam, the hosts defeated the Bulgarian national team with a score of 4:2. Genk Groth, two minutes before the end of the match, scored the fourth goal against the opponent. Once he managed to score a hat- trick. In September 1962, he hit the goal of the Netherlands Antilles national team three times. As a result, the match ended with a score of 8:0. In total, he played 39 matches for the Netherlands national team and scored 12 goals. In the last match, on September 7, 1969, with the Polish national team, he was seriously injured and was forced to end his football career. Then he worked as a scout in the Ajax club system. ==Honours== Ajax * Eredivisie: 1959–60, 1965–66, 1966–67, 1967–68 * KNVB Cup: 1960–61, 1966–67 * International Football Cup: 1961–62 Feyenoord * Eredivisie: 1964–65 * KNVB Cup: 1964–65 Individual * Eredivisie top scorer: 1959–60 – 38 goals in 33 matches, 1960–61 – 41 goals in 32 matches There are mildly differing numbers out there with regards to the number of matches and goals. ==References== Category:1938 births Category:2022 deaths Category:Dutch football managers Category:Footballers from Zaanstad",
 "title": "Henk Groot"
}