{
 "id": "928983",
 "text": "Universal Animation Studios is an American animation studio and a division of Universal Pictures. Universal Pictures is a subsidiary of NBCUniversal and is owned by Comcast. Universal Animation Studios has produced direct-to-video sequels to Universal-released movies, such as Woody Woodpecker, The Land Before Time, An American Tail, Balto, Curious George as well as other movies and television series. == History == Universal Animation Studios was established in 1990 as Universal Cartoon Studios. It was the animation division of MCA Inc. The first work by the company was Back to the Future: The Animated Series. It was announced on March 22, 1991 and was first broadcast on CBS on September 14 the same year. In 2006, Universal Cartoon Studios was renamed to Universal Animation Studios. == Filmography == === Movies === ==== Direct-to-video feature movies ==== # Title Release date Co-production with Universal Cartoon Studios 1 The Land Before Time II: The Great Valley Adventure December 13, 1994 N/A 2 The Land Before Time III: The Time of the Great Giving December 12, 1995 3 The Land Before Time IV: Journey Through the Mists December 10, 1996 4 The Land Before Time V: The Mysterious Island December 9, 1997 5 Hercules and Xena – The Animated Movie: The Battle for Mount Olympus January 6, 1998 Renaissance Pictures 6 The Land Before Time VI: The Secret of Saurus Rock December 1, 1998 N/A 7 Alvin and the Chipmunks Meet Frankenstein September 28, 1999 Bagdasarian Productions, LLC. 8 An American Tail: The Treasure of Manhattan Island February 15, 2000 N/A 9 An American Tail: The Mystery of the Night Monster July 25, 2000 10 Alvin and the Chipmunks Meet the Wolfman August 29, 2000 Bagdasarian Productions, LLC. 11 The Land Before Time VII: The Stone of Cold Fire December 5, 2000 N/A 12 The Land Before Time VIII: The Big Freeze December 4, 2001 13 Balto II: Wolf Quest February 19, 2002 14 The Land Before Time IX: Journey to Big Water December 10, 2002 15 Charlotte's Web 2: Wilbur's Great Adventure March 18, 2003 Paramount Pictures Nickelodeon Animation Studio 16 The Land Before Time X: The Great Longneck Migration December 2, 2003 N/A 17 The Land Before Time XI: Invasion of the Tinysauruses January 11, 2005 18 Balto III: Wings of Change September 30, 2005 19 The Adventures of Brer Rabbit March 21, 2006 Universal Animation Studios 20 The Land Before Time XII: The Great Day of the Flyers February 27, 2007 N/A 21 The Land Before Time XIII: The Wisdom of Friends November 27, 2007 22 The Little Engine That Could March 22, 2011 Crest Animation Productions 23 Curious George 3: Back to the Jungle June 23, 2015 Imagine Entertainment, Universal 1440 Entertainment 24 The Land Before Time: Journey of the Brave February 2, 2016 Universal 1440 Entertainment 25 Mariah Carey's All I Want for Christmas Is You November 14, 2017 Universal 1440 Entertainment, Splash Entertainment, Telegael and Magic Carpet Productions 26 Curious George: Royal Monkey September 10, 2019 Imagine Entertainment, Universal 1440 Entertainment 27 Curious George: Go West, Go Wild September 8, 2020 28 Curious George: Cape Ahoy September 30, 2021 29 Woody Woodpecker Goes to Camp April 12, 2024 Universal 1440 Entertainment ==== Theatrical movies ==== # Title Release date Co-production with 1 Curious George February 10, 2006 Imagine Entertainment 2 Curious George 2: Follow That Monkey! July 10, 2009 3 Woody Woodpecker October 5, 2017 Universal 1440 Entertainment === Short movies === * Fractured Fairy Tales: The Phox, the Box, & the Lox (1999) (theatrical release) * Van Helsing: The London Assignment (2004) (direct-to- video) * The Chronicles of Riddick: Dark Fury (2004) (direct-to-video) === TV series === # Title Creator(s) / Developer(s) Original run Co-production with 1 Back to the Future: The Animated Series Robert ZemeckisBob Gale 1991–1992 Amblin TelevisionZaloom/Mayfield Productions BIG Pictures 2 Fievel's American Tails David Kirschner 1992 Amblin TelevisionNelvana 3 Exosquad Jeff Segal Eric Lewald Michael Edens 1993–1994 N/A 4 Problem Child Scott AlexanderLarry Karaszewski Imagine EntertainmentD'Ocon Films Productions (season 1) Lacewood Productions(season 2) 5 Monster Force Marv Wolfman 1994 Lacewood Productions 6 Beethoven Universal Cartoon Studios 1994–1995 Northern Lights Entertainment 7 Earthworm Jim Doug TenNapelDoug Langdale 1995–1996 Shiny Entertainment 8 Savage Dragon Dean Stefan Bob Forward Lacewood Productions(season 1) Studio B Productions (season 2) P3 Entertainment USA Studios 9 The Spooktacular New Adventures of Casper Sherri StonerDeanna Oliver 1996–1998 Amblin TelevisionHarveytoons 10 Wing Commander Academy Michael Edens Mark Edens 1996 N/A 11 Vor-Tech: Undercover Conversion Squad Universal Cartoon Studios 12 The New Woody Woodpecker Show Bob JacquesKelly Armstrong 1999–2002 13 The Mummy: The Animated Series Thomas Pugsley Greg Klein 2001–2003 Studios USA Television(season 1) The Sommers Company 14 Curious George Joe Fallon 2006–2022 Imagine Entertainment (seasons 1–9, 14–15)WGBH Boston (seasons 1–12) Universal 1440 Entertainment (season 10–15) 15 The Land Before Time Ford Riley 2007–2008 Amblin Entertainment 16 Woody Woodpecker Alex Zamm 2018–2022 Universal 1440 EntertainmentSplash Entertainment === TV Specials === * Opus 'n' Bill: A Wish for Wings That Work (1991) * Curious George: A Very Monkey Christmas (2009) * Curious George Swings Into Spring (2013) * Curious George A Halloween Boo Fest (2013) * How Murray Saved Christmas (2014) * 5 More Sleeps 'til Christmas (2021) == Franchises == Titles Release dates Movies TV Seasons Woody Woodpecker 1940–present 2 4 Charlotte’s Web 1973–2003 2 0 An American Tail 1986–1999 4 1 The Land Before Time 1988–2016 14 2 Balto 1995–2005 3 0 Alvin and the Chipmunks 1999–2000 2 0 Curious George 2006–2022 6 15 == Associated Productions == * Charlotte’s Web (1973) * An American Tail (1986) * The Land Before Time (1988) * An American Tail: Fievel Goes West (1991) * Balto (1995) === Miscellaneous === * 63rd Academy Awards (1991) - animation for Woody Woodpecker presenting the award for Best Animated Short Film * Kids WB! promos - Earthworm Jim segments. * The Incredible Hulk Coaster * The Amazing Adventures of Spider-Man (1999) - traditionally-animated introduction * Dudley-Do Right’s RipSaw Falls (1999) - traditionally-animated queue video. == Related pages == * Universal Monsters * Illumination * Walter Lantz Productions * DreamWorks Animation ** DreamWorks Animation Television ** DreamWorks Classics *** Entertainment Rights *** Big Idea Entertainment *** Harvey Films *** UPA *** Bullwinkle Studios (50%) * Amblimation * Universal Interactive * List of unproduced Universal Pictures animated projects ==References== Category:American animation studios Category:Companies based in California Category:1990 establishments in California",
 "title": "Universal Animation Studios"
}