{
 "id": "929298",
 "text": "The First Palestinian Uprising sometimes called the First Intifada (using the Arabic word for \"uprising\") was a large-scale rebellion by Palestinians against the military occupation of the Palestinian territories by Israel. It started in 1987 and ended in 1993. While the rebellion was put down by the Israel Defense Forces, it led to a diplomatic victory for the Palestinians by giving recognition to the State of Palestine and the Palestinian National Authority in the Oslo Accords. The First Intifada inspired the Second Intifada in 2000 and the Third Intifada in 2023. == Causes == The Palestinian unrest that led to the outbreak of the first uprising started with the in the Occupied Palestinian Territory, forcing Palestinians to leave their land. Israeli settlement in the Occupied Palestinian Territory was already happening since Israel won the Six-Day War in 1967. Still, the Israeli government intensified these Jewish settlements and land expropriation in the 1980's. The United Nations considers Israel's settlements in Gaza Strip, the West Bank and East Jerusalem illegal. Other reasons for the Palestinian rebellion were the worsening Palestinian economy and the limited access to jobs. The widespread dissatisfaction among Palestinians living under more than twenty years of occupation and oppression by Israel and the lack of prospects for the future were also big factors that led to the first Intifada. == Start == The first protests against Israel's occupation started in Gaza. An Israeli army car drove into a Palestinian car, killing all four occupants on 8 December 1987. That night, protests broke out in a Palestinian refugee camp during the funeral of the victims. People in the refugee camp believed Israel set up the accident as a payback for the death of an Israeli man who was killed in Gaza a few days earlier. When the Israeli army killed a Palestinian man during the protests, the Palestinians became rebellious out of anger. ===Spread=== The protests spread to other places in the Gaza Strip and eventually reached the West Bank. It became a Palestinian mass uprising against the occupation. Palestinians came into active resistance. This uprising was different from all Palestinian resistance before this was a mass rebellion in which almost all domains of Palestinian society became involved. ===UNLU=== Quickly, the resistance became efficiently organized. A party (Unified National Leadership of the Uprising: UNLU) was established, which brought together all important Palestinian organizations and parties that already opposed Israel before the Intifada. Other Palestinians set up multiple sorts of \"popular committees\" who dealt with different parts of the organization such as food supply, medical care and social reform. == Course == The first Intifada is often known for its nonviolent nature. The nonviolent resistance from Palestinians existed to the boycott of Israeli products, strikes and the refusal to pay taxes or other obligated payments to Israel. However, the idea that this intifada was nonviolent is not correct. The first year of the Intifada was the most violent. The Palestinian youth started throwing rocks at the Israeli security forces at the beginning of the uprising. Later, they exchanged rocks for guns, grenades, and other weapons against Israeli forces. The more violence Palestinians used, the more violent the Israeli responses became. ===1988=== The first period of the Intifada is often divided into four phases. The first phase started immediately after the mass demonstrations on 8 December in Gaza and ended, more or less, three weeks later. This phase consisted of the sudden Palestinian demonstrations and uprisings from Gaza to the Palestinian territories. The second phase lasted until March 1988. The Intifada became more organized in this phase: the UNLU was established, even as several of the civil committees discussed above. In the third phase, which ran from March to June 1988, the Palestinians effectively started to boycott Israeli products and taxes. During the fourth phase, the resistance became even more structured and organized. This phase climaxed with the Declaration of Palestinian statehood (written by the Palestinian poet Mahmoud Darwish and proclaimed by Yasser Arafat) in November 1988. ===1989=== In 1989 the Israeli authorities began to banish the committees more actively and tried to crush the resurrection by deploying \"collaborators.\" The Israeli security forces switched to extremely violent tactics in this period. The Israeli authorities called for a policy to crush the uprising by 'force, might, beating' in 1988. Israeli soldiers beat up and tortured Palestinian demonstrators, especially young people, on an immense scale. An estimated amount of 57.000 were arrested by Israel authorities during the Intifada, a huge part of them became victim of torture and violence. Israeli forces used teargas, weapons, stones, sticks and bomb explosions against Palestinians. The Israeli tactics from this period led to a peak in Palestinian violence as well. === Casualties === Between 9 December 1987 and 31 December 1993, an estimated number of 1282 Palestinians died, and more than 130.472 became injured during the six years of the Intifada. The houses of 2534 Palestinians got demolished by Israeli security forces. For every three Palestinians that died, less than one Israeli was killed. Most of the Palestinians who died were killed by Israeli security forces. Palestinian civilians killed the Israelis who died. Most Palestinians and Israelis died within the Palestinian occupied territories including the Gaza strip, the West Bank and East Jerusalem. However, some of the victims who fell during this period of violence died within the Green Line. == End == The Intifada officially ended on the 13th of September 1993, when the Declaration of Principles was signed by the PLO and Israeli government at the White House in the USA. Israel recognized the PLO as Palestinian representative for the first time. The PLO agreed to renounce terrorism as a tactic to reach their goals, and both parties decided to establish a Palestinian Authority that would get more responsibility and autonomy in the occupied territories. This declaration was also the start of the Oslo accords, in which Palestine and Israel would start to discuss the many issues on autonomy, borders, refugees, and Jerusalem. The Oslo accords would last until 1995. === Oslo Accords === On 13 September 1993, the PLO and the Israeli government signed the Declaration of Principles, marking the start of the Oslo Accords, which were held between 1993 and 1995. More generally, the Oslo Accords comprised several agreements between the PLO and the Israeli government. The Oslo Accords were considered a huge breakthrough in the peace process between Palestine and Israel. However, many criticized or fully renounced the accords from the start. The signing of the Declaration marks the official end of the First Intifada. == References == Category:Arab–Israeli conflict Category:1988 in Asia Category:1989 in Asia Category:1990 in Asia Category:1991 in Asia Category:1992 in Asia Category:Palestinian nationalism Category:Israel–Palestine conflict",
 "title": "First Palestinian Uprising"
}