{
 "id": "92924",
 "text": "Cristina Elisabet Fernández de Kirchner (born 19 February 1953), also called Cristina Fernández, CFK or Cristina Kirchner, is an Argentine attorney and politician. She was the 37th Vice President of Argentina from 2019 to 2023. She was previously the 55th President of Argentina from 2007 to 2015. She was born in La Plata, Buenos Aires Province. She is the daughter of Eduardo Fernandez ( of Spanish descent) a bus driver, and Ofelia Esther Wilhelm (of German descent).Cristina Fernández de Kirchner profile She is a lawyer and she was married to former Argentinian president Néstor Kirchner from 1975 until his death in 2010. She was elected president in October 2007. She was re- elected to a second term in October 2011. ==Corruption trial== On 30 September 2020, the federal criminal cassation court confirmed the corruption trials of Fernández de Kirchner, ruling the former president's objections to be inadmissible. After analyzing the claims of the defendants in the case for the never-ratified Memorandum with Iran, on 7 October 2021, the Federal Oral Court 8 declared the case null and void. The judges concluded that there was no crime in the signing of the agreement with Iran, and declared a judicial dismissal of Cristina Kirchner and the other defendants.Cristina Kirchner was dismissed for signing the Pact with Iran: the judges decided that there was no crime. By Hernán Cappiello 10-08-2021, La Nación On 6 December 2022, she was sentenced to six years in prison and a lifetime ban from holding public office for corruption, and has stated her intention to appeal the verdict. On November 13, 2024, the Court of Cassation confirmed the six-year prison sentence handed down to Cristina Kirchner for “fraud” and “corruption”. ==Assassination attempt in 2022== On September 1, 2022, after 9:00 p.m., the Brazilian Fernando Andres Sabag Montiel attempted to assassinate Cristina Kirchner outside her home in the Recoleta neighborhood. He pointed a 380-caliber Bersa pistol at his head and fired the shot but the bullet did not come out, and he was subdued by security personnel. The Vice President of Argentina was unharmed. It happened when she was returning to her home and signing books. ==References== Category:1953 births Category:Living people Category:Argentine lawyers Category:First Ladies and Gentlemen of Argentina Category:Politicians from Buenos Aires Category:Presidents of Argentina Category:Roman Catholics Category:Vice presidents of Argentina Category:Néstor Kirchner Category:Peronists Category:Assassination survivors",
 "title": "Cristina Fernández de Kirchner"
}