{
 "id": "929418",
 "text": "A severe and very intense drought developed across North America during mid- spring 1983. It had several strong heat waves across large sections of the United States and southern Canada. The intense heat spells and conditions of drought lasted until Autumn 1985. Several places (the Quad Cities, St. Louis, Kansas City and Cedar Rapids being some of them) recorded their all time highest temperature in these areas. ==Summary== The North American Drought of 1983–85 might have begun in April 1983. Dry conditions severely affected a number of states across the Midwest and the Great Plains. Many states also experienced a heat wave in the summer months of the first drought year. Temperatures were or higher in multiple areas. Later in 1983 and the two following years, dry conditions began affecting south-central Canada as well, particularly Alberta, Manitoba and Saskatchewan. The drought may have been caused under a weak-to-moderate La Niña. That spell may have developed during the mid-spring of 1983. ==Midwestern States== Almost all the counties in the State of Indiana and large sections in Illinois were given a drought disaster declaration because of dangerous heat spells. Very dry conditions were also present alongside the heat. In Kentucky, the Drought of 1983 was second to worst in the 20th century. A large number of trees and shrubs became dormant during the drought and heat. ==Northeastern States== From 1983 to 1985 dry conditions also affected parts of the Middle Atlantic. The drought during those two plus years affected Pennsylvania, Maryland, New Jersey, parts of New England and eastern New York State. ==Canada== In parts of south-central Canada between spring 1983 to early Autumn 1985, drought led to poor crops. That was mainly in Alberta, Manitoba and several regions of Saskatchewan. June 1983 was somewhat wet for these areas. In July it was almost the opposite. August, Autumn and the following two years were also mainly hot and dry in the same areas. ==Related heat wave== Very intense heat waves affected large areas of the United States from Spring 1983 to mid-Autumn 1985. Missouri, Illinois and Kentucky were hit by severe heat. The heat and dryness also stretched across the Southeastern and Mid Atlantic areas. They included Newark, New Jersey, Philadelphia and New York City. Other affected states were Nebraska, Iowa, Wisconsin, Minnesota and Kansas. There were 500 to 700 deaths due to the heat. ==References== Category:Natural disasters in the United States Category:Natural disasters in Canada Category:Droughts Category:1983 in the United States Category:1984 in the United States Category:1985 in the United States Category:1985 in Canada Category:1980s disasters in Canada Category:1980s in weather",
 "title": "1983–85 North American drought"
}