{
 "id": "929549",
 "text": "Plant colors are very noticeable, especially in flowering plants, and especially the color green. Plants are green because it is a functional color. They photosynthesise, and the chlorophyll they use happens to be green. However, flowering plants show many other colors. Blue is quite rare, though bluebells are a famous exception. Apparently the color is difficult to make by the usual plant biochemistry. It is also rare in animals, so if it is difficult for plants to make, presumably it is difficult for animals to make. Color can be made in two ways. There are pigments which show a particular color, and there are structural colors. Plant pigments make the plants show colors. The main pigments are: *Chlorophyll. The plant pigment, which absorbs blue and red wavelengths, and reflects green. All land plants and green algae have two types: chlorophyll a and chlorophyll b. As is well known, their function is to collect light in photosynthesis. *Carotenoids are red, orange, or yellow. *Betalains are red or yellow pigments. *Anthocyanins (\"flower blue\") are water-soluble pigments that look red to blue, according to pH. There are also structural colors, although they are less common. They are caused by reflecting iridescent color from a multi-layered surface. Butterfly wings are a typical example. Some particular types of animals and plants have evolved color systems which are unique. Lee DW 2007. Nature's Palette: the science of plant color. Chicago: University of Chicago Press. ISBN 978-0-226-47105-1 In the course of evolution, many other colorful molecules have been used by plants and animals. In bacteria, dinoflagellates and fungi, for instance, many other color-causing compounds have been used. Sometimes the color is just incidental, and sometimes it has a function on the life of the organism.Bandaranayake W.M. 2006. The nature and role of pigments of marine invertebrates. Natural Product Reports. 23 (2): 223–55. At first, no animals existed which could see colors. At that stage, colors on plants, etc. were incidental by-products of their physiology. The evolution of color vision undoubtedly had an effect on the colors of plants and animals, but we have little evidence of this early stage. We know from the plants and animals of today that color vision is very important. == Related pages == *The subject of bioluminescence is treated separately. == References == Category:Color",
 "title": "Plant colour"
}