{
 "id": "929559",
 "text": "The Second intifada was a Palestinian uprising against Israeli occupation. The period of the Second Intifada is marked from September 2000 until February 2005, even though opinions may differ about when it ended. An Intifada is an uprising or \"the shaking of\" against a power. The Second Intifada was more violent than the first. The second Intifada is considered part of the Israeli- Palestinian conflict and it was succeeded by the First (Palestinian) Intifada that lasted from 1987 until 1993. == Causes and the start == After the First Intifada ended in 1993, there was still a lot of discontent among the Palestinians. They disagreed with how the Oslo Accords were followed by Israel. The Palestinians thought these accords would mean the end of the Israeli occupation, in reality this did not happen. When the Israeli premier Ariel Sharon visited the Temple Mount, where, among other things, the Al-Aqsa Mosque is placed, it was the last straw for the Palestinians. This is why some people also call this uprising the 'Al-Aqsa Intifada'. The cause of the Second Intifada was years of building tension between Israel and Palestine. A reason why it erupted so quickly was because the Palestinian politician Yasser Arafat suggested that it would improve the conditions for the Palestinians. The Second Intifada began with Palestinian demonstrations. These started in Jerusalem, but quickly spread to the West Bank. In the beginning, the Palestinians mostly threw rocks and were not obedient towards the Israelis; the Israelis were heavily armed. This caused more tension between the two parties, and this led to more violence: after one month, 141 Palestinians and 12 Israelis were killed. Many incidents happening on both sides caused even more friction. An example of these incidents is Muhammad al-Durrah, the Palestinian boy who hid behind his father but eventually got shot and killed, all caught on camera. Compared to the First Intifada, in the Second Intifada, the Palestinians used other, more deadly tactics. Some of them were suicide bombings, snipers, and rocket attacks. These increased forms of violence began after the heavy resistance by Israeli forces in the beginning. === West Bank barrier === In 2002, during the Second Intifada, the Israeli government decided to build a barrier between Israel and the West Bank. This was to protect the Israeli citizens from Palestinian suicide attacks, which occurred often in this period. === Withdraw from Gaza === Another important event during the Second Intifada was the Israeli withdrawal from the Gaza Strip. This happened after things escalated between Hamas and the Israeli occupiers, which resulted in many deaths on both sides. Israeli Prime Minister Ariel Sharon saw the dangers of the occupation and wanted to disengage. This would be the safest option for Israel. His first announcement of disengaging was in 2003. The disengagement only started in 2005. Israel withdrew its settlements and settlers from Gaza. Ever since, the Gaza Strip has been blocked by Israel. This restricts the movement of goods and people and causes a humanitarian crisis in the Gaza Strip. == The ending and aftermath == In 2005, after more than 5 years, the Second Intifada ended. In 2004, the intensity of the uprising was already fading. This was because the Palestinians became weary, struggling against the strong, lasting Israeli defense. The Second Intifada was more violent than the first one, causing over 3000 Palestinian and nearly 1000 Israeli deaths. == References == Category:Arab–Israeli conflict Category:2000 in Asia Category:2001 in Asia Category:2002 in Asia Category:2003 in Asia Category:2004 in Asia Category:Palestinian nationalism",
 "title": "Second Palestinian Uprising"
}