{
 "id": "929556",
 "text": "The Eurovision Song Contest 2023 was the 67th edition of the Eurovision Song Contest. The competition was held in Liverpool, United Kingdom. Thirty-seven countries took part overall. The winner was Loreen, representing Sweden with the song \"Tattoo\". This is the second time she has won the contest. She first won in 2012. == Hosting == Ukraine won the 2022 contest, represented by Kalush Orchestra, but it was unable to host the competition due to the Russian invasion of Ukraine. For this reason, the UK hosted the contest as they were the runners-up in 2022. The contest was held at the Liverpool Arena. There were two semi-finals on 9 and 11 May, and the final on 13 May 2023. In total, 37 countries competed. The two semi-finals were hosted by Hannah Waddingham, Julia Sanina and Alesha Dixon, who all returned to host the final alongside Graham Norton. == Changes to the contest == * In November 2022, it was announced by the European Broadcasting Union that the results of the two semi- finals would be decided by a public vote only. * The EBU also introduced a \"Rest of the World\" vote. This allowed viewers from non-competing countries to vote in the contest under one category. This meant that there were now 38 televotes and 37 juries. == Overview == As per the rules of Eurovision, the Grand Final will consist of 26 countries. These include the previous winning country (Ukraine), the Big Five countries (France, Germany, Italy, Spain and the United Kingdom) and ten countries from each semi-final. === Semi-final 1 === The first semi-final took place on 9 May 2023 at 20:00 BST (21:00 CEST). Fifteen countries participated in the first semi-final, from which ten went to the final. Those countries plus France, Germany and Italy, as well as countries not participating in the contest under a combined \"Rest of the World\" vote, voted in this semi-final. The ten countries with the most votes went to the final. Results of the first semi-final of the Eurovision Song Contest 2023 Country Artist Song Points Place 1 Norway Alessandra \"Queen of Kings\" 102 6th 2 Malta The Busker \"Dance (Our Own Party)\" 3 15th 3 Serbia Luke Black \"Samo mi se spava\" 37 10th 4 Latvia Sudden Lights \"Aijā\" 34 11th 5 Portugal Mimicat \"Ai coração\" 74 9th 6 Ireland Wild Youth \"We Are One\" 10 12th 7 Croatia Let 3 \"Mama ŠČ!\" 76 8th 8 Switzerland Remo Forrer \"Watergun\" 97 7th 9 Israel Noa Kirel \"Unicorn\" 127 3rd 10 Moldova Pasha Parfeni \"Soarele și luna\" 109 5th 11 Sweden Loreen \"Tattoo\" 135 2nd 12 Azerbaijan TuralTuranX \"Tell Me More\" 4 14th 13 Czechia Vesna \"My Sister's Crown\" 110 4th 14 Netherlands Mia Nicolai and Dion Cooper \"Burning Daylight\" 7 13th 15 Finland Käärijä \"Cha Cha Cha\" 177 1st === Semi-final 2 === The first semi-final took place on 11 May 2023 at 20:00 BST (21:00 CEST). Sixteen countries participated in the second semi-final, from which ten went to the final. The semi-final countries plus Spain, Ukraine and United Kingdom, as well as countries not participating in the contest under a combined \"Rest of the World\" vote, voted in this semi-final. The ten countries with the most votes went to the finall. Results of the second semi-final of the Eurovision Song Contest 2023 Country Artist Song Points Place 1 Denmark Reiley \"Breaking My Heart\" 6 14th 2 Armenia Brunette \"Future Lover\" 99 6th 3 Romania Theodor Andrei \"D.G.T (Off and On)\" 0 15th 4 Estonia Alika Milova \"Bridges\" 74 10th 5 Belgium Gustaph \"Because of You\" 90 8th 6 Cyprus Andrew Lambrou \"Break a Broken Heart\" 94 7th 7 Iceland Diljá \"Power\" 44 11th 8 Greece Victor Vernicos \"What They Say\" 14 13th 9 Poland Blanka Stajkow \"Solo\" 124 3rd 10 Slovenia Joker Out \"Carpe Diem\" 103 5th 11 Georgia Iru \"Echo\" 33 12th 12 San Marino Piqued Jacks \"Like an Animal\" 0 16th 13 Austria Teya & Salena \"Who the Hell is Edgar?\" 137 2nd 14 Albania Albina & the Kelmendi Family \"Duje\" 83 9th 15 Lithuania Monika Linkytė \"Stay\" 110 4th 16 Australia Voyager \"Promise\" 149 1st === Final === The final took place on 13 May 2023 at 20:00 BST (21:00 CEST). Twenty-six countries participated in the final. These were the twenty countries that passed the semi-finals, and six other countries: the Big Five (France, Spain, Italy, Germany and the United Kingdom) and previous winner Ukraine. Groups of music professionals from all 37 participating countries ranked the songs and each country's national jury awarded 12 points to their favourite song, 10 to their second favourite and 8 to 1 to their third to tenth favourite songs. After all the songs had performed, a televote was held in each of the 37 countries plus one 'Rest of the World' block. Each of the 38 televotes awarded 12 points to the song that ranked first, 10 to the song that ranked second and 8 to 1 to the songs that ranked third to tenth. The winner was the song with the most points overall. The winner was Sweden with the song \"Tattoo\", placing first in the jury vote, second in the televote and first in the combined ranking. It was performed by Loreen, who had already won Eurovision 2012 with the song \"Euphoria\". Loreen became the second performer to win the contest twice, after Johnny Logan. Sweden won the contest for the seventh time, tying Ireland's record for the most wins in the contest. The other countries in the Top Five were Finland, Israel, Italy and Norway. Results of the final of the Eurovision Song Contest 2023 Country Artist Song Points Place 1 Austria Teya & Salena \"Who the Hell Is Edgar?\" 120 15th 2 Portugal Mimicat \"\" 59 23rd 3 Switzerland Remo Forrer \"Watergun\" 92 20th 4 Poland Blanka \"Solo\" 93 19th 5 Serbia Luke Black \"\" 30 24th 6 France La Zarra \"\" 104 16th 7 Cyprus Andrew Lambrou \"Break a Broken Heart\" 126 12th 8 Spain Blanca Paloma \"Eaea\" 100 17th 9 Sweden Loreen \"Tattoo\" 583 1st 10 Albania Albina & the Kelmendi Family \"\" 76 22nd 11 Italy Marco Mengoni \"\" 350 4th 12 Estonia Alika \"Bridges\" 168 8th 13 Finland \"Cha Cha Cha\" 526 2nd 14 Czechia Vesna \"My Sister's Crown\" 129 10th 15 Australia Voyager \"Promise\" 151 9th 16 Belgium Gustaph \"Because of You\" 182 7th 17 Armenia Brunette \"Future Lover\" 122 14th 18 Moldova Pasha Parfeni \"\" 96 18th 19 Ukraine Tvorchi \"Heart of Steel\" 243 6th 20 Norway Alessandra \"Queen of Kings\" 268 5th 21 Germany Lord of the Lost \"Blood & Glitter\" 18 26th 22 Lithuania Monika Linkytė \"Stay\" 127 11th 23 Israel Noa Kirel \"Unicorn\" 362 3rd 24 Slovenia Joker Out \"\" 78 21st 25 Croatia Let 3 \"\" 123 13th 26 United Kingdom Mae Muller \"I Wrote a Song\" 24 25th == Split voting results == During the Final, each national jury awarded their points individually. Once the jury ranking was complete, the televote points were added in ascending order, from the country that received the fewest jury points up to the country that received the most. Place Combined Jury vote Televote Country Points Country Points Country Points 1 Sweden 583 Sweden 340 Finland 376 2 Finland 526 Israel 177 Sweden 243 3 Israel 362 Italy 176 Norway 216 4 Italy 350 Finland 150 Ukraine 189 5 Norway 268 Estonia 146 Israel 185 6 Ukraine 243 Australia 130 Italy 174 7 Belgium 182 Belgium 127 Croatia 112 8 Estonia 168 Austria 104 Poland 81 9 Australia 151 Spain 95 Moldova 76 10 Czechia 129 Czechia 94 Albania 59 11 Lithuania 127 Lithuania 81 Cyprus 58 12 Cyprus 126 Armenia 69 Belgium 55 13 Croatia 123 Cyprus 68 Armenia 53 14 Armenia 122 Switzerland 61 France 50 15 Austria 120 Ukraine 54 Lithuania 46 16 France 104 France 54 Slovenia 45 17 Spain 100 Norway 52 Czechia 35 18 Moldova 96 Portugal 43 Switzerland 31 19 Poland 93 Slovenia 33 Estonia 22 20 Switzerland 92 Moldova 20 Australia 21 21 Slovenia 78 Albania 17 Serbia 16 22 Albania 76 United Kingdom 15 Austria 16 23 Portugal 59 Serbia 14 Portugal 16 24 Serbia 30 Poland 12 Germany 15 25 United Kingdom 24 Croatia 11 United Kingdom 9 26 Germany 18 Germany 3 Spain 5 ==References== ==Notes== ==Other websites== * 2023 Category:2023 in music Category:2023 in England Category:May 2023 events Category:Liverpool",
 "title": "Eurovision Song Contest 2023"
}