{
 "id": "929639",
 "text": "The Quill Award was an American literary award that ran for three years in 2005-2007. it was created to inspire reading while promoting Literacy. == Winners (2007) == * Book of the year: Angels Fall, Nora Roberts * Audio book: To Kill a Mockingbird, Harper Lee (read by Sissy Spacek) * General fiction: Cormac McCarthy * Romance: Angels Fall, Nora Roberts * Biography/memoir: Einstein: His Life and Universe, Walter Isaacson == Winners (2006) == * Book of the Year: Don't Make a Black Woman Take off Her Earrings: Madea's Uninhibited Commentaries on Love and Life, Tyler Perry * Children's Chapter Book/Middle Grade: Lemony Snicket * Young Adult/Teen: Eldest, Christopher Paolini * Graphic Novel: Naruto, Volume 7, Masashi Kishimoto * Poetry: Amazing Peace: A Christmas Poem, Maya Angelou * Romance: Blue Smoke, Nora Roberts * Cooking: Rachael Ray 365: No Repeats: A Year of Deliciously Different Dinners, Rachael Ray * Health/Self Improvement: It's Not Easy Being Green: And Other Things to Consider, Jim Henson * History/Current Events/Politics: An Inconvenient Truth, Al Gore * Humor: Don't Make a Black Woman Take off Her Earrings: Madea's Uninhibited Commentaries on Love and Life, Tyler Perry * Sports: Get Your Own Damn Beer, I'm Watching the Game!: A Woman's Guide to Loving Pro Football, Holly Robinson Peete * Variety Blockbuster Book to Film: The Devil Wears Prada and its film adaptation author Lauren Weisberger and director david frankel == Winners (2005) == * Book of the Year: Harry Potter and the Half-Blood Prince, J. K. Rowling, * Poetry: Let America Be America Again: And Other Poems, Langston Hughes * Religion and Spirituality: Peace is the Way: Bringing War and Violence to an End, Deepak Chopra * Cooking: Rachael Ray's 30-Minute Get Real Meals: Eat Healthy Without Going to Extremes, Rachael Ray * Humor: The Daily Show with Jon Stewart Presents America: A Citizen's Guide to Democracy Inaction, Jon Stewart and the Writers of The Daily Show The foundation awarded a Quills Corporate Literacy Award to Verizon for its support of Literacy programs in the United States == References == == Other websites == * Category:Literary awards Category:2005 establishments in the United States Category:2008 disestablishments in the United States",
 "title": "Quill Award"
}