{
 "id": "930089",
 "text": "Nazi concentration camps were death camps and forced labour camps operated by Nazi Germany during the Second World War. There were 27 main camps and at least 1,100 smaller camps in Nazi Germany and the territories it occupied. The five Nazi death camps were Chełmno, Belzec, Sobibor, Treblinka, and Auschwitz- Birkenau. Around 2.7 million Jews were murdered in these five camps. In other concentration camps, labor camps, and ghettos, the Nazis murdered an additional 800,000 to 1,000,000 Jews. Half a million non-Jews were also murdered in Nazi concentration camps, including 5,000 to 10,000 LGBT people. The camps were a key part of the Holocaust and Adolf Hitler's Final Solution. == Purposes == === Mass murder === The death camps' purpose was to mass-murder Jews as quickly and efficiently as possible (along with others who were \"inferior\" or \"undesirable\" according to the Nazis). Gas chambers at the camps made it possible for the Nazis to kill hundreds of people at a time. Thanks to the death camps, the Nazis were able to kill people 10 times more quickly than in other genocides in history (according to a 2019 study). In a 100-day period between August and September 1942, the Nazis killed over 1.47 million Jews, mostly at death camps. One out of every four Jews who died in all 6 years of World War II were killed during this 100-day period. In some areas, more than 99.9% of the Jewish population was murdered in camps. Many people were killed as soon as they arrived at the death camps. Prisoners who were 'selected' to live (so they could do slave labor) were not expected to live more than a few months. === Other purposes === The Nazi concentration camps had other purposes too. These included: * Imprisoning and punishing \"enemies of the Reich\" * Collecting, isolating, and controlling people who might pose a threat to the Nazis * Using prisoners for free slave labor * Killing Jews through work, disease, freezing weather, starvation, or other terrible conditions * Using prisoners for medical experiments (like Dr. Josef Mengele did at Auschwitz) * Stealing property from Jews (who were often encouraged to bring their most valuable things with them) * Eliminating the \"undesirable\" races from Europe == Victims == === Jewish victims === The concentration camps were part of the Nazis' plan to kill every Jew in Europe. The five Nazi death camps were Auschwitz-Birkenau (where over a million Jews were murdered), Chełmno, Belzec, Sobibor, and Treblinka. Almost all victims of these camps were Jews. In these five camps, the Nazis murdered around 2.7 million Jews. The Nazis also murdered 800,000 to 1,000,000 Jews in labor camps, concentration camps, and ghettos (like the Warsaw Ghetto). === Non-Jewish victims === The Nazis murdered half a million non-Jews in concentration camps. Jews were most commonly the victims of the Nazi concentration camps. However, the Nazis believed there were many other \"undesirable\" groups. These included (among others): * Slavs * Soviet prisoners of war * Communists, socialists, pacifists, trade unionists, and others who disagreed with Nazism * Members of pacifist religious sects like the Jehovah's Witnesses * LGBT people * Black people * People with disabilities * Alcoholics, drug addicts, homeless people, and beggars * People suspected of rassenschande (\"racial defilement,\" meaning sex between \"Aryans\" and Jews) * Non-Jews who refused to divorce their Jewish spouses === Conditions === Most inmates were brought to the camps in cattle cars. When they arrived, the Nazis 'selected' which prisoners would be killed right away and which would be allowed to live (and work as slaves). Some groups were often selected for immediate execution: children, pregnant women, elderly people, people with disabilities, and anyone who looked weak or sick. The Nazis took all of the prisoners' belongings, shaved their heads, assigned them numbers, and made them wear uniforms with badges on them. Conditions in the camps were cruel, inhumane, and deadly. Prisoners were starved and denied water. They were worked brutally, sometimes to death. The camps were extremely overcrowded, and diseases were very common. There was no sanitation or real health care. People who could not work were killed. === Notable camps === The five Nazi death camps were Chełmno, Belzec, Sobibor, Treblinka, and Auschwitz- Birkenau (which included a separate women's section). Other major concentration camps included: *Auschwitz I (which had a children's section) and Auschwitz III Monowitz (a labor camp) *Bergen-Belsen (which had a women's camp and held many children, including Anne Frank) *Buchenwald *Dachau (the first Nazi concentration camp to exist, opened in March 1933) *Jasenovac (a camp in Croatia run by the Ustase) *Mauthausen *Ravensbruck (a camp for women which had many female guards) *Sachsenhausen *Theresienstadt (which had a separate section for children) == Photo gallery == Image:Freight car, Auschwitz II-Birkenau, 2014.jpg|Prisoners were deported to concentration camps in cattle cars like these Image:Toaletter på auschwitz 2.jpg|Latrines like this made sanitation impossible Image:Female prisoners at Birkenau.jpg|Female prisoners at Birkenau after being shaved and given uniforms Image:Bundesarchiv Bild 183-H26996, KZ Dachau, Verbrennungsofen.jpg|Former Dachau Sonderkommando show how they had to burn corpses in crematorium ovens Image:Auschwitz Resistance 282 cropped.JPG|March to the gas chambers, one of the Sonderkommando photographs Image:Birkenau a group of Jews walking towards the gas chambers and crematoria.jpg|New arrivals at Birkenau walk towards the gas chambers Image:Children headed for deportation.JPG|Jewish children being deported to the Chełmno extermination camp Image:Buchenwald Slave Laborers Liberation.jpg|right|Buchenwald concentration camp five days after liberation == Related pages == *List of Nazi concentration camps *Nazi extermination camps *Nazi concentration camp badges *Female guards in Nazi concentration camps *Nazi Germany *The Holocaust *The Final Solution *Ghettos in Europe during World War II *Antisemitism *Nazi concentration camps in Norway == References == * Category:The Holocaust Category:History Category:World War II Category:Nazi Germany Category:War crimes Category:Crimes against humanity Category:Crimes against prisoners of war",
 "title": "Nazi concentration camp"
}