{
 "id": "930024",
 "text": "Carmelo Cedrún Ochandátegui (born 6 December 1930) is a Spanish former football goalkeeper and manager. Carmelo was born on December 6, 1930, in Amorebieta, Spain. He played as a goalkeeper, which means he tried to stop the ball from going into the goal. He started playing for a small team called Amorebieta. Then he played for a long time for a big team called Athletic Bilbao. Later, he played for Español and even a team in America called the Baltimore Bays. Carmelo also played for the Spanish national team and played 13 times for his country. After he stopped playing, Carmelo became a coach. He coached many different teams, including Durango, Barakaldo, Logroñés, Cultural Leonesa, Celta, Murcia, Jaén, and Linense. ==Club career== Carmelo Cedrún was born in Amorebieta, Spain. He started playing football for a big team called Athletic Bilbao. He played his first game for them on April 15, 1951, and his team won 3–0 against Sevilla FC. Very quickly, he became the main goalkeeper. In the 1955–56 season, his team, Athletic Bilbao, won the league championship, called La Liga. Carmelo only let 31 goals go past him in 30 games. He played in 402 official games for Athletic Bilbao over 14 years. In 1964, Carmelo stopped being the main goalkeeper because another great player, José Ángel Iribar, took his place. So, Carmelo moved to another team called RCD Español. He became the main goalkeeper there again. Carmelo retired from playing football at the age of 38 in the United States with a team called the Baltimore Bays. A few months after he stopped playing, Carmelo started to coach football teams. He began with small teams in his region, like SCD Durango and Barakaldo CF. Most of his coaching career was with lower league teams, but he did coach one top division team, RC Celta de Vigo, during the 1976–77 season. That year, the team finished second from the bottom. ==International career== Carmelo Cedrún played 13 games for the Spain national team. He played his first game for Spain on March 14, 1954. In that game, Spain was trying to qualify for the 1954 FIFA World Cup and played against Turkey. Spain won 4–2 overall, but after a tied third match, they lost because of a random drawing. Carmelo was also chosen to play in the 1962 World Cup. He played in two out of three games, but Spain didn't go past the group stage. ==Personal life== Carmelo Cedrún's son, Andoni, was also a football player and a goalkeeper, just like his dad. Andoni played for Athletic Bilbao too, but he became more famous when he played for another team called Real Zaragoza. Carmelo's younger brother, Serafin, was also a goalkeeper.Cedrún: Serafín Cedrún Ochandategui, BDFutbol His nephew, Carmelo Mardaras, was a defender and played for a team called Barakaldo.Carmelo: Carmelo Mardaras Cedrún, BDFutbolCarmelo, una década de leyenda [Carmelo, a decade of legend], Histórico Barakaldo C.F., 21 January 2017 (in Spanish) Carmelo's great-nephew, Markel Areitio, who is Serafin's grandson, was also a goalkeeper and trained at Athletic Bilbao. ==Honours== Athletic Bilbao *La Liga: 1955–56 *Copa del Generalísimo: 1955, 1956, 1958 ==References== ==Other websites== * * * * *Spain stats at Eu-Football *Biography at Porteros Vascos de Leyenda Category:1930 births Category:Living people Category:Spanish footballers Category:Spanish football managers",
 "title": "Carmelo Cedrún"
}