{
 "id": "930057",
 "text": "A Venetian water fete (also known as Una festa Veneziana sull'acqua or Un baccanale di Venezia) is a 19th-century painted in oil on canvas made by Antonio Rotta, in 1863, in Venice, Italy. The artwork measures centimeters 172 x 106 (41.7 x 67.7 in.). Antonio Rotta, A party in Venice, Rotta, Antonio (1828-1903) - Dipinti - Gelatina/ vetro, Fondazione Musei Civici di Venezia Antonio Rotta's work \"A Venetian water fete\" was auctioned in 2001 at Sotheby's in London and acquired by an English collector for € 158.000 plus auction fees. A Venetian water fete, Antonio Rotta, Sotheby's in London, Sotheby's – official website Antonio Rotta is one of the most famous painters in the Italian history of genre painting, compared to a poet of the Venetian ballads, he describes the everyday life and feelings of the Venice at this epoque. Rotta has created 3 other similar works that make up a cycle of boat parties in Venice and recall the still current existence of the Redentore feast. == Description == The art work describes the typical Venetian festival, probably during the Feast of the Redeemer, with two boats side by side and musicians in the Venice lagoon in Italy. == Exhibition == * 1873 Vienna World's Fair Un baccanale di Venezia, Antonio Rotta, Official Proceedings of the Universal Exhibition of Vienna of 1873, General Catalog of Italian Exhibitors, Italy. Jury for the Vienna Universal Exhibition, 1873 == Related pages == * Genre painting * The Hopeless Case (Rotta) * The little girl found in Venice (Rotta) == Bibligoraphy == * Fremont Rider, Rider's California, A Guide-book for Travelers, 1927, Pubblisher Frederic Taber Cooper, Fremont Rider, p. 103, University of California * Atti ufficiali della Esposizione universale di Vienna del 1873, Catalogo generale degli espositori italiani, Italy. Giuria per la Esposizione universale di Vienna, 1873 == References == == Other websites == * A Venetian water fete, Antonio Rotta, Sotheby's in London, Sotheby's – official website * A Venetian water fete, Rotta, Antonio (1828-1903) - Dipinti - Gelatina/ vetro, Fondazione Musei Civici di Venezia Category:Paintings by Antonio Rotta Category:1860s paintings",
 "title": "A Venetian water fete (Rotta)"
}