{
 "id": "930011",
 "text": "The 2022–23 season is scheduled to be the 124th in the history of FC Bayern Munich and their 58th consecutive season in the top flight. The club will participate in Bundesliga, DFB-Pokal, DFL-Supercup and UEFA Champions League. ==Players== ===Squad=== ==Transfers== ===In=== Player Transferred from Fee Date Source – Juventus U16 – Türkgücü München Antonio Tikvic verstärkt FC Bayern Amateure FC Bayern. May 2022. Retrieved 17 November 2022. 40 Ajax Free transfer 38 €18,500,000 17 Liverpool €32,000,000 32 Anderlecht Loan return 15 1899 Hoffenheim 33 Werder Bremen 39 Sunderland – Holstein Kiel – Midtjylland €1,200,000; will join Bayern Munich U17 – Hertha BSC U17 €1,000,000; will join Bayern Munich U19 FC Bayern verpflichtet Top-Talent Noel Aseko Nkili FC Bayern, 13 July 2022. Retrieved 17 November 2022 (in German) 4 Juventus €67,000,000 39 Rennes €20,000,000 FC Bayern verpflichtet Mathys Tel FC Bayern, 16 July 2022. Retrieved 17 November 2022 (in German) – Barcelona Free transfer, will join Bayern Munich U17 FC Bayern verpflichtet Nachwuchsspieler Adam Aznou FC Bayern, 28 July 2022. Retrieved 17 November 2022 (in German) – Dunkerque Free transfer, will join Bayern Munich II – Hearts of Abuja Undisclosed, will join Bayern Munich II FC Bayern verpflichtet Daniel Francis und leiht ihn Klagenfurt FC Bayern, 4 August 2022. Retrieved 17 November 2022 (in German) – Pohang Steelers Undisclosed, will join Bayern Munich II FC Bayern verpflichtet Hyunju Lee fest FC Bayern, 9 August 2022. Retrieved 17 November 2022 (in German) – Dinamo Tbilisi €240,000; will join Bayern Munich II – 1. FC Köln Loan return – Sagan Tosu €400,000; will join Bayern Munich II in January 2023 FC Bayern verpflichtet japanisches Talent Taichi Fukui – Atlético Madrid Free transfer, will join Bayern Munich U19 in January 2023 – Whitecaps FC 2 Loan return 23 Ajax Free transfer 27 Borussia Mönchengladbach €8,000,000 – Erzgebirge Aue Loan return 22 Manchester City Loan – Austria Klagenfurt Loan return – VfB Stuttgart U19 Free transfer, will join Bayern Munich II in July 2023 – NK Osijek U17 Undisclosed, will join Bayern Munich U17 in July 2023 :Total spending: €148,340,000 ===Out=== Player Transferred to Fee Date Source 4 Borussia Dortmund Free transfer – Rapid Wien €500,000 – SpVgg Unterhaching Free transfer – Retired Amateure-Kapitän Feldhahn kündigt Karriereende an 22 Leeds United €12,000,000 24 Lyon Free transfer 32 Antwerp €1,400,000 33 Lugano €1,600,000 Lars Lukas Mai signs for FC Lugano 36 Austria Wien €500,000 Goalkeeper departures from FC Bayern Früchtl joins Austria Vienna, Hoffmann moves to Braunschweig 37 Utrecht Free transfer FC Bayern Amateure verabschieden drei Spieler zum Saisonende 39 Eintracht Braunschweig Free transfer – 1. FC Magdeburg Loan – Erzgebirge Aue 47 Greuther Fürth €50,000 – 1. FC Saarbrücken Loan – Austria Lustenau – Holstein Kiel Free transfer Jann-Fiete Arp moves to Holstein Kiel – Fortuna Sittard Undisclosed Vita wechselt zu Fortuna Sittard FC Bayern, 22 May 2022. Retrieved 17 November 2022. (in German). – Heerenveen €550,000 – Whitecaps FC 2 Loan – Juventus U19 Free transfer 3 Nottingham Forest €8,500,000 37 Rangers Loan 9 Barcelona €45,000,000 Transfer complete - Robert Lewandowski leaves FC Bayern FC Bayern, 19 July 2022. Retrieved 17 November 2022 (in German) – Jahn Regensburg Loan Sarpreet Singh verlängert und wird verliehen FC Bayern, 27 July 2022. Retrieved 17 November 2022 (in German) 15 Crystal Palace €12,000,000 – Austria Klagenfurt II Loan 23 Sevilla €16,000,000 43 Excelsior Free transfer 28 Vitesse Loan 32 Bologna €8,500,000 – Hannover 96 Loan – Austria Klagenfurt – Cosenza 18 Manchester United – Grazer AK – – Rheindorf Altach – Blau-Weiß Linz Undisclosed :Total income: €106,600,000 ===Transfer summary=== Undisclosed fees are not included in the transfer totals. Expenditure Summer: €140,100,000 Winter: €8,000,000 Total: €148,100,000 Income Summer: €106,600,000 Winter: €0,000,000 Total: €106,600,000 Net totals Summer: €33,500,000 Winter: €8,000,000 Total: €41,500,000 ==Pre-season and friendlies== ==Competitions== ===Overall record=== ===Bundesliga=== ====League table==== ====Results summary==== ====Results by round==== ====Matches==== ===DFB-Pokal=== ===DFL-Supercup=== ===UEFA Champions League=== The group stage draw will be held on 25 August 2022. ==Notes== ==References== Category:2022–23 in European football Category:Football in Germany Category:FC Bayern Munich seasons Category:2022 in German sport",
 "title": "2022–23 FC Bayern Munich season"
}