{
 "id": "930611",
 "text": "Pikwik Pack is a American-Canadian animated children's television series. ==Production== Pikwik Pack was created by Mary Bredin, Frank Falcone and Rachel Reade Marcus. It was produced by Corus Entertainment and Guru Studio. The series premiered on Disney Junior in the United States on November 7, 2020, and on Treehouse TV in Canada on December 26, 2020 and of United Kingdom on Tiny Pop. It will air on TruTv for kids on July 15, 2023. It will return to the United States to premiere on TLC on Sunday, May 16 2023, as a part of the TLC for kids block. ==Premise== The Pikwik Pack includes four colorful animal friends. Suki is a thoughtful hedgehog, Axel is a fearless raccoon, Tibor is a reliable hippo, and Hazel is an adventurous cat. They travel by land, sea, and air in their various vehicles to deliver packages. The difficulty can be rough rapids, stormy skies, or a foggy forest, but when the Pikwik Pack work together, they always deliver! ==Characters== ===Main=== * Suki (voiced by Emma Ho), a emerald hedgehog who is the leader of the Pikwik Pack. She is responsible, thoughtful, and organized. Suki's vehicle is a boat. * Axel (voiced by Daniel Pathan), a blue raccoon. He is funny, fearless, and likes going fast. Axel's vehicle is a truck. * Hazel (voiced by Molly Lewis), a silly and adventurous orange cat. She is cheerful, energetic and silly. Hazel's vehicle is a helicopter. * Tibor (voiced by Jacob Soley), a purple hippo. He is strong, reliable and loves to keep things on track. Tibor's vehicle is a train. ===Secondary=== * Captain Kate (voiced by Deann DeGruijter) * Grandpa Grok (voiced by Brad Adamson) * Edgar (voiced by Taylor Puterman) * Cosmo (voiced by Ian Ho) * William (voiced by Glee Dango) * Farmer Frances (voiced by Cory Doran) * Croc (voiced by Brad Adamson) * Chipper (voiced by Markeda McKay) * Tila (voiced by Glee Dango) * Willow (voiced by Taylor Puterman) * Beverly Beaver (voiced by Stacey DePass) * Professor Hoot (voiced by Ron Rubin) * Hugo (voiced by Ron Rubin) * Paulina (voiced by Shoshana Sperling) * Wally (voiced by Brad Adamson) * Markieff Moose (voiced by Rob Tinkler) * Laurence O’Llama (voiced by Rob Tinkler) * Oscar (voiced by Ian Ho) * Rosco (voiced by Juan Chioran) * Maddy Rhino (voiced by Michela Luci) * Brando Beaver (voiced by Christian Potenza) * Allie Armadillo (voiced by Shoshana Sperling) * Polly Polar Bear (voiced by Zarina Rocha) * Petra Penguin (voiced by Zarina Rocha) * Percy Penguin (voiced by Ian Ho) * Peter Polar Bear (voiced by Rob Tinkler) * Patrick Polar Bear (voiced by Rob Tinkler) * Bison Bros (voiced by Christian Potenza) * Mama Polar Bear (voiced by Julie Lemieux) * Henrietta Hare (voiced by Maya Misaljevic) * Winston (voiced by Callum Shoniker) * Loni (voiced by Davide Fair) * Papa Wolf (voiced by Joshua Graham) * Benjamin Beaver (voiced by Rob Tinkler) * Billy Beaver (voiced by Rob Tinkler) * Bobby Beaver (voiced by Rob Tinkler) * Benny (voiced by Ron Rubin) * Squick (voiced by Linda Ballantyne) * Squack (voiced by Samantha Swan) * JJ Giraffe (voiced by Roman Pesino) * Calvin (voiced by Brad Adamson) * Rafi (voiced by Christian Potenza) * Basil (voiced by Rob Tinkler) * Dougie Duck (voiced by Rob Tinker) ===Pikwik GameTime Characters=== *The Children (CV: Various) is a group of off-screen children who interact with the four characters, say yes or no and shout out the answer. ===Other supporting characters=== No one! == Episodes == ===Season One=== ==Film== Pikwik Pack: The Movie: Just Believe is a movie based on Pikwik Pack. ===Film Premise=== Carter, does not feel relaxed in Relaxing Ridge. Meanwhile, the Pikwik Pack must get to Relaxing Ridge, which is higher than they’ve ever gone before(save “Above and Beyond”). Then, the team must go along the Towering River. Suki, Axel, and Tibor do not think the team has the will to sail up the river, but Hazel tries to teach them that you can do anything - so long if you believe in yourself, and Suki, Axel, and Tibor get the message and to Relaxing Ridge with the impossible - not a single obstacle. Meanwhile, an unnamed shark wants to clear the Towering River without a single obstacle, just like the Pikwik Pack, yet he keeps falling down to the bottom of the river, and also gets Hazel’s message, and the shark sings a song called You Are The Magic. He FINALLY makes it to Relaxing Ridge, making the delivery, reprising You Are The Magic after that, and ending the film. \"You are the Magic\" is composed by Inabakumori and performed by the shark in the movie. ==Notes== ==References== ==Other websites== * on Disney Junior * Category:2020 television series debuts Category:Canadian children's television series Category:2020s comedy television series Category:Fantasy television series Category:Canadian animated television series Category:English-language television programs Category:2020 American television series debuts Category:2020s American animated television series Category:2020 Canadian television series debuts Category:2021 Canadian television series endings",
 "title": "Pikwik Pack"
}