{
 "id": "9307",
 "text": "Istanbul, formerly known as Constantinople, is a mega city that sits in both Europe and Asia, divided by the Bosporus. Although it is the largest city of Turkey, it is not the capital. It is the largest city in Europe by population. It is also the 3rd largest European city in size. It was the capital city of the old Ottoman Empire until 1923. The city has been known since ancient times by the older names Byzantium and Constantinople (; , Konstantinoúpolis). Being a seaport, Istanbul is the main trade center of Turkey. Part of Istanbul is a UNESCO World Heritage Site. Istanbul faces the Golden Horn and the Bosporus strait. The Bosphorus connects the Black Sea and the Sea of Marmara, and separates Europe and Asia. It's the only city around the world that is on two different continents. The city is actually in both Europe and Asia. One-third of the people live on the Asian side. Its population is between 11 and 15 million people, making it one of the largest cities in Europe. Many people migrate to Istanbul every year. In 2023, Istanbul was the city with the most international arrivals. Its original name was Byzantion in the Greek language, known as Byzantium in the Latin language. Byzantium was originally settled as a colony by Greeks from Megara in 667 BC and named after their king, Byzas. In 196 AD, Byzantium was damaged by the Romans, then rebuilt by the Roman Emperor Septimius Severus. Constantine the Great thought this city was in a nice location, and in 330, moved the capital of the Empire from Rome to there, as New Rome (Latin: Nova Roma; , Nea Rómi), renaming the city Constantinople, after his name. When the Roman Empire was later divided into two, the East Roman Empire was known as the Byzantine Empire, and its capital was in Constantinople, where Hagia Sophia had been built. Although it was captured by Crusaders for a time, it continued as one of the political, cultural, religious, and economic centers of Europe until it was conquered by the Ottoman Turks in 1453. Istanbul became the capital of the Ottoman Empire in 1453. After the Ottoman Empire ended, the Republic of Turkey was started with its capital at Ankara. Later in 1930, Constantinople was renamed Istanbul. The Romanlar (Turkish Gypsys) have lived in Istanbul since 1054 at Sulukule, well known for their Music and Dance style. After 1453, by order of Mehmed II, Roma was settled in Istanbul from other parts of the Ottoman Empire. In some cases, they live in several Mahallas (quarters) together with Turks in Istanbul in the European and Asian parts of this city. == Notes == == References == == Other websites == * Audioguide Seslirehber Istanbul Turkey * Extensive information on Architect Sinan's works in Istanbul Category:World Heritage Sites in Turkey",
 "title": "Istanbul"
}