{
 "id": "930851",
 "text": "\"Lift Every Voice and Sing\" is a hymn. James Weldon Johnson wrote the words of the hymn. His brother, J. Rosamond Johnson wrote the music. The hymn is from the point of view of African Americans, in the late 19th century. It is a prayer of thanksgiving, faithfulness, and freedom. Images in the hymn are from the book of Exodus in the Bible, where the people are freed from slavery, and led to the \"promised land\". The song was first performed in 1900. It has been popular in Black communities since then. In 1917, the NAACP began to promote the hymn as a \"Negro national anthem\". It has been part of 42 different Christian hymnals. Different African American singers and musicians have also performed it. == History == James Weldon Johnson–Chair of the Florida Baptist Academy in Jacksonville, Florida, wanted to write a poem in memory of Abraham Lincoln's birthday. However, amid the ongoing civil rights movement; Johnson decided to write a poem which was themed around the struggles of African Americans after the Reconstruction era (including the passage of Jim Crow laws in the South). \"Lift Every Voice and Sing\" was first recited by a group of 500 students in 1900. His brother J. Rosamond Johnson later wrote music to go with the poem. After the Great Fire of 1901, the Johnsons moved to New York City to work on Broadway. In the years that followed, \"Lift Every Voice and Sing\" was sung within Black communities; Johnson wrote that \"the school children of Jacksonville kept singing it; they went off to other schools and sang it; they became teachers and taught it to other children. Within twenty years it was being sung over the South and in some other parts of the country.\" == Recognition == A sculpture by Augusta Savage named after the song was shown at the World Fair in New York in 1939. It showed children singing, and the children stood in a group which was shaped like a harp. Savage was the only Black woman asked to make something for the Fair. The sculpture was called \"The Harp\" by organizers. Small copies of it and postcards showing it were sold at the fair. Like many other things shown at the fair, it was thrown away when the fair closed.Bearden, Romare and Henderson, Harry. A History of African-American Artists (From 1792 to the Present), pp. 168–180, Pantheon Books (Random House), 1993, === As the \"Black national anthem\" === In 1919, the National Association for the Advancement of Colored People (NAACP) called \"Lift Every Voice and Sing\" the \"Negro national anthem\". It did this, because of the song's power in voicing a cry for liberation and affirmation for African American people. James Weldon Johnson would become the NAACP's first executive secretary the following year. It has also been called \"the Black national anthem\". Calling the song \"the Black national anthem\" has been criticized. Timothy Askew, an associate professor at the historically Black Clark Atlanta University, argued that the use of the term \"Black national anthem\" could incorrectly say that Black communities wanted to separate from other Americans. In his view, the words of the hymn do not overtly refer to any specific race, and \"identity should be developed by the individual himself, not by a group of people who think they know what is best for you.\" Because of this, the song has also been sung by people who are not African American. Some Conservative commentators have similarly criticized performances and references to \"Lift Every Voice and Sing\" as the \"Black national anthem\" as separatist and diminishing to \"The Star-Spangled Banner\" as the national anthem of the United States. In response to Askew's remarks, the NAACP's then-senior vice president of advocacy and policy Hilary O. Shelton told CNN that the hymn \"was adopted and welcomed by a very interracial group, and it speaks of hope in being full first-class citizens in our society\", used in conjunction with the U.S. national anthem or the Pledge of Allegiance during public events, \"It is evident in our actions as an organization and here in America it is evidence that we are about inclusion, not exclusion. To claim that we as African-Americans want to form a confederation or separate ourselves from white people because of one song is baffling to me.\" In February 2022, Representative Jim Clyburn said that he wanted \"Lift Every Voice and Sing\" to become the \"national hymn\" of the United States. === Prominence since the George Floyd protests === In mid-2020, \"Lift Every Voice and Sing\" began to receive wider public attention amid nationwide protests over the police murder of George Floyd: it was sung during demonstrations and other events which were held in solidarity. Presidential candidate Joe Biden referenced the hymn in his action plan for addressing racial disparities in the United States, which was titled \"Lift Every Voice: The Biden Plan for Black America\". On June 19, 2020, Google featured a Juneteenth-themed animation on its home page, set to a spoken word rendition of the hymn's first verse by LeVar Burton. In 2021, Vanessa Williams sung \"Lift Every Voice and Sing\" on the PBS Independence Day special A Capitol Fourth, marking the recognition of Juneteenth as a federal holiday. The hymn also began to be used in sporting events: during NASCAR's 2020 Pocono 350, musicians Mike Phillips and West Byrd quoted \"Lift Every Voice and Sing\" as part of their rendition of \"The Star-Spangled Banner\", while the National Football League announced that \"Lift Every Voice and Sing\" would be played or performed as part of the pre-game ceremonies of all Week 1 games during the 2020 season. The decision came as part of a new social justice campaign being introduced by the NFL, stemming from the league's acknowledgements of the Black Lives Matter movement, and its handling of players taking a knee during the singing of the national anthem in order to protest against racial inequality and police brutality. The NFL's opening night kickoff game featured a filmed performance of the hymn by Alicia Keys at the Los Angeles Memorial Coliseum, which was later replayed as part of the pre-game show of Super Bowl LV on February 7, 2021. The NFL stated that it would again feature the hymn at Week 1 games and other \"tentpole\" events (including the NFL Draft and playoff games) during the 2021 season. Some African American fans who were interviewed by NBC News felt that the NFL's decision was \"pandering\" that would not have a material impact on the league's pursuits of social justice. == Words == == References == == Other websites == * An omnibus collection of Johnson's poetry at Standard Ebooks * Free scores by J. Rosamond Johnson at the International Music Score Library Project (IMSLP) – including \"Lift Every Voice and Sing\" * , edited by Julian Bond and Sondra Kathryn Wilson * NPR's Performance Today page on Black History Month 2003 – includes a link to a RealPlayer version of the song * Chicago Sun-Times columnist Lynn Sweet, transcript of Rev. Lowery's Inauguration Benediction * led by Alice Walker and Dr. Rudolph Byrd at Emory University * Category:American poems Category:Articles with hAudio microformats",
 "title": "Lift Every Voice and Sing"
}