{
 "id": "930869",
 "text": "The Boeing CST-100 is a class of two partially reusable spacecraft designed to transport crew to the International Space Station (ISS) and other low-Earth- orbit destinations. It is manufactured by Boeing for its participation in NASA's Commercial Crew Program (CCP). In late 2019 the uncrewed Boeing Starliner Orbital Flight Test (Boe-OFT) launched on a Atlas V N22 and reached orbit, but the flight was not successful. NASA allowed Boeing a repeat test flight, Boe-OFT 2, which was to launch in August 2021, but was cancelled due to technical problems. OFT-2 ended up launching on 19 May 2022. ==Flight in 2024, launch with astronauts, return without astronauts== On March 18, 2025, the two astronauts of the Boeing Crew Flight Test, returned to Earth.https://www.vg.no/nyheter/i/pPvjXE/nasa-astronauter-strandet-i- verdensrommet-i-flere-maaneder-tilbake-paa-jordkloden. Retrieved 2025-03-31 As of [the first week of March 2025], the two astronauts [were] still at the ISS; However, the spacecraft came back to Earth in September 2024; The astronauts were left, on purpose, at the ISS.https://www.bangkokpost.com/world/2861172/troubled-boeing-starliner- returns-to-earth. Retrieved 2024-09-07https://www.nrk.no/urix/astronauter-pa- tur-i-atte-dager-kan-bli-sittende-fast-til-2025-1.16997988. Retrieved 2024-08-11 Earlier (July 25), media said that \"NASA and Boeing [... have not, or] have yet to set a return date\"; The spacecraft is still in dock (in Space) at the ISS.https://www.bloomberg.com/news/articles/2024-07-25/boeing-crew-s- return-from-space-station-still-in-limbo?srnd=homepage-europe. Retrieved 2024-08-01 Earlier (June 24, 2024), media said that the trip from the International Space Station (back) to Earth, had already been delayed for some days.https://www.newsweek.com/butch-wilmore-suni-williams-boeing-starliner- international-space-station-astronaut-1916530. Retrieved 2024-06-26 The space vehicle was supposed to have been back to Earth, no earlier than June 22, 2024. Earlier (June 5), the rocket was launched. On June 5, 2024, Starliner launched for the first time with humans on board as the second required flight test. ==References== Category:Spacecraft Category:NASA",
 "title": "Boeing Starliner"
}