{
 "id": "930861",
 "text": "An ongoing outbreak of mpox was confirmed on 6 May 2022 in the United Kingdom, beginning in a British resident who had travelled to Nigeria, where the disease is endemic, and while there, had symptoms of monkeypox on 29 April 2022. This person returned to the United Kingdom on 4 May, becoming the index case of the outbreak into the country. ==Background== Cases have been reported in many countries in Europe, with some in North and South America, Israel and Australia. Before the global outbreak, monkeypox was endemic in West and Central Africa. ==Response== On 20 May 2022, the World Health Organization (WHO) held an emergency meeting to discuss the outbreak. On 23 July 2022, WHO announced that the outbreak is a Public Health Emergency of International Concern. ==Vaccinations== The smallpox vaccine Imvanex (Jynneos) is 85% effective against monkeypox. The UKHSA has begun using Imvanex as post- exposure treatment for close contacts of known cases. There is no evidence that this vaccination will not be effective during this outbreak. ==Cases== Cases per country and territory (outside endemic African countries) Country Confirmed Suspected Total Last update First confirmed case Last confirmed case 1 1 18 18 42 42 99 99 1 1 1 1 1 1 311 1 312 1 1 696 6 702 3 3 Canada 681 45 726 Canada cases can be aggregated from the following sources: Phil Tsekouras Toronto investigating first suspected case of monkeypox 21 May 2022 www.cp24.com, accessed 23 May 2022 39 1 40 10 10 1 1 8 8 15 15 51 51 3 3 2 2 4 4 13 13 France 1,567 1,567 1 1 Germany 2,268 2,268 19 159 178 5 5 20 20 33 33 India 4 1 5 9 9 69 69 (updated every Wednesday) 105 105 407 407 1 1 Jersey 1 1 3 3 4 4 14 14 Martinique 1 1 17 17 52 52 1 1 1 1 2 Netherlands 712 712 New Caledonia 1 1 2 2 46 46 1 1 Peru 183 10 193 Peru cases can be aggregated from the following sources: 40 40 Portugal 588 588 11 2 13 1 1 19 19 1 1 2 2 5 5 6 6 3 3 27 27 4 4 South Africa 3 3 1 1 Spain Spain cases can be aggregated from the following sources: 77 77 229 229 2 2 1 1 1 1 16 16 United Kingdom 2,208 2,208 United States 2,891 2,891 1 1 1 1 1 1 Total 17,217 294 17,511 ==Related pages== * African mpox epidemic ==Notes== ==References== == Other websites == * Monkeypox outbreak – by World Health Organization * 2022 Monkeypox and Orthopoxvirus Outbreak Global Map – CDC * Monkeypox Meter – nice graphs and maps, but no source/reference links Category:21st-century epidemics Category:May 2022 events Category:June 2022 events Category:July 2022 events Category:August 2022 events Category:September 2022 events",
 "title": "2022–2023 mpox outbreak"
}