{
 "id": "930923",
 "text": "Rao Laxmi Chand was a King of Delhi. He was the Leader of the Indian rebellion of 1857 in Delhi. In addition to the troops stationed at his forts, he had an army of 15,000 infantry and 8000 cavalry when he died. ==Early life== Rao Laxmi Chand was born in Najafgarh in Hindu Ahir family. His Family traced roots from Karnawas Village in Rewari who later settled in Najafgarh to Rule Delhi. ==Najafgarh Fort== Najafgarh Fort was built by Rao Puran Singh in 18th century. Najafgarh Fort is considered one of the strongest forts because the British could not capture it 3 times. Later after hanging Rao Laxmi Chand, the fort was demolished and his army was recruited by British. ==Battle of Delhi== Rao Laxmi Chand and his cousin Prank Sukh Yadav, fought against the British on 16 November 1857 in the field of Rajpath with an army of around 5,000 infantry and 3000 cavalry. To further fortify his armed strength, the Raja not only raised new levies but also collected as much as possible latest weaponry and other war material as was revealed from the recovery of large number of horses, bullocks, carts, English rifles and dresses from his fort after the British assaulted him. After the Battle of Nasibpur fought by Rao Tula Ram(King of Ahirwal) and Rao Gopal Dev(King of Jhajjar-Hisar-Charkhi Dadri) against British was unsuccessfull due to attack by the Rajput, Sikhs and Jat soldiers who fought for the British, Prank Sukh Yadav joined Rao Laxmi Chand to attack British in Rajpath. On the first day i.e.16 November 1857, Rao Laxmi Chand forces were irresistible and the British forces scattered before them; several British Offices and Government Offices were captured by Rao Laxmi Chand. Most of the Governing building from where the top Birtish Officials controlled the Nation were captured. Britishers recruited a large number of Soldiers and attacked the buildings captured by him and His fort in Najafgarh on 22 December 1857 and defeated Rao's forces by 23 December 1857 by open bombing on the Revolutionaries.L. C. Gupta and M. C. Gupta, 2000, Haryana on Road to Modernisation After The British successfully defeated Rao Laxmi Chand, Britishers offered him to work for them and they will reciprocate the favour by again making him the King of West, South West and South Delhi as He had strong influence in the region and it would have been easier for the Britisher to Control the people but he denied and was hanged on 23 December 1857 in Rajpath.Ranjit Singh Saini, 1999, Post-Pāṇinian systems of Sanskrit grammar, Parimal Publications. ==Monuments Bought== The Taj Mahal was auctioned twice by the British in 1831, the condition of these auctions being that the person who buys the beautiful stones of the Taj Mahal would have to be handed over to the British government. During that time, Rao Laxmi Chand, who went for shooting in Mathura district with his forces , made the highest bid and bought the Taj Mahal, that is why the Taj Mahal is still standing proudly in its country, otherwise Taj Mahal was about to be demolished. https://wahgazab.com/rao-bahadur-sheth-lakhmi-chand-buys-taj-mahal-two-times/ ==Death== On 23 December 1857, He was hanged in Rajpath in Delhi by East India Company at the age of 47 fighting against the British and refusing to work for them. ==Legacy== Government of Delhi named a highway on the name Shaheed Rao Laxmi Chand Marg. A park named on Rao Laxmi Chand is also in Delhi. ===Martyr's fair=== A Shahidi mela is held annually in December at Najafgarh district of Delhi to hounor the shaheedi of Rao Laxmi Chand. ==Related pages== * Indian Rebellion of 1857 ==References== Category:1857 deaths",
 "title": "Rao Laxmi Chand"
}