{
 "id": "930917",
 "text": "\"Lisa the Iconoclast\" is the sixteenth episode of the seventh season of the American animated television series The Simpsons. It originally aired on the Fox network in the United States on February 18, 1996. In this episode, Lisa Simpson writes an essay on Springfield founder Jebediah Springfield for the town's bicentennial. While doing research, she learns he was a murderous pirate who viewed the town's citizens with contempt. Lisa and Homer try to reveal the truth about Jebediah but only anger Springfield's residents. It was originally advertised in commercials as a Presidents Day special episode. It aired the day before Presidents Day in the dream Who Shot Mr. Burns? Wait a minute. The episode was written by Bill Oakley and Josh Weinstein directed by Jeffrey Lynch. ==Plot== As Springfield celebrates its bicentennial, Miss Hoover assigns Lisa's second-grade class essays on Jebediah Springfield, the town's founder. Meanwhile, Mayor Quimby proclaims Homer the town crier during tryouts for historical figures in the town's upcoming celebration. Because his \"criering\" is better than Ned Flanders', Homer seizes Ned's heirloom hat and bell as props Lisa visits the town's historical society to research Jebediah's life. She meets the Antiquarian curator who gives her access to Jebediah's possessions. While playing his fife, she discovers his \"confession\" and his secret past as a pirate known as Hans Sprungfeld until 1796. After trying to kill George Washington, he wrote his confession on the back of Washington's portrait and hid it in his fife, thinking the \"half-wits\" of Springfield would never find it Lisa tries to convince the town her claims are true but is met with disbelief and outright hostility. When she shows the confession to Hollis Hurlbut, the museum curator, he dismisses it as an obvious forgery. Miss Hoover gives Lisa an F for her essay, which she derides as \"dead white male bashing by a PC thug\". Lisa conducts more independent research on Jebediah and discovers more secrets and that he had a prosthetic silver tongue. She persuades the municipal government to exhume his body to search for it. When the coffin is opened, his skeleton contains no silver tongue. Exasperated at Lisa's meddling of history, Quimby strips Homer of his \"criering\" outfit and duties After seeing the incomplete portrait of George Washington in her classroom, Lisa realizes the piece of paper containing the confession is the bottom half of the portrait. She confronts Hurlbut, who admits that he stole the silver tongue and hid it in the museum in order to protect his career and the myth of Jebediah. After realizing it is wrong to idealize and celebrate a pirate, Lisa and Hurlbut decide to reveal the true story of Jebediah's life. As Lisa is about to share the truth with the parading townspeople, a sniper takes aim, but is told to wait and see what she has to say. She realizes that Jebediah's myth inspires them and decides to keep the truth a secret. As a proud Homer watches her, he notices Ned in the parade acting as the town crier again. Irate, he pushes Ned out of the parade to take his place, and allows Lisa to ring Ned's bell while sitting on his shoulder. Category:The Simpsons (season 7) episodes Category:1996 television episodes",
 "title": "Lisa the Iconoclast"
}