{
 "id": "930935",
 "text": "A motorhome, recreational vehicle or in British English, a caravan is a bus- like vehicle equipped for habitation, like a house on wheels. Typically, a motorhome will include a lounge area, dining area, small bathroom, a galley \\kitchen and a corridor leading to a rear bedroom, though some have two or three bedrooms. == History == The motorhome originated in 1910 with the Pierce-Arrow Touring Landau, featuring camping amenities like cargo compartments and an onboard toilet. In the 1920s, panel trucks and buses were converted into \"housecars,\" inspired by airplanes, boats, and buses. The \"Gypsy Van,\" built in 1915 by Roland and Mary Conklin, was an early motorhome on a bus chassis, offering luxury for its time. RV production paused during WWII and resumed in the 1950s, using truck or bus chassis with trailer bodies. In 1958, Raymond Frank introduced the term \"motorhome\" and founded Frank Motor Homes, creating stylish fiberglass models appealing to suburban buyers. Winnebago entered the market in 1958, producing most components in-house. By 1969, they had 1,252 employees and $3M in sales. Motorhome sales reached 23,100 in 1969. Despite the 1970s gas crisis, which ended many manufacturers, including Travco (formerly Frank Motor Homes), the market rebounded, with 43,900 motorhomes sold in the U.S. in 2014. ==Classes== Motorhomes generally fall into four classes: Class A, Class B, Class B+, and Class C. ===Class A=== Class A Motorhomes are one of the biggest RVs and can accommodate up to eight people. They offer all the features of a small apartment with the largest square footage when it comes to RVs and reaching 29-45 feet in length. This class offers slide outs, bottom storage, various awnings, full kitchen & bathroom, as you will usually find a queen size bed in the master bedroom. ===Class B=== Class B Motorhomes, also known as van campers, are the smallest type of motorhome and can accommodate up to four people. They range from 18 to 24 feet in length, have a cabin that is smaller than what is offered under classes A and C, and use less fuel. ===Class B+=== Class B+ Motorhomes are like bigger versions of Class B motorhomes and offer a different set of luxuries. They bring together characteristics of Class B and Class C motorhomes and can feature bigger kitchens, living space, sleeping space with twin beds/sofa beds, and a stand-up shower/bath combo. ===Class C=== Class C Motorhomes represent something of a middle ground between Class A and Class B. They are great for couples or a group of friends and can sleep up to eight people, which is why they are popular with timeshare arrangements that allow for fractional ownership between different families. They offer all the typical luxuries of Class A motorhomes as well as generous amounts of space and have the appearance of a larger van camper with an overhead cabin. == References == Category:Vehicles",
 "title": "Motorhome"
}