{
 "id": "931230",
 "text": "Rao Gujarmal Singh was a ruler of Haryana-Rajasthan-Delhi. Under him, Ahirwal covered present day districts: Rewari, Mahendergarh, Narnual, Charkhi Dadri, Hissar, Jhajjar, Rohtak, Mewat ,Gurgaon, Najafgarh, Dwarka, Bahadurgarh, Rohini, Palam, Alwar and Jaipur. ==Early life== Rao Gujarmal Singh was the son of Rao Nandram Singh. Rao Bal Kishan, the elder brother of Rao Gujarmal, attained martyrdom while fighting against Nadir Shah in the Karnal war on 24 February 1739, after him Rao Gujarmal became the king. Seeing the valor and bravery of Rao Bal Kishan, Nadir Shah awarded the title of \"Rao Bahadur\" to the Rao Raj Gharana. At the time of Rao Gujarmal, the power of the Ahirwal was at its peak. Hearing about the martyrdom of Rao Bal Kishan, Mohammad Shah Rangila called his brother Rao Gujarmal from Rewari in return for Rao Balkrishna's military sacrifice and made him Panch Hazari Mansab. Amir-ul- Umra, and this dynasty has the hereditary honors and regalia of Rao Raja, Mahi Maratav (royal flag), Khillat-e-Khas (special dress) studded with priceless gems and 104 of Narnaul and Hisar. He made this kingdom more powerful by giving Farman (Sanad) of Parganas (Tehsil), thus Rewari Jhajjar Dadri, Hansi, Hisar, Kaur, Narnaul were included in his kingdom. Major cities included Shahjapur, Behror, Tijara, and Alwar and he had also bought huge property in Delhi. The king ordered Rao Bahadur's Nangada to be played right up to the door of the Red Fort whereas the old custom was that from Fatehpuri Masjid to Jama Masjid. No man could go ahead playing the flute, thus the power of Rewari state had reached the highest level. Rao Gujarmal Bahadur sent a message to Nawab Mustafa Khan Farrukhnagar, who was occupying Hisar Bawni, that now Hisar Bawni is under our rule and you should vacate it and remove the interference, then the Nawab replied that \"Interference in the country is done by the force of the sword.\" After this, both the sides started preparing for the war. All the brave men of Ahirwal and their relatives gathered with Rao Gujarmal in the battlefield of Hansi. To fight the Nawab army was big and about the army he said to the Ahirs that \"they are rabbit hunters, we will kill them in one attack. Before the war, a Muslim fakir told Rao in Dargah Hansi , “Fateh will kiss your feet but do not kill the Nawab”. Rao Gujarmal gave a promise to the fakir that he will not kill the Nawab. When both the armies were face to face in the battle, Rao ordered the Ahir chieftains to kill him. When told that the Nawabi army is loaded with armor and weapons, the Ahir chief of Kanina place said, \"Rao Sahab, these Baloch will not be able to stand before our spears, even though their bodies are covered with iron armor, but their mouths and butts are empty for our spears.\" The battle bells were rung and iron started clashing with iron, warriors from both the sides started trying their best. Since the entire army belonged to Rao Sahab's community, brother Ahirs, we all fought with our lives. And the heads of the army of Baloch started falling, the Nawabi army could not tolerate the tremendous attack of the army of Ahirwal and was destroyed. Vijayashree bowed down at the feet of the sword of the army of Ahirwal. It happened, the Nawab was arrested and presented before Rao Gujarmal and any Baloch who did not lay down his arms was beheaded by the swords. The Nawab fell at the feet of Rao Gujarmal and Rao Gujarmal fulfilling his promise to the fakir, he spared the life of the Nawab and sent his children and wives to Farrukhnagar and gave him a jagir of twelve villages for their maintenance. ==Death== Baloch Raja of Farrukhnagar and Bahadur Singh of Ghasera, a descendant of Hathi Singh, were both fierce enemies of Rao Gujarmal. Bahadur Singh was ruling independent from Raja Surajmal of Bharatpur. Then Rao Gujarmal along with Surajmal gave a befitting reply to him. Gujarmal also had friendly relations with Todar Mal of Neemrana, father- in-law of Bahadur Singh. In 1750, Todarmal invited Rao Gujarmal at the behest of Bahadur Singh and killed him by deceit. ==Legacy== Kusum Sarovar was built by son of SurajMal (Jawahar Singh) remembering Rao Gujarmal and Surajmal. Rao Gujarmal fountain is also made in Rewari by Govt of Haryana to honour him. ==Related pages== *Gurgaon ==References== Category:Indian monarchs Category:18th century in India",
 "title": "Rao Gujarmal Singh"
}