{
 "id": "931492",
 "text": "Sonic the Hedgehog 3 (known in Japan as Sonic x Shadow TOKYO MISSION) is a 2024 American-Japanese movie based on the Sonic the Hedgehog video game series from Sega. It is the sequel to Sonic the Hedgehog (2020) and Sonic the Hedgehog 2 (2022). The movie is distributed by Paramount Pictures. It was released on December 20, 2024. ==Plot== One day, Prison Island's systems are attacked by Eggman tech, which breaks free Shadow the Hedgehog, that was imprisoned in a test tube because of a terrible accident 50 years ago. Shadow knocks out everyone in the base and heads to Shibuya. Meanwhile, Team Sonic is enjoying their day, when suddenly, a G.U.N. helicopter arrives near them. Team Sonic is assigned by G.U.N. to find Shadow and bring him back to Prison Island. But they have to join forces with their arch nemesis Dr. Ivo Robotnik. But later finds out the Attack was by from Gerald Robotnik, Ivo's grandfather. ==Cast== ===Voice cast=== * Ben Schwartz as: ** Sonic the Hedgehog: An anthropomorphic blue hedgehog who can run at supersonic speeds. ** Metal Sonic, a robotic doppelganger of Sonic made by Dr. Eggman Aka Dr Robotnik who's Alive and Built Metel Sonic to get revenge on Sonic Again. * Colleen O'Shaughnessey as Miles \"Tails\" Prower: An anthropomorphic yellow-orange fox who can fly with his twin-tails. * Idris Elba as Knuckles the Echidna: A hot- headed and serious anthropomorphic red echidna warrior with super strength. * Keanu Reeves as Shadow the Hedgehog: An anthropomorphic red-striped black hedgehog resulting from a secret government program called Project Shadow. * Amy Rose: An anthropomorphic pink hedgehog who saves Sonic from the Metal Sonic army, has a non-speaking appearance in the first post-credits scene. but good news will have roles in the Sonic Movie 4 coming to Theathers March 19th 2027 coming soon. === Live-action cast === * James Marsden as: ** Tom Wachowski, the adoptive father of Sonic, Tails, and Knuckles, and the sheriff of Green Hills, Montana. ** Little Tom, Tom's puppet. * Tika Sumpter as Maddie Wachowski, Tom's wife, the adoptive mother of Sonic, Tails, and Knuckles, and the local veterinarian of Green Hills. * Jim Carrey as: ** Dr. Ivo Robotnik, a mad scientist and Sonic's arch-nemesis who he often refers to as \"Eggman\". ** Gerald Robotnik, Ivo and Maria's grandfather and Shadow's creator. * Lee Majdoub as Agent Stone, Robotnik's assistant. * Tom Butler as Commander Walters, the former Vice Chairman of the Joint Chiefs of Staff who is now the leader of the military organization Guardian Units of Nations (G.U.N.). ** James Wolk as Young Walters * Alyla Browne as Maria Robotnik * Krysten Ritter as Capital Rockwell * Sofia Pernas as Gabriella, Pablo and Juan's love interest from La Última Pasión, a TV show that Ivo watches. * Cristo Fernandez as Pablo and Juan, twin brothers who appear in La Última Pasión who fight over Gabriella's love. * Jorma Taccone as Kyle Lancebottom ==Notes== ==References== Category:2024 movies Category:Movies based on video games Category:Movies set in Tokyo Category:Paramount Pictures movies Category:Sonic the Hedgehog movies Category:Sonic the Hedgehog",
 "title": "Sonic the Hedgehog 3 (movie)"
}