{
 "id": "931426",
 "text": "The Ahirwal region was a post-Mughal principality ruled by the Abhiras in past.https://www.thehindu.com/elections/rajasthan-assembly/dalit-voters-hold- the-key-to-victory-in-tijara/article67517068.ece It was so called by Mughals and post independence by Jawaharlal Nehru after seeing bravery of Ahir soldiers in 1962, Rezangla followed by Chaudhary Charan Singh, Rajiv Gandhi and Narendra Modi in a rally in Rewari, Haryana. Ahirwal (meaning land of Ahirs) is a region spanning parts of Southern Haryana , North-Eastern Rajasthan, and South-Western Delhi. Demands by local population of Ahirwal Bhiwadi cargo airport to be named after Rao tula ram or Pran sukh yadav Rao Mitrasen Ahir 121 feet statue in kot-Behror district. Rao Tez Singh Statue of 121 feet in Tapukara, Tijara. Pran Sukh Yadav satue in Behror. Kotkasim Airport to be named after Pran Sukh Yadav (military commander of Ahirwal forces in 1857 revolt)..or Rao balkishan singh (battle of karnal, 1739) Rao Tez Singh(1766-1823) ruler of kotkasim, Tapukara, Bawal, taoru, Nuh, Hadol, Palwal, Sohna, Pataudi, Rewari or Nandram Ahir (contemporary of Aurangzeb) ruler of Neemrana, kotkasim, Tapukara(Tijara), Rewari etc. Ahirwal university in kot-behror district.https://www.amarujala.com/haryana/mahendragarh- narnaul/ahir-regiment-demand-mahapanchayat-held-in-narnaul-people-from- haryana-rajasthan-and-other-states-gathered-2023-06-04 ==History== The region was once a kingdom based from the town of Rewari (first capital at Tijara, Rajasthan) and controlled by members of the Ahir community. The name translates as \"Land of the Ahirs\". J. E. Schwartzberg has described it as a \"folk region\" and Lucia Michelutti as a \"cultural-geographic region\". It includes parts of the districts of Alwar, Jaipur district, Rajasthan, Mahendragarh, Rewari, Gurgaon, Jhajjar, Charkhi Dadri, Bhiwani and parts of Rohtak and Hisar in the state of Haryana and South western Delhi .\" ==Etymology== According to Pran Nath Chopra, Haryana got its name from Abhirayana-Ahirayana-Hirayana-Haryana. Ahirwal and Ahirayana (Hiryana) was referred to this region before modern state of Haryana was formed (in 1966) and even before Independence of India. Thus, modern state Haryana got its name from Ahirwal (Ahirwati or Hirwati) region.https://books.google.co.in/books?id=ggtuAAAAMAAJ&q;=Abhirayana%3DAhirayana%3DHirayana%3D&redir;_esc=y ==Languages== The main language of the area is Ahirwati. It is commonly taken to be a dialect of Haryanvi, but it also has characteristics in common with the neighbouring Western Hindi varieties. The closely related Bangru (also known as Haryanvi) and Hindi are spoken in the region. Common Proverb in Heerwati - * दिल्ली पाछे मर्द भतेरे, बसे देश अहीरवाल में सिंहनी के जाये शेर अहीर, बसे देश अहीरवाल में * अहीरवाल का अहीर, खेती की तद्बीर = अहीरवाल के अहीर अपनी कुशल खेती के लिए प्रसिद्ध हैं। वे किरकिरा भूमि को भी बदल सकते हैं समृद्ध और फलदायी देश में। https://books.google.co.in/books?id=PE4cAQAAIAAJ&pg;=PA58&dq;=rewari+rulers&hl;=en&ei;=1VMQTfKJLoP_8Aax99ijDg&sa;=X&oi;=book_result&ct;=result&redir;_esc=y#v=onepage&q;=ahir&f;=falseLanguage of Ahirwal https://www.tribuneindia.com/news/archive/features/no-takers-in- their-own-land-753271 ==Political contribution== The Ahirwal region in southern Haryana has 11 assembly segments. The Ahirs(heer) from Ahirwal or Hirana (Rewari, Mahendragarh, Narnaul, and surrounding area (now in Haryana), Behrod, Tiara, Rath(now in Rajasthan)) migrated towards Jaipur after the Battle of Nasibpur in various phases and dominate Jaipur rural lok sabha seat(with more than 3 lakh population). Spread over 7 Lok Sabha seats (3 in haryana and 4 in rajasthan) – Bhiwani-Mahendergarh, Gurgaon and Rohtak (one segment only) in Haryana and Alwar (more than 4 lakh population of Ahirs [heers]), Jaipur Rural (Jhotwara, shahpura, kotputli, bansur, viratnagar, Amer, phulera with more than 3 lakh voter), Sikar (neema ka thana segment with more than 2 lakh population), Jhunjhunu (one third segment with more than 1 lakh population) in Rajasthan– having a sizeable presence of Ahir voters.https://www.patrika.com/jaipur-news/jaipur-rural-lok-sabha-seat-ground- report-8803632 == Military involvements == The events at the battle of Rezang La on 18 November 1962 involved many soldiers from the Ahirwal region, who were greatly outnumbered by their Chinese opponents. == Occupation == === Traditional occupation === * Landlords (one of the major states in farming production) * Ahirs of Ahirwal were far more superior farmer than any community of Rajasthan, Punjab and Haryana.https://books.google.co.in/books?id=X_K1s8W57zAC&pg;=PA55&dq;=ahirs+of+Punjab&hl;=en&ei;=cWnaTM3LOYKBlAfNl6n7CA&sa;=X&oi;=book_result&ct;=result&redir;_esc=y#v=onepage&q;=ahirs%20of%20Punjab&f;=false * Defence Forces ( Ahirwal is said to have atleast one men in army from one family and hence also called Israel of India)Ahirwal Soldiers https://anytvnews.com/topic/ahirwal-soldiers/ === Modern occupation === In modern era along with farming and defences forces, youth has been inclined towards sports, government jobs, civil services, politics and Real estate.Ahirwal in Modern era https://www.tribuneindia.com/2001/20011117/haryana.htm == Rulers == === Rao Ruda Singh === Ahir ruler of Tijara, acquired the jagir of Tijara. Ruda Singh made Bolni village, south of Haryana his headquarter, 12 km to the east. He cleared the forests and established new villages. === Rao Mitrasen Ahir === Rao Mitrasen an Ahir from Behror, (now in Rajasthan) was the son of Rao Tulsiram and was the Ahir ruler who ruled Rewari. Rao Raja Mitrasen fought with Muslim invaders, British, Kachwaha of Jaipur and Shekhawat Rajput etc. To take revenge on Rewari. For the purpose, in the early months of 1781, the Rajput rulers of Jaipur attacked Rewari, but they were defeated by Rao Mitrasen and suffered heavy losses from a strategic point of view.He Also Faught The Battle Of Mandan at Jhunjunu, Rajasthan. rao mitrasen is the greatest ruler of india he is considered strongest of all time. Rao Mitrasen captured Deeg fort in first attempt. Rao Mitrasen of Santoriya Ahir clan defeated and killed Nawalsingh Shekhawat (he died at Singhana even after taken from battle field by Sekhawats's ) and took kanaud (now Mahendrgarh) under his control from Shekhawat chieftain of Kanud, on February 1779 and took possession of Kanaud fort. Mahendrgarh should be renamed as Mitrasenahirgarh. In 1781, Rao Mitrasen Ahir included kotputli and Behror in his kingdom. Jaipur kingdom attack Rewari at Manadan (now in Alwar) but were defeated badly. Rao Mitrasen army than attack narnaul and included in his kingdom. Sardar of Garhi Bolni Ganga kishan was jealous of Rao Mitrasen Ahir so, he conspired against Mitrasen by aigning with Maratha. Maratha sardar Mahadji Sindhi attack Rewari but were defeated . After one year Maratha again attack Rewari but were again defeated. Finally, Maratha conspired against Mitrasen and killed him and all of his family. Women in his capital Gokalgarh (in Rewari) sing song of his bravery. Rao Mitrasen Ahir extendned Ahirwal towards deep into Rajasthan towards kotputli (now in Jaipur).https://www.bhaskar.com/harayana/rewari/news/haryana-news-song-of-the- heroes-of-king-buddesen-tradition-that-lasted-233-years-082504-4700369.html === Rao Ram Singh === After Ruda Singh, his son Rao Ram Singh (Ramoji) took over the throne of Rewari. There was an atmosphere of fear and discontent in his kingdom due to bandits and robbers. Ram Singh built a fort at Bolni and deployed soldiers on it for security. He was a fearless warrior so after a long struggle he was able to neutralize the criminals. He arrested two famous bandits and handed them over to Emperor Akbar. === Rao Shahbaz Singh === Rao Ram Singh was followed by his son and successor, Shahbaz Singh, who was a contemporary of Shah Jahan and Aurangzeb. === Rao Nandram Singh and Rao Man Singh === Shahbaz Singh was succeeded by his eldest son, Nandram. Aurangzeb edited the title of his jagir and awarded him the title of \"Chowdhary\". He shifted his headquarters from Bolni to Rewari. The water collector named Nand Sagar in Rewari is still a testimony of his memory. === Rao Bal Kishan === Balkishan was killed while in Aurangzeb's military service on 24 February 1739 while fighting against Nadir Shah in the Karnal War. Pleased with his bravery, Mohammad Shah gave the title of \"Rao Bahadur\" to Balkishan's brother Gujarmal and gave a headship of 5000. By expanding the boundary of his kingdom, 52 villages of Hisar district and 52 villages of Narnaul were added to it. His jagir included major cities like Rewari, Jhajjar, Dadri, Hansi, Hisar, Kanaud, and Narnaul. In the year 1743, some more villages with mansabdari of Rs 2,00,578 were also added. === Rao Gujarmal Singh === Baloch Raja of Farrukhnagar and Bahadur Singh of Ghasera, a descendant of Hathi Singh, were both fierce enemies of Rao Gujarmal. Bahadur Singh was ruling independent from the Jat king Surajmal of Bharatpur. Then Rao Gujarmal along with Surajmal gave a befitting reply to him. Gujarmal also had friendly relations with Todarmal of Neemrana, father-in-law of Bahadur Singh. In 1750, Todarmal invited Rao Gujarmal at the behest of Bahadur Singh and killed him by deceit. === Rao Bhavani Singh === Rao Gujarmal's son Bhavani Singh became the king after him. Bhavani Singh proved to be lazy. Many parts of his kingdom were captured by the Baloch Nawab of Farrukhnagar, the Nawab of Jhajjar and the Raja of Jaipur and only 22 villages remained with Bhavani Singh. He fought battle of Ghasera in 1753 along with jat of Bharatpur. A chieftain of his own kingdom killed him in 1758. === Rao Tej Singh === Rao Tej Singh was jagirdar of kotkasim, Tapukara, Bawal, Taoru, Pataudi, Nuh, Hodal, Palwal, Sohna etc His jagirdari comprises of vast area of North East Rajasthan and South Haryana. Ahir Jagir of Rewari comprised of 360 villages. Rao Ganga Bishan Singh died in 1799. Thereafter, Rani Maya Kanwar appoints Rao Tej Singh, ruler of Taoru as her manager. The grand, fort like haveli seen in the picture was built as Kachehri in 1799-1803. He was jagirdar of kotkasim, taoru, later occupied Rewari from Iranian invaders. The next Raja Hira Singh was also rejected and the control of Raj Kaj was taken over by a local businessman Jauki Ram. Najaf Quli Khan, a rebel Sardar of Delhi had captured the Gokulgarh Fort. Shah Alam II, the Emperor of Delhi, along with Begum Samru, decided to punish her. On 12 March 1788, Shah Alam camped in Bhadawas and attacked Najaf Quli during the night, in which Najaf Quli was badly damaged. The effect of Begum Samru's artillery forced Quli Khan to compromise. Bada Talab was built by Rao Tej Singh during the year 1810-1815, so it is also known as Rao Tej Singh Talab. The pond is situated near old Town Hall of Rewari. It is filled by rain water or canal through underground inlets. There is a separate bathing provision for females and males in the pond. A temple of Lord Hanuman is situated on the bank of Bada Talab. A large number of people visit this famous temple for prayer. https://haryanatourism.gov.in/Destination/bada-talab === Rao Tula Ram === Raja Rao Tula Ram Singh (9 December 1825 – 1863), was an Ahir ruler, He was the chief hero of the independence revolution of 1857 in Ahirwal (heeryana).[16].He overthrow local tehsildar at Rewari and declare himself the king of Rewari, Bohra, shahjahan pargana. Mahjaraja Rao Tula singh bahadur went to Rajasthan and defeated jodhpur forces at pali (jodhpur legion revolted against british and sided with Maharaja), Jaipur forces and Sikar forces at Sikar. When he was at khetri in Rajasthan he was joined by nawab of Jhajjar. He temporarily overthrow British rule from the southern Haryana of the present day. The credit for overthrowing Britisher from Haryana and helping the revolutionaries of Delhi with body, mind and money is given to Tularam only. Rao Tularam remained in possession of Gurgaon, Faridabad, Mahendragarh, Kanina, Bawal, Farrukhnagar, Rewari, Narnaul, Hodal and Ferozepur Jhirka till September. After the revolution of 1857. He met with Maratha commander Tantya tope and fought many battle in MadhyaPradesh against british. After, that he lead in battle of Sikar in 1859 (along withTantya tope), He tried to unite all India forces against british but rulers of kota, bundi did not responded positively. Rulers of Jaipur, Jodhpur, Bikaner inspired by Maharaja courage and dedication to mother land India gave written assurance that if army from Afghanistan , Russia and Iran they will join them but could not fight emperial British rule own their own. Rao sahab left India and sought the help of the rulers of Afghanistan, Iran and the Tsars of Russia for the war of independence of India. But his plan failed due to his death on 23 September 1863 at the age of 38.After battle of Nasibpur on the order of EIC jaipur prinncely state order chief;s of khetri etc to not let revolutionaries find shelter in Rajasthan but even after that many took shelter and Rao Tula Ram was also given royal shelter by a local chief of Jhunjhunu. Those part of his grandfather Rao Tez Singh (1766-1823) jagir which was taken by Britishers and administered by them was taken back by him. However, he priortise Independence of country rather than taking back Ahirwal part of Rajasthan back into his jagir. He could have taken whole of Ahirwal under his control by overthrowing princely state of Alwar and others which was given to them by britisher in helping in war against Ahir's and Marathas. He could have become king of Ahirwal and lived lavish life building fort and palaces such as by nawab of pataudi( even with a very very small jagir built 850cr mahal), city palace of udaipur (built after 1900s as they became part of Naresh Mandal) and etc .Maharaja Rao Tula Ram prepared for foreign mission in haveli in Gandala village, Behror Rajasthan. Rao Tula Ram took the Marwari businessman look and went to Ahmedabad and then to Mumbai. British secretive agency could not catch him and form there he took naval ship.https://cmsadmin.amritmahotsav.nic.in/unsung-heroes- detail.htm?13078https://www.patrika.com/alwar-news/rao-tula-ram-fought-for- independence-till-his-last-breath-19010362 === Rao Gopaldev Singh === Rao Gopaldev Singh was a 19th-century revolutionary in Rewari, who, along with his cousin Rao Tularam Singh, took on the British in the Revolution of 1857. === Rao Kishan Gopal === Rao Kishan Gopal was the commander of his army of revolting army of meerut. He was also an officer in the British East India Company. He was the one who killed General Timley in the war. === Pran Sukh Yadav === Pran Sukh Yadav (1802–1888) was a military commander from Behror in Alwar district of Rajasthan. He was a participant revolutionary in the Revolution of 1857. He was a close friend of Hari Singh Nalwa and the famous Punjab ruler Maharaja Ranjit Singh. In his earlier times, he fought on the side of the Sikh Khalsa army. After the death of Maharaja Ranjit Singh, he participated in the first and second British-Sikh conflicts. In his early career he trained Sikh Khalsa Army. After the death of Maharaja Ranjit Singh, he fought in both the First and Second Anglo-Sikh wars, due to his hatred towards Britishers. He also started giving military training to the farmers of Ahirwal Region. == Rao Udairam singh == Udairamsar Jagirdari was a group of 87 villages in the Bikaner district of Rajasthan that belonged to the Dantarta clan of Ahir before India gained independence. The villages were part of the Udairamsar thikana, which was the only thikana of the Ahir/ Yadavas in Bikaner. Rao Udai Singh was Commander in Chief and a Noble in Royal Court of Maharaja of Bikaner. Rao Udai Singh had great relations with Rao'z of Rewari State, many matrimonial relations as well. Ahir Jagirdar of Udairamsar had autonomous rule they helped Rewari kingdom in almost every war. Descendants of Rao Udai Singh helped Rao Tularam in 1857 revolt of First Independence. Udairamsar has Rao Tula Ram Public School, Kosliya public school, Shree krishna public sr.sec. school, Murli Singh Yadav B Ed College etc. == Related pages == * Battle of Nasibpur *Rao Sahab *Grand Trunk Road == References == Category:Geography of India",
 "title": "Ahirwal"
}