{
 "id": "93143",
 "text": "San Miguel de Tucumán (usually called simply Tucumán) is the capital of the Tucumán Province; it is in northern Argentina from Buenos Aires. The Spanish Conquistador Diego de Villarroel founded the city in 1565 during an expedition from present-day Peru. The city was moved to its present site in 1685. == History == The city, with the name of San Miguel de Tucumán y Nueva Tierra de Promisión, was founded on 31 May 1565 by Diego de Villarroel in the place called Campos de Ibatín, about to the southwest of the present city. Then, in 1685, the town was moved to where it is now because of the low quality of the water. On 24 September 1812, the Battle of Tucumán took place near the city, when the Spanish army was defeated by the army led by Manuel Belgrano. The act of the Independence was signed at the Casa de Tucumán (\"Tucumán House\"). ==Geography== The city is surrounded by the departments * Tafí Viejo to the north; * Cruz Alta to the east; * Lules to the south; and * Yerba Buena to the west. The city is on the slopes of the Aconquija mountains along the Salí river. The altitude in the centre of the city is . It is the commercial centre of an irrigated area that produces sugarcane, rice, tobacco, and fruits. San Miguel de Tucumán has an area of and a population of 548,866, in 2010, for a population density of inhabitants/km2. === Climate === San Miguel de Tucumán has a humid subtropical climate (subtype Cfa in the Köppen climate classification). The average temperature for the year in San Miguel de Tucumán is . The warmest month, on average, is January with an average temperature of . The coolest month on average is July, with an average temperature of . The average amount of precipitation for the year in San Miguel de Tucumán is . The month with the most precipitation on average is January with of precipitation. The month with the least precipitation on average is July with an average of . == Places of interest == Some interesting places in San Miguel de Tucumán are: * Plaza Independencia (\"Independence square\") * Casa de Gobierno de Tucumán (\"Tucumán Government Palace\") * Catedral de San Miguel de Tucumán (\"San Miguel de Tucumán cathedral\") * Basilica of San Francisco (\"Saint Francis Basilica\") * Casa de Tucumán (\"Tucumán House\" or \"Independence House\") == Twin towns == San Miguel de Tucumán is twinned with: * Nazareth Illit, Israel, since 1995 * Santa Cruz de la Sierra, Bolivia, since 1997 * Sucre, Bolivia, since 2012 * Erfurt, Thuringia, Germany, since 2012 * Concepción, Chile, since 2013 ==Gallery== File:Tucumán Casa de la Independencia.JPG|Independence House. File:TucumanCathedral3.jpg|Tucumán Cathedral. File:06. Tucuman (14), Templo de San Francisco.JPG|Saint Francis Basilica. File:Casa de Gobierno de noche.jpg|Tucumán Government Palace. == References == ==Other websites== * San Miguel de Tucumán official website * Ente Tucumán Turismo official website * Universidad Nacional de Tucumán Tucuman State University * Universidad del Norte Santo Tomas Aquino Tucuman Catholic University * Universidad Tecnologica Nacional (Tucuman Campus) Category:Cities in Argentina Category:Capitals of Argentine provinces Category:1565 establishments Category:1560s establishments in South America Category:16th-century establishments in Argentina Category:1685 establishments Category:Tucumán Province",
 "title": "San Miguel de Tucumán"
}