{
 "id": "931555",
 "text": "Mr. Mouse Takes a Trip is a 1940 American animated short movie produced by Walt Disney Productions and released by RKO Radio Pictures. The movie was directed by Clyde Geronimi and features original music by Leigh Harline and Oliver Wallace. The movie was animated by Clyde Geronimi, Ken Muse, Ed Love, Marvin Woodward, and Ray Abrams.\"Mr. Mouse Takes A Trip \". www.bcdb.com The voice cast includes Walt Disney as Mickey, Lee Millar as Pluto, and Billy Bletcher as Pete. It was the 109th short in the Mickey Mouse movie series to be released, and the third for that year. The fame of the short has since grown some historical significance, as Walt Disney himself was filmed recording his lines as Mickey Mouse for it, making it one of the only times he was shown doing his voice on camera. Alongside him as voice dubbing is actor Billy Bletcher as the voice of Pete. The cartoon follows Mickey Mouse and his dog Pluto traveling by train, except they have a rule forbidding dogs from entering the train; Pete plays a menacing conductor intent on enforcing this rule. ==Releases== *1940 - Original theatrical release *c. 1980s - \"A Disney Vacation\" (TV) *1986 - \"Adventures with Mickey\" (TV) *1998 - The Ink and Paint Club, episode # 1.43: \"On Vacation\" (TV) *2009 - Have a Laugh! (TV) ==Home media== The short was released on May 18, 2004 on Walt Disney Treasures: Mickey Mouse in Living Color, Volume Two: 1939-Today. Additional releases include: *c. 1965 - Highlights included in \"Mickey's Memorable Moments, Volume 2\" (Super 8)The Old Film Company *1984 - \"Cartoon Classics - Limited Gold Edition: Mickey\" (VHS) *1987 - \"Memorable Mickey\" (VHS) *1998 - \"The Spirit of Mickey\" (VHS) *2006 - \"Walt Disney's Funny Factory: With Mickey\" (DVD) *2009 - \"Walt Disney Animation Collection: Classic Short Films Volume 1: Mickey and the Beanstalk\" (DVD) *2010 - \"Have a Laugh!: Volume 2\" (DVD) ==References== ==Other websites== * * Category:Disney animated movies Category:Short movies Category:Movies directed by Clyde Geronimi Category:Movies composed by Leigh Harline",
 "title": "Mr. Mouse Takes a Trip"
}