{
 "id": "931520",
 "text": "Cosmo Julius and Wanda Venus Cosma (née Fairywinkle) are fictional characters in the Nickelodeon animated series The Fairly OddParents. They are a pair of fairies (Angeles) who raise their godchildren Timmy Turner, and, in the 10th season, Chloe Carmichael, in the fictitious city of Dimmsdale, California. Wanda is the smarter of the two. She often grants empty-headed wishes while Cosmo himself is one of the least intelligent characters featured alongside Mr. Turner. The characters are voiced by Daran Norris and Susanne Blakeslee respectively. They also voice Timmy’s parents and their Anti-Fairy counterparts. In the first live made for TV film they were portrayed by Jason Alexander and Cheryl Hines, respectively. ==Characterizations== ===Appearance and personalities=== ===Cosmo=== In spite of his unusually low IQ, Cosmo loves his wife and godchild deeply. Because of his lack of intelligence his wishes often cause tremendous harm. When someone other than him dates Wanda, he becomes green with envy and usually goes along with Timmy’s wishes. Prior to Season 6, he was the last infant to be produced in Fairy World. He experienced severe mood swings so much that his unnatural fury frightened Wanda and Timmy. He has the almost same hairstyle as Timmy. Cosmo has Chelsea Cucumber green hair and matching eyes and a floating golden crown with light blue wings sticking out. He wears a white business shirt with a black tie matching shirts and because of art style, identical loafers connecting his lower extremities. During the show’s early stages, he was designed as a Homer Simpson-like character before switching to his current appearance. ===Wanda=== Intelligent and comforting about her godchild, she is the most responsible of the four characters. Frequently adopting the blame for chaos, she also overlooks her husband’s dumbness. She has a constant habit of nagging. She serves is sensible whenever Cosmo or Timmy make a foolish wish.She can be guilty of making the aforementioned wishes without reading Da Rules book of laws first. Originally designed as a frumpy fairy with a burly build while nicknamed Venus, Wanda has cerise hair tied in a bun and matching eyes, with her lips of the same color. Like her husband, she has light blue wings protruding from her back and a floating golden crown. She wears a yellow T-shirt, black slacks matching loafers connecting her lower extremities. In very early episodes, her complexion was tinted baby pink later changed to regular skin. ==Reception== ===Accolades=== Daran Norris was nominated at the 39th Annie Awards for voice acting in a television program, ultimately losing to Jeff Bennett for his role in Penguins of Madagascar. == References == ==Other websites== *Cosmo’s profile on Nick.com *Wanda’s profile on Nick.com Category:Fictional characters introduced in 1998 Category:Animated characters",
 "title": "Cosmo and Wanda"
}