{
 "id": "931551",
 "text": "Mass shootings are events where there are many victims of firearm-related violence. There is no exact definition for a \"mass shooting\". One definition is that a mass shooting is an act of public firearm violence in which a shooter kills at least four victims. Gang killings, domestic violence, or terrorist acts by an organization are not included. With this definition, one study found that about one-third of the world's public mass shootings between 1966 and 2012 (90 of 292 events) happened in the United States. The Washington Post recorded 163 mass shootings in the United States between 1967 and June 2019. ==Statistics== The United States has had more mass shootings than any other country. Shooters generally either die by suicide afterward, are arrested, or are killed by police officers or civilians. Mass shootings are responsible for under 0.2% of homicides in the country between 2000 and 2016. According to a March 2022 report, over mass shootings in the last 40 years, in 52% of mass shootings in the United States the shooter was white, 16% were African American, and 8% were Latino. In 96% of mass shootings the shooter was male, in 2% they were female, and in 2% there were both male and female shooters. ==Weapons used== Many types of guns have been used in mass shootings in the United States, including semi-automatic handguns, semi-automatic rifles, revolvers, and shotguns. Of the 172 events from 1966 to 2019 that are seen as mass public shootings in the U.S., handguns were used in 77.2% of cases and semi-automatic rifles in 25.1% of cases. From 1966 to 2019, about 77% of mass shooters in the U.S. legally bought the weapons used in the attacks. ==Mental health== In a study, experts said that roughly one-third of acts of mass shootings since the 1990s were committed by people with a \"serious mental illness\". However, the study also said that people with a serious mental illness are responsible for less than 4% of all the violent acts in the United States. The American Psychiatric Association (APA) said that gun violence is a public health crisis and that a majority of people with mental illness are not violent and \"are far more likely to be victims of violent crime.\" In February 2021, a survey published by psychiatrists at Columbia University found that in 1,315 out of 14,785 mass murders around the world, personal motives were the main cause. In only 11% of these 1,315 murders and 8% of these shootings, the murderer had a serious mental illness. ==List of deadliest mass shootings since 1949== Rank Incident Year Location Deaths Injuries Type of firearm(s) used 1 Las Vegas shooting 2017 Paradise, Nevada 60 (plus the perp.)including 2 victims who died due to complications in 2019 and 2020 867 approx. (413+ from gunfire or shrapnel) Semi-automatic rifles (some outfitted with bump stocks), bolt-action rifle, and revolver 2 Orlando nightclub shooting 2016 Orlando, Florida 49 (plus the perp.) 58 (53 from gunfire) Semi-automatic rifle and pistol 3 Virginia Tech shooting 2007 Blacksburg, Virginia 32 (plus the perp.) 23 (17 from gunfire) Semi-automatic pistols 4 Sandy Hook Elementary School shooting 2012 Newtown, Connecticut 27 (plus the perp.) 2 Semi-automatic rifle, bolt-action rifle, and pistol 5 Sutherland Springs church shooting 2017 Sutherland Springs, Texas 26 (plus the perp.)The fatality total includes an unborn child. 22 Semi-automatic rifle 6 Luby's shooting 1991 Killeen, Texas 23 (plus the perp.) 27 Semi-automatic pistols El Paso Walmart shooting 2019 El Paso, Texas 23including a victim who died due to complications in 2020 23 Semi-automatic rifle 8 San Ysidro McDonald's massacre 1984 San Diego, California 22 (plus the perp.) 19 Semi- automatic carbine, pistol, and shotgun 9 Robb Elementary School shooting 2022 Uvalde, Texas 21 (plus the perp.) 18 Semi-automatic rifle 10 Lewiston shootings 2023 Lewiston, Maine 18 13 Unknown 11 University of Texas tower shooting 1966 Austin, Texas 17 (plus the perp.)including a victim who died due to complications in 2001 31 Bolt-action rifle, semi-automatic carbine, revolver, semi-automatic pistols, and pump-action shotgun Parkland high school shooting 2018 Parkland, Florida 17 17 Semi-automatic rifle 13 Fort Hood shooting 2009 Killeen, Texas 14 32 (plus the perp.) Semi-automatic pistol and revolver San Bernardino attack 2015 San Bernardino, California 14 (plus both perps.) 24 Semi-automatic rifles Edmond post office shooting 1986 Edmond, Oklahoma 14 (plus the perp.) 6 Semi-automatic pistols 16 Columbine High School massacre 1999 Columbine, Colorado 13 (plus both perps.) 24 (21 from gunfire) Semi-automatic carbine, semi-automatic pistol, and shotguns Binghamton shooting 2009 Binghamton, New York 13 (plus the perp.) 4 Semi- automatic pistols Camden shootings 1949 Camden, New Jersey 13 3 (2 from gunfire) Semi-automatic pistol Wilkes-Barre shootings 1982 Wilkes-Barre, Pennsylvania 13 1 Semi-automatic rifle Wah Mee massacre 1983 Seattle, Washington 13 1 Semi-automatic pistol(s) and/or revolver(s)During the massacre, the perpetrators used three .22 caliber handguns of an unknown type that were never recovered by the authorities. 21 Aurora theater shooting 2012 Aurora, Colorado 12 70 (58 from gunfire) Semi-automatic rifle, pistol, and shotgun Thousand Oaks shooting 2018 Thousand Oaks, California 12 (plus the perp.)One of the victims was killed by stray police gunfire 16 (1 from gunfire) Semi-automatic pistol Washington Navy Yard shooting 2013 Washington, D.C. 12 (plus the perp.) 8 (3 from gunfire) Semi-automatic pistol and shotgun Virginia Beach shooting 2019 Virginia Beach, Virginia 12 (plus the perp.) 4 Semi-automatic pistols 25 Monterey Park shooting 2023 Monterey Park, California 11 (plus the perp.) 9 Semi-automatic pistol Jacksonville shooting 1990 Jacksonville, Florida 11 (plus the perp.) 6 Semi-automatic carbine and revolver Florida Gunman Kills 8 And Wounds 6 in Office - New York Times. Nytimes.com (1990-06-19). Retrieved on 2023-06-17. Pittsburgh synagogue shooting 2018 Pittsburgh, Pennsylvania 11 6 (plus the perp.) Semi-automatic rifle and pistols Easter Sunday Massacre 1975 Hamilton, Ohio 11 0 Semi- automatic pistols and revolver 29 Santa Fe High School shooting 2018 Santa Fe, Texas 10 13 (plus the accused) Shotgun and revolver Geneva County shootings 2009 Geneva County, Alabama 10 (plus the perp.) 6 Semi-automatic rifles, revolver, and shotgun Buffalo supermarket shooting 2022 Buffalo, New York 10 3 Semi-automatic rifle Boulder shooting 2021 Boulder, Colorado 10 1 (plus the accused)The civilian injury was indirect Semi-automatic pistols Palm Sunday massacre 1984 Brooklyn, New York 10 0 Semi-automatic pistols ==Mass shootings in 2024== 2024 date Location State or territory Dead Injured . Description November 10 Atlanta (the 6th mass shooting in Atlanta, in 2024) Georgia 0 4 It happened on the southeast side of the city. November 10 Tuskegee (the 2nd mass shooting in Tuskegee, in 2024) Alabama 1 12 Tuskegee University shooting. ==Notes== ==References== *",
 "title": "Mass shootings in the United States"
}