{
 "id": "931540",
 "text": "On May 24, 2022, a mass shooting took place at Robb Elementary School in Uvalde, Texas, United States, when 18-year old Salvador Ramos shot and killed 21 people and injured 17 others. Of the people fatally shot, 19 were students and two were teachers. Earlier that day, Ramos reportedly shot and critically wounded his grandmother. The attack was the deadliest school shooting in Texas history, the deadliest mass shooting at a U.S. elementary school since the Sandy Hook Elementary School shooting in 2012, the deadliest U.S. school shooting since the Stoneman Douglas High School shooting in 2018, and the 9th deadliest mass shooting in U.S. history. ==Background== In 2022, the school had about 600 students in the second through fourth grades. The majority of them were Latino. The school district had many security measures at the time of the shooting, including four officers working within the school district and a security staff. ==Shooting== The shooter is said to have entered the school at around 11:30a.m. CDT. Police say the shooting began two minutes later, and according to a Facebook post by the school, the school was put on lockdown at 11:43a.m. in response to gunshots in the neighborhood. U.S. Border Patrol agents began shooting at Ramos after responding to the shooting. Ramos fired back until being shot and killed by a patrol agent. The children killed were from 2nd, 3rd and 4th grade with ages ranging from aged 7 to 11. The shooting came less than two weeks after a mass shooting in Buffalo, New York that killed ten people. ===Victims=== The nineteen students and two teachers killed in the shooting were: * Uziyah Garcia, 9 * Xavier Javier Lopez, 10 * Jose Flores, 10 * Miranda Mathis, 11 * Eva Mireles, 44 * Ellie Garcia, 10 * Tess Marie Mata, 10 * Eliahana \"Elijah\" Cruz Torres, 10 * Annabell Guadalupe Rodriguez, 10 * Irma Garcia, 48 * Nevaeh Bravo, 10 * Makenna Elrod, 10 * Maite Yuleana Rodriguez, 10 * Alithia Ramirez, 10 * Jayce Carmelo Luevanos, 10 * Jailah Nicole Silguero, 11 * Rogelio Torres, 10 * Alexandria \"Lexi\" Aniyah Rubio, 10 * Amerie Jo Garza, 10 * Jackie Cazares, 10 * Layla Salazar, 10 Joe García, husband of Irma García, one of the teachers killed in the shooting, died afterwards of a heart attack, with his family saying he died of \"grief\". ==Shooter== Salvador Rolando Ramos (May 16, 2004 – May 24, 2022) was from North Dakota and lived in Uvalde. He had Hispanic ancestry. Before the shooting, he had no criminal record or documented mental health issues. He had a stutter and a strong lisp and was bullied because of it. He dropped out of high school because of bad attendance and would often get into fights with some of his classmates. Ramos legally bought a semi-automatic rifle from a local gun store on May 17, 2022, a day after his 18th birthday, and bought another rifle three days later. He had also bought an AR-15 style rifle eight days before the shooting. On May 18, 2022, he bought 375 rounds of ammunition. ==Aftermath== U.S. President Joe Biden addressed the nation on the night of the shooting and said: \"As a nation we have to ask when in God's name are we going to stand up to the gun lobby...I am sick and tired of it -- we have to act.\" Biden did not lay out any plan to take action, which disappointed gun control activists. A study found that 90% of Americans supported universal background checks for gun buyers. Former presidents Bill Clinton, Barack Obama and Donald Trump, and many worlds leaders reacted to the shooting such as Canadian Prime Minister Justin Trudeau, French President Emmanuel Macron, New Zealand Prime Minister Jacinda Ardern, Pope Francis, Ukrainian President Volodymyr Zelenskyy, and United Nations Secretary-General António Guterres. ===Police response=== In the aftermath of the shooting, the Uvalde police response was criticized for not acting quickly. The police were outside the school and did not enter the school for 40 minutes to an hour after Ramos had entered the building and began shooting. ==References== Category:2022 murders in the United States Category:2022 in Texas Category:Mass murder in 2022 Category:Mass murder in Texas Category:Mass shootings in Texas Category:May 2022 events Category:Elementary school shootings in the United States",
 "title": "Robb Elementary School shooting"
}