{
 "id": "931632",
 "text": "HAMLET (from Human Alpha-lactalbumin Made LEthal to Thumor cells) is a chemical compound of alpha-lactoalbumin and oleic acid. It can kill cancer cells. HAMLET could be used in chemotherapy. == History == Catharina Svanborg, immunologist at Lund University, and her student Anders Håkansson began experimenting in 1992 with human milk, microbes and cells in routine research. By chance, they saw that isolated cancer cells decreased in contact with milk. They formed a team of thesis students to study this and to work out how it happened. They wanted to find what causes it. In 1995, Håkansson found a compound in human milk that induced what appeared to be apoptosis in human lung carcinoma, pneumococcal bacteria and other pathogens, leaving healthy cells unaffected. It was the perfect cure in that case. The Vice President of the American Cancer Society traveled to Sweden and gave them money to continue research. The company HAMLET Pharma was created to explore the compound. The active compound was found in 2000. == Composition == Human alpha-lactoalbumin serves as a cofactor to make lactose. It does not kill cancer cells. . It allow the release of the calcium ion and its replacement by an oleic acid molecule. The molecule must be partially folded . Oleic acid does that. == Mechanism of action == HAMLET attacks on many different cell organelles, including mitochondria, proteasomes, and histones. It interferes with cellular processes such as macroautophagy. HAMLET has been shown to bind to the cell surface and rapidly invade cells. Tumor cells absorb much more protein than healthy, differentiated cells. HAMLET damages mitochondrial membranes. Another target of HAMLET is the proteasome HAMLET also targets the nucleus. It interacts with histones to interfere with transcription processes. HAMLET cells have shown the physiological characteristics of macroautophagy, a process in which cellular components are sequestered into double-membrane- bound vesicles that fuse with lysosomes for degradation. HAMLET and cells under amino acid starvation conditions (an initiator of macroautophagy) showed similar expression patterns of autophagocytotic proteins and responded equally well to the addition of inhibitors of macroautophagy. == Research == === Antibiotic adjuvant === Although HAMLET alone is not active against most bacteria, when it is present along with antibiotics, HAMLET can help. HAMLET can cause MRSA bacteria to be sensitive to methicillin, vancomycin, gentamicin, and erythromycin. === Tumors === Research is underway to determine if this could be a possible treatment for cancer. Animal models of glioblastoma have been successfully studied. The first human trial of the therapy was on benign skin growths (warts) and showed positive results with no side effects. It is being studied in carcinomas of the lung, throat, kidney, colon, bladder, prostate, and ovaries, as well as in melanomas, glioblastomas, and leukemias. A study of bladder cancer in a mouse found that it caused the elimination of TUNEL-positive cancer cells in the urine, with no adverse side effects on healthy cells. == Audiovisuals == BBC presented Howard Cohen as an American physicist-theorist with prostate cancer diagnosed in 1999 who decided to start a diet with human breast milk after reading works on HAMLET. Anders Håkansson mentioned that, since it is a protein complex, most of it is digested in the stomach, and it is not known how much of the compound can reach a tumor. Cohen has appeared in several US TV-news . In 2020 he participated in Netflix's (Un)Well program on human milk. The program addresses the various practices of consuming human milk in adults, including unregulated online shopping and its use by bodybuilders for alleged unproven benefits. == References == == Related pages == * Cancer * Chemotherapy * History of chemotherapy == Other websites == * * This is HAMLET - The movie - YouTube * (One) Well - Netflix Documentary Series Chapter 3 on Breast Milk Category:Molecular biology Category:Proteins",
 "title": "HAMLET (protein complex)"
}