{
 "id": "932106",
 "text": "The Wagner Group (Russian: Группа Вагнера, Gruppa Vagnera), officially PMC Wagner (Russian: ЧВК «Вагнер», ChVK «Vagner»),\"What is the Wagner Group, Russia's mercenary organisation?\". The Economist. ISSN 0013-0613. Retrieved 16 March 2022. is a Russian paramilitary, mercenary group, and private military company founded in 2014 by the late Dmitry Utkin and Yevgeny Prigozhin. The group is well known for its alleged involvement in war crimes and neo-Nazism. It usually fights on the side of the Russian government and is sometimes considered Vladimir Putin's private militia, although it rebelled against the Russian government briefly in 2023. The group is currently led by Pavel Prigozhin. The Wagner Group came to prominence during the War in Donbas and the Russian invasion of Ukraine, especially in the Battle of Bakhmut. It previously helped separatist forces of the self-declared Donetsk and Luhansk People's Republics from 2014 to 2015. Its contractors have taken part in various conflicts around the world—including the civil wars in Syria (on behalf of the Syrian Armed Forces), Libya (on behalf of the Libyan National Army), the Central African Republic (on behalf of the Central African Armed Forces), Mali (on behalf of the Malian Armed Forces), and Sudan (on behalf of the Rapid Support Forces). Additional activities have been reported, though unconfirmed, in the Democratic Republic of the Congo (on behalf of the Armed Forces of the Democratic Republic of the Congo). It usually fights on the side of forces aligned with the Russian government. In 2023, the Wagner Group launched a rebellion against the Russian Ministry of Defense. The leader of the company, Yevgeny Prigozhin, claimed that the Russian Armed Forces had attacked his forces and that Wagner was going to unleash revenge upon the Russian government. This was followed by a battle in Rostov-on-Don. The rebellion ended after Belarusian President Alexander Lukashenko negotiated a peace deal. Following the rebellion, Wagner was de jure dissolved in Russia and many of its fighters were forced to sign contracts with the Ministry of Defense. The de facto remnants of the group relocated to Belarus and set up new bases just north of the border with Ukraine. Not long afterwards, the 2023 Niger coup d'état allowed a military junta to seize power in Niger. The new government allowed Wagner to establish a presence. A month later, Prigozhin and Utkin were presumed dead in the 2023 Tver plane crash. After Prigozhin's death, his son Pavel Prigozhin became the new leader of the group. Wagner forces began returning to the Russian invasion of Ukraine, although many of the group's previous activities in Ukraine had been mostly taken over by Redut. Wagner also joined the 2023 Israel–Hamas war on the side of Hezbollah. == Leadership == The Wagner Group started in 2014 when Russia took over Crimea. Until 2022, it wasn't clear who started and ran the group. Dmitry Utkin and Yevgeny Prigozhin were both named as founders and leaders. During Russia's invasion of Ukraine, Prigozhin said he started Wagner and was its head. Some sources say Prigozhin paid for it, while Utkin led its military side. === Yevgeny Prigozhin === People talked a lot about Prigozhin being connected to Wagner and Utkin. He was called \"Putin's chef\" because he cooked for Putin. He was thought to give the most money and really own Wagner. He said he wasn't connected to Wagner and even sued some news sources for saying he was. In 2022, he said he started the group and called it the Wagner Battalion. He became the face of Wagner, but he wasn't in the military, so Utkin actually led the fighting. === Dmitry Utkin === Utkin was in the Russian military before Wagner. He was a commander in special forces and fought in wars. Many say he founded Wagner and led it at first. Some say he named the group after his fake name \"Wagner.\" The European Union put sanctions on Wagner and said Utkin was the leader. He was in charge of the fighting part, while Prigozhin owned it. === Konstantin Pikalov === Pikalov was in charge of Wagner's work in Africa in 2019. He was in a special military unit in Russia before. After he retired, he ran a detective agency. He helped suppress opponents of a Russian-backed leader. He traveled near Ukraine a lot and was part of military actions there and in Syria. == Foreign relations == === Allies === * Armed Forces of Belarus * Armed Forces of the Democratic Republic of the Congo * Armed Forces of the Russian Federation * Black Russians * Central African Armed Forces * Hezbollah * Islamic Revolutionary Guard Corps * Libyan National Army * Malian Armed Forces * Mozambique Defense Armed Forces * National Bolivarian Armed Forces of Venezuela * Niger Armed Forces * PMC \"Convoy\" * Rapid Support Forces * Syrian Armed Forces === Opponents === * Al- Qaeda * Armed Forces of Ukraine * Coalition of Patriots for Change * ECOWAS * Free Syrian Army * Libyan Armed Forces * March 23 Movement * Islamic State of Iraq and the Levant * Israel Defense Forces * Lord's Resistance Army * Sudanese Armed Forces == Related pages== *2023 Israel–Hamas war *2023 Sudan conflict *2023 Tver plane crash *Annexation of Crimea by the Russian Federation *Central African Republic Civil War *Insurgency in Cabo Delgado *Mali War *PMC \"Convoy\" *Russian invasion of Ukraine *Second Libyan Civil War *South Sudanese Civil War *Sudanese Revolution *Syrian civil war *Venezuelan presidential crisis *Wagner Group rebellion *War in Donbas (2014–2022) == References == Category:Russian military organizations Category:Mercenaries",
 "title": "Wagner Group"
}