{
 "id": "932392",
 "text": "Mohammad Babar Azam (Urdu, ; ; born 15 October 1994), is a Pakistani international cricketerWho Is Play For Pakistan Cricket Team In ODI AND TEST and the former captain of the Pakistan national cricket team. He is a right- handed top-order batter and he captains Peshawar Zalmi in the Pakistan Super League. ==Career== In May 2015, Babar received his call-up to the Pakistani ODI squad during a home series against Zimbabwe. He marked his ODI debut in the third ODI match on May 31st, showcasing his talent by scoring a solid fifty with 54 runs from 60 balls. This impressive start earned him a spot in both the Test and ODI squads for an upcoming series against Sri Lanka, although he didn't play in the Test matches. In the subsequent ODI series, he had a more modest performance, scoring 37 runs in the two matches he participated in. Babar's journey continued as he was included in the squad for the away ODI series against Zimbabwe in September 2015. He made his Twenty20 International debut for Pakistan against England on 7 September 2016. He scored an unbeaten 15 runs off 11 balls. Pakistan won that match as well as series. He made his Test debut for Pakistan against the West Indies in Dubai on 13 October 2016 and scored 69 runs in his first innings. He was the first player to score a fifty on his Test debut through a day/night Test. In the Champions Trophy 2017, Azam scored 46 off 52 balls in the final match against India. Following an impressive Champions Trophy tour, the ICC sent the the World XI team to visit Pakistan for a series of three T20I matches. Azam stood out as the highest run-scorer in the series, amassing an impressive total of 179 runs. At the 2017 PCB awards, he was awarded Pakistan's ODI Player of the year. Babar captains Karachi Kings in the PSL and captains Central Punjab in domestic cricket. In April 2021, he was the number one spot in the ICC rankings for ODI batsmen. While in November 2021, he became the number one T20I batsman, a ranking he held in 2018. ==References== ==Other websites== * Babar Azam from Cricbuzz Category:1994 births Category:Living people Category:Pakistani cricketers",
 "title": "Babar Azam"
}