{
 "id": "932391",
 "text": "Climate models are mathematical models that are used to study climate on a planet, and how it changes over time. Climate modelling is very complex, and numerical methods are used, most of the time. Climate models look at how different things, such as the atmosphere, oceans, land surface and ice interact. Climate models are used for different things, such as looking at how the climate in one spot on the earth will be, in the future. Climate models may also be qualitative (i.e. not numerical) models and also narratives, largely descriptive, of possible futures. Quantitative climate models take account of incoming energy from the sun as short wave electromagnetic radiation, chiefly visible and short-wave (near) infrared, as well as outgoing long wave (far) infrared electromagnetic. An imbalance results in a change in temperature. There are different quantitative models: Some are simpler, and others are more complex. A simple model might look at radiant heat tansfer. It may treat the earth as a single point, and only take averages of outgoing energy. Complexity can then be added. Coupled atmosphere–ocean–sea ice global climate models solve the full equations for mass and energy transfer and radiant exchange. In addition, other types of modelling can be interlinked, such as land use, in Earth System Models, allowing researchers to predict the interaction between climate and ecosystems. == Box models == Box models are simplified versions of complex systems, reducing them to boxes (or reservoirs) linked by fluxes. The boxes are assumed to be mixed homogeneously. Within a given box, the concentration of any chemical species is therefore uniform. However, the abundance of a species within a given box may vary as a function of time due to the input to (or loss from) the box or due to the production, consumption or decay of this species within the box. Simple box models, i.e. box model with a small number of boxes whose properties (e.g. their volume) do not change with time, are often useful to derive analytical formulas describing the dynamics and steady-state abundance of a species. More complex box models are usually solved using numerical techniques. Box models are used extensively to model environmental systems or ecosystems and in studies of ocean circulation and the carbon cycle. They are instances of a multi- compartment model. == Climate models on the web == * Dapper/DChart — plot and download model data referenced by the Fourth Assessment Report (AR4) of the Intergovernmental Panel on Climate Change. (No longer available) * NCAR/UCAR Community Climate System Model (CCSM) * Do it yourself climate prediction * Primary research GCM developed by NASA/GISS (Goddard Institute for Space Studies) * Original NASA/GISS global climate model (GCM) with a user-friendly interface for PCs and Macs * CCCma model info and interface to retrieve model data * NOAA/Geophysical Fluid Dynamics Laboratory CM2 global climate model info and model output data files * Dry idealized AGCM based on above GFDL CM2M. Jucker, S. Fueglistaler and G. K. Vallis \"Stratospheric sudden warmings in an idealized GCM\". Journal of Geophysical Research: Atmospheres 2014 119 (19) 11,054-11,064; * Model of an idealized Moist Atmosphere (MiMA): based on GFDL CM2. Complexity in-between dry models and full GCMsM. Jucker and E. P. Gerber: \"Untangling the Annual Cycle of the Tropical Tropopause Layer with an Idealized Moist Model\". Journal of Climate 2017 30 (18) 7339-7358; * University of Victoria Global climate model, free for download. Leading researcher was a contributing author to an IPCC report on climate change. * vimeo.com/user12523377/videos Visualizations of climate models of ETH Zurich * Empirical Climate Model == Related pages == * Numerical Weather Prediction * Tropical cyclone prediction model == References == == Bibliography == * == Other websites == * Coupled Model Intercomparison Project * On the Radiative and Dynamical Feedbacks over the Equatorial Pacific Cold Tongue * Basic Radiation Calculations — The Discovery of Global Warming * * Climate Modeling 101 website by the U.S. National Research Council — This site is a primer on how climate models work. The information is based on expert, consensus reports from the U.S. National Research Council's Board on Atmospheric Sciences and Climate. The most recent is A National Strategy for Advancing Climate Modeling . * Why results from the next generation of climate models matter CarbonBrief, Guest post by Belcher, Boucher, Sutton, 21 March 2019 * Builder Insight - Modelling the Future Climate in Passively Cooled Buildings Category:Mathematical analysis Category:Climate",
 "title": "Climate model"
}