{
 "id": "932688",
 "text": "Yeti Airlines Pvt. Ltd. (Nepali: यती एअरलाइन्स) is an airline based in Kathmandu, Nepal. The airline was established in May 1998 and received its Air Operators Certificate on 17 August 1998. == Accidents and incidents == * 25 May 2004 – Yeti Airlines Flight 117: A Yeti Airlines de Havilland Canada DHC-6 Twin Otter (registration 9N-AFD) cargo flight crashed into a hill on approach to Lukla. * 21 June 2006 – 2006 Yeti Airlines Twin Otter Crash: A DHC-6 Twin Otter registered 9N-AEQ was destroyed in a rice paddy field on approach to Jumla, killing all six passengers and the crew of three. * 8 October 2008 – Yeti Airlines Flight 103: A DHC-6 was destroyed upon landing at Lukla, killing all eighteen passengers and two of the three crew. The captain was the only survivor. * 24 September 2016 – Yeti Airlines Flight 893: A BAe Jetstream 41 registration 9N-AIB en route from Kathmandu to Bhairahawa overran the runway while landing at Gautam Buddha Airport. None of the 29 passengers or crew of 3 were hurt but the aircraft was damaged beyond repair. * 1 March 2019 – Following the 2019 Taplejung helicopter crash, Yeti Airlines halted all of their flights on 1 March 2019 mourning the loss of their managing director Ang Tshering Sherpa. * 12 July 2019 – A Yeti Airlines ATR 72-500 registration 9N-AMM en route from Nepalgunj Airport to Tribhuvan International Airport suffered a runway excursion while landing. All 68 people onboard including the crew of 4 evacuated the aircraft safely. Two of them received minor injuries and were taken to the hospital. A wet runway during the rainy season could have been the cause. * On 29 May 2022, a 9N-AET Twin Otter Tara Air aircraft with 19 passengers and 3 crew members operating for subsidiary Yeti Airlines as Yeti Airlines Flight 1199 lost contact with the control tower that was travelling from Pokhara-Jomsom shortly after take off. The last contact with the aircraft was made in Lete Pass. The aircraft was found crashed on Sanosware, Thasang 2, Mustang. ==References== Category:Airlines of Asia Category:20th-century establishments in Nepal",
 "title": "Yeti Airlines"
}