{
 "id": "932611",
 "text": "The 2022–23 UEFA Champions League was the 68th season of Europe's premier club football tournament organized by UEFA. Manchester City defeated Inter Milan at the Atatürk Olympic Stadium in Istanbul, Turkey. The stadium was originally appointed to host the 2020 UEFA Champions League Final, but both this, and the 2021 final which had been eventually re-allocated to the Atatürk, were moved due to the COVID-19 pandemic. As winners Manchester City automatically qualified for the 2023–24 UEFA Champions League group stage, and earned the right to play against the winner of the 2022–23 UEFA Europa League, Sevilla, in the 2023 UEFA Super Cup and the 2023 FIFA Club World Cup, winning both. Real Madrid were the defending champions, but were eliminated by Manchester City in the semifinals. ==Association team allocation== A total of 78 teams from 53 of the 55 UEFA member associations participate in the 2022–23 UEFA Champions League (the exceptions being Russia, who are banned from participating due to 2022 Russian invasion of Ukraine, and Liechtenstein, which does not organise a domestic league). The association ranking based on the UEFA association coefficients is used to determine the number of participating teams for each association: *Associations 1–4 each have four teams qualify. *Associations 5–6 each have three teams qualify. *Associations 7–15 (except Russia) each have two teams qualify. *Associations 16–55 (except Liechtenstein) each have one team qualify. *The winners of the 2021–22 UEFA Champions League and 2021–22 UEFA Europa League are each given an additional entry if they do not qualify for the 2022–23 UEFA Champions League through their domestic league. ===Association ranking=== For the 2022–23 UEFA Champions League, the associations are allocated places according to their 2021 UEFA association coefficients, which takes into account their performance in European competitions from 2016–17 to 2020–21. Apart from the allocation based on the association coefficients, associations may have additional teams participating in the Champions League, as noted below: * – Additional berth for UEFA Europa League title holders Association ranking for 2022–23 UEFA Champions League {| class=\"wikitable\" Rank Association Coeff. Teams Notes 1 100.569 4 2 97.855 4 3 75.438 4 4 73.570 4 5 56.081 3 6 48.549 3 7 39.200 2 8 38.382 0 9 36.500 2 10 35.825 2 11 33.375 2 12 33.100 2 13 30.100 2 14 27.875 2 15 27.750 2 16 26.750 1 17 26.600 1 18 26.275 1 19 26.225 1 ===Distribution=== The following is the access list for this season. Access list for 2022–23 UEFA Champions League Teams entering in this round Teams advancing from previous round Preliminary round (4 teams) Preliminary round (4 teams) *4 champions from associations 52–55 First qualifying round (30 teams) First qualifying round (30 teams) *29 champions from associations 22–51 (except Liechtenstein) *1 winner from the preliminary round Second qualifying round (24 teams) Champions Path (20 teams) *5 champions from associations 17–21 *15 winners from the first qualifying round Second qualifying round (24 teams) League Path (4 teams) *4 runners-up from associations 12–15 Third qualifying round (20 teams) Champions Path (12 teams) *2 champions from associations 15–16 *10 winners from the second qualifying round (Champions Path) Third qualifying round (20 teams) League Path (8 teams) *4 runners-up from associations 7–11 (except Russia) *2 third-placed teams from associations 5–6 *2 winners from the second qualifying round (League Path) Play-off round (12 teams) Champions Path (8 teams) *2 champions from associations 13–14 *6 winners from the third qualifying round (Champions Path) Play-off round (12 teams) League Path (4 teams) *4 winners from the third qualifying round (League Path) Group stage (32 teams) Group stage (32 teams) *Europa League title holders *11 champions from associations 1–12 (except Russia) *6 runners-up from associations 1–6 *4 third-placed teams from associations 1–4 *4 fourth-placed teams from associations 1–4 *4 winners from the play-off round (Champions Path) *2 winners from the play-off round (League Path) Knockout phase (16 teams) Knockout phase (16 teams) *8 group winners from the group stage *8 group runners-up from the group stage Due to the suspension of Russia for the 2022–23 European season, and since the Champions League title holders (Real Madrid) have qualified via their domestic league, the following changes to the access list have been made: *The champions of association 11 (Scotland) and 12 (Ukraine) enter the group stage instead of the play-off round (Champions Path). *The champions of association 13 (Turkey) and 14 (Denmark) enter the play-off round instead of the third qualifying round (Champions Path). *The champions of association 15 (Cyprus) and 16 (Serbia) enter the third qualifying round instead of the second qualifying round (Champions Path). *The champions of associations 18 (Croatia), 19 (Switzerland), 20 (Greece) and 21 (Israel) enter the second qualifying round instead of the first qualifying round (Champions Path). *The runners-up of associations 10 (Austria) and 11 (Scotland) enter the third qualifying round instead of the second qualifying round (League Path). ===Teams=== The labels in the parentheses show how each team qualified for the place of its starting round: *TH: Champions League title holders *EL: Europa League title holders *1st, 2nd, 3rd, 4th, etc.: League positions of the previous season *Abd-: League positions of abandoned season as determined by the national association; all teams are subject to approval by UEFA The second qualifying round, third qualifying round and play-off round are divided into Champions Path (CH) and League Path (LP). CC: 2022 UEFA club coefficients. Qualified teams for 2022–23 UEFA Champions League Entry round Entry round Teams Teams Teams Teams Group stage Group stage Real Madrid TH Eintracht Frankfurt Manchester City Liverpool Group stage Group stage Chelsea Tottenham Hotspur Barcelona Atlético Madrid Group stage Group stage Sevilla Milan Inter Milan Napoli Group stage Group stage Juventus Bayern Munich Borussia Dortmund Bayer Leverkusen Group stage Group stage RB Leipzig Paris Saint-Germain Marseille Porto Group stage Group stage Sporting CP Ajax Club Brugge Red Bull Salzburg Group stage Group stage Celtic Shakhtar Donetsk Play-off round Trabzonspor Copenhagen Third qualifying round Apollon Limassol Red Star Belgrade Third qualifying round Monaco Benfica PSV Eindhoven Union Saint- Gilloise Third qualifying round Sturm Graz Rangers Second qualifying round Viktoria Plzeň Dinamo Zagreb Zürich Olympiacos Second qualifying round Maccabi Haifa Second qualifying round Dynamo Kyiv Fenerbahçe Midtjylland AEK Larnaca First qualifying round First qualifying round Bodø/Glimt Malmö FF Ludogorets Razgrad CFR Cluj First qualifying round First qualifying round Qarabağ Tobol Ferencváros Shakhtyor Soligorsk First qualifying round First qualifying round Lech Poznań Maribor Slovan Bratislava Žalgiris First qualifying round First qualifying round F91 Dudelange Zrinjski Shamrock Rovers Shkupi First qualifying round First qualifying round Pyunik RFS Tirana Linfield First qualifying round First qualifying round Dinamo Batumi HJK Sheriff Tiraspol Hibernians First qualifying round First qualifying round KÍ Ballkani Lincoln Red Imps Sutjeska Nikšić First qualifying round First qualifying round The New Saints Preliminary round Preliminary round Víkingur Reykjavík FCI Levadia Inter Club d'Escaldes La Fiorita Notes ==Schedule== The schedule of the competition is as follows. All matches are played on Tuesdays and Wednesdays apart from the preliminary round final. Scheduled kick-off times starting from the play-off round are 18:45 and 21:00 CEST/CET. As the 2022 FIFA World Cup takes place in Qatar between 21 November and 18 December 2022, the group stage will commence in the first week of September 2022 and conclude in the first week of November 2022 to make way for the World Cup. All draws start at 12:00 CEST/CET and are held at the UEFA headquarters in Nyon, Switzerland. Schedule for 2022–23 UEFA Champions League Phase Round Draw date First leg Second leg Qualifying Preliminary round 7 June 2022 21 June 2022 (semi-finals) 24 June 2022 (final) First qualifying round 14 June 2022 5–6 July 2022 12–13 July 2022 Second qualifying round 15 June 2022 19–20 July 2022 26–27 July 2022 Third qualifying round 18 July 2022 2–3 August 2022 9 August 2022 Play-offs Play-off round 1 August 2022 16–17 August 2022 23–24 August 2022 Group stage Matchday 1 25 August 2022 6–7 September 2022 Matchday 2 13–14 September 2022 Matchday 3 4–5 October 2022 Matchday 4 11–12 October 2022 Matchday 5 25–26 October 2022 Matchday 6 1–2 November 2022 Knockout phase Round of 16 7 November 2022 14–15 & 21–22 February 2023 7–8 & 14–15 March 2023 Quarter-finals 17 March 2023 11–12 April 2023 18–19 April 2023 Semi-finals 9–10 May 2023 16–17 May 2023 Final 10 June 2023 at Atatürk Olympic Stadium, Istanbul ==Qualifying rounds== ===Preliminary round=== ===First qualifying round=== ===Second qualifying round=== ===Third qualifying round=== ==Play-off round== ==Group stage== The draw for the group stage will be held on 25 August 2022. The 32 teams will be drawn into eight groups of four. For the draw, the teams are seeded into four pots, each of eight teams, based on the following principles: *Pot 1 contain the Champions League and Europa League title holders, and the champions of the top six associations based on their 2021 UEFA country coefficients. Since the Champions League titleholders, Real Madrid, are also the champions of Association 2 (Spain), the champions of Association 7 (Netherlands), Ajax, will also be seeded into Pot 1. *Pots 2, 3 and 4 contain the remaining teams, seeded based on their 2022 UEFA club coefficients. Teams from the same association could not be drawn into the same group. Eintracht Frankfurt will make their debut appearance in the group stage after winning Europa League. This season is also the first in which five German clubs will play in the group stage. Pot 1 * Real Madrid CC: 124.000 * Eintracht Frankfurt CC: 61.000 * Manchester City CC: 134.000 * Milan CC: 38.000 * Bayern Munich CC: 138.000 * Paris Saint-Germain CC: 112.000 * Porto CC: 80.000 * Ajax CC: 82.500 Pot 2 * Liverpool CC: 134.000 * Chelsea CC: 123.000 * Barcelona CC: 114.000 * Juventus CC: 107.000 * Atlético Madrid CC: 105.000 * Sevilla CC: 91.000 * RB Leipzig CC: 83.000 * Tottenham Hotspur CC: 83.000 Pot 3 * Borussia Dortmund CC: 78.000 * Red Bull Salzburg CC: 71.000 * Shakhtar Donetsk CC: 71.000 * Inter Milan CC: 67.000 * Napoli CC: 66.000 * Sporting CP CC: 55.500 * Bayer Leverkusen CC: 53.000 Pot 3 or 4 * Marseille CC: 44.000 * 2 winners from the play-off round (League Path) * 4 winners from the play-off round (Champions Path) Pot 4 * Club Brugge CC: 38.500 * Celtic CC: 33.000 ===Group A=== ===Group B=== ===Group C=== ===Group D=== ===Group E=== ===Group F=== ===Group G=== ===Group H=== == Final == The final was played on 10 June 2023 at the Atatürk Olympic Stadium in Istanbul. A draw was held on 17 March 2023, after the quarter-final and semi-final draws, to determine the \"home\" team for administrative purposes. ==References== ==Other websites== *",
 "title": "2022–23 UEFA Champions League"
}