{
 "id": "932671",
 "text": "Sussan Penelope Ley (pron. ; ; born 14 December 1961) is an Australian politician who has been the Leader of the Liberal Party and Leader of the Opposition since 2025. She is the first female to hold both roles. Ley is a member of the Liberal Party and has served as member of parliament (MP) for the New South Wales seat of Farrer since 2001. In 2022, she was elected Deputy Leader of the Liberal Party and became Deputy Opposition Leader. She was a cabinet minister in the Abbott, Turnbull and Morrison governments. ==Early life== Ley was born in Kano, Nigeria to English parents. She grew up in the United Arab Emirates and England before moving to Australia as a teenager. ==Political career== She was the Minister for Education (2013–2014), Minister for Health (2014–2016), Sport (2014–2017), Aged Care (2015–2016), and Health and Aged Care (2016–2017). She resigned from the ministry in January 2017. She was the Minister for the Environment before the Morrison government's defeat at the 2022 federal election. == Leader of the Opposition (2025–present) == Ley became acting leader of the Liberal Party after the 2025 federal election in which party leader Peter Dutton lost re-election for his seat of Dickson. Ley was elected as the party and Coalition's new leader, and therefore as the new Leader of the Opposition, when she defeated conservative opponent Angus Taylor by 29 votes to 25 in the subsequent leadership election. Ley made history as the first woman elected to lead the Liberals, the Coalition or serve as Leader of the Opposition. Ley is also the oldest first-time Leader of the Opposition since Arthur Calwell became opposition leader in 1960. ==References== Category:1961 births Category:Living people Category:Liberal Party of Australia politicians Category:Members of the Australian House of Representatives Category:Naturalised citizens of Australia Category:Politicians from New South Wales Category:Leaders of the Opposition (Australia)",
 "title": "Sussan Ley"
}