{
 "id": "932762",
 "text": "The National Rifle Association (NRA) is a charity in the United Kingdom. It was started in 1859. It is completely different from the National Rifle Association of America. Its purpose is to teach people how to use guns safely and to shoot accurately. The association owns the National Shooting Centre at Bisley in Surrey. == History == The National Rifle Association started in 1859, based on Wimbledon Common. Its aim was to raise money for a shooting competition each year (now called the Imperial Meeting) \"for the promotion of marksmanship in the interests of Defence of the Realm and permanence of the Volunteer Forces, Navy, Military and Air\". Today the association runs competitions and teaches firearm safety. ==The National Shooting Centre== The National Shooting Centre is owned by the National Rifle Association. The first centre was at Wimbledon, but it was too small and in the late 1880s the Association began looking for a new site. In 1888 it seemed that Cannock Chase would be the new place. However, that plan failed. Eventually Bisley in Surrey was selected. The shooting ranges at Bisley were used for the shooting competitions at the 1908 and 1948 Olympic Games and at the 2002 Commonwealth Games. ==Related pages== * List of shooting sports organizations ==References== == Further reading == * * Martin, John. \"The Transformation of Lowland Game Shooting in England and Wales in the Twentieth Century: The Neglected Metamorphosis.\" International Journal of the History of Sport 29.8 (2012): 1141-1158. * Osborne, Harvey, and Michael Winstanley. \"Rural and urban poaching in Victorian England.\" Rural History 17.2 (2006): 187–212. online * Margery Masterson, English Rifles: The Victorian NRA ==Other websites== * Category:Sports governing bodies in the United Kingdom Category:Rifle associations Category:Shooting sports in the United Kingdom Category:1859 establishments in the United Kingdom",
 "title": "National Rifle Association (United Kingdom)"
}