{
 "id": "932980",
 "text": "\"Jigelu Rani\" is a 2018 Indian Telugu-language song composed by Devi Sri Prasad for the soundtrack of the 2018 movie Rangasthalam sung by Rela Kumar and Ganta Venkata Lakshmi, with lyrics written by Chandrabose. It was released on 27 March 2018 as the first single from the album, through Lahari Music. The song was also released in Kannada as \"Jil Jil Jilebi Rani\". The hook step dance involving Pooja Hegde became popular. == Production == It was composed by Devi Sri Prasad from the 2018 soundtrack album Rangasthalam of the film of the same name. Prasad used a 70-year old clarinet as the song reflected the mood of Rajahmundry of the 1980s.https://timesofindia.indiatimes.com/entertainment/telugu/music/music-of- rangasthalam-has-become-a-rage-in-chennai-too-devi-sri- prasad/articleshow/63518699.cms The song is written by Chandrabose. Music video was choreographed by Jani Master.https://www.indiaglitz.com/ram-charan- plays-with-the-lungi-megastarstyle-telugu-news-210175 The song features Pooja Hegde as lead, along with Ram Charan. ==Release== The song was released as the lead single along with the soundtrack album on 27 March 2018. The music video was released on 27 March 2018 and has 265 million views on YouTube, . === Other versions === The song was released as \"Jil Jil Jilebi Rani\" in Kannada on 28 December 2020. It was sung by Rela Kumar and Mohana Bhogaraju, with lyrics written by V. Nagendra Prasad. The full video version of the song was released on 22 May 2022. ==Chart performance== The song debuted on Mirchi Music Top 20 countdown on 11 May 2018. It stayed on the chart for 8 weeks. It became the top-streamed songs of JioSaavn in their Most Popular Item Songs. Year Chart Peak position Time span on chart Ref. 2018 Mirchi Music Top 20 Countdown 2 8 weeks ==Live performance== On June 2018, Rela Kumar and Ganta Venkata Lakshmi performed the song at the Sa Re Ga Ma Pa. == Accolades == Award Date of ceremony Category Recipient(s) Result Radio City Cine Awards Telugu 1 March 2019 Best Lyricist Chandrabose Best Choreography Jani Master == Notes == == References == == Other websites == * * Category:2018 songs Category:Pooja Hegde songs",
 "title": "Jigelu Rani"
}