{
 "id": "933123",
 "text": "Benjamín Vicuña Luco (born November 29, 1978) is a Chilean film, theater and television actor and businessman, who has developed his career in Chile as well as in Argentina and Spain. Together with Gonzalo Valenzuela, he is the founder of the Mori Cultural Center. He was selected as the seventh best Chilean actor of all time by the Chile Elige list, in 2006. ==Childhood and studies== He is the youngest of the four children of Juan Pablo Vicuña Parot and Isabel Luco Morandé —the others are: Carolina (psychologist), María José (painter) and Juan Pablo (architect)—. His parents separated when he was 4 years old and his mother remarried Oussama Aboughazal. Upon finishing school, he entered the theater career at the University of Chile. There he discovered his companions, with whom he would later form \"El Hijo\", a theater company that has staged works such as \"El lugar comun\", \"Sala de urgencies\", \"Ifigenia\", \"Cuec@\" and \"La mujer gallina\". At this stage of his life, he also experienced \"street theater\", encouraged by the masters of Chilean theater: Fernando González, Alfredo Castro, Rodrigo Pérez and Ramón Griffero, to name a few. ==Television== Year Title Channel Character 2000 Vivir al Día Red Televisión 2001 Piel Canela Canal 13 Gabriel Vallejos 2002-2003 Purasangre TVN Rafael Callasis 2003 Pecadores TVN Herodes Barriga, El Piruja La vida es una lotería (episode: Pobre Millonario) TVN Javier Soto 2004 Destinos Cruzados TVN Franco Schiafino 2005-2010 Los Simuladores Canal 13 Gabriel Medina 2006-2008 Huaiquimán y Tolosa Canal 13 Richard Tolosa 2007 Héroes Canal 13 Manuel Rodríguez 2008-2009 Don Juan y su bella dama Telefe Franco Ramirez Puente 2010 Los Hombres de Paco (Spain) Antena 3 Deker 2011-2012 Herederos de una venganza Argentina Benicio Echagüe, El Maldito 2011-2013 Prófugos (LatinAmerica) HBO Alvaro Parraguez / Tegui 2011-2014 Los archivos del cardenal TVN Ramón Sarmiento 2012 La Dueña Telefe Félix Fernández 2013-2014 Farsantes El Trece Pedro Beggio 2015 Entre caníbales Telefe Agustín Larralde 2015-2018 Sitiados Fox, TVN Agustín González 2016 2091 Fox Lodi Por Fin Solos TVN Gonzalo Munoz 2017 Un Diablo Con Ángel TVN Gaspar Muñoz 2018 100 Days to Fall in Love Telefe Emiliano Iturria 2018-2019 Locked Up Fox Antonio Hierro 2019 Argentina, tierra de amor y venganza El Trece Torcuato Ferreyra 2019-2020 Berko: el arte de callar FOX/TVN Boris Berkowitz 2020 Inés del alma mía RTVE, Boomerang TV, Chilevisión Rodrigo de Quiroga 2021 Demente Mega Joaquín Acevedo The First of Us Telefe Santiago Terapia alternativa Star+ ==Other websites== * * Category:1978 births Category:Living people Category:Chilean movie actors Category:Chilean television actors Category:Chilean businesspeople",
 "title": "Benjamín Vicuña"
}