{
 "id": "93326",
 "text": "The Land Before Time is a 1988 movie produced by Steven Spielberg and directed by Don Bluth. It was released on November 18, 1988, along with Oliver & Company. The movie's success led to thirteen direct-to-video sequels and a TV show. The Little Mermaid was later released on November 17, 1989. It is the second of three animated features to have been nominated for the Academy Award for Best Picture. The Black Cauldron and Rock-a-Doodle were also nominated for Best Picture in their respective years. The film won the Academy Award for Best Animated Feature, beating two Disney films, The Rescuers Down Under and The Great Mouse Detective, as well as Best Sound Editing at the 77th Academy Awards. == Plot == During the dinosaur age, a famine forces dinosaur groups to look for an oasis called the Great Valley. An Apatosaurus hatches a single baby called Littlefoot. Years later, Littlefoot encounters and plays with Cera, a young Triceratops, until her father intervenes. In the evening, Littlefoot plays with Cera again, until a large Tyrannosaurus pursues them. Littlefoot's mother comes to their rescue. During their struggle, an earthshake strikes and splits the whole land, swallowing up the Tyrannosaurus, and dividing Littlefoot, Cera and other dinosaurs from their own herds; several of them become dead in the process. Before dying, Littlefoot's wounded mother gives him some words of advice about finding the Great Valley. Confused, and in-grief, Littlefoot meets Rooter, a Scolosaurus who consoles him. Later, he meets a young Saurolophus named Ducky, and a young Pteranodon named Petrie. Looking for her kind, Cera finds the unconscious Tyrannosaurus inside a ravine and wakes him up. She escapes, and while describing the encounter, she accidentally flings Ducky in the direction of a hatching egg, from which a male Stegosaurus emerges. One of the group names him as Spike. The next morning, after getting attacked by the Tyrannosaurus a third time, the group discovers the landmarks mentioned by Littlefoot's mother. When Ducky, Spike and Petrie are all trapped, Littlefoot returns to rescue them. Cera gets suddenly ambushed by a group of Pachycephalosaurus that live in the mountains. The rest of the group poses as the Tar Monster to scare the Pachycephalosaurus away. A new plan nearly fails when the Tyrannosaurus begins attacking, but at the end, the Gang of Five manages to defeat him once and for all. == Characters == There are five main characters known as the Gang of Five: Littlefoot: An Apatosaurus. He is brave, and good at making decisions. He lives with his grandparents in the Great Valley. Cera: A Triceratops. She is stubborn and does not trust easily. She is the most aggressive of the group. She lives with her father for most of the movies, but gains a new mother in the 11th movie and a younger sister in the 12th movie. Ducky: A Saurolophus. She is the nicest of the group, and trusts others easily. She lives with her mother (though her father does not appear) and says in the sixth film that she is one of thirteen twins, although the original series tht she is one of four. She also has her adopted brother Spike. Petrie: A Pteranodon. He gets scared very easily and is too trusting, but he is loyal and can be brave at important times. He lives with his mother and brothers. Spike: The youngest of the group. He is a Stegosaurus. Spike does not talk, though it was shown in the 4th movie that he can when he wants to. He enjoys eating and lets Ducky sit on his back if she needs to. Ducky is his older sister, since she adopted him during the first movie. He lives with Ducky's family. Also of note is a Tyrannosaurus named Chomper, who was born in the 2nd movie and was so popular with fans that he returned in the 5th movie and the TV series. He is friends with all the main characters, despite his natural instincts telling him to eat them. == Sequels == # The Land Before Time II: The Great Valley Adventure, directed by Roy Allen Smith # The Land Before Time III: The Time of the Great Giving, directed by Roy Allen Smith # The Land Before Time IV: Journey Through the Mists, directed by Roy Allen Smith # The Land Before Time V: The Mysterious Island, directed by Charles Grosvenor # The Land Before Time VI: The Secret of Saurus Rock, directed by Charles Grosvenor # The Land Before Time VII: The Stone of Cold Fire, directed by Charles Grosvenor # The Land Before Time VIII: The Big Freeze, directed by Charles Grosvenor # The Land Before Time IX: Journey to Big Water, directed by Charles Grosvenor # The Land Before Time X: The Great Longneck Migration, directed by Charles Grosvenor # The Land Before Time XI: Invasion of the Tinysauruses, directed by Charles Grosvenor # The Land Before Time XII: The Great Day of the Flyers, directed by Charles Grosvenor # The Land Before Time XIII: The Wisdom of Friends, directed by Jamie Mitchell # The Land Before Time: Journey of the Brave, directed by Davis Doi In addition to the movies, there is The Land Before Time: Sing-Along Songs (1997) and The Land Before Time: More Sing-Along Songs (1999) === TV Series === After the success of the original movie and its sequels, a television series based on the movies began airing on YTV in Canada as a test on January 5, 2007. It aired in Canada, Britain, and the United States of America, and had 26 episodes. It then aired on Cartoon Network in the United States on March 5, 2007 where it was animated after the DVD release of The Land Before Time XII: The Great Day of the Flyers.https://www.imdb.com/title/tt0473584/ \"The Land Before Time\" (2007) In the UK, it was once shown just on Boomerang, showing every day at 4pm, but it is now programmed on its sister preschool channel Cartoonito. It brought back Chomper as a main character, and introduced a new friend, an Oviraptor named Ruby, who helps the other dinosaurs learn lessons and solve problems. This was the second Bluth film not to include any songs, the first one being All Dogs Go to Heaven. == References == == Other websites == *The Official Land Before Time Site * * * Detailed Info on The Land Before Time (including plot detail) * The Land Before Time at RetroJunk.com * The Gang of Five * Download The Land Before Time TV Episodes From The TV Series! Category:1988 movies Category:1980s animated movies Category:1980s family movies Category:English- language movies Category:American family movies Category:Movies about dinosaurs Category:Movies about water scarcity Category:Universal Pictures movies Category:Movies directed by Don Bluth Category:Movies composed by James Horner Category:The Land Before Time movies",
 "title": "The Land Before Time"
}