{
 "id": "933326",
 "text": "Ansett New Zealand Flight 703 was an Ansett New Zealand airline flight between Auckland International Airport and Palmerston North International Airport. On June 9, 1995 at 9:22 am (local) he crashed to the ground just 16 km from the destination airport, amid adverse weather conditions and aircraft problems. The crashed aircraft, a DHC-8 (or Dash 8), was carrying 18 passengers and 3 crew members, almost all of whom were New Zealand citizens with the exception of one American passenger. Of the 21 people on board, 3 died from the collision and 1 from serious injuries. On the ground, only three grazing sheep perished due to the impact of the plane. ==Causes== According to the Australian investigation, the causes of the accident were pinned primarily on the captain and his first officer for the following reasons: * The pilot did not observe the power of the engines and the vertical speed of the plane because he was manually unfolding the landing gear, which could not lower automatically due to a fault. * The pilot urged skipping the landing procedures, not following the company's checklist for the plane. * Pilot and co-pilot distraction regarding landing gear failure. As for the Ground Proximity Warning System (GPWS), it was determined that it was working incorrectly as it gave a late warning, which was estimated to be activated 17 seconds before the impact, and not 4 seconds as it actually was. ==Heroism== Reginald John Dixon, a passenger on the flight, made it out of the wreckage with some injuries but then went back to help other passengers until he was severely burned by a blaze. He died of his burns two weeks later. For courage shown in a dangerous situation, this passenger was awarded the New Zealand Cross, New Zealand's highest citation for civilian bravery. == In popular culture == Ansett New Zealand Flight 703 was dramatised in the 8th episode of Season 21 on the show Air Crash Investigation titled \"Caught in a Jam\". ==References== Category:Airliner accidents and incidents involving controlled flight into terrain Category:Airliner accidents and incidents caused by pilot error",
 "title": "Ansett New Zealand Flight 703"
}