{
 "id": "933412",
 "text": "DHL Aero Expresso Flight 7216 (D07216) was an international cargo flight between Juan Santamaría International Airport, Costa Rica, and La Aurora International Airport, Guatemala City. On April 7, 2022, a Boeing 757-27A aircraft, registration HP-2010DAE, while performing service D07216, crashed at the Costa Rican airport with two crew members on board. The flight took off at 9:34 a.m. local time (UTC-6:00) from Juan Santamaría airport to La Aurora international airport for cargo delivery. However, while flying over the Costa Rican town of San Carlos, the aircraft declared an emergency due to hydraulic problems, so it made the decision to return to the air terminal, after holding a pattern to burn fuel, and touched down at 10:25 a.m. (local time). According to the videos recorded from the airport, the aircraft skidded on runway 07, turned south on the Kilo taxiway and lost its way, crashing into a ditch in front of the Costa Rica Fire Station and crashing. split in two. The pilot and co-pilot were evacuated in stable condition for further evaluation. ==Aircraft== The accident aircraft was a Boeing 757-27A, serial number 29610 LN:904, used by DHL Aero Expresso for its cargo flights; and powered by two Pratt & Whitney PW2037 engines. It was manufactured in the year 1996 and began operations as a passenger aircraft. Its first flight occurred on December 7, 1999 by the airline Far Eastern Air Transport, until 2002 when it passed into the hands of EVA Air and then in 2003 back to Far Eastern which operated it until May 13, 2008. when it ceased operations. On November 2, 2010, it passed into the hands of Aerolease and was converted into a freighter in October of that same year to be used by DHL Aero Expresso. In the period prior to the incident, the device flew quite frequently transporting cargo between the cities of San José, Mexico City, Guatemala City and others in Latin America. On February 11, 2022, the accident plane made an emergency landing without flaps at the Mexico City international airport, after declaring an emergency. On March 26, 2022, the same plane made an emergency landing at the airport Juan Santamaría from Costa Rica shortly after taking off for Guatemala, after suffering a loss of cabin pressurization. ==Accident== Luis Eduardo Miranda Muñoz, deputy director of the General Directorate of Civil Aviation of Costa Rica, told the media that the plane declared an emergency when it was 35 miles (56 kilometers) north of the Juan Santamaría airport and at an altitude of 19,000 feet ( 5.79 kilometers). The pilot, of Guatemalan origin, notified the control tower that they had problems with the hydraulic service, so he requested to return to the airport, going first to the waiting area located 25 miles southwest of the airport, on the Pacific coast of Costa Rica. At 10:00 am. The pilot in command declared an emergency and requested instructions to descend on runway 07. At the time of touchdown, the pilots applied the brakes, however, due to hydraulic problems on the left side, they began to skid on the runway. The plane made a 180-degree turn until it fell into a ditch next to the street that connects the air terminal with the station of the Meritorious Fire Department of Costa Rica, where it split in two at the height of the tail. The plane's wings, the two engines, the landing gear and the fuselage suffered considerable damage. The aircraft did not explode or catch fire. The Director General of Firefighters, Héctor Chaves, reported that the fuel tanks in the plane's wings were in a \"complete\" state and that the presence of hazardous materials was ruled out. Firefighters mobilized a total of fourteen vehicle units to attend to the emergency, including tanks, rapid attack units, handling of hazardous materials, fire extinguishers, ambulances and tanks. ==Aftermath== The two crew members of the plane did not suffer serious injuries and were taken to hospital because their nervous condition was altered. Since an emergency was declared over the Parza waiting area, the Juan Santamaría airport was closed and remained so for up to five hours. Once the inspection work of the terminal's only takeoff and landing runway was completed, its reopening was authorized. Some thirty commercial and cargo flights were affected by the temporary closure of operations; several of the planes were diverted to their alternate airport and the international flights whose destination was Costa Rica landed at the Daniel Oduber Quirós International Airport in Liberia, Guanacaste, forcing passengers to make a five-hour trip in land vehicles to reach the capital. The aircraft was written off as a result of the crash. == Related pages == * Southwest Airlines Flight 1248 * Air France Flight 358 * Air India Express Flight 1344 * Air India Express Flight 812 == References == Category:Aviation accidents and incidents in 2022 Category:21st century in Costa Rica",
 "title": "DHL Aero Expreso Flight 7216"
}