{
 "id": "93357",
 "text": "The Märkischer Kreis is a district (Kreis) in central North Rhine-Westphalia, Germany. The district was created in 1975 as part of the reorganisation of North Rhine-Westphalian districts. ==Twinning== The district is twinned with * , Wrexham County Borough. This was started in 1970 by Iserlohn. * , Elbe- Elster. This started as a twin with Finsterwalde before Finsterwald became a part of Elbe-Elster. * , Racibórz district. == Coat of arms == The lion and fess chequey (a stripe (fess) made up of little squares (chequey))are taken from the old coat of arms of the district of Altena, which is from the arms of the Counts of the Mark. In the first half of the 13th century a seal with both the fess and the lion was in use, as first used by Adolf I of Altena (1199-1241). Engelbert I of the Mark (1249-1277) dropped the lion in his seal. The original colour of the lion was unknown, so a black lion with red tongue and claws was chosen, as in the arms of the Dukes of Jülich. The black cross comes from the arms of Cologne, as the eastern part of the area historically belonged to the Archbishops of Cologne. The coat of arms was designed by the herald Waldemar Mallek, and was granted on May 6, 1976. ==Towns and municipalities== Cities (population) Municipalities (population) # Altena (20,997) # Balve (12,200) # Halver (17,550) # Hemer (37,790) # Iserlohn (102,456) # Kierspe (18,313) 7. Lüdenscheid (79,131) 8. Meinerzhagen (21,823) 9. Menden (58,184) 10. Neuenrade (12,402) 11. Plettenberg (28,149) 12. Werdohl (20,333) # Herscheid (7,617) # Nachrodt-Wiblingwerde (6,856) # Schalksmühle (12,257) ==Politics and administration== The district is led by a Landrat. The headquarters of the government of the county are in Lüdenscheid, but there are county halls with parts of the administration in Iserlohn and Altena, too. The police headquarters of the county are in Iserlohn. Landrat Oberkreisdirektor * Heinz Bickmann (CDU) - 1975 (provisional) * Dr. Walter Hostert (CDU) - 1975-1994 * Klaus Tweer (SPD) - 1994-1999 * Aloys Steppuhn (CDU) - since 1999 * Wilfried Droste (SPD) - 1975 (provisional) * Dr. Jürgen Albath (CDU) - 1975-1986 * Dr. Bernhard Schneider (CDU) - 1986-1999 The county council meets in the county hall in Iserlohn. Its last election was on September 26 2004. Party Votes Seats CDU 44.4% 32 SPD 30.0% 22 Greens 7.7% 6 FDP 7.4% 5 Independent (UWG) 6.7% 5 NPD 1.9 % 1 Republican 1.8 % 1 ==References== ==Other websites== * Official website (German) * Touristical website for the Märkischer Kreis (German)",
 "title": "Märkischer Kreis"
}