{
 "id": "933873",
 "text": "Suburbanisation or Suburbanization is when people move from the city center to the outskirts of the city, or the suburbs. Suburbanization is linked with urbanization, where people move from the countryside (called rural areas) to the cities. There is also a process called counterurbanization, where a city loses its attractiveness, and people move back to the countryside. If suburbanisation happens in very large cities, this can lead to the establishment of new Satellite cities and commuter towns. Functionally satelite cities and commuter towns are linked to the main city (as most people still work in the main city, and commute to work there). == Effects of suburbanisation on the city == There are a number of problems linked to suburbanization: * The main city still pays for much of the infrastructure, also for the suburbs, but it doesn't get paid that much (as most people live in the suburbs) * In the main city, different ethnic and economic groups lived together. When they move out the suburbs, they will often segregate (living in some suburbs may be more expensive, so that poorer people won't move there). Also, ethnic communities that were mixed in the city, may get segregated in the suburbs. * The number and nature of jobs in the main city may change. * Often, the structure of commerce changes. An example for this is the construction of large shopping centers on the outskirts vs. smaller shops in the city centers. * Generally, the infrastructure in the main city may be oversized. == Effects in the suburbs == In the suburbs, suburbanization also has effects: * Land values rise, as there's not enough land for housing and commerce * Generally, more land is needed, because shopping and housing are of lower density than in the main city * Commuting to the main city poses a higher load on infrastructure (especially roads) * There's a higher need for schools * There may be conflicts between the people that were there before, and those that moved there recently. * Rising tax levels * A loss of cultural identity. == History == The first moves to suburbanization were the establishment of garden cities in England, and the establishment of better off neighbourhoods in the US and Europe. Both happened in the late 19th and early 20th century. Suburbanization and urban sprawl started in the U.S. in the 1920s, when cars became affordable. In 1939, 13 percent of the people in the U.S. lived in suburbs; in 2010, they were over 50 percent. In the 1960s, living in the cities became much more expensive in Europe, so many commuter towns were built. In Eastern Europe, suburbanization started after 1990; before there were few ways to build a private home.Kiril Stanilov (publisher): The Post-Socialist City. Urban Form and Space Transformations in Central and Eastern Europe after Socialism. Springer 2007. In Asia, suburbanization started when the colonial powers (mostly England and the Netherlands) started to build suburbs for the mansions of their people. Informal settlements, such as slums or Favelas, are also a form of suburbanization in developing countries. In China, there has a strong movement to move outside the cities since 1995. It is not a form of suburbanization, as it is driven by large industrial complexes. The owners of these complexes also build settlements to house the people who work there. == References == Category:Urban planning Category:Urban geography",
 "title": "Suburbanisation"
}