{
 "id": "934120",
 "text": "Spirit Untamed is a 2021 American computer-animated adventure movie produced by DreamWorks Animation and distributed by Universal Pictures. The movie is directed by Elaine Bogan and co-directed by Ennio Torresan Jr. (in their feature directorial debuts), from a screenplay written by Aury Wallington and Kristin Hahn, making this the second theatrical movie release of the Spirit franchise and is both a spin-off and a stand-alone sequel/reboot of the traditionally animated Spirit: Stallion of the Cimarron (2002) and loosely based on the characters from its Netflix animated spin-off television series Spirit Riding Free, developed by Wallington. It stars Isabela Merced, Jake Gyllenhaal, Marsai Martin, Mckenna Grace, Julianne Moore, Walton Goggins, and Andre Braugher, and follows a young girl named Fortuna \"Lucky\" Prescott who moves to the small rural community of Miradero, where she meets the titular wild kiger mustang. As the son of Spirit and Rain from Spirit: Stallion of the Cimarron, she names the horse \"Spirit\" after his father, and Lucky immediately begins to bond with him. The movie was announced to be in development in October 2019, and production was done remotely during the COVID-19 pandemic. The movie was dedicated to the memory of Kelly Asbury, the co-director of the original Spirit film, who born on January 15, 1960 and who died on June 26, 2020. Spirit Untamed was theatrically released in the United States on June 4, 2021. The movie received mixed reviews from critics who deemed the movie inferior to the original and unnecessary. The movie was a box-office bomb after grossing $42 million worldwide against a budget of $30 million. ==Cast== * Isabela Merced as Fortuna Esperanza \"Lucky\" Navarro-Prescott, Milagro and Jim's daughter, Cora's niece, and Pru and Abigail's friend. ** Bridget Hoffman voices Lucky as an infant. * Marsai Martin as Prudence \"Pru\" Granger, one of Abigail and Lucky's friends and Al's daughter. * Mckenna Grace as Abigail Stone, one of Pru and Lucky's friends, and Snips' sister. * Walton Goggins as Hendricks, the leader of a gang of horse wranglers. * Andre Braugher as Al Granger, Pru's father. * Julianne Moore as Cora Prescott, Lucky's aunt, and Jim's older sister. * Jake Gyllenhaal as James \"Jim\" Prescott, Lucky's widowed father and Cora's younger brother. * Eiza González as Milagro Navarro- Prescott, a famous horse rider and Lucky's late mother. * Lucian Perez as Snips Stone, Abigail's younger brother. * Joe Hart as James Prescott Sr., Lucky's grandfather * Alejandra Blengio as Valentina * Gino Montesinos as Wrangler/Rodeo Cowboy * Jerry Clarke as Wrangler/Llama Cowboy * Lew Temple as Wrangler/Conductor * Gary Anthony Williams as Wrangler * Renie Rivas as Lady with Dog * Horse vocals are provided by Gary Hecker ==References== Category:American family movies Category:DreamWorks Animation movies Category:American sequel movies Category:2020s English-language movies Category:2021 adventure movies Category:2021 computer-animated movies Category:3D movies Category:American adventure movies Category:American Western (genre) movies Category:Comedy movies Category:Computer-animated movies Category:Universal Pictures movies Category:Movie spin-offs Category:Movies about families Category:Movies about horses Category:Movies based on TV series Category:Movies set in Oregon Category:Movies set in Texas",
 "title": "Spirit Untamed"
}