{
 "id": "934177",
 "text": "The fourth season of SpongeBob SquarePants premiered on May 6, 2005, with the episodes \"Fear of a Krabby Patty\" and \"Shell of a Man\". The season ended on July 24, 2007 with the episode \"Squid Wood\". Unlike the previous seasons, season four was released in two volume DVDs. The volume one DVD was released in region one on September 12, 2006. The volume two DVD was released in region one on January 9, 2007, with nine episodes from the season being released on that DVD before airing on American television. The season set was released in its entirety in region two on November 3, 2008. 38 episodes were produced this season. ==Episodes== * (HH) indicates how many households the episode was viewed in. ==DVD release== The first ten episodes of the fourth season were released on DVD by Paramount Home Entertainment in the United States and Canada on September 12, 2006. The \"Volume 1\" DVD release features bonus material including animatics and featurettes. The remaining ten episodes of the season were also released under the title \"Volume 2\" in the United States and Canada on January 9, 2007. The DVD release also features bonus material including music videos, shorts and featurettes. In Region 2 and 4, the DVD release for the season was a complete set. On November 13, 2012, The Complete Fourth Season DVD was released in Region 1, five years after the season had completed broadcast on television. SpongeBob SquarePants: Season 4, Volume 1 Set details Special features * 18 segment episodes * 2-disc set * 1.33:1 aspect ratio * Languages: ** English (Dolby Digital 5.1) * Animatics for \"Fear of a Krabby Patty\" and \"Dunces and Dragons\" * Behind the Scenes with SpongeBob SquarePants featurette Release dates Region 1 Region 2 Region 4 September 12, 2006 November 3, 2008 November 7, 2008 SpongeBob SquarePants: Season 4, Volume 2 Set details Special features * 20 segment episodes * 2-disc set * 1.33:1 aspect ratio * Languages: ** English (Dolby Digital 5.1) * \"Best Day Ever\" shorts * Best Day Ever Karaoke Music Video * Behind the Scenes with Pick Boy and SpongeBob Release dates Region 1 Region 2 Region 4 January 9, 2007 November 3, 2008 November 7, 2008 ==Notes== ==References== Category:SpongeBob SquarePants seasons Category:2007 television seasons Category:Lists of television series episodes Category:SpongeBob SquarePants episodes",
 "title": "SpongeBob SquarePants season 4"
}