{
 "id": "934350",
 "text": "The Wonderful World of Mickey Mouse is an American animated streaming television series. It was produced by Disney Television Animation for Disney+. ==Cast== ===Main voices=== * Chris Diamantopoulos as Mickey Mouse * Kaitlyn Robrock as Minnie Mouse * Clarence Nash as Donald Duck * Pinto Colvig as Goofy and Pluto * Tress MacNeille as Daisy Duck ===Other voices=== * Jim Cummings as Pete * Corey Burton as Ludwig von Drake * April Winchell as Clarabelle Cow * Paul Rudish as Various === Cameos === * Humphrey the Bear * Weasels from The Wind in the Willows and The Prince and the Pauper * Bambi (storybook) * Steamboat Willie Riverboat (pictured) * Skeleton from The Skeleton Dance * Butch the Bulldog * Merlin and Madame Mim from The Sword in the Stone * Yen Sid and Madame Upanova from Fantasia * Ursula and Flounder from The Little Mermaid * Beagle Boys * Oswald the Lucky Rabbit (hole) * The Beast, Mrs. Potts, Chip, and Lumiere from Beauty and the Beast * Dippy Dawg * Dumbo and Timothy Q. Mouse from Dumbo * Rhino Guards, Friar Tuck, Lady Kluck, Otto, Mother Rabbit, Skippy, Sir Hiss and Trigger from Robin Hood * Snow White, the Evil Queen (in her hag form), the Magic Mirror, and the Deers from Snow White and the Seven Dwarfs * Kaa from The Jungle Book * Aracuan Bird from The Three Caballeros and Blame It on the Samba * Flit from Pocahontas * Mr. Toad from The Wind in the Willows * Cinderella from the film of the same name * Cheshire Cat and Alice from Alice in Wonderland * Melvin, Buff, and Max from Country Bear Jamboree * Jenny and Joe from Once Upon a Wintertime * Thumper and Friend Owl from Bambi * Tigger from the Winnie the Pooh franchise * The Chimney Sweeps and Mary Poppins’s umbrella from Mary Poppins == Reception == Year Award Category Recipient(s) Result Ref. 2021 Annie Awards Outstanding Achievement for Directing in an Animated Television/Media Production Eddie Trigueros Daytime Emmy Awards Outstanding Editing for an Animated Program Tony Molina Outstanding Directing for a Daytime Animated Program The Wonderful World of Mickey Mouse == Episodes== ==References== ==Other websites== * * * Category:2020s American animated television series Category:2020s American comedy television series Category:2020 American television series debuts Category:American children's television series Category:English-language television programs",
 "title": "The Wonderful World of Mickey Mouse"
}