{
 "id": "934451",
 "text": "Hans Lodder (born 1945) is a former Dutch volleyball player. He was a member of the Dutch national team playing about 150 matches. Lodder played as a defender and had a strong block. After his playing career he moved to Nigeria Expanding beer breweries, including for Heineken and founded DHV Consultants Nigeria Limited. ==Career== ===Volleyball=== Lodder lived in Hoogeveen and attended Hogere Burgerschool. He moved to Groningen and attended from 1960 the (HTS). After moving to Groningen he started playing volleyball with Oranje- Nassau (and also played for the college volleyball team CVL of the (HTS)). After playing for half a year in the second division team of Oranje Bassau, he became a substitute for the main team. When Oranje Nassau promoted to the highest league (Eredivisie), Lodder became member of the team. Next to Oranje Nassau, Lodder became a member of the national team in the B-division at the end of 1963. He made his debut for the Dutch national team in 1965; and played next to it with the junior national team. He played for the national teams in around 150 matches. Lodder helped, together with Piet Swieter, Oranje-Nassau becoming one of the best Dutch teams. Altough the success with the club, he started playing with AMJV in 1967, started working in Amersfoort and lived in Leusden. He was two year captain of AMJV. After these two years he couldn’t play volleyball for a while due to a nerve infection in his arm. After his recovery he couldn’t reach his old level, due to his time consuming job at the consultancy and engineering firm DHV. Lodder retired from volleyball in 1971 and moved for his work to Nigeria. === Beer breweries in Nigeria=== Working forward for DHV, Lodder was commissioned between 1971 and 1974 by beer brewery Heineken to coordinate and supervise the civil work of the expansion of the Heineken brewery in Lagos. In that period he was also asked to help with the expansions of two other breweries. As new brewery was planned in Ibadan in 1974, Lodder suggested that DHV set up a local office in Nigeria to have the detailed engineering carried out there, in addition to the preliminary and final design by DHV Netherlands. His proposal was approved and in 1975 he founded DHV Consultants Nigeria Limited and managed the firm until 1978. ==Awards== Lodder was awarded by the Nederlandse Volleyball Bond a silver federation pin. ==References== Category:1945 births Category:Living people Category:Dutch volleyball players category:Beer",
 "title": "Hans Lodder"
}