{
 "id": "934430",
 "text": "The following is a list of massacres in Azerbaijan that have occurred in Azerbaijan. ==Before 1988== Name Year Date Location Deaths Targeted group Notes Battle of Ganja (1804) 1804 February Ganja 3,000Peter Avery; William Bayne Fisher, Gavin Hambly, Charles Melville (1991-10-25). The Cambridge history of Iran: From Nadir Shah to the Islamic Republic. Cambridge University Press. p. 332. . – 7,000 Caucasian Tatar inhabitants of Ganja Civilians were massacred during the capture of the city by the Russians; some of the captured soldiers were executedTHE SIEGE AND ASSAULT OF FORTRESS GANJA , Armenian–Tatar massacres of 1905–1907 1905–1907 February Baku; Nakhchivan; Shusha; Tiflis 3,000–10,000 Armenians, Azerbaijanis Shamkhor Massacre 1918 January Şəmkir 1,000 armed Russian soldiers Russian soldiers killed by Azerbaijani nationalistsThe formation of the Soviet Union: communism and nationalism, 1917-1923 By Richard Pipes - page 103the Modern encyclopedia of Russian and Soviet history, Volume 39 by Joseph L. Wieczynski - page 170Wladimir S. Woytinsky: La Democratie. p. 113 March Days 1918 March 30–April 2 Azerbaijan 12,000–25,000 Azerbaijanis According to the statements of Azerbaijan representatives, \"the Bolsheviks were helped by Armenians, eager to annihilate their old enemies and to seize their property\". September Days 1918 September Baku 10,000–15,000 Armenians Armenians killed by the Army of Islam;Hovannisian. Armenia on the Road to Independence, p. 227.Human Rights Watch. Playing the \"Communal Card\": Communal Violence and Human Rights . New York: Human Rights Watch, 1995. Khaibalikend Massacre 1919 June 5–7 Nagorno- Karabakh 600–700 Armenians Armenians killed by armed ethnic Azerbaijani and Kurdish irregulars and Azerbaijani soldiers;Hovannisian, Richard. The Republic of Armenia: Vol. I, The First Year, 1918-1919. Berkeley: University of California Press, 1971, pp. 176-177, notes 51-52. Villages of Khaibalikend, Jamillu, Karkujahan and Pahliul were destroyed Vratsian, Simon. Հայաստանի Հանրապետութիւն (The Republic of Armenia). Paris: H.H.D. Amerikayi Publishing, 1928, pp. 286-87.Hovannisian. Republic of Armenia, Vol. I, p. 181. Agulis Massacre 1919 December 24–25 Yuxarı Əylis 1,400 Armenians Early 20th century anti-Armenian massacre of the Armenian population of Agulis by the Turkish army accompanied by the Azerbaijani refugees from Zangezur which resulted in the destruction of the town of Agulis. Shusha pogrom 1920 March 22–26 Shusha 500–20,000Richard G. Hovannisian. The Republic of Armenia, Vol. III: From London to Sèvres, February–August 1920Thomas de Waal. Black Garden: Armenia and Azerbaijan through Peace and War. Armenians Armenians killed by Azerbaijanis; 1920 Ganja Revolt 1920 June Ganja 15,000 Azerbaijanis Bolsheviks slaughtered civilians including women and children after the capture of rebel Ganja. Many women were raped and Koran were burnt.The I.L.P.'s ALLIES. Soviet Massacre in the Caucasus // Western Gazette. — 1920. — 1 June. — page 12.15,000 massacred // Cheltenham Chronicle. — 1920. — 2 June. — page 4 ==Nagorno-Karabakh conflict== The following is a list of massacres and pogroms, which took place in the course of the First Nagorno-Karabakh War and the 2020 Nagorno-Karabakh War between Armenians and Azerbaijanis. Name Year Date Location Deaths Targeted group Notes Sumgait pogrom 1988 February 27–March 1 Sumgait 32 (26 Armenians and 6 Azerbaijanis) Armenians Armenians killed by Azerbaijanis; 20 ambulances were destroyed, \"Сумгаит, Один месяц поздно\" (\"Sumgait, One Month Later\"). Moskovskiye Novosti. April 13, 1988. and reports detail widespread rape,Shahmuratian. Sumgait Tragedy, Interview with Levon Akopyan, p. 227. mutilation, robberies, and disembowling of fetusesLee, Gary. \"Eerie Silence Hangs Over Soviet City.\" Washington Post. September 4, 1988. p. A33. Retrieved August 24, 2012.Ein Volk, ein Land. Der Spiegel 13/1988 Kirovabad pogrom 1988 November Kirovabad 130 Armenians Armenians Azeri-led pogrom directed against Armenian inhabitants of Kirovabad (now Ganja) Baku Pogrom 1990 January 13 Baku 90 Armenians Armenians killed by Azerbaijanis; many incidents of rape, robbery, and torture;Committee on the elimination of discrimination against women 700 injured.Europa World Year: Book 1 - Page 638, Taylor & Francis GroupThomas de Waal: Black Garden - Armenia and Azerbaijan Through Peace and War. New York University Press, 2003, p. 90 Black January 1990 January 19–20 Baku, Azerbaijan 133–137 Peaceful protesters of the Azerbaijani national independence movement Killed by Soviet troops; ambulance workers rushing to help the wounded and random by-passers, including women and children, among the dead Operation Ring 1991 30 April–15 May Shahumyan Province unknown Armenians number of casualties unknown, approximately 17 000 people displaced, gross human rights violationsHuman Rights Watch/Helsinki (1994). Azerbaijan: Seven years of conflict in Nagorno- Karabakh. New York: Human Rights Watch, p. 9. Capture of Gushchular and Malibeyli 1992 February 10–12 Malibeyli, Ashaghi Gushchular, Yukhari Gushchular villages of Shusha District 8 15-50 Azerbaijanis Azerbaijanis killed by Armenian irregular armed units. Garadaghly Massacre 1992 February 17 Garadaghly 20–90 Azerbaijanis Azerbaijanis killed by Armenian troops Khojaly Massacre 1992 February 25–26 Khojaly, Azerbaijan More than 200 613 Azerbaijanis Azerbaijanis killed by Armenian troops. Maraga Massacre 1992 April 10 Maraga 40–100 Armenians Armenians killed (many decapitated); corpses buried in a mass grave outside the village.Cox, Caroline and John Eibner. Ethnic Cleansing in Progress: War in Nagorno Karabakh. Zurich and Washington D.C.: Institute for Religious Minorities in the Islamic World, p. 58, 1993. ==References== * Massacres",
 "title": "List of massacres in Azerbaijan"
}