{
 "id": "934434",
 "text": "Fiddler on the Roof is an epic 1971 musical film. It is an adaptation of a Broadway musical with the same name. Norman Jewison directed the film. Joseph Stein and Sholem Aleichem wrote the script. The film stars Topol, Norma Crane, Leonard Frey, Molly Picon, and Paul Mann. The film s about Tevye, a Jew in AnatevkaIt. He has to reevaluate his values with the marriages of his daughters. It was nominated for eight Oscars and won three Academy Awards in 1972. == Plot == The film is broken into two acts and an intermission. === Act 1 === It follows the family of the milkman Tevye in the Ukrainian Town of Anatekva in Imperial Russia. The people in the town are compared to a fiddler on the roof, who use tradition to stay on their feet and \"scratch out a pleasant, simple tune.\" The story deals with Tevye coming to terms with deviations from tradition. The oldest daughter Tzeitel ends up marrying the tailor Motel out of love and not as arranged by the father. At their wedding, the two dance together, which is shocking and new for the town, as men and women cannot dance together. Then Russians come and break up the wedding and vandalize the place. === Act 2 === The second daughter, Hodel falls in love with and marries a Jewish Marxist student Perchik from Kiev. Tevye reluctantly accepts their love and the two eventually settle in Siberia. The youngest daughter Chava falls in love with Fyedka, a Russian Orthodox Christian. Tevye does not accept that Chava marries a non-Jew. Near the end, the villagers of Anatekva are forced to leave and evacuate the town to Europe, Israel and the United States. At various points in the film, a fiddler appears and plays the fiddle. == Cast == * Chaim Topol as Tevye * Norma Crane as Golde, his wife * Rosalind Harris as Tzeitel, the oldest daughter * Michele Marsh as Hodel, the second daughter * Neva Small as Chava, the third daughter * Molly Picon as Yente, the matchmaker * Paul Mann as Lazar Wolf, the butcher, Tzeitel's older suitor * Leonard Frey as Motel Kamzoil, the tailor, Tzeitel's eventual husband * Paul Michael Glaser (credited as Michael Glaser) as Perchik, the Bolshevik revolutionary, Hodel's eventual husband * Raymond Lovelock as Fyedka, a Christian, Chava's eventual husband * Elaine Edwards as Shprintze, the fourth daughter * Candy Bonstein as Bielke, the fifth daughter * Shimen Rushkin as Mordcha * Zvee Scooler as Rabbi * Louis Zorich as Constable * Alfie Scopp as Avram * Howard Goorney as Nachum * Barry Dennen as Mendel * Ruth Madoc as Fruma-Sarah, the butcher's late wife * Patience Collier as Grandmother Tzeitel * Tutte Lemkow as Fiddler * Marika Rivera as Rifka * Aharon Ipalé as Sheftel * Roger Lloyd-Pack as Sexton * Vernon Dobtcheff as Russian official * Kenneth Waller as Man in the \"Tevye's Dream\" sequence (uncredited) * Norman Jewison: (uncredited) as the Rabbi's voice (dubbed post filming) in the \"Tevye's Dream\" sequence (singing \"Mazel Tov\") == Music == John Williams adapted the music from Jerry Bock. The violin soloist was Isaac Stern. # \"Prologue / Tradition\" – Tevye and Company # \"Overture\" # \"Matchmaker, Matchmaker\" – Tzeitel, Hodel, Chava, Shprintze and Bielke - 20:00 # \"If I Were a Rich Man\" – Tevye - 24:50 # \"Sabbath Prayer\" – Tevye, Golde and Chorus # \"To Life\" – Tevye, Lazar Wolf, Townsmen and Cossacks - 49:20 # \"Tevye's Monologue (Tzeitel and Motel)\" – Tevye # \"Miracle of Miracles\" – Motel # \"Tevye's Dream\" – Tevye, Golde, Grandmother Tzeitel, Rabbi, Fruma-Sarah and Ghostly chorus # \"Sunrise, Sunset\" – Tevye, Golde, Perchik, Hodel and Guests # \"Wedding Celebration / The Bottle Dance\" # \"Entr'acte\" – Orchestra # \"Tradition\" (Reprise) – Chorus # \"Tevye's Monologue (Hodel and Perchik)\" – Tevye # \"Do You Love Me?\" – Tevye and Golde # \"Far from the Home I Love\" – Hodel # \"Chava Ballet Sequence (Little Bird, Little Chavaleh)\" – Tevye # \"Tevye's Monologue (Chava and Fyedka)\" – Tevye # \"Anatevka\" – Tevye, Golde, Lazar Wolf, Yente, Mendel, Mordcha and Full company # \"Exit Music\" == Reception == === Box Office === The movie was a financial success making over $80 million. It was the highest-grossing film in 1971. === Critical Response === The film received positive reviews by critics. The film has a 83% rating on Rotten Tomatoes. Critics considered the movie a powerful and emotion work. Some thought the storyline was boring. ==Other websites== * * * * * Category:1971 comedy-drama movies Category:1971 musical movies Category:1970s family movies Category:1970s epic movies Category:American musical comedy movies Category:American comedy-drama movies Category:Movies based on musicals Category:Movies directed by Norman Jewison Category:Movies set in the 1900s Category:Movies set in Ukraine Category:Movies about race and ethnicity",
 "title": "Fiddler on the Roof (movie)"
}