{
 "id": "934624",
 "text": "A StoryBots Christmas is a children's animated holiday special. It is based on the characters from the digital educational program StoryBots and the original television series Ask the StoryBots and StoryBots Super Songs. It was created and produced by JibJab Bros. Studios (now StoryBots Inc.) and premiered exclusively on Netflix on December 1, 2017. ==Awards== It received six nominations for the 45th Daytime Emmy Awards and won two, including for Outstanding Special Class Animated Program. == The Cast == * Judy Greer as Beep * Ed Asner as Santa Claus * Erin Fitzgerald as Bo * Fred Tatasciore as Bang * Jeff Gill as Bing * Gregg Spiridellis as Boop * Evan Spiridellis as Hap *Nate Theis as Hub and Bub == Reception == A StoryBots Christmas had positive reviews. Common Sense Media gave it a five-star review, calling it a \"dynamic and positive special [that] highlights the importance of sharing time with loved ones during the holidays.\" The Star Tribune also named it a top TV pick and praised it as a \"silly but charming animated special.\" == Accolades == Award Category Recipient(s) Result Daytime Emmy Award Outstanding Special Class Animated Program Evan Spiridellis, Gregg Spiridellis, Meridith Stokes, Sarah Kambara Daytime Emmy Award Outstanding Interactive Media Enhancement to a Daytime Program or Series Gregg Spiridellis, Evan Spiridellis, Daniel Haack, Marc Geraldez, Greg Mako, Rafael Frensley, Sarah Kambara, Jeff Gill, Jacob Streilein, Nikolas Ilic, Logan Chang, Ian Gerstel, Philip Emokpare, Dave Baer, Suruchi Shingre, Phillip Lamplugh, Samrod Shenassa, Blake Petetan Daytime Emmy Award Outstanding Performer in a Children's, Preschool Children's or Educational and Informational Program Ed Asner Daytime Emmy Award Outstanding Writing in a Preschool Animated Program Evan Spiridellis, Gregg Spiridellis, Nate Theis Daytime Emmy Award Outstanding Directing in a Preschool Animated Program Evan Spiridellis, Jeff Gill Daytime Emmy Award Outstanding Sound Editing for a Preschool Animated Program Jeffrey Shiffman, Nicholas J. Ainsworth, Kevin Hart, James Singleton, Jacob Cook == Music == A StoryBots Christmas: Music from the Original Special was released on December 8, 2017 on all major digital music platforms, including iTunes, Spotify, Apple Music and Amazon Music. The music release includes the original song \"Sharing Christmas (With the Ones You Love)\" from the television special, as well as \"Crazy for Christmastime\" from the StoryBots short-form video. == References == Category:2017 television episodes",
 "title": "A StoryBots Christmas"
}