{
 "id": "934740",
 "text": "This is a list of Kurdish dynasties, countries and autonomous territories. By the 10th century, the term \"Kurd\" did not have an ethnic connotation and referred to Iranian nomads in the region between Lake Van and Lake Urmia. In Arabic medieval sources, \"Kurd\" referred non-Persian and non-Turkish nomads and semi-nomads. Except for the Kurdish languages, some ethnic Kurds speak Zaza and Gorani languages. == Early entities == * Sadakiyans (770–827) * Daysam (938–955) * Shaddadids (951–1199) * Rawwadids (955–1071) – They were Arab origin, later Kurdicized. * Hasanuyids (959–1014) * Marwanids (983–1096) * Annazids (990/991–1117) * Fadlawayh (11th century–12th century) * Hazaraspids (1115–1425) * Ayyubids (1171–1260) * Principality of Bitlis (1187–1847) * Vassaldom of Ardalan (14th century–1865 or 1868) * Emirate of Çemişgezek (13th century–1663) * Germiyan Beylik (1300–1429) – Mixed Turkish and Kurdish origin. * Mukriyan (14th century–19th century) * Zarrinnaal Dynasty (1448–1925) * Emirate of Pazooka (1499–1587) * Safavid dynasty (1501–1736): \"Of Kurdish ancestry, the Ṣafavids started as a Sunnī mystical order (...)\" : \"The Safavids, as Iranians of Kurdish ancestry and of nontribal background, did not fit this pattern, although the stat they set up with the aid of Turkmen tribal forces of Eastern Anatolia closely resembled this division in its makeup. Yet, the Turk versus Tajik division was not impregnable.\" : \"As Persians of Kurdish ancestry and of a non-tribal background, the Safavids did not fit this pattern, though the state they set up with the assistance of Turkmen tribal forces of eastern Anatolia closely resembled this division in its makeup.\" : \"This official version contains textual changes designed to obscure the Kurdish origins of the Safavid family and to vindicate their claim to descent from the Imams.\" : \"The Safavids originated as a hereditary lineage of Sufi shaikhs centered on Ardabil, Shafeʿite in school and probably Kurdish in origin.\" \"The Safavi house originally was among the landowning nobility of Kurdish origin, with affinity to the Ahl-e Haqq in Kurdistan (chart 1). In the twelfth century, the family settled in northeastern Azarbaijan, where Safi al-Din Ardabili (d. 1334), the patriarch of the Safavid house and Ismail's ancestor dating back six generations, was a revered Sufi leader.\" : \"The Safavid Shahs who ruled Iran between 1501 and 1722 descended from Sheikh Safi ad-Din of Ardabil (1252–1334). Sheikh Safi and his immediate successors were renowned as holy ascetics Sufis. Their own origins were obscure; probably of Kurdish or Iranian extraction, they later claimed descent from the Prophet.\" : \"The Safavid dynasty was of Iranian – probably Kurdish – extraction and had its beginnings as a Sufi order located at Ardabil near the eastern border of Azerbaijan, in a region favorable for both agriculture and pastoralism.\" * Principality of Suleyman (15th century–1838) * Emirate of Soran (before 1514–1836) * Emirate of Miks (?–1846) == Remnants of the Ayyubid Dynasty (13th century–19th century) == * Emirate of Bingöl (1231–1864) * Emirate of Hasankeyf (1232–1524) * Emirate of Kilis * Emirate of Şirvan (?–1840s) * Emirate of Hakkâri (before 1380s–1845) * Principality of Zirqan (1335–1835) * Emirate of Bahdinan (1339–1843) * Emirate of Bohtan (?–1833) * Principality of Mahmudi (1406–1839) * Principality of Pinyaşi (1548–1823) == Buffer zones between the Ottomans and Persia (13th century–19th century) == * Emirate of Pazooka (1499–1587) * Emirate of Soran (before 1514–1836) * Principality of Suleyman (15th century–1838) * Emirate of Şirvan (?–1840s) * Principality of Baban (16th century–1850) * Principality of Pinyaşi (1548–1823) * Sarab Khanate (?–1747) * Khoy Khanate (?–1799) * Tabriz Khanate (1757–1799) == 20th–21st century entities == * Kingdom of Kurdistan (1918–1924/1925) * Kurdistan Uyezd (1923-1929) * Republic of Ararat (1927–1931) * Republic of Mahabad (1946) * Republic of Laçin (1992) * Islamic Emirate of Byara (2001–2003) == Present-day == === Autonomous === There are two autonomous regions established by the Kurds. The first one is the Kurdistan Regional Government, which was established as a result of the initiatives of the Iraqi Kurds and is the only officially recognised Kurdish administration today. The second region is the Autonomous Administration of North and East Syria, which the Syrian Kurds unilaterally declared first as autonomous cantons and then as a federation in the regions they captured during the Syrian Civil War. Autonomy Flag Map Years Part of Area Kurdistan Region 1992 Iraq 46,862 km2 Autonomous Administration of North and East Syria 2013 Syria (de facto) 50,000 km2 == References == == Sources == * * * * * * * * * * * * * * * * * * * * * * * * * ==Notes== Category:Lists of countries Category:Kurdistan",
 "title": "List of Kurdish states, dynasties and countries"
}