{
 "id": "93488",
 "text": "Alb-Donau (Alemannic German: Alb-Donau-Krois) is a rural district or county (Landkreis) in Baden-Württemberg, Germany. == History == The history of the region is linked with the history of Ulm and the Swabian Alb. The district of Alb-Donau was established in 1973 by joining the former districts of Ulm and Ehingen. == Geography == The city of Ulm is surrounded by the district. The government of the county is in Ulm, even though Ulm is not a part of the districztIt is the administrative seat of the Alb-Donau district, although it is not part of the district. The district is named after the Danube River (German Donau) and the Swabian Alb (Schwäbische Alb) mountains. The Danube enters the district in the southwest, runs through the southern parts of the district and leaves eastwards to Ulm. North of the Danube banks the hills of the Swabian Alb rise. The hill chain extends from southwest to northeast parallel to the course of the Danube River and is continued on either side of the district. An affluent of the Danube, the Iller River, forms the southeastern border of the Alb-Donau district, before it meets the Danube in Ulm. == Coat of arms == The coat of arms is identical with the arms of the former district of Ulm. The eagle was the heraldic animal of the Free Imperial City of Ulm. The shield displays the deer antlers of Württemberg and the red and white stripes of the Austrian county of Burgau (which the southern parts of the district once belonged to). == Towns and municipalities == Towns Municipalities # Blaubeuren # Dietenheim # Ehingen # Erbach # Laichingen # Langenau # Munderkingen # Schelklingen # Allmendingen # Altheim # Altheim (Alb) # Amstetten # Asselfingen # Ballendorf # Balzheim # Beimerstetten # Berghülen # Bernstadt # Blaustein # Börslingen # Breitingen # Dornstadt # Emeringen # Emerkingen 17. Griesingen 18. Grundsheim 19. Hausen am Bussen 20. Heroldstatt 21. Holzkirch 22. Hüttisheim 23. Illerkirchberg 24. Illerrieden 25. Lauterach 26. Lonsee 27. Merklingen 28. Neenstetten 29. Nellingen 30. Nerenstetten 31. Oberdischingen 32. Obermarchtal 33. Oberstadion 34. Öllingen 35. Öpfingen 36. Rammingen 37. Rechtenstein 38. Rottenacker 39. Schnürpflingen 40. Setzingen 41. Staig 42. Untermarchtal 43. Unterstadion 44. Unterwachingen 45. Weidenstetten 46. Westerheim 47. Westerstetten == References == == Other websites == * Official website (German) Category:1973 establishments in Europe Category:1970s establishments in Germany",
 "title": "Alb-Donau-Kreis"
}