{
 "id": "935112",
 "text": "The Backrooms is an urban legend started by a post on 4chan. It describes a large maze of empty yellow rooms. The 4chan post characterized the Backrooms' yellow wallpaper, the smell of moist carpet, and loud buzzing lights. The original 4chan post explained that people to fall into the Backrooms by “no- clipping”, which is a term used in video games in which things pass through a solid object. There are lots of levels, and some unknown creatures. In Kane Pixels backrooms found footage 1, the person gets chased by an entity and dies. Since its creation, The Backrooms have been spread into other forms of media and Internet culture, including video games, memes, and a horror/science fiction web series. Some people on the internet have added on to the legend of the Backrooms by adding additional “levels” and dangerous creatures known as “entities” that inhabit the Backrooms. Some sources believe the Backrooms to have been the beginning of the internet's aesthetic of liminal spaces, which shows usually busy areas as unnaturally empty. The #liminalspaces hashtag has had nearly 100 million views on TikTok. A TikTok trend of videos that zoom in on Google Earth to reveal an entrance to the Backrooms have grown popular. ==Location== In May 2024, four people from Discord would eventually find the real location of the original Backrooms image from a photo taken back in 2003 in the WayBack Machine. The image was located at 807 Oregon Street, in Oshkosh, Wisconsin. The place was a small HobbyTown store. According to the blog showing the image, the caption talked about a water leak that happened before the photo was taken: > \"Above is the original view of the East (Oval) room. Notice no windows are > visible? You can not see in the pictures the extent of water damage, but it > was there requiring all of this material to come out.\" Since then, the space has been renovated into an RC track. == Reception == The concept of the Backrooms has been made popular by internet users. Some have created different sections of the Backrooms called levels. There are thousands of levels found within fan-made Wikis of the Backrooms, such has different pictures and safety classes inspired by the SCP wiki. However, there are three distinct levels. The levels in this canon include: * Level 0: The level showed in the original Backrooms photo, featuring all of the weird and creepypasta's most well known features - moldy carpet, based on only one color yellow walls and buzzing fluorescent lights. One of the things created by users for this level are dogs, described as Hounds. Another feature of this level is a noclip zone, which can bring wanderers back to Earth's dimension, return them to the starting point of Level 0, or to another level with different entities. This level is apparently infinite, with endless corridors and rooms. * Level 1: A level reached when one chooses not to enter a noclip zone and instead wanders around Level 0 for days. It is darker than Level 0 and features a more industrial architecture, with mechanical-like sounds being heard through Level 1. The level appears to be a dark, dingy warehouse with low-lying fog and puddles of water around. Opposed to Level 0, the fluorescent lights begin to flicker more frequently, occasionally shutting down completely – This is when the entities come out. * Level 2: The third level of the Backrooms, according to the three-level interpretation. It is the one of the darkest levels, containing more industrial-like architecture. This level appears as long service tunnels with pipes lining the walls. It is described as being reached when one simply wanders around Level 1 for a long enough period of time, and featuring a much higher temperature than other levels. Survivors of the Backrooms claim that the only way to escape the level is to remain calm, stating that only when the Backrooms have become a person's home can they depart. It is said to have entities that are more dangerous than those of Level 1 There are also many different levels. Many levels have been created by the Backrooms fanbase's. == Popularity and impact == In January 2022, a short horror video titled The Backrooms (Found Footage) was uploaded to the YouTube channel Kane Pixels. This video caused the Backrooms to become popular again. The Backrooms was an inspiration for Apple TV+'s Severance. === Movie adaptation === In February 2023, A24 announced that they will be working on a movie about the Backrooms. YouTuber Kane Parsons is set to direct the movie. It will be based on his YouTube series about the Backrooms. ==References== Category:Internet culture Category:2019 establishments Category:Horror Category:Internet memes Category:Science fiction",
 "title": "The Backrooms"
}