{
 "id": "935321",
 "text": "The Museum Island (German: Museuminsel) is a collection of museums in the northern part of the Spree Island in Berlin. It is a UNESCO World Heritage Site. It includes five famous museums: the Altes Museum, the Neues Museum, the Alte Nationalgalerie, the Bode-Museum, and the Pergamonmuseum. The complex also consists of the Berliner Dom and Lustgarten. Different architects built the museums between 1830 and 1930. The Museums are part of the Staatliche Museen zu Berlin (SMB), (German: National Museums of Berlin). == History and Development == === 19th Century === The Altes Museum by Karl Friedrich Schinkel opened in 1830. It was the first museum to be built. The Neues Museum was built in 1855 by architect Friedrich August Stüler The third museum, the Alte Nationalgalerie, opened in 1876 and was built by Johann Heinrich Strack. The fourth museum was the Bode Museum in 1904 by Ernst von Ihne. Finally, the Pergamon Museum by Alfred Messel and Ludwig Hoffmann opened in 1930. King Frederick William IV of Prussia set aside the island as an \" open space for art and science\" in 1841. The original plan was to have a Königlisches Museum be several buildings surrounding a Lustgarten. The plan was not to have one museum contain several genres and cultural regions. Instead, the island would have separate museum buildings for different regions and epochs. This layout was different than other museums like the Louvre or the British Museum.Parzinger, Herman, Remodelling shared heritage and collections access: The Museum Island constellation and Humboldt Forum project in Berlin, Museums, Ethics and Cultural Heritage. United Kingdom: Taylor & Francis, 2016, p. 141-161 The development of the museums followed a particle mission of education. The educated social class of the 19th century (Bildungsbürgertum) called for openly accessible art. The educator and philosopher Wilhelm von Humboldt, who supported public education, was also in charge of developing the museums. Thus, the museums were created to be for the public. The Altes Museum would become Prussia's first public museum.Sheehan, James J. (2000): Museums in the German Art World. From the End of the Old Regime to the Rise of Modernism. Oxford: Oxford University Press, p. 170. In the 1870s, the island began to be called Museum Island. The Prussians tried to build museums comparable to models in Paris and London. Following these ideas, an art conference in 1880 determined that galleries should only display high art forms in museums. === 20th Century === During the Third Reich, the Nazis planned to expand the Museum Island. They wanted to add more buildings and had plans for the Germanic Museum and Museum of the 19th Century. The war prevented these plans. Several of the museums were damaged during World War 2. Bombings destroyed over 70% of the museums during the war. However, much of the art was stored in bomb shelters. Significant restoration of the museums took place after German reunification in the 1990s. The German government has spent about $1 billion on renovations on the Museum Island. In the late 1990s, a masterplan for the Museum Island was proposed. It includes renovations and modernization of buldings and tries to connect all the museums. There will be a new visitor center building. In 1999, the island became a UNESCO World heritage site. == Photogallery == File:Berliner Dom Museum Island.jpg|Altes Museum, Lustgarten, and Berlin Cathedral File:Neues Museum - Joy of Museums.jpg|Neues Museum File:AlteNationalgalerie 1a.jpg|Alte Nationalgalerie File:Pergamonmuseum Front.jpg|Pergamon Museum File:Museumsinsel panorama.jpg|Panorama with River Spree File:Tastmodell-2.JPG|Tactile scale model of Museum Island File:Berlin James-Simon-Galerie asv2019-07 img1.jpg|James Simon Gallery File:Berliner Schloß (2020).jpeg|Berlin Palace in 2020 ==References== Category:Museums in Berlin",
 "title": "Museum Island"
}