{
 "id": "93543",
 "text": "The Sarah Jane Adventures was a science fiction television series, that started in 2007 and ended in 2011, due to Elisabeth Sladen's death. It was a spin off from the British cult series Doctor Who. The series starred Elisabeth Sladen as the journalist Sarah Jane Smith, who was a companion of the Third and Fourth Doctor in the classic Doctor Who series. Sladen played the original part of Sarah Jane from 1973 until 1976. Sarah Jane was considered the most popular companion of the Doctor and appeared in the new series episode \"School Reunion\" along with her robot dog, K-9. Unlike the other spin off of Doctor Who, Torchwood, the target audience for The Sarah Jane Adventures was children as it is shown on CBBC. == Connections to Doctor Who == The series featured many connections to Doctor Who. The Slitheen family, who first appeared in the Doctor Who episode \"Aliens of London\" appeared in two stories in the first series, and the Sontarans, who first appeared in the Doctor Who story The Time Warrior featured in two stories in the Second series. The character Doctor Who also appeared in the episodes \"The Wedding of Sarah Jane Smith\" (played by David Tennant) and \"Death of the Doctor\" (played by Matt Smith). Doctor Who also used ideas from The Sarah Jane Adventures. In the Doctor Who episode \"Turn Left\", the Doctor makes a reference to the Trickster - an enemy who had only featured in The Sarah Jane Adventures. Sarah Jane also appeared with her son Luke Smith in the Doctor Who episodes \"The Stolen Earth\" and \"Journey's End\". == Episodes == === Special (2007) === The first episode was a 60-minute special, and served as a basic introduction to the series. Number Story Title Date Shown 01 Invasion of the Bane 1 January 2007 === Series 1 (2007) === The first series featured five stories. Each story was made up of two episodes. Number Story Title Dates Shown 02 Revenge of the Slitheen 24 September 2007 03 Eye of the Gorgon 1 and 8 October 2007 04 Warriors of Kudlak 15 and 22 October 2007 05 Whatever Happened to Sarah Jane? 29 October and 5 November 2007 06 The Lost Boy 12–19 November 2007 === Series 2 (2008) === The second series featued six stories. As with the first series, each story was made up of two episodes Number Story Title Dates Shown 07 The Last Sontaran 29 September 2008 08 The Day of the Clown 6 and 13 October 2008 09 Secrets of the Stars 20 and 27 October 2008 10 The Mark of the Berserker 3 and 10 November 2008 11 The Temptation of Sarah Jane Smith 17 and 24 November 2008 12 Enemy of the Bane 1 and 8 December 2008 === Comic Relief Special (2009) === A short, 5-minute special was made for the 2009 Comic Relief appeal. Number Story Title Dates Shown 13 From Raxacoricofallapatorius with Love 13 March 2009 === Series 3 (2009) === The third series featured six stories. As with previous series, each story was made up of two episodes. Number Story Title Dates Premiered 14 Prisoner of the Judoon 15 and 16 October 2009 15 The Mad Woman in the Attic 22 and 23 October 2009 16 The Wedding of Sarah Jane Smith 29 and 30 October 2009 17 The Eternity Trap 5 and 6 November 2009 18 Mona Lisa's Revenge 12 and 13 November 2009 19 The Gift 19 and 20 November 2009 === Series 4 (2010) === The fourth series featured six stories. As with previous series, each story was made up of two episodes. The final episode of this series was the last to air before Elisabeth Sladen's death on the 19th of April, 2011. Number Story Title Dates Premiered 20 The Nightmare Man 11 and 12 October 2010 21 The Vault of Secrets 18 and 19 October 2010 22 Death of the Doctor 25 and 26 October 2010 23 The Empty Planet 1 and 2 November 2010 24 Lost in Time 8 and 9 November 2010 25 Goodbye, Sarah Jane Smith 15 and 16 November 2010 === Series 5 (2011) === The fifth series only featured three stories, as those three were filmed alongside series four, before Elisabeth Sladen's death. As with the previous series, they were all made of two episodes. Number Story Title Dates Premiered 26 Sky 3 and 4 October 2011 27 The Curse of Clyde Langer 10 and 11 October 2011 28 The Man Who Never Was 17 and 18 October 2011 ==Related pages== *List of Characters in The Sarah Jane Adventures *Doctor Who Category:Doctor Who Category:2007 television series debuts Category:BBC Television programmes Category:British science fiction television series Category:Television spin- offs Category:English-language television programs",
 "title": "The Sarah Jane Adventures"
}