{
 "id": "935573",
 "text": "The Natural History Museum (German: Museum für Naturkunde) is a museum in Berlin. It holds specimens from different periods in natural history. Formerly part of the Humboldt University, the museum is now part of Leibniz Association and includes scientific research and labs. The museum has over 30 million samples of minerals, rocks, and living organisms, and there are ten thousand types of specimens. Only a tiny fraction of specimens are displayed, and the museum holds 65% of the Earth's minerals. Other objects displayed are meteorites and fossils. Notable exhibits are the Giraffatitan and Archaeopteryx. The museum is one of the major natural history museums in Germany. The others are the Naturmuseum Senckenberg in Frankfurt and the Museum Koenig in Bonn. == Exhibitions == The Archaeopteryx on display is perhaps the oldest bird, depending on how that is defined. The bird shows a connection between reptiles and birds. The body has wings, claws, a head with teeth, a tail like a lizard, and feathers. The bird was recovered from German Solnhofen limestone in 1871, just a few decades after Darwin wrote The Origin of Species. The Giraffatitan was recovered by Werner Janensch betwen 1901 and 1913. The skeleton is about 12 to 13 m long and would have weighed 55 tons. Giraffatitan was for many decades called \"the largest dinosaur\" but there are recent discoveries of even larger dinosaurs. Giant titanosaurians appear to have passed Giraffatitan in sheer mass. Also, the sauropod dinosaur Sauroposeidon is estimated to be taller and possibly heavier than Giraffatitan. The museum displays Tyrannosaurus skeletons (\"Tristan\") in different countries around the world. The museum has approximtely 250,000 minerals and 4,500 are on display. There are over 1,000 different types of minerals. The hall also includes an evolution exhibit that shows life's biodiversity. The wet hall contains 276,000 jars of specimens preserved in ethanol solution. The museum holds specimens from various expeditions. They include the German deep-sea Valdiva expedition (1898–99), the German Southpolar Expedition (1901–03), German expeditions to fossil beds in Tendaguru in Tanzania (1909-1912), and the German Sunda Expedition (1929–31). == History == The mineral collection was originally part of the Berlin Mining Academy. It would be part of the University of Berlin in 1814. The university added various departments, including paleontology and petrography. Eventually, a new building was needed since the collections were so large. The mineral collection was originally owned by the Prussian King. The museum opened in 1889. Director Karl Möbius divided the collections so that some would be public and the rest only for researchers. Part of the museum was damaged during World War II and rebuilt in 2011. After German reunification, the museum split up into the Institutes of Mineralogy, Zoology, and Paleontology in 1993. In 2006, the divisions Collections, Research, and Exhibitions were formed. The museum left the University of Berlin in 2009 and joined the Leibniz association. Its official name is Museum für Naturkunde – Leibniz Institute for Evolutionary and Biodiversity Research at the Humboldt University, Berlin (German: Museum für Naturkunde – Leibniz-Institut für Evolutions- und Biodiversitätsforschung an der Humboldt-Universität zu Berlin). In the future, the museum wants to renovate itself to become a research museum and address current natural global issues like biodiversity, climate change and sustainability. Construction costs will be about $760 million. == References == Category:Museums in Berlin Category:Natural history museums",
 "title": "Natural History Museum, Berlin"
}