{
 "id": "935590",
 "text": "Alejandro Wiebe (Born June 1, 1970), known by his stage name Marley, is an Argentine television host, comedian and producer. He is considered one of the most recognized conductors of Argentine television in recent times. His beginnings were on El Trece and since 2003 he has been working on the competitor channel Telefe, serving as the channel's main host. ==Televisión== Year Show Channel Notes 1991-1992 Fax Canal 13 Showbiz columnist 1993-1995 360: todo para ver Canal 13 General topics 1993-1995 TN Show Todo Noticias Showbiz columnist 1996 Clotilde en Teleshow Canal 13 Showbiz columnist 1996-1999 Teleshow Canal 13 Showbiz columnist 1999-2001 Telepasillo Canal 13 Showbiz columnist 2000-2002 Teleshow internacional Canal 13 Travelling show 2001-2002 Expedientes Teleshow Canal 13 Celebrities biography 2002-2003 MundoShow Telefe Travelling show 2003 El show de la tarde Telefe Entertainment and humor show, with Florencia Peña 2003 Operación Triunfo (1st Season) Telefe Reality singing competition 2003 Protagonistas Únicos (1st Season) Telefe Celebrities biography 2003-2006 Por el mundo Telefe Travelling show 2004 Odisea, en busca del escarabajo dorado Telefe Celebrity survival competition, from Costa Rica 2004-2005 Operación Triunfo (2nd Season) Telefe Reality singing competition 2005 Odisea, en busca del tesoro perdido Telefe Celebrity survival competition, from Costa Rica 2005-2006 Operación Triunfo (3rd Season) Telefe Reality singing competition 2007 Odisea, aventura argentina Telefe Celebrity survival competition, from Argentina 2007-2008 Viaje de locos Telefe Travelling show, with Florencia Peña 2008-2009 El muro infernal Telefe Entertainment show 2009 Operación Triunfo (4th Season) Telefe Reality singing competition 2010 3, 2, 1 ¡A ganar! Telefe Entertainment show 2010 Protagonistas Únicos (2nd Season) Telefe Celebrities biography 2011-2013 Minuto para ganar Telefe Entertainment show 2012 La Voz Argentina Telefe Reality singing competition 2013 Celebrity Splash! Telefe Celebrity diving competition 2013-2014 Tu cara me suena (Season 1) Telefe Celebrity impersonation competition 2014 La Nave de Marley Telefe Entertainment show 2014 Tu cara me suena (Season 2) Telefe Celebrity impersonation competition 2014-2015 El destino perfecto Telefe Travelling show 2014-2016 La ciencia de lo absurdo NatGeo Entertainment show 2015 Elegidos (La música en tus manos) (Season 1) Telefe Reality singing competition Tu cara me suena (Season 3) Celebrity impersonation competition Elegidos (La música en tus manos) (Season 2) Reality singing competition 2016 Dueños de la cocina Gastronomy show La peluquería de don Mateo Client Marley presenta Celebrities biography 2017 Despedida de Solteros Reality competition show, with Carina Zampini == References == ==Other websites== * Interview in Clarín Category:Argentine television presenters Category:1970 births Category:Living people Category:Argentine comedians Category:Telefe",
 "title": "Marley"
}