{
 "id": "935546",
 "text": "The German Historical Museum (German: Deutsches Historisches Museum, DHM) is a German history museum in Berlin. The museum is in a building named Zeughaus (armory) on Unter den Lindern. It is one of the most visited museums in Berlin. The museum holds a collection of about 1 million objects. == Founding and History == The Federal Republic of Germany and the state of Berlin founded the museum in 1987. The date was also the 750th anniversary of the founding of Berlin. Key historians such as Hartmut Boockmann, Eberhard Jäckel, Hagen Schulze and Michael Stürmer were involved in the project. Chancellor Helmut Kohl supported the museum project. In a speech to the Bundestag in 1985, Kohl emphasized the importance of having the museum.Christoph Stölzl: Deutsches Historisches Museum. Ideen – Kontroversen – Perspektiven. ISBN 3-549-06682-1 Together, 16 historians, art historians, and museum directors worked on the commission. They wanted the museum to present German history internationally and globally. The Berlin state and the federal government signed to create A Board of Trustees (Kuratorium) in July of 1987. Members of the board include representatives of the federal government, parliament (Bundestag), and German states. After the reunification of German, the German government took over the of Museum for German History (Museum für Deutsche Geschichte), former East Germany. The government moved the contents of this former museum to the DHM in the Zeughaus. Chancellor Angela Merkel started the permanent exhibition: German History in Images and Artefacts in 2006. The museum has also become the Public Law Foundation of the Federal Government (Stiftung öffentlichen Rechts des Bundes) and the Foundation Flight, Expulsion, Reconciliation (Stiftung Flucht, Vertreibung, Versöhnung). == Facilities == The facilities include exhibition halls, a library, and a cinema. The exhibitions are closed until 2025 due to renovations. The museum is also virtual through a website called LeMO (Lebendiges virtuelles Museum Online, or Living virtual Museum Online) == Collections == Everyday Life Culture I: Technical and medical products and instruments, Household objects, product advertising: c. 70,000 objects Everyday Life Culture II: Fashion, costumes, badges, religious articles: c. 45,000 objects Everyday Life Culture III: Toys, postcards, political objects, special inventory: c. 40,000 objects Old and valuable prints: Prints from 15th century – 20th century: c. 25,000 objects Documents I: Deeds, broadsheets, flyer and map collections, autographs, Seals and albums up to 1914: c. 50,000 objects Documents II: Photo albums, newspapers, flyers, propaganda materials, Maps and autographs since 1914: c. 120,000 objects Picture archive: Estates of photographers and picture agencies, c. 500.000 photographic prints Film collection: 850 films Applied arts and sculptures up to 1900: Furniture, ceramics, glass and metal art, design: c. 6,000 objects Print collection: on the history of events from the 16th to the 20th century, Portrait engraving collection from the 15th to the 20th century: c. 100,000 prints Art I: Paintings up to 1900: 857 objects Art II/Photo collection: Paintings and sculptures from the 20th and 21st centuries: c. 3,000 objects as well as 20,000 photographs Militaria I: Old weapons and armour, military equipment: c. 20,000 objects Militaria II: Uniforms, flags, medals and decorations, military prints: c. 30,000 objects Numismatics: c. 80,000 objects, c. 15,000 securities Posters: Artistic posters 1896–1938 from the Hans Sachs Collection, political posters 1920–1960 from the Wolf Collection, and GDR posters: c. 80,000 objects. == References == Category:Museums in Berlin",
 "title": "Deutsches Historisches Museum"
}