{
 "id": "935580",
 "text": "Universal+ (pronounced as Universal Plus), is a group of Latin American and British Isles premium subscription television channels of United States origin. It focuses on the broadcast of exclusive movies and series that are not seen on other channels. ==Ownership== It is owned by NBCUniversal, operated by NBCUniversal International Networks. It is distributed by Ole Distribution, a joint venture between Ole Communications and WarnerMedia. ==Kickoff== The platform began operating in December 2018, previously as Universal TV+, offering content from various sister channels of NBCUniversal in Latin America, but with a login required from each operator. On December 4, 2020, the platform was renamed Universal+ again, although no service costs were specified. ==Premium packages== Universal+ started a premium package on August 24, 2021, when several pages and social networks spread unofficial information about what could be the group of premium channels to be launched and marketed in Latin America. Later on, the HBO Latin America Group entered the premium television model, and several years later its participation was sold to WarnerMedia. In a leak of an official statement from DirecTV, details of the premium package were revealed, as well as the new channels to be marketed, including Universal Premiere, Universal Cinema, Universal Crime, Universal Comedy and Universal Reality. The group was scheduled to start its broadcasts on December 2, 2021, initially on DirecTV and Sky. But due to technical problems, the launch was postponed on Sky in Mexico and Central America for December 3 of the same year, while for DirecTV was postponed to December 6. ==Channels== The group is made up of 5 premium channels with exclusive content, which are: * Universal Premiere: It is focused on the broadcast of premiere movies, new seasons and series, it has 2 signals, East and West. * Universal Cinema: Is focused on broadcasting the most outstanding award-winning films, it has 2 signals, East and West. * Universal Crime: is focused on the broadcast of action, investigation and high-impact criminal series. * Universal Comedy: is focused on the broadcast of movies and comedy series. * Universal Reality: is focused on the broadcast of entertainment, game shows and reality shows, which has content from E! Channel. ==References== == Other websites == * Category:2018 establishments",
 "title": "Universal+"
}