{
 "id": "93590",
 "text": "S.K. Rapid Wien is an Austrian football club. Rapid Wien was founded in 1898 and is one of the major clubs in Austria. The club plays in Vienna. Rapid is Austria's most successful team with 32 championships wins. Rapid also won a German title in 1941 when the country was part of Germany. ==History== The club was founded in 1898 as First Workers' Football Club of Vienna but was renamed in S(port) K(lub) Rapid Wien on 8 January 1899. The first coulors were red and white. The teams uses these colours in away matches today. During the years before World War II, Rapid was one of the most successful clubs in Europe. Before the Second World War, Rapid won the Viennese championship 16 times. In these years there was no nationwide championship because professional football teams only played in Vienna. In 1930 Rapid won the Mitropacup against Sparta Praha (2:0; 3:2) (La Coupe de l'Europe Centrale), one of the first international competitions in Europe.IFFHS Mitropacup 1930 Around this time, the rivalry with the other great club of Vienna, FK Austria, started and continues today. Rapid was the club of the working class, while supporters of FK Austria were more middle class. After the annexation of Austria through Nazi-Germany in 1938 Rapid played in the Gauliga Ostmark. Rapid won the Tschammerpokal (Cup) in 1938 with a 3–1 victory over FSV Frankfurt. 1941 they won the Championship versus Schalke 04 (4-3). Almost since the beginning of the club's history, the fans announce the last 15 minutes with clapping of their hands, the \"Rapidviertelstunde\". SK Rapid only won the Austrian championship twice since 2000. The greatest success in recent years was the victory over the Premier League club Aston Villa in the last qualifying round for the UEFA Europa League 2009 and 2010. They played in the group stage twice, but they did not reach the next round. Rapid last reached the group stage of the UEFA Champions League in 2005–06. They finished last in their group and lost all their matches. UEFA:Championsleague 2005/06 ==Current squad== ===Out on loan=== ==Coaching history (21st century)== weltfussball.de. Retrieved 8 February 2022 Start End Coach 4/1998 5/2000 Heribert Weber 5/2000 8/2001 Ernst Dokupil 8/2001 9/2001 Peter Persidis 9/2001 5/2002 Lothar Matthäus 7/2002 12/2005 Josef Hickersberger 1/2006 8/2006 Georg Zellhofer 8/2006 9/2009 Roman Pivarník 9/2006 4/2011 Peter Pacult 4/2011 6/2011 Zoran Barisic 7/2011 4/2013 Peter Schöttel 4/2013 6/2016 Zoran Barisic 7/2016 11/2016 Mike Büskens 11/2016 11/2016 Thomas Hickersberger 11/2016 4/2017 Damir Canadi 4/2017 9/2018 Goran Djuricin 10/2018 11/2020 Dietmar Kühbauer 11/2020 11/2020 Manfred Nastl 11/2020 11/2021 Dietmar Kühbauer 11/2021 11/2021 Thomas Hickersberger 11/2021 10/22 Ferdinand Feldhofer 10/22 Zoran Barisic ==Famous players== * Josef Bican * Franz Binder * Robert Dienst * Ernst Dokupil * Toni Fritsch later playing in the American Footbal League * Gerhard Hanappilater architect, he designed the homeground of Rapid which is named after him * Ernst Happel later coach of the dutch national footballteam * Andreas Herzog * Josef Hickersberger * Alfred Körner * Robert Körner * Hans Kranklbest scorer of Europe, later playing for CF Barcelona * Max Merkel * Erich Probst * Karl Rappanintroduced the International Football Cup (now UEFA Intertoto Cup) * Josef Uridil * Walter Zeman * Zlatko Kranjčarlater manager of Croatia (2004-2006) and Montenegro (2010- ) * Antonín Panenka ==Honours== * National Austrian Championship (16): 1951, 1952, 1954, 1956, 1957, 1960, 1964, 1967, 1968, 1981–82, 1982–83, 1986–87, 1987–88, 1995–96, 2004–05, 2007–08 * Viennese Championship (16): 1912, 1913, 1916, 1917, 1919, 1920, 1921, 1923, 1929, 1930, 1935, 1938, 1940, 1941, 1946, 1948 Before the Second World war professional football was only played in Vienna. * Austrian Cup (14): 1919, 1920, 1927, 1946, 1961, 1968, 1969, 1972, 1976, 1983, 1984, 1985, 1987, 1995 * Austrian Supercup: 1986, 1987, 1988, 2008 (Unofficial edition) * German War- time Championship: 1941 * German War-time Cup: 1938 * Mitropa Cup: 1930, 1951 * Intertoto Cup: 1992, 1993 * Cup Winners' Cup Runners Up: 1985, 1996 ==Gallery== File:SK Rapid Wien - Teamphoto 2010-11.jpg|First Squad 2010/11 Image:2008 Steffen Hofmann.JPG|Steffen Hofmann celebrating the last championship 2008 File:FW Happelstadion3.jpg|Supporters of SK Rapid File:Rudolf Edlinger - SK Rapid Wien (01).jpg|Rudolf Edlinger former chairman ==References== Wien, SK Rapid Wien, SK Rapid",
 "title": "SK Rapid Wien"
}