{
 "id": "936077",
 "text": "Ed, Edd n Eddy's Big Picture Show is an animated road comedy television movie that serves as the series finale of the animated series Ed, Edd n Eddy. ==Production== It was produced by a.k.a. Cartoon. It premiered on Cartoon Network on November 8, 2009. Series creator Danny Antonucci directed the film and co-wrote it with Jay Batistan. Big Picture Show centers on an adventure that the adolescent Eddy takes his friends Ed and Edd on to find his older brother after their most recent money-making scheme leaves their cul-de-sac in a state of devastation that harms its other participants. Antonucci and a.k.a. Cartoon spent two years working on the movie before it was finished in 2009. To focus more on this, he shortened the show's sixth season to two episode segments after getting approval from Cartoon Network to work on a movie. Its title characters are respectively voiced by Matt Hill, Sam Vincent and Tony Sampson while David Paul Grove, Kathleen Barr, Erin Fitzgerald, Peter Kelamis, Janyse Jaud and Keenan Christensen play their neighbors. Terry Klassen, the show's voice director, was cast as Eddy's Brother while Patric Caird composed its score. Ed, Edd n Eddy's Big Picture Show had high ratings for Cartoon Network, posting double and triple digit ratings delivery gains. It was also released on the iTunes Store. It has been praised as a strong conclusion for Ed, Edd n Eddy. ==Cast== Below is a list of voice actors. * Matt Hill as Ed, the strong, foolish, non sequitur-emitting member of the Eds and older brother to Sarah. * Sam Vincent as Edd, the intelligent, hat-wearing, neat-freak, inventor of the Eds. * Tony Sampson as Eddy, the greedy but self-conscious leader of the Eds. * David Paul Grove as Jonny, an aloof loner who carries Plank, a wooden board drawn with a smiley face. * Kathleen Barr as Marie Kanker, the blue-haired Kanker sister, and Kevin, the short-tempered bike- rider often at odds with the Eds. * Erin Fitzgerald as May Kanker, the blonde, dimwitted Kanker sister, and Nazz, an easy-going blonde girl who the Eds, Jonny and Kevin are attracted to. * Peter Kelamis as Rolf, an immigrant from \"the old country\" with different customs from the rest of Peach Creek. * Janyse Jaud as Lee Kanker, the redheaded leader of the Kanker sisters, and Sarah, Ed's ill-tempered younger sister. * Keenan Christensen as Jimmy, an insecure, accident-prone boy who is a close companion of Sarah. * Terry Klassen as Eddy's Brother, an employee at the Mondo-A-Go Go amusement park who bullies his younger sibling. ==Other websites== * Category:American buddy comedy movies Category:American road movies Category:American movies Category:Movies about children Category:2009 animated movies Category:2000s buddy movies Category:2000s English-language movies Category:2009 comedy movies Category:2000s American adventure movies Category:2000s adventure movies Category:American comedy movies Category:Canadian comedy movies Category:American animated movies Category:Canadian animated movies Category:Ed, Edd n Eddy",
 "title": "Ed, Edd n Eddy's Big Picture Show"
}