{
 "id": "936284",
 "text": "Garcelle Beauvais (born Beauvais-Nilon, November 25, 1966, Saint-Marc, Haiti) is a Haitian-American actress, TV personality, author and former model, known for her roles on The Jamie Foxx Show and NYPD Blue, and in movies like Coming to America (1988) and its 2021 sequel, White House Down (2013) and Spider-Man: Homecoming (2017). == Filmography == === Film === Year Title Role Notes 1986 Manhunter Young Woman Housebuyer 1988 Coming to America Rose Bearer 1994 Every Breath Woman #2 1999 Wild Wild West Girl In Water Tower 2001 Double Take Chloe 2002 Bad Company Nicole Second String Larissa Fullerton TV Movie 2004 Barbershop 2: Back in Business Loretta 2005 American Gun Sarah 2007 I Know Who Killed Me Agent Julie Bascome Trudie Ericson TV Movie 2009 Women in Trouble Maggie 2010 Eyes to See Marie Short 2012 David E. Talbert's Suddenly Single Samantha Stone Flight Deana Coleman 2013 White House Down Alison Sawyer Someone to Love Natalie Gilbert 2014 Small Time Linda Girlfriends' Getaway Vicki Holmes TV Movie 2015 Back to School Mom Dee Riley A Girl Like Grace Lisa Girlfriends Getaway 2 Vicki Holmes TV Movie 2016 7 Days Herself Short Film 2017 You Get Me Principal Spider-Man: Homecoming Doris Toomes 2018 Lalo's House Sister Francine Short 2021 Coming 2 America Grace 2022 Caught in His Web Detective Holland TV Movie === Television === Year Title Role Notes 1984-85 Miami Vice Waitress/Gabriella Episode: \"Give a Little, Take a Little\" & \"The Maze\" 1986 The Cosby Show Nurse Episode: \"An Early Spring\" 1991 Family Matters Lulu Episode: \"Old and Alone\" 1992 Down the Shore Liat Episode: \"Schwing Time\" Dream On Danica Episode: \"Red All Over\" Veronica Episode: \"That's No Lady, That's My Cousin\" 1993 Hangin' with Mr. Cooper Keeler Episode: \"Boy Don't Leave\" Where I Live Terry Episode: \"Married... with Children\" Family Matters Garcelle Episode: \"Scenes from a Mall\" 1994 Dead at 21 Officer Episode: \"In Through the Out Door\" Family Matters Young Mother Winslow Episode: \"To Be or Not to Be: Part 2\" 1994–95 Models Inc. Cynthia Nichols Main Cast 1995 Rachel Episode: \"Fatal Subtraction\" Sandra Episode: \"Not, I Barbecue\" & \"For Whom the Wedding Bells Toll\" 1996 Family Matters Nicole Moses Episode: \"A Ham Is Born\" 1996–01 Francesca \"Fancy\" Monroe Main Cast 1999 Arli$$ - Episode: \"The Cult of Celebrity\" 2000 Opposite Sex Ms. Maya Bradley Recurring Cast 2001 Titans Tina Episode: \"She Stoops to Conquer\" 2001–04 NYPD Blue A.D.A. Valerie Heywood Main Cast: Season 8–11 2003 Vicki Episode: \"Bernie Mac Rope-a-Dope\" 2004 Curb Your Enthusiasm Renee Episode: \"The Surrogate\" Life with Bonnie Dr. Gamz Episode: \"Therabeautic\" 2005 Eyes Nora Gage Main Cast 2006 10.5: Apocalypse Natalie Warner TV Mini Series CSI: Miami Katrina Iverson Episode: \"Death Pool 100\" Women in Law - Episode: \"Pilot\" 2009 Maneater Suzee Saunders TV Mini Series Crash Connie Episode: \"Johnny Hit and Run Pauline\" 2010 Human Target Vivian Cox Episode: \"Lockdown\" 2011 State of Georgia Gwen Dressel Episode: \"Foot in the Door\" 2011–12 Franklin & Bash Hanna Linden Main Cast: Season 1–2 2012 Kendra Episode: \"Shall We Dance\" 2013 Psych Miranda Sherrod Episode: \"Dead Air\" Arrested Development Ophelia Love Episode: \"Off the Hook\" Necessary Roughness Lana Langer Episode: \"Swimming with Sharks\" 2014 Playing House Dr. Jay Episode: \"Let's Have a Baby\" The Mentalist Danitra Cass Recurring Cast: Season 7 2015 Grimm Henrietta Recurring Cast: Season 4 2016 Hell's Kitchen Herself Episode: \"10 Chef's Compete\" 2016–19 The Magicians Our Lady Underground Recurring Cast: Season 1, Guest: Season 2–4 2017–18 Chicago Med Lyla Dempsey Episode: \"Ctrl Alt\" & \"Over Troubled Water\" 2018 RuPaul's Drag Race All Stars Herself Episode: \"My Best Squirrelfriend's Dragsmaids Wedding Trip\" The Arrangement Mason Recurring Cast: Season 2 Power Linda Episode: \"Are We On The Same Team?\" 2019 Siren Susan Bishop Recurring Cast: Season 2 Middle School Moguls Mrs. Pierre Recurring Cast Merry Happy Whatever Nancy Recurring Cast 2019–20 Tell Me a Story Vernoica Garland Recurring Cast: Season 2 2020 Carol's Second Act Tina Episode: \"Plus One\" Sugar Rush Herself Episode: \"Tropical Vacation\" 2020–2025 The Real Housewives of Beverly Hills Herself Main Cast: Season 10–14 2020–22 The Real Herself Co-Host: Season 7-8 2021 The Prince Herself (voice) Episode: \"Beverly Hills\" & \"The Flummery Tart\" == References == == Other websites == * Category:1966 births Category:Living people Category:American television actors Category:American movie actors Category:American models Category:Haitian entertainers",
 "title": "Garcelle Beauvais"
}