{
 "id": "936325",
 "text": "Minority Report is a 2002 science-fiction movie directed by Steven Spielberg. The movie is based on the short story \"The Minority Report\" (1956) by Philip K. Dick. It stars Tom Cruise as Precrime Chief John Anderton, Colin Farrell as Department of Justice agent Danny Witwer, Samantha Morton as precog Agatha Lively, and Max von Sydow as Precrime director Lamar Burgess. The movie takes place in the year 2054 in Washington, D.C. It deals with problems with pre- knowledge of crimes committed in the future. Minority Report premiered at the Ziegfeld Theatre on June 19, 2002, and was released in the United States on June 21, by 20th Century Fox. == Plot: The U.S. government wishes to use \"Precrime\" across the country. Three \"precogs\" (Agatha, Arthur, and Dashiell) can see murders committed in the future, but not murders of passion. The precogs predict that John Anderton will murder Leo Crow. Anderton flees and goes to the home of the founder of PreCrime, Dr Hineman. Hineman states that, rarely, one of the \"precogs\" visions will conflict with the other two, resulting in a so-called \"minority report.\" These reports are discarded to maintain public trust in the PreCrime program. == Anderton kidnaps the precog, Agatha, from the PreCrime facility. After evading the authorities, they arrive at the home of Leo Crow, who has photos of Anderton's deceased son. Anderton believes that Crow killed his son, but Crow says he was setting it all up. Crow wants Anderton to kill him to benefit his family. Crow kills himself. Eventually, Anderton learns that PreCrime Director Lamar Burgess had manipulated PreCrime so that he could commit a murder five years prior. Burgess is exposed and commits suicide to avoid prosecution. The program of PreCrime is finally shut down. == Cast == * Tom Cruise as Chief John Anderton, PreCrime program commanding officer. * Max von Sydow as Lamar Burgess, Director of PreCrime. * Colin Farrell as Danny Witwer, agent from Department of Justice. * Samantha Morton as Agatha Lively, one of three \"precogs.\" * Michael and Matthew Dickman as \"precog\" twins. * Lois Smith as Dr. Iris Hineman, creator of PreCrime. * Kathryn Morris as Lara Anderton, estranged wife of Anderton. * Tyler Patrick Jones as Sean Anderton, John and Lara's son supposedly murdered by Crow. * Mike Binder as Leo Crow, the PreCrime victim who is supposed to be killed by Anderton. * Steve Harris as Jad Watson, agent who assists Anderton in Temple. * Jessica Harper as Anne Lively, Agatha's mother. * Tim Blake Nelson as Gideon, a guard of the PreCrime prison. * Daniel London as Norbert \"Wally\" Wallace, the caretaker of the \"precogs.\" * Peter Stormare as Dr. Solomon P. Eddie, an underground surgeon who replaces Anderton's eyes. The cast also features Jessica Capshaw as Evanna, PreCrime's transport pilot, Tyler Patrick Jones as Sean Anderton, John and Lara's son supposedly murdered by Crow, Neal McDonough as Fletcher, Jason Antoon as Rufus T. Riley, cyber-parlor proprietor; Nancy Linehan Charles as Celeste Burgess, Lamar's wife; Victor Raider-Wexler as Attorney General Arthur Nash, Arye Gross as Howard Marks, Ashley Crow as Sarah Marks, David Stifel as Lycon, Anna Maria Horsford as Casey, Joel Gretsch as Donald Dubin, Tom Choi as Nick Paymen, Caroline Lagerfelt as Greta van Eyck and William Mapother (Tom Cruise's cousin) as a hotel clerk. Cameron Diaz, Cameron Crowe, and Paul Thomas Anderson make uncredited cameo appearances as subway passengers. == Reception == Minority Report received positive reviews from critics. It has about 90% rating on Rotten Tomatoes. The website reads: \"Thought-provoking and visceral, Steven Spielberg successfully combines high concept ideas and high octane action in this fast and febrile sci-fi thriller.\" On Metacritic, the movie has a score of 80 out of 100 based on 37 critic reviews, indicating \"generally positive reviews\". ==References== == Other websites == * * Category:2002 movies Category:2000s action thriller movies Category:2002 science fiction movies Category:20th Century Fox movies Category:American action thriller movies Category:Movies directed by Steven Spielberg Category:Movies composed by John Williams Category:Movies about advertising Category:Movies about security and surveillance Category:Movies about memory Category:Movies about precognition Category:Movies set in the 2050s Category:Movies set in Washington, D.C. Category:Movies set in Virginia Category:DreamWorks Pictures movies",
 "title": "Minority Report (movie)"
}