{
 "id": "936363",
 "text": "Nicosia International Airport () was Cyprus' main airport before the Turkish invasion.It is 5 km as the crow flies west of the Cypriot Presidential Palace. The longest runway is 2.7km. It was very strategically important as a major transport route for the island. After the coup on 15 July 1974, Turkey using the justification of the power it had via the Treaty of Guarantee1960\\. Treaty of Guarantee. Nicosia. to launch an invasion on the 20 July 1974. It began in the early hours of 20 July 1974 with Turkish paratroopers being dropped in the Capital of Nicosia mainly into the Turkish enclave of Kioneli and with an amphibious landing in Kyrenia supported by heavy airstrikes from the Turkish Air Force. ==Timeline== === 19 July === The 32nd Strike Company of the 33rd Commando was ordered to make a perimeter around Nicosia Airport.Παναγιώτου, Θ., 2015. Με την 33 ΜΚ στον πολεμο του 1974. 2nd ed. Λεμεσός, p.126. ===20 July=== Turkish troops were landing on Kyrenia, bombings had begun on the airport by the Turkish Air Force. ===21 July=== In the early morning of 21 July, the airport's runway was again a target of the Turkish Air Force. After a day of fighting in Cyprus, the Greek junta under Dimitrios Ioannidis' leadership, decided to send the A' Raider Squadron, based in Crete, whose Commander was Major George Papameletiou, to help the Cypriot National Guard against the invasion with the operation being called Niki.Αδάμου, Μ., 2019. Δεκαετία Εν Όπλοις, 1964-1974, Συνοπτική Ιστορία των Δυνάμεων Καταδρομών στην Κύπρο. 1st ed. Σωτήρα Αμμοχώστου: Κυπριακό Ινστιτου΄΄το Επιστημονικω΄΄ν και Ιστορικω΄΄ν Ερευνω΄΄ν, pp.156-157. At 22:35 pm the 15 Noratlas planes took off from Souda Air Force base. Only 13 of the 15 made it to Nicosia Airport, the other two landed in either Crete or Rhodes.Η ΙΣΤΟΡΙΑ ΤΟΥ ΔΙΟΙΚΗΤΗ ΤΗΣ ΜΟΙΡΑΣ ΚΑΤΑΔΡΟΜΩΝ ΓΙΩΡΓΟΥ ΠΑΠΑΜΕΛΕΤΙΟΥ ΠΟΥ ΠΟΛΕΜΗΣΑΝ ΣΤΗΝ ΚΥΠΡΟ. 2018. [video] Skai Group.Αδάμου, Μ., 2019. Δεκαετία Εν Όπλοις, 1964-1974, Συνοπτική Ιστορία των Δυνάμεων Καταδρομών στην Κύπρο. 1st ed. Σωτήρα Αμμοχώστου: Κυπριακό Ινστιτου΄΄το Επιστημονικω΄΄ν και Ιστορικω΄΄ν Ερευνω΄΄ν, pp.159. At about 2:00 am, the first aircraft with codenames \"Niki 1\" and \"Niki 2\" landed. Due to miscommunication, they came under heavy fire from Cypriot anti-air fire. That downed \"Niki 4\", killing 32 Commandos. ===22 July=== A ceasefire was signed by both sides and was to take effect on 22 July from 16:00. During the day the Turkish Air Force took what advantage they had before the ceasefire. They bombed the airport destroying parts of the runway. At 16:00 when the ceasefire had taken effect, the 33rd Commando Battalion received intelligence that Turkish Military was preparing a surprise attack and subsequent takeover of the airport. The Commandos took security measures without any reinforcements being sent to them. At about 16:45 after the ceasefire had taken effect, the Turkish Air Force with 6 F-104 and 2 F-100 Super Sabre aircraft had begun bombing the airport again and destroyed a Cyprus Airways Trident. ===23 July=== On the morning of 23 July, more attacks on the airport had begun. Units from the Greek A' Raider Squadron (41st Strike Team) began arriving at the airport (After being placed in barracks elsewhere), armed with a few light machine guns, one 90mm recoilless rifle and one Browning 30mm.Αδάμου, Μ., 2019. Δεκαετία Εν Όπλοις, 1964-1974, Συνοπτική Ιστορία των Δυνάμεων Καταδρομών στην Κύπρο. 1st ed. Σωτήρα Αμμοχώστου: Κυπριακό Ινστιτου΄΄το Επιστημονικω΄΄ν και Ιστορικω΄΄ν Ερευνω΄΄ν, pp.166. The Commandos saw enemy infantry units getting closer to the airport fence and were ordered to fire warning shots. It became apparent to them that the Turkish Armed Forces were attempting to outflank them. At 11 am the main battle began with Turkish tanks (Likely M47s) and mortars beginning to fire on Greek positions. As elements of the 3rd Strike Company began arriving at the airport, they came under heavy fire from attacking forces. The cars containing Majors Avramides and Kyriakos were hit. The cars fell into a ditch, and a heavy firefight ensued and eventually broke out of the kill zone. As this was happening, Turkish armored units began moving towards the west of the airport in an attempt to cover the Turkish infantry units coming in from the north and thus creating a form backward \"L\" Flanking maneuver. Commander Papameletious's car also fell under fire and the car was immobilized a few hundred meters away from the main gates of the airport. Papameletious took fire from both Turkish positions and from UNFICYPs barracks. He was eventually set free with the help of a BTR; By the end 1 Commando had been mortally wounded. ==References== Category:1974 in Europe Category:1974 in Asia Category:History of Cyprus",
 "title": "Battle of Nicosia Airport"
}