{
 "id": "936479",
 "text": "The R211 is a class of New Technology Trains currently being built by Kawasaki Railcar Manufacturing for the B Division on the New York City Subway and the Staten Island Railway. The order consists of three subunits referred to as the R211A, R211T, and the R211S. The R211As and R211Ts are to perform revenue service on the B Division whereas the R211S will do so on the Staten Island Railway. Delivery of the R211 cars began at the end of June 2021. They contain new features such as wider doors, Wi-Fi, LED-lit doorways, improved digital displays, and open gangways. ==Component orders== The majority of the fleet will replace the 748-car R46 fleet. The contract is split into three parts: R211A, R211S, and R211T. If all options are exercised, the order would total 1,612 cars, or 640 standard cars and 437 gangway cars. Any extra cars that do not replace existing rolling stock will be used to expand the fleet. ==Features== The doors on the R211s are 58 inches (150 cm) wide, wider than the current MTA standard of 50 inches (130 cm). This design change partially incorporates a design feature of the R110A prototype subway cars. The new doors are projected to reduce station dwell time by 25 to 30 percent. The new cars have Wi-Fi installed, USB chargers, digital advertisements, digital customer information displays, illuminated door opening alerts, and security cameras, unlike the current New York Technology Trains, which lack these features. Each car contains an on-board computer system that could detect breakdowns in critical systems such as braking and door-opening. Exterior features include large windows, LED headlights, and a blue strip with gold accents on the sides. Features similar to trains with rollsigns (R40 to R68A). Changes to the R211 include updated FIND displays and flip seats for wheelchairs. Looped stanchions are installed on all R179 cars, as well as some R46, R62A, and R160 cars. The R211 was part of an action plan to fix the subway's state of emergency in 2017. In addition to various screens throughout the train, touch screen displays are present throughout the subway cars, allowing people to zoom in and out of the map. All R211A and R211T cars are equipped for CBTC in conjunction with the ongoing automation of the B Division lines. All R211S cars are equipped with cab signaling. ==History== ===Initial request for proposals=== The R211 Design Master Plan was approved by the MTA in December 2011. The order was planned to be 75 feet (23 m) in length, the same length as the R46 cars. Open-gangways, which would allow passengers to seamlessly walk throughout the train or units were also considered. The contract was originally supposed to be awarded in early 2017, but was pushed back to mid-2017. The base order consisted of 285 cars, with 10 R211T cars, 75 R211S cars, and 200 R211A cars. There were two option orders; the first option order contained 740 cars. On April 24, 2017, the breakdown of the order was changed again. The base order now includes 535 cars, with 10 R211T cars, 75 R211S cars, and 450 R211A cars. This change was made to allow for faster deliveries of the R211 cars. ===Contract=== ====Creation of mockup and contract awards==== In May 2017, the MTA quietly built a mockup of the R211 in a sparsely-used section of the 34th Street-Hudson Yards station's mezzanine. The model was completed and made publicly accessible from November 30 to December 6, 2017. In August 2017, Bombardier Transportation was banned from bidding on the R211 contract due to various delays and problems associated with the R179 contract. Kawasaki Heavy Industries and Alstom Transport were seen as two of the likely bidders for the contract. The MTA Board has awarded Kawasaki Rail Car, Inc, a subsidiary of Kawasaki Heavy Industries of Kobe, Japan, the $1.4 billion base order for the first 535 new R211 cars. The cars are anticipated to be delivered from 2020 to 2023. Kawasaki has announced that the first test trains will be delivered in 2020. The cars are being assembled at factories in Lincoln, Nebraska and Yonkers, New York. Kawasaki also announced that there would be two option orders, with the first consisting of 640 cars in 89 sets. The entire order will consist of 1,612 cars with both options exercised. The delivery of the base order is scheduled to be completed by August 2023, with option 1 and option 2 completed by December 2024 and October 25, respectively. In October 2018, it was confirmed that the second option order would consist of 89 sets from 437 cars. ==== Delays in delivery ==== The first R211A train was scheduled to be delivered in July 2020, but was delayed to January 2021. The first two test trains of ten R211T open-gangway cars would have been delivered in May 2021. Thereafter, new R211 cars would've been produced and delivered at a rate of 40 cars per month. A decision on whether to continue deliveries of Kawasaki's R211 open-gangway or standard trainsets has been put on hold until the end of the year. If the two option orders of 1,077 cars were exercised, deliveries would have continued through late 2025. Delivery of the first cars for the R211T and R211S test trains was delayed. The onset of the COVID-19 pandemic had impacted global supply chains. Kawasaki planned to deliver 22 cars per month, an independent engineering consultant for the MTA described as \"aggressive\". Delivery of the first cars for the R211A and R211T test trains has been delayed again. Delivery of the base order of R211As had to be underway by November 2023 so there would be enough cars to test a communications-based train control (CBTC) system. ==== Delivery ==== The first set of R211As was delivered to the New York City Transit Authority in June 2021. The test train was delivered despite a lack of staff in Nebraska and a shortage of important parts. It was prepared at Coney Island Yard for several weeks before being tested. ==References== Category:New York City Subway",
 "title": "R211 (New York City Subway car)"
}