{
 "id": "936537",
 "text": "Telefe Noticias is the news unit of the Argentine television network Telefe. It is responsible for the production of four newscasts, a web portal and pages on social networks. It covers both Argentine and international news, along with live coverage, special reports and specialist analysis. The news editions are broadcast live to the rest of America and Europe by Telefe Internacional. On March 7, 2022, Telefe Noticias renewed its graphics, its studio and its musical curtain. ==History== In 1976, the year in which the military dictatorship calling itself the Argentine National Reorganization Process began, the channel was administered by the Argentine Air Force. With this, the quality of the news takes on a more officialist tone than it had before, but stronger due to censorship and the absence of freedom of expression promulgated by the de facto government. In December 1983, when democracy returned, The argentine President Raúl Alfonsín appointed an inspector for the channel that continued with the officialist tone, but with more freedom of the press and without implanting the terrorism characteristic of the previous government. The news show is renamed to \"The News\" in January 1984. ===Reprivatization (1990)=== On January 15, 1990, after the tender for the privatization of Channel 11 in Buenos Aires, which would be renamed Telefe, the newscast changed its name again, first to simply First Edition and Second Edition; and later to Telefe Noticias on July 30, 1990. In 1991 the extra edition was broadcast late at night for coverage of the Gulf War. In 1993, the information direction of Telefe decided to launch a new news channel, which it called \"Red de Noticias\" and would compete with the Artear Todo Noticias signal. With this, Telefe Noticias concentrated the most important news and in the satellite signal other journalistic programs that would complement the information. Journalists such as Rosario Lufrano, Fanny Mandelbaum, Ulises Lencina, Laly Cobas, Carlos Asnaghi, Guillermo Barletta and Amalia Rosas, manage to consolidate themselves in the newscasts of both channels. However, in 1998, Red de Noticias ceased its broadcasts due to low audience levels, despite the fact that some of the journalists who were fired, such as Mandelbaum, Lufrano, Lencina, Cobas and Asnaghi, denounced censorship by the company. ===Reduction of editions (1999-2002)=== On April 5, 1999, after the closure of Red de Noticias and the layoffs, the central edition (Second edition) of the news program was canceled despite measuring an average of 20 audience points per day. In this way, only one broadcast of the shipment remained on the air, at 12:00. The reasons for the closure would have been for political reasons, since in that same year there were general presidential elections. However, three years later, after the economic crisis in Argentina in 2001 and the successive changes in the national government, the evening edition resurfaced on August 12, 2002, now led by Rodolfo Barili and Cristina Pérez. Omar Fajardo reinforces the first noon edition led by Jorge Jacobson and Paula Trapani. ===Diario de Medianoche (2003-2017)=== As of 2003, in addition to the noon and evening editions already normalized, a third began to be broadcast at midnight, called at that time Diario de Guerra (War Diary). The program had a short duration of about 10 to 15 minutes and focused especially on the Iraq War. It was presented by the same journalists as in the central edition: Rodolfo Barili and Cristina Pérez. Months later, as the general national elections approached, the news program went from being called Diario de Guerra (War Diary) to Diario de elecciones (Elections Diary), now dedicated entirely to the candidates. But in 2004 it also began to deal with other types of news, nationally and internationally, with which it again changed its name to Diario de Medianoche (Midnight Diary), consolidating itself in that time slot. ===2010s=== After 13 years in front of the news, the journalist Jorge Jacobson, retires from the program in September 2010; he is replaced by Adrián Puente, an event that occurred on October 11 of that year, when Telefe Noticias also made a change of graphics and studio. In 2009, the 4 editions of Telefe's news programs have been definitively consolidated, although they have changed their format and broadcast sections on entertainment, technology, information technology and research. It also launched its 2.0 website with 24-hour news programming. The most important change, in addition to the format and the way of giving the news, are the modifications and extensions of schedules in order to increase the audience. The noon edition, which was 1 hour long, went on to last somewhere between 75 or 90 minutes and was moved to 13:00. The same thing happened with the 7:00 p.m. edition, which went on to air at 8:00 p.m. For 2021, these two editions are 75 minutes long. On May 9, 2011, a new edition began, in the morning, called Baires Directo, which is hosted by Érica Fontana and Gustavo López; it has a tendency to journalistic magazine. Because of this, Fontana stopped hosting the Diario de Medianoche (Midnight Diary). Its content manager, Francisco Mármol, announced on Twitter that a new edition would be released in 2013 that would air on weekends. On August 5, the studios are renewed for the third and last time with a new desk, newsroom in the background and central control of the newscast. On November 4 of the same year, Milva Castellini left Telefe Noticias at 13 to host Baires Directo and exchanged for her respective host, Érica Fontana. In February 2014, Gustavo López left Baires Directo, being replaced by Adrián Puente. On January 23, 2017, the noon news was moved to noon due to the premiere of ¿En que mano esta?. On September 1, 2017, Telefe left the Carlos Calvo 1530 studios in the Autonomous City of Buenos Aires to move to the new studios in the Buenos Aires town of Martínez. On September 4, the studios and graphics of Telefe Noticias and Baires Directo were renewed, which was renamed Buen Telefe. which happens to be broadcast at 1:00 p.m. Adrián Puente hosts the morning news and other journalists. Milva Castellini returns to the 1:00 p.m. edition accompanied by Nicolás Repetto and Érica Fontana as co-hosts of the edition. The only news program that continues with the name Telefe Noticias is the one at 8:00 p.m., which is hosted by journalists Rodolfo Barili and Cristina Pérez. On September 5, Diario de Medianoche was renamed Staff, hosted by Gisela Busaniche, Ignacio \"Nacho\" Girón, Federico Ini and Jowi Campobassi. ===2020s=== On August 3, 2020, Telefe Noticias relaunched Buen Telefe, with new graphics and a new studio, maintaining the musical curtains of 2017. In October, Telefe Noticias is launched as a television channel within the Pluto TV online platform, available to all Latin America. On November 3, 2020, Telefe Noticias organized detailed coverage of the US elections in conjunction with CBS, since both networks belong to ViacomCBS. On November 25, 2020, due to the death of Diego Maradona, there was a special coverage of 9 hours and 30 minutes, from 1:00 p.m. to 10:30 p.m. ==Slogans== * 1990-1995: Donde esta la información (Where is the information). * 1995-1997: La verdad (The truth). * 2001-2002: Senti la verdad (I felt the truth). * 2002-2006: La información (The information). * 2006-2010: Contamos tu vida (We tell your life). * 2010-2017: Vos elegís todo el dia (You choose, all day). * Since 2017: Periodismo (Journalism). ==Awards== * 2013 Martín Fierro Awards ** Won: Best TV news program ** Nominated: Best female TV host (Cristina Pérez); best male journalist (Reynaldo Sietecase) ==References== ==Other websites== * Category:Telefe",
 "title": "Telefe Noticias"
}