{
 "id": "936553",
 "text": "Shoot for the Stars, Aim for the Moon is the first studio album by American rapper Pop Smoke. It was released after his death on July 3, 2020, by Victor Victor Worldwide and Republic Records. A deluxe edition of the album that includes fifteen additional songs was released on Pop Smoke's birthday (July 20) of that year. The album is a drill, trap, and R&B; record. Following Pop Smoke's murder February 19, 2020, rapper 50 Cent executive-produced Shoot for the Stars, Aim for the Moon. 50 Cent completed Pop Smoke's record by calling the featured artists and meeting the deadlines. After the album was completed, 50 Cent took Pop Smoke's mother to an awards event. Jess Jackson rebuilt the tracks, mixed and arranged the album to get the professional sound of a large recording studio. Pop Smoke had established the Shoot for the Stars Foundation before he died, with the objective of assisting children in reaching their goals while living and growing up in tough situations by giving access to technology and other services. Shoot for the Stars, Aim for the Moon contains six singles. \"For the Night\" and \"What You Know Bout Love\" both reached the top-10 on the Billboard Hot 100. \"The Woo\", \"Mood Swings\", \"Make It Rain\", and \"Hello\" all reached the top-85. Shoot for the Stars, Aim for the Moon debuted at number one on the Billboard 200 in the United States. It gave Pop Smoke his first number-one hit in that country. Following its release, all 19 tracks on the standard album charted on the Billboard Hot 100, giving the late rapper the most entries all together on the Hot 100 posthumously (after death). Shoot for the Stars, Aim for the Moon spent 34 weeks in the top five of the Billboard 200, making it only the fourth album in the twenty-first century to do so. ==Background== In April 2019, Pop Smoke was introduced to record executive Steven Victor by record producer Rico Beats. Pop Smoke told Victor after signing to Victor Victor Worldwide and Republic Records that he had previously sung for church services. In addition to rapping, he had experience as a singer. Pop Smoke performed an unreleased song called \"Something Special\" and a track called \"What You Know Bout Love\" for Victor. The latter song made a lasting impression on the Victor Victor executives, convincing them that Pop Smoke was more than \"just another drill rapper from Brooklyn.\" Because Victor worked closely with rapper Kanye West as the chief operating officer of his record label GOOD Music at the time, Victor knew that many of rap's most popular musicians had been successful in introducing new sounds into the public. Pop Smoke would go on to make a series of mixtapes focused solely to Brooklyn drill. Pop Smoke would release his first album that showed his melodic side with bigger, more mainstream songs like \"Something Special\" after establishing himself as the \"leader\" of the subgenre that was growing in New York City. On February 19, 2020, Pop Smoke was staying at a Airbnb owned by Teddi Mellencamp and her husband, Edwin Arroyave, in Hollywood Hills, California. Four hooded males broke into Pop Smoke's rental house. One of them was wearing a ski mask and was holding a gun. Pop Smoke was transported to Cedars-Sinai Medical Center where he died a short time later at the age of 20. In March 2020, rapper 50 Cent said on his Instagram account that he had been listening to Pop Smoke's music and had chosen to work as executive producer on his new album. As the executive producer, 50 Cent contacted Roddy Ricch, Drake, and Chris Brown to see if they wanted to appear on the album. During an Instagram live a few weeks later, 50 Cent remembered a meeting he had with Pop Smoke in an office for the first time. When 50 Cent stood up, he saw that Pop Smoke was writing down everything he said on his phone. 50 Cent said that he had \"fallen in love\" with Pop Smoke and that he would executive produce his album. In a later interview with Billboard, 50 Cent explained that he would not be paid as the album's executive producer since he wanted to finish it because of his relationship with Pop Smoke. Following the end of the production, 50 Cent helped Pop Smoke in honoring his wish to take his mother to an awards show. In January 2020, Pop Smoke began creating the Shoot for the Stars Foundation to assist young people in reaching their goals due to living and growing up in tough situations by providing access to technology and other tools. Pop Smoke's family announced that the foundation would continue after his death. ==Recording== Pop Smoke had recorded the first songs for Shoot for the Stars, Aim for the Moon before signing with Victor Victor Worldwide. Pop Smoke wanted to show how he had changed musically after finishing his first two mixtapes Meet the Woo (2019) and Meet the Woo 2 (2020). Pop Smoke flew to Los Angeles in mid-February 2020 to record as much music as possible for the album. He recorded the album's final songs in the final days of his life. Pop Smoke and his team planned to finish the album in Los Angeles, during his first headlining concert tour, Meet the Woo Tour, in the first week of March 2020. While he was on tour, the record was supposed to be mixed and mastered. ==Music and lyrics== Shoot for the Stars, Aim for the Moon, according to Danny Schwartz of Rolling Stone, mixes \"drill's swooping rhythms with austere Atlanta trap that Migos and Zaytoven mastered mid-decade\". It has, according to Charles Lyons-Burt of Slant Magazine, \"ill-advised forays into R&B; found on DaBaby's Blame It on Baby\". The staff of Billboard said the album \"gestures toward R&B; and more soulful sounds\". The album opens with \"Bad Bitch from Tokyo\", which has drumbeats, ad-libbed harmonies, crows cawing, and Pop Smoke rapping about his own death. \"Aim for the Moon\" featuring Quavo is a drill track that with braggadocio, hi-hats, and bass. Pop Smoke and Quavo rap about enjoying their wealth. \"For the Night\" featuring Lil Baby and DaBaby is a hip hop, trap, and soul song with lyrics about night-time occurrences. The song's main instruments are an acoustic guitar, folk flutes, heavily autotuned vocals, and processed moans from Lil Baby and DaBaby. \"44 Bulldog\", the fourth track, is a drill song with enigmatic barks and sung synth tones. The song was named after the Charter Arms Bulldog, double-action revolver. Pop Smoke claims to be the king of New York and shows his hate towards 6ix9ine on the R&B; song \"Gangstas\", which has minimalist piano and snare drums. The drill tracks \"Yea Yea\" and \"Creature\" featuring Swae Lee are about a \"tough-guy rapper pivot[ing] seamlessly into romance on the horizon,\" according to Craig Jenkins of Vulture. \"Snitching,\" a trap song featuring Quavo and Future, is a song in which Pop Smoke raps about the threats he faced daily, while Quavo and Future rap about how people should be aware about the world's traitors. \"The Woo\", a trap song featuring 50 Cent and Roddy Ricch, interpolates 50 Cent's tracks \"Candy Shop\" and \"Hate It or Love It.\" \"Make it Rain\" which features rapper Rowdy Rebel. He was in prison at the time and had to record his verse by telephone. \"West Coast Shit\" featuring Quavo and Tyga interpolates the lyrics of Too Short's 2003 single, \"Shake That Monkey\". Pop Smoke and Tyga rap about the wonders of the United States' west coast. \"Enjoy Yourself\" featuring Karol G is a Latin trap and urbano with lyrics about a deep reflection on love. The song contains a sample of a song named \"Drink Freely\" by Moroccan-American rapper French Montana. \"Something Special\" is an R&B-bounce; song that samples Fabolous' \"Into You\" from 2003. Pop Smoke is obsessed with his new partner and their new love in the lyrics. \"Mood Swings\", an R&B; song featuring Lil Tjay, is about having sex with women who don't use birth control. An R&B; track, \"What You Know Bout Love\" samples Ginuwine's song \"Differences\". The song, which has a hi-hat and finger snaps, is about Pop Smoke having passion for his lover. The R&B; track \"Diana\", features King Combs and includes parts from Playa's 1998 single \"Cheers 2 U\". The lyrics are about Pop Smoke being lustful and taking a strong aim at love. \"Got It on Me\" is a hip hop track that interpolates 50 Cent's \"Many Men (Wish Death)\" lyrics. Pop Smoke begs his enemies for mercy in the lyrics. \"Tunnel Vision (Outro)\" is a drill track in which Pop Smoke looks foward to the future and wishes to make an impact in the music industry. The album ends with the bonus track \"Dior\", a drill and hip hop song about flirting with women and buying the most up-to-date expensive clothes. ==Release date== Pop Smoke had wanted the album to be released in summer, close to his birthday on July 20. Before his murder, the album was to have been released on June 12, Memorial Day, an American federal holiday. Pop Smoke's team announced on May 14, 2020, that the album had a planned release date of June 12, 2020, The lead single \"Make It Rain\" was released on that date instead. Victor announced they had pushed the album's release back to July 3, 2020, due to the George Floyd protests against police brutality and racism. Pop Smoke's estate announced they had signed a co-publishing deal with Warner Chappell Music covering his past music and Shoot for the Stars, Aim for the Moon. The deluxe edition of the album was released on July 20, 2020, on what would have been Pop Smoke's 21st birthday. It features fifteen additional tracks, including remixes of three songs from the original album. The first single from the album, \"Make it Rain\", peaked at number 49 on the US Billboard Hot 100. It peaked within the top-75 of charts in Canada and the United Kingdom. \"Enjoy Yourself\" was released as a promotional single on July 2, 2020. It peaked at number 56 on the Hot 100. \"The Woo\" was released as the album's second single on July 8, 2020. An accompanying music video, which Eif Rivera directed, was released on July 20, 2020. The song peaked at number 11 on the Hot 100. It reached the top-10 in Canada, New Zealand, Portugal, and the United Kingdom. \"The Woo\" was nominated for Song of Summer at the 2020 MTV Video Music Awards. The album's third single \"Mood Swings\" was released on August 21, 2020. A visualizer for the track that featured Jordyn Woods and Dylan and Dakota Gonzalez, was released on August 20, 2020. Later, a music video for the song was directed by David Wept and was released on October 7, 2020. A remix featuring the voice of American singer Summer Walker was released as a single on September 18, 2020. \"Mood Swings\" reached number 17 on the Hot 100. It reached the top-10 in Australia, Denmark, Ireland, New Zealand, and the United Kindgom. It topped the charts in Portugal. \"For the Night\" was released as the album's fourth single on October 3, 2020. The song peaked at number six on the Hot 100, giving Pop Smoke his first top-10 hit in the United States. It further peaked with the top-10 in Canada, New Zealand, Norway, and Portugal. It was nominated for Best Collaboration at the 2021 BET Awards. The album's fifth single \"What You Know Bout Love\" was released on October 30, 2020. Oliver Cannon directed the song's music video. The video was released on December 22, 2020. The song peaked at number nine on the Hot 100, giving Pop Smoke his second top-10 hit in the United States. It also reached the top-10 in Australia, Austria, Ireland, New Zealand, Norway, Portugal, Sweden, and Switzerland. \"What You Know Bout Love\" was nominated for Favorite Rap/Hip Hop Song at the 2021 American Music Awards. It won Hip-Hop Song of the Year at the 2022 iHeartRadio Music Awards. \"Hello\" featuring A Boogie wit da Hoodie was released as the album's sixth and final single on February 9, 2021. The song peaked at number 83 on the Hot 100 while reaching the top-80 in Austria, Canada, Ireland, and Switzerland. ==Track listing== ==Charts== ===Weekly charts=== Chart performance for Shoot for the Stars, Aim for the Moon Chart (2020) Peak position Lithuanian Albums (AGATA) 5 ===Year-end charts=== 2020 year-end chart performance for Shoot for the Stars, Aim for the Moon Chart (2020) Position Australian Albums (ARIA) 11 Austrian Albums (Ö3 Austria) 20 Belgian Albums (Ultratop Flanders) 14 Belgian Albums (Ultratop Wallonia) 38 Canadian Albums (Billboard) 3 Danish Albums (Hitlisten) 3 Dutch Albums (Album Top 100) 1 French Albums (SNEP) 48 German Albums (Offizielle Top 100) 71 Irish Albums (IRMA) 8 Italian Albums (FIMI) 50 New Zealand Albums (RMNZ) 4 Swedish Albums (Sverigetopplistan) 12 Swiss Albums (Schweizer Hitparade) 10 UK Albums (OCC) 6 US Billboard 200 7 US Top R&B;/Hip-Hop Albums (Billboard) 5 2021 year-end chart performance for Shoot for the Stars, Aim for the Moon Chart (2021) Position Australian Albums (ARIA) 11 Austrian Albums (Ö3 Austria) 11 Belgian Albums (Ultratop Flanders) 13 Belgian Albums (Ultratop Wallonia) 51 Canadian Albums (Billboard) 3 Danish Albums (Hitlisten) 6 Dutch Albums (Album Top 100) 8 French Albums (SNEP) 44 German Albums (Offizielle Top 100) 46 Irish Albums (IRMA) 19 Italian Albums (FIMI) 54 New Zealand Albums (RMNZ) 4 Norwegian Albums (VG-lista) 5 Swedish Albums (Sverigetopplistan) 33 Swiss Albums (Schweizer Hitparade) 14 UK Albums (OCC) 15 US Billboard 200 3 US Top R&B;/Hip-Hop Albums (Billboard) 1 ==Certifications== == References == Category:2020 albums Category:Debut albums Category:Trap albums Category:R&B; albums",
 "title": "Shoot for the Stars, Aim for the Moon"
}