{
 "id": "936688",
 "text": "Murod Nazarov (; born 16, November, 1980) is an Uzbek Vice-president of the polo federation of UzbekistanOʻzbekiston polo federatsiyasi rahbariyatining tarkibi qayta shakllantirildi olympic.uzТадбиркор Мурод Назаров янги лавозимга сайланди xabar.uz and Deputy of Tashkent city council.BI Group совместно с партнером увеличивают свою долю строящегося жилья в ТашкентеforbesNazarov boyligi taxminan qanchaligini aytdi daryo.uz == Personal life == Murad Nazarov is married and has 14 children. In 2002 he married Umida Nazarova. From a joint marriage he had 3 daughters and 2 sons. In December 2021, Nazarov adopted 9 children (2 boys and 7 girls) from the House of Mercy in Tashkent.POTD: Uzbek real estate mogul adopts 9 children tashkenttimes.uz == Career == * 2002-2003 Program Assistant at JICA Uzbekistan Office (Japanese Technical Cooperation Agency). * 2003-2013 Founder and CEO of ISA-NABI LLC. * 2010-2015 Founder and director of AVALON GROUP LLC. * 2014 Founder of the MURAD BUILDINGS brand and General Counsel of a number of companies operating under this brand.Buildings “Yangi ko‘chib keluvchilarni kutamiz!” ijtimoiy- ekologik loyihasini ishga tushiradi daryo.uz * 2015 Founder and Director of Franchising Invest LLC. * 2017 Founder and director of PE MURAD BUILDINGS.Kompaniya haqida mbc.uzNazarov: Ish o‘rni yaratgandan ko‘ra uning samaradorligini oshirgan ma’qul daryo.uz * 2019 is a deputy of the Tashkent City Council. * 2019 In 2019, NEST ONE was opened in cooperation with Turkey.Мурад Назаров: Строительство \"Nest One\" завершится в День Независимости uzreport.news * Since 2020 Co-founder, Chairman of the Board of Directors of JV OOO NRG.Назаров: «Откройте NRG вместе с Murad Buildings и BI GROUP» gazeta.uzMurod Nazarov ikkita yangi noodatiy loyihani taqdim etdi kun.uz * Since 2022 Member of the Supervisory Board of the University of World Economy and Diplomacy. * Since 2022, Vice-President of the Equestrian Polo Federation of Uzbekistan.Qaydan bilsin ot qadrin, ot minmagan erkaklar?! Murod Nazarov polo federatsiyasida ish boshladi qalampir.uzTaniqli tadbirkor Murod Nazarov O'zbekistondagi sport federaciyalaridan birining raisiga o'rinbosar bo'ldi olamsport.com == Awards == * 2011 Commemorative plaque \"20 years of Independence of Uzbekistan\". * Sign \"Uzbekistan\" in 2017. * Medal \"Shukhrat\" in 2017. * Badge \"Mehr-Saxovat\" (Generosity and Mercy) in 2020. == References == == Other websites == * Kompaniya haqida Category:Living people Category:1980 births Category:Uzbekistani politicians Category:People from Tashkent",
 "title": "Murod Nazarov"
}