{
 "id": "936767",
 "text": "YAK-Service Flight 9633 was an air accident that occurred at 16:02 (local time) on September 7, 2011. A Yakovlev Yak-42D passenger plane operated by the Russian airline Yak Service crashed in the Yaroslavl region (Russia). The plane overran the runway at Tunoshna airport before taking off, hitting an antenna mast, caught fire and crashed on the Volga River bank. Forty-four people died, including all the members of the Lokomotiv Yaroslavl ice hockey team. The tragedy is commonly known as the Lokomotiv Yaroslavl plane crash. On takeoff, one of the pilots accidentally applied braking to the wheels on takeoff, preventing the aircraft from leaving the ground as it overran the runway at Tunoshna. The aircraft finally left the ground on the grass, flew for a few hundred feet, entered an aerodynamic stall, the left wing struck a localizer antenna, as the damaged wingtip dragged the plane down while the pilots aggressively attempted to climb away from foliage and trees located on the other side of the Volga River, the left wing struck the ground and caused the aircraft to drag along the ground for a few hundred feet before hitting the riverbank, breaking up, and exploding on impact. ==Accident== On takeoff, one of the pilots accidentally applied braking to the wheels on takeoff, preventing the aircraft from leaving the ground as it overran the runway at Tunoshna. The aircraft finally left the ground on the grass, flew for a few hundred feet, entered an aerodynamic stall, the left wing struck a localizer antenna, as the damaged wingtip dragged the plane down while the pilots aggressively attempted to climb away from foliage and trees located on the other side of the Volga River, the left wing struck the ground and caused the aircraft to drag along the ground for a few hundred feet before hitting the riverbank, breaking up, and exploding on impact. ==Investigation== Investigation determined that several factors caused the accident. This includes poor training, incorrect calculation of takeoff speed by the flight crew, and bad application of wheel braking by one of the pilots, who had incorrectly placed feet on the pedals. It was later revealed that the pilot had used forged documents to obtain permission to fly the plane, and that both crew members did not have the needed training to fly the Yak-42. == References == ==Other websites== * * Investigation into the crash (Archive) – Interstate Aviation Committee * Topic of news from RIA Novosti Category:Aviation accidents and incidents in the 2010s Category:Aviation accidents and incidents involving professional sports teams Category:Aviation accidents and incidents in Europe Category:Yaroslavl Oblast",
 "title": "YAK-Service Flight 9633"
}