{
 "id": "93674",
 "text": "The Madison Square Garden (frequently called The Garden or MSG) is an indoor arena in the New York City borough of Manhattan. The arena is home of the New York Knicks NBA team and the New York Rangers of the NHL. It also is the site of many concerts and special events each year and a few college basketball games are played there There have been four arenas with the name Madison Square Garden at three different sites in Manhattan. The first was an open-air arena built in 1879 at East 26th Street and Madison Avenue, also known as Madison Square. It was torn down and replaced with an indoor arena at the same site in 1890. The third MSG, on Eighth Avenue between 49th and 50th Streets, opened in 1925. The current Madison Square Garden opened in 1968. It is at 4 Penn Plaza, close to the intersection of 8th Avenue & 33rd Street in Manhattan, New York City. Was named after 4th President of the United States of America. == Seats == The arena has six sections of seats. One of them is not open if hockey is played, because a hockey rink is larger than a basketball court. The other sections used to have different colors. There were red, orange, yellow, brown and blue seats. However, the fans of the New York Rangers only wanted to sit in the blue seats. They did not want to use any of the other sections. They even did not let other fans use the blue seats. For this reason, the MSG does not use these colors today. The most active fans sit in the section 400. The number of people who can visit the arena changes. If hockey is played and the first section is taken out to make room for the rink, 18,200 people may be there. For basketball, 19,763 people can watch. Up to 20,000 people may watch a concert in the arena. == Important events == * The track cycling race known as the \"madison\" was invented at the second Garden, and named after both the first and second Gardens. Both arenas were important cycling venues in the late 1800s and early 1900s. * In 1962, the U.S. President John F. Kennedy celebrated his 45th birthday in the third MSG. At the party, Marilyn Monroe sang the song Happy Birthday. * In 2007, Elton John celebrated his 60th birthday in the current MSG. It was also his 60th concert in this arena with all tickets sold. * The Big East Conference holds its annual men's basketball tournament at MSG == Concerts == * Bob Marley * Led Zeppelin * Frank Sinatra * Elton John * Elvis Presley * Rolling Stones * Madonna * John Lennon * Guns N' Roses * Michael Jackson * Lady Gaga * Justin Bieber * One Direction * Litte Mix * Ariana Grande * Phish * 5 Seconds Of Summer * Billy Joel * Black Coffee * A-Reece == Home teams == * New York Rangers (NHL) * New York Knicks (NBA) * New York Liberty (WNBA) * St. John's Red Storm men's basketball (NCAA) – most home games == Other websites == * Official Site Category:Sports buildings in New York City Category:WrestleMania host Category:Buildings and structures in Manhattan Category:New York Rangers",
 "title": "Madison Square Garden"
}