{
 "id": "936825",
 "text": "The National Transportation Safety Board (NTSB) is an independent U.S. government investigative agency responsible for civil transportation accident investigation. Upon request, the NTSB may assist the military and foreign governments with accident investigations. The agency is headquartered in Washington D.C. ==Jurisdiction over investigations== ;Aviation: The NTSB has primary authority to investigate every civil aviation accident in the United States; the agency is also authorized to conduct investigations involving both civilian and military aircraft \"with the participation of appropriate military authorities\". For certain accidents, due to resource limitations, the Board will ask the FAA to collect the factual information at the scene of the accident; the NTSB bases its report on that information. ;Surface Transportation: The NTSB has the authority to investigate all highway accidents and incidents, including incidents at railway grade crossings, \"in cooperation with a State\". The NTSB has primary jurisdiction over railway accidents and incidents which result in death or significant property damage, or which involve a passenger train. ;Marine: For marine investigations, jurisdiction into investigations is divided between the NTSB and the U.S. Coast Guard. The division of investigative jurisdiction and responsibilities is prescribed in a detailed Memorandum of Understanding between the two agencies. ;Pipeline: The NTSB has primary jurisdiction over pipeline incidents which involve \"a fatality, substantial property damage, or significant injury to the environment\". ;Assistance to criminal investigations: The NTSB has primary jurisdiction over civil transportation investigations, but not criminal investigations. If the Attorney General declares the case to be linked to a criminal act, the NTSB must relinquish control of the investigation to the Federal Bureau of Investigation. The NTSB may still provide technical support to the FBI in such investigations. In two high- profile examples, the NTSB sent aviation accident investigators with knowledge of aircraft structures and flight recorders to assist the FBI's criminal investigation into the murder-suicide of Pacific Southwest Airlines Flight 1771 in 1987, and the September 11, 2001 attacks fourteen years later. ;Assistance to other domestic agencies: In addition to assisting the Department of Justice in criminal investigations, the NTSB has also assisted the National Aeronautics and Space Administration (NASA) in its investigations of both the Challenger and the Columbia Space Shuttle disasters. The NTSB also provides assistance on request to the U.S. military in its investigation of military incidents within the realm of the NTSB's expertise, such as the crash of an Air Force transport plane in former Yugoslavia that took the lives of more than 30 Americans, including Commerce Secretary Ron Brown. ==Current board members== Name Position Appointed by Sworn in Term expires Chairwoman Donald Trump Vice Chairman Donald Trump Board Member Donald Trump Board Member Donald Trump Vacant Board Member — — The US President Joe Biden has nominated board member Jennifer Homendy to serve as the next Senate-confirmed chair. ==References== Category:1967 establishments in the United States Category:Transport in the United States Category:Federal government of the United States",
 "title": "National Transportation Safety Board"
}