{
 "id": "936829",
 "text": "The Hex Girls (or simply Hex Girls) are a fictional female band created by writers Rick Copp and David A. Goodman. It was portrayed by actresses and singer-songwriters Jennifer Hale (as lead singer and guitarist Thorn, real name Sally McKnight), Jane Wiedlin (as drummer and back-up singer Dusk) and Kimberly Brooks (as keyboardist, Bassist and back-up singer Luna). Hale, Wiedlin and Brooks write and perform original songs for the band. ==Band members== ===Voice acting members=== * Jennifer Hale - Portrays Sally \"Thorn\" McKnight, the lead singer and guitarist. * Jane Wiedlin - Portrays Dusk, the drummer and back-up singer. * Kimberly Brooks - Portrays Luna, the keyboardist and back-up singer. ===Former members=== *Wendy Fraser - additional vocals *Angie Jarée - additional vocals *Windy Wagner - additional vocals *Terry Wood - additional vocals *Gigi Worth - additional vocals ===Guest member=== * Grey DeLisle - featured artist as Daphne Blake aka \"Crush\" ==Discography== ===Soundtracks=== List of Soundtrack albums Title Album details Scooby-Doo! and the Witch's Ghost * Released: September 14, 1999 * Label: Kid Rhino * Format: CD ===Unreleased songs=== Song Writer(s) Date Notes \"Good Bad Girls\" Dave Wakeling March 26, 2013 *First featured in the Scooby-Doo! Mystery Incorporated episode \"Dance of the Undead\". \"Love's Curse\" Dave Wakeling July 2, 2020 *First featured in the Scooby-Doo and Guess Who? episode \"I Put A Hex On You!\". \"Petrified Bride\" Rich J. Dickerson Helene Arkin Jordana October 18, 2003 *First featured in the What's New, Scooby-Doo? episode \"The Vampire Strikes Back\". \"Trap of Love\" Tony Cervone Andy Sturmer August 23, 2010 *First featured in the Scooby-Doo! Mystery Incorporated episode \"In Fear of the Phantom\". \"What's New, Scooby-Doo?\" Rich J. Dickerson Luigi Meroni October 18, 2003 *First featured in the What's New, Scooby-Doo? episode \"The Vampire Strikes Back\". \"Who Do Voodoo\" Jane Wiedlin March 4, 2003 *First featured in the film Scooby-Doo! and the Legend of the Vampire. ==References== Category:Fictional characters introduced in 1999 Category:Scooby-Doo characters Category:Animated human characters",
 "title": "The Hex Girls"
}