{
 "id": "936948",
 "text": "Shopkeeping Goddesses or Shopkeeper Goddesses (, ) are the goddesses in Meitei mythology and religion (Sanamahism). They are worshipped by the people in Ancient Kangleipak (Antique Manipur). These goddesses are known for shopkeeping market for different shops. Different stories have different answers to how many shopkeeping goddesses there are. They are Cheng Leima, Chinga Leima, Heipok Leima, Hei Leima, Laa Leima, Phu Leima, Pishum Leima, Thangching Leima, Waisheng Leima, Waithou Leima and Waal Leima. == List == Names of Goddesses Latin transliteration (Romanisation) Aliases Latin transliteration (Romanisation) Etymology (or Description) Selling items English translation Notes (or References) ꯆꯦꯡ ꯂꯩꯃ Cheng Leima ꯆꯦꯡꯂꯩꯃ Chengleima Goddess of rice Cheng Rice ꯆꯤꯡꯉꯥ ꯂꯩꯃ Chinga Leima ꯆꯤꯪꯉꯥ ꯂꯩꯃ, ꯆꯤꯡꯉꯥ ꯂꯥꯢꯔꯦꯝꯕꯤ (ꯆꯤꯡꯉꯥ ꯂꯥꯏꯔꯦꯝꯕꯤ), ꯆꯤꯡꯉꯥ ꯂꯥꯢꯂꯦꯝꯄꯤ (ꯆꯤꯡꯉꯥ ꯂꯥꯏꯂꯦꯝꯄꯤ) Ching-nga Leima, Chinga Lairembi, Chinga Lailempi Lady of Chinga Houwai Chengwai, Manaa Mashing Cereals, Pulses (legumes), Vegetables ꯍꯩꯄꯣꯛ ꯂꯩꯃ Heipok Leima ꯍꯩꯕꯣꯛ ꯂꯩꯃ Heibok Leima Lady of Heipok (Heibok) Yot, Thangjou, Heijrang, Konchap, Khabei, Chegap Iron tools, Dagger, Knife, Shear, Ladle, Tong ꯍꯩ ꯂꯩꯃ Hei Leima ꯍꯩꯂꯩꯃ, ꯍꯩꯔꯩꯃ Heileima, Heireima Goddess of fruits Hei, Athum Ahao Fruits and Sweets ꯂꯥ ꯂꯩꯃ Laa Leima (La Leima) ꯂꯥꯔꯩꯃ Laareima (Lareima) Goddess of banana leaf Laa (Lā) Banana leaves ꯐꯨ ꯂꯩꯃ Phu Leima ꯐꯨꯂꯩꯃ, ꯐꯨꯔꯩꯃ Phuleima, Phureima Goddess of pots Phu (Phoo), Pukham Pots (Vessels), Plates ꯄꯤꯁꯨꯝ ꯂꯩꯃ Pishum Leima ꯄꯤꯁꯨꯝꯂꯩꯃ Pishumleima Lady of Pishum Laiphi, Khwangshet Namkhang, Namshaa, Sanaa Lupaa Clothes for deities, Waist clothings (Belts), Upper body clothings, Jewellery of gold and silver ꯊꯥꯡꯆꯤꯡ ꯂꯩꯃ Thangching Leima ꯊꯥꯪꯆꯤꯪ ꯂꯩꯃ, ꯊꯥꯡꯖꯤꯡ ꯂꯩꯃ, ꯊꯥꯪꯖꯤꯪ ꯂꯩꯃ Thang-ching Leima, Thangjing Leima Lady of Thangching Paannao Shingnao, Maroi, Morok Colocasia (Taro), Herbs, Chili peppers, Fresh Chives ꯋꯥꯢꯁꯦꯡ ꯂꯩꯃ Waisheng Leima ꯋꯥꯏꯁꯦꯡ ꯂꯩꯃ, ꯋꯥꯢꯁꯦꯪ ꯂꯩꯃ, ꯋꯥꯏꯁꯦꯪ ꯂꯩꯃ Waiseng Leima Waisheng Lady Thum Lukmai (Thoom Lookmai) Salt, Salt cakes ꯋꯥꯢꯊꯧ ꯂꯩꯃ Waithou Leima ꯋꯥꯏꯊꯧ ꯂꯩꯃ Wai-thou Leima Lady of Waithou Thau (Thao) Oils (Edible oil) ꯋꯥꯜ ꯂꯩꯃ Waal Leima ꯋꯥꯜꯂꯩꯃ, ꯋꯥꯟ ꯂꯩꯃ, ꯋꯥꯟꯂꯩꯃ Wal Leima, Waan Leima, Wan Leima Lady associated with cooking, eating and kitchens Waal == Related pages == * Emoinu (Imoinu) - Goddess of wealth and prosperity * Phouleima (Phouoibi) - Goddess of agriculture, paddy and rice == References == == Other websites == * * * * * * Category:Meitei gods and goddesses",
 "title": "Shopkeeping Goddesses"
}