{
 "id": "937097",
 "text": "Dominic Mark Phillips better known as Dom Phillips (23 July 1964 – 13 June 2022) was a British journalist and freelance writer for The Guardian, he wrote for the Washington Post, The New York Times and The Financial Times. On June 5, 2022, he and Brazilian indigenous peoples expert Bruno Araújo Pereira disappeared in the remote Javari Valley on the western edge of Brazil's Amazon state, one of the most remote areas of the rainforest. ==Assassination== On June 3, 2022, The expert on Indigenous peoples Bruno Pereira and Dom Phillips arrived at Lago do Jaburu, a town near the surveillance base of the National Indian Foundation (Funai) on the Ituí River, so that Phillips could visit the place and conduct interviews with indigenous people. They then went to the community of São Rafael where they would hold a meeting with a local fisherman nicknamed \"Churrasco\". The objective of the meeting was to discuss the joint work between riverside residents and indigenous people in the surveillance of the Javari Valley, a territory highly affected by invasions and criminal activities. However, the resident was not in the community. Bruno and Dom traveled down the Itaguaí River to the municipality of Atalaia do Norte and then disappeared. The Brazilian embassy released a statement that his body had been found on Monday, 13 June, but retracted it the following day, apologizing to Phillips' family for \"information that did not prove correct.\" On 15 June, a man named Amarildo da Costa da Oliveira, who was arrested days before in connection with the case, confessed to shooting and killing both Phillips and Pereira. He also told the police where the remains were buried. The remains were then discovered by the Brazilian authorities, who sent them to the country’s capital, Brasilia, to be examined. On 17 June, the remains that were discovered were identified as belonging to Phillips, these were authenticated through dental records. The second body - believed to be of Pereira, was still being examined. ==References== Category:2022 deaths Category:English journalists Category:1964 births Category:Writers from Cheshire",
 "title": "Dom Phillips"
}