{
 "id": "937062",
 "text": "Meitei mythology or Manipuri mythology is a collection of myths about the religious and cultural traditions of the Meitei people, the largest ethnic group of Manipur. Meitei myths are a part of Meitei culture (Manipuri culture) and explain various natural phenomena, how the human civilization developed, and the reasons of many things happening. Most of the Meitei legends are found in the Meitei language (Manipuri language) books.Hodson, Thomas Callan (2016-05-17). The Meitheis. Creative Media Partners, LLC. ISBN 978-1-356-86725-7.Laisram, Rena (2009). Early Meitei History: Religion, Society and the Manipur Puyas. Akansha Publishing House. ISBN 978-81-8370-163-1.Devi, Dr Yumlembam Gopi. Glimpses of Manipuri Culture. ISBN 978-0-359-72919-7. == Textual sources == Mythical narration plays an important role in nearly every ways of Meitei literature. Some of the best known literary sources are: Ancient texts Description Khongjomnubi Nongarol Story of six girls turning into the Pleiades in the sky Konthoujam Nongarol Story of Goddess Konthoujam Tampha Lairembi Leishemlon Story of the creation of the universeSingh, Moirangthem Kirti (1998). Recent Researches in Oriental Indological Studies: Including Meiteilogy. Parimal Publications.North East India History Association. Session (1995). Proceedings of North East India History Association. The Association. Leithak Leikharol Story of the creation, genealogy of kings, moral teachings and mythologyPanchani, Chander Sheikhar (1987). Manipur, Religion, Culture, and Society. Konark Publishers. ISBN 978-81-220-0047-4.Singh, Moirangthem Kirti (1993). Folk Culture of Manipur. Manas Publications. ISBN 978-81-7049-063-0.Singh, Moirangthem Kirti (1988). Religion and Culture of Manipur. Manas Publications. ISBN 978-81-7049-021-0. Panthoibi Khongul Story of that romantic adventure of Goddess Panthoibi and God Nongpok NingthouSociety and Economy in North-East India. Regency Publications. 2004. ISBN 978-81-87498-83-4.Zama, Margaret Ch (2013). Emerging Literatures from Northeast India: The Dynamics of Culture, Society and Identity. SAGE Publishing India. p. 79. ISBN 978-81-321-1746-9.North East India History Association. Session (2003). Proceedings of North East India History Association. The Association. Phouoibi Waron Story of many lovers of Goddess Phouoibi Poireiton Khunthok Story of the human civilization on earth led by Poireiton and Leinaotabi from the underworld.Singh, R.K. Jhalajit (1965). A Short History of Manipur. O.K. Store.North East India History Association. Session (1988). Proceedings of North East India History Association. The Association.Singh, R.K. Jhalajit (1975). Manipur. Publications Division, Ministry of Information and Broadcasting, Government of India.Singh, R.K. Nimai (2017). neScholar Magazine Vol 03 Issue 03. NE Brothers Pvt. Limited. p. 63.Sen, Sipra (1992). Tribes and Castes of Manipur: Description and Select Bibliography. Mittal Publications. ISBN 978-81-7099-310-0.Singh, Wahengbam Ibohal (1986). The History of Manipur: An early period. Manipur Commercial Company. Sakok Lamlen Story of a sequel to the myth expounded in the Leithak LeikharolSingh, Ch Manihar (1996). A History of Manipuri Literature. Sahitya Akademi. ISBN 978-81-260-0086-9.Rasheeduddin Khan; Indian Institute of Advanced Study (1987). Composite Culture of India and National Integration. Indian Institute of Advanced Study.Dasgupta, Kalyan Kumar; Bhattacharyya, Pranab Kumar; Choudhury, Rabin Dev (1988). Sraddhanjali, Studies in Ancient Indian History: D.C. Sircar Commemoration Volume. Sundeep Prakashan. ISBN 978-81-85067-10-0.Dena, Lal (1991). History of Modern Manipur, 1826-1949. Orbit Publishers-Distributors. == Mythical beings == Mythical beings include gods, goddesses, mythical creatures and many others. == References ==",
 "title": "Meitei mythology"
}