{
 "id": "937238",
 "text": "A Jabsco pump, neoprene vane pump or self-priming neoprene vane pump, is a type of pump used for liquid handling. ==Usage== They are used when water or other liquids must be pumped. In this type of pump, the fluid is sucked continuously, with a capacity depending on the size of the pump and the speed of rotation of the neoprene impeller. == Description == It has a cylindrical compartment with a false deflector that turns it into an oval. Inside the cylinder rotates an impeller with radial neoprene blades, whose turning movement ensures the formation of variable volume chambers with the compartment wall. Since the impeller is in a non-central position, the formation of chambers (delimited by the impeller blades) of variable volume occurs, between which the fluid passes, which the blades suck from the inlet hole and push towards the hole. exit. == History == The first self-priming neoprene vane pumps date back to a 1953 patent issued to Jabsco. The US patent USA no. 422,191 for a \"self-priming neoprene pump.\" In 1982 another patent was given to Jabsco UK (1982-12-23, Priority to GB08205279A) extending the number of blades of the neoprene impeller to 16. == Marine engines == The unique shape of the neoprene impeller rotating inside the oval cavity makes this pump completely self-priming. It can also automatically pump the water needed to cool a boat's engine. This works even if the pump is mounted above the water level, as a vacuum is created in the unit that sucks water from any level and from environments as varied as they can be: the sea, a lake or a stream. == Drinking water == The neoprene blade unit can be used with any potable water storage tank as it applies a pressure to the water distribution circuit equal to the strong depression with which it sucks water from the tank and no pressure tank or air compressor system are needed. The system is easy to install. If instant hot water is needed, simply connect the vane pump outlet to a water heater. == References == == Bibliography == * * == Other websites == * Category:Engineering Category:Mechanics",
 "title": "Jabsco pump"
}