{
 "id": "937272",
 "text": "A season in television is the group of episodes that that are broadcast in one year. The term is commonly used in North American television. In British television, the term series is used. ==North American usage== In the United States, Canada and Mexico, a series is a set of television program episodes that are broadcast with the same title. A series last for one or many years. Each year of the series is called a season. From the late 1960s until the mid 2010s, a season commonly included between 20 and 26 episodes. Before then, a season would often have at least 30 episodes. Some series had as many as 39 episodes in a season. Until the 1980s, most new programs for the United States were first broadcast in the \"fall season\". This ran from September through March. Is usually included from 24 to 26 episodes. These episodes were rebroadcast during the spring (or summer) season, from April through August. Because of cable television and the Nielsen sweeps, the \"fall\" season now normally lasts to May. A \"full season\" of a show usually runs from September through May for at least 22 episodes. ===Splits=== A full season is sometimes split into two parts. A break is taken around the end of the calendar year. When this is done, the last half of the episodes are often referred to with the letter B. For example, \"The last nine episodes (of The Sopranos) will be part of what is being called either \"Season 6, Part 2\" or \"Season 6B\". Since the 1990s, these shorter seasons also have been referred to as \".5\" or half seasons. In them, the run of shows between September and December is labeled \"Season X\", and the second run between January and May labeled \"Season X.5\". Examples of this include the 2004 version of Battlestar Galactica, ABC's FlashForward and ABC Family's Make It or Break It. ===Episodes=== Newer broadcast television series are often ordered (funded) for just the first 10 to 13 episodes. This is done to see if there is audience interest. If a series is popular, the network places a \"back nine order\" and the season is completed to the regular 20 to 26 episodes. A series that is already popular will normally have a full-season order at the start of the season. A midseason replacement is a series of usually 10 to 13 episodes. They are used to take the place of an original series that was not \"picked up\" for a full season because it was not well liked by the audience. A \"series finale\" is the last episode of the series before the program is no longer produced. ===Schedule=== A standard television season in the United States runs from late September to May. During the summer months of June through mid-September, network broadcast reruns of their popular programs, new series that are not expected to have high ratings and other specials. Reality and game shows have also been used in this part of the schedule. ==India== In India, the programs are usually called serials. A series is usually at least 200 episodes, of 20 to 25 minutes each. On special episodes, referred to as Maha-Episodes, the episodes last up to about 45 to 50 minutes. The program is broadcast until the TRP (television rating point) is a little less than decent. The rating points depend on many things. Series which fail to attract TRP for a long time are usually ended. ==UK, Ireland and Australia usage== In the United Kingdom and other countries, these sets of episodes are called a \"series\". In Australia, the broadcasting may be different from North American usage. The terms series and season are both used and are the same. ===Australia=== Australian television does not follow \"seasons\" in the way that American television does. For example, there is no \"fall season\" or \"fall schedule\". For many years, popular night-time dramas in Australia would run for much of the year. They would only go into recess during the summer period. This is from December to February in Australia. During this time, ratings are not taken. Popular dramas would usually run from February through November each year. Many drama series, such as McLeod's Daughters, have between 22 and 32 episodes in each season. soap operas would usually begin a new season in late January. Their season finale would be in late November. The show would be off air for two months. Depending on the schedule this time off is sometimes longer. In recent years, a new season begins in early February. The season finale would broadcast in early December. Australian situation comedy series' seasons are about 13 episodes long. They begin any time between February and November. ===UK=== British shows have tended toward shorter series in recent years. For example, the first series of the science fiction programme Doctor Who in 1963 had forty-two 25‑minute episodes. It had a similar number each year until it was reduced to twenty-five for 1970. This was done because of changes in production. It also reduced the actors' workload. The revival of Doctor Who from 2005 has had thirteen 45‑minute episodes. There are some series in the United Kingdom that have a larger number of episodes. For example Waterloo Road started with 8 to 12 episodes. From series three onward, it increased to twenty episodes. Series seven will contain 30 episodes. ==References== Category:Television",
 "title": "Season (television)"
}