{
 "id": "93722",
 "text": "Shock Value is the second solo studio album by record producer Timbaland. It is his fifth album overall. The album has a long list of guest artists, including Fall Out Boy, Justin Timberlake, The Hives, Keri Hilson, Nelly Furtado, Missy Elliott, 50 Cent, Dr. Dre, OneRepublic, Elton John, Magoo and Nicole Scherzinger. ==Sales and certifications== The album debuted at number 5 on the U.S. Billboard 200, with 138,000 copies sold.Katie Hasty, April 11, 2007. 'NOW 24' Trumps Duff, McBride, Timbaland At No. 1 . Billboard. It debuted at number ten in the United Kingdom. On the week of July 22, it went to number five.The UK Top 40 Albums The album then reached number two in the UK and number thirteen in France. The album was certified Platinum in Canada (100,000 units) by the CRIA in August 2007.CRIAA. CRIA List of Gold and Platinum Certifications for August 2007 . CRIA. Accessed 10/10/2007. On the Australian ARIA Albums Chart, Shock Value was certified 3x Platinum with sales of 210,000+ copies. In BBC Radio 1's end of year chart for 2007, Shock Value was the ninth most bought album in the UK. ==Track listing== Notes * \"Oh Timbaland\" contains samples \"Sinner Man\" by Nina Simone. * \"Boardmeeting\" contains interpolations from \"Get Down on It\" by Kool & the Gang and replayed elements from \"The Breaks\" by Kurtis Blow. ==Shock Value 2008 Tour== The Shock Value 2008 Tour was supposed to be Timbaland's concert tour to support his album, Timbaland Presents: Shock Value. Dates in Australia and New Zealand were announced. However, the tour was canceled one day before it was going to begin due to scheduling conflicts in Europe. ===Tour dates (all canceled)=== Date City Venue August 15, 2008 Sydney, Australia Entertainment Centre August 16, 2008 Brisbane, Australia River Stage August 17, 2008 Adelaide, Australia Entertainment Centre August 20, 2008 Perth, Australia Challenge Stadium August 22, 2008 Melbourne, Australia Rod Laver Arena August 23, 2008 Auckland, New Zealand Vector Arena ==References== Category:2007 albums Category:Electropop albums Category:Hip hop albums Category:R&B; albums",
 "title": "Shock Value (Timbaland album)"
}