{
 "id": "937338",
 "text": "Sri Ramanandacharya was a poet, who was devoted to Vaishnavism.William Pinch (1996), Peasants and Monks in British India, University of California Press, , pages 53-89 Most Hindu people think that he started Ramanandi Sampradaya.Schomer and McLeod (1987), The Sants: Studies in a Devotional Tradition of India, Motilal Banarsidass, , pages 4-6 He was born in 1199 CE, and died some time from 1495 CE.Charlotte Vaudeville (1974), Kabir, Vol. 1, Oxford University Press, , pages 110-117Selva Raj and William Harman (2007), Dealing with Deities: The Ritual Vow in South Asia, State University of New York Press, , pages 165-185Nirmal Dass (2000), Songs of the Saints from the Adi Granth, State University of New York Press, , page 160-164 == Biography == Little is known with certainty about the life of Ramananda, including year of birth and deathEnzo Turbiani (Editor: RS McGregor, 1992), Devotional Literature in South Asia, Cambridge University Press, , page 51 The Encyclopaedia of Indian Literature give dates of 1366–1467 for his lifespan. His biography has been derived from mentions of him in secondary literature and inconsistent hagiographies. The most accepted version holds that Ramananda was born in a Kanyakubja Brahmin family, about mid 14th-century, and died about mid 15th-century.Charlotte Vaudeville (1974), Kabir, Vol. 1, Oxford University Press, , pages 110-117Selva Raj and William Harman (2007), Dealing with Deities: The Ritual Vow in South Asia, State University of New York Press, , pages 165-185Nirmal Dass (2000), Songs of the Saints from the Adi Granth, State University of New York Press, , page 160-164 Although few people hold him to be of southern origin, there's no evidence to support such a claim. In fact, all genuinely Indian sources agree in stating that Ramananda was born at Prayaga (Allahabad). > \"Not one word is said as to his southern origin, and the fact that he was > stated to be a Kanyakubja Brahmin is decisively against such a theory\" > –George A. Greirson (1920). According to the medieval era Bhaktamala text by Nabhadas, Ramananda studied under Raghavananda, a guru (teacher) in Vedanta-based Vatakalai (northern, Rama-avatar) school of Vaishnavism.Karen Pechelis (2014), The Embodiment of Bhakti, Oxford University Press, , page 36 > \"It was Ramananda's teacher, Raghavananda, who came from the South, and > after much wandering had settled at Benares. There, and not in the South, he > had Ramananda as his disciple.\" –George A. Greirson (1920). Other scholars state that Ramananda's education started in Adi Shankara's Advaita Vedanta school, before he met Raghavananda and began his studies in Ramanuja's Vishishtadvaita Vedanta school.Edmour J Babineau (2008), Love of God and Social Duty in the Rāmcaritmānas, Motilal Banarsidass, , pages 65-66 == References == Category:Hindu saints Category:14th-century births Category:Indian poets Category:14th-century writers",
 "title": "Ramananda"
}