{
 "id": "937360",
 "text": "The Topography of Terror (German: Topographie des Terrors) is a history museum in Berlin, Germany. It is both indoors and outdoors. More than one million people visit the museum each year. It is the most visited museum in Berlin. == History == === 1945-1990 === The buildings that were the headquarters of the SS and Gestapo were destroyed in 1945. For several decades, these buildings were somewhat forgotten. The location was a dump site. East Germany built the Berlin Wall in 1961 that went along the Niederkirchnerstrasse. The site was in East Germany and next to the wall. Dieter Hoffmann-Axthelm wrote about the importance of the site in 1978. However, the first exhibit on the destroyed buildings would only be in 1987. Excavators and researchers found a Gestapo prison cell, where prisoners had been tortured and killed. They decided to make a museum out of the site. They formed an exhibition in East Germany in 1989. After reunification, the city kept the part of the wall next to the site. === After Reunification === In 1992, further plans were to improve the site and create a building. There was an architectural competition, and Peter Zumthor won it. There was not enough money, so construction stopped. The city destroyed the structure and started a new building in 2004. The building design was by Ursula Wilms and the landscape by Heinz W. Hallmann. The building cost €20 million and took 2 years to build. The new museum opened in May of 2010. == Exhibitions == The museum shows the history of the Gestapo, SS, and Third Reich and their crimes. It includes the grounds of the former Main Office and headquarters of the Gestapo, SS and Reich Security. It is the central location where the Nazis planned most of their crimes including the Holocaust.Sander, A., Hesse, K., Kufeke, K., Sander, A., Hesse, K., Kufeke, K. (2010). Topography of Terror: Gestapo, SS and Reich Security Main Office on Wilhelm- and Prinz-Albrecht-Strasse ; a Documentation ; [catalogue to Accompany the Presentation of the Same Name in the Exhibition-hall, Niederkirchnerstarsse ... Berlin]. Germany: Stiftung Topographie des Terrors, p. 6 The Berlin Wall is also part of the museum. === Permanent exhibitions === ==== Indoor ==== The permanent indoor exhibition is \"Topography of Terror: Gestapo, SS and Reich Security Main Office on Wilhelm- and Prinz-Albrecht- Straße\". It contains photos, documents, videos, and audio about the institutions and their crimes. There are five parts to the exhibition. They include The National Socialist Takeover of Power (I); Institutions of Terror (SS and Police) (II); Terror, Persecution and Extermination on Reich Territory (III); SS and Reich Security Main Office in the Occupied Countries (IV); and The End of the War and the Postwar Era (V). There are maps of the layout of SS stations (Leitstellen) and the structure of the Concentration Camps. ==== Outdoor ==== The permanent exhibition outdoors is \"Berlin 1933–1945: Between Propaganda and Terror\". It tells how the National Socialists rose to power in Berlin and they changed the city. The main sections are Weimar Republic (I), Establishing the Führer's Dictatorship (II), Berlin and the \"People's Community\" (III), Wartime in Berlin 1939–1945 (IV); and Berlin and the Consequences of the Nazi Regime (V). There are documents, photos, and newspaper articles. Behind the glass, one can see ruins of buildings. Visitors can take live tours or audio tours of the museum's historic site. It includes 15 stations with photos, documents, and 3-D graphics and provides an overview of the grounds. === Special exhibitions === Special temporary exhibits have been on different topics. They are including German occupation and resistance, Kristallnacht, Nazi ghettos and concentration camps, trials of the Nazis, the press and propaganda, labor policy and laws, the people's court, different stages of the war, and the Nazi's rise to power. ==== People ==== There have been exhibitions on people including Albert Speer, Adolf Eichmann, Fritz Bauer, Martin Luther, and Hans Bayer. ==== People groups ==== There are several past exhibits for various people groups who suffered and died under the Nazis. Exhibitions included historians' research projects, historical documents, and archival photos. ==== Since 2010 ==== Below is a partial list of special exhibitions since 2010: * The Cold Eye. Final Pictures of Jewish Families from the Tarnów Ghetto. November 27, 2021, to April 18, 2022. The exhibition showed the work of two scholars who did a research project about East European Jews in 1941. They portrayed the family's stories and their deaths under the Nazis. * Between Shade and Darkness. The Fate of the Jews of Luxembourg between 1940 and 194515th July to October 13, 2020 * Germany 1945 – The Last Months of the War May 19, 2020 to September 27, 2020 * The Persecution of the Jews in Photographs. The Netherlands 1940–1945 October 30 2019 to March 12 2020 * Warsaw Rising 1944 July 30 to October 26, 2014, July 26 to October 15 2019 Exhibition about Polish resisting German occupation. * \"Aktion Reinhardt\" - They arrived at the Ghetto and went into the unknown July 4 to August 28, 2018 Exhibition about plan to muder Polish Jews. * Repressed Memory. How West Berlin Dealt with Sites of Nazi Perpetrators November 10 to 29, 2017 * Mass Shootings. The Holocaust from the Baltic to the Black Sea 1941–1944 September 28, 2016 to March 17, 2017 * Stumbling Stones – Remembrance and Social Sculpture November 15, 2016 to February 19, 2017 * March Formations. The Nazi Party Rally Grounds in Nuremberg April 13 to August 28, 2016 * The Face of the Ghetto. Photos Taken by Jewish Photographers in the Litzmannstadt Ghetto, 1940–1944 June 23 to October 3, 2010; January 13 to March 28, 2016 * Registered, Persecuted, Annihilated. The Sick and the Disabled under National Socialism March 26 to July 20, 2014 * ”Fire!” 75 Years after the Pogroms in November 1938 November 8, 2013 to March 2, 2014 * In memory of the children. Pediatricians and crimes against children in the Nazi period January 18 to May 20, 2012 * “In Plain Sight” – The Deportation of the Jews and the Auctioning of their Household Effects: Photographs from Lörrach, 1940 October 25, 2011 to January 8, 2012 * From the Sachsenburg to Sachsenhausen Pictures from the Photograph Album of a Concentration Camp Commandant October 20, 2010 – February 27, 2011 ==References== Category:Museums in Berlin",
 "title": "Topography of Terror"
}