{
 "id": "937671",
 "text": "On November 30, 2021, a gunman opened fire on students at Oxford High School (Michigan). The school is near Detroit, in Michigan. The gunman killed four people and injured six others. The shooter, Ethan Crumbley, was a 15-year-old sophomore student at the school. He was taken into custody. On October 24, 2022, Crumbley plead guilty to all of the charges put against him. On December 8, 2023, Ethan was sentenced to life imprisonment without the possibility of parole, plus 24 years. On April 9, 2024, Ethan's parents, James and Jennifer, were sentenced to 15 years in prison with the possibility of parole after 10 years. The shooting, along with the Michigan State University shooting, are the deadliest school shootings in the history of Michigan. == Incident == Once the shootings happened, the school was plunged into lockdown. Some students were evacuated to a nearby Meijer shop. At 12:55 PM, police arrived at the school after receiving at least 100 911 calls. The shooter was arrested unharmed, without putting up a fight. == Perpetrator == Ethan Robert Crumbley (born April 28, 2006) in Atlantic Beach, Florida, was identified as the shooter he was taken to the county's detention center and placed under suicide watch, At a young age he played first-run shooter games such as Call of Duty and enjoyed horror films. === Behavior before the shooting === In Crumbley's journal he detailed \"I want to shoot up my school so badly\". == Responses == U.S. Representative Rep. Elissa Slotkin, whose district includes Oxford High School, tweeted about the shooting, calling it a \"dark & painful day\" for the state. ==Notes== ==References== Category:2021 murders in the United States Category:2020s in Michigan Category:High school shootings in the United States Category:November 2021 events Category:2020s murders in the United States Category:2021 mass shootings Category:Attacks on buildings and structures in the 2020s Category:Mass murder in 2021 Category:Mass murder in the United States",
 "title": "Oxford High School shooting"
}