{
 "id": "937706",
 "text": "The 2023 FIA Formula One World Championship is a planned motor racing championship for Formula One cars. This will be the 74th running of the Formula One World Championship. Drivers and teams are scheduled to compete for the titles of World Drivers' Champion and World Constructors' Champion, respectively. The season was dominated by defending champion Max Verstappen, who cruised to his third consecutive Drivers' Championship title at the Qatar Grand Prix, winning a record 19 out of 22 Grands Prix held and finishing on the podium 21 times (also a record number for most podiums in a season) by the end of the championship. His team, Red Bull Racing achieved their sixth Constructors' Championship title, the second consecutively, at the preceding Japanese Grand Prix. Red Bull Racing won 21 out of 22 Grands Prix, breaking the team record for highest percentage of Grand Prix wins in a season at 95.45%, beating McLaren's 1988 season. Verstappen also broke the record for the highest Grand Prix win percentage for drivers, with a win rate percentage of 86.36%, beating the previous record set by Alberto Ascari in 1952. == Entries == The following constructors and drivers are under contract to compete in the 2023 World Championship. All teams are due to compete with tyres supplied by Pirelli. Entrant Constructor Chassis Power unit Race drivers No. Driver name Alfa Romeo F1 Team Stake Alfa Romeo-Ferrari C43 Ferrari 24 Zhou Guanyu 77 Valtteri Bottas Scuderia AlphaTauri AlphaTauri-Honda RBPT AT04 3 Daniel Ricciardo 21 Nyck de Vries 22 Yuki Tsunoda 40 Liam Lawson BWT Alpine F1 Team Alpine-Renault A523 31 Esteban Ocon 10 Pierre Gasly Aston Martin Aramco Cognizant F1 Team AMR23 Mercedes 14 Fernando Alonso Aston Martin Aramco Cognizant F1 Team 18 Lance Stroll Scuderia Ferrari Ferrari SF-23 Ferrari 16 Charles Leclerc Scuderia Ferrari 55 Carlos Sainz Jr. MoneyGram Haas F1 Team Haas-Ferrari VF-23 Ferrari 20 Kevin Magnussen 27 Nico Hülkenberg McLaren F1 Team McLaren-Mercedes MCL60 Mercedes 4 Lando Norris 81 Oscar Piastri Mercedes F1 W14 Mercedes 44 Lewis Hamilton 63 George Russell Oracle Red Bull Racing -Honda RBPT RB19 1 Max Verstappen 11 Sergio Pérez Williams Racing Williams- Mercedes FW45 Mercedes 2 Logan Sargeant 23 Alex Albon Source: Honda returned as a named engine supplier to Red Bull Racing and AlphaTauri, with both teams' engines badged as Honda RBPT While Red Bull Powertrains had planned to take over assembly and maintenance of the engines from this season onwards, it was later agreed that Honda would continue its technical support of Red Bull Racing and AlphaTauri until the end of 2025. ===Driver changes=== Sebastian Vettel retired at the end of the 2022 championship ending his Formula One career after 16 seasons. His place at Aston Martin was taken by Fernando Alonso, who left Alpine after two seasons. His replacement was initially announced as the 2021 Formula 2 Champion and reserve driver Oscar Piastri. Shortly after the announcement, Piastri stated that he had not signed a contract for 2023 and that he would not be driving for Alpine. Pierre Gasly, who had a contract to drive for AlphaTauri, moved to Alpine, replacing Alonso. Gasly was replaced by the 2020–21 Formula E and 2019 Formula 2 Champion Nyck de Vries. Daniel Ricciardo left McLaren after two seasons. He had a contract to drive for the team in 2023, but it was terminated during the 2022 championship by mutual agreement. Ricciardo's seat was filled by Piastri, who made his Formula One debut. Ricciardo then proceeded to become a reserve driver for Red Bull. Nicholas Latifi left Williams after spending three seasons with the team. His seat was filled by Logan Sargeant, who made his Formula One debut by graduating from Formula 2 and became the first American Formula One driver to compete since Alexander Rossi in 2015 with former team Marussia and the first to compete full-time since Scott Speed in 2006 with former team Toro Rosso. Mick Schumacher is left Haas after two seasons. His seat was filled by Nico Hülkenberg who last competed in Formula One as a full- time race driver in 2022 with former team Aston Martin. ====Mid-season changes==== Nyck de Vries was relieved of his driving duties for AlphaTauri after underperforming in the first ten races of his rookie season. His seat will be filled by Daniel Ricciardo from the Hungarian Grand Prix. Ricciardo had raced with the team, which at the time was called Toro Rosso, in the 2012 and 2013 seasons. However, during the Dutch Grand Prix, only his third race of the season, Ricciardo broke a metacarpal bone in his left hand in a crash during the second practice session. As a result, Red Bull Racing and AlphaTauri's reserve driver Liam Lawson made his Formula One debut at the race. Lawson continued to substitute in for Ricciardo at the Italian, Singapore, Japanese and Qatar Grand Prix Ricciardo is set to return for the Unites States. == Calendar == The 2023 calendar was due to feature twenty- three Grands Prix, but will have twenty-two instead because the Emilia Romagna Grand Prix being called off due to severe weather issues. Round Grand Prix Circuit Race date 1 Bahrain Grand Prix Bahrain International Circuit, Sakhir 5 March 2 Saudi Arabian Grand Prix Jeddah Corniche Circuit, Jeddah 19 March 3 Australian Grand Prix Albert Park Circuit, Melbourne 2 April 4 Azerbaijan Grand Prix Baku City Circuit, Baku 30 April 5 Miami Grand Prix 7 May 6 Monaco Grand Prix Circuit de Monaco, Monaco 28 May 7 Spanish Grand Prix Circuit de Barcelona-Catalunya, Montmeló 4 June 8 Canadian Grand Prix Circuit Gilles Villeneuve, Montréal 18 June 9 Austrian Grand Prix Red Bull Ring, Spielberg 2 July 10 British Grand Prix Silverstone Circuit, Silverstone 9 July 11 Hungarian Grand Prix Hungaroring, Mogyoród 23 July 12 Belgian Grand Prix Circuit de Spa-Francorchamps, Stavelot 30 July 13 Dutch Grand Prix Circuit Zandvoort, Zandvoort 27 August 14 Italian Grand Prix Monza Circuit, Monza 3 September 15 Singapore Grand Prix Marina Bay Street Circuit, Singapore 16 Japanese Grand Prix Suzuka International Racing Course, Suzuka 24 September 17 Qatar Grand Prix Lusail International Circuit, Lusail 8 October 18 United States Grand Prix Circuit of the Americas, Austin, Texas 22 October 19 Mexico City Grand Prix Autódromo Hermanos Rodríguez, Mexico City 29 October 20 São Paulo Grand Prix Interlagos Circuit, São Paulo 5 November 21 Las Vegas Grand Prix Las Vegas Street Circuit, Las Vegas 22 Abu Dhabi Grand Prix Yas Marina Circuit, Abu Dhabi 26 November === Calendar expansion and changes === The Chinese and Qatar Grands Prix are scheduled to return to the calendar, after last being held in and , respectively. The Qatar Grand Prix, along with the Saudi Arabian Grand Prix, were initially planned to be moved to new, purpose- built circuits, before being retained in Lusail and Jeddah, respectively. The Las Vegas Grand Prix is due to make its debut, with the race planned to be held in November on a new street track across the Las Vegas Strip. It will be the first Grand Prix which will be held in Las Vegas since the season with the Caesars Palace Grand Prix and the third race in the calendar to be held in the United States for the first time since the same season. The Russian Grand Prix was under contract to feature on the 2023 calendar. It was originally meant to switch its venue from the Sochi Autodrom to Igora Drive, located on the outskirts of Saint Petersburg. However, the Grand Prix had its contract terminated in response to the 2022 Russian invasion of Ukraine. The French Grand Prix will not feature on the 2023 calendar although the promoters of the Grand Prix stated that they would aim for a rotational race deal by sharing its slot with other Grands Prix. The Grand Prix will return in 2025 at the Circuit de la Sarthe, Le Mans in 11-years contract. The Chinese Grand Prix was initially due to be part of the calendar after last being held in , but it was cancelled for the fourth consecutive year due to the ongoing difficulties presented by the COVID-19 pandemic in the country. The Grand Prix will not be replaced and is expected to return for the 2024 season. The Emilia Romagna Grand Prix, which was scheduled to take place on 21 May as the sixth round of the championship, was cancelled on 17 May due to flooding in the area. == List of planned races == The following 19 Grands Prix are contracted to form a part of the 2023 World Championship: Grand Prix Circuit Ref. Abu Dhabi Grand Prix Yas Marina Circuit, Abu Dhabi Azerbaijan Grand Prix Baku City Circuit, Baku Bahrain Grand Prix Bahrain International Circuit, Sakhir Belgian Grand Prix Circuit de Spa-Francorchamps, Stavelot British Grand Prix Silverstone Circuit, Silverstone Canadian Grand Prix Circuit Gilles Villeneuve, Montréal Dutch Grand Prix Circuit Zandvoort, Zandvoort Emilia Romagna Grand Prix Imola Circuit, Imola Hungarian Grand Prix Hungaroring, Mogyoród or TBA, Debrecen Italian Grand Prix Monza Circuit, Monza Japanese Grand Prix Suzuka International Racing Course, Suzuka Las Vegas Grand Prix Las Vegas Street Circuit, Las Vegas, Nevada Miami Grand Prix Miami International Autodrome, Miami Gardens, Florida Qatar Grand Prix TBC Saudi Arabian Grand Prix TBC São Paulo Grand Prix Interlagos Circuit, São Paulo Singapore Grand Prix Marina Bay Street Circuit, Singapore Spanish Grand Prix Circuit de Barcelona- Catalunya, Montmeló United States Grand Prix Circuit of the Americas, Austin, Texas The following 3 Grands Prix are under contract to run in 2022, but do not have a contract for 2023: Grand Prix Circuit Ref. Austrian Grand Prix Red Bull Ring, Spielberg Mexico City Grand Prix Autódromo Hermanos Rodríguez, Mexico City Monaco Grand Prix Circuit de Monaco, Monaco === Calendar expansion and changes === * In late March of 2022, the Las Vegas Grand Prix was officially announced. This third race in the US, planned to be held in November, will be staged on a new street track across the Las Vegas Strip. * The Qatar Grands Prix are scheduled to return to the calendar, after last being held in 2021, respectively. * The Russian Grand Prix was under contract to feature on the 2023 calendar. It was originally meant to switch its venue from the Sochi Autodrom to Igora Drive, located on the outskirts of Saint Petersburg. However, the Grand Prix had its contract terminated in response to the 2022 Russian invasion of Ukraine. * The Chinese Grand Prix was under contract to feature on the 2023 calendar. It was originally meant to change the layout venue of turn 9 from the Shanghai International Circuit, but was not included due to Chinese travel restrictions related to the Zero-COVID. The Grand Prix is due to return in the 2024 championship. * For the first time since 2007, Bahrain will not host the opening round by Bahrain Motor Federation for numbers of reasons. However, Abu Dhabi will not host the closing rounds by mutual agreement. * The French Grand Prix will not feature on the 2023 calendar although the promoters of the Grand Prix stated that they would aim for a rotational race deal by sharing its slot with other Grands Prix. The Grand Prix will return in 2025 at the Circuit de la Sarthe, Le Mans in 11-years contract. == Notes == ==References== ==Other websites== * Category:2023 in sports Category:Formula One seasons",
 "title": "2023 Formula One World Championship"
}