{
 "id": "937775",
 "text": "José Ribamar de Oliveira, best known as Canhoteiro (24 September 1932 - 16 August 1974) was a Brazilian footballer, He was 168 centimeters tall. He was a very fast left winger with excellent technique. He was quick and particularly good at dribbling. He scored many goals. He is widely regarded as one of the greatest players in the history of São Paulo. He is considered to be one of the best dribblers ever. It was said that what Garrincha did on the right wing, Canhoteiro did on the left wing. They joined the national team at the same time and played together sometimes. Equal on opposite sides of the pitch, they both interpreted football in a cheerful and playful way. He is recognized by many as one of the finest left-wingers of all time. His nickname was \"The Garrincha of the left\". ==Early days== Canhoteiro was born in the city of Coruata on September 24, 1932. There, his father Cecilio kept a tent where he sold corn porridge and tapioca to workers. Canhoteiro spent his childhood there. Against the wishes of his father he did not particularly bother himself with studying and reading books. Cecilio was very afraid that he would spend his life just like himself, selling porridge. Later, he began playing football, playing for the youth team Moto Club da San Luis. At the same time, he got his first job. Thanks to his friendship with market traders, while he was still a very young man, he began working as a truck driver for short distances. He then played for the amateur club Paysandu de San Luis. ==Club career== At the beginning of 1949, the president of the America club from the city of Fortaleza, Livio Correia Amaro, managed to convince Cecilio that his son should join this team to play football professionally. He immediately began to stand out for his game. He even played for the national team of the state of Ceara. In April 1954, Canhoteiro moved to São Paulo, who paid 100,000 cruzeiro for the transfer. He made his debut for the team on 8 April against Corinthians, where he beat the club's defender, Idario, 14 times. At the club, Canhoteiro replaced Teixerinho. On April 18, he scored his first goal for the club, hitting the Linense goal. The following year, he helped the team win the Small World Cup. Two years later they won the Sao Paulo State Championship. In 1960, he was part of the São Paulo team that played the first game at the newly built Morumbi Stadium with Montevideo 's Nacional;. The national team beat the Uruguayan team with a score of 3:0, and Canhoteiro scored one of the goals. In the same year he suffered a very serious knee injury by the Corinthians player Homero Oppi. He recovered from the injury, but he could no longer show his former level. In total, for Sao Paulo, he played 415 games (230 wins, 95 draws and 90 losses) In 338 matches he was in the starting lineup. He scored 105 goals. In 1963, Cañoteiro left for Mexico, to the Nacional club. There he played until 1965. Then he spent two seasons in Toluca, where he scored 7 goals. Then the player returned to Brazil, signing a contract with Nacional\". He later played for Saad and Araras. ==International career== In the national team of Brazil, Canhoteiro made his debut on November 17, 1955 in a 3-3 draw against the Paraguayan national team. This was for the Copa Oswaldo Cruz. It was successful as Canhoteiro in 6 minutes scored his first and only goal. In 1956, Canhoteiro participated in the Copa América, where Brazil finished fourth. At that tournament he played in four matches against Chile, Peru, Argentina and Uruguay. Canhoteiro also participated in the 1957 Copa América where Brazil ended up as runners-up but he only played once. In 1958 he was close to going to the World Cup, but he was left off after losing a place to Mário Zagallo and Pepe. The last time he played for the national team was on September 20, 1959 in a 1-0 win against Chile's national team for the Copa O'Higgins. In total, he appeared 19 times for the Brazilian national team and scored 1 goal. ==Life after football and death== After his career as a football player, Canhoteiro could not find himself in life for a long time. He started using drugs and alcohol. Thanks to friends, he was able to get a job at the State Bank of São Paulo, where he worked in a local restaurant and he was always smiling. On August 13, 1974, after eating feijoada and washing it down with caipirinha and beer, he began to complain of a severe headache. Before going to work in a restaurant, Canhoteiro went to his friends where he fainted. He was taken to the hospital after being diagnosed with a stroke. Three days later he died on August 16, at the age of 41 and his funeral was held days later. ==International career statistics== |- |1955||1||1 |- |1956||11||0 |- |1957||2||0 |- |1958||2||0 |- |1959||3||0 |- !Total||19||1 |} ==Honours== São Paulo *Small World Cup: 1955 *São Paulo State: 1957 Brazil *Taça Oswaldo Cruz: 1955, 1956, 1958 *Taça do Atlântico: 1956 *South American Championship fourth place: 1956 *South American Championship runners-up: 1957, 1959 *O'Higgins Cup: 1955, 1957, 1959 Individual *L'Équipe's top 50 South-American footballers in history: #29 *Brazilian Football Museum Hall of Fame *IFFHS Brazilian Player of the 20th Century (30th place)IFFHS' Century Elections *IFFHS South American Player of the 20th Century (37th place) *The Best of The Best – Player of the Century: Top 50\"The Best of The Best\" Retrieved on 18 November 2015 *Rio-São Paulo Tournament Best Player: 1962 == References == Category:1932 births Category:1974 deaths Category:Deaths from stroke Category:Disease-related deaths in Brazil Category:Footballers from Maranhão",
 "title": "Canhoteiro"
}