{
 "id": "937812",
 "text": "The Gedenkstätte Berliner Mauer (Berlin Wall Memorial) is a monument to remember the Berlin Wall. It is also to remember those who died trying to cross the wall. Over one million people visit the site each year. It is one of the most popular sites in Berlin. == History == The German Historical Museum proposed to have a memorial. Kohlhoff & Kohlhoff designed the memorial. The German government and the city of Berlin created the monument in 1998. The final memorial site opened in 2008. An extension was added in 2013. == Description == There is a Chapel of Reconciliation, visitor center, documentation center, a 60-meter section of the Berlin Wall and a window of remembrance. The memorial has four areas. They are The wall and the Todesstreifen (death strip), Destruction of the city, Building of the wall and \"Es geschah an der Mauer\" (It happened at the wall). === Memorial === The memorial itself includes a preserved part of the Berlin wall structure. This includes a strip of land that is enclosed by two walls. There is also a watch tower just like one when Berlin was divided. The inscription on the memorial is: In memory of the divided city and the victims of communist tyranny. Visitors cannot access the memorial and it is enclosed, but one can see it from the Documentation Center. === Documentation Center === The Documentation Center holds a permanent exhibition called “1961 | 1989. The Berlin Wall.” It presents the history of the wall. The center is located across the street from the memorial on Bernauer Straße. === Window of Remembrance === The Window of Rememberance remembers the 132 people who died trying to cross the wall. It includes names and pictures of people who died. === Chapel of Reconciliation === The Chapel of Reconciliation structure is the site of a church that was along the wall. The wall separated the churchgoers of the Protestant Reconciliation Parish from the church building. The building symbolized the divide of Germany. West Germany destroyed the building in 1985 but kept the altarpiece and bells. There is a new chapel building with services. ==References== Category:Buildings and structures in Berlin",
 "title": "Gedenkstätte Berliner Mauer"
}