{
 "id": "937818",
 "text": "The Murder of Bruno Pereira and Dom Phillips took place in Brazil. On June 5, 2022, Brazilian indigenous expert Bruno Araújo Pereira and British journalist Dom Phillips disappeared during a trip to Vale do Javari. It is the second largest indigenous land in Brazil, at the western end of the Amazon River. Two brothers were arrested and suspected of involvement in the disappearances. A few days later, one of them confessed that he had killed them. He told the police where he had buried the bodies. He also told them where the boat that the men were using sank. The police found human remains at the location. The forensic examination was completed on June 17. It confirmed that one of the bodies found was that of Phillips. == Murders == The two men traveled to Lago do Jaburu and were to continue their journey to the community of São Rafael. They were to have a meeting with a local fisherman. The crime occurred on the road between São Rafael and the municipality of Atalaia do Norte. The case had wide repercussions in the Brazilian and international media, and mobilized societies and trade associations. == Investigation == On June 5, the Union of Indigenous Organizations of the Javari Valley (Univaja) organized two search teams that left Atalaia do Norte and Tabatinga. However without success, the entity released a note on its social networks denouncing the disappearance and asking for efforts in the search. For its part, the Federal Police announced that it was investigating the event, but gave no further details. On June 7, the Military Police searched the residence of Amarildo da Costa de Oliveira, known as \"Pelado\", after receiving an anonymous tip about his supposed participation in a disappearance. He was arrested for possession of drugs and ammunition of restricted use. At the time, the police seized the suspect's speedboat, where traces of blood were found and sent for analysis. On 12 June, the firefighters' team in Atalaia do Norte found a backpack, a laptop and a pair of sandals near Amarildo's house. The following day, Dom Phillips' family was wrongly informed by the Brazilian Embassy in the United Kingdom that the bodies had been found. On June 15, Amarildo confessed his participation in the crime and indicated to the authorities where he had buried the bodies, as well as the place where Bruno and Dom's boat sank. The Federal Police found human remains at the indicated location and did not rule out further arrests. The day before the confession, Amarildo's brother, Oseney da Costa de Oliveira, was arrested. On June 18, police arrested a third suspect in the killings, Jefferson da Silva Lima. ==Funerals== Pereira's funeral was held on June 24 in Recife, Pernambuco and Phillips's funeral was held on June 26 in Nitéroi, Rio de Janeiro. The bodies of both men were cremated. As of June 27, the police continue to investigate to determine all those responsible for ordering and carrying out the murders. ==References== Category:2022 in Brazil Category:Crime in South America Category:Murder in 2022",
 "title": "Murder of Bruno Pereira and Dom Phillips"
}