{
 "id": "937822",
 "text": "La Voz Argentina is a talent show broadcast by Telefe. It is the local adaptation of the international singing contest franchise The Voice that was created by the Dutch television producer John de Mol and had adaptations in various countries around the world. The program is produced by Telefe and the British company ITV Studios. ==Seasons== Telefe has produced four editions of the program. ===Season 1=== The first season of the program premiered on Sunday, July 1, 2012. It ended on December 2, 2012 with Gustavo Corvalán, from the Soledad team, as the winner. ===Season 2=== The second season premiered in October 2018 and ended in December of the same year with Braulio Assanelli, from the team of Venezuelan Ricardo Montaner, as the winner. ===Season 3=== In 2020, the third season was announced, which finally premiered on June 24, 2021 and ended on September 5, 2021, with Francisco Benítez, from the Soledad team, as the winner. ===Season 4=== In 2022, Telefe announced the production of a fourth season that premiered on June 5 of the same year. ==Format== La Voz finds the best voice in Argentina (although people from other countries can participate). To do this they must go through a series of stages that go from blind auditions to live shows, these have been changing or varying their dynamics throughout the seasons. ===Blind auditions=== In this first stage, the coaches have their backs to the participants and are guided only by their voice. ====Acceptance==== If the voice of the participant pleases the coaches, they will press the button (\"I want your voice\") that will turn their chair in front of them, to finally meet him/her and show that the participant has been selected. If more than one coach presses the button, the participant will have the option to decide with which of the coaches he/she wants in this competition. If only one coach presses the button, the participant automatically goes to his team. ====Failure==== If none of the coaches presses the button, it means that the participant is eliminated. ===Battles=== In the battles, each coach groups the members of his team into pairs, so that they face each other in a ring and sing the same song, thus showing their best vocal and artistic skills. At the end of each performance, only one of them advances to the next round. Beginning with the third season, at this stage each coach receives the opportunity for the «Stole», two in total, which allow them to save and incorporate into their teams contestants eliminated by other coaches during this round. In each season, each coach receives the help of invited mentors, who help him advise his participants to show off and perform well, providing their point of view to make the best decision for the team. ===Sing-Offs=== This stage was only included in the first season. During this, the nine participants who survived the battles will face a new elimination. Each coach will select their six best artists, who will qualify directly to the Live Shows. The remaining three will duel, singing the song that made them qualify for the \"blind auditions\". Two of them will be saved by their coach and will qualify for the next stage, so that each team will have one eliminated and eight artists who qualify. ===Knockouts=== This stage was added from the second season. During this round, a pair of contestants from the same team are selected to perform at the same time, but unlike battles, each contestant sings a song. At the end of both presentations, each coach selects one of them to advance to the next round. In this phase, each coach can steal participants who have lost in their Knockout, in the second edition there were two \"steals\" per coach and in the third only one. ===Playoffs=== In the Playoffs, participants perform in team rounds to once again prove their talent. ====Season 2==== In the second season, each coach had to save 2 participants (of the 8 in total), while the others went to vote by phone, SMS and/or digital platform, so that the public could save 2 more in this way. In this playoff, the coach is left with 4 participants. ====Season 3==== In the third edition the rules were changed, there was no telephone and/or digital platform vote, each coach saved 6 participants (of the 8 in total) and the remaining two were directly eliminated. ===Live shows=== In this last phase, each participant presents himself to the public (however, it is not broadcast live), showing musical performance in order to get more votes from the audience. Not only solo songs will be presented, but each participant will perform a duet with her coach or together with the other participants. One of the four finalists will be chosen as the winner. ===La Voz: «El Regreso» (The Return)=== In the third season, the program added a new competition phase already presented in other editions around the world called \"El Regreso\" which is exclusive to telefe.com and its digital platforms. Contestants who failed to turn a chair in the blind auditions and who have been eliminated in the battles and knockouts, have the opportunity to be selected by the fifth coach Emilia Mernes to face each other in different rounds and make it back to the competition. major. == Coaches timeline == Coach Seasons 1 2 3 4 Soledad Axel colspan=\"3\" Miranda! colspan=\"3\" Puma colspan=\"3\" Montaner colspan=\"1\" Tini colspan=\"1\" colspan=\"2\" Lali colspan=\"2\" Mau y Ricky colspan=\"2\" Emilia colspan=\"2\" MYA colspan=\"3\" File:Ricardo-Montaner.jpg|Ricardo Montaner (2018–present) File:Soledad_(2018).jpg|Soledad Pastorutti (2012–present) File:Lalii en 2017.png|Lali Esposito (2021–present) File:Mau & Ricky Final.jpg|Mau y Ricky (2021–present) File:MYA en 2021.jpg| MYA (Comeback Stage, 2022–present) ==References== Category:Telefe Category:Argentine reality television series",
 "title": "La Voz Argentina"
}