{
 "id": "937894",
 "text": "BBVA (previously known as Banco Francés and BBVA Francés) is an Argentine banking subsidiary. Since its inception, it has provided a wide range of banking, financial and non-financial services, both to individuals and corporate entities throughout the Argentine territory. Since 1996, it has been part of the BBVA Group, its main shareholder since then. In 2019, BBVA unifies its brand worldwide and BBVA Francés was renamed BBVA. ==History== It was founded as Banco Francés del Río de la Plata on 14 October 1886, in a historical period in Argentina where a large number of entities of its type emerged, many of which would quickly disappear due to the Panic of 1890. In 1888, the shares of the Banco Francés, which are still on the market, began to be listed on the Buenos Aires Stock Exchange. In 1926, the new headquarters of the entity was inaugurated, on the corner of Bartolomé Miter and Reconquista streets, in the heart of the financial city of Buenos Aires. In 1959, she was one of the winners of the first loan that Eximbank made to Argentina. In 1968, the Morgan Guaranty Trust Company of New York acquired 50% of the shares, and began a process of strengthening and expanding the Banco Francés in the field of wholesale banking. ===1970s=== During the 1970s, the Compañía de Seguros Sud América reconverted its real estate assets into Banco Francés shares, in a procedure led by a new board of directors highly influenced by Luis María Otero Monsegur. In this way, South America acquired a large number of shares of the Bank. In 1975, Morgan Guaranty landed in Argentina, and therefore sold its share to two Argentine companies: Sud América Seguros de Vida and Alpargatas. From that moment the Banco Francés began to adopt other functions, such as retail banking. ===1980s=== In the first half of the 1980s, the number of branches of the Banco Francés doubled in three years, managing to also cover loans to medium-sized companies, while consolidating the retail branch. Between 1986 and 1989, the Banco Francés had a joint venture with the Bankers Trust Company, developing investment banking. In 1988, 22 branches of the Banco Español/Banco Comercial del Norte were acquired, and that same July the offshore branch began operations in the Cayman Islands: the Banco Francés del Río de la Plata (Cayman) Ltd. ===1990s=== In 1991 Alpargatas sold its share to Sud América Inversiones and Eduardo F. Constantini. At the same time, more branches were acquired from Banco Santander and Chase Manhattan Bank, reaching 62 of them. In December 1996, Banco Bilbao Vizcaya (currently Banco Bilbao Vizcaya Argentaria) acquired 99.90% of the shares of Otar S.R.L., from Otero Monsegur y Areco, majority shareholder of Sud América Inversiones, holder, in turn, of the 30.04% of the capital of Banco Francés. The operation was carried out at 375 million dollars. In August 1997, the Bank acquired 71.75% of Banco de Crédito Argentino, with which it merged, strengthening itself with the absorption of the competitor entity. ===Since the 2000s=== As of March 2006, BBVA Banco Francés had 232 retail branches throughout the country and 27 branches specializing in small and medium-sized businesses. In 2012, it became the main sponsor of the two most successful football clubs in Argentina, sporting the \"BBVA\" or \"BBVA Francés\" logo on the front of their shirts, starting in January at Club Atlético Boca Juniors and since July at Club Atlético River Plate. Since 2015 it has also sponsored \"Talleres de Córdoba\". ==References== Category:1886 establishments Category:1880s establishments in Argentina Category:Companies based in Buenos Aires Category:Banks of Argentina Category:BBVA",
 "title": "BBVA Argentina"
}