{
 "id": "938099",
 "text": "Geranium is a group of flowering plants. It is a genus with 422 species. Geranium flowers have five petals. The flowers can be coloured white, pink, purple or blue. Geraniums will grow in any soil that is not too wet. Geraniums can be annual, biennial, or perennial plants. These plants are often called cranesbills. They are found in temperate areas of the world and the mountains of the tropics, but mostly in the eastern part of the Mediterranean region. Some caterpillars eat geraniums. Several species of Geranium are gynodioecious.Hessing, M.B. 1989. Variation in self-fertility and floral characters of Geranium caespitosum (Geraniaceae) along an elevational gradient. Plant Systematics and Evolution 166:225-241.Van Etten and Chang 2014. Frequency-dependent pollinator discrimination acts against female plants in the gynodioecious Geranium maculatum Annals of Botany 114:1769–1778 Gynodioecy is a rare breeding system where female and hermaphroditic plants coexist in a population. The species Geranium viscosissimum (sticky geranium) seems on the way to becoming carnivorous. Sometimes members of the genus Pelargonium are also called geraniums. Pelargonium species are also grown as garden plants. Sometimes members of the Geranium genus are called \"hardy geraniums\", to tell them apart from Pelargonium. == Gallery == File:Wild Geranium (Geranium maculatum).jpg| Geranium maculatum File:Illustration Geranium phaeum0.jpg|Geranium phaeum - from Thomé Flora von Deutschland, Österreich und der Schweiz 1885 File:geranium_platypetalum1.jpg|Geranium platypetalum File:Geranium_sanguineum0.jpg|Geranium sanguineum File:Geranium pratense (Meadow Cranesbill).jpg|Geranium pratense (meadow cranesbill) File:Geranium-robertianum(Samen).jpg|Geranium robertianum (herb robert) File:GeraniumMaderense.jpg|Geranium maderense File:wildgeranium.jpg|Geranium maculatum File:Geranium_sanguineum02.jpg|Geranium sanguineum == References == == Other websites == * ITIS list of Geranium species * Geranium Taxonomic Information System * Preparing Geraniums for Winter Category:Rosids",
 "title": "Geranium"
}