{
 "id": "938139",
 "text": "A serial killer is defined as a person who kills three or more people, in three or more separate events over a period of time. There are gaps of time in between the killings, which may comprise of a few hours up to many years. This list shows serial killers in order of how many victims they had. In many cases, the exact number of victims assigned to a serial killer is not exactly known, and even if that person is convicted of a few, there can be the possibility that he/she killed many more. The second column in the table states the number of victims that were definitely assigned to that particular serial killer. The third column states the number of other possible victims that the killer could also have murdered. Some of these crimes are yet to be solved, but have been included because they are notorious or clearly the work of a serial killer, despite nobody being caught. Name Country Proven Victims (either in court, by detailed confession, or according to most scholars) Possible Victims Notes Thug Behram India 0 931 from 1790 to 1830 - He confessed to 125 murders, and reported being present at 931. Erzsébet Báthory Hungary 100-200 200-600 born 1560, died 1614, accused of murdering 600 or so people, but there was no public trial. Luis Garavito Colombia 193 200-300+ Targeted young boys, arrested in 1999 Pedro Lopez Colombia 110 300 Targeted girls, arrested in 1980 Dr. Harold Shipman United Kingdom 15-215 250+ Targeted his hospital patients, many of whom were elderly women. Caught when Kathleen Grundy died suddenly in his care, and her will had suddenly been amended so it would benefit him and no-one else. Killed his patients with lethal injections of diamorphine, before altering their medical records to make it look as if they were of poor health. Henry Lee Lucas United States 11 2-200 born 1936, died 2001. Confessed to about 3,000 murders, convicted of 11 of which at least some were highly dubious Gilles de Rais France 140 140+ Testimony gained under torture and confession under threat of torture, as was customary. John Wesley Hardin USA 10 3 {?} from 1868 to 1877 - He claimed in a posthumous autobiography to have committed 44 killings. William P. Longley USA 7 0 from 1868 to 1877 - He claimed in a posthumous autobiography to have committed 32 killings. H. H. Holmes USA 1 9 Confessed to 27 murders, though some of his \"victims\" were still alive. Estimates vary wildly. Johann Hoch USA 1 15 {?) Active from either 1888/1891 to 1904. Hanged for 1 murder in Chicago Feb 23, 1906. Estimates vary wildly. Billy Gohl USA 2 ?? Alleged to have committed 40 murders. In 1913 convicted of 2 murders {1 and 2 Estimates vary wildly. Carl Panzram USA 4 3 from 1920 to 1928 - He claimed in a posthumous autobiography to have committed over 22 killings. Hu Wanlin China 196 196 Sentenced to 15 years on 1st October 2000. Dr John Bodkin Adams United Kingdom 0 163+ Controversially acquitted of one murder in 1957 but pathologist Francis Camps suspected him of 163 murders between 1946 and his arrest in 1956.[1] Randy Steven Kraft USA 16 67-100 Convicted on 15 counts of murder, left a cryptic list of 65 murders. May have had an accomplice. Ted Bundy USA 30-36 100+ Estimated that he may have killed more than 100. John S. Williams USA 11 7+ 1921 trial -found guilty. Alleged to have been only white man convicted for killing black peons between 1866 and 1966. Andrei Chikatilo USSR/Russia 53 56 Convicted of the murder of fifty-two women and children between 1978 and 1990. 3 people were previously convicted & executed for his crimes Anatoly Onoprienko Ukraine 52 52+ Convicted of the murders of nine people in 1989, and 43 people in 1995-1996. Traveled through Europe illegally from 1990-1995, whether he killed during this time is unknown. Zodiac Killer USA 5 37 Targeted young couples, was never apprehended Moninder Singh Pandher India 0 30+ Investigation currently underway after 15 partial skeletal remains were discovered in December 29, believed to have raped and killed at least 30, mostly children Gary Leon Ridgway USA 49 71-90 Truck painter who confessed to killing 48 women (mostly prostitutes), and dumping many of them along the Green River, near Seattle, Washington. Belle Gunness USA 40 40+ Of La Porte, Indiana and possibly Los Angeles, California Charles Cullen USA 29 400+ Nurse in New Jersey and Pennsylvania who murdered 40 patients between 1988 and 2003. John Wayne Gacy USA 33 45+ The 'Killer Clown' who kept bodies buried under his Chicago home Joseph Paul Franklin USA 8 20 Confessed to 20 murders and several attempted murders, awaiting trial for most of these crimes Jeffrey Dahmer USA 17 17 Dahmer ate some of them; he kept body parts in his freezer Dennis Nilsen United Kingdom 15 15 Picked up young men in London between 1978 and 1982 and dismembered them, keeping various body parts around his home. Herbert Mullin United States 13 13 Despite detailed confessions, prosecutors decided not to try him for the first three crimes, instead focusing on crimes that conflicted with his insanity plea. Kaspars Petrovs Latvia 13 38+ Confessed to strangling 38 elderly residents of Riga, Latvia in 2003. Convicted and sentenced to life imprisonment for the robbery and murder of 13. Fred West and Rosemary West United Kingdom 12 12+ Mainly targeted young females but was also found guilty of the murder of their own daughter. Also found guilty of raping another daughter. Buried the victims around their house and local area. Fred West said there were more victims, shortly before he committed suicide on New Year's day, 1995.[2] John Wayne Glover Australia 12 12 Targeted elderly women Edmund Kemper United States 10 10 A victim of Herbert Mullin was attributed to him originally. Dennis Rader United States 10 10 Known as the BTK Killer, murdered at least ten people in Sedgwick County (in and around Wichita), Kansas, between 1974 and 1991 Ivan Milat Australia 7 7 Backpacker murders Christopher Worrell Australia 7 7 Died before capture James Miller Australia 6 7 Sentenced to life imprisonment for 6 murders Robert Pickton Canada 6 49+ Charged with at least 6 murders, but there are possibilities he may have killed over 29. Kristen Gilbert United States 5 5+ Targeted patients. Sentenced to life without parole. Jack the Ripper Great Britain 5 4-16 Nobody was ever caught for the murders, and the identity of the killer has never been discovered. Preyed on prostitutes in Whitechapel, London in 1888. Ian Brady and Myra Hindley Great Britain 5 5 The 'Moors Murderers'. Abducted children in northern England. They were found guilty of two and three murders respectively. 'Suffolk Ripper' Great Britain 5 5-14 Still an unsoved case. Referred to as 'Suffolk murders', 'Ipswich murders', 'Ipswich Ripper', 'Suffolk Ripper', 'Suffolk Strangler', 'East Anglia Ripper', 'Red Light Ripper' and 'the Suffolkator'. Five prostitute murders in late 2006 have been linked by police. Steve Wright is currently awaiting trial. There are possible links to other, previous Suffolk prostitute killings. Peter Woodcock Canada 4 4 born 1937. Sexual sadist and child rapist. Killed three young children in Toronto, Canada in the 1950s. Sentenced to a psychiatric facility. Murdered a fellow inmate in 1991. Lam Kor-wan Hong Kong 4 4 born 1955. Male taxi driver and one of Hong Kong's only serial killers, famous for keeping body parts in his parents home. Eddie Leonski Australia 3 3 Confessed to three murders after being picked out of a line of American servicemen by witnesses. Was sentenced to death, and hanged in 1942. Danny Rollings United States 5 5+ Known as the \"Gainesville Ripper,\" murdered 5 students in the quiet University of Florida town in August of 1990. Executed October 6, 2006. Category:Lists of people",
 "title": "List of serial killers by number of victims"
}