{
 "id": "938189",
 "text": "Märta Birgit Nilsson (17 May 1918 – 25 December 2005) was a Swedish dramatic soprano. She was best known for her singing in the operas of Richard Wagner and Richard Strauss. Her voice is said to have been very powerful with very good clarity in the upper register. == Biography == === Early life === Birgit Nilsson was born on a farm at Västra Karup in Skåne. It was north of Malmö. Her parents were Nils Svensson and Justina Svensson (née Paulsson). When she was three years old, she began singing melodies on a toy piano her mother bought for her. She once said that she could sing before she could walk. she also said, \"I even sang in my dreams\". Her talent at singing was first noticed in her church choir. A choirmaster near her home heard her sing and toldher to take voice lessons. She studied with Ragnar Blennow in Åstorp for six months to be ready for an audition at the Royal Swedish Academy of Music in Stockholm. At the audition, she came in first out of a group of 47 singers. She was given the Christina Nilsson scholarship. She considered herself self- taught. In 1981, she told an interviewer that \"The best teacher is the stage. You walk out onto it, and you have to learn to project.\" She did not like her early instruction. She said that she was successful because of the native talent. \"My first voice teacher almost killed me ... [T]he second was almost as bad.\" === Death === Nilsson died on 25 December 2005 at her home near Kristianstad in Skåne. She was aged 87. No cause of death was released. She was survived by her husband Bertil Niklasson (died March 2007), a veterinary surgeon whom she had met on a train and married in 1948. They had no children. == Honours and awards == * 1954 Royal Court Singer (Swedish: Hovsångerska), Stockholm, SwedenUnless otherwise indicated, this section is sourced from * 1958 Gold Medal, Teatro Liceo, Barcelona, Spain * 1960 Royal medal Litteris et Artibus * 1960 Honorary member of the Royal Swedish Academy of Music, Stockholm * 1966 Sonning Award, Denmark * 1967 Gold Medal For the Promotion of the Art of Music (Swedish: För tonkonstens främjande) of the Royal Swedish Academy of Music, Stockholm * 1968 Austrian Kammersängerin in 1968 * 1968 Honorary Member of the Vienna State Opera, Vienna, Austria * 1970 Honorary doctorate from Merrimack College, Andover, Mass. USA * 1970 Honorary Member of the Royal Academy of Music, London, England * 1970 Bavarian Kammersängerin, Munich, Germany * 1972 Royal medal Ingenio et Arti * 1974 Commander First Class of the Order of Vasa * 1975 Commander First Class of the Order of St. Olav * 1981 Gold medal of the Royal Opera Stockholm (Swedish: Kungliga Operan), Stockholm * 1981 Illis Quorum gold medal, 18th grade with chain * 1982 Honorary doctorate from the Manhattan School of Music, New York City * 1982 Honorary doctorate from Michigan State University, East Lansing, USA * 1982 Swedish-American of the Year Award, New York City * 1988 Cross of Merit First Class of the Lower Saxony Order of Merit, Land of Lower Saxony * 1991 Commandeur des Arts et des Lettres * 1993 Royal Opera House Silver Medal for 25-year's service as a Guest Artist, London, England * 1994 Award of the Sweden–America Foundation (Swedish: Sverige-Amerikastiftelsen), New York City * 1997 Honorary doctorate of the Sibelius Academy, Helsinki, Finland * 1999 Honorary member of the Vienna Philharmonic Orchestra, Vienna, Austria * 2012 Gramophone's Hall of Fame in 2012 == References == == Sources == * Nilsson, Birgit, My Memoirs in Pictures, translated from the Swedish by Thomas Teal, Garden City: Doubleday, 1981; . * Nilsson, Birgit, Mina minnesbilder, Stockholm: Bonnier, 1977; * Nilsson, Birgit, La Nilsson, Stockholm: Fischer, 1995; . * \"Birgit Nilsson, Soprano Legend Who Tamed Wagner\" by Bernard Holland, The New York Times (12 January 2006) * \"Så höll han allt hemligt\", ('So he kept everything secret'), [on why Nilsson's death was kept a secret for 16 days] by Pelle Tagesson, Aftonbladet (13 January 2006) * Blum, David, \"The Farm Girl and the Stones\", chapter 5 in David Blum, Quintet, Five Journeys toward Musical Fulfillment (Cornell University Press, 1999). == Other websites == General * The Birgit Nilsson official website * Birgit Nilsson Prize Audio * (video) * (video) * in a recording session for Solti's Ring (video) Category:1918 births Category:2005 deaths Category:Swedish singers Category:Opera singers Category:Sopranos",
 "title": "Birgit Nilsson"
}