{
 "id": "938299",
 "text": "The Timberview High School shooting occurred on October 6, 2021 in Arlington, Texas, United States, Shooter Timothy George Simpkins opened fire shooting at 3 people, including a student being left in critical condition, a teacher that attempted in intervene and a second student injured by ricochet. Another teacher was injured while running. The shooter, who has been identified as an 18-year-old male named Timothy George Simpkins, fled after the shooting. Simpkins faces three counts of assault with a deadly weapon, three counts of attempted murder and one count of unlawful possession of a firearm in a prohibited place. On July 24 2023, Timothy Simpkins was sentenced to 12 years in prison and was given a $6000 dollar fine. == Shooting == The shooting occurred during Timberview’s 2nd Period At 9:15 AM, an unknown student known by the name “Zacchaeus Selby” got into an altercation with shooter Timothy George Simpkins. Then it escalated into a fight in the middle of the classroom. After several minutes of fighting Timothy Simpkins pulled out his firearm and started firing his gun injuring 3 people, in which one was left in critical condition, After the shooting Simpkins fled from the shooting turning himself in the same day of the shooting, He faces three counts of assault with a deadly weapon, three counts of attempted murder and one count of unlawful carrying of a weapon in a prohibited place. == Perpetrator == Timothy George Simpkins suspect, an 18-year-old African American student, fled the scene and is at large, authorities said. Three people were injured in a shooting at Mansfield Timberview High School in Arlington, Texas. == Victim == Zacchaeus Selby was one of four people injured in the shooting that took place Oct. 6 at the Mansfield ISD school. The other victims include a teacher who was released from the hospital Oct. 12, and a teenage girl and an adult who were treated for injuries the day of the shooting. == References == Category:High school shootings in the United States Category:2021 in Texas",
 "title": "Timberview High School shooting"
}