{
 "id": "938344",
 "text": "West Caribbean Airways Flight 708 was a chartered MD-80. The plane was in an crash in 2005. It left Panama City to go to Martinique Aimé Césaire Int'l Airports . The aircraft crashed after losing altitude very quickly. The loss of altitude was caused by an aerodynamic stall at the Sierra de Perijá region, in the State of Zulia in Venezuela in the morning of Tuesday, August 16, 2005. All 152 passengers and eight crew members were killed. The plane was a McDonnell Douglas MD-80 with registration HK-4374X. It was flying the Panama City-Martinique route. ==Airline== The Airline started a charter service in 1998. It specialized in flights to San Andrés in the Caribbean, and areas of Colombia and Central America. The company that owned the charter plane lost a turboprop Let L-410 Turbolet in March 2005. The flight crashed while taking off from the Colombian island of Providencia. In that accident, 8 people were killed and 6 injured. In addition to the damaged MD-82, the airline's fleet included two McDonnell Douglas MD-81s, three Aérospatiale ATR 42s, and six Let L-410 Turbolets. ==Crew== The crew of the plane included captain Omar Ospina, 40, and the 21-year-old first officer, David Muñoz. The captain had 5,942 hours of experience, and the co-pilot 1,341 hours. ==Flight Information and accident== The MD-82 arrived at Panama City's Tocumen International Airport after a flight from Medellín, Spain's Medellín-José María Córdova Airport. The plane was then prepared to carry out a flight to the Caribbean island of Martinique. Flight 708 departed Panama City at about 06:00 UTC and climbed to its cruising altitude of FL310. This altitude was reached at about 06:25 UTC. Sixteen minutes later, the airplane began a steady normal climb to FL330. At 06:49 the speed began to steadily decrease from Mach 0.76. The horizontal stabilizer moved from about 2 units nose up to about 4 units nose up during the deceleration. At 06:51 UTC, the crew reported at FL330 over the SIDOS waypoint, over the Colombian/Venezuelan border, and requested a direct course to the ONGAL waypoint. The controller instructed the crew to continue on the present heading and to await further clearance direct to ONGAL. The flight crew meanwhile discussed weather concerns that included possible icing conditions and the possible need to turn on engine and aircraft body anti-ice. Immediately after the anti-icing system was activated, the airspeed decreased to near stall speed. At 06:57 UTC, the flight crew requested permission to descend to FL310, which was approved. The autopilot was disconnected and the airplane started to descend. As the airplane descended past about FL315, the airspeed continued to decrease and the engine power decreased to about flight idle. Two minutes later, a further descent to FL290 was requested, but the controller at Maiquetía did not understand that this was a request from Flight 708 and asked who was calling. Flight 708 responded and immediately requested descent to FL240. The controller inquired about the state of the aircraft, to which they responded under the belief that both engines had flamed out. The controller then cleared the flight to descend however they needed. In the meantime, the altitude alert warning had activated, followed by the stick shaker and the aural stall warning alert. The airspeed had reached a minimum of about 150 indicated air speed (IAS) knots at about FL250. The crew reported descending through FL140 and reported that they were not able to control the airplane. The aircraft descended at 7000 ft/min, and at 7:00:31 UTC (2:00:31 AM local time), crashed at a high angle of attack and nose up attitude in a swampy area. The aircraft exploded on impact and all 160 passengers and crew on board were lost. The descent from FL330 had taken approximately 3 minutes and 30 seconds. ==Other accidents== August 2005 was a bad month for commercial aviation. Other accidents included the tragedies of Helios Airways Flight 522 and TANS Peru Flight 204. West Caribbean Flight 708 was the most serious air disaster of 2005. ==References== == Other websites == * *Civil Aviation Accident Investigation Board **Main text of the final Report (Archive) – Unofficial English translation hosted at SKYbrary – Annexes 3, 6, and 7 of the full report are in English, and are in the original Spanish report and the French translated report by the BEA **Final Report – (Archive, Alt, Archive) – Official version and the version of reference *National Transportation Safety Board **Factual report *Bureau of Enquiry and Analysis for Civil Aviation Safety: **\"Accident in Machiques (Venezuela) on 16 August 2005 .\" Category:Aviation accidents and incidents in 2005 Category:Aviation accidents and incidents in South America Category:2000s in South America Category:21st century in Venezuela",
 "title": "West Caribbean Airways Flight 708"
}