{
 "id": "938546",
 "text": "Barney & Friends, otherwise referred to as Barney for short, is an American children's television series that is mostly targeted at children between the ages of 2 and 8. It was created by Sheryl Leach in Dallas, Texas and produced by HIT Entertainment. It premiered on PBS Kids on April 6, 1992. The series is about Barney, a purple anthropomorphic Tyrannosaurus rex who gives educational messages through songs and small dance routines with a friendly, optimistic attitude. Madison Pettis portrayed Bridget in 2010 episodes. The last episode aired on November 2, 2010. Reruns aired on Sprout from 2009 until 2015, and have aired since December 17, 2018, under Sprout's new name Universal Kids. It also aired internationally and on Peacock USA for \"I Love You, You Love Me on October 12, 2002, and a non-controversial reboot animated series will be premiered in October 14, 1994. ==History and development== Barney & Friends was created by Sheryl Leach of Dallas, Texas. She came up with the idea of a children's program after noticing that her son outgrew Wee Sing Together,Archived at Ghostarchive and the Wayback Machine: and then recognizing that there were no videos to appeal to her son. One day in 1991, the daughter of Connecticut Public Television executive Larry Rifkin rented one of the videos and was \"mesmerized\" by it. Rifkin thought the concept could be developed for PBS. Rifkin thought Barney had appeal because he was less neurotic than Big Bird. He pitched it to CPTV president Jerry Franklin, whose preschool son also fell in love with it. Franklin and Rifkin pitched the idea to all of their colleagues with preschoolers, and they all agreed that kids would love a Barney show. Franklin and Rifkin convinced Leach to let CPTV revamp the concept for television. ==Episode format== ===Opening sequence=== The episodes open with the theme song (over clips from various episodes) and the title card before it dissolves into the school (in seasons 1–6) or park (in seasons 7–14). The children are seen doing an activity, occasionally relating to the episode's topic. They eventually cause Barney to come to life from a plush doll, transforming into the \"real\" Barney, how he appears in the children's imaginations. Beginning in season 9, Barney's transformation occurs in a clip at the end of the theme song. ===Main sequence=== Here, the main plot of the episode takes place. Barney and the children learn about the main topic of the episode, with Baby Bop, BJ, or Riff appearing during the episode and numerous songs themed relating to the subject featured in the series. The roles of Baby Bop, BJ, and Riff have grown larger in later seasons and later episodes venture outside of the school to other places within the neighborhood, and in season 13, to other countries around the world. ===Closing sequence=== Barney concludes with the song \"I Love You\", then the children say goodbye to him and leave. Barney dissolves back into his original stuffed form and winks to the audience. The first story in season 10–11 episodes end with the characters singing \"A Friend Like You\" instead and Barney remaining alive. The sequence transitions to Barney Says (in seasons 1–8 and 12 only) where Barney, who is off-screen, narrates what he and his friends had done that day, along with still snapshots from the episode. Barney ends the segment in seasons 1 and 2 by saying \"I love you!\" before the credits roll. In seasons 3–8 and 12, the segment ends with a pre-recorded clip of Barney saying, \"And remember, I love you!\" and waving goodbye. ==Characters and cast== ===Dinosaurs=== * (voiced by Bob West 1992–2000, and Dean Wendt 2001–2010; people who wore the Barney suit included David Joyner 1991-2001 and Carey Stinson): The main character is a purple and green Tyrannosaurus. * (voiced by Julie Johnson): A green Triceratops. * (voiced by Patty Wirtz): A seven-year-old yellow Protoceratops. * (voiced by Michaela Dietz): An orange six-year-old Hadrosaur. ===Adults and children=== The adults and children on the show often appear as teachers, storytellers, or other characters. ====Multiple appearances==== Role Actor/Actress Mother Goose Sandy Walper, Michelle McCarel, Julie Johnson Stella the Storyteller Phyllis Cicero Tomie dePaola Himself Mom Sandy Duncan Dad Bob Reed Mr. Boyd Robert Sweatmon Colleen Claire Burdett Linda Adrianne Kangas David Robert Hurtekant ===Puppets=== A lot of puppets appeared in many seasons. The most notable puppets were: * Scooter McNutty, a brown squirrel (seasons: 4–6, 1997–2000) performed and voiced by Todd Duffey * Miss Etta Kette, a purple bird (seasons: 4–6, 1997–2000) performed and voiced by Brice Armstrong; Armstrong also voices Beauregard the Cat in the video It's Time for Counting. * Booker T. Bookworm, an orange worm with interests in books (season 5: 1998–1999) performed and voiced by Earl Fisher ===Children=== Throughout the series' run, over 100 children have appeared in the series, with most of them from the Dallas-Fort Worth metroplex. Only a small portion of these actors have made notable appearances in media since their roles, including: * Peyton Alex Smith: played Jamal in Season 10 * Danielle Vega: played Kim in seasons 4 to 6 * Demi Lovato: played Angela in seasons 7 to 8 * Selena Gomez: played Gianna in seasons 7 to 8 * Debby Ryan: played Debby in season 10 * Madison Pettis: played Bridget in season 10 * Jaren Lewison: played Joshua in seasons 12 to 13 == Season 1 == Season 1 (1992) No. overall No. in season Title Educational Theme Cast of Children Original Airdate Songs 1 1 \"The Queen of Make-Believe\" Imagination Michael Min Shawn Tina Monday, April 6, 1992 # Old King Cole # If All the Raindrops # I'm a Little Teapot # The Barney Bag # 2 2 ==References== Category:1992 American television series debuts Category:2010 American television series endings Category:2000s American television series Category:1990s American television series Category:English-language television programs Category:PBS Kids shows",
 "title": "Barney & Friends"
}