{
 "id": "938690",
 "text": "Herman van 't Hof (19 February 1903 — 25 July 1980) was a Dutch boxer and boxing club owner from Rotterdam. He competed at international competitions and fought between 1921 and 1929. Van 't Hof is the only Dutch professional boxer who became in three different weight classes national champion. In 1926 he was the light heavyweight European champion. During his career he had 67 fights, winning 52 of them (12 losses, 2 draws). ==Biography== ===Boxer=== Van 't Hof started as an amateur and made his debut on 26 August 1921 in Antwerp against Arthur van Maroey. At his first South Holland Championships he won the title after winning three matches in a row at one evening. As an amateur boxer he won several national titles. Van 't Hof became professional in 1921 at the age of 18. In 1922 he became national champion in the lightweight category after winning from Piet Dijksman with a knock-out in the second round. Later he became also national champion in the middleweight category, light heavyweight category and again in the middleweight category. Van 't Hof is the only Dutch boxer ever who became national champion in three different weight classes. In January 1926 he won the match for the European light heavyweight title against the Swiss Louis Clement. He lost his title later to Fernand Delarge in July 1926 in what was told to be an “easy match”. In winning position he went knock out due to inattention in the 15th round. Van ‘t Hof tried to regain the European title in January 1927 from Delarge, but lost after in the 15th round due to medical indication. Boxing was banned in the Netherlands after a tragic death of Dirk Romme and his manager Freek Braak became unemployed. Van 't Hof went to England. After a fight against Sid Turner that he didn’t win, the press wrote great stories about him. Sporting Life even compared Van 't Hof to the French world champion, writing the “rebirth of Carpentier” and “the Netherlands is becoming a boxing nation”. He was successful, winning 11 of the 15 fights in 1923 he had 15 fights. It was after his career criticized whether it was responsible and sensible competing in so many heavy fights in such a short period. He had 16 more fights after he returned, including fighting the legendary German Max Schmeling. His last fight was against Paul Hofman on Christmas Day in 1929 and beating him in the 8th round with a knock out. ===Boxing gym=== After his own career, Van 't Hof started his own boxing gym in 1930 in the attic in West Rotterdam. In 1938 he moved his boxing gym to another place in Rotterdam. He trained among others national champions Dorus Elten and Bram Eversteijn. During the World War II German bombing of Rotterdam in 1940 his gym was destroyed. He continued with giving private lessons. Later he started again a boxing gym inside the clubhouse of “De Toekomst” in Crooswijk. With help from other he got a larger boxing gym furnished with a fixed ring and warm showers. In 1974 the “Herman van 't Hof Rotterdam Boxing Club” was founded and became an appreciated boxing association. ===Personal life=== He died in 1980 in the residential and care complex Hoppesteijn; located near the current boxing gym. ==References== ==Other websites== *Dutch newspaper articles — via Delpher Category:Dutch boxers Category:1903 births Category:1980 deaths",
 "title": "Herman van 't Hof"
}