{
 "id": "938871",
 "text": "Navarra Television is a channel of the regional television of Navarra, which broadcasts general content but especially news from the Foral de Navarra. It was founded after the merger of two autonomous Digital Terrestrial Television channels in the area of the Autonomous Community of Navarra . == Establishment == It began its regular broadcasts on May 14, 2012 on DTT. Its programming has information as one of its basic axes, not only at regional level, but also at national and international level. This channel was born after the merger of Canal 6 Navarra and Popular Television, in the search of a regional channel after the end of the also a private channel Canal 4 Navarra. ==Finance== Thanks to this merger, they have access to all the money offered by the Government of Navarra as aid for regional television channels that broadcast in its territory. This change was announced just a few weeks before the merger. In this new stage, content worthy of a regional channel and information in Basque will be promoted thanks to a team made up of professionals from Canal 6 Navarra, Canal 4 Navarra and Popular TV Navarra. Said change becomes effective at 2:00 p.m. on Monday, May 14, 2012, when the logo of Canal 6 Navarra disappears for that of the new Navarra Television. On January 20, 2021, they got a large grant of 1.3 million euros from the Government of Navarra. == Channels == Since its launch, Navarra Television broadcasts through two channels: === Navarre Television 1 === It broadcasts in high definition. Its programming is similar for the entire Community. It is based on current news, on entertainment magazines of its own production, etc. Its programs are: *News every day from 2:30 p.m. to 3:00 p.m. and 8:30 p.m. to 9:00 p.m. *Discount time with Gonzalo Velasco, all the sports news of the community with special attention to Osasuna. *Navarra in Open Wednesday 22 h. Program directed by Roberto Cámara, time for the debate of the most important issues of recent days in the Foral Community. *La Muga, presented by Amaia Madinabeitia, a magazine focused on current affairs. === Navarre Television 2 === This is broadcast in Spanish and Basque. Emission of plenary sessions and commissions of the Parliament of Navarra, Senate and Congress of Deputies. Programming in Basque: \"Mugi Zaitez\" with Íñigo Ciganda, stories of entrepreneurs in Navarra and all the job offers in the Autonomous Community and \"Nafarroako Albisteak\" with Oihane Garzáron, the latest news of the week on Saturday at 2:00 p.m. == Navarra Television Awards == Since 2016, Navarra Television has also handed out awards that bear its name. It aims to recognize the work of outstanding people in the Navarre Foral Community. ==References== == Other websites == * Navarra Television website Category:Television channels in Spain Category:Navarre",
 "title": "Navarra Television"
}