{
 "id": "938882",
 "text": "Brain-storming is a creative-technique in which people have ideas in response to a situation by focusing more on creating many new ideas rather than talking about them in detail. The lack of assessment lets people come up with more ideas without fear that they might not be accepted. The term gained fame through the book Applied Imagination by advertisement-executive Alex Faickney Osborn. == History == In 1939, advertising executive Alex F. Osborn began creating ways for creative problem-solving. He not happy about employees' inability to come up with creative ideas individually for ad campaigns. In response, he began making group-thinking sessions and discovered a big improvement in the quality and amount of ideas produced by employees. He first named the process as organized ideation, but participants later came up with the term \"brainstorm sessions\", naming it after the use of the phrase \"to use the brain to storm a problem\". When Osborn made his concept, he started writing on creative thinking, and the first popular book where he mentioned the name \"brainstorming\" was How to Think Up (1942). Osborn showed how to use his method in the subsequent book Your Creative Power (1948), in the 33rd chapter, \"How to Organize a Squad to Create Ideas\". One of Osborn's biggest recommendations was for all the members of the brainstorming group to be given a clear statement of the problem to be fixed before the actual brainstorming session. He also said that the guiding principle is that the problem should be simple and narrowed down to a single target. Here, brainstorming is not believed to be very good at solving complex problems because of a change in thought over how much the participants desire fixing such problems. While the process can fix some the problems in such a situation, trying to fix all of them may not be the best option. == Osborn's way == === Two principles === Osborn said that two principles contribute to idea-related efficiency: # Delay judgement and assesment of the ideas; # Make as many ideas as possible.Osborn, A.F. (1963) Applied imagination: Principles and procedures of creative problem solving (Third Revised Edition). New York, NY: Charles Scribner's Sons. === Four rules === The next rules are his general ones for brainstorming, made to: * stop people from thinking their ideas are bad and not including them; * increase idea generation; * increase the overall creativity of the group. These four rules were: # Go for quantity: This rule is a way of making idea production more efficient, aiming at problem solution through the motto quantity breeds quality (the more ideas, the better they are). The notion is that the more the number of ideas generated the bigger the chance of making a very good solution. # Withhold criticism: In brainstorming, criticism of ideas generated should be put 'on hold'. Instead, participants should focus on extending or adding to ideas, leaving criticism for a later 'critical stage' of the process. By suspending judgment, participants will feel free to generate unusual ideas. # Welcome wild ideas: To get a good long list of suggestions, wild ideas are encouraged. They can be generated by looking from new perspectives and leaving assumptions for later. These new ways of thinking might give better solutions. # Combine and improve ideas: As suggested by the slogan \"1+1=3\". It is that to make the building of ideas more efficient can be done by associating and combining ideas. === Applications === Osborn said brainstorming should be used to solve a specific question; he said that sessions addressing multiple questions were not efficient. Also, the problem must have the generation of ideas rather than judgment; he uses examples such as making possible names for a product as proper brainstorming material, whereas analytical judgments such as whether or not to marry do not have any need for brainstorming. === Groups === Osborn imagined groups of around 12 participants, including both experts and novices. Participants are encouraged to provide wild and unexpected answers. Ideas receive no criticism or discussion. The group simply provide ideas that might lead to a solution and apply no judgement about how realistic they may be. The judgments are saved for a later date. == Related pages == * Problem solving == References == Category:Thought",
 "title": "Brainstorming"
}