{
 "id": "938870",
 "text": "The Navarra Television Awards are awards given by the Navarra Television media outlet since 2016 to recognize the work of those Navarrese who have stood out for different reasons in the Autonomous Community of Navarra.Diario de Noticias: Los \"Premios Navarra Televisión\" reconocerán cinco labores destacadas. == Categories == The prizes are awarded to sports, social, youth, business values and to the exemplary people.Navarra Televisión: Llegan los premios de Navarra Televisión. The Young Values Award is sponsored by Eroski, the Cultural Values Award is sponsored by the Tres Reyes Hotel in Pamplona, the Social Values Award is sponsored by Banco Santander, the Sports Values Award is sponsored by Urzante, the Business Values Award is sponsored by CaixaBank and the exemplary town award is sponsored by the Government of Navarra . == History == The Navarra Television Awards are born from the initiative of Carlos Ciriza, a Navarrese sculptor, who, supported by Navarra Television, decides to start some awards that bear the name of the communication medium. == Election process == Approximately three months before the gala, a web form is opened where viewers submit their proposals. It is then a team from Navarra Television who selects the three people finally nominated who will compete for the award. From then on, a web form is opened where viewers can vote for their favorites, and on the day of the gala the winner is announced, who is the one who has received the most votes. == Gala == The gala is organized as follows: it is organized in the afternoon of any given day, and in it, a trophy designed by Carlos Ciriza is presented to the winner of the award. To do this, each category is awarded at different times, separated from each other by performances by Navarran and national artists, and each award is announced by two journalists from Navarra (not necessarily from Navarra Television) by opening an envelope at the time. Moments before, a video made with each of the candidates is shown, and the winner receives the trophy from the sponsors of the value itself. == Winners == In the 1st edition of the winners, which was held on November 24, 2016 at the Palacio de Congresos y Auditorio de Navarra (Baluarte) in Pamplona, the winners were the doctor Jesús Alfaro, Adriana and Beatriz de Bodegas Ochoa, the company Code Matrix , the Navarre Paralympics and the town of Milagro (Navarra) In the II edition, also celebrated in Baluarte, the winners were Iñaki Redín, Isabel Villanueva, Carlota Ciganda, the company Postres Ultzama and the town of Ochagavía .Diario de Navarra: Navarra TV entrega sus galardones a personas y entidades destacadas.La Vanguardia: Iñaki Redín, Isabel Villanueva, Carlota Ciganda, Postres Ultzama y Ochagavía, Premios Navarra Televisión 2017.Diario de Noticias: Navarra TV entrega sus premios en Baluarte. In the IV edition, the winners were Natalia Lacunza in young values (against Vanessa Garde and Mario Cornago), Mai Garde (against Alberto Undiano Mallenco and Juan Peralta Gascon ) in the sports values category, the Association of Family Members of Enfermos de Alzheimer de Navarra (against 'Los de Bronce' and the IES Plaza de La Cruz) in the category of social values, the Association for the Development of the Navarra Family Business (against Ana Monreal ) in the category of business values, The Pamplonesa (compared to the 'Flamenco on fire' festival and Alfredo Sanzol ) in the category of cultural values and Tafalla (compared to Roncesvalles and Legarda ) as an exemplary town. The gala was attended by the President of the Government of Navarra, María Chivite. Ruth Lorenzo, the magician Miguel de Lucas, the duo Bruno and Lorena Jiménez or the monologist Aroa Berrozpe, participated in this gala. In the V edition, the capacity had to be limited due to the COVID-19 pandemic, and only the nominees for the award could attend. The gala featured high-level artists such as Javier Erro (a contestant on La voz (Spain) in 2018) and musical performances by Cepeda, Carlos Right, as well as Serafín Zubiri from Navarra. In the VI edition, an Honorary Award for Social Values was given to journalist David Beriain, for his work as a journalist. The winners were STI Norland in business values (against Grupo Apex and Falcón Electrónica), Raduan Hamdai (against Carlos González and Nicolás Atanes) in the category of young values, Beatriz Zudaire (against Asier Martínez and Iñaki Narros) in the category sporting values, Juan Larreta (against Ayuda Contenedores and Pamplona Hotels) in the category of social values, the discovery and investigation of the 'Loizu Man' (against Maite Beaumont and La Kukula) in cultural values and Unzué (against Valcarlos, Cintruénigo) as an exemplary town. The gala featured the singer Nerea Rodríguez, the magician Miguel de Lucas, the singer Anne Lukin and Los Tenampas, the Navarrese monologist Aroa Berrozpe, and the Orfeón Pamplonés with the song \"Por Esto Cantamos Juntos\". Counselor Elma Saiz attended the event on behalf of María Chivite . == References == == Other websites == * Navarra Television website Category:Entertainment awards",
 "title": "Navarra Television Awards"
}