{
 "id": "938833",
 "text": "Tineke “Tine” de Jongh sometimes written as Tineke de Jong (born 1934 or 1935) was a Dutch athlete, who competed in the long jump and sprint events in the early 1950s. She was a member of athletics club . She broke the national junior records in the long jump and in the 4x 50 metres relay and the senior national record in the 10x 100 metres. She competed in the long jump event at the 1950 European Athletics Championships. ==Athletics career == De Jongh started with athletics at the end of 1949 with athletics club in Amsterdam. The club had at the time multiple international athletes including Fanny Blankers-Koen. In June 1950 she broke the junior national record in the long jump, after jumping twice a distance over 5.45 metres. In early August 1950 she became with Sagitta junior national champion in the 4x 80 metres relay together with Rita Aronson, Catrien de Goede and IJmke Vaal. During these championships they broke twice the Dutch junior national record. In the heats with a time of 40.7 seconds and in the final 0.1 faster in a time of 40.6 seconds. While improving De Jongh broke her long jump personal record, and so the national junior record to a distance of 5.565 metres. Due to her good results, after not even a year active in athletics, De Jongh was selected to represent the Netherlands at the 1950 European Athletics Championships in Brussels in the long jump event. She was the youngest participant of the Dutch team. With her age of 15 years old, she was too young by the athletics regulations, but was granted a dispensation. To feel comfortable she stayed with family members who lived in Brussels, instead at a family hotel in a suburb of Brussels where the Dutch national team stayed. During the morning of the long jump competition she was very nervous. She tried to relax and started playing the piano, but according to herself she was still very nervous. She jumped 5.32 metres, a lot less than her personal best of 5.63 metres, and finished eighth. In 1951, De Jongh ran during a club competition 10.8 in the 80 metres, and competed at the national club championships in the long jump. Her last competition of the season was a battle between Sagitta and Zaanland on 22 September. In 1952, she broke with her club Sagitta the national record in the 10x 100 metres relay. Together with Gre de Jongh, Fanny Blankers-Koen, Nel Büch, Sonja van der Stam, Dicky van Dijk, Ina Vervoorn, Rita Huis, Wil Visser and Lieske Kuyper she set a time of 2 minutes and 4.1 second. They were 2.5 seconds faster as old record set 8 years earlier of athletics club Zeeburg. In 1953, she was missed at the National Club Championships. ==Personal life== De Jongh attended high school in Amsterdam. ==References== Category:1930s births Category:Year of death missing Category:Sportspeople from North Holland Category:Dutch sprinters Category:Dutch long jumpers",
 "title": "Tineke de Jongh"
}