{
 "id": "938945",
 "text": "Thomas Mifflin (January 10, 1744 – January 20, 1800) was an American merchant, soldier, and politician from Philadelphia, Pennsylvania. == Military service == Early in the Revolutionary War, Mifflin left the Continental Congress to serve in the Continental Army. He was made a major, then became an aide-de- camp of George Washington. On August 14, 1775, Washington appointed him to become the army's first quartermaster general, under order of Congress. Even though he preferred to be on the front line, people said he was good at his job. Because he failed to properly supply Washington and the troops at Valley Forge, questions were raised. People said he had warehoused and sold supplies, instead of bringing them to Washington and his troops. After a talk with Washington, Mifflin asked to be relieved as quartermaster general but was persuaded to resume those duties because Congress did not find a replacement. Mifflin's leadership in the Battle of Trenton and the Battle of Princeton led to a promotion to major general. In Congress, there was debate regarding whether a national army was more efficient or whether the individual states should maintain their own forces. As a result of this debate the Congressional Board of War was created, on which Mifflin served from 1777 to 1778. He then rejoined the army but took little active role, following criticism of his service as quartermaster general. He was accused of embezzlement and welcomed an inquiry; however, one never took place. He resigned his commission, but Congress continued to ask his advice even after accepting his resignation. == Personal life == Although Mifflin's family had been Quakers for four generations, he was expelled from the Religious Society of Friends when he joined the Continental Army, because his involvement with the military contradicted that faith's pacifistic doctrines. Citing Mifflin became a member of the American Philosophical Society in 1768 and served for two years as its secretary. He served from 1773 to 1791 as a trustee of the College and Academy of Philadelphia (now the University of Pennsylvania), including two years as treasurer (1773–1775). ==References== ==Other websites== * Brief biography and portrait at the University of Pennsylvania * Biography and portrait at Quartermasters-General Category:1744 births Category:1800 deaths Category:Politicians from Philadelphia Category:Signers of the United States Constitution",
 "title": "Thomas Mifflin"
}