{
 "id": "939165",
 "text": "The Black Stallion is a 1979 adventure movie directed by Carroll Ballard. It is based on the children's book The Black Stallion by Walter Farley. It is about the friendship of the boy Alec Ramsey and an Arabian horse. The movie stars Kelly Reno, Teri Garr, Hoyt Axton, Mickey Rooney and the Arabian horse Cass Ole. Francis Ford Coppola was one of the producers and his father, Carmine Coppola composed the music. == Plot == It is the summer of the year 1946. Alec Ramsey is on a ship with his father off the coast of North Africa. Alec discovers a black stallion on the ship. It is tied to ropes and upset. Alec feeds the hourse sugar. The owner rebukes him. Later Alec's father shows him the things he won from a card game. Two items are a pocket kife and a small statue of Bucephalus. Bucephalus was the horse of Alexander the Great. The ship catches fire and begins to sink. Alec cuts the horse loose and falls into the water. The horse rescues Alec from drowning. The two are the only ones to survive. They get lost on a desert island. The horse saves Alec from a snake. The two slowly get closer together. Eventually, the boy rides the horse. A fishing ship rescues the two. Alec is back home, and there is a ceremony for him. His horse stays in the backyard until it runs away. Alec looks for the horse everywhere and meets Snoe (and Napoleon). Snoe tells him where Black might be. This leads Alec to the barn of Henry Dailey. Henry found the horse and is a retired racehorse jockey. Henry and Alec become friends and decide to have the horse race. One night, Henry secretly has someone from the racing industry watch the horse run. The news spreads about how fast this new mystery horse is. Alec wants to race. His mother gives in after protesting. Alec joins a race against the top two jockeys in the country. He is behind in the beginning, but catches up and wins. He has memories of riding on the island. == Reception == The movie had good reviews from critics. It has a 90% on Rotten Tomatoes. The movie was nominated two Academy Awards in Best Actor in a Supporting Role and Best Film Editing. At the Golden Globe Awards, Carmine Coppola was nominated for Best Original Score. The movie was ranked #64 on the American Film Institute list Cheers. The film is part of the National Film Registry, because it is considered culturally significant. ==Awards and honors== ===Academy Award=== * Mickey Rooney was nominated for Best Actor in Supporting Role * Robert Dalva was nominated for Best Film Editing ==Other websites== * * * * * ==References== Category:1979 adventure movies Category:1970s family movies Category:American family movies Category:1970s American adventure movies Category:Movies based on books Category:Movies set in the 1940s Category:Movies about horses Category:Movies directed by Carroll Ballard Category:1970s English-language movies Category:1970s sports movies Category:American sports movies Category:Movies about children Category:Movies about old age Category:United States National Film Registry movies",
 "title": "The Black Stallion (movie)"
}