{
 "id": "939290",
 "text": "Canta Conmigo Ahora was an Argentine talent show produced by LaFlia Contents. was the Argentine version of the British program All Together Now broadcast by the BBC One network. The presenter was Marcelo Tinelli. This TV show was broadcast by eltrece and produced by LaFlia Contents. ==History== It is a singing contest that brings together 100 experts in the same place. They will meet many singers who seek to win the contest. At the beginning of May, the show program LAM announced that of the 100 jurors, some will be great figures recognized throughout the country and that among them, was the singer- songwriter Coti, thus being the first confirmed member of the jury. On May 10, 2022, the casting was launched to participate in the program. == Judges == The protagonist of the program, in addition to its participants, will be the team of 100 jurors who will be different people who have to do with the musical world, of these only 15 will be recognized figures, here is the list of those confirmed: Name Age Information Brenda Alinari 25 years Urban music singer Candelaria «Lelé» Tinelli 31 years Argentine pop singer, fashion designer, painter, influencer and Marcelo Tinelli's daughter Coti 49 years Singer- songwriter and composer of Argentine rock Cristian Castro 47 years Singer- songwriter of romantic ballad and Latin pop José Luis \"Puma\" Rodríguez 79 years Ballad and Latin Pop singer, actor, businessman and music producer «Lula» Rosenthal 38 years Argentine singer Manuel Wirtz 59 years Singer and composer of Argentine rock Bahiano 59 years Singer-songwriter of reggaeton Natalia Cociuffo 42 years Actress and singer Robertino Tarantini 39 years Musician & son of Pata Villanueva & Alberto Tarantini Raúl Lavié 84 years Singer of tango Locho Loccisano 27 years Singer, songwriter, guitarist and ex- participant of El hotel de los famosos 1 Gladys «La Bomba Tucumana» 58 years Singer of cumbia Susan Ferrer 53 years Singer of tango Lourdes Sánchez 36 years Singer and girlfriend of Pablo Prada Luciano «El Tirri» Giungno 49 years Singer, ex-member of Los Fabulosos Cadillacs and Marcelo Tinelli's cousin Marcelo Polino 51 years Critical Manuela Del Campo 25 years Actress Gustavo Remesar 52 years Winner of Soñando por Cantar Viviana Dufour 61 years Actress and singer Giselle Dufour 58 years Actress and singer Alejandro Gallo 31 years Actor and singer Fabio Santana 45 years Former war combatant and singer on Soñando por Cantar 2011 Ale Paker 41 years Singer Padre César 53 years Singer Darío Sayegh 39 years Singer Los Caligaris (12 members) - Music group Previous Ezequiel «El Polaco» Cwirkaluk 38 years Argentine cumbia singer ==References== == Other websites == * *",
 "title": "Canta Conmigo Ahora"
}