{
 "id": "939217",
 "text": "Air France Flight 296 was a test flight of an Air France Airbus A320, chartered by Air Charter International, at an air show in Habsheim, Alsace, France on June 26, 1988. The approach was to take place with the plane at 100 feet (33 m), but the plane descended to a lower height than expected and crashed at the end of the runway, killing 3 passengers on board. This was the first fatal accident of an Airbus A320 in the world. ==Flight crew== The crew of Flight 296 was commanded by Captain Michel Asseline, who was sentenced by the French justice system to 10 months in prison and 10 months of probation. == Accident == As the aircraft approached Habshiem Airfield, the Airbus A320 was prepared for the 100 foot flyover by Captain Asseline. The pilot misjudged the approach descended to 30 feet, with an accompanying Ground Proximity Warning System (GPWS) callout. The crew then realized that the aircraft would not clear the forest at the end of runway and the first officer called out, \"TOGA power, go around track!\" The pilot applied maximum thrust, but the A320 flew into the trees at the end of the runway and burst into flames upon impacting the ground. The impact and the fire resulting from leaking fuel killed three people on board, two young children and one adult. During the evacuation of the plane, a woman tried to extract a 7-year-old girl from the plane whose seat belt got stuck in her seat, but both perished in the resulting fire. The other child was found dead in the rubble. Captain Asseline, First Officer Mazière, two Air France employees, and the president of the local flight club (who sponsored the event) were found guilty of involuntary manslaughter. Of the group Captain Asseline received 10 months in prison and 10 months of probation, and First Officer Mazières was given a twelve month suspended sentence. The rest were sentenced to probation. It was found that the Airbus had gone against Captain Asseline's flight control inputs and deflected the elevators down to prevent the aircraft from stalling. This later became known as the Alpha Protection system. == Dramatization == The episode \"Blaming the Pilot\" of the TV series Survival in the Sky featured the accident. The Discovery Channel Canada / National Geographic TV series Air Crash Investigation featured the accident and subsequent investigation in a season 9 episode titled \"Pilot vs. Plane\" and included an interview with Captain Michel Asseline, survivors, and accident investigators. The episode \"Disastrous Descents\" of the TV series Aircrash Confidential produced by WMR Productions and IMG Entertainment, featured the accident and included an interview with Captain Michel Asseline. == References == == Other websites == * Commission of Inquiry into the accident on 26 June 1988 in Mulhouse–Habsheim (Archive) Category:1988 in Europe Category:1980s in France Category:Aviation accidents and incidents in Europe Category:Aviation accidents and incidents in the 1980s Category:Air France accidents and incidents",
 "title": "Air France Flight 296"
}