{
 "id": "939254",
 "text": "Jorge Ernesto Lanata (September 12, 1960 - December 30, 2024) was an Argentine journalist and writer. He has ventured into various genres such as investigative journalism, literature, documentaries, television, cinema and theater. of magazine, He has participated in the foundation of newspapers, magazines and news portals. He was considered by the international press as \"the most influential journalist in the country\". ==Biography== He comes from a lower-middle class family from the town of Sarandí, in the district of Avellaneda (province of Buenos Aires). When he was seven years old, his mother was bedridden as a result of a brain operation for cancer. He was educated by his aunts and his grandmother. His first interview was with the poet Conrado Nalé Roxlo, whom he looked for in the telephone book. He did it after in elementary school someone close to them was asked for an interview, but he went further. He began writing in \"Colmena\", the medium of his secondary school ―Colegio San Martín (de Avellaneda)―, and the newspaper La Ciudad de Avellaneda reproduced some of those notes. In 1974, at the age of 14, he began working with the writing of informative cables at Radio Nacional. That year he won the Second Municipal Essay Prize with \"The social issue in Argentine cinema.\" In 1978 he graduated from Colegio San Martín. During the last civic- military dictatorship in Argentina (1976-1983), he worked as a waiter in a bar that still exists. In 1977, he wrote notes for the magazine \"Siete Días\". In 2006 he received the «Premio a la Libertad» (\"Freedom Award\"), granted by the Atlas Foundation for a Free Society, which promotes the free market and of which he is one of its exclusive members. He participates in talks and debates organized by another liberal NGO: Fundación Libertad. In 2013 he was offered to run as a politician but he refused, arguing that he is a journalist and that he only dedicates himself to reporting. Together with his ex-partner Andrea Rodríguez they had his first daughter, Bárbara. He was married to Patricia Orlando from 1984 to 1986, then to Silvina Chediek from 1990 to 1991, and finally to Sara Stewart Brown between 1998 and 2016 (with whom he had his second daughter, Lola). ==Periodismo Para Todos== In 2012 Lanata came back to TV with a new show called \"Periodismo para todos\". The 2013 edition worked with the case of \"the K money trail\". In December 2015 the Citizen's Lab, at the Munk School for Global Affairs, at University of Toronto, identified Lanata and several other South American opposition figures as having their cellphones targeted for extrajudicial surveillance by government associated hackers. ==Death== On 14 June 2024, he was hospitalized after suffering a heart attack in Buenos Aires. He remained hospitalized until his death on 30 December 2024 from pneumonia and multiple organ failure at the age of 64. ==References== ==Other websites== * Category:Argentine journalists Category:1960 births Category:2024 deaths Category:Deaths from myocardial infarction Category:Writers from Buenos Aires Category:Deaths from pneumonia Category:Deaths from multiple organ failure",
 "title": "Jorge Lanata"
}