{
 "id": "939455",
 "text": "Lefatshe Leno la Bo-Rrarona was the national anthem of Bophuthatswana, a Bantustan that was recognised as independent by South Africa during Apartheid. It is stated as the national anthem in the Constitution of Bophuthatswana. ==Lyrics== Setswana original English translation Afrikaans translation Lefatshe leno la borrarona Re le abetswe ke Modimo Kwa ntle ga tshololo ya madi A re lebogeng, a re ipepleng A re lebogeng, a re ipepleng. Lefatshe leno la borrarona Re le abela matshelo a rona Re tla le fufulelwa Sethitho se fetoga madi, sethitho se fetoga madi. Lefasthe la kgomo le mabele Boswa jwa rona ka bosakhutleng Ramasedi a ledibele Re tshele mo go llona, ka pabalesego. Modimo tshegofatsa fatshe le Go rene kagiso le kutlwano Tshegofatsa Setshaba sa rona Le yona puso ya rona Go ntsha maungo a a tshedisang. This land of our Forefathers It is given to us by God Without shedding of blood Let us give thanks, and rejoice Let us give thanks, and rejoice. This land of our Forefathers We pledge our lives to it We shall labour for it Till the sweat turns to blood Till the sweat turns to blood. This land of cattle and corn Our lasting heritage May God safeguard it fittingly That we may live in it safely That we may live in it safely. God bless our land That peace and harmony may reign God bless our Government and nation That in good health we may produce lifegiving fruits. That in good health we may produce lifegiving fruits. Hierdie land van ons Voorvaders Dit is deur God aan ons gegee Sonder bloedvergieting Laat ons dankbaar wees en bly wees Laat ons dankbaar wees en bly wees. Hierdie land van ons Voorvaders Ons belowe ons lewe daaraan Ons sal daarvoor arbei Tot die sweet in bloed verander Tot die sweet in bloed verander. Hierdie land van beeste en mielies Ons blywende erfenis Mag God dit gepas beskerm Dat ons veilig daarin kan woon Dat ons veilig daarin kan woon. God seën ons land Dat vrede en harmonie mag heers God seën ons Regering en nasie Dat ons met goeie gesondheid lewegewende vrugte kan voortbring. Dat ons met goeie gesondheid lewegewende vrugte kan voortbring. ==Related pages== Category:Historical anthems Category:African anthems Category:Bophuthatswana",
 "title": "Lefatshe leno la bo-rrarona"
}