{
 "id": "939649",
 "text": "Nici W. Mür (born 1900s) was a Dutch sprinter and discus thrower in the 1920s. She was a member of Hygiëa, The Hague and the national team. ==Career== Her earliest national level competition was at the 1925 Dutch national championships where she won with her club the silver medal in the 4 x 80 metres relay. In 1926 she became Dutch national champion in the 4 x 100 metres. In 1927, after good individual performance at the district championships, she became a week later national champion in the discus throw event. At the national championships Mür also became for the second consecutive year Dutch national champion in the 4 x 100 metres together with Martha Kolthof, Willy Hamerslag and Nettie Grooss with a time of 55 seconds. In the reports about the national championships where she became national champion in the discus throw, it was criticized that her trow was not that far with over four meters below the national record. In September 1927 during an out of competition record attempt, she showed she was a good discus thrower, throwing 24.11 metres, further than national record of Martha Kolthof. For her record she received a special prize. While newspapers reported it as a new national record, the record was not recognized by the Dutch athletics federation. Mür represented the Netherlands at two international competitions. She competed at the international competition against Belgium. She also competed at the international tournament against Germany in Dortmund. Only a few women’s events were included at the 1928 Summer Olympics. The Netherlands could only send a limited amount of athletes. Mür was a reserve athlete and didn’t compete at the Games. On of her last competitions, was the 1929 regional championships where she won the discus throw event. ==References== Category:Year of birth missing Category:Year of death missing Category:Dutch sprinters Category:Sportspeople from South Holland Category:Dutch discus throwers Category:1900s births",
 "title": "Nici Mür"
}