{
 "id": "939726",
 "text": "On June 24, 2022, at least 37 migrants were killed at the Melilla border fence during an issue with Moroccan and Spanish security forces. Issues broke out as between 500 and 2,000 people gathered in the early hours of the day to cross the border with Spain. == Incident == The incident happened in the morning when around 2,000 migrants crossing from Morocco tried to attack and break through the Melilla border fence. Security forces from both nations managed to stop the crowd. But they resulted in violent fighting with the migrants lasting for two hours. Spanish and Moroccan officials said that migrants had assaulted their border guards with weapons and they had to fight back in self- defense. According to authorities, fleeing migrants trampled over each other causing a human stampede and killing several people. Several other migrants fell from the fence onto the ground. At least 18 migrants were killed, five of them died during the crossing attempt and thirteen of them died from their injuries in the hospital. Morocco said that at least 63 other migrants had injuries and that 140 Moroccan officers had been hurt, five seriously, and 49 Spanish Civil Guards were lightly injured. The Moroccan Association for Human Rights said that 29 migrants had been killed, while 133 people managed to cross the fence. A number of pushbacks from Spain to Morocco took place. An NGO called Walking Borders estimated at least 37 killed. NGOs also reported that two Moroccan gendarmes were killed. Prime Minister of Spain Pedro Sánchez said that the incident was a \"well-organized, violent assault\" by organized crime groups and thanked Spanish and Moroccan security forces for their actions. Sidi Salem cemetery operators prepared several graves where the Moroccan authorities plan to bury the deceased. Among the detainees held in custody in Nador, a group of 32 people with the most serious offences were charged by the Moroccan public prosecutor's office. They were charged with \"organizing and facilitating the clandestine entry and exit of people to and from Morocco on a regular basis\", kidnapping and retention of a civil servant to use them as a hostage, setting a fire in the forest, and insults and violence against Moroccan law enforcement agents. Another group of 33 detainees were charged with minor offences. == Reactions == Faced with the informative silence throughout the day of the events and the leaking of videos and photographs of several unconscious, neglected, bloody, crowded and dead migrants in police custody, the situation took on a lot of international media coverage. The Prime Minister of the Government of Spain, Pedro Sánchez (PSOE) justified the intervention and pointed out that “it is necessary to recognize the extraordinary work that the Moroccan Government has done in coordination with the security forces of the State of Spain for try to avoid a violent assault, it has been well-resolved by the two security forces\", in addition to recognizing and thanking\" the importance of having relations with a strategic partner such as Morocco \"and pointing out the mafias as the only culprits of the events that occurred\". Several of the actions condemned by human rights organizations have also occurred in Spanish jurisdiction and not only in Morocco, as initially pointed out. The Spanish Civil Guard denied in statements to France Presse that it knew anything about this matter. According to Moroccan police sources, it was an action measured \"by the use of very violent methods\" by migrants and that they died \"only by the avalanche of people\" while crossing it. Algerian President Abdelmadjid Tebboune publicly accused Morocco of having committed \"a carnage\" in Melilla. President-elect of Colombia Gustavo Petro expressed his solidarity with the families of the \"massacred victims\". He also reaffirmed his commitment \"to all African peoples fighting hunger and for life.\" Due to media pressure, the Moroccan Ministry of Foreign Affairs convened an emergency meeting with representatives of African states to justify the actions alleging the violence by migrants when crossing the prison. In the case of the European Commission, its spokeswoman for Foreign Affairs and Security, Nabila Massrali, postulated that the European authorities had contacted the Moroccans to try to understand the event, but avoided demanding any report or research commission. 10 NGOs requested the identification and return of the remains to their families instead of a swift burial in the Sidi Salem cemetery near Nador. On June 26, hundreds of people demonstrated in Madrid, Barcelona and other Spanish cities against the \"massacre\" of at least 37 migrants. They asked for explanations for what happened, both from the Spanish and the Moroccan governments. On June 27, the African Union Commission called for an investigation into the Melilla tragedy. == References == Category:2022 in Spain Category:2022 in Africa",
 "title": "2022 Melilla incident"
}