{
 "id": "939799",
 "text": "Taejo of Joseon (4 November 1335 – 27 June 1408) was the first king of the Joseon dynasty. His given name was Yi Seong-gye (). He changed his name to Yi Dan () after he became king. He ruled Korea from 1392 to 1398. He was a general of the Goryeo dynasty before he became king. After the fall of the Yuan dynasty in 1368 resulting in the weakened remnants of Northern Yuan only controlling Mongolia and the northeast, in the first lunar month of 1370 Goryeo ordered Yi Seonggye (Li Chenggui), the future founder of Joseon, to attack remnants of Korean loyalists of Northern Yuan in the northern Korean peninsula and retrieve ethnic Koreans who were still loyal to Northern Yuan there to bring them back to Korea. The Goryeo Army appointed Yi Seonggye as the Marshal of the Northeast, and Chi Yongsu and Yang Boyuan as the Marshal of the Northwest.朝鮮王朝實錄第一卷 In the first month of the lunar calendar in 1370 , King Gongmin of Koryo sent Li Chenggui to lead 5,000 cavalry and 10,000 infantry. They traveled more than 600 miles from Huangcaoling in the northeast of Koryo to Xuehanling, and traveled another 700 miles. On the first month of Jiachen, they crossed the Yalu River. That night, the sky was filled with purple air in the northwest. The Koreans considered this a sign of victory. At that time, Li (Yi) Wulu Timur, the Tongzhi of Dongning Prefecture (Dongnyeong Prefectures), fled to Yuluoshan City ( Wunü Mountain City.) Yi Seonggye marched into Yedun Village (也顿村之战), but the Korean leader in the village who was loyal to Northern Yuan, Wulu Timur sent troops and failed. He said \"my ancestors are Koreans, I can surrender\", and led more than 300 households to surrender. Ulu Timur later renamed it \"Yuanjing\". Under the leadership of Gao Anwei (Go Anwi), the remnant Yuan army continued to resist in Yingcheng and was surrounded by the Koryo army. Yi Seonggye took the soldier's bow and shot more than 70 arrows into the city, with a hundred hits.https://cimonnomis.blogspot.com/2017/11/blog-post_30.html Go Anwi abandoned his family and fled the city at night. The next day, more than 20 Northern Yuan army leaders led their congregation to surrender. In other areas, the Northern Yuan army surrendered. Goryeo has more than ten thousand households. The more than 2,000 cattle and hundreds of horses obtained were all returned to the common people, and the common people moved to Korea in large numbers. From the imperial city in the east to Dongning Mansion (Liaoyang) in the north and from Hainan in the west to Yalu. Many Koreans in Liaodong returned to the Korean peninsula after this campaign.高丽史42卷-世家42 Yi Seonggye captured the deputy envoy of Yuan Privy Council and more than 300 households including Li Yuanjing, Li Boyan, Li Changshou, Li Tianyou, Xuanduoshi, Jin'a, and Luding in Dongning Prefecture. When Yi Seonggye entered Kuiluo, he heard crying in the ruined wall, and asked people to check it out. A man stood naked and wept, saying: \"I am the Zhuangyuan of the Yuan Dynasty and I worshiped him. Li Renfu of your country is the same year as me.\" Yi Seonggye gave it to him. He put on clothes, gave him a horse to ride, and brought him to Goryeo. King Gongmin gave him the name Han Fu. Later loyal to Yi Seonggye. Yi Seonggye, the founding king of Joseon was known to have been a master archer. In a battle against Japanese pirates, Seonggye, assisted by Yi Bangsil, killed the young samurai commander \"Agibaldo\" with two successive arrows, one arrow knocking out his helmet, with the second arrow entering his mouth. Yi Seonggye, from his archery experience in Liaodong judged a conflict with the Ming to be suicide, hence he disobeyed orders from Goryeo to seize Liaodong from the Ming and instead overthrew Goryeo. In his letter to General Choi Young, Seonggye lists as one of five reasons not to invade Ming China as during the monsoon season, glue holding together the composite bow weakens, reducing the effectiveness of the bow. == References == Category:1335 births Category:1408 deaths Category:Kings of Joseon Category:Korean generals",
 "title": "Taejo of Joseon"
}