{
 "id": "939791",
 "text": "Joint-stock company \"Ukrposhta\" (Ukr. Укрпошта) is a state-owned postal company, subordinated to the Ministry of Infrastructure of Ukraine, a national postal operator. Together with a private post operator Nova Poshta, Ukraposhta are the leaders of pacels delivery in Ukraine. ==Services== The company provides universal postal services. They are approved by the National Commission for Communications Regulation. The company also has the exclusive right to issue, put into circulation and organize the distribution of postage stamps, stamped envelopes and cards, as well as withdrawal them from circulation in Ukraine. ==Branches== The company has 24 regional branches, the Directorate of Mail Processing and Transportation and Avtotranspost. Ukrposhta is one of the largest companies in the country (60,000 employees) and has about 11,000 branches that provide coverage in 100% of settlements in Ukraine. ==History== On April 12, 2017, PJSC Ukrposhta rebranded the company. To replace the winged envelope, a new logo was chosen for the mail horn, which is transformed into a geolocation icon - a pin. The new logo, according to the head of Ukrposhta Ihor Smilianskyi, should reflect the positive changes in the company. The new brand concept was developed free of charge by the advertising agency Saatchi & Saatchi. In 2020, the company delivered 238.5 million units in Ukraine and abroad. written correspondence, 44.6 million parcels and small packages, paid 12.1 million transfers and 64.5 million pensions and cash benefits. Ukrposhta together with Nova Poshta are leaders in the delivery and e-commerce market of Ukraine. In March 2022, in Zaporizhia Oblast the Russians opened fire on a Ukrposhta car, killing two employees of the company. In the Zaporozhye region, the enemy opened fire on a Ukrposhta car, killing two employees of the company. == References == Category:Postal services Category:Companies of Ukraine Category:State-owned enterprises",
 "title": "Ukrposhta"
}