{
 "id": "93989",
 "text": "The Boston Celtics are an American professional basketball team. They play their home games in the TD Garden in Boston, Massachusetts. They are a part of the National Basketball Association (NBA) and play in the Atlantic Division. The Celtics are one of the most successful teams in the history of the NBA, and have won 18 NBA championships, the most in NBA history. ==History== The Celtics were one of the first NBA teams. Since their start in 1946, they have been the most successful teams, winning 17 NBA championships, including eight championships in a row at one point.Team Index , basketball-reference.com. Retrieved August 5, 2013. The Celtics' seventeen championships is more than any other team. The Celtics play their home games at the TD Garden. From 2007 to 2013, they were lead by the big four: Kevin Garnett, Paul Pierce, Ray Allen, and Rajon Rondo, leading the team to the 2008 championship as well as making the Finals in 2010 both times against the Lakers. But in July 2012, Allen was traded to the Miami Heat (where he won his second championship in 2013) and in July 2013, Garnett and Pierce were traded to the Brooklyn Nets. Rondo remained with the Celtics until the beginning of the 2014-15 season. Today, they are led by \"The Jays\", Jayson Tatum and Jaylen Brown who lead the team to the 2022 and 2024 Finals, winning the latter. ==Rival Teams== ===Celtics-Lakers Rivalry=== The rivalry between the Boston Celtics and Los Angeles Lakers is between two most of the best franchises in NBA history. It has been called the NBA's best rivalry. The two teams have met a record twelve times in the NBA Finals, starting with their first Finals meeting in 1959. They would go on to win the league in the 1920s and the 1980s, playing each other six times in the 1960s and three times in the 1980s. The rivalry had been less known since the retirements of Magic Johnson and Larry Bird in the early 1990s, but in 2008, it happened again when the Celtics and Lakers met in the Finals for the first time since 1987, with the Celtics winning the series in six games. They played once again in the 2010 NBA Finals which the Lakers won in seven games. The two teams have the highest number of championships; together, the 35 championships account for almost half of the 74 championships in NBA history. ==References== ==Other websites== * Category:1946 establishments in the United States Category:1940s establishments in Massachusetts",
 "title": "Boston Celtics"
}