{
 "id": "939907",
 "text": "China Airlines Flight 140 was a scheduled flight between Taiwan Taoyuan International Airport to Nagoya Airport in Nagoya, Japan. On April 26, 1994, the Airbus A300 B4-622R was completing a flight and was approaching Nagoya airport, when, just before landing, several pilot errors of not correcting their actions and speed caused the plane to end up crashing to the ground, killing almost all the passengers. It was the most serious air disaster of 1994. ==Aftermath== To date, this accident remains the deadliest in China Airlines history, and the second deadliest aviation accident on Japanese soil, behind Japan Airlines Flight 123. Also, it is the third worst accident in the history of the Airbus A300 after Iran Air Flight 655 and later surpassed by American Airlines Flight 587 with 265 fatalities. On 3 May 1994, the Civil Aeronautics Administration (CAA) of the Republic of China (Taiwan) ordered China Airlines to modify the flight control computers following Airbus's notice of the modification. On 7 May 1994, the CAA ordered China Airlines to provide supplementary training and a re-evaluation of proficiency to all A300-600R pilots. Following the accident, China Airlines decided to withdraw its flight CI140 on this route and changed it to CI150 after the crash. China Airlines now operates this route with the Airbus A330-300 aircraft and the A300 has since been retired. ==References== == Other websites == * Aircraft Accident Investigation Report – Aircraft Accident Investigation Commission (Archive) ** Text version of English main report – Prepared for the World Wide Web by , a member of the Safety Promotion Committee (総合安全推進) of All Nippon Airways; and by Prof. Peter B. Ladkin, PhD of the University of Bielefeld ** English appendices text version – Prepared for the World Wide Web by Marco Gröning Category:1994 in Asia Category:Airliner accidents and incidents caused by pilot error Category:Aviation accidents and incidents in the 1990s",
 "title": "China Airlines Flight 140"
}