{
 "id": "939978",
 "text": "Nura Pakhang () is a Meitei-Portuguese bilingual song. It was sung by Manipuri folk musical artist Mangka Mayanglambam and the artists of Portuguese musical band \"Clã\". The music video was directed by Romi Meitei. It was released worldwide on 28 April 2017. It is a part of an album called \"T(H)REE\". It is a musical collaboration between Portuguese and Asian musicians in unique ways. == Making == Portuguese music video producer David Valentim contacted Manipuri folk music artist Mangka Mayanglambam and her lyricist father Mayanglambam Mangangsana through email about his desire to collaborate Portuguese music with Meitei music. When the collaboration between the two musical cultures was confirmed and finalised, Manipuri musical lyricist Mangangsana sent three musical tracks to the Portuguese producer David Valentim through email. David chose the song \"Nura Pakhang\" among the three. Clã also wrote their own musical lyrics to mix it with the Meitei folk song. All these processes of conversations were done through emails and the song was finally created. Interestingly, Mangka Mayanglambam and her father Mayanglambam Mangangsana had never met David Valentim and the Portuguese artists of \"Clã\" in real life. So, the artists couldn't record the song together but it doesn't affect their touring together in the musical journey. It's director Romi Meitei who met both teams of Meitei and Portuguese artists. The first part of the music video was made in Manipur of India and its later parts are made in Porto of Portugal. The contributions of the lyrics are mainly credited to Carlos Tê, Hélder Gonçalves, Manuela Azevedo and Mayanglambam Mangangana. \"Nura Pakhang\" shows the way in which two different things depend on each other in a way that make sense together. The sound of the music video crosses jazzy pop rock with traditional Manipuri music. == Release == The song \"Nura Pakhang\" was released was released worldwide on 28th April 2017. Regarding radio broadcasting, it was released on \"Antena 3\", one of the biggest radio channels in Portugal. According to an interview with Mangka Mayanglambam by IANS (Indo-Asian News Service), she said: > \"The song was launched in April. It is played on radio in Portugal and is > available on the internet. But I will be able to distribute it after June. I > never thought of earning a profit from this project. All the proceeds will > go to Make a Wish Foundation.\" Mangka believes that language is not a barrier. She said to the IANS: > \"Music is a Universal language, still each and every place has its own > culture. It's best to follow our culture.\" == References == == Other websites == * * Category:2017 songs Category:Meitei culture",
 "title": "Nura Pakhang"
}