{
 "id": "939930",
 "text": "América TV (call sign LS 86) is an Argentine television channel. Its headquarters is in the city of La Plata, Buenos Aires. Its signal is produced in the city of Buenos Aires. ==Controversies== * In August 2005. \"Television Registrada\", one of the channel's most popular programs, invited Mario Pontaquarto as a \"critic\", one of those involved in the famous bribery case in the Argentinean National Senate in 2000. According to the producer of this program, Diego Gvirtz, this made Rolando Graña, journalistic director of the channel, censor the program without the production's consent before it was broadcast. Due to this, the production company PPT decided to break its contract with America and move to Channel 13 with its products \"Television Registrada\" and \"Indomables\". * Trespoderes was a journalistic program broadcast by this channel, hosted by Reynaldo Sietecase, Maximiliano Montenegro and Gerardo Rozin where Argentina's politics and economy were discussed. On June 7, 2009, in the campaign for the legislative elections of that year, Francisco De Narváez, candidate for national deputy for Unión Pro and one of the channel's shareholders, was interviewed. The interview included mentions of the accusations of illicit enrichment made by the newspaper Página/12 about the candidate. At the end of the program, while Sietecase was making an editorial about journalists and media owners, he cut off the transmission and started \"La cornisa\", the program that followed him. According to Sietecase, this fact, added to the neutral stance taken by Tres Poderes during the debate on the Law of Audiovisual Communication Services, determined the lifting of the cycle in November 2009, one month before the end of the contract. Another program, Lado Salvaje, hosted by Sietecase and Montenegro on A24 channel, was also the victim of unequal conditions that led to its closure. Likewise, the Sietecase column was raised on Rosario's LT8 radio. América TV only issued a statement attributing the uprisings of Trespoderes and Lado Salvaje to the termination of the contracts. It should be clarified that all the media mentioned belong to the same Grupo Uno. ==References== Category:Television channels in Argentina Category:1966 establishments in South America Category:Television channels in South America",
 "title": "América TV"
}