{
 "id": "939985",
 "text": "Ismail Abdel Salam Ahmed Haniyeh (; 1962/1963 – 31 July 2024) was a senior political leader of Hamas. He was the disputed Prime Minister of the Palestinian National Authority. In September 2017, he became Chief of Hamas's Political Bureau. ==Personal and family life== Haniyeh is married to Amal Haniyeh and the couple have 13 children. In 2009, the family lived in Al-Shati refugee camp in the northern Gaza Strip. In 2010, the couple shifted to the Rimla neighborhood in Gaza City. In 2020, He went to Qasem Soleimani's funeral, in Tehran, Iran. After visiting some other countries he decided to permanently reside in Doha, Qatar. His family joined him there in 2021. On 17 October 2023, during Israel–Hamas war an airstrike by Israeli forces in Sheikh Radwan neighborhood in Gaza City reportedly killed 14 Palestinians, Haniyeh's brother and nephew were among the victims while several other family members were also injured. Three of his sons and three grandchildren were killed in the Gaza Strip on 10 April 2024. == Views == Haniyeh was seen as someone in Hamas who thought practically. Haniyeh was a relative moderate within Hamas and had repeatedly offered a peace deal in exchange for a fully sovereign Palestinian state on the land that Israel did not occupy until 1967. https://www.dailynewsegypt.com/2010/12/14/engagement-not-isolation-as-the-way- to-a-moderate-hamas/ \"WASHINGTON, DC: Last week, Ismail Haniyeh, a senior political leader of Hamas, publicly announced his movement’s commitment to respecting “any peace deal” with Israel approved by Palestinian referendum. Stating Hamas’s desire to be “part of the solution, not the problem,” Haniyeh went on to proclaim Hamas’s commitment to “establishing a viable Palestinian state with full sovereignty on the land… occupied in 1967”.\" === Osama bin Laden === On 2 May 2011, Osama bin Laden was killed by the U.S. Military, and the killing of Osama was praised by Fatah who is one of Hamas' rival groups. Haniyeh however called bin Laden a \"Arab holy warrior\" and condemned his killing as \"the continuation of the American oppression and shedding of blood of Muslims and Arabs\". Analysts say that he praised bin Laden to cool down Salafist groups in the Gaza Strip such as Jaysh al-Ummah al-Salafi Bayt al- Maqdis, which see Hamas as too moderate. The United States said that Haniyeh's speech condemning the killing of bin Laden and calling bin Laden a \"Arab holy warrior\" were outrageous and said that bin Laden did not die a martyr. == Death == On 31 July 2024, Haniyeh was killed in Tehran as he went to the inauguration of Masoud Pezeshkian as President of Iran. Hamas said that he was killed by a \"Zionist\" airstrike on a residence. He was 62 years old. According to The New York Times, Haniyeh was killed by using a remotely detonated bomb hidden in his guesthouse room two months earlier, which was triggered once it was known that he was inside. == Gallery == File:Gaza police graduation ceremony in 2012 (19).jpg|Ismail Haniyeh shaking hands with a Hamas police officer in 2012 File:2013 Izz ad-Din al-Qassam Brigades exercise (4).jpg|Haniyeh at a Al-Qassam Brigades military excercise in 2013 File:25th anniversary of Hamas (15).jpg|Haniyeh with Khaled Mashal celebrating the 25th anniversary of the Hamas movement in 2012 File:2022-09-13 Russia–Hamas meeting (5).jpg|Haniyeh at a meeting between Russian officials and Hamas officials in 2022 File:Erol Erdoğan İsmail Haniye ile.jpeg|Khamenei meets with President Erdogan in 2012 File:Pij hani 14030509 0357236.jpg|Haniyeh meets with Khamenei, hours before his death. File:Khamenei leads prayer for Ismail Haniyeh.tif|The funeral prayer of Haniyeh in Tehran, Iran. == Notes == ==References== Category:1960s births Category:2024 deaths Category:Hamas Category:Prime Ministers of the Palestinian National Authority Category:People from the Gaza Strip Category:Prime Ministers of the State of Palestine Category:Qatar Category:Hamas people",
 "title": "Ismail Haniyeh"
}