{
 "id": "940048",
 "text": "Grupo Telefe (legally Television Federal S.A.) is an Argentine conglomerate dedicated to the production of audiovisual content and the operation of terrestrial television licenses. The company, created in 1989, belongs to the multinational Paramount Global since November 2016. ==History== On December 6, 2012, Telefe presented its voluntary adaptation plan before the Argentinean Federal Authority for Audiovisual Communication Services in order to adapt to the Audiovisual Communication Services Law, where it proposed to put Neuquén channels 7 and 9 up for sale in Bahía Blanca. The plan was approved two years later on December 16, 2014, leaving the two channels for sale. On December 29, 2015, changes were made to several articles of the law (among them Article 45, which indicated that the licensee could not cover with its open media more than 35% of the country's population); as a result of the elimination of the limit percentage of national coverage, Telefe would no longer have the obligation to sell the two channels, being able to keep the 8 channels from the interior in its possession. On February 2, 2016, the National Communications Entity (successor to AFSCA) decided to file all adaptation plans (including Telefe's) as a consequence of this, Telefe no longer has the obligation to sell any of its television channels. On November 3, 2016, it was announced that the US group Viacom had reached an agreement to buy Telefe and its channels for US$345 million. The purchase was finalized on November 15. The ENACOM approved the transfer of Telefe and its licenses to Viacom on March 30, 2017. On August 13, 2019, CBS Corporation and Viacom announced that they had reached an agreement to merge their respective business units (including Grupo Telefe) under the umbrella of the former (to be renamed ViacomCBS).The merger was completed on December 4. As of February 16, 2022, ViacomCBS was renamed Paramount Global. == Other websites == *Official website == References == Category:Telefe",
 "title": "Grupo Telefe"
}