{
 "id": "940055",
 "text": "The Federal Authority for Audiovisual Communication Services (, AFSCA) was an Argentine state agency. It was created by the Audiovisual Communication Services Law as the authority in charge of enforcing law. ==History== The entity began its activities on December 10, 2009. It was established by presidential decree 1525/2009. Martín Sabbatella was appointed as its president, at the head of a board of directors made up of parliamentarians from the three main blocks, representatives of the universities and of the Federal Council. On December 23, 2015, the AFSCA was intervened by the President Mauricio Macri. This was through a decision challenged before the Justice. On December 30, 2015, the Chief of Staff Marcos Peña announced that President Macri had sanctioned a decree of necessity and urgency. The number was not specified. In addition, the date was not published in the Official Gazette, which provided for the elimination of the AFSCA and its merger with the AFTIC. This led to a new public body called the National Communications Entity (ENACOM). On January 4, 2016, the decree of necessity and urgency 267/2015 signed on December 29, 2015, announced by the Chief of Staff, was published in the Official Gazette. ==Composition== The AFSCA was led by a seven-member board, consisting of the following: *1 president and 1 director named by the president. *3 directors nominated by parliamentary committee, each representing one of the top three parliamentary blocs. *2 directors nominated by the Federal Council for Audiovisual Communication; one of these had to be an academic in the fields of information sciences, communications or journalism from a national university. ==Other websites== *Official website Category:2009 establishments in South America Category:21st-century establishments in Argentina Category:2016 disestablishments Category:Government agencies Category:Organizations based in Buenos Aires",
 "title": "Federal Authority for Audiovisual Communication Services"
}