{
 "id": "940049",
 "text": "Jennifer O'Neill (born February 20, 1948) is a Brazilian-born American actress, model, author, and activist. She is known for her modeling and spokesperson career with CoverGirl. She acted in the Oscar-winning 1971 movie Summer of '42. She also starred in the cult horror movie Scanners (1981) and the television series Cover Up (1984–85). She has also been active in the anti-abortion-rights movement. ==Personal life== O'Neill was born to a wealthy family in Rio de Janeiro, Brazil. She was raised in New Rochelle, New York and Wilton, Connecticut. O'Neill went to school at the Dalton School in Manhattan. She got married at age 17. When she was young, she was an equestrienne and was on the covers of Vogue, Cosmopolitan, and Seventeen, earning $80,000 in 1962. O'Neill has been married nine times to eight husbands (she married, divorced, and remarried her sixth husband Richard Alan Brown). She has three children from three fathers. ==Written works== *Surviving Myself, (1999) *From Fallen to Forgiven, (2002) *You're Not Alone: Healing Through God's Grace After Abortion. (2005) *Remarkable Women, (2005) *A Fall Together, (2006) *A Winter of Wonders, (2007) *A Late Spring Frost, (2007) *Faith Lessons, (2008) ==References== ==Other websites== * * * Category:1948 births Category:Living people Category:Naturalized citizens of the United States Category:American movie actors Category:American television actors Category:American stage actors Category:American political activists Category:American autobiographers Category:Models from New York (state) Category:Actors from New Rochelle, New York Category:Writers from New Rochelle, New York Category:Models from Connecticut Category:Writers from Connecticut Category:Actors from Connecticut Category:People from Wilton, Connecticut Category:American Christians Category:American equestrians Category:Sportspeople from New Rochelle, New York Category:Sportspeople from Connecticut",
 "title": "Jennifer O'Neill"
}