{
 "id": "940189",
 "text": "64 Zoo Lane is a children's cartoon animated series. It was created by An Vrombaut. The series is made by the animation Studio Millimages and based Zoo Lane Productions in association with ZDF and ZDF Enterprises, La Cinquième, The Itsy Bitsy Entertainment Company (series 1 and 2), Sofica Cofanim and CBeebies (series 3 and 4), with the participation of France 5 (series 3)/France Televisions (series 4). The first 2 seasons aired from 1999 to 2000 in the United States and the 3rd and the 4th seasons aired from 2008 to 2012 in the United Kingdom. 104 episodes were made. ==Plot== * Lucy the 7 Year Old Human Girl lives next door to the zoo far from the house where every night, Georgina the Giraffe, Boris the Bear, Giggles and Tickles the Monkeys, Molly the Hippo and Nelson the Elephant the zoo animals tell her a bedtime story to help her fall asleep. ==Series overview== ==Characters== ===Main characters=== * Lucy (Voiced by Ciara Janson with an American accent (Seasons 1 and 2), later Alice Hearing with a British accent (Season 3), later Lara Wollington with a British accent (Season 4)) – A 7-year-old human girl. \"Meet Lucy, a 7-year-old girl...\" * Georgina the Giraffe (Voiced by Megg Nicol with an American accent (Seasons 1 and 2) and Adrienne Posta with a British accent (Seasons 3 and 4)) – A giraffe with blue-colored dots. * Nelson the Elephant (Voiced by Keith Wickham with an English accent) – A green-colored elephant, who has a nephew named Nigel. * Molly the Hippopotamus (Voiced by Anna Bentinck (Various episodes) and Adrienne Posta (Episode 3)) – A blue-colored hippopotamus. * Giggles and Tickles the Monkeys (Voiced by Megg Nicol and Dian Perry with an American accents (Seasons 1 and 2) and Adrienne Posta and Anna Bentinck with a British accents (Seasons 3 and 4)) – 2 playful prankster monkeys though their practical jokes can sometimes cause trouble. * Boris the Bear (Voiced by Lewis MacLeod with a Russian accent (Seasons 1 and 2) and Matt Wilkinson with a Russian accent (Seasons 3 and 4)) ===African characters=== * Nathalie the Antelope (Voiced by Dian Perry with an American accent (Seasons 1 and 2) and Adrienne Posta with a British accent (Seasons 3 and 4)) – An antelope who loves to dance and jump around. * Audrey the Ostrich (Voiced by Dian Perry with an American accent (Seasons 1 and 2) and Anna Bentinck with a British accent (Seasons 3 and 4)) – An ostrich who is very wise and often gives advice to other animals. * Reginald the Lion (Voiced by Keith Wickham with a Royal British accent) – A lion whose naps would often get disturbed. While not napping, he is often seen licking a bone. * The Snip Snip Bird (Voiced by Bob Saker) – A green-colored bird, who lives at the top of the mountain. He resembles peacock because of his big, beautiful tail. * King Snake (Voiced by Keith Wickham) * Victor the Crocodile (Voiced by Keith Wickham with an English accent) – A grumpy crocodile who acts cruel but deep down he cares about others. * Kevin the Crocodile (Voiced by Dan Russell with the US Southern accent (Seasons 1 and 2) and Anna Bentinck with a British accent (Seasons 3 and 4)) – A young crocodile who is friends with Toby and Doris. * Doris the Duck (Voiced by Adrienne Posta) – A young duck who is friend with Kevin and Toby. She is very helpful but she can also be a little bossy. * Toby the Tortoise (Voiced by Bob Saker with an East Country accent) – A blue-colored tortoise who is a little self-conscious because of being slow. * Isabel the Flamingo (Voiced by Adrienne Posta with an Italian accent) * Mirabelle the Flamingo (Voiced by Anna Bentinck with an Italian accent) * Annabelle the Flamingo (Voiced by Adrienne Posta with an Italian accent) * Herbert the Warthog (Voiced by Keith Wickham) – A warthog who has a fond of watermelons. He is a great musician and loves bathing in mud. * Zed the Zebra (Voiced by Lewis MacLeod (Seasons 1 and 2) and Matt Wilkinson and (Seasons 3 and 4)) – A zebra who runs very fast. * Alan the Aardvark (Voiced by Keith Wickham) – An aardvark who is usually seen eating ants. * Ronald the Rhinoceros (Voiced by Keith Wickham with a Yorkshire accent) – A rhinoceros who likes breaking rocks into pieces. * The Tic Tic Bird (Voiced by Lewis MacLeod with a Yorkshire accent (Seasons 1 and 2) and Matt Wilkinson with a Yorkshire accent (Seasons 3 and 4)) – A colorful bird (possibly oxpecker), who is Ronald's best friend. * William the Weaver Bird (Voiced by Lewis MacLeod with a Scottish accent (Seasons 1 and 2) and Matt Wilkinson with a Scottish accent (Seasons 3 and 4)) – A bird who is often seen building a nest. * Pauline the Pelican (Voiced by Adrienne Posta with a Yorkshire accent) – A pelican who is fond of fish. She is a little clumsy but also very nice and friendly. * Nigel the Elephant Calf (Voiced by Matt Wilkinson) * Harry the Hyena (Voiced by Lewis MacLeod (Seasons 1 and 2) and Matt Wilkinson (Season 3)) * Edna the Hyena (Voiced by Adrienne Posta) * Holly and Johnnie the Hyena Pups (Voiced by Anna Bentinck and Keith Wickham) * Seamus the Stork (Voiced by Keith Wickham with a West Country accent) – A stork who flies very fast. * Eddie the Little Hippopotamus Calf (Voiced by Lewis MacLeod) – A young and mischievous hippopotamus calf. * Henrietta the Hairy Hippopotamus (Voiced by Anna Bentinck) – A hairy hippopotamus who is one of Molly's relatives. * Patsy the Porcupine (Voiced by Anna Bentinck with a Yorkshire accent) * Casper the Chameleon (Voiced by Lewis MacLeod) – Casper is a cheeky chameleon who likes to camouflage. Ignoring Granddad Chameleon's warning, he gets into trouble. * Granddad Chameleon (Voiced by Keith Wickham) * Dennis the Dromedary (Voiced by Keith Wickham with a Yorkshire accent) – A curious young dromedary. * Gary the Dromedary (Voiced by Lewis MacLeod) – An uncle of Dennis. * Doctor Gordon Gorilla (Voiced by Bob Saker with an English accent) – Doctor Gordon Gorilla is Africa's physician and the uncle of Giggles and Tickles. * Esmeralda the Snake (Voiced by Adrienne Posta) – A snake who collects shells and likes having everything clean. * Cousin Chuckles the Monkey (Voiced by Lewis MacLeod with an Irish accent) * Lily the Ostrich (Voiced by Adrienne Posta) – A young ostrich, daughter of Audrey. * Doogal the Ostrich (Voiced by Anna Bentinck) – A young ostrich, son of Audrey. * Rosie the Rhinoceros (Voiced by Anna Bentinck with a Yorkshire accent) * Petula the Parrot (Voiced by Adrienne Posta) ===North American characters=== * Melanie the Moose (Voiced by Adrienne Posta with a Brummie accent) – A female moose with antlers. She is clumsy, but kind. * Beverly the Beaver (Voiced by Anna Bentinck with an American accent) – A beaver that is often trying to perfect her dam. She also speaks with an American accent. * Randolph the Raccoon (Voiced by Dan Russell with a Southern Drawl accent) – A raccoon who grows a yield of mushrooms. He speaks with a Southern Drawl accent. * Barbara the Bison (Voiced by Anna Bentinck) – A baby bison is a found her family. * Alfie and Charlie the Chipmunks (Voiced by Bob Saker and Matt Wilkinson) * Mr. and Mrs. Bison (Voiced by Anna Bentinck and Dan Russell) – The parents of Barbara. ===South American characters=== * Adam the Armadillo (Voiced by Keith Wickham) – An armadillo who likes to roll. * Jazz the Jaguar (Voice by Dan Russell with a Hispanic accent) * Leopoldo the Llama (Voiced by Lewis MacLeod with a Cockney accent (Seasons 1 and 2) and Matt Wilkinson with a Cockney accent (Seasons 3 and 4)) * Taco the Toucan (Voiced by Bob Saker with a Hispanic accent) * Annie the Anaconda (Voiced by Anna Bentinck) * Dudley the Sloth (Voiced by Bob Saker with an East Country accent) * Itchy Quatzel the Mysterious Mountain (Voiced by Bob Saker) * Tallulah the Toucan (Voiced by Adrienne Posta with a Hispanic accent) ===Australian characters=== * Joey the Little Kangaroo (Voiced by Keith Wickham with an Australian accent) – A young kangaroo who had trouble in learning to jump but finally learnt to do so. * Jimmy the Little Kangaroo (Voiced by Lewis MacLeod with an Australian accent (Seasons 1 and 2) and Matt Wilkinson with an Australian accent (Seasons 3 and 4)) – A young kangaroo who used to bully Joey, but later they became friends. * Janet and Elvis the Kangaroo Parents (Voiced by Adrienne Posta and Bob Saker with an Australian accents) * Janice the Mother Kangaroo (Voiced by Adrienne Posta with an Australian accent) * Wally the Wombat (Voiced by Keith Wickham with an English accent) * Mr. Platypus (Voiced by Lewis MacLeod with an Australian accent (Seasons 1 and 2) and Matt Wilkinson with an Australian accent (Seasons 3 and 4)) * Julie the Mother Kangaroo (Voiced by Megg Nicol with an Australian accent (Season 1) and Anna Bentinck with an Australian accent (Season 4)) * Ribbit the Frog (Voiced by Lewis MacLeod with a Scottish accent (Season 1) and Matt Wilkinson with a Scottish accent (Seasons 3)) * Phoebe the Koala (Voiced by Anna Bentinck with an Australian accent) - A young koala who is friends with Jimmy and Joey. She is very shy and self-conscious. * Carrie the Cockatoo (Voiced by Adrienne Posta with an Australian accent) ===North Pole characters=== * Snowbert the Polar Bear (Voiced by Dan Russell) – A polar bear who is Boris's northern cousin. He used to live alone until he met Sidney the Seal. He likes making ice sculptures. * Sidney the Seal (Voiced by Keith Wickham) – A seal that befriended Snowbert. ===Overseas characters=== * Jamie the Littlest Puffin (Voiced by Anna Bentinck with an Irish accent) * Thomas, Sharon and Lewis the Puffins (Voiced by Keith Wickham with an Irish accent (as Thomas), Adrienne Posta with an Irish accent (as Sharon) and Lewis MacLeod with an Irish accent (Season 2) and Matt Wilkinson with an Irish accent (Seasons 3 and 4) (as Lewis)) * Hercule Mustache the Walrus (Voiced by Bob Saker with a French accent) * Thelma the Whale (Voiced by Anna Bentinck) * Gunnar the Seagull (Voiced by Keith Wickham with an Irish accent) * Jack Big Claw the Crab (no lines) ===Asiatic characters=== * Bao Bao the Giant Panda (Voiced by Dan Russell) * Gertie the Goat (Voiced by Adrienne Posta) * Cassandra the Crane (Voiced by Anna Bentinck) * Horace the Hare (Voiced by Keith Wickham) * Confuse-us the Carp (Voiced by Keith Wickham) ==Broadcast== The series has aired on the following channels and countries: * The United States: Fox Family (now Freeform), Noggin (now Nick Jr.) and Sprout for the first and the second seasons in 1999 and 2000. The United States airings were used in the American version by The Sound Company Ltd., with the voice cast, including Ciara Janson with an American accent as Lucy, Lewis MacLeod as Boris, Ribbit, Jimmy, Mr. Platypus, Zed, Harry, The Tic Tic Bird, Leopoldo, William, Gary, Eddie, Lewis, Casper and Cousin Chuckles, Megg Nicol as Georgina, Giggles and Julie, Dian Perry as Tickles, Nathalie and Audrey, Anna Bentinck as Molly (39 episodes), Henrietta, Phoebe, Beverly, Mirabelle, Patsy, Jamie, Rosie, Holly and Annie, Keith Wickham as Nelson, Reginald, Victor, Joey, Sidney, Dennis, Herbert, Ronald, Adam, Alan, Seamus, King Snake, Wally, Thomas, Johnnie and Granddad, Dan Russell as Kevin, Snowbert, Jazz and Randolph, Bob Saker as Toby, Elvis, The Snip Snip Bird, Dudley, Doctor Gordon, Hercule Mustache, Taco and Itchy Quatzel and Adrienne Posta as Doris, Molly (Episode 3), Janet, Janice, Pauline, Isabel, Melanie, Esmeralda, Petula, Annabelle, Sharon and Edna. * France: France 5 for Seasons 1 and 2 respectively in 2000. The France aired was used in the French dub by Karina Films, with the French voice cast, including Lucille Boulanger as Lucy, Vincent Ropion as Boris and Various, Claude Lombard as Giggles, Molly, Audrey and Various, Pierre Tessier as Tickles, Kevin and Various, Daniel Beretta as Nelson, Reginald, Victor, Snowbert, Herbert, Doctor Gordon and Various, Danièle Hazan as Georgina and Various and Jean-Claude Donda as Zed, Wally and Various. * The United Kingdom: CBBC, CBeebies and Sky Kids for the 3rd and the 4th seasons in 2008 and 2012. The United Kingdom airings were used in the British version by The Sound Company Ltd., with the voice cast, including Alice Hearing and Lara Wollington as Lucy, Adrienne Posta as Georgina, Giggles, Nathalie, Doris, Janet, Melanie, Isabel and Various, Anna Bentinck as Tickles, Molly, Audrey, Kevin, Julie and Various, Keith Wickham as Nelson, Victor and Various, Matt Wilkinson as Boris, Zed and Various, Bob Saker as Toby and Various and Dan Russell as Snowbert, Jazz and Various. ==References== ==Other websites== * * Author's website * Information on Millimages * * HuffPost TV Episode Guide * BBC Programme Information Category:1990s children's television series Category:2000s children's television series Category:1990s animated television series Category:2000s animated television series Category:1999 American television series debuts Category:2000 American television series endings Category:American children's television series Category:American animated television series Category:English-language television programs",
 "title": "64 Zoo Lane"
}