{
 "id": "940121",
 "text": "Derek Charke (; born 1974) is a Canadian classical composer and flutist. ==Career== Derek Charke has been working as a composer for film and television since the early 1990s. In that time he has written more than 100 film and television scores which have been broadcast worldwide. When at home in Toronto, Ontario, Derek was busy as a session player, arranger, producer and flutist which ultimately led to his work as a composer for film and television in 1994. The diversity of his craft offered him the opportunity to compose for a variety of programming including animation, documentaries, comedy and drama. In the animation world, he worked extensively with Danny Antonucci both while at 20th Century Fox and later when Antonucci started his own studio - a.k.a. Cartoon. It was for the studio that he composed the score for the animated series The Brothers Grunt that aired on MTV. Later, he wrote all of the music for another a.k.a. Cartoon production, Cartoon Network’s Ed, Edd n Eddy. Additionally, he has composed music for popular TV series including The Outer Limits (Showtime/SyFy), The Dead Zone (USA Network), Wildfire (ABC Family), These Arms of Mine (CBC) and Kink (Showcase), among several others. Patric Caird also has an extensive career in feature film composition. In 2000, his music for film garnered him a Genie Award (Canada's Oscar) for the Infinity Features film Here's to Life! with Kim Hunter, James Whitmore and Ossie Davis. His film credits also include the film Dead Heat with Kiefer Sutherland, Ann Marie Fleming's The French Guy (Park City Film Music Festival Gold Medal) and National Lampoon's Going the Distance among others. In 2014, Patric Caird composed the score for the Fox series Rake starring Greg Kinnear. Patric Caird continues to compose for film, television, theater and new media. In 2012, Derek Charke won the Juno Award for Classical Composition of the Year for his work, \"Sepia Fragments.\"2012 Juno Award Winners (Retrieved April 21, 2012) The following year Charke's work, \"Between the Shore and the Ships\" received an ECMA for Classical Composition of the Year.2013 ECMA Award Winners (Retrieved April 26, 2013) Derek's compositions increasingly pair electroacoustic elements—many of which are derived from environmental sounds—with acoustic instruments. Ecological sound as an artistic statement on environmental issues has become an impetus for many works, and his interest in the Arctic has like- wise played a role in many of his compositions. His music bridges a divide between this play of pure sound, collecting natural and environmental sound, and a continuation of the Western \"classical\" tradition—albeit with contemporary and popular influences.Derek Charke bio (Retrieved February 22, 2010) ==Education== Derek Charke earned his bachelor's degree in composition at the University of North Texas, a master's degree in composition from the Royal Academy of Music, a master's degree in flute and a doctorate degree in composition from the University at Buffalo. While at Buffalo he studied composition with David Felder and flute with Cheryl Gobbetti Hoffman. Previous composition teachers included Louis Andriessen, Steve Martland and Cindy McTee.Derek Charke Canadian Music Centre (Retrieved February 22, 2010) ==Teaching== Charke is an associate professor of music theory and composition at Acadia University School of Music in Nova Scotia, Canada. Charke is also co-director of the Acadia New Music Society, and he actively performs as both a soloist and new music improvisor on the flute. In addition to his responsibilities as a full professor at Acadia University, Charke is an associate composer of the Canadian Music Centre (CMC). ==Awards== To date, Charke has got many awards and commissions, including a BMI student composer award for his work Xynith, the Outstanding Undergraduate Award in Composition from the University of North Texas, and an honorable mention from the Kubik Prize for his composition What do the Birds Think? Charke has been commissioned by ensembles such as Duo Turgeon, the Kronos Quartet, the Toronto Symphony Orchestra, the Winnipeg Symphony Orchestra, and the St. Lawrence String Quartet. Dr. Charke and his wife currently live in Kentville, Nova Scotia.Dr. Derek Charke Acadia University School of Music (Retrieved February 22, 2010) ==Discography== *2010 – Sea to Sea (St. Lawrence String Quartet Centrediscs / Centredisques CD-CMCCD 16310) (Includes Sepia fragments) *2011 – A Canadian Music Sampler: Centrediscs 30 Years (Centrediscs / Centredisques CD-CMCCD 17311) (Includes Sepia fragments) *2012 – ...Between the Shore and the Ships... (Centrediscs / Centredisques CD-CMCCD 17912) (Includes Blizzard; Between the Shore and the Ships) *Anderson, Chenoa. Krishna's Flute. Brent Lee, Derek Charke, Ian Crutchley, Keith Hamel, John Oliver, & W.L. Altman. Earsay Productions, 2014. CD. *Charke, Derek. In Sonorous Falling Tones. Derek Charke (soloist) and WIRED! Ensemble. Mark Hopkins. Centrediscs, CD-CMCCD 23917, 2017. CD. *Charke, Derek., et al. Kitchen Party. Derek Charke & Mark Adam. Centrediscs, 2014. CD. *Charke, Derek. Live Wired. NBG Ensemble and Acadia University Wind Ensemble. Mark Hopkins. Canadian Music Centre Distribution Service, CD-ANMS 001, 2015. CD. *Charke, Derek. Tundra Songs. Tanya Tagaq & Kronos Quartet. Centrediscs, CD-CMCCD 21015, 2015. CD.http://musiccentre.ca/node/37652/recordings (Retrieved April 26, 2013) ==References== ==Other websites== * Official web page Category:1974 births Category:Canadian composers Category:Living people Category:Entertainers from Nova Scotia",
 "title": "Derek Charke"
}