{
 "id": "940226",
 "text": "The 1930 Women's World Games (Czech and Slovak III Ženské Světové Hry v Praze, French 3è Jeux Féminins Mondiaux ) were the third regular international Women's World Games, the tournament was held between September 6 - September 8Praha 1930 - III Ženské světové hry Czech Association for Olympic and Sport Philately, Retrieved 10 December 2013Rétrospective de l'athlétisme féminin, page 9 Sylvain Charlet, Amicale des Entraineurs d'Ile de France d'Athlétisme AEIFA, Retrieved 10 December 2013 at the Letná Stadium in Prague.Chronique de l'athlétisme féminin NordNet.fr, Retrieved 10 December 2013 The games were organized by the Fédération Sportive Féminine Internationale under Alice Milliat as a response to the IOC decision to include only a few women's events in the 1928 Olympic Games. The games attended an audience of 20,000 spectators. ==Opening ceremony== The tournament was opened with an olympic style ceremony on 6 September 1930 at the Letná Stadium. The ceremony was attended by 20,000 spectators. It was bad weather with rain during the ceremony. The opening ceremony started with the parade of nations where the seventeen nations walked into the stadium. United Kingdom led the way, followed by the other countries in order of the czech alphabet. The teams were welcomed by Svagrovsky, the third chairman of the Fédération Sportive Féminine Internationale. Then there was a speech by the first mayor of Prague. After the speaches, thousands of carrier pigeons were released. There was a dance performance by 2000 youngsters, with loud enthusiasm from the audience. ==Events== * * * * **Czech handball **Handball ;Demonstration sports * In a source of the Czech Association for Olympic and Sport Philately also the sports shooting (4 and 6mm rifle, shooting from a 6mm pistol), Kayak and Swedish canoe races are listed as sports of the Games. ==Participating nations== The games were attended by 200 participants from 17 nations. A special commemorative medal was issued for the participants.Participation badge Muzeum Sportu i Turystyki w Warszawie / Museum of Sports and Tourism, retrieved 24 October 2015 * * * * * * * * * (16) * (12) * (6) * * (details) (5) * * (10) * (2) * Next to the above listed nations, the United States competed in the basketball America Zone tournament but didn’t qualify for the final. ==References== ==Other websites== * Participation medal * Picture British team * Picture Canadian basketball team * Picture Czechoslovak team Category:1930s in women's sport Women's World Games Category:Prague Category:1930 in Europe Category:Multi-sport events Category:International sports competitions",
 "title": "1930 Women's World Games"
}