{
 "id": "940374",
 "text": "Nelleke “Nel” Dikshoorn-Stuij van den Herik with surname also written as Stuij van den Herik is a former Dutch volleyball player. She played with AMVJ, Amsterdam and the Netherlands women's national volleyball team. She was a player on the first Netherlands women's national volleyball team. She represented the Netherlands at the 1949 Women's European Volleyball Championship and 1951 Women's European Volleyball Championship. She has multiple times been praised for her good smashes. ==Biography== In the late 1940s main volleyball championships and leagues were born. Stuij van den Herik was a player on the early volleyball teams. In 1948 AMVJ became the first Dutch National Champion at the inaugural Dutch Volleyball League. Both AMVJ as the Dutch national team played against one of the United States women's national volleyball teams in their first intercontinental match ever. She participated at the 1949 Women's European Volleyball Championship, the inaugural European Volleyball Championships. As the national didn’t had at the time their own shirts, they borrowed the shirts of the national basketball team. Two years later she was also part of the team at the 1951 Women's European Volleyball Championship. After not playing for a while for AMVJ, she was drafted back into the volleyball team from December 1951. In the later years no main international championships held. During these years she competed with the national team at international invitation matches, including against Belgium in January 1953. and in June 1953 Due to an undesirable altitude at a training of the national team in 1953, she was suspended by the Dutch Volleyball Association for two years, just like six other women and five men. In may 1954 the conflict was resolved and the suspension was lifted. The same month she was called-up for the international match against Belgium. In October 1954 she played at the international volleyball tournament (Italy, France, Belgium and the Netherlands) in Paris. In November 1954 she played with the team against Belgium. In February 1955 she played against France. Her last call-up for was later in February 1955, in preparation for the match against Belgium. ==References== Category:Year of birth missing Category:Possibly living people Category:Dutch volleyball players Category:Sportspeople from North Holland Category:Sportswomen",
 "title": "Nelleke Stuy van der Herik"
}