{
 "id": "940340",
 "text": "NCS Group (also known as NCS Pte Ltd or \"NCS\", previously known as National Computer Systems) is a multinational information technology company headquartered in Singapore. NCS has over 12,000 staff located in more than 20 cities across Asia Pacific. == History == NCS was founded in 1981 when the Government of Singapore begin to strengthen information technology for both the public and private company. It was restructured as a commercial entity in 1996 and became a wholly owned subsidiary of SingTel Group in 1997. NCS adopted its current name on 1 November 2003.In 2002, SingTel Aeradio merged with NCS, retaining much of its identity as NCS Communications Engineering (NCS Comms Engg). In 2008, NCS bought 60% of local rival IT company's shares, Singapore Computer Systems, triggering a buyout of the company. In 2020, NCS acquires digital services 2359 Media. === Management === In 2005, Chong Yoke Sin became the Chief Executive Officer (CEO). She resigned in 2007 for personal reasons and Lim Eng took over as the CEO. Lim retired in 2010 and Chief Operating Officer Chia Wee Boon took over as CEO. On 1 August 2019, the Singtel Group appointed Ng Kuo Pin as the new CEO of NCS after Chia retired stepped down. == Incident == === Corrupt acts for business interests 2022 === On 18 March 2022, Goh Sia Choon Jeffrey (sole Director and shareholder of SC Integrated Engineering Pte Ltd at the material time), Goh Hai Chew Edward (Director of NCS Communications Engineering Pte Ltd at the material time), and Lee Wen Han (Project Director of NCS CE at the material time), were charged in Singapore court for corruption practice. In exchange for advancing the SCI’s business interest with NCS CE and its parent company, NCS Group, Jeffrey gave bribe totalling about $96,000 Singapore Dollars in the form of air tickets, hotel stay at Israel, cash money and electronic products to Wen Han and Edward over 19 times between 17 May 2018 and 19 November 2019. Jeffrey face 19 counts of corruptly giving bribe to Edward and Wen Han in exchange for business interests of SCI with NCS CE and NCS Group. Wen Han and Edward will each face 19 counts of conspiring to corruptly obtain bribe from Jeffrey as an exchange for boosting the business interests. === Corrupt acts for business recommendations 2020 === On 24 March 2020, Teo Joo Tye (Senior Technical Services Manager of NCS Group) and Ngiam Chee Chong (Director of Emersion IT Services Pte Ltd), were charged in Singapore court for corruption practice. Teo Joo Tye accepted bribery from Ngiam Chee Chong, in exchange for Teo to recommend Emersion as a subcontractor of NCS Group to perform IT infrastructure works, relating to 13 contracts that were awarded to Emersion. === NCS employee stealing at IMDA === Soh Jun Sheng, a Malaysian desktop engineer from NCS Group, stole technology equipment worthing more than $62,000 in Singapore Dollars from the Info-Communications Media Development Authority (IMDA) while working under NCS Group. When Soh was working at NCS Group, he was deployed to IMDA for providing IT support and issuing laptops to IMDA employees. He was also allowed to access a few secured rooms at IMDA's office. Soh owes the debt from gambling, and decided to steal technology equipment from IMDA and sell it at Carousell for profits to pay his gambling debt. While working in IMDA office, he stole 30 Lenovo ThinkPad laptops, 6 iPads, 6 Lenovo monitors, 17 docking stations, 80 Lenovo power adaptors, 25 laptop bags, and 32 Lenovo mice from the office. Soh's burglary act at IMDA was later discovered, an IT associate from NCS Group filed a police report and Soh was arrested on 4 June 2018. The police raided his home and office, and found numerous computer devices and accessories, some of which were belongs to Soh. The IMDA later file a lawsuit against Soh. On 18 February 2019, Soh pleded guilty to 9 counts of criminal act and was sentenced to 2 years of imprisonment. === Sex for contracts scandal === Esther Goh Tok Mui (Director of Business Development of NCS Pte Ltd at the time) was one of the women involved in the sex for contracts scandal with Peter Lim Sin Pang (commissioner of Singapore Civil Defence Force at the time). Between year 2010 and 2011, Esther Goh Tok Mui provided Lim Sin Pang sexual services or oral sex services in exchange for help in boosting the NCS Pte Ltd's business interests with the SCDF. Goh Tok Mui have sexual intercourse with Lim Sin Pang for a total of 7 times between April and November in 2011, at locations including a car park near to the Singapore Indoor Stadium and a HDB flat locate in Clementi. Peter Lim Sin Pang was caught and arrested on 4 January 2012 by the Corrupt Practices Investigation Bureau. He was later expelled by SCDF on 31 Aug 2013, and he was sentenced to 6 months of imprisonment for his corruption crime. The contract signed between SCDF and NCS were then reportedly investigated by the Ministry of Home Affairs. Because the incident had exposed, Goh Tok Mui left NCS Pte Ltd and it’s unknown if Goh was expelled or resigned. === CHAS computer system error === On 16 February 2019, the Singapore's Ministry of Health (MOH) released statement stating that there was an error in the computer system, managed by NCS Group, for the Community Health Assist Scheme (CHAS). The error miscalculated the amount of health care aids applicants could receive through means-testing their income information. Thus, around 1,300 people received lower aids and 6,400 people received higher aids. The first problem in a result of a CHAS card holder was detected on 24 September 2018 by MOH. NCS Group was informed quickly, which then consider the problem by infrequent network connection problems. Between 9 October 2018 and 2 November 2018, another 5 more error cases were detected and leading into a deeper investigation. In November 2018, NCS Pte Ltd traced the reason of problems to a software version issue used on a server used by the system. The found issue happened during a merging of the system to another government data center in September 2018. The software version issue was resolved to fix an unrelated slow performance issue on 10 October 2018. However, wrong results created between 18 September 2018 and 10 October 2018 stays. Corrections were then carried out by MOH and NCS Group to estimate the impact on the affected applicants. MOH would then work with grant scheme administrators and healthcare institutions to follow up with notifications and repayment to the affected applicants. MOH reportedly had the intention to recover costs and expenses due to this incident from NCS Group as allowed in the contract between them. === Workers protest at NCS Hub entrance === On 18 October 2022, 9 foreign workers blocked the main entrance of NCS Hub, the company's headquarter in Singapore, and holding up signs protesting against the contractor company they work under for owing salary. Some workers holding signs written \"欠債還錢\" (owe money pay money) and one of them holds \"上海忠記私人有限公司\" (Shanghai Chong Kee Pte Ltd). The Singapore Police Force received call for assistance at around 1.50pm and deploy police officers to NCS Hub's entrance, the Ministry of Manpower confirms received alerts to the incident by the police. The NCS Group told the Singapore news media, Lianhe Zaobao, that this incident has nothing to do with NCS Group and claimed that it's a conflict between NCS Group's main contractor Shanghai Chong Kee Pte Ltd, and sub- contractor Zhengda Corporation, and the 9 workers who protested are employees under Zhengda Corporation. According to Zhengda Corporation, Shanghai Chong Kee did not make payment for weeks. The latter has since issued two cheques. == References == Category:1981 establishments in Singapore",
 "title": "NCS Group"
}