{
 "id": "940477",
 "text": "Krokodeilos Kladas (, 1425–1490.) was a Greek military leader and rebel who fought in the medieval Peloponnese (called Morea) against the Ottoman Empire for the Republic of Venice during the 15th century..: \"This district seems to have been granted by Mohammed II, after the conquest of the Peloponnesus, as a military fief to Krokodeilos Kladas, a Greek guerrilla chief.\": \"Among the Greek captains serving under Venetian command was a certain Korkodeilos Kladas, a landowner of sufficient status to have been granted estates in Lakonia when Sultan Mehmet first overran the Peloponnese, as a reward for submitting to the Turks.\". ==Biography== Krokodeilos Kladas, whose family moved from Epirus to the Peloponnese,. was born in Koroni in 1425.. His father was the Greek military chief Theodore Kladas.. When Sultan Mehmed II conquered the Despotate of the Morea in 1460, Kladas surrendered Saint George Castle and was given in exchange Vardounia Castle in Mani, as well as the territory of Elos.. On 9 October 1480, Kladas led stratioti (Greek mercenary soldiers) from Koroni to attack Ottoman holdings in Mani. Both the Ottomans and the Venetians put a bounty on Kladas' head.. This rebellion was joined in December by stratioti from Nafplion led by Theodore Bua. An army sent by the Ottoman sultan was defeated between Passavas and Oitylo in February 1481. Later that month, a larger army under Mohammed Bey drove Kladas to Porto Kagio where he was boarded onto a Neapolitan galley abandoning his revolt. A peaceful settlement of the rebellion was negotiated by the Ottoman governor of the Morea and Venetian official Bartolomeo Minio. Meanwhile, Kladas went with a Neapolitan army to Ottoman-controlled Albania to aid an anti-Ottoman revolt there. In 1490, he was captured in battle near Monemvasia and flayed alive , quoting earlier testimony. Cited in . ==Family== The Kladas family is known in records from the Morea since 1296 when a \"Corcondille\" captured a castle controlled by the Franks for the Byzantine Greeks.. Members of the family donated to a monastery at Mystra in 1366 and 1375.; . A Krokodeilos appears in the satire of Mazaris as one of the rebels against the Byzantine emperor Manuel II in 1415.. The name \"Krokontēlos\" also appears on an inscribed donation to a church in Karytaina dated to the mid-1300s.. Krokodeilos Kladas and his brothers are respected in Venetian sources.For examples, see ; , passim. Also, Kladas was awarded Venetian knighthood and a gold robe just before the 1480 revolt.. ==References== ===Citations=== ===Sources=== * * * * * * * * * * * * * * * * * * * ==Further reading== * * Category:1425 births Category:1490 deaths Category:Greek people",
 "title": "Krokodeilos Kladas"
}