{
 "id": "94044",
 "text": "Redwall is a series of books written by Brian Jacques. The first book was written in 1986, and the people are all animals, like mice, rats, moles, otters, stoats, and weasels. The story is about an abbey called Redwall, and the animals that live there. Redwall has been made into an opera, and an animated TV series based on three of the novels (Redwall, Mattimeo, and Martin the Warrior), which first aired in 1999. The books are mainly aimed at older children. There were twenty-two novels and two picture books published. The twenty-second, and last novel, The Rogue Crew, was published on May 3, 2011, after Jacques' death. ==Overview== The book series does not happen in one particular timeframe. Instead, it is set in many different times in the history of the world of Redwall. Some of the books focus on characters who, in another book, are historical figures (e.g., Martin the Warrior's father, Luke, in The Legend of Luke). Usually, those books are set before Redwall Abbey was started. There is a timeline in the Redwall series, but it often places the books in a completely different order than the order they were written. However, there were two times when the novels were published in chronological order. ==Books== There are twenty-two books. * Redwall (1986) * Mossflower (1988) * Mattimeo (1989) * Mariel of Redwall (1991) * Salamandastron (1992) * Martin the Warrior (1993) * The Bellmaker (1994) * Outcast of Redwall (1995) * The Pearls of Lutra (1996) * The Long Patrol (1997) * Marlfox (1998) * The Legend of Luke (1999) * Lord Brocktree (2000) * The Taggerung (2001) * Triss (2002) * Loamhedge (2003) * Rakkety Tam (2004) * High Rhulain (2005) * Eulalia! (2007) * Doomwyte (2008) * The Sable Quean (2010) * The Rogue Crew (2011) In 2018, Netflix bought the rights to entire series. A film adaptation was announced with the script written by Patrick Mchale. Netflix is currently looking for a potential director for the film. Fans are currently suggesting Guillermo der laro to Direct the film. ==References==",
 "title": "Redwall"
}