{
 "id": "940474",
 "text": "The Calling is an American rock band from Los Angeles, California. It was formed in 1996 by lead singer and guitarist Alex Band and guitarist Aaron Kamin. The official lineup of the band in 2020 consisted of Band, Daniel Thomson and Travis Loafman. Thomson and Loafman both joined The Calling in 2016. They are best known for their hit single, \"Wherever You Will Go\", which topped the Adult Top 40 for 23 weeks, making it the second longest running number one in the chart’s history. It was later named the number one song of the decade of 2000s on the Adult Pop Charts by Billboard magazine. Their debut album Camino Palmero was released in July 2001 and was a commercial success. Their second album Two, was released in June 2004. Its lead single \"Our Lives\" was featured in the closing ceremonies of the 2004 Summer Olympics as well as the opening song of the 78th annual Academy Awards. The band broke up in 2005, but in 2013, The Calling reformed with a new lineup. ==History== ===Formation (1996–2000)=== The band was formed by Alex Band (lead vocals) and Aaron Kamin (lead guitar, backing vocals) when Kamin was dating Band's sister. Kamin and Band initially began jamming and writing songs in 1996, and began performing under the band name \"Generation Gap\" with a drummer who was twice their age. The band also included saxophonist Benny Golbin, giving the songs a more jazzy sound like the Dave Matthews Band. Eventually, Band and Kamin ditched the \"Gap\" lineup, and briefly switched their name to \"Next Door\".. They quickly found their own sound amongst radio rock acts of the early 21st century such as Matchbox Twenty, Third Eye Blind, Train, and Fastball. By 1999, Fair was impressed enough by the demos to sign them to a record deal with RCA. They changed their name to \"The Calling\", which reflected the band's sense of purpose. ===Camino Palmero and departures of Woolstenhulme, Mohler, and Wood (2001–2002)=== While the RCA deal was a huge boost, it also created a new problem for Band and Kamin. They had no permanent band. They had not done tours and built a fanbase. Fair worked intensely with Band and Kamin for over two years perfecting the debut album. Their first album was recorded from 1999–2001, with Sean Woolstenhulme (formerly with Lifehouse) (rhythm guitar), Billy Mohler (bass), and Nate Wood (drums). It was called Camino Palmero. It was issued in July 2001 and quickly became a hit. Its single, \"Wherever You Will Go\", which was named the No. 1 Adult Pop song of the decade by Billboard magazine. The song was featured prominently in the television series Smallville's first-season episode \"Metamorphosis\". It was also featured in the 2000 film Coyote Ugly with the group performing in the background in the first club scene. It was used in early trailers in 2001 for the Star Trek prequel series Enterprise. In an episode of the CBS television drama Cold Case, \"Frank's Best\", the song is played at the end of the episode. Camino Palmero ultimately sold more than five million copies worldwide and was certified gold in the United States. In June 2002, Woolstenhulme left The Calling. His replacement was Dino Meneghin. Mohler and Wood left in October 2002. In November 2003, former members Wood and Mohler sued Band, Kamin, and the group's management, accusing them of mismanagement, fraud, and asking for an audit of the money that was spent while they were in The Calling. They claimed that they were promised a share of the royalties and profits from touring and merchandise. Band and Kamin claimed that the two were not entitled to any of the royalties. ===Two and first breakup (2004–2005)=== In June 2004, the group returned with Two. The album had three singles and accompanying videos: \"Our Lives\", \"Things Will Go My Way\", and \"Anything\". However, Two had disappointing sales compared to their first album. After a lengthy world tour in support of the album, Kamin and Band decided to disband The Calling. They played a farewell show in Temecula, California on June 6, 2005. Alex then began pursuing a solo career and played occasional shows. ===Temporary reunion and second breakup (2013)=== On August 15, 2013, Alex Band reformed The Calling with new members. The band performed their comeback gig at Bally's Atlantic City on August 17. On August 18, Band was abducted by two men that robbed him, beat him severely, and dumped him on train tracks in Lapeer, Michigan. He was taken to an emergency room at a nearby hospital, where he was treated and released. After only a few shows, the group broke up again. ===Upcoming material (2016–present)=== In October 2016, The Calling reformed with a new lineup and performed in Manila, Philippines the following month. The Australian company \"Unbreakable Touring\" announced that the band were to perform in areas such as Adelaide, Sydney, Brisbane, Melbourne and Fremantle along with the rock band Juke Kartel and newcomer Mike Waters. This was later postponed due to visa issues. In July 2017 it was announced that The Calling would be joining Lifehouse as support acts for Live's Australian leg of their world reunion tour. Band said in an interview with Australian music website \"may the rock be with you\" in November 2017 that The Calling will be releasing new music soon. Whilst on tour in February 2020 Band spoke in a video interview presentation with Welsh podcast SteegCast, in the video Band speaks of his future music plans and talks of new material, including even at some point releasing orchestral workings of some of The Calling's best known songs. ==Musical influences== The band has cited that their influences include bands such as Pearl Jam, Bon Jovi, Live, Train, and U2. ==Band members== Current members * Alex Band - lead vocals, songwriter (1996–2005, 2013–present); rhythm guitar (2003–2005, 2013–present); bass (2002–2005, 2016–present) *Daniel Thomson - drums, percussion (2014–present) *Travis Loafman - lead guitar, backing vocals (2016–present) Current touring musicians *Cubbie Fink - bass, backing vocals (2016–present) *Ryan Levant - keyboards, backing vocals (2016–present) Former members *Aaron Kamin - lead guitar, songwriter (1996-2005) *Sean Woolstenhulme - rhythm guitar, backing vocals (1996-2002) *Billy Mohler - bass (1996-2002) *Nate Wood - drums, percussion, backing vocals (1996-2002) *Dino Meneghin - rhythm guitar (2002-2003) *Sean Kipe - lead guitar, backing vocals (2013) *Jake Fehres - bass (2013) *Art Pacheco - drums, percussion (2013) Former touring musicians *Kaveh Rastegar - bass (2004) *Corey Britz - bass, keyboards, backing vocals (2004-2005) *Justin Derrico - lead guitar (2004-2005) *Daniel Damico - rhythm guitar, keyboards, backing vocals (2004-2005) *Justin Meyer - drums, percussion (2004-2005) *Al Berry - bass (2016) Timeline ImageSize = width:800 height:auto barincrement: 20 PlotArea = left:150 bottom:100 top:0 right:20 Alignbars = justify DateFormat = mm/dd/yyyy Period = from:01/01/1996 till:12/31/2021 TimeAxis = orientation:horizontal format:yyyy Legend = orientation:vertical position:bottom columns:4 ScaleMinor = increment:1 start:1996 ScaleMajor = increment:2 start:1996 Colors = id:vocals value:red legend:Lead_vocals id:bvocals value:pink legend:Backing_vocals id:lguitar value:teal legend:Lead_guitar id:bass value:blue legend:Bass id:rguitar value:brightgreen legend:Rhythm_guitar id:drums value:orange legend:Drums,_percussion id:studio value:black legend:Studio_album LineData = layer:back color:studio at:07/10/2001 at:06/08/2004 BarData = bar:Alex text:\"Alex Band\" bar:Aaron text:\"Aaron Kamin\" bar:Sean1 text:\"Sean Kipe\" bar:Billy text:\"Billy Mohler\" bar:Jake text:\"Jake Fehres\" bar:Travis text:\"Travis Loafman\" bar:Sean2 text:\"Sean Woolstenhulme\" bar:Dino text:\"Dino Meneghin\" bar:Nate text:\"Nate Wood\" bar:Art text:\"Art Pacheco\" bar:Daniel2 text:\"Daniel Thomson\" PlotData= width:11 bar:Alex from:start till:06/06/2005 color:vocals bar:Alex from:06/01/2003 till:06/06/2005 color:rguitar width:3 bar:Alex from:06/01/2003 till:06/06/2005 color:bass width:7 bar:Alex from:10/01/2002 till:06/01/2003 color:bass width:3 bar:Alex from:08/17/2013 till:08/22/2013 color:vocals bar:Alex from:08/17/2013 till:08/22/2013 color:rguitar width:3 bar:Alex from:10/01/2016 till:end color:vocals bar:Alex from:10/01/2016 till:end color:rguitar width:3 bar:Alex from:10/01/2016 till:end color:bass width:7 bar:Aaron from:start till:06/06/2005 color:lguitar bar:Aaron from:start till:06/06/2005 color:bvocals width:3 bar:Sean1 from:08/17/2013 till:08/22/2013 color:lguitar bar:Sean2 from:start till:06/01/2002 color:rguitar bar:Dino from:06/01/2002 till:06/01/2003 color:rguitar bar:Billy from:start till:10/01/2002 color:bass bar:Jake from:08/17/2013 till:08/22/2013 color:bass bar:Travis from:10/01/2016 till:end color:lguitar bar:Travis from:10/01/2016 till:end color:bvocals width:3 bar:Nate from:start till:10/01/2002 color:drums bar:Art from:08/17/2013 till:08/22/2013 color:drums bar:Daniel2 from:10/01/2016 till:end color:drums ==Discography== ;Studio albums * Camino Palmero (2001) * Two (2004) ==Awards== Year Association Work Category Result 2002 Smash Hits Poll Winners Party Themselves Best Rock Act 2002 Smash Hits Poll Winners Party Themselves Best International Act 2002 Smash Hits Poll Winners Party Themselves Best Newcomer on Planet Pop 2002 MTV Europe Music Award Themselves Best New Act 2002 NRJ Music Award Themselves International Duo/Group of the Year 2002 Teen Choice Awards Themselves Choice Music: Breakout Artist 2002 \"Wherever You Will Go\" Choice Music: Love Song 2002 \"Adrienne\" Choice Music: Rock Track 2002 Billboard Music Awards Themselves Hot 100 Singles Duo/Group of the Year 2002 New Pop Artist of the Year Themselves 2002 Top Hot Adult Top 40 Artist Themselves 2002 \"Wherever You Will Go\" Top Adult Top 40 Track 2002 \"Wherever You Will Go\" Top Hot 100 Song 2002 \"Wherever You Will Go\" Top Hot 100 Airplay Track 2002 \"Wherever You Will Go\" Top 40 Track of the Year 2002 \"Wherever You Will Go\" MTV Video Music Brazil Best International Video 2003 \"Wherever You Will Go\" BDSCertified Spin Awards 500,000 Spins 2003 \"Wherever You Will Go\" BMI Pop Awards Award-Winning Song 2003 \"Wherever You Will Go\" APRA Music Awards Most Performed Foreign Work 2004 MTV Video Music Brazil \"Our Lives\" Best International Video ==References== ==Other websites== * Category:Musical groups established in 1996 Category:Musical groups disestablished in 2005 Category:Musical groups from Los Angeles Category:American rock bands Category:Alternative rock bands",
 "title": "The Calling"
}