{
 "id": "940404",
 "text": "On August 14, 2005, Helios Airways Flight 522 covered the route between Larnaca International Airport (Cyprus), and Ruzyně International Airport (Prague, Czech Republic), with a stopover in Athens (Greece). The aircraft, a Boeing 737, crashed on a mountain at 09:04 UTC on that day, near Grammatiko, 40 km north of Athens while on approach to Athens airport capital, killing all 115 passengers and 6 crew members on board. It is the deadliest aviation disaster in Greek history. == Flight crew== The flight captain was Hans-Jürgen Merten, a 59-year-old pilot had a total of 16,900 flight hours, 5,500 of them on Boeing 737s. The first officer was Pampos Charalambous, a 51-year-old Cypriot pilot who had flown exclusively on Helios for the last five years, accumulating 7,549 flight hours throughout his career, 3,991 of them on the Boeing 737. == Chronology == Date: 14 August 2005 All times Eastern European Summer Time (EEST) (UTC + 3) in 24 h format Time Event 09:00 Scheduled departure 09:07 Departs Larnaca International Airport 09:12 Cabin Altitude Warning sounds at 12,040 feet (3,670 m) 09:14 Pilots report air conditioning problem 09:20 Last contact with crew; Altitude is 28,900 feet (8,809 m) 09:23 Now at 34,000 feet (10,400 m); Probably on autopilot 09:37 Enters Athens flight information region; Nicosia ATC informs Athens ATC that radio contact has been lost. Aircraft begins circling Athens on autopilot 10:12–10:50 No response to radio calls from Athens ATC 10:45 Scheduled arrival in Athens 10:54 Athens Joint Rescue Coordination Centre alerted to possible renegade aircraft 11:05 Two F-16 fighters depart Nea Anchialos 11:24 Located by F-16s over Aegean island of Kea 11:32 Fighters see co-pilot slumped over, cabin oxygen deployed, no signs of terrorism 11:49 Fighters see an individual in the cockpit, apparently trying to regain control of aircraft 11:50 Left (#1) engine stops operating, presumably due to fuel depletion 11:54 CVR records a total of five mayday messages 12:00 Right (#2) engine stops operating 12:04 Aircraft crashes in mountains near Grammatiko, Greece ==Passengers== The bodies of 118 people were recovered. The passenger list included 93 adults and 22 children. The passengers comprised 103 Cypriot nationals and 12 Greek nationals. Nationality Passengers Crew Total Cyprus 103 4 107 Germany 0 1 1 Greece 12 1 13 Total 115 6 121 ==Cause== The cause of the accident was due to the fact that after takeoff, as the aircraft gained altitude, a failure when configuring the pressurization regulator caused the loss of consciousness of both the pilots and the passengers due to hypoxia, turning the aircraft into a \"ghost flight\" that was only kept flying by the operation of the autopilot. Finally, already over Greek territory, it hit a hill due to lack of fuel. ==Other accidents== The accident was the largest in the history of Greek aviation, along with one of the most serious in August 2005, a dark month for commercial aviation, which also featured, among others, the tragedies of West Caribbean Airways Flight 708 and TANS Perú Flight 204. ==References== ==Other websites== * * * Aircraft Incident Report of Helios Airways Flight HCY522 at Grammatiko, Greece on 14 August 2005 (published in English, released in November 2006) * Complete report of the official investigation by the Greek air safety investigations committee (published in Greek, released in October 2006). Category:Aviation accidents and incidents in 2005 Category:Aviation accidents and incidents in Europe Category:2000s in Greece",
 "title": "Helios Airways Flight 522"
}