{
 "id": "940563",
 "text": "Musi, or also known as Musai is an Austronesian language spoken by the Musi people. ==Speakers== Musi people are the indigenous ethnic group native to the Musi regions (the regencies of Musi Banyuasin, Musi Rawas, North Musi Rawas, and Banyuasin)— in the southeastern Sumatra, Indonesia. Musi language is the first language of Musi people who natively lives at the Babat Toman, the Sungai Lilin, the Bayung Lencir, and the Sekayu districts of Musi Banyuasin, also in the Banyuasin III district of Banyuasin Regency. ==Morphology== ===Word type=== The classification of words in Musi language is not based on the semantics (meaning), but on the basis of their structural characteristics, namely according to their distribution in phrases or sentences. Words that have the same distribution and behavior are grouped into one type of word. Based on the data obtained, words in the Musi language can be grouped into three groups, namely: # Nominal words # Adjectives # Particle words ===Word formation process=== Word formation in Musi language can occur in three ways, namely: # Affixation # Repetition or reduplication # Compounding or composites == Vowels == front central back close mid open In closed syllables, and are realized as and , respectively. == Consonants == bilabial alveolar postalv./ palatal velar glottal nasal stop voiceless voiced fricative voiceless voiced ~ approximant semivowel lateral ==Syntax== The analysis of the syntactic structure of Musi language is divided into two main parts, namely the syntactic structure and the sentence type. ===Syntax structure=== The syntactic structure or syntax of Musi language can be divided into four main groups, namely: # Modification structure # Predication structure # Complementation structure # Coordination structure The description of each of these structures will be clearly seen in the following descriptions. Each structure will be described in detail and the patterns will be illustrated through examples in Musi language's speech. ==Sample text== ===Universal Declaration of Human Rights=== The following texts are the Universal Declaration of Human Rights in Musi language along with the original declaration in English. English Musi Universal Declaration of Human Rights Article 1 All human beings are born free and equal in dignity and rights. They are endowed with reason and conscience and should act towards one another in a spirit of brotherhood. ===Parable of the Prodigal Son=== The following texts are the Parable of the Prodigal Son in Musi language along with its translation in English. Musi Translation Luke 15 11 11 Jesus continued: “There was a man who had two sons; 12 12 and the younger of them said to his father, ‘Father, give me the share of property that falls to me.‘ And he divided his living between them. 13 13 Not many days later, the younger son gathered all he had and took his journey into a far country, and there he squandered his property in loose living. 14 14 After he had spent everything, there was a severe famine in that whole country, and he began to be in need. 15 15 So he went and hired himself out to a citizen of that country, who sent him to his fields to feed pigs. 16 16 He longed to fill his stomach with the pods that the pigs were eating, but no one gave him anything. 17 17 “When he came to his senses, he said, ‘How many of my father’s hired servants have food to spare, and here I am starving to death! 18 18 I will set out and go back to my father and say to him: Father, I have sinned against heaven and against you. 19 19 I am no longer worthy to be called your son; make me like one of your hired servants.’ 20 20 So he got up and went to his father. “But while he was still a long way off, his father saw him and was filled with compassion for him; he ran to his son, threw his arms around him and kissed him. 21 21 “The son said to him, ‘Father, I have sinned against heaven and against you. I am no longer worthy to be called your son.’ 22 22 “But the father said to his servants, ‘Quick! Bring the best robe and put it on him. Put a ring on his finger and sandals on his feet. 23 23 Bring the fattened calf and kill it. Let’s have a feast and celebrate. 24 24 For this son of mine was dead and is alive again; he was lost and is found.’ So they began to celebrate. ===Simple conversation=== Here are examples of simple conversation in Musi language: Standard Musi Translation Hello, bro/sis! how are you? Did your parents at home? I am so happy to see you! Tomorrow is weekend, let's go on vacation! ==Bibliography== * * * * * * ==Related pages== * Musi Banyuasin Regency * Musi people * Musi Rawas Regency * Musi River ==References== ===Notes=== == Other websites == Category:Austronesian languages Category:Languages of Indonesia Category:Sumatra",
 "title": "Musi language"
}