{
 "id": "940517",
 "text": "Kohei Saito (born 31 January 1987) is a Japanese philosopher and researcher. He studies the history of economics. He is especially interested in Karl Marx and his philosophy and economics. He is an associate professor at the Graduate School of Arts and Sciences, University of Tokyo. He was one of the winners of 17th Japan Society for the Promotion of Science (JSPS) Prize for 2020. He won the award for his work on \"An Ecological Turn in Marxian Economics.\" His book, \"Marx in the Anthropocene : Towards the Idea of Degrowth Communism\" (人新世のマルクス：脱成長のコミュニズムへの道) became a surprise best-seller. It is especially popular with younger Japanese people. It is part of a new popularity for Marx in Japan. == Education == * He graduated from Shiba High School. Saito entered University of Tokyo and studied there for three months. He went to Weslyan University because he got a scholarship. * 2009 Graduated Weslyan University * 2012 Completed Masters Degree in Philosophy Free University of Berlin * 2014 Submitted \"Doctoral Thesis Natur gegen Kapital\" to the Department of Philosophy, Humboldt-Universität zu Berlin * 2015 Completed doctoral course in philosophy, Humboldt-Universität zu Berlin * Visiting Researcher at Brandenburg Academy of Sciences * 2016 Japan Society for the Promotion of Science Overseas Research Fellow at California University Santa Barbara Visiting Researcher * 2017 Associate Professor, Osaka City University * 2022 Associate Professor University of Tokyo == Writing == * Hegel and Capitalism, Andrew Buchwalter, Michalis Skomvoulis, Kohei Saito, Ardis B. Collins, Nicholas Mowad, Giorgio Cesarale, C. J. Pereira Di Salvo, Michael J. Thompson, Richard Dien Winfield, Lisa Herzog, Nathan Ross, Tony Smith, Louis Carré (SUNY Press, 2015) * The Unfinished System of Karl Marx: Critically Reading Capital as a Challenge for Our Times, Judith Dellheim, Frieder Otto Wolf, Riccardo Bellofiore, Fred Moseley, Joachim Bischoff, Kohei Saito, Georgios Daremas, Jan Toporowski, Patrick Bond, Michael Brie (Palgrave, 2018) * 2018 Karl Marx's Ecosocialism: Capital, Nature, and the Unfinished Critique of Political Economy, Received the Deutscher Memorial Award for Marxist Research. Monthly Review Press, 2017. At the age of 31, he was the youngest to win the prize. He also became the first Japanese to win the award. * 2021 New Book Award for his \"People's Theory of Capital\" (人新世の「資本論」)2021新書大賞 == Other websites == * 東京大学 大学院総合文化研究科・教養学部 齋藤 幸平 * * Researchmap: Kohei Saito ==References== Category:Marxists Category:Japanese philosophers Category:1987 births Category:Living people",
 "title": "Kohei Saito"
}