{
 "id": "940536",
 "text": "Hermina “Miep” van Zweeden-de Vries (born 3 April 1928) is a former Dutch volleyball player. She played with Boemerang, Amsterdam, and the Netherlands women's national volleyball team. In her last year, she played with RVC Rotterdam. She was a player on the earliest Netherlands women's national volleyball team. She represented the Netherlands at the 1949 Women's European Volleyball Championship and 1951 Women's European Volleyball Championship. She was captain of the national team. With Boemerang, she became multiple times national champion in 1951. With RVC she also became national champion in 1960. ==Biography== De Vries participated at the 1949 Women's European Volleyball Championship, the inaugural European Volleyball Championships. As the national didn’t have at the time on their own shirts, they borrowed the shirts of the national basketball team. Two years later she was also part of the team at the 1951 Women's European Volleyball Championship. In the later years no main international championships held. During these years she competed with the national team at international invitation matches, including against Belgium in January 1953 and in June 1953. Due to an undesirable altitude at a training of the national team in 1953, she was suspended by the Dutch Volleyball Association for two years, just like six other women and five men. In may 1954 the conflict was resolved and the suspension was lifted. The same month she was called-up for the international match against Belgium. In October 1954 she played at the international volleyball tournament (Italy, France, Belgium and the Netherlands) in Paris. In November 1954 she played her 15th international match in the match against Belgium. In February 1955 she played against France. Her last international match was in May 1955 against Belgium. After the birth of her third child in 1959 she played with RVC Rotterdam. With RVC, where she was one of the key players, she became Dutch Women's Volleyball League champion in 1960. ==Personal life== De Vries was born on 3 April 1928 in Amsterdam. She married to international volleyball player Jan van Zweeden (1925-2001) on 13 July 1954, who was the brother of the head coach of the women’s team Cees van Zweeden. They had three children. ==References== Category:1928 births Category:Possibly living people Category:Dutch volleyball players Category:Sportspeople from Amsterdam Category:Sportswomen",
 "title": "Miep de Vries"
}