{
 "id": "940755",
 "text": "Istvan Dobi (December 31 1898-November 24 1968) was the president of Hungary from 1948-1967 , he served a very long term. == Biography == Dobi was born from a poor family, he was born in SZONY. In his childhood, he worked as a day labourer. In 1916 came into contact with the agricultural workers' movement. After having fought in the First World War, he supported the Hungarian Soviet Republic. During the Hungarian–Romanian War of 1919 he was captured by the Romanians. Upon his release, he worked as a casual laborer and became active in the agricultural workers' union as well as in the Social Democratic Party of Hungary from the early 1920s. For this, he was put under police surveillance. In 1936 he switched to the Independent Smallholders' Party and became a functionary in the Kisalföld Chamber of Agriculture. Although he was not a member of the Communist Party, he was arrested several times during the regency of Miklós Horthy. == As head of state /post WWII == Dobi was appointed prime minister in 1948. He was the leader of the smallholders party , he gave up his job in 1952 to become general-secretary Due in part to his strong support of the Communists, he replaced fellow Smallholder Lajos Dinnyés as prime minister in December 1948, helping preside over the final stage of the Communists' complete takeover of the country. In short order, Dobi pushed out those elements of his party who were unwilling to do the Communists' bidding, leaving the party in the hands of fellow travelers like himself. This process was repeated with the other non-Communist parties as well. Thus, by the time of the 1949 elections, Hungary was effectively a one-party state. The 1949 elections formalized this status, with voters only having the option of approving or rejecting a Communist-dominated list. One of the first acts of the newly elected National Assembly was to approve a Soviet-style constitution, formally marking the onset of out-and-out Communist rule in Hungary. The Smallholders' Party was effectively disbanded. == Presidency == He was ceremonial president , he gave up his post as prime minister in 1952 cause MATYAS RAKOSI wanted that post for himself as general-secretary. He was awarded the Lenin Peace Prize in 1962 , he died in Budapest in 1968. Category:1898 births Category:1968 deaths Category:Presidents of Hungary",
 "title": "István Dobi"
}