{
 "id": "940837",
 "text": "Emmanuel Mormoris, or Manolis Mormoris (), was a 16th-century Greek military leader from Crete and politician in the Republic of Venice.. He led the Greek revolt of 1567–1572 in the region of Epirus controlled by the Ottoman Empire during the Ottoman-Venetian War of 1570-1573. ==Family and early years== Emmanuel Mormoris and his family, the Mormori or Murmuri, were Greeks from Nafplio in southern Greece.. The family is first mentioned in the 15th century when a rich landord in Nafplio named Emmanuel Mormori was married to a lady from the Bua family. When the Ottoman army conquered Nafplio in 1540, many Greeks fled and some members of the Mormoris family escaped to the island of Crete controlled by the Venetians. In the 16th century, members of the Mormori or Murmuri family were active in Nafplio fighting against the Ottoman Empire. Other members of the same family served the Republic of Venice in Crete. Mormoris himself praises the Greeks and his family members in their fight against the Ottomans. The father of Emmanuel Mormoris, Jacomo, was a cavaliere (\"cavalryman\") in the Venetian army and leader of the stratioti of Crete.. Before 1570, Emmanuel Mormoris was sent by the Venetian provveditore generale (\"governor-general\") of Crete to Sfakia, a region in western Crete, to convince some local rebel to surrender to Venetian rule. In 1568, he became leader of a cavalry unit of stratioti di nationi Greca (\"soldiers from the Greek nation\"). and was sent to the island of Corfu.. In 1571, he was accepted as member of the Cretan nobility (cretensi nobili) by the Venetian Senate.. ==Activity in Epirus== Mormoris was militarily active in the region of Epirus during the Ottoman-Venetian War of 1570-1573. The provveditore of Corfu, Sebastiano Venier, gave weapons and ammunition to the Greeks of Himara.. Mormoris proposed the capture of the fortress of Sopot located across the island of Corfu. Sopot was an important stronghold and the Greek groups that participated in Mormoris' operations included Greek stratioti from Corfu and Greeks from Himarra (called Himariotes).. After a successful siege on 7 June 1570, Mormoris was made commander of the fortress and the surrounding region. The capture of Sopot caused a revolt under his leadership resulting in the Ottomans being limited in the region to some military outposts. Mormoris, together with groups of Himariotes, then tried to destroy the Ottoman army as soon as possible. Afterwards, the anti-Ottoman movement spread to the regions of Argyrokastron, Delvina and Parga with the military help of the local Greek nobility and some stratioti, such as Petros Lantzas and Georgios Renesis.. Also, the people of Himara supported the rebellion and willingly surrendered to Venetian rule, while making use of the mountains of their homeland. Mormoris and his army attacked the fortress of Nivice and finally captured it in 1571... Meanwhile, an Ottoman fleet under admiral Uluz Ali approached the coast of Himara.. During his campaigns, Mormoris was helped by his brother Zorzis Mormoris who led units of stratioti in Margariti, Santa Maura (Lefkada), and Corfu. But Venice removed its support to the Greek rebels and so the rebels had to end their attack on Kardhiq and later Sopot Fortress was recaptured by the Ottomans in 1571. Emmanuel Mormoris was captured during the Ottoman attack, taken prisoner to Constantinople, and was freed in June 1575 during a prisoner exchange between the Venetians and Ottomans. ==Later activity== In 1583, Mormoris was placed in command of the Venetian infantry in Crete. He was involved in the construction of the Fortezza of Rethymno and the port at Rethymno.. In 1590-1591, he was sent to Italy to suppress the revolt of the lord of Montemarciano, Alfonso Picollomini, who was later executed in March 1591. In 1592, Mormoris returned to Crete to deal with rebellions in the island.. In 1593, he was placed in Kefallonia where he oversaw the building of the Venetian fortress in Asos. Mormoris was the author of military reports on the construction of fortifications in the Ionian islands and Crete.. ==References== ===Citations=== ===Sources=== * * * * * * * * * * * * * ==Further reading== * Category:16th-century people Category:Greek people",
 "title": "Emmanuel Mormoris"
}