{
 "id": "941099",
 "text": "And That Is Why . . . Manipuri Myths Retold is a book by L. Somi Roy. It is a children's book based on 12 stories from the Meitei mythology (Manipuri mythology) of the Meitei ethnicity of Manipur. The book is published by the Penguin Random House India under the Puffin Imprint. It was released by MP of Rajya Sabha and titular king Leishemba Sanajaoba at the Palace Compund, Imphal on the 21st June 2021. The stories are actually a collection of translated works from the original myths from the PuYas (Meitei language manuscripts) of ancient Manipur, rarely retold by people in the modern times. == Background == Late scholar Ningthoukhongjam Khelchandra introduced the ancient Meitei manuscripts to L. Somi Roy. L. Somi Roy was helped by Thokchom Thouyangba Meitei, a scholar of ancient manuscripts, the artist Sapha Yumnam, and Manipuri historian Wangam Somorjit, in the creation of the book project. The author revisited the treasures of the ancient mythological tales of the Meiteis of the pre-Hindu Manipur. The illustration artist Sapha Yumnam confirmed that the artworks found in the ancient Meitei manuscripts are \"primitive\" having many warm toned colors like red, brown and little usage of black, grey and blue. In respect for the ancient artistic tradition, Sapha Yumnam used the very colours in the illustration of the book to be as faithfully close to the originals. According to an interview with L. Somi Roy by the \"Times of India\", he said that the book was the first time for the Manipuri mythology being presented to the outside world and so, he was taking extra care. He further said that the stories are from a time before the arrival of Hinduism in Manipur. In the author's comment, every civilization doesn't have a mythology but Manipuri has its own mythology, and it's remarkable in consideration to the historical size of Manipur. He opined that Manipur's civilization is an Eastern oriented one while the rest of India is Western looking. In an interview with L. Somi Roy by the \"Indian Express\", he said: > \"We have high culture in dance and music, and even sports, but not much of a > visual tradition. It is these rare manuscripts that make up the heritage of > the Meitei community — and hence, need to be preserved as far as possible.\" == Works == The book contains 12 stories about mythical creatures, heroes, gods and goddesses from the ancient mythological tales of the Meiteis of ancient Manipur. Order Story Description 1st story And That is Why Man Is Creative And Can Think It is about the creation of woman before man on earth. 2nd story And That Is Why Man Gets Wrinkle And A Stoop In His Old Age It is about the lifespan of man being one hundred years. 3rd story And That Is Why The Deer Does Not Eat Rice It is about the story of goddess Phouoibi, the daughter of the sky God Soraren (Salailen). 4th story And That Is Why The Cat Buries His Poop It is about the story of the relationship between cat and tiger, where cat is the aunt to tiger. 5th story And That Is Why The Duck Does Not Brood Her Own Eggs It is about the story of kindness. 6th story And That Is Why The Weavers Of Khurkhul Make Silk It is about the story of the Khurkhul silk making an imprint on Manipur. 7th story And That Is Why A Magic Bamboo Grows On Karang Island It is about the story of the \"Khonggul Lirakpa\". It has the story of the slaying of the dragon Poubi Lai of the Loktak lake. 8th story And That Is Why The Pied Cuckoo Drinks Only Rainwater It is about the story of the community inclusiveness and also of a stubborn foreign pied cuckoo. 9th story And That Is Why The Manipuri Pony Is Sacred It is about the story of Samadon, a mythical flying horse. 10th story And That Is Why A Doll Is Worshipped In Kakching Village It is about the story of a little girl and her beloved doll. 11th story And That Is Why The Fire In The Village Of Andro Never Goes Out It is about the story of the connection between Manipur and foreign kingdoms like that of the Shan kingdom. 12th story And That Is Why Manipur Is The Birthplace Of Polo It is about the story of the birth of polo from Manipur. It also has the stories about Goddess Konthoujam Tampha Lairembi and the adventures of her son, God Khoriphaba. == References == Category:2021 books Category:Meitei mythology",
 "title": "And That Is Why . . . Manipuri Myths Retold"
}