{
 "id": "941225",
 "text": "María Eugenia Suárez Riveiro (Born, March 9, 1992) also known as Eugenia Suárez or China Suárez or Tatiana Suárez is an Argentine actress, singer, model, and fashion designer. ==Biography== She was born on March 9, 1992 in the city of Buenos Aires, the daughter of Guillermo Suárez and Marcela Riveiro Mitsumori. She has an older brother, Agustín. On the paternal side of her family, she has Spanish ancestry, from Galicia and Catalonia, while on her maternal side she has Japanese ancestry, from the Prefecture of Kōchi, since her maternal grandmother, Marta Mitsumori, is the daughter of Japanese immigrants born in Argentina. It is because of her Japanese roots that she is affectionately called \"China\", because according to Suárez herself, \"Japonesa\" was a very long nickname for her. In July 2013, she gave birth to her first daughter, Rufina Cabré Suárez, with her partner at the time, the Argentine actor Nicolás Cabré, In November 2013, she separated from the actor. In February 2018 she had her second daughter, Magnolia Vicuña Suárez, with Chilean actor Benjamín Vicuña. In July 2020 her third child was born, and second with Benjamín Vicuña, Amancio Vicuña Suárez. In August In 2021, Suárez broke off her relationship with the actor after six years. == Filmography == === Film === Year Title Character 2015 Abzurdah Cielo Latini 2016 Abril 2016 Sing Meena (voice dub) 2017 Los padecientes Paula Vanussi 2017 Sólo Se Vive Una Vez Flavia 2019 Así habló el cambista Graciela 2019 Pacto de fuga Lucía 2020 Hasta el cielo ida y vuelta === Television === Year Title Channel Character 2003 Rincón de luz Canal 9 Pía 2004–2005 Floricienta El Trece Paz 2005 Amor mio Telefe Violeta 2006 Amo de casa Canal 9 Catalina 2007–2010 Casi Ángeles Telefe Jazmín Romero 2011–2012 Los Unicos Canal 13 Sofía Reyes 2012 30 días juntos Cosmopolitan Leni 2013 Solamente vos El Trece Julieta Cousteau 2014 Camino al amor Telefe Pía Arriaga 2018 Sandro de América Telefe Susana Giménez 2018 Sitiados Telefe Margaret of Austria, Queen of Spain 2019 Argentina, tierra de amor y venganza El Trece Raquel Liberman 2019 Otros pecados El Trece Narrator 2019 El jardín de bronce HBO/El Trece Attorney 2019 Berko: el arte de callar FOX/TVN Journalist 2019 Tu parte del trato El Trece/TNT Police woman 2019 Héroes invisibles 2020 62: Historia de un mundial Nélida Lobato 2020 Solitarios anónimos 2022 Canta conmigo ahora eltrece Herself ==References== == Other websites == * https://www.twitter.com/chinasuarez * Category:1992 births Category:Living people Category:Argentine actors Category:Argentine models",
 "title": "María Eugenia Suárez"
}