{
 "id": "941307",
 "text": "The 1928 Germany–Netherlands women's athletics competition was an international women's athletics competition on 24 June 1928 in Lennep (near Elberfeld), Germany. The competition was the second international competition for Dutch women after the 1928 Belgium–Netherlands women's athletics competition three weeks earlier. The competition was organized as a \"try-out\" for the Olympics but moreover to gain international experience in preparation for the 1928 Summer Olympics. The competition was won by the Netherlands with 48 points versus Germany with 42 points. ==Background and preparations== For the first time, women's athletic events would be held at the 1928 Summer Olympics in Amsterdam, the Netherlands. As the Dutch women's did not have international experience the Royal Dutch Athletics Federation organized two international competition. Two international competitions that included the 5 Olympic events for women were organised to gain the international experience. The coach of the team was B. Verwaal. On 24 June, the day of the competition, the Dutch national athletes travelled by train to Oberhousen together with coach B. Verwaal and jury members J. M. Hardeman and D. J. de Vries. ==Competition format== The competition consisted of 5 events: 100 metres, 800 metres, 4x 100 metres relay, high jump and discus throw. The overall classification is a nation's classification. In the four individual events three athletes of each nation participated. The winner of the event received for the nation 6 points, the number 2 received 5 points, number 3 received 4 points etc. The nation winning the relay event wins 4 points and the other nation received 2 points. For the overall classication all points from each country are added together. ==Entrants== The Twelve Dutch athlethes were selected by the Royal Dutch Athletics Federation and announced ahead of the competition. Netherlands Naam Club Event Lies Aengenendt Hygiea, The Hague 100 m Lies Aengenendt Hygiea, The Hague 4x 100 metres relay Rie Briejer Brünhilde, Leiden 100 m Rie Briejer Brünhilde, Leiden 4x 100 metres relay Yvonne Buisma Aalsmeer High jump Bets Dekens Eclecta, Groningen High jump Bets Dekens Eclecta, Groningen Discus throw Mien Duchateau te Werve, The Hague 800 m Lien Gisolf Hygiea, The Hague High jump Nettie Grooss Hygiea, The Hague 100 m Nettie Grooss Hygiea, The Hague 4x 100 metres relay Bets ter Horst AV Twenthe 4x 100 metres relay Jeanne van Kesteren 800 m Jo Mallon Quick, Gouda 800 m Lena Michaëlis te Werve, The Hague Discus throw Nici Mür Hygiea, The Hague Discus throw Germany Naam Club Event Kathe Erfling SV Duisburg 100 m Kathe Erfling SV Duisburg 4x 100 metres relay Fuseler Discus throw M. Hausmann 100 m M. Hausmann 4x 100 metres relay Margarete Hermann 800 m Grete Heublein Discus throw Horchler High jump Hilde Krewett Discus throw Louise Müller 800 m Felicitas Schlarp Post SV Köln 100 m Felicitas Schlarp Post SV Köln 4x 100 metres relay Elisabeth Weck SV Solingen High jump Weiszgerber High jump Elfriede Wever 800 m Elfriede Wever 4x 100 metres relay The competition had Dutch and German jury members including from the Netherlands D. J. de Vries and J. M. Hardeman. ==Competition== The competition was opened with a presentation of the teams followed with speaches of the mayor of Lennep, representatives of the Westdeutscher Spiel-Verband and a reply of D. J. de Vries. ===100 metres=== There was a head wind during the 100 metres. Just as at the 1928 Belgium–Netherlands women's athletics competition, the three Dutchwomen won the event. Now with Nettie Grooss, who had in bad start in the Belgian competition, in first place. In different sources the places of German women are in different positions. 100 m results (headwind) Place Athlete Time Points 1 14 sec. 6 2 5 3 4 4-6 3 4-6 2 4-6 1 Points (100 m) Nation Points 6 15 ===800 metres=== The 800 metres event was won by German Elfriede Werner. The Dutch Jo Mallon who finished second also recieived tribute in the newspaper about her time. 800 m results Place Athlete Time Points 1 2:34.8 6 2 2:37.4 5 3 4 4 3 5 2 6 1 Points (800 m) Nation Points 11 10 ===High jump=== World champion Lien Gisolf won the high jump event after jumping 1.45 metres. After this result the high jump event stopped, while Gisolf might have been able to jump higher. High jump results Place Athlete Height Points 1 1.55 6 2 1.45 5 3 1.40 3 3 1.40 3 3 1.40 3 6 1.35 1 Points (high jump) Nation Points 9 12 ===Discus throw=== Grete Heublein won the discus throw event ahead of Hilde Krewett and Lena Michaëlis. Different newspapers lists different distances. Below are the results listed of newspaper Het Vaderland, as in other sources the distance of the 6th place is further compared to the 5th place and so unlikely to be correct. Discus throw results Place Athlete Distance Points 1 33.68 6 2 30.36 5 3 26.46 4 4 23.63 3 5 23.40 2 6 23.03 1 Points (discus throw) Nation Points 14 7 ===4x 100 metres relay=== 4x 100 metres relay Place Team Time Points 1 Bets ter Horst Lies Aengenendt Rie Briejer Nettie Grooss 51.4 sec. 4 2 Elfriede Wever M. Hausmann Kathe Erfling Felicitas Schlarp + 4-5 m. 2 ==Overall classification== Rank Athlete Points 100m 800m HJ DT Rel 1 48 15 10 12 7 4 1 42 6 11 9 14 2 ==References== Category:1928 in women's athletics Category:Sport in the Netherlands Category:Sport in Germany Category:1928 in Europe Category:1920s in Germany",
 "title": "1928 Germany–Netherlands women's athletics competition"
}