{
 "id": "941511",
 "text": "Dora Assink-Wevers (born 1900s) was a Dutch track and field athlete specialized in the discus throw. She was a member of AV Twenthe and the national team. She was the national record holder and national champion. She represented the Netherlands at international competitions. ==Career== ===Early years and training=== In the 1920s Wevers became a member of Hercules-Hebe, initially doing gymnastics but also started competing in athletics. She once one won the club championships in both gymnastics and athletics. Because she fell in love with discus throwing she specialized in it. However, in her era there were no athletic trainers with expertise in discus throw. She got advice by multiple people. She even held a period the discus at her back while throwing because someone told her that would be the best technique. Before a main competition she went with her father to a farmer's pasture to throw duscus. Her father kept getting the discus. Besides of that she trained with boys of the “Enschedese Boy” at Deppenbroek. ===Career highlights=== On 1 September 1929 she broke the national record in discus throw held by Lena Michaelis with a distance of 31.71 metres. She became 1930 national champion in Amsterdam, and broke at these championship her national record again with 33.86 metres. In July 1931 her record was broken by Cor Pels. Assink set her personal record to 34.14 in 1934. This was not a national record, but it was the record of Twente. It took almost 29 year before this record of Twente was broken by Margriet de Schip. As part of the National Team, Wevers represented between 1929 and 1933 the Netherlands at four tournaments, including at the 1930 Women's World Games. She also went with the ENDAT to the international competition in Brussels. She throw there further than the national record. However, because it was outside a match of the national association, it was never recognized as an official national record. ===Post-career involvement=== In 1959 the district Twente of the K.N.A.U. celebrated their 40th anniversary. For this occasion, a reunion was organized with Assink-Wevers as the secretary of the reunion committee. ==Personal life== Assink was hairdresser and had her own studio. Assink married to Gerrit Assink and they lived in Enschede. They got a son Herman Johan on 23 April 1941. She was also a certified seamstress. In March 1942, during World War II, she organized lessons for women in making clothes. ==References== Category:Year of birth missing Category:Year of death missing Category:Twente Category:Dutch discus throwers Category:1900s births",
 "title": "Dora Wevers"
}