{
 "id": "941504",
 "text": "Büyükyurt is a village in Nazımiye district of Tunceli (Dersim), Turkey. == History == The old name of the village is Hakis.T.C İçişleri Bakanlığı İller İdaresi Genel Müdürlüğü (1968). \"Köylerimiz\". p. 112. In the village, which is named Hakis in the records of the 16th century; only non-Muslims lived in 67 households in 1518 and 135 households in 1541. In the village at the beginning of the 20th century; there were 220 Armenian and 960 Kurdish population.Հայաստանի և հարակից շրջանների տեղանունների բառարան, հտ 3, էջ 299. \"20-րդ դ մկվբին ուներ 220 Հայ և 960 քուրդ բնա- կիլ:\" [Dictionary of place names of Armenia and neighboring regions, vol. 3, p. 299. \"In the 20th century, there were 220 Armenian and 960 Kurdish residents.\"] The settlement, which was a nâhiye since the records of 1912, maintained its position as a nâhiye until 1936.Sezen, Tahir (2017). \"Osmanlı Yer Adları\" (PDF). Devlet Arşivleri Genel Müdürlüğü, 26. p. 141. In 1935, Hakis was recorded as a connected of Nazimiye kaza of Elâziz province.Türkiye Cumhuriyeti Başbakanlık İstatistik Genel Direktörlüğü (1935). \"Genel Nüfus Sayımı\". p. 160 Although the old name of the village \"Hakis\" was changed, it was recorded as \"Büyükyurt (Hakis)\" for a while.T.C Başbakanlık Devlet İstatistik Enstitüsü (1960). \"Genel Nüfus Sayımı\". p. 551.T.C Başbakanlık Devlet İstatistik Enstitüsü (1980). \"Genel Nüfus Sayımı\". p. 488 (5). In the 1960 census, 742 people were recorded, 340 males and 402 females in village. According to one data, the village was the largest village in Dersim before the villages were evacuated. Kizilbash who speak Kirmanckî and Armenians live in the village and the sons of the two peoples \"lived together as brothers\" for centuries.\"Xakis–Büyükyurt Sizi Çağırıyor\", Özgür Dersim gazetesi, 2010: \"Köyler boşaltılmadan evvel Dersim'in en büyük köyümüş. Köyde Kırmancki konuşan Kızılbaşlar ile Ermeniler yaşamaktalar. İki halkın evlatları yüzyıllardır kardeşçe beraber yaşamışlar.\" == References == ==Notes== == Sources == * Category:Villages in Turkey Category:Tunceli Province",
 "title": "Büyükyurt"
}