{
 "id": "941586",
 "text": "use both this parameter and |birth_date to display the person's date of birth, date of death, and age at death) --> | death_place = | death_cause = | body_discovered = | resting_place = | resting_place_coordinates = | burial_place = | burial_coordinates = | monuments = | nationality = Indian | other_names = Elangbam Bondina | siglum = | citizenship = Indian | education = PhD in English literature | alma_mater = North Eastern Hill University (NEHU), Shillong | occupation = artist, author, painter, poet, | years_active = | era = | employer = | organization = | agent = | known_for = \"Between the Poet and Her Pencil\" | notable_works = \"Between the Poet and Her Pencil\" | style = | height = | television = | title = | term = | predecessor = | successor = | party = | otherparty = | movement = | opponents = | boards = | criminal_charges = | criminal_penalty = | criminal_status = | spouse = | partner = | children = | parents = | mother = | father = | relatives = | family = Elangbam | callsign = | awards = * Winner’s title in the Varsity Week | website = | module = | module2 = | module3 = | module4 = | module5 = | module6 = | signature = | signature_size = | signature_alt = | footnotes = }} Bondina Elangbam is an Indian writer, poet and artist from Manipur. Among her comprehensive comparative analytical works, \"Is the Homosexual an Invisible Being? 'Comrade Love' in the Select Fiction of the Rohinton Mistry and Amitav Ghosh\" is a notable one. Besides being a writer, Elangbam is becoming a matter of inspiration to many other artists and writers, including Bollywood actress Kangana Ranaut as well as Dr Joshiya Kh. == Early life and career == Bondina Elangbam was born in Imphal, Manipur. She grew up inheriting both the Meitei and Mao cultural heritages from her two parents. Her cross cultural bondings are seen to be reflected in her poetic works. Since childhood, Elangbam has a passion for painting, writing short stories and poems. Her first publication of poetry is the \"Between the Poet and Her Pencil\" in Mumbai on 19 December 2016. The forwarding of the poetry was done by Bollywood actress Kangana Ranaut, who is her childhood school friend. Bondina Elangbam's book \"Between the Poet and Her Pencil\" was released at the \"Manipur Press Club\" on the 9th of January, 2017 by ABOK Publishing House. In an exclusive interview with Bondina Elangbam by the \"The Morung Express\", when asked how she connected the two fields of being a poet and a painter, she said, > \"See, my poems are about life and the various occurrence one experiences in > life. My painting again is about the varied elements in life, the different > emotions and various other aspects of life. Life in its essence connects the > two and in one or the other way it is intertwined.\" == Life with Kangana Ranaut == Bondina Elangbam and Kangana Ranaut were classmates, roommates as well as schoolmates in their school life at a high school at DAV School sector 15 in Chandigarh. Bondina was studying in the Fine Arts stream while Kangana in the Science stream. According to a forwarding by Kangana Ranaut about Bondina Elangbam, she described Bondina was a dainty, waif- like vision with thick long blue-black hair hanging below her waist when seen for the first time in her life. Kangana said Bondina’s work was true to her inherent impulses and instincts. She pointed out the most beguiling aspect of Bondina's personality as the fact that Bondina never ceases to surprise anyone as she had either brood or laugh uncontrollably, avoided eye contact or had fierce glances, slept endlessly or worked relentlessly. Since childhood, Kangana was intensely fond of Hindi-Urdu poetry. Her area of interests was found to be weird for others (friends) except for Bondina Elangbam. Kangana used to translate the poems (shaayaris) for Bondina. Though many words and complex thoughts were often diluted or lost in translations, both Kangana and Bondina had a particular relationship with poetry. When Kangana and Bondina were very close to each other, Kangana noticed about the crucial differences between their educational choices, science and arts. Later, Kangana found out that she was probably not on the right career path. In her forewordings, Kangana exposed that Bondina had seduced the closet artist in her and Bondina played a very important role in influencing her future career decisions and she continued to do so. After their school life, they drifted away and met each other again when Kangana Ranaut was promoting Tanu Weds Manu Returns in Chandigarh. The two met at their school. It was when Kangana Ranaut got to know that Bondina was pursuing arts, poetry and writing. Bondina sent Kangana some of her works. Then, Kangana offered to write a foreword for Bondina's book. == Awards and honours == * In the year 2010, Bondina Elangbam's poem, \"My Fear\" won the \"Winner’s title in the Varsity Week\" of North Eastern Hill University (NEHU), Shillong. * Bondina Elangbam was awarded the Doctorate degree in English literature from the North Eastern Hill University (NEHU), Shillong. == References == == Other websites == * * * Category:Meitei people Category:Living people Category:Year of birth missing (living people) Category:21st-century Indian poets Category:Indian artists",
 "title": "Bondina Elangbam"
}