{
 "id": "94150",
 "text": "Zionism is a movement for creating and developing a Jewish homeland in the Land of Israel, or Palestine, * * * * * based on self-determination. * * * * The modern movement started in 19th-century Europe as a reaction to the systemic antisemitism, particularly the persecution of Jews since the Roman times, in Europe. ==Overview== Zionism has had many different varieties that all shared the goal of creating a homeland for the Jewish People. The dominant variety at first was political Zionism, led by Theodor Herzl, but it later lost ground to the socialist Labor Zionism. Zionism resulted in the creation of the State of Israel, with David Ben-Gurion as the founder and first prime minister. The earliest Israeli citizens were mostly Holocaust survivors. ==History== ===Political Zionism=== The word Zionism saw its first use in 1890. It comes from Zion, meaning Jerusalem, though it can also symbolically mean the Land of Israel as a whole. Jewish people at the time lived as minority groups among other nations all across the world, in what was called the diaspora. ====Background==== In the early 19th century, assimilation and liberation were popular ideas among Jews in western Europe. However, in the late 19th century anti-Semitism became a bigger threat, with the 1881 Russian pogroms and the Dreyfus affair in France. This caused some Jewish thinkers to lose faith in the idea of ever being accepted in gentile societies. One of these thinkers was Theodor Herzl, who is often considered the father of modern Political Zionism. ====Theodor Herzl==== In his book Der Judenstaat (\"The Jewish State\"), Theodor Herzl wrote that the distinct status of Jews neither can, nor should, be changed. Instead he believed that antisemitism could be stopped by making the Jewish people a nation like any other, through giving them their own land. At the time there were multiple territories up for consideration, the most important being Argentina and Palestine. Herzl argues in favor of Palestine, seeing it as more attractive to his fellow Jews due to its status as their ancestral homeland from where they had been expelled repeatedly and struggled to survive under several empires and centuries of Arabization. ====Key ideas==== Political Zionism was a secular movement and it was out of pragmatic considerations, rather than religious beliefs, that Palestine was chosen. Herzl convened the First Zionist Congress in 1897. There the Basel Program was adopted, supporting the reestablishment of Jewish homeland in the Land of Israel. The World Zionist Organization (WZO) was created at the congress to support this goal. There were many more congresses after this, and at the fifth Zionist Congress in 1901 the Jewish National Fund was established with the goal of purchasing land in Palestine. ====In practice==== Political Zionism wanted to work with the established powers to get a publicly recognized and legally assured homeland. Palestine was colonized by the Ottoman Empire, but Herzl's attempts to get support from the Ottomans failed, causing him to turn to European powers. Herzl negotiated with British and Russian officials to use their influence to get official support for a Jewish homeland in Palestine, but to no avail. In 1903 the British offered Herzl a Jewish homeland in Uganda instead, but this was eventually rejected by the Zionist congress. ===Balfour Declaration=== Only during World War I did the Zionist movement get the backing they had sought. In 1917, the British signed the Balfour Declaration, which declared that \"the establishment in Palestine of a national home for the Jewish people [was favored].\" Part of the British motivation for signing was consolidating Jewish diaspora's support for the Allied war effort against Nazi Germany, which was carrying out the Holocaust. After the war, the British Empire took control of Palestine and administered it as their own colony, the Mandate of Palestine, when the cooperation between the Zionist movement and the British continued, despite the presence of tensions. The alliance would fall apart right before World War II. ===Labor Zionism=== ====Background==== Jewish migration into Palestine began after the pogroms of 1881 with the Hibbat Zion movement. However, even when they later joined forces with the Zionist congress it remained a small movement as most Jewish migrants went to the United States (US). Merely 3% of the Jews fleeing Eastern Europe between 1881 and World War I's outbreak went to Palestine. In the first wave of migration, known as the first aliyah, the Jewish immigrants founded agricultural colonies called the moshavot. These settlements were poor, the immigrants thus turned to other sponsors for help, who funded the development of other systems. ====Plantations==== The farms were turned into wine and citrus plantations based on the model of French Algeria, where they employed mostly cheaper Palestinian labor. Jewish workers had to compete with Palestinian workers, which lowered their wages. The immigrants of the second aliyah of 1905 included many socialists. They thought that they needed higher wages for the Jewish workers to attract immigrants for the Zionist project. They wanted a \"conquest of labor\", fighting the landowners for better working conditions, but also trying to exclude Arab workers from these jobs to give them to Jewish workers. ====Kibbutzim==== This was the beginning of Labor Zionism, which would overtake Political Zionism as the dominant variety after World War I. Labor Zionism was influenced by socialist ideals, and believed that a strong Jewish working class was necessary for a Jewish state. They established farms called kibbutzim where all the workers collectively owned the land. In 1920, they formed the Histadrut, a trade union that eventually gained control of large sectors of the economy, becoming one of the largest employers for Jewish workers. The secretary of the Histadrut, David Ben-Gurion, became the unofficial leader of the Zionist movement in 1935 when he became chairman of the Jewish Agency. In 1948 he declared the establishment of a Jewish State in the Land of Israel and became Israel's first prime minister. ==Revisionist Zionism== Another strand of Zionism was led by assimilated Russian Jew Ze'ev Jabotinsky, who emphasized self-determination by armed force. He founded the Jewish paramilitary Haganah, which became part of the Israel Defense Forces (IDF) after the re-established State of Israel won the 10-month first Arab–Israeli War in March 1949 by defeating the united Arab states' armies, * * * * * which had invaded Israel on the second day of her independence. * * * * * Over the decades, followers of Revisionist Zionism evolved into the Israeli right, which include the parties Likud, Otzma Yehudit, United Torah Judaism etc. ==Critique== Some Zionists are accused of believing that Israel is entitled to the West Bank and Gaza Strip, while most Zionists support a two-state solution where Israel and Palestine are separate countries co-existing peacefully. The entire region is the subject of the Israeli–Palestinian conflict. Out of the conflict and segregation in Palestine, the African Charter on Human and Peoples' Rights of African Union accuses Zionism of \"human rights violation, apartheid and colonialism\".African Charter of Human and People's Rights, Preamble ===International Holocaust Remembrance Alliance (IHRA)=== Under the Working Definition of Antisemitism IHRA Working Definition of Antisemitism : * Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion. * Making mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions. * Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews. * Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust). * Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust. * Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations. * Denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor. * Applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation. * Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterize Israel or Israelis. * Drawing comparisons of contemporary Israeli policy to that of the Nazis. * Holding Jews collectively responsible for actions of the state of Israel. of the International Holocaust Remembrance Alliance (IHRA), an intergovernmental organization on the history of antisemitism and the Holocaust, anti-Zionism in the sense of opposing the right of Jews to self-determination in their ancestral homeland is a form of antisemitism. * * * IHRA's definition of antisemitism has been adopted by the World Jewish Congress, American Jewish Committee, European Commission,Primary executive arm of the European Union (EU). British Labour Party, British Liberal Democrats etc. In a meeting of the Federal Board of the Liberal Democrats on 4 September 2018 the Federal Board confirmed by majority: * that the Liberal Democrats would formally adopted, and would continue to use, the International Holocaust Remembrance Alliance (“IHRA”) Working Definition of Antisemitism (the “Antisemitism Definition”) including all its worked examples; and * although not formally adopted, in interpreting the Antisemitism Definition it is helpful to consider the additional clarifications to the Definition set out by the Home Affairs Select Committee in their 2016 Inquiry into Antisemitism Report (the “HASC Report Clarifications”). ==Related pages== * Kibbutz * The Holocaust * Menachem Begin * David Ben-Gurion * Double genocide theory ==References== Category:Jewish people Category:Asia Category:Judaism Category:History Category:Politics Category:West Asia Category:Middle East Category:19th century Category:20th century Category:21st century",
 "title": "Zionism"
}