{
 "id": "941537",
 "text": "TVG2 (formerly HRTV) is an American sports-oriented digital cable and satellite television network. ==List of HRTV commentators== Scott Hazelton, Kurt Hoover, Christina Blacker, Matt Carothers, Todd Schrupp, Dave Weaver, Mike Joyce, Rich Perloff, Simon Bray, Donna Brothers, Nick Hines, Frank Miramahdi, Tom Cassidy, Joaquin Jaime, Paul Lo Duca, Peter Lurie, and Britney Eurton. ==Programming== ===Racing programming=== Programming on HRTV includes regular and special stakes races from Santa Anita Park, Churchill Downs, Gulfstream Park, Arlington Park, Pimlico Race Course, NYRA, and numerous other top U.S. and international racetracks. * Inside Information * Clubhouse Turn * Drive Time * Horse Racing All-Access * Horseracing Today * International Racing * Morning Line * Pick 6 Central * Race Night * Racing Coast to Coast * Starting Gate * Television Games * The Quarters * The Works * Trackside Live * TVG Classic ===English programming=== HRTV also features events in the world of English riding, such as show jumping, dressage, eventing and carriage driving. Coverage includes the Aachen World Horse Festival, FEI World Cup Jumping, Dressage events, and the Horse Shows in the Sun (HITS) $1,000,000 Grand Prix Triple Crown of Show jumping. * CHIO Aachen * For the Love of Horses * Polo Masters * Alltech National Horse Show * HITS AIG $1 Million Grand Prix * HITS Great American $1 Million Grand Prix * HITS Saugerties Zoetis $1 Million Grand Prix * The Hampton Classic * Ridin' High America * A Rider's Story * The Saddle Club ===Western Programming=== Western horse- related programming includes rodeos sanctioned by the Professional Rodeo Cowboys Association, National Reining Horse Association events from around the world, US- based Cutting, Roping, and Barrel Racing competitions, and programming on recreational activities such as trail riding. * Ridin' Horses with Kerry Kuhn * Riding to Win * Join Up * Palm Partnership Training * Charles Wilhelm Ultimate Foundation Horsemanship * America's Favorite Trail Horse * Diamonds & Dirt * Richard Winters Horsemanship * Cactus Reining Classic ==References== Category:American television networks",
 "title": "TVG2"
}