{
 "id": "941647",
 "text": "Santa Margherita Ligure is a comune in the Metropolitan City of Genoa in Liguria in Italy. It is a popular tourist attraction. == History == There may have been a Settlement in what is now Santa Margherita since Roman Times although that isn't known for sure. In 641, a places known as Pescino was destroyed by Rothari and again by the Saracens in the 10th Century. Later it was a fief of the Fieschi family until 1229, when it was taken over by the Republic of Genoa. In 1432, it was attacked by the fleet of Venice and in 1549, as well as Rapallo, by the Turgut. In 1813, under the Napoleonic domination, the two burghs of Pescino and Corte became Porto Napoleone. Two years later it was taken over by the Kingdom of Sardinia as the commune of Santa Margherita Ligure. In 1861, it became part of the recently formed Kingdom of Italy. After getting rail links in the 20th Century, Santa Margherita became a toursit attraction after the second world war. == Geography == Santa Margherita Ligure is located on the Riviera di Levante in the innermost part of the Gulf of Tigullio. The town has developed along two main inlets. To the west of the town, towards Genoa, there are many hills covered with pine and chestnut trees on the high ground and olive groves lower down. On the slopes are villas and gardens overlooking the so-called 'Dolphin Coast'(Costa del Delfini), which links the town to Portofino. The town is a popular tourist attraction on the Riviera di Levante. Part of the comunal territory of Santa Margherita Ligure is part of the Portofino Regional Natural Park, while the stretch of water in front of the Portofino promontory is also included in the Portofino Marine Protected Area; both bodies are based in the coastal town. === Outlying Districts (Frazioni) === * Nozarego * San Lorenzo Della Costa * Paraggi * Pedale (Partially Recognised) Paraggi was a small village of fishermen and millers. It is located along the \"Costa dei Delfini\", halfway between Santa Margherita and Portofino. It is about 3 kilometres (1.9 mi) from Santa Margherita Ligure, reachable by bus or by boat. Nozarego is a natural terrace over the Bay of Tigullio. Here there is the church of Santa Maria Assunta with the cobbled square in typical ligurian. From Nozarego also leave several trails in the Park of Portofino. San Lorenzo della Costa is located on the slopes of the mountain, to the north, along the Aurelia road that leads to Genoa. There is a Flemish triptych in the local 13th-century church. === Localities === * Bocche * Pero === Rivers === There are several small brooks inside Santa Margherita Ligure,Pdf: http://www.caicalco.it/pdf/2018/20180408_Ruta%20Portofino.pdf all of which get water from the nearby mountains: the most prominent rivers are: * Torrente San Massimo * Torrente San Siro * Fosso Santa Barbara * Torrente Morta * Fosso delle Bocche These rivers also have many tributaries:Pdf: https://www.cai.it/wp-content/uploads/2018/11/La_Rivista_Luglio_Agosto_03.pdf === Torrente San Massimo === The Torrente San Massimo also known as the Rio San Massimo is a tribuatry of the Torrente Boate which runs completely in Rapallo. The stream flows into it from the west and is named after San Massimo which it flows through. It's source is located in Santa Margherita Ligure.Pdf:http://www.pianidibacino.ambienteinliguria.it/GE/ambito15/documenti/GE_Amb15_StudioBoate_Relazione.pdf Tributaries: * Fosso Violara * Unnamed Brook * Unnamed Brook * Unnamed Brook * Unnamed Brook ==== Tribuaries ==== ===== Fosso Violara ===== The Fosso Violara is a small tributary of the Torrente San Massimo. It flows from the east of Costa Ramezzana towards San Lorenzo. It runs south of Violara from which it gets its name. === Torrente San Siro === ==== Course ==== The Torrente San Siro begins at the merger of 2 smaller streams, the Fosso dei Casetti and Fosso Capellone just southeast of Pero. From there it flows northeast towards Via Aurelia. Then the Canale della Cantina and the Fosso dell'Acqua Bella flow into it. Further north the river flows under a path and then another tributary, the Fosso di Calcinea flows into it. The stream then changes direction and heads straight east and enters the town of Santa Margherita and flows towards the Sea mostly in Culvets. ===== Tributaries ===== * Canale del Pero di Sotto * Fosso Capellone * Canale delle Cantina * Fosso dell'Accua bella * Fosso di Calcinea * Fosso di Cassanello * Fosso di Coasta Mezzanna * Fosso Magistrato ===== Flooding ===== ===== Analyses ===== In depth research on the stream was conducted on the streams basin using hydraulic testing.Pfd:http://www.pianidibacino.ambienteinliguria.it/GE/ambito15/documenti/San_Siro.pdf === Fosso Santa Barbera === === Torrente Morta === === Fosso delle Bocche === == References == Category:Settlements in Genoa",
 "title": "Santa Margherita Ligure"
}