{
 "id": "941673",
 "text": "The Mr. Men Show is a Canadian-American remake of the British series, Mr. Men and Little Miss. == Episodes == === Series overview === === List of episodes === ==== Season 1 (1997–99) ==== ==== Season 2 (1999) ==== == Voice cast == === The Mr. Men Players === * Catherine Fitch - Mad Scientist, Contestant * Peter Keleghan - Pal, Game Show Guy, Frakenclown * Marguerite Pigott - Newslady, Hostess, Actress, Strong Girl * Cliff Saunders - Buddy, Contestant, Caveman, Couch Potato * Sean Sullivan - Assistant Scientist, Guy in Theatre, Director === The Mr. Men === * Len Carlson - Mr. Tickle, Mr. Greedy, Mr. Sneeze, Mr. Messy, Mr. Uppity, Mr. Funny, Mr. Chatterbox, Mr. Fussy, Mr. Bounce, Mr. Strong, Mr. Grumpy, Mr. Quiet, Mr. Nonsense, Mr. Skinny, Mr. Clever, Mr. Slow, Mr. Perfect, Mr. Cheerful and Additional Voices * Alyson Court - Little Miss Sunshine, Little Miss Trouble, Little Miss Giggles, Little Miss Magic, Little Miss Shy, Little Miss Chatterbox, Little Miss Late, Little Miss Busy, Little Miss Wise, Little Miss Tidy, Little Miss Fickle and Additional Voices * Neil Crone - Mr. Bump, Mr. Messy, Mr. Topsy-Turvy, Mr. Silly, Mr. Small, Mr. Lazy, Mr. Impossible, Mr. Clumsy, Mr. Rush, Mr. Worry, Mr. Busy, Mr. Brave, Mr. Grumble and Additional Voices * Catherine Disher - Mr. Muddle, Little Miss Naughty, Little Miss Neat, Little Miss Tiny, Little Miss Helpful, Little Miss Splendid, Little Miss Twins, Little Miss Lucky, Little Miss Scatterbrain, Little Miss Brainy, Little Miss Stubborn, Little Miss Curious, Little Miss Fun, Little Miss Somersault and Additional Voices * Judy Marshak - Little Miss Bossy, Little Miss Dotty, Little Miss Star, Little Miss Greedy, Little Miss Contrary and Additional Voices * Ron Rubin - Mr. Happy, Mr. Nosey, Mr. Daydream, Mr. Forgetful, Mr. Jelly, Mr. Noisy, Mr. Mean, Mr. Dizzy, Mr. Tall, Mr. Wrong, Mr. Mischief, The Narrator and Additional Voices == Notes == == References == Category:1990s American animated television series Category:1997 American television series debuts Category:1999 American television series endings Category:1997 Canadian television series debuts Category:1999 Canadian television series endings Category:English-language television programs",
 "title": "The Mr. Men Show (1997 TV series)"
}