{
 "id": "941646",
 "text": "Bocche di San Lorenzo or simply Bocche is a small locality in the comune of Santa Margherita Ligure in the Metropolitan City of Genoa in Liguria in Italy. It is made up of a few paths, benched and signposts.http://www.caicalco.it/pdf/2018/20180408_Ruta%20Portofino.pdf Viewed on 08/97/2022 == Etymology == The full meaning of the name Bocche is unknown however, it is believed that the name comes from \"presenza del passaggio naturale che mette in corrispondenza gli opposti versanti del Promontorio.\" or the \"presence of the natural passage that links the opposite sides of the Promontory.\" == Geography == Bocche is located at the junctions between a few trails and paths between the mountains of Monte delle Bocche and Monte Pollone. It is atop the \"Fosso delle Bocche\" stream which is directly named after it. Bocche is located on the border between Santa Margherita Ligure and Portofino. === Trails and Paths === Trail Type of way Main OSM Relation Other OSM Relation(s) No. of Nodes Surface Notes La Gabbia Path OSM 124 Dirt Path which runs to the summit of Monte delle Bocche Itinerario dei 2 Golfi Trail OSM Ruta - Pietre Strette - Olmi - PortofinoTrack:502021708Track:23791250 23 Gravel Long distance Hiking trail which passes through the locality. Bocche acts as a waypoint marker for it. Felciara - Bocche Path Path OSM Path:36277365 35 Cobblestone Links Feliciara with Bocche directly. Crosses over the Fosso delle Bocche. Access bike a Busseto, Pollone e Mulino Path OSM Path:502021710 21 Dirt Directly links Bocche with the summit of Monte Pollone. Raccordo Monte Croci di Nozarego Path OSM Path:776232405 14 Dirt Stub between Itinerario dei 2 Golfi and Pollone access bike path. === Monte delle Bocche === Monte delle Bocche is a mountain nearby to Bocche where it gets its name, Monte delle Bocche is accessed from Bocche via the Gabbia path. It is 510 metres tall and has 41 metres of prominence. Monte delle Bocche has been named and mapped since long ago. === Fosso delle Bocche === The Fosso delle Bocche is a tributary of the Rio Valle Ruffinale stream, it is sourced at Monte delle Bocche and the Bocche-Feliciara path formes the only crossing over it. == Amenities == Bocche is now only a waypoint marker with a few amenities for stopping hikers and tourists on the many hiking routes which pass through it. * Bench * Signposts * Viewpoint * Water Fountain All major buildings and infrastructure that existed in the original settlement have since disappeared. == References == Category:Settlements in Genoa",
 "title": "Bocche di San Lorenzo"
}