{
 "id": "941697",
 "text": "MTV Tres (taken from the Spanish word for the number three tres, stylized as tr3s, with an acute accent over the '3') is an American . == Programming == Tres broadcasts on an Eastern Time schedule with one national feed for all providers. === Music video programs === _Current_ * Exitos- The latest chart topping hits from today's Latin artists (airing for most of the day) * 2x1- Features two videos per artist * Fresh-Features the latest music videos * La Hora Nacional- Features Indie Latin artists * Tropicalismo- Reggaeton, Bachata and Tropical music videos * ReMexa – Music videos of different regional Mexican music genres including Banda, Ranchera, Duranguense and Norteña _Former_ * Classic Co. – The program, which aired weekdays at 10:00 a.m. Eastern Time, featured a mix of videos from Latino artists of the 1980s and 1990s such as Selena, Ricky Martin, and Marc Anthony. The title is most likely an English-language play on the Spanish term for \"classic\", clásico, as the title might stand for \"Classic Company\". The program was discontinued in early 2008. * Los Hits – Based on MTV's Big Ten and Más Música's Los Top 10, this program featured the most popular videos in rotation on MTV Tr3s. It was hosted by Carlos Santos or Denise Ramirez featuring interviews with popular artists, however the program would drop its VJ format in March 2007. The program was discontinued in mid-2007. * Tr3s or False – This program was a music video/text message-based game show that awarded viewers points, which could be redeemed for prizes, for answering questions correctly. The program was discontinued in early 2009. * Music My Guey – This program focuses on viewer requested music videos. * Top 20 – Similar to Las 40 Principales from Más Música, this program is a countdown of the top 20 videos in rotation on the channel during the week. In late June 2008, the network changed the show's format; most music videos are no longer played in their entirety; the show has been hosted since that point by Carlos Santos. * TXTO (pronounced \"texto\", Spanish for \"text\") – This program is a block of music videos requested by callers who send text messages to the channel, in English or Spanish, dedicating videos to friends or family. Although it is loosely based on Tu Email from Más Música, TXTO does not feature a VJ who reads the e-mails. However, there may be occasional VJ spots in the program. TXTO URB is a spinoff series that is dedicated to urban music videos. * ¡Rock! – This program aired mostly during the late night hours, and featured a mix of rock music videos from U.S. and Latin American bands. Among the U.S. bands featured in the lineup were the Deftones, which contain Latino vocalist Chino Moreno and turntablist Frank Delgado, and Incubus, which contain Latino drummer Jose Pasillas. The program was discontinued in October 2007. * MixMex – A music video program featuring artists from Mexico; it was replaced with ReMexa in March 2009. * Street Mix (later known as El Sonidero) – A block of urban music videos, focusing on hip-hop, reggaeton and R&B; artists, and includes Spanish- speaking artists with occasional American videos from non-Latino, English- speaking artists.(was called EL Sonidero until September 2008) * Videoteca (formally known as V.P.M., short for Video Party Music) – This program focused on rhythmic videos; Videoteca was cancelled on July 12, 2010, concurrent with the network's relaunch. * Videorama – General music video mix that aired during the daytime hours * Videosomnia – General music video mix that aired during the overnight hours (Similar to MTV After Hours) * Clasicos – Classic music videos (though most are from after 2010 but before 2015) * Cafeina – Early morning music video mix * El Flow – Latin urban contemporary music videos === Non-music programming === ==== Former programming ==== * Bellator Fighting Championships * Blue's Clues (Pistas de Blue, dubbed in Spanish) * Boiling Points * Casados con Hijos (Colombian version of Married... with Children, subtitled) * Dancelife * Dismissed * George Lopez * I Bet You Will * Impact Wrestling (wrestling show, translated in Spanish) * Isa TKM * Jersey Shore * Juegos Prohibidos * Lucha Libre USA: Masked Warriors * Mind of Mencia * Ninas Mal * Quiero Mi Boda – a show involving elaborate weddings * Quiero Mis Quinces – a Latin American version of My Super Sweet 16, though instead involving quinceañeras * Room Raiders * Short Circuitz * SpongeBob SquarePants (Bob Esponja, dubbed in Spanish) * Wonder Pets (Las Mascotas Maravilla, dubbed in Spanish) * Entertainment as a Second Language * Karlifornia * Lugar Heights * Mis ViDeos Locos! * Music My Güey * Pimpeando * Rock Dinner * Speak Tr3s * Yo Soy Jenny Rivera == Free-to-air affiliates == === Former affiliates === City Station/Channel Notes Current programming Fresno/Hanford, California KHMM-CD 23 Formerly owned by Viacom defunct Fresno/Hanford, California KZMM-CD 22 Formerly owned by Viacom Spanish independent Los Angeles, California KBEH 63 (Oxnard) Also on KBLM-LP 38 (Perris) and KPLM 25 (Glendale) Canal de la Fe Palm Springs KDUO-LP defunct San Diego, California KSDY-LD Was also seen in parts of Tijuana, Mexico Nuestra Visión Santa Barbara, California KVMM-CD Formerly owned by Viacom & was the last over-the-air broadcast asset that Viacom had remaining. Azteca America Sacramento / Stockton / Modesto KMMK-LP Was a repeater of both former sister stations KUUM-CD & KMMW-LD, and was also formerly owned by Viacom defunct Sacramento / Stockton / Modesto KMUM-CD 15 / KMMW-LD 47 Both stations were formerly owned by Viacom Telemundo Salinas / Monterey / Santa Cruz, California KMMD-CD 39 Court TV San Francisco/Oakland /San Jose, California KMMC-LD 40 unknown San Luis Obispo KMMA-CD 41 Formerly owned by Viacom defunct Santa Maria KQMM-CD 29 Formerly owned by Viacom 3ABN Latino Denver KLPD-LD 28.2 Decades West Palm Beach, Florida WBWP-LD 57 Independent Atlanta, Georgia WTBS-LP 26 Also was seen on WANN-LD 32.2 Estrella TV Indianapolis WBXI-CA 47 CBS Television Stations O&O; Start TV Kingman, Arizona KMOH-TV 6 MeTV O&O; Amarillo KAMM-LP 30 defunct Austin KGBS-CD 19 Formerly owned by Viacom multplexed into various networks Beaumont, Texas KUMY-LD 22 NewsNet Brownsville, Texas XHRIO-TV 2 Programming aired during the overnight and early morning hours also was seen around Matamoros, Tamaulipas, Mexico The CW Corpus Christi, Texas KCBO-LP 49 unknown Dallas/Fort Worth, Texas KATA-CD 50 Defunct Del Rio/Eagle Pass, Texas KVAW 16 Was also seen in major cities in Mexico near the border between Texas and Coahuila, Mexico Independent McAllen/Harlingen, Texas KMBH-LD 67/KTIZ-LP 52 Secondary affiliation during early morning hours Took over Fox affiliation from XHRIO- TDT Midland/Odessa, Texas KMDF 22.1 defunct San Antonio KMHZ-LP 11 defunct == References == Category:Spanish-language television networks in the United States",
 "title": "MTV Tres"
}