{
 "id": "941737",
 "text": "Gregory Martin Itzin (April 20, 1948 – July 8, 2022) was an American actor. He was best known for his role as Charles Logan in the action thriller series 24. He also played John Archibald Campbell in Lincoln. Itzin died on July 8, 2022 at a hospital in London, England from problems caused by surgery at the age of 74. == Filmography == === Movies === Year Title Role Notes 1980 Airplane! Religious Zealot #1 1982 The Best Little Whorehouse in Texas Melvin's Crew 1982 Airplane II: The Sequel Young Man Uncredited 1984 Hard to Hold Owen 1985 Teen Wolf English Teacher 1989 The Fabulous Baker Boys Vince Nancy 1989 Dad Ralph Kramer 1989 How to Get... Revenge Officer P.F. Uncredited 1993 Young Goodman Brown George Burroughs 1995 Born to Be Wild Walter Mallinson 1998 Fear and Loathing in Las Vegas Clerk at Mint Hotel 1999 One Last Flight Joe 1999 Making Contact Hans 2000 What's Cooking? James Moore 2000 Boys Life 3 Scott's Father 2001 Evolution Cartwright 2001 Original Sin Colonel Worth 2002 Life or Something Like It Dennis 2002 Igby Goes Down Eulogist #2 Uncredited 2002 Adaptation Prosecutor 2007 I Know Who Killed Me Dr. Greg Jameson 2008 Float Ray Fulton 2009 Law Abiding Citizen Warden Iger 2009 The Job Mr. D 2010 Autopilot Dr. Brian 2011 L.A., I Hate You George 2011 The Change-Up Flemming Steel 2011 The Ides of March Jack Stearns 2012 Lincoln John Archibald Campbell 2014 Small Time Lennie 2016 Sensitivity Training Barry 2018 Ice: The Movie Joe Grantham === Television === Year Title Role Notes 1979 Backstairs at the White House White House Tour Guide Episode #1.1 1979 Mork & Mindy Man #2 Episode: \"Dr. Morkenstein\" 1979 Charlie's Angels Waiter Episode: \"Fallen Angel\" 1981 Thornwell Polygraph Tester Television film 1981 Murder in Texas Newsman Television film 1981 Bulba V. Ogelthorpe Television film 1982 Fame Dr. Reston Episode: \"To Soar and Never Falter\" 1982 Lou Grant Young Reporter Episode: \"Unthinkable\" 1982, 1983 Voyagers! Ernst / Davis 2 episodes 1983 American Playhouse Goldsmith Episode: \"Miss Lonelyhearts\" 1983 The Other Woman Mario Television film 1985 Street Hawk Harvey Episode: \"Vegas Run\" 1985 Falcon Crest Dr. Bitters Episode: \"The Trial\" 1985 Santa Barbara Attorney Howard Otis 3 episodes 1985 Scarecrow and Mrs. King Paul Cavanaugh Episode: \"You Only Die Twice\" 1985 Tales from the Darkside Newton Episode: \"Grandma's Last Wish\" 1985 Hunter Charlie Latimer Episode: \"The Biggest Man in Town\" 1985 Hill Street Blues Dr. Kaplan Episode: \"Seoul on Ice\" 1985 Hotel Ed Banner Episode: \"Echoes\" 1986 The A-Team Howard Episode: \"Wheel of Fortune\" 1986 Easy Street Mr. Haskell Episode: \"Pride Goeth Before a Cheap Hotel\" 1986 MacGyver Tom Cavanaugh Episode: \"Final Approach\" 1986 St. Elsewhere Ving Shalimar Episode: \"Lost Weekend\" 1987 Outlaws Art Collier Episode: \"Hymn\" 1987 Max Headroom Gregory Episode: \"Deities\" 1987 Frank's Place Brandon Episode: \"Season's Greetings\" 1987–1992 Matlock Various 5 episodes 1987–1994 L.A. Law D.D.A. Jack Angeletti 3 episodes 1988 21 Jump Street Principal Jack Garner Episode: \"Brother Hanson & the Miracle of Renner's Pond\" 1988 A Year in the Life Joel Episode: \"Love Mother\" 1988 Something Is Out There Dr. Wilcher Episode: \"Gladiator\" 1989 Knots Landing Val's Lawyer Episode: \"A Grave Misunderstanding\" 1989 Jesse Hawkes Frank Keith Episode: \"Eddy Street\" 1989 The Nutt House Dennis 10 episodes 1989–1991 Night Court Mugger / Warren Karr 2 episodes 1989–1992 Empty Nest Judge Russell / Bill Wallace / Frank 3 episodes 1990 Murphy Brown Gil Porter Episode: \"On the Road Again\" 1990 Head of the Class Meriner Episode: \"Cement Hi-Tops\" 1990 Coach Tom Episode: \"Hayden's in the Kitchen with Dinah\" 1990 Over My Dead Body Cosby / Crosby 3 episodes 1991 Gabriel's Fire Evan Stahl Episode: \"A Prayer for the Goldsteins\" 1991 Jake and the Fatman Dr. Mike Summers Episode: \"Dr. Mike Summers\" 1991 Dark Justice Sterling Pope Episode: \"What Comes Around\" 1991 DEA Sam Blankenship Episode: \"The Fat Lady Sings Alone\" 1991 Hi Honey – I'm Dead Phil Television film 1991 Homefront Allan Carmichael Episode: \"Man, This Joint Is Jumping\" 1991–1992 Eerie, Indiana The Mayor 4 episodes 1992 Davis Rules Host Episode: \"Love at First Sighting: Part 2\" 1992 Bodies of Evidence Phillip Montgomery Episode: \"Time Served\" 1992 Civil Wars Tom Turnbull 2 episodes 1992 Beverly Hills, 90210 Father Chris Episode: \"Destiny Rides Again\" 1993 Major Dad Mitch Hewitt Episode: \"Come Rain or Come Shine\" 1993 Shaky Ground Repairman Episode: \"Asbestos and Costello\" 1993 Quantum Leap Sam Phillips Episode: \"Memphis Melody – July 3, 1954\" 1993 Donato and Daughter Cornell Television film 1993 Moment of Truth: Stalking Back Rick Boyer 1993, 1998 Star Trek: Deep Space Nine Hain / Ilon Tandro Episodes: \"Who Mourns for Morn?\"; \"Dax\" 1994 Dave's World Alvin Episode: \"The Funeral\" 1994 Picket Fences Michael Kramer 2 episodes 1994–1995 Something Wilder Jack Travis 15 episodes 1995 The Client George Sherman Episode: \"The Burning of Atlanta\" 1995 Strange Luck Ted Glenn Episode: \"Hat Trick\" 1995 Murder, She Wrote Ralph Brewer Episode: \"Frozen Stiff\" 1995–1996 Murder One D.A. Roger Garfield 17 episodes 1996 ER Burn Doctor Episode: \"The Healers\" 1996 Chicago Hope Dr. Kyle Mitchell Episode: \"Sexual Perversity in Chicago Hope\" 1996 Arliss Tom Gale Episode: \"The Client's Best Interest\" 1996 Diagnosis: Murder Andrew King 2 episodes 1996, 1998 Caroline in the City Hank Parsons / Mr. Lepner 1997 Friends 'Til the End Mr. Romley Television film 1997 The Pretender Phil Campbell Episode: \"Jaroldo!\" 1997 Millennium Hans Ingram Episode: \"Walkabout\" 1997 JAG Undersecretary of State Lawrence Culbertson Episode: \"Above and Beyond\" 1997 Players Quentin Belkey Episode: \"Three of a Con\" 1997–2003 The Practice Various 5 episodes 1998 Suddenly Susan Bob Episode: \"Car Trouble\" 1998 The Day Lincoln Was Shot Mr. Crook Television film 1998 The Closer Larry Colburn Episode: \"My Best Friend's Funeral\" 1998 C-16: FBI Royce Bender Episode: \"Green Card\" 1998 Any Day Now Councilman Emmett Kearn Episode: \"No Comment\" 1998 Brother's Keeper Mr. Weaver Episode: \"Who's Your Daddy?\" 1999 V.I.P. Ronnie Beeman Episode: \"Midnight in the Garden of Ronnie Beeman\" 1999 Party of Five School Psychologist 2 episodes 1999 The Hunt for the Unicorn Killer Arlen Specter Television film 1999 Johnny Tsunami Headmaster Pritchard 1999 Wasteland Max Brody Episode: \"Double Date\" 1999 Early Edition Bruce Bryce Episode: \"Camera Shy\" 1999 It's Like, You Know... Chuck 2 episodes 2000 Family Law Mr. Allero Episode: \"Media Relations\" 2000 Profiler Joel Marks 6 episodes 2000 Bull Lloyd Styner Episode: \"What the Past Will Bring\" 2000 Star Trek: Voyager Dr. Dysek Episode: \"Critical Care\" 2000 The Michael Richards Show Matty Stillman Episode: \"It's Only Personal\" 2000–2001 Strip Mall Sergei 21 episodes 2001 CSI: Crime Scene Investigation Norman Stirling Episode: \"Boom\" 2001–2005 Judging Amy ASA Ethan Donahue 3 episodes 2002 Wolf Lake Gerald Carter Episode: \"Leader of the Pack\" 2002 Philly Paul Cabretti Episode: \"Thanks for the Mammaries\" 2002 The West Wing State Dept. Representative Episode: \"Enemies Foreign and Domestic\" 2002 For the People Judge Donald Kingman Episode: \"The Double Standard\" 2002 Firefly Magistrate Higgins Episode: \"Jaynestown\" 2002 NYPD Blue Martin Walsh Episode: \"Healthy McDowell Movement\" 2002–2004 Friends Theodore Hannigan 2 episodes 2002, 2005 Star Trek: Enterprise Adm. Black / Capt. Sopek Episodes: \"In a Mirror, Darkly Part II\"; \"Shadows of P'Jem\" 2003 Without a Trace Sydney's co-worker Episode: \"Fallout: Part 1\" 2003 DC 9/11: Time of Crisis John Ashcroft Television film 2003 The Lyon's Den Mr. Thomas Episode: \"The Other Side of Caution\" 2003, 2020 NCIS Director Charlie / Spencer Downing 3 episodes 2004 Medical Investigation Howard Lewson Episode: \"Progeny\" 2004 The O.C. Stephen Herbert Episode: \"The New Era\" 2005 Crossing Jordan Andrew Helm Episode: \"Gray Murders\" 2005 Boston Legal A.D.A. Todd Milken 2 episodes 2005–2010 24 Charles Logan 44 episodes 2007 Robot Chicken William Adama / Dick Tracy / Police Officer Episode: \"Rabbits on a Roller Coaster\" 2007 Nice Girls Don't Get the Corner Office Stone Television film 2008 Medium Senator Jed Garrity Episode: \"Aftertaste\" 2008 Hannah Montana William Harris Episode: \"The Test of My Love\" 2008–2012 The Mentalist Virgil Minelli 15 episodes 2010 Proposition 8 Trial Re-Enactment David Blankenhorn Television documentary 2010–2013 Covert Affairs Henry Wilcox 25 episodes 2011 Big Love Senator Dwyer 9 episodes 2011 Desperate Housewives Dick Barrows 2 episodes 2013 Once Upon a Time Alphonse Frankenstein Episode: \"In the Name of the Brother\" 2013 Mob City Mayor Fletcher Bowron 6 episodes 2015 Hawaii Five-0 Alex Mackey Episode: \"Poina 'ole\" 2016 12 Deadly Days Grandpa Episode: \"Love Bites\" 2018 Code Black Dr. David Stoval Episode: \"Hell's Heart\" 2018 America 2.0 President Ward Baker Episode: \"Ice\" 2019 The Resident Sunflower Episode: \"The Unbefriended\" ==References== ==Other websites== * * Gregory Itzin in Shipwrecked! at South Coast Repertory * Law and Order: Really Special Victims Unit starring Gregory Itzin Category:1948 births Category:2022 deaths Category:American movie actors Category:American television actors Category:American stage actors Category:American voice actors Category:Actors from Washington, D.C. Category:Deaths from surgical complications",
 "title": "Gregory Itzin"
}