{
 "id": "941748",
 "text": "Coma is a 2022 French film written and directed by Bertrand Bonello. The film made its world premiere at the 2022 Berlin Film Festival competing in the Encounters section on 12 February 2022, where it won the FIPRESCI Award. This was the last movie filmed by actor Gaspard Ulliel and the first movie to be released after his death. The film mixes animation and live action and tells the story of a teenage girl who is locked up in her house during a global health crisis and navigates between dreams and reality, until she starts following a disturbing and mysterious YouTuber named Patricia Coma. It stars Louise Labèque, Julia Faure, Gaspard Ulliel, Laetitia Casta, Vincent Lacoste, Louis Garrel and Anaïs Demoustier. The film will be released in theaters in France on 16 November 2022. ==Cast== * Julia Faure as Patricia Coma * Louise Labèque as Young Girl * Laetitia Casta as Sharon (voice) * Gaspard Ulliel as Scott (voice) * Vincent Lacoste as Nicholas (voice) * Louis Garrel as Dr. Ballard (voice) * Anaïs Demoustier as Ashley (voice) ==Marketing== The first image showing Louise Labèque, the full cast and plot details were revealed on 2 February 2022. Two clips from the film titled \"Catatonie\" and \"Cullen\" were released on 10 February 2022. The clip titled \"Cullen\" featured the voices of Gaspard Ulliel and Laetitia Casta as the dolls Scott and Sharon, respectively. Belgian distributor Best Friend Forever released a poster and an exclusive 20-second teaser trailer for the film on their Instagram account on 11 February 2022. On 16 February 2022, Best Friend Forever released on their Instagram account a new 9-second clip featuring Louise Labèque playing an electronic device similar to Rubik's Cube. ==Release== On 2 February 2022, it was announced that Brussels-based company Best Friend Forever had bought the film. The film had its world premiere in the Encounters section at the 72nd Berlin International Film Festival on 12 February 2022. New Story will release the film in theaters in France on 16 November 2022. ==Awards and nominations== Award / Film Festival Category Recipient(s) Result 2022 Berlin Film Festival Encounters Bertrand Bonello FIPRESCI Award Bertrand Bonello 2022 Istanbul Film Festival Golden Tulip Bertrand Bonello 2022 Las Palmas de Gran Canaria Film Festival Golden Lady Harimaguada Award for Best Feature Film Bertrand Bonello == References == == Other websites == * * Coma at UniFrance Category:2022 drama movies Category:2022 fantasy movies Category:French- language movies Category:French drama movies Category:French fantasy movies Category:Movies set in the 2020s Category:Movies directed by Bertrand Bonello",
 "title": "Coma (2022 movie)"
}