{
 "id": "9417",
 "text": "The Romance languages (also sometimes called Latin languages or Neo-Latin languages) are a language family in the Indo-European languages. They started from Vulgar Latin (in Latin, vulgar is the word for \"common\" and so \"Vulgar Latin\" means \"Common Latin\"). The most spoken Romance languages are Spanish, Portuguese, French, Italian and Romanian. They are called \"Romance languages\" because they originate from Latin, the language spoken by the Western Roman Empire. Their grammatical inflection system has been simplified with the loss of most of the complex case structure of Classical Latin. The area that the Romance languages are spoken in Europe mostly was in the Western Roman Empire. The Greek language superseded Latin in the Eastern Roman Empire. Latin survived in Romania, whose language, Romanian, is a Romance language. In Moldova, it is sometimes called Moldovan. == Demographics == The Romance language family is one of the largest in the world have a total of almost a billion first- and second-language speakers. Spanish is the most widely used Romance language, with Portuguese as the second and then French coming in at third. Spanish is spoken in Spain, United States, Latin America and some places of Africa. Portuguese is mostly used/spoken in Brazil, Portugal and parts of Africa. French is spoken in France, Belgium, Switzerland, Canada and in some areas of Africa. Italian is spoken in Italy, San Marino, Malta, Switzerland and the Vatican City. Romanian is spoken in Romania and Moldova. == List of Romance languages == === Eastern Romance languages === *Romanian *Moldovan *Istro-Romanian *Megleno-Romanian *Aromanian === Italo-Western Romance languages === *Sardinian ==== Italo-Dalmatian languages ==== *Italian *Neapolitan *Sicilian === Western Romance languages === ==== Gallo-Iberian languages ==== *Catalan *Occitan === Gallo-Romance languages === *French *Gallo *Norman *Auregnais *Jèrriais *Sercquiais *Romansh *Venetian *Walloon === Iberian Romance languages === *Asturian *Galician *Leonese *Portuguese *Spanish *Aragonese === Other === *Ladino == Family tree == == Other websites == * Romance languages - Citizendium",
 "title": "Romance languages"
}