{
 "id": "94183",
 "text": "Gabriel José de la Concordia García Márquez, also known as Gabo (March 6, 1927Distintas ciudades del mundo rinden homenaje a García Márquez en su 80 cumpleaños. Clarin (2007-03-06). Retrieved on 2008-02-05. - April 17, 2014) was a Colombian novelist, short-story writer, screenwriter, and journalist. He won the Nobel Prize in Literature in 1982. He was best known for his novels One Hundred Years of Solitude (1967), The Autumn of the Patriarch (1975) and Love in the Time of Cholera (1985). His books were mainly about satire, solitude, magic realism, realism, and violence. Márquez was sick with Alzheimer's disease after being diagnosed in 2012. He lived with his wife, Mercedes Barcha in Mexico City where he died from pneumonia in 2014 at the age of 87. He is the most-translated Spanish-language author. After García Márquez's death in April 2014, Juan Manuel Santos, the President of Colombia, called him \"the greatest Colombian who ever lived.\" == Early life == Márquez was born in Aracataca, Colombia. His parents were Gabriel Eligio García and Luisa Santiaga Márquez. His father was a pharmacist. His mother left him at a young age and he was raised by his grandparents and father. He studied at the University of Cartagena. == Career == He started as a journalist, and wrote many famous non-fiction works and short stories. Márquez began writing at the age of eighteen. He began writing about living in an old house with grandparents. He is best known for his novels, such as One Hundred Years of Solitude (1967), The Autumn of the Patriarch (1975), Chronicle of a Death Foretold (1981) and Love in the Time of Cholera (1985). Most of his books are based or set in his birth_place, Aracataca. He mostly wrote books about realism or magical realism. His motifs included solitude and violence. == Nobel Prize == In 1982, he received the Nobel Prize in Literature \"for his novels and short stories, in which the fantastic and the realistic are combined in a richly composed world of imagination, reflecting a continent's life and conflicts\". When he was accepting the award, Márquez gave a speech called \"The Solitude of Latin America\". == Recent Work == In 2002, he published the memoir Vivir para contarla; the first of a projected three- volume autobiography. In 2004, he published another book named Memories of My Melancholy Whores. It caused many problems and controversies in Iran. This book is banned in Iran. == Movies == Several of his stories have inspired other writers and directors. In 1987, the Italian director Francesco Rosi directed the movie Cronaca di una morte annunciata, based on Chronicle of a Death Foretold, written by Márquez. A number of movies have been made of García Márquez's work. He also wrote some scripts for movies. He often worked with Carlos Fuentes for writing scripts. His famous book, Love in the Time of Cholera was also made into a movie in 2007. == Personal life == Márquez met his wife, Mercedes Barcha, when they were in college. They wanted to get married when they both finished college but Márquez was sent to Europe. When he returned, Márquez married Barcha in 1958. Márquez had two sons with Barcha. His first son, Rodrigo García, was born in 1959, one year after Márquez and Barcha were married. His second son, Gonzalo, was born in 1962 in Mexico. Rodrigo is a movie director and Gonzalo is a graphic designer. Márquez and his family traveled by bus to Mexico. They settled in Mexico City. Márquez had always wanted to see the Southern United States because it inspired the writings of William Faulkner. Márquez lived with his family in Mexico City. === Health === In 1999, García Márquez was diagnosed with lymphatic cancer. He went through chemotherapy and made a quick recovery. But, Márquez began developing side effects of old age which drove to his retirement in May 2008. In 2012, Márquez became sick from Alzheimer's disease. On April 3, 2014, Márquez was hospitalized in Mexico. He had infections in his lungs and his urinary tract and was suffering from dehydration. Márquez later had pneumonia. === Death === Márquez died of pneumonia at age 87 in Mexico City, Mexico. His remains were cremated the next day. == Literary Work == === Novels === * Leaf Storm (1958) * No one writes to the Colonel (1961) * In Evil Hour (1962) * One Hundred Years of Solitude (1967) * The Autumn of the Patriarch (1975) * Chronicle of a Death Foretold (1981) * Love in the Time of Cholera (1985) * The General in His Labyrinth (1989) * Of Love and Other Demons (1994) * Memories of My Melancholy Whores (2004) * Until August (2024)https://www.aftenposten.no/kultur/i/3EWowq/dement-forfatter-visste-best. Retrieved 2024-03-06 === Short Story Collections === * Big Mama's Funeral (1962) * Innocent Eréndira (1972) * Eyes of a Blue Dog (1974) * Strange Pilgrims (1992) === Non-fiction === * The Story of a Shipwrecked Sailor (1970) * Clandestine in Chile (1986) * News of a Kidnapping (1996) * Living to Tell the Tale (2002) == References == == Further reading == * * * * * * * * * * * * * * * * * * * * * * * * * * * == Other websites == * * Garcia Marquez at The Modern Word Category:1927 births Category:2014 deaths Category:Autobiographers Category:Magdalena Department Category:Colombian journalists Category:People with Alzheimer's disease Category:Screenwriters Category:Short story writers",
 "title": "Gabriel García Márquez"
}