{
 "id": "941824",
 "text": "Johanna Annetje “Annie” van Wijk-van de Blankevoort also wrongly written as Anny van den Blankenvoort and other variants (born 3 September 1895) was a Dutch track and field athlete being active mainly between 1918 and 1923. She represented athletics club R.S. Rozenburg.Huwelijk op 17 augustus 1922 te Rotterdam, openarch.nl She also played korfball with the same club. Van den Blankenvoort set the first ever official Dutch women’s record in athletics in 1921; in the 80 metres. She also set the first official record in the long jump. She won most of the 80 metres competitons she competed in and was therefore named in the media as “the invincible”. She became multiple years national champion in the 80 metres and won the first national championships in the 4x 100 metres relay. ==Career== After finishing third at a national competition in 1918, she had her first victory on 17 June 1919 during the athletics competition of South Holland in Gouda where she won the long jump event; one of the two individual events for women next to the relay. A few weeks later she won the high jump and 80 metres events at the national competition in Rotterdam. She became champion of South Holland in July 1919 in the 80 metres. During her career she won most of the 80 metres event she competed in and named in the media “the invincible” in 1921. However, she won not everything. At the first 2021 South Holland competition she was beaten in four of the five events including the 80 metres. she was beated by I. van Driel on 7 August 1921. In 1921 she became with Rozenburg national champion in the 4x 100 metres relay. A week later she also became national champion in the 80 metres in Zeist. In an as described “fierce battle” she won the final from Rugter-Janssen. The first possibility to set a Dutch record was from 1921 in the 80 metres. On 3 July at the Pro Partia international competition she ran in the heats a time of 11.1 what would be good enough for the national record. However, because there was only one time keeper the time was not official recognized. On 31 July 1921 she set the record in Enschede in a time of 10.7 seconds. In June 1922 she even ran in the 80 metres the same time as the world record. During national competitions in the 80 metres semi-finals she ran a time of 10.6 seconds at Woudestein. She held the records for over two years after it was broken on 8 July 1923 by R. Francken. Van den Blankenvoort also set the first national record in the long jump in Rotterdam on 30 July 1922 with a distance of 4.56 metres. A year later on 8 July 1923 her record was broken by G. Harke. On 27 August 1922 she competed at the 1922 Pro Patria women's international athletics competition, (one of) the earliest international women’s competition in the Netherlands. In the 100 metres she finished third, beaten by German long jump champion Margarete Furchheim. She won with the Rotterdam team the 4x 100 metres relay. ==Achievements== ;1918 :5 August - 3rd: 80 metres - National competition (Rozenburg) ;1919 :15 June - 1st: high jump — competition of South Holland (Gouda) :29 June - National competition (Rotterdam) ::1st in high jump ::1st in 80 metres :20 July - 1st: 80 metres — South Holland Championships (Rotterdam) ;1920 :7 June - 2nd(?): 80 metres - Competition of South Holland (lost from I. van Driel) :14 June - 2nd: 80 metres - national competition (O.D.I) (lost from I. van Driel after re-run) ;1921 :5 May - Competition of South Holland - 1st meeting (Rotterdam) ::1st: long jump ::1st: 100 metres ::2nd: 80 metres ::2nd: bal throw ::3rd: high jump :22 May - National competition (H.V.V.) ::1st 80 metres ::1st 4x 100 metres mixed relay :5 June - Competition of South Holland ::1st: 100 metres ::1st: high jump ::2nd: long jump ::2nd: bal throwing :12 June - 1st: 80 metres - ZHAB national competition ::1st 80 metres ::1st 4x 100 metres relay (national championships) :19 June - 1st: 80 metres - national championships (Zeist) :22 June - Dordrecht ::1st: 80 metres ::1st: 4x 100 metres relay :3 July - 1st: 80 metres - Pro Partia international competition (Sparta) :31 July - Philips athletics competition (Eindhoven) ::1st 80 metres ::First official 80 metres national record (10.9 sec.). First official women’s athletic record. :7 August - 2nd: 80 metres - ODI competition (lost from N. van Driel) :14 August - athletics certificate for korfball players ;1922 :11 May - 1st 80 metres - ODI competitions (Woudestein) :11 June - 1st 80 metres (with 10.6 in semi- final) - national competitions (Woudestein) :25 June - 1st 80 metres - Dutch athletics championships (Rozenburg) :30 July - competition of South Holland (Rotterdam) ::1st 80 metres ::1st long jump ::Fist official long jump national record (4.56 metres) :6 August - competition of South Holland (seasons last) ::1st 80 metres ::1st long jump :27 August - Pro Patria international competition. ::1st 4x 100 metres relay (as a member of team “Rotterdam”) ::3rd 100 metres ;1923 :10 June - 3rd: 80 metres - South Holland championships (Rotterdam) :17 June - 3rd: 80 metres - ODI national competition (Rotterdam) ==Personal life== Van de Blankevoort was born in Deventer on 3 September 1895. She was the daughter of Gerrit van de Blankevoort and Everdina Martha Jacoba Mazee. She had one sister and three brothers.Persoonskaart Johanna Annetje van de Blankevoort pondes.nl She later lived in the Rotterdam region. On 17 Augustus 1922 she married to Dirk Jacobus van Wijk from Rotterdam. ==References== ==Other websites== *Image, 1921 Dutch Athletics Championships Category:1895 births Category:Year of death missing Category:Dutch athletes Category:Sportspeople from Overijssel Category:People from Deventer Category:Dutch korfball players Category:Dutch long jumpers Category:Dutch high jumpers Category:Dutch sprinters",
 "title": "Annie van de Blankevoort"
}