{
 "id": "941885",
 "text": "Warner Bros. Discovery India is an Indian multinational mass media and entertainment conglomerate. == Owned channels == Channel Launched Language (s) Category Note (s) Animal Planet 1991, 32 years ago English, Hindi Knowledge Indian Television Dot Com\"> The channel will air special 20 year celebration marathon on 15 and 16 August.... http://www.indiantelevision.com/television/tv-channels/factual-and- documentary/discovery-channel-to-complete-20-years-in-india- on-15-august-150814 Cartoon Network English, Hindi, Tamil, Telugu Kids Cartoon Network HD+ CNN International India English News Pogo English, Hindi, Tamil, Telugu Kids Discovery Channel India 15 August 1995 5 March 2010 (HD) Hindi English Tamil (as Discovery Tamil) Telugu Malayalam Kannada Bengali Marathi Knowledge and Lifestyle Indian Television Dot Com\" /> Discovery Kids India English, Hindi, Tamil, Telugu Kids Indian Television Dot Com\" /> Discovery Science India 2010 Hindi English Tamil (as Discovery Tamil) Telugu Malayalam Kannada Bengali Marathi Knowledge and Lifestyle Discovery Tamil India 15 August 1995 5 March 2010 (HD) Indian Television Dot Com\" /> Discovery Turbo India 2004 Indian Television Dot Com\" /> Eurosport India 6 February 2017; 6 years ago Indian Television Dot Com\" /> Food Network 5 July 2010, 13 years ago Indian Television Dot Com\" /> HGTV India December 30, 1994; 28 years ago Indian Television Dot Com\" /> Investigation Discovery India 12 February 2018, 5 years ago Indian Television Dot Com\" /> Travel Channel February 1994; 29 years ago Indian Television Dot Com\" /> TLC India October 2004, 18 years ago Indian Television Dot Com\" /> == Defunct channels == Channel Discontinued Replaced by Language (s) Category Notes (s) Discovery Jeet Discovery Jeet HD 12 February 2018 Investigation Discovery Hindi English Tamil Telugu Malayalam Kannada Bengali Marathi General Entertainment HBO India HBO HD 15 December 2020 - English, Hindi Hollywood Movies HBO Defined HBO Defined HD 31, December 2015 HBO HD HBO Hits HBO Hits HD Imagine TV 12 April 2012 - Hindi Hindi Entertainment Indian Television Dot Com\"> Imagine Showbiz 15 August 2008 Indian Television Dot Com\" /> Lumiere Movies 2012 Real Indian Television Dot Com\" /> Toonami India 15, May 2018 English, Hindi Kids WB Channel 15 December 2020 English, Hindi Hollywood Entertainment ==Related pages== * Tiny TV, a preschool programming block on Pogo. * List of programmes broadcast by Cartoon Network (India) == References == == Other websites == * Animal Planet * Cartoon Network * Pogo * Discovery Kids * Eurosport Category:Television networks Category:Indian entertainment companies",
 "title": "Warner Bros. Discovery India"
}