{
 "id": "941951",
 "text": "Simon Goodell Griffin (August 9, 1824 – January 14, 1902) was an American soldier during the American Civil War. He was also a farmer, teacher, lawyer, writer and politician.Eicher, John H., and Eicher, David J., Civil War High Commands, Stanford University Press, 2001, . p. 269. == Early years and career == Simon G. Griffin was born in Nelson, New Hampshire on August 9, 1824. Later, Griffin was a farmer and a teacher. Even later, he represented his town in the State legislature and was admitted to the bar in 1860.Warner, Ezra J. Generals in Blue: Lives of the Union Commanders. Baton Rouge: Louisiana State University Press, 1964. . pp. 191–192. == Military career == During the American Civil War, Griffin was a captain in the 2nd New Hampshire Infantry from June 1, 1861 to October 31, 1861. He was the lieutenant colonel of the 6th New Hampshire Infantry from November 28, 1861 to April 22, 1862. Griffin became the colonel of the 6th New Hampshire Infantry on April 22, 1862. Griffin led the regiment in the Second Battle of Bull Run, the Battle of Antietam and the Battle of Fredericksburg. Griffin led first brigade second division for a short time during the winter of 1862–1863. Griffin's regiment was sent west with Major General Ambrose Burnside, where Griffin alternately served as regimental and brigade commander. He served under Major General Ulysses S. Grant during the Siege of Vicksburg when Major General John G. Parke took IX Corps to Mississippi. IX Corps served for the most time during the Vicksburg campaign with Major General William T. Sherman, preventing Confederate reinforcements from reaching Vicksburg.A bust of General Griffin now stands near Grant Circle at the Vicksburg National Military Park. Next Colonel Griffin participated in Sherman's Meridian and Yazoo River Expeditions in Mississippi in February 1864, which culminated in the Battle of Meridian. Griffin was promoted to brigadier general on May 30, 1864.Eicher, 2001, p. 722. == Later years and death == General Griffin was mustered out of the military on August 24, 1865. On January 13, 1866, President Andrew Johnson nominated Griffin to be brevetted major general of volunteers, and the United States Senate allowed it on March 12, 1866.Eicher, 2001, p. 712. After the war, Griffin returned to New Hampshire and was a manufacturer at Harrisville, New Hampshire. He was elected five times as a member of the New Hampshire Legislature, and in the last two terms he was a Speaker. Griffin died in Keene, New Hampshire on January 14, 1902. He was buried in Keene at the Woodland Cemetery. == Notes == == References == * Eicher, John H., and Eicher, David J., Civil War High Commands, Stanford University Press, 2001, . * Warner, Ezra J. Generals in Blue: Lives of the Union Commanders. Baton Rouge: Louisiana State University Press, 1964. . Category:Union Army Category:American Civil War generals Category:1824 births Category:1902 deaths Category:Politicians from New Hampshire Category:Military people from New Hampshire",
 "title": "Simon Goodell Griffin"
}