{
 "id": "942113",
 "text": "Ivan Oleksandrovich Bidnyak (October 1, 1985, Marganets, Dnipropetrovsk Region, Ukrainian SSR, USSR — April 20, 2022, Kherson region, Ukraine) — Ukrainian shooter, master of sports of international class of Ukraine in bullseye shooting. A senior soldier of the Armed Forces of Ukraine, a participant in the Russian-Ukrainian war, who fell during the Russian invasion of Ukraine. == Biography == In 2003, he graduated from the Lviv State School of Physical Culture (shooting department) and returned to Dnipropetrovsk. Took second place in shooting from a small-caliber pistol (MP-6 exercise) at the 26th ISAS international tournament, Dortmund, with a score of 657.0 points. In March 2010, he won a silver medal as part of the team at the European shooting championship in the city of Meraker (Norway) — shooting from an air pistol at 10 meters (exercise PP-3) — together with Serhiy Kudreya (Kherson) and Oleg Omelchuk (Rivne) In 2010, he was recognized as the eighth in the top ten sportsmen of the Dnipropetrovsk region (3 bronze medals in the European shooting Championship). In the summer of 2013, he won a silver award at the European Small Arms Shooting Championship in Osijek — from a distance of 25 meters, with a result of 575 points. In the team tournament, Roman Bondaruk together with Oleksandr Petriv and Ivan Bidniak won bronze awards — 1706 points. In February 2022, at the beginning of the invasion of Russian troops into Ukraine, he returned from abroad, where he worked, and went to the front as a volunteer. He fought in the Kherson region. On April 20, 2022, he was killed by an enemy bullet while performing a combat mission. == Awards == * Order \"For Courage\" III degree (2022) — for personal courage and selfless actions shown in the defense of the state sovereignty and territorial integrity of Ukraine, loyalty to the military oath. == Notes == == Sources == * UNIAN * Lviv State School of Physical Culture * Bullet Shooting * The first Ukrainian license for the 2012 Olympics * VRU * Shooting Federation of Ukraine Category:1985 births Category:2022 deaths Category:People from Dnipropetrovsk Oblast Category:Military of Ukraine Category:Sport shooters Category:Ukrainian sportspeople",
 "title": "Ivan Bidnyak"
}