{
 "id": "942140",
 "text": "Mirada de mujer (Waze of Woman), is a Mexican telenovela produced by TV Azteca and premiered by Azteca Trece on July 9, 1997, starring Angélica Aragón, Ari Telch and Fernando Luján, it is based on the Colombian drama Señora Isabel. It had a sequel in 2003 called Mirada de mujer, el regreso. ==Synopsis== María Inés Domínguez is a 50-year-old housewife who is in charge of her husband Ignacio San Millán and their three children Adriana, Andrés and Mónica. Despite this, she is not happy and wants to fulfill her dreams and goals. that he abandoned and did not fulfill, out of nowhere Daniela López arrives, a woman who comes from nowhere and with whom Ignacio falls in love and believes that the 27-year marriage he had with María Inés is no longer the same. This brings family problems, her daughters to see this blame Inés for the abandonment of her father and she is only supported by her son Andrés, her friends Paulina, Rosario and her sister Consuelo her. The infidelity begins to end her but finally she meets Alejandro Salas, a journalist and journalist 16 years younger than her who is divorced and has a son, Alex who does not see her as a mother, Alejandro does not see María Inés as a mother but as a woman, something that she had forgotten and over time they fall in love and she must have a woman's gaze to visualize her surroundings. ==Cast== ===Main Cast=== *Angélica Aragón as María Inés Domínguez de Sanmillán *Ari Telch as Alejandro Salas *Fernando Luján as Lic. Ignacio Sanmillán * Margarita Gralia as Paulina * Evangelina Elizondo as Doña Emilia Elena viuda de Domínguez 'Mamá Elena' * Verónica Langer as Rosario * María Renée Prudencio as Adriana Sanmillán * Bárbara Mori as Mónica Sanmillán * Plutarco Haza as Andrés Sanmillán * Martha Mariana Castro as Daniela ===Supporting Cast=== : Muriel Fouilland as Ivana : Álvaro Carcaño Jr as Nicolás : Olmo Araiza as Alex Salas : Carlos Torres Torrija as Marcos : Paloma Woolrich as Consuelo : Carmen Madrid as Marcela : René Gatica as Francisco : Mariana Peñalva as Andrea : Víctor González as Fernando : Alma Rosa Añorve as Gloria : Enrique Singer as Enrique : Dora Montero as Elvia : Ana Graham as Marina : Guadalupe Noel as Doña Felisa (1997-1998) == Awards and nominations == Year Award Category Nominee Result 1998 16th TVyNovelas Awards Best Telenovela Epigmenio Ibarra Carlos Payán 1998 16th TVyNovelas Awards Best Actress Angélica Aragón 1998 16th TVyNovelas Awards Best Actor Ari Telch 1998 16th TVyNovelas Awards Best Female Revelation Bárbara Mori rowspan=5 1998 El Heraldo de México Awards Best Telenovela of the Year Epigmenio Ibarra Carlos Payán 1998 El Heraldo de México Awards Best Young Actor Plutarco Haza 1999 Latin ACE Awards Best Actress Angélica Aragón 1999 Latin ACE Awards Best Actor Plutarco Haza ==References== == Other websites == * Category:Telenovelas by TV Azteca Category:1997 television series debuts Category:1998 television series endings",
 "title": "Mirada de mujer"
}