{
 "id": "942218",
 "text": "The theater of the absurd, or the drama of the absurd, is a trend in theatre (plays or acting) that uses absurdism. It started in the early 1950s in the theatre of France. In absurdist plays, unlike ordinary plays, the playwright conveys to the reader and the viewer his sense of a problem. This constantly violates logic. so the viewer, accustomed to ordinary theater, is confused and feels discomfort. That is the goal of \"illogical\" theater. It aims at getting the viewer to get rid of the patterns in his perception and look at his life in a new way. Supporters of the \"logical\" theater say that the world in the \"theater of the absurd\" is presented as a senseless, illogical pile of facts, deeds, words and destinies. When reading such plays, one can notice that they are made up of a number of quite logical fragments. The logic of the connection of these fragments differs sharply from the logic of the connection of the parts of an \"ordinary\" play. The principles of \"absurdism\" were most fully embodied in the dramas \"The Bald Singer\" (La cantatrice chauve, 1950) by the Romanian-French playwright Eugene Ionesco and \"Waiting for Godot\" (1952) by the Irish writer Samuel Beckett. == History == The term \"theater of the absurd\" first appeared in the works of theater critic Martin Esslin He wrote a book with that title in 1962. Esslin saw in certain works the artistic embodiment of Albert Camus' philosophy of the meaninglessness of life, which he illustrated in his book The Myth of Sisyphus. It is believed that the theater of the absurd is rooted in the philosophy of Dadaism, poetry from non- existent words and avant-garde art of the 1910-1920s. Despite sharp criticism, the genre gained popularity after the Second World War. That demonstrated the uncertainty and ephemeral nature of human life. The introduced term was also criticized. There were attempts to redefine it as \"anti-theater\" and \"new theater\". According to Esslin, the absurdist theatrical movement was based on the productions of four playwrights - Eugène Ionesco, Samuel Beckett, Jean Genet and Arthur Adamov. He emphasized that each of these authors had his own unique technique that went beyond the term \"absurdity\". The following group of writers is often distinguished - Tom Stoppard, Friedrich Dürrenmatt, Fernando Arrabal, Harold Pinter, Edward Albee and Jean Tardieu. Eugene Ionesco did not recognize the term \"theater of the absurd\" and called it \"the theater of mockery.\" Igor Stravinsky, Alfred Jarry, Luigi Pirandello, Stanislav Vitkevich, Guillaume Apollinaire, surrealists and many others are considered to be the inspirers of the movement. The “theater of the absurd” (or “new theatre”) movement apparently started in Paris as an avant-garde phenomenon associated with small theaters in the Latin Quarter. After some time it gained worldwide recognition. It is believed that the theater of the absurd denies realistic characters, situations and all other relevant theatrical devices. Time and place are uncertain and changeable. Even the simplest causal relationships are destroyed. Senseless intrigues, repetitive dialogues and aimless chatter, dramatic inconsistency of actions – everything is subordinated to one goal: to create a fabulous, and maybe even terrible, mood. == References == Category:Theater",
 "title": "Theatre of the Absurd"
}