{
 "id": "942252",
 "text": "Warner Bros. Pictures Animation (WBPA), (formerly known as Warner Animation Group (WAG)) is an American animation studio by Jeff Robinov, the studio is the successor to the dissolved 2D traditional hand-drawn animation studio Warner Bros. Feature Animation, which shut down in 2004, and is also a sister to the regular Warner Bros. Animation studio. ==History== On January 7, 2013, Jeff Robinov (then head of the studio's motion picture division) founded a screenplay development department, nicknamed a \"think tank\" for developing theatrical animated films, known as the Warner Animation Group. Warner Bros. created the group with the hope that the box office reception of their films will be competitive with other animation studios' releases. On February 7, 2014, Warner Animation Group released their first film, The Lego Movie, a film animated by Animal Logic, which also provided the animation for both spin- offs. It was met with critical praise and proved to be a box-office success. Due to the movie's success, a media franchise was created, with two spin-offs, The Lego Batman Movie and The Lego Ninjago Movie (both 2017), and a sequel, The Lego Movie 2: The Second Part (2019). While The Lego Batman Movie proved to be successful at the box office, The Lego Ninjago Movie and The Lego Movie 2: The Second Part were both unable to recoup its budget, with Ninjago being the first film from the Warner Animation Group to be a box-office flop. == Released movies == # Title Release date Distributor/Co-production with Animation service Released by Notes 1 The Lego Movie February 7, 2014 Warner Bros. Pictures Village Roadshow Pictures Lego System A/S Animal Logic Theatrical First Warner Animation Group in 3D. 2 Storks September 23, 2016 RatPac-Dune Entertainment Sony Pictures Imageworks Second Warner Animation Group in 3D. First Warner Animation Group in IMAX. 3 The Lego Batman Movie February 10, 2017 Warner Bros. Pictures DC Entertainment Animal Logic Third Warner Animation Group in 3D. Second Warner Animation Group in IMAX. 4 The Lego Ninjago Movie September 22, 2017 Warner Bros. Pictures Lego System A/S RatPac-Dune Entertainment Fourth Warner Animation Group in 3D. 5 Smallfoot September 28, 2018 Warner Bros. Pictures Zaftig Films Sony Pictures Imageworks Fifth Warner Animation Group in 3D. First Warner Animation Group’s Musical. 6 The Lego Movie 2: The Second Part February 8, 2019 Warner Bros. Pictures Lego System A/S Last Warner Animation Group in 3D. Last Warner Animation Group in IMAX. Last Warner Animation Group’s Musical. 7 Scoob! May 15, 2020 Warner Bros. Pictures Reel FX Creative Studios Digital 8 Tom & Jerry February 26, 2021 Warner Bros. Pictures The Story Company Framestore Theatrical and Digital First Warner Animation Group film released thought Theaters and HBO Max. 9 Space Jam: A New Legacy July 16, 2021 Warner Bros. Pictures Proximity The SpringHill Company Industrial Light & Magic Theatrical and Digital Last Warner Animation Group film released thought Theaters and HBO Max. 10 DC League of Super-Pets July 29, 2022 Warner Bros. Pictures DC Entertainment Seven Bucks Productions Animal Logic Theatrical Last film under the name of Warner Animation Group. == Upcoming == # Title Release date Distributor/Co-production with Animation service 11 The Cat in the Hat March 6, 2026 Warner Bros. Pictures Dr. Seuss Enterprises - 12 Thing One and Thing Two 2026 13 Bad Fairies July 23, 2027 Locksmith Animation Sketchshark Productions 14 Margie Claus November 5, 2027 On the Day Productions 15 Oh, the Places You'll Go! March 17, 2028 Dr. Seuss Enterprises Bad Robot Productions - 16 Dynamic Duo June 30, 2028 DC Studios 6th & Idaho Swaybox 17 Coyote vs. Acme TBA Two Monkeys, a Goat, and Another, Dead, Monkey 18 Toto TBA Warner Bros. Pictures Turner Entertainment Co. 19 The Lego Movie 3 TBA Warner Bros. Pictures Animation ==Process== Similar to Paramount Animation and Sony Pictures Animation, Warner Bros. Pictures Animation outsources their computer-animated films' production to other studios such as Animal Logic (The Lego Movie franchise, DC League of Super-Pets and Toto), Sony Pictures Imageworks (Storks and Smallfoot), Reel FX Creative Studios (Scoob!), Framestore (Tom & Jerry) and Industrial Light & Magic (Space Jam: A New Legacy). However, Space Jam: A New Legacy did also include hand-drawn animation, which is done in-house and also outsourced from Company 3 Animation, and Tonic DNA. The budgets for their films tend to range from $60–80 million. Their most expensive films to date are The Lego Movie 2: The Second Part ($99 million), Scoob! ($90 million), Space Jam: A New Legacy ($150 million), and DC League of Super-Pets ($90 million). ==Filmography== ===Franchises=== Title Films Short films Release dates The Lego Movie 4 11 2014–2019 DC 2 0 2017–present Tom & Jerry 1 2021–present Looney Tunes 2021–present ==References== Category:2013 establishments in the United States",
 "title": "Warner Bros. Pictures Animation"
}