{
 "id": "942414",
 "text": "The Academy Award for Best Sound is a yearly award given by the Academy of Motion Picture Arts and Sciences. The award is for best sound mixing, editing, recording and sound design. == Nominations and Awards == === 1970s === Year Film Nominees 1970(43rd) Patton Douglas Williams and Don Bassman Airport Ronald Pierce and David H. Moriarty Ryan's Daughter Gordon McCallum and John Bramall Tora! Tora! Tora! Murray Spivack and Herman Lewis Woodstock Dan Wallin and L. A. Johnson 1971(44th) Fiddler on the Roof Gordon McCallum and David Hildyard Diamonds Are Forever Gordon McCallum, John W. Mitchell and Al Overton The French Connection Theodore Soderberg and Christopher Newman Kotch Richard Portman and Jack Solomon Mary, Queen of Scots Bob Jones and John Aldred 1972(45th) Cabaret Robert Knudson and David Hildyard Butterflies Are Free Arthur Piantadosi and Charles T. Knight The Candidate Richard Portman and Gene Cantamessa The Godfather Charles Grenzbach, Richard Portman and Christopher Newman The Poseidon Adventure Theodore Soderberg and Herman Lewis 1973(46th) The Exorcist Robert Knudson and Chris Newman The Day of the Dolphin Richard Portman and Larry Jost The Paper Chase Donald O. Mitchell and Larry Jost Paper Moon Richard Portman and Les Fresholtz The Sting Ronald Pierce and Robert R. Bertrand 1974(47th) Earthquake Ronald Pierce and Melvin Metcalfe Sr. Chinatown Charles Grenzbach and Larry Jost The Conversation Walter Murch and Art Rochester The Towering Inferno Theodore Soderberg and Herman Lewis Young Frankenstein Richard Portman and Gene Cantamessa 1975(48th) Best Sound Jaws Robert Hoyt, Roger Heman, Earl Madery and John Carter Bite the Bullet Arthur Piantadosi, Les Fresholtz, Richard Tyler and Al Overton Jr. Funny Lady Richard Portman, Don MacDougall, Curly Thirlwell and Jack Solomon The Hindenburg Leonard Peterson, John A. Bolger Jr., John L. Mack and Don Sharpless The Wind and the Lion Harry W. Tetrick, Aaron Rochin, William McCaughey and Roy Charman Special Achievement Award (Sound Effects)This was presented as a Special Achievement Award, not competitively. The Hindenburg Peter Berkos 1976(49th) Best Sound All the President's Men Arthur Piantadosi, Les Fresholtz, Dick Alexander and Jim Webb King Kong Harry W. Tetrick (posthumously), William McCaughey, Aaron Rochin and Jack Solomon Rocky Harry W. Tetrick (posthumously), William McCaughey, Lyle J. Burbridge and Bud Alper Silver Streak Donald O. Mitchell, Douglas Williams, Richard Tyler and Harold M. Etherington A Star Is Born Robert Knudson, Dan Wallin, Robert Glass and Tom Overton 1977(50th) Best Sound Star Wars Don MacDougall, Ray West, Bob Minkler and Derek Ball Close Encounters of the Third Kind Robert Knudson, Robert Glass, Don MacDougall and Gene Cantamessa The Deep Walter Goss, Dick Alexander, Tom Beckert and Robin Gregory Sorcerer Robert Knudson, Robert Glass, Richard Tyler and Jean-Louis Ducarme The Turning Point Theodore Soderberg, Paul Wells, Douglas Williams and Jerry Jost Special Achievement Award (Sound Effects Editing) Close Encounters of the Third Kind Frank E. Warner 1978(51st) Best Sound The Deer Hunter Richard Portman, William McCaughey, Aaron Rochin and Darin Knight The Buddy Holly Story Tex Rudloff, Joel Fein, Curly Thirlwell and Willie D. Burton Days of Heaven John Wilkinson, Robert W. Glass Jr., John T. Reitz and Barry Thomas Hooper Robert Knudson, Robert Glass, Don MacDougall and Jack Solomon Superman Gordon McCallum, Graham V. Hartstone, Nicolas Le Messurier and Roy Charman 1979(52nd) Best Sound Apocalypse Now Walter Murch, Mark Berger, Richard Beggs and Nat Boxer The Electric Horseman Arthur Piantadosi, Les Fresholtz, Michael Minkler and Al Overton Jr. Meteor William McCaughey, Aaron Rochin, Michael J. Kohut and Jack Solomon 1941 Robert Knudson, Robert Glass, Don MacDougall and Gene Cantamessa The Rose Theodore Soderberg, Douglas Williams, Paul Wells and Jim Webb Special Achievement Award (Sound Editing) The Black Stallion Alan Splet === 1980s === Year Film Nominees 1980(53rd) The Empire Strikes Back Bill Varney, Steve Maslow, Gregg Landaker and Peter Sutton Altered States Arthur Piantadosi, Les Fresholtz, Michael Minkler and Willie D. Burton Coal Miner's Daughter Richard Portman, Roger Heman and James R. Alexander Fame Michael J. Kohut, Aaron Rochin, Jay M. Harding and Christopher Newman Raging Bull Donald O. Mitchell, Bill Nicholson, David J. Kimball and Les Lazarowitz 1981(54th) Best Sound Raiders of the Lost Ark Bill Varney, Steve Maslow, Gregg Landaker and Roy Charman On Golden Pond Richard Portman and David M. Ronne Outland John Wilkinson, Robert W. Glass Jr., Robert Thirlwell and Robin Gregory Pennies from Heaven Michael J. Kohut, Jay M. Harding, Richard Tyler and Al Overton Jr. Reds Dick Vorisek, Tom Fleischman and Simon Kaye Special Achievement Award (Sound Effects Editing) Raiders of the Lost Ark Ben Burtt and Richard L. Anderson 1982(55th) Best Sound E.T. the Extra-Terrestrial Robert Knudson, Robert Glass, Don Digirolamo and Gene Cantamessa Das Boot Milan Bor, Trevor Pyke and Mike Le Mare Gandhi Gerry Humphreys, Robin O'Donoghue, Jonathan Bates and Simon Kaye Tootsie Arthur Piantadosi, Les Fresholtz, Dick Alexander and Les Lazarowitz Tron Michael Minkler, Bob Minkler, Lee Minkler and James LaRue Best Sound Effects Editing E.T. the Extra-Terrestrial Charles L. Campbell and Ben Burtt Das Boot Mike Le Mare Poltergeist Stephen Hunter Flick and Richard L. Anderson 1983(56th) Best Sound The Right Stuff Randy Thom, Mark Berger, Tom Scott and David MacMillan Never Cry Wolf Randy Thom, David Parker, Todd Boekelheide and Alan Splet Return of the Jedi Ben Burtt, Randy Thom, Gary Summers and Tony Dawe Terms of Endearment Donald O. Mitchell, Rick Kline, Kevin O'Connell and James R. Alexander WarGames Michael J. Kohut, Carlos Delarios, Aaron Rochin and Willie D. Burton Best Sound Effects Editing The Right Stuff Jay Boekelheide Return of the Jedi Ben Burtt 1984(57th) Best Sound Amadeus Mark Berger, Tom Scott, Todd Boekelheide and Chris Newman Dune Kevin O'Connell, Steve Maslow, Bill Varney and Nelson Stoll A Passage to India Graham V. Hartstone, Nicolas Le Messurier, Michael A. Carter and John W. Mitchell The River Nick Alphin, Robert Thirlwell, Richard Portman and David M. Ronne 2010: The Year We Make Contact Michael J. Kohut, Aaron Rochin, Carlos Delarios and Gene Cantamessa Special Achievement Award (Sound Effects Editing) The River Kay Rose 1985(58th) Best Sound Out of Africa Chris Jenkins, Gary Alexander, Larry Stensvold and Peter Handford Back to the Future Bill Varney, B. Tennyson Sebastian II, Robert Thirlwell and William B. Kaplan A Chorus Line Donald O. Mitchell, Michael Minkler, Gerry Humphreys and Christopher Newman Ladyhawke Les Fresholtz, Dick Alexander, Vern Poore and Bud Alper Silverado Donald O. Mitchell, Rick Kline, Kevin O'Connell and David M. Ronne Best Sound Effects Editing Back to the Future Charles L. Campbell and Robert Rutledge Ladyhawke Robert G. Henderson and Alan Robert Murray Rambo: First Blood Part II Frederick Brown 1986(59th) Best Sound Platoon John Wilkinson, Richard Rogers, Charles Grenzbach and Simon Kaye Aliens Graham V. Hartstone, Nicolas Le Messurier, Michael A. Carter and Roy Charman Heartbreak Ridge Les Fresholtz, Dick Alexander, Vern Poore and Bill Nelson Star Trek IV: The Voyage Home Terry Porter, David J. Hudson, Mel Metcalfe and Gene Cantamessa Top Gun Kevin O'Conell, Donald O. Mitchell, Rick Kline and William B. Kaplan Best Sound Effects Editing Aliens Don Sharpe Star Trek IV: The Voyage Home Mark Mangini Top Gun George D. Watters II and Cecelia Hall 1987(60th) Best Sound The Last Emperor Bill Rowe and Ivan Sharrock Empire of the Sun Robert Knudson, Don Digirolamo, John Boyd and Tony Dawe Lethal Weapon Les Fresholtz, Dick Alexander, Vern Poore and Bill Nelson RoboCop Michael J. Kohut, Carlos Delarios, Aaron Rochin and Robert Wald The Witches of Eastwick Wayne Artman, Tom Beckert, Tom E. Dahl and Art Rochester Special Achievement Award (Sound Effects Editing) RoboCop Stephen Hunter Flick and John Pospisil 1988(61st) Best Sound Bird Les Fresholtz, Dick Alexander, Vern Poore and Willie Burton Die Hard Don J. Bassman, Kevin F. Cleary, Richard Overton and Al Overton Jr. Gorillas in the Mist Andy Nelson, Brian Saunders and Peter Handford Mississippi Burning Robert J. Litt, Elliot Tyson, Rick Kline and Danny Michael Who Framed Roger Rabbit Robert Knudson, John Boyd, Don Digirolamo and Tony Dawe Best Sound Effects Editing Who Framed Roger Rabbit Charles L. Campbell and Louis Edemann Die Hard Stephen Hunter Flick and Richard Shorr Willow Ben Burtt and Richard Hymns 1989(62nd) Best Sound Glory Donald O. Mitchell, Gregg Rudloff, Elliot Tyson and Russell Williams II The Abyss Don J. Bassman, Kevin F. Cleary, Richard Overton and Lee Orloff Black Rain Kevin O'Connell Greg P. Russell, Donald O. Mitchell and Keith A. Wester Born on the Fourth of July Michael Minkler, Gregory H. Watkins, Wylie Stateman and Tod A. Maitland Indiana Jones and the Last Crusade Ben Burtt, Gary Summers, Shawn Murphy and Tony Dawe Best Sound Effects Editing Indiana Jones and the Last Crusade Ben Burtt and Richard Hymns Black Rain Milton Burrow and William Manger Lethal Weapon 2 Robert G. Henderson and Alan Robert Murray === 1990s === Year Film Nominees 1990(63rd) Best Sound Dances with Wolves Jeffrey Perkins, Bill W. Benton, Gregory H. Watkins and Russell Williams II Days of Thunder Kevin O'Conell, Charles M. Wilborn, Donald O. Mitchell and Rick Kline Dick Tracy Thomas Causey, Chris Jenkins, David E. Campbell and Doug Hemphill The Hunt for Red October Richard Bryce Goodman, Richard Overton, Kevin F. Cleary and Don J. Bassman Total Recall Nelson Stoll, Michael J. Kohut, Carlos Delarios and Aaron Rochin Best Sound Effects Editing The Hunt for Red October George D. Watters II and Cecelia Hall Flatliners Charles L. Campbell and Richard C. Franklin Total Recall Stephen Hunter Flick 1991(64th) Best Sound Terminator 2: Judgment Day Gary Rydstrom, Tom Johnson, Gary Summers and Lee Orloff Backdraft Gary Rydstrom, Randy Thom, Gary Summers and Glenn Williams Beauty and the Beast Terry Porter, Mel Metcalfe, David J. Hudson and Doc Kane JFK Michael Minkler, Gregg Landaker and Tod A. Maitland The Silence of the Lambs Tom Fleischman and Christopher Newman Best Sound Effects Editing Terminator 2: Judgment Day Gary Rydstrom and Gloria S. Borders Backdraft Gary Rydstrom and Richard Hymns Star Trek VI: The Undiscovered Country George Watters II and F. Hudson Miller 1992(65th) Best Sound The Last of the Mohicans Chris Jenkins, Doug Hemphill, Mark Smith and Simon Kaye Aladdin Terry Porter, Mel Metcalfe, David J. Hudson and Doc Kane A Few Good Men Kevin O'Connell, Rick Kline and Robert Eber Under Siege Donald O. Mitchell, Frank A. Montaño, Rick Hart and Scott D. Smith Unforgiven Les Fresholtz, Vern Poore, Dick Alexander and Rob Young Best Sound Effects Editing Bram Stoker's Dracula Tom McCarthy and David Stone Aladdin Mark Mangini Under Siege John Leveque and Bruce Stambler 1993(66th) Best Sound Jurassic Park Gary Rydstrom, Gary Summers, Shawn Murphy and Ron Judkins Cliffhanger Michael Minkler, Bob Beemer and Tim Cooney The Fugitive Donald O. Mitchell, Michael Herbick, Frank A. Montaño and Scott D. Smith Geronimo: An American Legend Chris Carpenter, Doug Hemphill, Bill W. Benton and Lee Orloff Schindler's List Andy Nelson, Steve Pederson, Scott Millan and Ron Judkins Best Sound Effects Editing Jurassic Park Gary Rydstrom and Richard Hymns Cliffhanger Wylie Stateman and Gregg Baxter The Fugitive John Leveque and Bruce Stambler 1994(67th) Best Sound Speed Gregg Landaker, Steve Maslow, Bob Beemer and David MacMillan Clear and Present Danger Donald O. Mitchell, Michael Herbick, Frank A. Montaño and Art Rochester Forrest Gump Randy Thom, Tom Johnson, Dennis S. Sands and William B. Kaplan Legends of the Fall Paul Massey, David E. Campbell, Chris David and Douglas Ganton The Shawshank Redemption Robert J. Litt, Elliot Tyson, Michael Herbick and Willie D. Burton Best Sound Effects Editing Speed Stephen Hunter Flick Clear and Present Danger Bruce Stambler and John Leveque Forrest Gump Randy Thom and Gloria S. Borders 1995(68th) Best Sound Apollo 13 Rick Dior, Steve Pederson, Scott Millan and David MacMillan Batman Forever Donald O. Mitchell, Frank A. Montaño, Michael Herbick and Petur Hliddal Braveheart Andy Nelson, Scott Millan, Anna Behlmer and Brian Simmons Crimson Tide Kevin O'Connell, Rick Kline, Gregory H. Watkins and William B. Kaplan Waterworld Steve Maslow, Gregg Landaker and Keith A. Wester Best Sound Effects Editing Braveheart Lon Bender and Per Hallberg Batman Forever John Leveque and Bruce Stambler Crimson Tide George D. Watters II 1996(69th) Best Sound The English Patient Walter Murch, Mark Berger, David Parker and Chris Newman Evita Andy Nelson, Anna Behlmer and Ken Weston Independence Day Chris Carpenter, Bill W. Benton, Bob Beemer and Jeff Wexler The Rock Kevin O'Connell, Greg P. Russell and Keith A. Wester Twister Kevin O'Connell, Gregg Landaker, Steve Maslow and Geoffrey Patterson Best Sound Effects Editing The Ghost and the Darkness Bruce Stambler Daylight Richard Anderson and David A. Whittaker Eraser Alan Robert Murray and Bub Asman 1997(70th) Best Sound Titanic Gary Rydstrom, Tom Johnson, Gary Summers and Mark Ulano Air Force One Paul Massey, Rick Kline, Doug Hemphill and Keith A. Wester Con Air Kevin O'Connell, Greg P. Russell and Art Rochester Contact Randy Thom, Tom Johnson, Dennis S. Sands and William B. Kaplan L.A. Confidential Andy Nelson, Anna Behlmer and Kirk Francis Best Sound Effects Editing Titanic Christopher Boyes and Tom Bellfort Face/Off Mark P. Stoeckinger and Per Hallberg The Fifth Element Mark Mangini 1998(71st) Best Sound Saving Private Ryan Gary Rydstrom, Gary Summers, Andy Nelson and Ron Judkins Armageddon Kevin O'Connell, Greg P. Russell and Keith A. Wester The Mask of Zorro Kevin O'Connell, Greg P. Russell and Pud Cusack Shakespeare in Love Robin O'Donoghue, Dominic Lester and Peter Glossop The Thin Red Line Andy Nelson, Anna Behlmer and Paul Brincat Best Sound Effects Editing Saving Private Ryan Gary Rydstrom and Richard Hymns Armageddon George Watters II The Mask of Zorro David McMoyler 1999(72nd) Best Sound The Matrix John T. Reitz, Gregg Rudloff, David E. Campbell and David Lee The Green Mile Robert J. Litt, Elliot Tyson, Michael Herbick and Willie D. Burton The Insider Andy Nelson, Doug Hemphill and Lee Orloff The Mummy Leslie Shatz, Chris Carpenter, Rick Kline and Chris Munro Star Wars: Episode I – The Phantom Menace Gary Rydstrom, Tom Johnson, Shawn Murphy and John Midgley Best Sound Effects Editing The Matrix Dane A. Davis Fight Club Ren Klyce and Richard Hymns Star Wars: Episode I – The Phantom Menace Ben Burtt and Tom Bellfort === 2000s === Year Film Nominees 2000(73rd) Best Sound Gladiator Scott Millan, Bob Beemer and Ken Weston Cast Away Randy Thom, Tom Johnson, Dennis S. Sands and William B. Kaplan The Patriot Kevin O'Connell, Greg P. Russell and Lee Orloff The Perfect Storm John T. Reitz, Gregg Rudloff, David E. Campbell and Keith A. Wester U-571 Steve Maslow, Gregg Landaker, Rick Kline and Ivan Sharrock Best Sound Editing U-571 Jon Johnson Space Cowboys Bub Asman and Alan Robert Murray 2001(74th) Best Sound Black Hawk Down Michael Minkler, Myron Nettinga and Chris Munro Amélie Vincent Arnardi, Guillaume Leriche and Jean Umansky The Lord of the Rings: The Fellowship of the Ring Christopher Boyes, Michael Semanick, Gethin Creagh and Hammond Peek Moulin Rouge! Andy Nelson, Anna Behlmer, Roger Savage and Guntis Sics Pearl Harbor Kevin O'Connell, Greg P. Russell and Peter J. Devlin Best Sound Editing Pearl Harbor George Watters II and Christopher Boyes Monsters, Inc. Gary Rydstrom and Michael Silvers 2002(75th) Best Sound Chicago Michael Minkler, Dominick Tavella and David Lee Gangs of New York Tom Fleischman, Eugene Gearty and Ivan Sharrock The Lord of the Rings: The Two Towers Christopher Boyes, Michael Semanick, Michael Hedges and Hammond Peek Road to Perdition Scott Millan, Bob Beemer and John Pritchett Spider-Man Kevin O'Connell, Greg P. Russell and Ed Novick Best Sound Editing The Lord of the Rings: The Two Towers Ethan Van der Ryn and Mike Hopkins Minority Report Gary Rydstrom and Richard Hymns Road to Perdition Scott A. Hecker 2003(76th) Best Sound Mixing The Lord of the Rings: The Return of the King Christopher Boyes, Michael Semanick, Michael Hedges and Hammond Peek The Last Samurai Andy Nelson, Anna Behlmer and Jeff Wexler Master and Commander: The Far Side of the World Paul Massey, Doug Hemphill and Art Rochester Pirates of the Caribbean: The Curse of the Black Pearl Christopher Boyes, David Parker, David E. Campbell and Lee Orloff Seabiscuit Andy Nelson, Anna Behlmer and Tod A. Maitland Best Sound Editing Master and Commander: The Far Side of the World Richard King Finding Nemo Gary Rydstrom and Michael Silvers Pirates of the Caribbean: The Curse of the Black Pearl Christopher Boyes and George D. Watters II 2004(77th) Best Sound Mixing Ray Scott Millan, Greg Orloff, Bob Beemer and Steve Cantamessa The Aviator Tom Fleischman and Petur Hliddal The Incredibles Randy Thom, Gary A. Rizzo and Doc Kane The Polar Express Randy Thom, Tom Johnson, Dennis S. Sands and William B. Kaplan Spider-Man 2 Kevin O'Connell, Greg P. Russell, Jeffrey J. Haboush and Joseph Geisinger Best Sound Editing The Incredibles Randy Thom and Michael Silvers The Polar Express Randy Thom and Dennis Leonard Spider-Man 2 Paul N. J. Ottosson 2005(78th) Best Sound Mixing King Kong Christopher Boyes, Michael Semanick, Michael Hedges and Hammond Peek The Chronicles of Narnia: The Lion, the Witch and the Wardrobe Terry Porter, Dean A. Zupancic and Tony Johnson Memoirs of a Geisha Kevin O'Connell, Greg P. Russell, Rick Kline and John Pritchett Walk the Line Paul Massey, Doug Hemphill and Peter Kurland War of the Worlds Andy Nelson, Anna Behlmer and Ron Judkins Best Sound Editing King Kong Mike Hopkins and Ethan Van der Ryn Memoirs of a Geisha Wylie Stateman War of the Worlds Richard King 2006(79th) Best Sound Mixing Dreamgirls Michael Minkler, Bob Beemer and Willie D. Burton Apocalypto Kevin O'Connell, Greg P. Russell and Fernando Cámara Blood Diamond Andy Nelson, Anna Behlmer and Ivan Sharrock Flags of Our Fathers John T. Reitz, David E. Campbell, Gregg Rudloff and Walt Martin Pirates of the Caribbean: Dead Man's Chest Paul Massey, Christopher Boyes and Lee Orloff Best Sound Editing Letters from Iwo Jima Bub Asman and Alan Robert Murray Apocalypto Kami Asgar and Sean McCormack Blood Diamond Lon Bender Flags of Our Fathers Alan Robert Murray and Bub Asman Pirates of the Caribbean: Dead Man's Chest Christopher Boyes and George D. Watters II 2007(80th) Best Sound Mixing The Bourne Ultimatum Scott Millan, David Parker and Kirk Francis No Country for Old Men Skip Lievsay, Craig Berkey, Greg Orloff and Peter Kurland Ratatouille Randy Thom, Michael Semanick and Doc Kane 3:10 to Yuma Paul Massey, David Giammarco and Jim Stuebe Transformers Kevin O'Connell, Greg P. Russell and Peter J. Devlin Best Sound Editing The Bourne Ultimatum Karen Baker Landers and Per Hallberg No Country for Old Men Skip Lievsay Ratatouille Randy Thom and Michael Silvers There Will Be Blood Christopher Scarabosio and Matthew Wood Transformers Ethan Van der Ryn and Mike Hopkins 2008(81st) Best Sound Mixing Slumdog Millionaire Ian Tapp, Richard Pryke and Resul Pookutty The Curious Case of Benjamin Button Ren Klyce, Michael Semanick, David Parker and Mark Weingarten The Dark Knight Lora Hirschberg, Gary A. Rizzo and Ed Novick WALL-E Tom Myers, Michael Semanick and Ben Burtt Wanted Chris Jenkins, Frank A. Montaño and Petr Forejt Best Sound Editing The Dark Knight Richard King Iron Man Christopher Boyes and Frank E. Eulner Slumdog Millionaire Tom Sayers and Glenn Freemantle WALL-E Ben Burtt and Matthew Wood Wanted Wylie Stateman 2009(82nd) Best Sound Mixing The Hurt Locker Paul N.J. Ottosson and Ray Beckett Avatar Christopher Boyes, Gary Summers, Andy Nelson and Tony Johnson Inglourious Basterds Michael Minkler, Tony Lamberti and Mark Ulano Star Trek Anna Behlmer, Andy Nelson and Peter J. Devlin Transformers: Revenge of the Fallen Greg P. Russell, Gary Summers and Geoffrey Patterson Best Sound Editing The Hurt Locker Paul N.J. Ottosson Avatar Christopher Boyes and Gwendolyn Yates Whittle Inglourious Basterds Wylie Stateman Star Trek Mark P. Stoeckinger and Alan Rankin Up Tom Myers and Michael Silvers === 2010s === Year Film Nominees 2010(83rd) Best Sound Mixing Inception Lora Hirschberg, Gary A. Rizzo and Ed Novick The King's Speech Paul Hamblin, Martin Jensen and John Midgley Salt Jeffrey J. Haboush, Greg P. Russell, Scott Millan and William Sarokin The Social Network Ren Klyce, Michael Semanick, David Parker and Mark Weingarten True Grit Skip Lievsay, Craig Berkey, Greg Orloff and Peter Kurland Best Sound Editing Inception Richard King Toy Story 3 Tom Myers and Michael Silvers Tron: Legacy Gwendolyn Yates Whittle and Addison Teague True Grit Skip Lievsay and Craig Berkey Unstoppable Mark P. Stoeckinger 2011(84th) Best Sound Mixing Hugo Tom Fleischman and John Midgley The Girl with the Dragon Tattoo Ren Klyce, Michael Semanick, David Parker and Bo Persson Moneyball Deb Adair, Ron Bochar, Dave Giammarco and Ed Novick Transformers: Dark of the Moon Greg P. Russell, Gary Summers, Jeffrey J. Haboush and Peter J. Devlin War Horse Gary Rydstrom, Tom Johnson, Andy Nelson and Stuart Wilson Best Sound Editing Hugo Eugene Gearty and Philip Stockton Drive Lon Bender and Victor Ray Ennis The Girl with the Dragon Tattoo Ren Klyce Transformers: Dark of the Moon Ethan Van der Ryn and Erik Aadahl War Horse Gary Rydstrom and Richard Hymns 2012(85th) Best Sound Mixing Les Misérables Andy Nelson, Mark Paterson and Simon Hayes Argo John Reitz, Gregg Rudloff and Jose Antonio Garcia Life of Pi Ron Bartlett, D.M. Hemphill and Drew Kunin Lincoln Andy Nelson, Gary Rydstrom and Ronald Judkins Skyfall Scott Millan, Greg P. Russell and Stuart Wilson Best Sound EditingA tie in voting resulted in two winners. Skyfall (TIE) Per Hallberg and Karen Baker Landers Zero Dark Thirty (TIE) Paul N.J. Ottosson Argo Erik Aadahl and Ethan Van der Ryn Django Unchained Wylie Stateman Life of Pi Eugene Gearty and Philip Stockton 2013(86th) Best Sound Mixing Gravity Skip Lievsay, Niv Adiri, Christopher Benstead and Chris Munro Captain Phillips Chris Burdon, Mark Taylor, Mike Prestwood Smith and Chris Munro The Hobbit: The Desolation of Smaug Christopher Boyes, Michael Hedges, Michael Semanick and Tony Johnson Inside Llewyn Davis Skip Lievsay, Greg Orloff and Peter Kurland Lone Survivor Andy Koyama, Beau Borders and David Brownlow Best Sound Editing Gravity Glenn Freemantle All Is Lost Steve Boeddeker and Richard Hymns Captain Phillips Oliver Tarney The Hobbit: The Desolation of Smaug Brent Burge and Chris Ward Lone Survivor Wylie Stateman 2014(87th) Best Sound Mixing Whiplash Craig Mann, Ben Wilkins and Thomas Curley American Sniper John T. Reitz, Gregg Rudloff and Walt Martin (posthumously) Birdman or (The Unexpected Virtue of Ignorance) Jon Taylor, Frank A. Montaño and Thomas Varga Interstellar Gary A. Rizzo, Gregg Landaker and Mark Weingarten Unbroken Jon Taylor, Frank A. Montaño and David Lee Best Sound Editing American Sniper Alan Robert Murray and Bub Asman Birdman a.k.a. (The Unexpected Virtue of Ignorance) Martin Hernández and Aaron Glascock The Hobbit: The Battle of the Five Armies Brent Burge and Jason Canovas Interstellar Richard King Unbroken Becky Sullivan and Andrew DeCristofaro 2015(88th) Best Sound Mixing Mad Max: Fury Road Chris Jenkins, Gregg Rudloff and Ben Osmo Bridge of Spies Andy Nelson, Gary Rydstrom and Drew Kunin The Martian Paul Massey, Mark Taylor and Mac Ruth The Revenant Jon Taylor, Frank A. Montaño, Randy Thom and Chris Duesterdiek Star Wars: The Force Awakens Andy Nelson, Christopher Scarabosio and Stuart Wilson Best Sound Editing Mad Max: Fury Road Mark Mangini and David White The Martian Oliver Tarney The Revenant Martin Hernández and Lon Bender Sicario Alan Robert Murray Star Wars: The Force Awakens David Acord and Matthew Wood 2016(89th) Best Sound Mixing Hacksaw Ridge Kevin O'Connell, Andy Wright, Robert Mackenzie and Peter Grace Arrival Bernard Gariépy Strobl and Claude La Haye La La Land Andy Nelson, Ai-Ling Lee and Steven A. Morrow Rogue One: A Star Wars Story David Parker, Christopher Scarabosio and Stuart Wilson 13 Hours: The Secret Soldiers of Benghazi Gary Summers, Jeffrey J. Haboush and Mac Ruth Best Sound Editing Arrival Sylvain Bellemare Deepwater Horizon Wylie Stateman and Renée Tondelli Hacksaw Ridge Robert Mackenzie and Andy Wright La La Land Ai-Ling Lee and Mildred Iatrou Morgan Sully Alan Robert Murray and Bub Asman 2017(90th) Best Sound Mixing Dunkirk Gregg Landaker, Gary A. Rizzo and Mark Weingarten Baby Driver Julian Slater, Tim Cavagin and Mary H. Ellis Blade Runner 2049 Ron Bartlett, Doug Hemphill and Mac Ruth The Shape of Water Christian Cooke, Brad Zoern and Glen Gauthier Star Wars: The Last Jedi Ren Klyce, Michael Semanick, David Parker and Stuart Wilson Best Sound Editing Dunkirk Richard King and Alex Gibson Baby Driver Julian Slater Blade Runner 2049 Mark Mangini and Theo Green The Shape of Water Nathan Robitaille and Nelson Ferreira Star Wars: The Last Jedi Ren Klyce and Matthew Wood 2018(91st) Best Sound Mixing Bohemian Rhapsody Paul Massey, Tim Cavagin and John Casali Black Panther Steve Boeddeker, Brandon Proctor and Peter J. Devlin First Man Jon Taylor, Frank A. Montaño, Ai-Ling Lee and Mary H. Ellis Roma Skip Lievsay, Craig Henighan and José Antonio Garcia A Star Is Born Tom Ozanich, Dean Zupancic, Jason Ruder and Steve Morrow Best Sound Editing Bohemian Rhapsody John Warhurst and Nina Hartstone Black Panther Steve Boeddeker and Benjamin A. Burtt First Man Ai- Ling Lee and Mildred Iatrou Morgan A Quiet Place Ethan Van der Ryn and Erik Aadahl Roma Sergio Díaz and Skip Lievsay 2019(92nd) Best Sound Mixing 1917 Mark Taylor and Stuart Wilson Ad Astra Gary Rydstrom, Tom Johnson and Mark Ulano Ford v Ferrari Paul Massey, David Giammarco and Steven A. Morrow Joker Tom Ozanich, Dean Zupancic and Tod Maitland Once Upon a Time in Hollywood Michael Minkler, Christian P. Minkler and Mark Ulano Best Sound Editing Ford v Ferrari Donald Sylvester Joker Alan Robert Murray 1917 Oliver Tarney and Rachael Tate Once Upon a Time in Hollywood Wylie Stateman Star Wars: The Rise of Skywalker David Acord and Matthew Wood === 2020s === Year Film Nominees 2020/21(93rd) Sound of Metal Nicolas Becker, Jaime Baksht, Michelle Couttolenc, Carlos Cortés Navarrete and Phillip Bladh Greyhound Warren Shaw, Michael Minkler, Beau Borders and David Wyman Mank Ren Klyce, David Parker, Jeremy Molod, Nathan Nance and Drew Kunin News of the World Oliver Tarney, Mike Prestwood Smith, William Miller and John Pritchett Soul Ren Klyce, Coya Elliott and David Parker 2021(94th) Dune Mac Ruth, Mark Mangini, Theo Green, Doug Hemphill and Ron Bartlett Belfast Denise Yarde, Simon Chase, James Mather and Niv Adiri No Time to Die Simon Hayes, Oliver Tarney, James Harrison, Paul Massey and Mark Taylor The Power of the Dog Richard Flynn, Robert Mackenzie and Tara Webb West Side Story Gary Rydstrom, Tod A. Maitland, Brian Chumney, Andy Nelson and Shawn Murphy 2022 (95th) Top Gun: Maverick Al Nelson, Mark Weingarten, James H. Mather, Chris Burdon and Mark Taylor All Quiet on the Western Front Viktor Prášil, Frank Kruse, Markus Stemler, Lars Ginzel and Stefan Korte Avatar: The Way of Water Christopher Boyes, Gwendolyn Yates Whittle, Julian Howarth, Dick Bernstein, Gary Summers and Michael Hedges The Batman William E. Files, Stuart Wilson, Douglas Murray and Andy Nelson Elvis David Lee, Wayne Pashley, Andy Nelson and Michael Keller 2023 (96th) The Creator Ethan Van der Ryn, Erik Aadahl, Ian Voight, Tom Ozanich and Dean Zupancic Maestro Viktor Prášil, Frank Kruse, Markus Stemler, Lars Ginzel and Stefan Korte Mission: Impossible – Dead Reckoning Part One Chris Munro, James H. Mather, Chris Burdon and Mark Taylor Oppenheimer Richard King, Willie D. Burton, Gary A. Rizzo and Kevin O'Connell The Zone of Interest Tarn Willers and Johnnie Burn == Notes == == References == Sound Category:Lists of awards and nominations",
 "title": "Academy Award for Best Sound"
}