{
 "id": "94244",
 "text": "Valentin Louis Georges Eugène Marcel Proust (French pronounced: maʁsɛl pʁust) (10 July 1871 – 18 November 1922) was a French novelist, essayist and critic, best known as the author of À la recherche du temps perdu (in English, Remembrance of Things Past), a monumental work of twentieth-century fiction published in seven parts from 1913 to 1927. Proust was a homosexual. He died of pneumonia. == References == * Adorno, Theodor. \"Prisms.\" The MIT Press: Cambridge, MA. 1967. * Aciman, André (2004) The Proust Project. New York Farrar, Straus and Giroux * Albaret, Céleste (Barbara Bray, trans.) 2003 Monsieur Proust. New York: The New York Review of Books * Bernard, Anne-Marie (2002) The World of Proust, as seen by Paul Nadar. Cambridge: MIT Press * Carter, William C. (2000) Marcel Proust: A Life. New Haven: Yale University Press * Davenport-Hines, Richard (2006) A Night at the Majestic. London: Faber and Faber * De Botton, Alain (1998) How Proust Can Change Your Life. New York: Vintage Books * Deleuze, Gilles (2004) Proust and Signs: The Complete Text. Minneapolis: University of Minnesota Press * Painter, George D (1959) Marcel Proust A Biography Vols. 1 & 2\\. London: Chatto & Windus * Shattuck, Roger (1963) Proust's Binoculars: A Study of Memory, Time, and Recognition in À la recherche du temps perdu. New York: Random House * Shattuck, Roger (2000) Proust's Way: A Field Guide To In Search of Lost Time, New York: W. W. Norton * Tadié, Jean-Yves: MARCEL PROUST: A Life. Viking, New York, 2000 * White, Edmund (1998) Marcel Proust. New York: Viking Books === Online texts === * French text of volumes 1-4 and Swann's Way in English translation * University of Adelaide Library French text of volumes 1-4 and the complete novel in English translation * Works of Marcel Proust Category:1871 births Category:1922 deaths Category:Deaths from pneumonia Category:French novelists Category:French LGBT writers Category:Infectious disease deaths in France Category:Writers from Paris",
 "title": "Marcel Proust"
}