{
 "id": "942485",
 "text": "The Golden Globe Award for Best Motion Picture – Drama is an annual award. It is given by the Hollywood Foreign Press Association. It is part of the Golden Globe Awards. == 1940s == Year Film DirectorWhen there is more than one director, only the first billed is displayed. Producer/sWhen there is more than one producer, only the first billed is displayed. 1943 The Song of Bernadette Henry King William Perlberg 1944 Going My Way Leo McCarey Leo McCarey 1945 The Lost Weekend Billy Wilder Charles Brackett 1946 The Best Years of Our Lives William Wyler Samuel Goldwyn 1947 Gentleman's Agreement Elia Kazan Darryl F. Zanuck 1948 Johnny Belinda Jean Negulesco Jerry Wald The Treasure of the Sierra Madre John Huston Henry Blanke 1949 All the King's Men Robert Rossen Robert Rossen Come to the Stable Henry Koster Samuel G. Engel == 1950s == Year Film Director Producer/s 1950 Sunset Boulevard Billy Wilder Charles Brackett All About Eve Joseph L. Mankiewicz Darryl F. Zanuck Born Yesterday George Cukor S. Sylvain Simon Cyrano de Bergerac Michael Gordon Stanley Kramer Harvey Henry Koster John Beck 1951 A Place in the Sun George Stevens George Stevens Bright Victory Mark Robson Robert Buckner Detective Story William Wyler William Wyler Quo Vadis Mervyn LeRoy Sam Zimbalist A Streetcar Named Desire Elia Kazan Charles K. Feldman 1952 The Greatest Show on Earth Cecil B. DeMille Cecil B. DeMille Come Back, Little Sheba Daniel Mann Hal B. Wallis The Happy Time Richard Fleischer Earl Fenton High Noon Fred Zinnemann Stanley Kramer The Thief Russell Rouse Clarence Greene 1953 The Robe Henry Koster Frank Ross 1954The nominees' names are not listed for this year. On the Waterfront Elia Kazan Sam Spiegel 1955The nominees' names are not listed for this year. East of Eden Elia Kazan Elia Kazan 1956 Around the World in 80 Days Michael Anderson Kevin McClory Giant George Stevens Henry Ginsberg Lust for Life Vincente Minnelli John Houseman The Rainmaker Joseph Anthony Hal B. Wallis War and Peace King Vidor Dino De Laurentiis 1957 The Bridge on the River Kwai David Lean Sam Spiegel 12 Angry Men Sidney Lumet Henry Fonda Sayonara Joshua Logan William Goetz Wild Is the Wind George Cukor Hal B. Wallis Witness for the Prosecution Billy Wilder Arthur Hornblow Jr. 1958 The Defiant Ones Stanley Kramer Stanley Kramer Cat on a Hot Tin Roof Richard Brooks Lawrence Weingarten Home Before Dark Mervyn LeRoy Mervyn LeRoy I Want to Live! Robert Wise Claude Miller Separate Tables Delbert Mann Harold Hecht 1959 Ben-Hur William Wyler Sam Zimbalist Anatomy of a Murder Otto Preminger Otto Preminger The Diary of Anne Frank George Stevens George Stevens The Nun's Story Fred Zinnemann Henry Blanke On the Beach Stanley Kramer Stanley Kramer == 1960s == Year Film Director Producer/s 1960 Spartacus Stanley Kubrick Kirk Douglas Elmer Gantry Richard Brooks Bernard Smith Inherit the Wind Stanley Kramer Stanley Kramer Sons and Lovers Jack Cardiff Jerry Wald Sunrise at Campobello Vincent J. Donehue Dore Schary 1961 The Guns of Navarone J. Lee Thompson Carl Foreman El Cid Anthony Mann Samuel Bronston Fanny Joshua Logan Ben Kadish Judgment at Nuremberg Stanley Kramer Stanley Kramer Splendor in the Grass Elia Kazan Elia Kazan 1962 Lawrence of Arabia David Lean Sam Spiegel The Chapman Report George Cukor Darryl F. Zanuck Days of Wine and Roses Blake Edwards Martin Manulis Freud: The Secret Passion John Huston Wolfgang Reinhardt Hemingway's Adventures of a Young Man Martin Ritt Jerry Wald Lisa Philip Dunne Mark Robson The Longest Day Ken Annakin Darryl F. Zanuck The Miracle Worker Arthur Penn Fred Coe Mutiny on the Bounty Lewis Milestone Aaron Rosenberg To Kill a Mockingbird Robert Mulligan Alan J. Pakula 1963 The Cardinal Otto Preminger Martin C. Schute America America Elia Kazan Elia Kazan Captain Newman, M.D. David Miller Robert Arthur The Caretakers Hall Bartlett Hall Bartlett Cleopatra Joseph L. Mankiewicz Walter Wanger The Great Escape John Sturges John Sturges Hud Martin Ritt Irving Ravetch Lilies of the Field Ralph Nelson Ralph Nelson 1964 Becket Peter Glenville Hal B. Wallis The Chalk Garden Ronald Neame Ross Hunter Dear Heart Delbert Mann Martin Manulis The Night of the Iguana John Huston John Huston Zorba the Greek Michael Cacoyannis Michael Cacoyannis 1965 Doctor Zhivago David Lean Carlo Ponti The Collector William Wyler Jud Kinberg The Flight of the Phoenix Robert Aldrich Robert Aldrich A Patch of Blue Guy Green Guy Green Ship of Fools Stanley Kramer Stanley Kramer 1966 A Man for All Seasons Fred Zinnemann Fred Zinnemann Born Free James H. Hill Sam Jaffe The Professionals Richard Brooks Richard Brooks The Sand Pebbles Robert Wise Robert Wise Who's Afraid of Virginia Woolf? Mike Nichols Ernest Lehman 1967 In the Heat of the Night Norman Jewison Walter Mirisch Bonnie and Clyde Arthur Penn Warren Beatty Far from the Madding Crowd John Schlesinger Joseph Janni Guess Who's Coming to Dinner Stanley Kramer George Glass In Cold Blood Richard Brooks Richard Brooks 1968 The Lion in Winter Anthony Harvey Martin Poll CHAЯLY Ralph Nelson Ralph Nelson The Fixer John Frankenheimer Edward Lewis The Heart Is a Lonely Hunter Robert Ellis Miller Joel Freeman The Shoes of the Fisherman Michael Anderson George Englund 1969 Anne of the Thousand Days Charles Jarrott Hal B. Wallis Butch Cassidy and the Sundance Kid George Roy Hill John Foreman Midnight Cowboy John Schlesinger Jerome Hellman The Prime of Miss Jean Brodie Ronald Neame James Cresson They Shoot Horses, Don't They? Sydney Pollack Robert Chartoff == 1970s == Year Film Director Producer/s 1970 Love Story Arthur Hiller Howard G. Minsky Airport George Seaton Ross Hunter Five Easy Pieces Bob Rafelson Robert Daley I Never Sang for My Father Gilbert Cates Gilbert Cates Patton Franklin J. Schaffner Frank Caffey 1971 The French Connection William Friedkin Philip D'Antoni A Clockwork Orange Stanley Kubrick Si Litvinoff The Last Picture Show Peter Bogdanovich Stephen J. Friedman Mary, Queen of Scots Charles Jarrott Hal B. Wallis Summer of ‘42 Robert Mulligan Richard A. Roth 1972 The Godfather Francis Ford Coppola Albert S. Ruddy Deliverance John Boorman John Boorman Frenzy Alfred Hitchcock William Hill The Poseidon Adventure Ronald Neame Irwin Allen Sleuth Joseph L. Mankiewicz Morton Gottlieb 1973 The Exorcist William Friedkin William Peter Blatty Cinderella Liberty Mark Rydell Mark Rydell The Day of the Jackal Fred Zinnemann John Woolf Last Tango in Paris Bernardo Bertolucci Alberto Grimaldi Save the Tiger John G. Avildsen Edward S. Feldman Serpico Sidney Lumet Dino De Laurentiis 1974 Chinatown Roman Polanski Robert Evans The Conversation Francis Ford Coppola Francis Ford Coppola Earthquake Mark Robson Mark Robson The Godfather Part II Francis Ford Coppola Francis Ford Coppola A Woman Under the Influence John Cassavetes Sam Shaw 1975 One Flew Over the Cuckoo's Nest Miloš Forman Michael Douglas Barry Lyndon Stanley Kubrick Stanley Kubrick Dog Day Afternoon Sidney Lumet Martin Bregman Jaws Steven Spielberg David Brown Nashville Robert Altman Robert Altman 1976 Rocky John G. Avildsen Robert Chartoff and Irwin Winkler All the President's Men Alan J. Pakula Walter Coblenz Bound for Glory Hal Ashby Robert Blumofe Network Sidney Lumet Howard Gottfried Voyage of the Damned Stuart Rosenberg Robert Fryer 1977 The Turning Point Herbert Ross Arthur Laurents Close Encounters of the Third Kind Steven Spielberg Julia Phillips I Never Promised You a Rose Garden Anthony Page Daniel H. Blatt Julia Fred Zinnemann Richard A. Roth Star Wars George Lucas Gary Kurtz 1978 Midnight Express Alan Parker Alan Marshall Coming Home Hal Ashby Robert C. Jones Days of Heaven Terrence Malick Bert Schneider The Deer Hunter Michael Cimino Barry Spikings An Unmarried Woman Paul Mazursky Paul Mazursky 1979 Kramer vs. Kramer Robert Benton Stanley R. Jaffe Apocalypse Now Francis Ford Coppola Francis Ford Coppola The China Syndrome James Bridges Michael Douglas Manhattan Woody Allen Charles H. Joffe Norma Rae Martin Ritt Alexandra Rose == 1980s == Year Film Director Producer/s 1980 Ordinary People Robert Redford Ronald L. Schwary The Elephant Man David Lynch Jonathan Sanger The Ninth Configuration William Peter Blatty William Peter Blatty Raging Bull Martin Scorsese Robert Chartoff The Stunt Man Richard Rush Richard Rush 1981 On Golden Pond Mark Rydell Bruce Gilbert The French Lieutenant's Woman Karel Reisz Leon Clore Prince of the City Sidney Lumet Sidney Lumet Ragtime Miloš Forman Dino De Laurentiis Reds Warren Beatty Warren Beatty 1982 E.T. the Extra-Terrestrial Steven Spielberg Steven Spielberg Missing Costa-Gavras Edward Lewis An Officer and a Gentleman Taylor Hackford Martin Elfand Sophie's Choice Alan J. Pakula Alan J. Pakula The Verdict Sidney Lumet David Brown 1983 Terms of Endearment James L. Brooks James L. Brooks Reuben, Reuben Robert Ellis Miller Julius J. Epstein The Right Stuff Philip Kaufman Irwin Winkler Silkwood Mike Nichols Alice Arlen Tender Mercies Bruce Beresford Philip Hobel 1984 Amadeus Miloš Forman Saul Zaentz The Cotton Club Francis Ford Coppola Robert Evans The Killing Fields Roland Joffé David Puttnam Places in the Heart Robert Benton Robert Benton A Soldier's Story Norman Jewison Norman Jewison 1985 Out of Africa Sydney Pollack Sydney Pollack The Color Purple Steven Spielberg Steven Spielberg Kiss of the Spider Woman Hector Babenco David Weisman Runaway Train Andrei Konchalovsky Richard Garcia Witness Peter Weir Edward S. Feldman 1986 Platoon Oliver Stone Arnold Kopelson Children of a Lesser God Randa Haines Chris Bender The Mission Roland Joffé Fernando Ghia Mona Lisa Neil Jordan Stephen Woolley A Room with a View James Ivory Ismail Merchant Stand by Me Rob Reiner Bruce A. Evans 1987 The Last Emperor Bernardo Bertolucci Jeremy Thomas Cry Freedom Richard Attenborough Richard Attenborough Empire of the Sun Steven Spielberg Kathleen Kennedy Fatal Attraction Adrian Lyne Stanley R. Jaffe La Bamba Luis Valdez Stuart Benjamin Nuts Martin Ritt Teri Schwartz 1988 Rain Man Barry Levinson Mark Johnson The Accidental Tourist Lawrence Kasdan Phyllis Carlyle A Cry in the Dark Fred Schepisi Yoram Globus Gorillas in the Mist Michael Apted Peter Guber Mississippi Burning Alan Parker Robert F. Colesberry Running on Empty Sidney Lumet Griffin Dunne The Unbearable Lightness of Being Philip Kaufman Bertil Ohlsson 1989 Born on the Fourth of July Oliver Stone A. Kitman Ho Crimes and Misdemeanors Woody Allen Charles H. Joffe Dead Poets Society Peter Weir Paul Junger Witt Do the Right Thing Spike Lee Spike Lee Glory Edward Zwick Freddie Fields == 1990s == Year Film Director Producer/s 1990 Dances with Wolves Kevin Costner Jim Wilson and Kevin Costner Avalon Barry Levinson Mark Johnson The Godfather Part III Francis Ford Coppola Francis Ford Coppola Goodfellas Martin Scorsese Irwin Winkler Reversal of Fortune Barbet Schroeder Edward R. Pressman 1991 Bugsy Barry Levinson Warren Beatty JFK Oliver Stone Arnon Milchan The Prince of Tides Barbra Streisand Andrew S. Karsch The Silence of the Lambs Jonathan Demme Kenneth Utt Thelma & Louise Ridley Scott Mimi Polk Gitlin 1992 Scent of a Woman Martin Brest Martin Brest The Crying Game Neil Jordan Stephen Woolley A Few Good Men Rob Reiner David Brown Howards End James Ivory Ismail Merchant Unforgiven Clint Eastwood Clint Eastwood 1993 Schindler's List Steven Spielberg Steven Spielberg The Age of Innocence Martin Scorsese Barbara De Fina In the Name of the Father Jim Sheridan Jim Sheridan The Piano Jane Campion Jan Chapman The Remains of the Day James Ivory Ismail Merchant 1994 Forrest Gump Robert Zemeckis Wendy Finerman Legends of the Fall Edward Zwick Marshall Herskovitz Nell Michael Apted Jodie Foster Pulp Fiction Quentin Tarantino Lawrence Bender Quiz Show Robert Redford Robert Redford 1995 Sense and Sensibility Ang Lee Laurie Borg Apollo 13 Ron Howard Brian Grazer Braveheart Mel Gibson Mel Gibson The Bridges of Madison County Clint Eastwood Clint Eastwood Leaving Las Vegas Mike Figgis Lila Cazès 1996 The English Patient Anthony Minghella Saul Zaentz Breaking the Waves Lars von Trier Peter Aalbæk Jensen The People vs. Larry Flynt Miloš Forman Oliver Stone Secrets & Lies Mike Leigh Simon Channing-Williams Shine Scott Hicks Jane Scott 1997 Titanic James Cameron James Cameron and Jon Landau Amistad Steven Spielberg Debbie Allen The Boxer Jim Sheridan Arthur Lappin Good Will Hunting Gus Van Sant Lawrence Bender L.A. Confidential Curtis Hanson Curtis Hanson 1998 Saving Private Ryan Steven Spielberg Steven Spielberg Elizabeth Shekhar Kapur Tim Bevan Gods and Monsters Bill Condon Paul Colichman The Horse Whisperer Robert Redford Patrick Markey The Truman Show Peter Weir Edward S. Feldman 1999 American Beauty Sam Mendes Bruce Cohen The End of the Affair Neil Jordan Neil Jordan The Hurricane Norman Jewison Armyan Bernstein The Insider Michael Mann Pieter Jan Brugge The Talented Mr. Ripley Anthony Minghella William Horberg == 2000s == Year Film Director Producer/s 2000 Gladiator Ridley Scott Douglas Wick Billy Elliot Stephen Daldry Charles Brand Erin Brockovich Steven Soderbergh Danny DeVito Sunshine István Szabó András Hámori Traffic Steven Soderbergh Edward Zwick Wonder Boys Curtis Hanson Curtis Hanson 2001 A Beautiful Mind Ron Howard Brian Grazer In the Bedroom Todd Field Todd Field The Lord of the Rings: The Fellowship of the Ring Peter Jackson Peter Jackson, Barrie M. Osborne, Fran Walsh The Man Who Wasn't There Joel Coen Ethan Coen Mulholland Drive David Lynch Pierre Edelman 2002 The Hours Stephen Daldry Robert Fox and Scott Rudin About Schmidt Alexander Payne Michael Besman Gangs of New York Martin Scorsese Alberto Grimaldi The Lord of the Rings: The Two Towers Peter Jackson Peter Jackson, Barrie M. Osborne, Fran Walsh The Pianist Roman Polanski Roman Polanski 2003 The Lord of the Rings: The Return of the King Peter Jackson Peter Jackson, Barrie M. Osborne, Fran Walsh Cold Mountain Anthony Minghella Albert Berger Master and Commander: The Far Side of the World Peter Weir Peter Weir Mystic River Clint Eastwood Robert Lorenz Seabiscuit Gary Ross Kathleen Kennedy 2004 The Aviator Martin Scorsese Michael Mann Closer Mike Nichols Patrick Marber Finding Neverland Marc Forster Richard N. Gladstein Hotel Rwanda Terry George Terry George Kinsey Bill Condon Gail Mutrux Million Dollar Baby Clint Eastwood Clint Eastwood, Albert S. Ruddy, Tom Rosenberg 2005 Brokeback Mountain Ang Lee Diana Ossana The Constant Gardener Fernando Meirelles Simon Channing-Williams Good Night, and Good Luck George Clooney Grant Heslov A History of Violence David Cronenberg Chris Bender Match Point Woody Allen Letty Aronson 2006 Babel Alejandro González Iñárritu Steve Golin Bobby Emilio Estevez Anthony Hopkins The Departed Martin Scorsese Brad Grey Little Children Todd Field Albert Berger The Queen Stephen Frears François Ivernel 2007 Atonement Joe Wright Tim Bevan American Gangster Ridley Scott Brian Grazer Eastern Promises David Cronenberg Paul Webster The Great Debaters Denzel Washington Oprah Winfrey Michael Clayton Tony Gilroy Sydney Pollack No Country for Old Men Joel and Ethan Coen Joel Coen, Ethan Coen, Scott Rudin There Will Be Blood Paul Thomas Anderson Paul Thomas Anderson 2008 Slumdog Millionaire Danny Boyle Christian Colson The Curious Case of Benjamin Button David Fincher Kathleen Kennedy, Frank Marshall, Ray Stark Frost/Nixon Ron Howard Tim Bevan, Eric Fellner, Brian Grazer, Ron Howard The Reader Stephen Daldry Anthony Minghella, Sydney Pollack, Scott Rudin Revolutionary Road Sam Mendes Bobby Cohen, Sam Mendes, Scott Rudin 2009 Avatar James Cameron James Cameron and Jon Landau The Hurt Locker Kathryn Bigelow Kathryn Bigelow, Mark Boal, Nicolas Chartier, Tony Mark, Donall McCusker, Greg Shapiro Inglourious Basterds Quentin Tarantino Lawrence Bender Precious Lee Daniels Lisa Cortes, Sarah Siegel-Magness, Valerie Hoffman, Asger Hussain, Gary Magness, Mark G. Magges, Berrgen Swason, Simone Sheffield Up in the Air Jason Reitman Daniel Dubiecki, Jeffrey Clifford, Ivan Reitman, Jason Reitman == 2010s == Year Film Director Producer/s 2010 The Social Network David Fincher Scott Rudin, Dana Brunetti, Michael De Luca, Ceán Chaffin Black Swan Darren Aronofsky Mike Medavoy, Scott Franklin, Arnold Messer, Brian Oliver The Fighter David O. Russell David Hoberman, Todd Lieberman, Ryan Kavanaugh, Mark Wahlberg, Dorothy Aufiero, Paul Tamasy Inception Christopher Nolan Christopher Nolan and Emma Thomas The King's Speech Tom Hooper Iain Canning, Emile Sherman, Gareth Unwin 2011 The Descendants Alexander Payne Jim Burke, Alexander Payne, Jim Taylor The Help Tate Taylor Chris Columbus, Michael Barnathan, Brunson Green Hugo Martin Scorsese Johnny Depp, Timothy Headington, Graham King, Martin Scorsese The Ides of March George Clooney George Clooney, Grant Heslov, Brian Oliver Moneyball Bennett Miller Michael De Luca, Rachael Horovitz, Brad Pitt War Horse Steven Spielberg Steven Spielberg, Kathleen Kennedy 2012 Argo Ben Affleck Ben Affleck, George Clooney, Grant Heslov Django Unchained Quentin Tarantino Stacey Sher, Reginald Hudlin, Pilar Savone Life of Pi Ang Lee Ang Lee, Gil Netter, David Womark Lincoln Steven Spielberg Steven Spielberg, Kathleen Kennedy Zero Dark Thirty Kathryn Bigelow Kathryn Bigelow, Colin Wilson, Greg Shapiro, Ted Schipper, Megan Ellison 2013 12 Years a Slave Steve McQueen Brad Pitt, Dede Gardner, Jeremy Kleiner, Bill Pohlad, Steve McQueen, Arnon Milchan, Anthony Katagas Captain Phillips Paul Greengrass Michael De Luca, Dana Brunetti, Scott Rudin Gravity Alfonso Cuarón Alfonso Cuarón, David Heyman Philomena Stephen Frears Gabrielle Tana, Steve Coogan, Tracey Seaward Rush Ron Howard Andrew Eaton, Eric Fellner, Brian Oliver, Peter Morgan, Brian Grazer, Ron Howard 2014 Boyhood Richard Linklater Richard Linklater, Cathleen Sutherland, Jonathan Sehring, John Sloss Foxcatcher Bennett Miller Bennett Miller, Megan Ellison, Jon Kilik, Anthony Bregman The Imitation Game Morten Tyldum Nora Grossman, Ido Ostrowsky, Teddy Schwarzman Selma Ava DuVernay Dede Gardner, Jeremy Kleiner, Christian Colson, Oprah Winfrey The Theory of Everything James Marsh Tim Bevan, Eric Fellner, Lisa Bruce, Anthony McCarten 2015 The Revenant Alejandro G. Iñárritu Steve Golin, Alejandro G. Iñárritu, Arnon Milchan, Mary Parent, Keith Redmon Carol Todd Haynes Elizabeth Karlsen, Christine Vachon, Stephen Woolley Mad Max: Fury Road George Miller Doug Mitchell, George Miller, P. J. Voeten Room Lenny Abrahamson Ed Guiney, David Gross Spotlight Tom McCarthy Steve Golin, Blye Pagon Faust, Nicole Rocklin, Michael Sugar 2016 Moonlight Barry Jenkins Dede Gardner, Jeremy Kleiner, Adele Romanski Hacksaw Ridge Mel Gibson Terry Benedict, Paul Currie, Bruce Davey, William D. Johnson, Bill Mechanic, Brian Oliver, David Permut Hell or High Water David Mackenzie Peter Berg, Carla Hacken, Sidney Kimmel, Gigi Pritzker, Rachel Shane, Julie Yorn Lion Garth Davis Iain Canning, Angie Fielder, Emile Sherman Manchester by the Sea Kenneth Lonergan Lauren Beck, Matt Damon, Chris Moore, Kimberly Steward, Kevin J. Walsh 2017 Three Billboards Outside Ebbing, Missouri Martin McDonagh Graham Broadbent, Pete Czernin, Martin McDonagh Call Me by Your Name Luca Guadagnino Peter Spears, Luca Guadagnino, Emilie Georges, Rodrigo Teixeira, Marco Morabito, James Ivory, Howard Rosenman Dunkirk Christopher Nolan Christopher Nolan and Emma Thomas The Post Steven Spielberg Steven Spielberg, Kristie Macosko Krieger, Amy Pascal The Shape of Water Guillermo del Toro Guillermo del Toro and J. Miles Dale 2018 Bohemian Rhapsody Bryan Singer Graham King and Jim Beach Black Panther Ryan Coogler Kevin Feige BlacKkKlansman Spike Lee Sean McKittrick, Jason Blum, Raymond Mansfield, Shaun Redick, Jordan Peele, Spike Lee If Beale Street Could Talk Barry Jenkins Adele Romanski, Sara Murphy, Barry Jenkins, Dede Gardner, Jeremy Kleiner A Star Is Born Bradley Cooper Bill Gerber, Bradley Cooper, Lynette Howell Taylor 2019 1917 Sam Mendes Sam Mendes, Pippa Harris, Jayne-Ann Tenggren, Callum McDougall, and Brian Oliver The Irishman Martin Scorsese Martin Scorsese, Robert De Niro, Jane Rosenthal, Emma Tillinger Koskoff, Irwin Winkler, Gerald Chamales, Gastón Pavlovich, Randall Emmett, Gabriele Israilovici Joker Todd Phillips Todd Phillips, Bradley Cooper, Emma Tillinger Koskoff Marriage Story Noah Baumbach David Heyman, Noah Baumbach The Two Popes Fernando Meirelles Dan Lin, Jonathan Eirich, Tracey Seaward == 2020s == Year Film Director Producer/s 2020 Nomadland Chloé Zhao Frances McDormand, Peter Spears, Mollye Asher, Dan Janvey, Chloé Zhao The Father Florian Zeller David Parfitt, Jean-Louis Livi, Philippe Carcassonne Mank David Fincher Ceán Chaffin, Eric Roth, Douglas Urbanski Promising Young Woman Emerald Fennell Josey McNamara, Ben Browning, Ashley Fox, Emerald Fennell The Trial of the Chicago 7 Aaron Sorkin Stuart M. Besser, Marc Platt 2021 The Power of the Dog Jane Campion Emile Sherman, Iain Canning, Roger Frappier, Jane Campion, Tanya Seghatchian Belfast Kenneth Branagh Laura Berwick, Kenneth Branagh, Becca Kovacik, Tamar Thomas CODA Sian Heder Fabrice Gianfermi, Philippe Rousselet, Jerôme Seydoux, Patrick Wachsberger Dune Denis Villeneuve Mary Parent, Denis Villeneuve, Cale Boyter, Joe Caracciolo Jr. King Richard Reinaldo Marcus Green Tim White, Trevor White, Will Smith ==References== Category:Movie awards",
 "title": "Golden Globe Award for Best Motion Picture – Drama"
}