{
 "id": "94252",
 "text": "The Puritans were a group of English-speaking Protestants in the 16th and 17th centuries. A Puritan was any person who tried to become purer through worship and doctrine. Puritans disagreed with some of the Church of England's actions and thought that the English Reformation had not gone far enough. In 1534, King Henry VIII separated from the Roman Catholic Church and established the Protestant Church of England. Queen Mary returned the Church to Roman Catholicism in 1553, and this did not change until Elizabeth I became Queen of England. Many people celebrated the return of a Protestant monarch, but some believed that the Church had not changed enough and was still too much like Catholicism.Encyclopedia Brittanica == Beliefs == The Puritans' beliefs and way of life were called Puritanism. The most important parts of Puritanism were piety (obeying religious rules), dressing simply, and living a modest life. The Puritans believed some of the same things as Calvinists and Scottish Presbyterians. All of these groups were devoted to the Bible and to being morally pure. One of the Puritans' most important beliefs was that every person needed to understand the Bible in his own way. (Most Protestants share this belief.) Puritans tried to live by the Bible's teachings in every way. They tried to be morally and spiritually pure in even the smallest ways. They thought that man existed for the glory of God, and that man's most important job in life was to do God's will (what God wanted). By doing God's will, they believed, man would be rewarded with future happiness. Because they did not agree with the way the Church of England did things, the Puritans made reforms, or changes, in their own churches and societies. Some of the Reformed churches in Europe made similar changes. The Puritans made preaching very important. They used as little ritual and decoration as possible. Very often, sermons talked about Hell. One famous sermon is \"Sinners in the hands of an angry god\" by Jonathan Edwards, an important Puritan preacher. The sermon talks about God being angry with people for sinful behavior, and throwing them into the fires of Hell as a punishment. Many Puritan groups emigrated to New England so that they could start their own societies there and practice Puritanism the way they wanted. Puritan beliefs and writings became very important in New England. One important work was Puritan John Bunyan's \"The Pilgrim's Progress\". ==Separatists== Those who left the Church of England altogether were known as Separatists.See D.L. Horowitz's \"Patterns of Ethnic Separatism\", originally published in Comparative Studies in Society and History, 1981, vol 23, 165-95 Many of the Plymouth Colony Pilgrims who established the first successful colony in New England were separatists.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), p. 413 John Abbot Goodwin, The Pilgrim republic: an historical review of the colony of New Plymouth..., Houghton Mifflin Company, 1888, p. 1 Some of these churches were later called Congregationalists.Encyclopedia Brittancia ==References== ==Other websites== * John Bunyan: The Pilgrim’s Progress * A Puritan's Mind , some writings of the Puritans and their admirers * Puritan sermons * Extensive Large collection of Puritan resources",
 "title": "Puritanism"
}