{
 "id": "94266",
 "text": "A dependent territory, dependent area or dependency is a territory that is not fully independent or sovereign, and also not fully part of a independent country. As such, a dependent territory is included in such types of territories from associated states to non-self-governing territorys (for example, a colony). A dependent territory is commonly different from a subnational entity of which is considered to be not a part of the sovereign state nor its constituent part, instead, is understood a division of a state proper. A dependent territory often maintains some degree of autonomy not enjoyed by the administrative divisions of the country. Historically, most colonies were considered to be dependent territories. Not all autonomous polities are dependent territories, and not all dependent territories are autonomous. Most inhabited dependent territories have their own ISO 3166 code. Some polities inhabit positions taken from the treaty or other such agreement, thereby creating a such certain degree of autonomy (for example, a difference in immigration rules). Those entities are sometimes considered to be, or are at least grouped with, dependent territories, but are officially considered by their governing states to be an integral part of those states. Such as a example is Åland, a autonomous region of Finland. == Summary == The article include the following: === Dependent territories === * 1 dependency and 1 Antarctic claim, as well as two self-governing states are included in the listing for New Zealand * 1 uninhabited dependency and 2 dependency claims are included in the listing for Norway * 10 inhabited overseas territories, 2 overseas territories with no permanent population, 3 crown dependencies, 2 sovereign military bases and 1 Antarctic claim are included in the listing for United Kingdom * 5 inhabited territories and 9 islands with no permanent population are included in the number for the United States === Similar entities === * 6 external territories and 1 Antarctic claim are included in the listing for Australia * 2 special administrative regions are included in the listing for China * 2 autonomous territories are included in the listing for Denmark * 1 autonomous region is included in the listing for Finland * 5 overseas collectivities, 1 sui generis collectivity and 2 overseas territories are included in the listing for France * 3 autonomous territories are included in the listing for Netherlands * 1 unincorporated area is included in the listing for Norway == Lists of dependent territories == This list includes all territories that have not been legally incorporated into their governing state, including several territories that are not on the list of non-self- governing territories of the General Assembly of the United Nations.For the list, see Dependency claims without general international recognition, including all claims in Antarctica, are listed in italics. ===New Zealand=== Summary: New Zealand has one dependent territory (Tokelau) and a territorial claim in Antarctica, as well as two self-governing associated states. In free association Administration ISO 3166 country codes Self-governing state in free association with New Zealand since 1965. Cook Islands' status is considered to be equivalent to independence for international law purposes, and the country exercises full sovereignty over its internal and external affairs. Under the terms of the free association agreement, however, New Zealand retains some responsibility for the foreign relations and defense of the Cook Islands. These responsibilities confer no rights of control and are exercised only at the request of the Cook Islands Government. The government of New Zealand does not consider the Cook Islands to be sovereign due to its continued use of New Zealand citizenship. CK- Self-governing state in free association with New Zealand since 1974. Niue's status is considered to be equivalent to independence for international law purposes, and the country exercises full sovereignty over its internal and external affairs. Under the terms of the free association agreement, however, New Zealand retains some responsibility for the foreign relations and defense of Niue. These responsibilities confer no rights of control and are exercised only at the request of the Government of Niue. The government of New Zealand does not consider Niue to be sovereign due to its continued use of New Zealand citizenship. NU- Territory Administration ISO 3166 country codes Territory of New Zealand. As it moves toward free association with New Zealand, Tokelau and New Zealand have agreed to a draft constitution. A UN-sponsored referendum on self-governance in February 2006 did not produce the two-thirds supermajority necessary for changing the current political status. Another one was in October 2007, which failed to reach the margin. TK- No permanent population. New Zealand's Antarctic claim. Unlike Tokelau and the associated states (Cook Islands and Niue), it is constitutionally part of New Zealand.New Zealand and Antarctica. NZ Ministry of Foreign Affairs and Trade. 2010 within AQ ===Norway=== Summary: Norway has 1 dependent territory and 2 dependency claims. Dependency Administration ISO 3166 country codes No permanent population. Dependency administered from Oslo by the Polar Affairs Department of the Ministry of Justice and the Police. BV- No permanent population. Dependencies (subject to the Antarctic Treaty System) administered from Oslo by the Polar Affairs Department of the Ministry of Justice and the Police. within AQ No permanent population. Dependencies (subject to the Antarctic Treaty System) administered from Oslo by the Polar Affairs Department of the Ministry of Justice and the Police. ===United Kingdom=== Summary: the United Kingdom has 13 Overseas Territories (10 autonomous, 1 restricted to military personnel, 1 uninhabited, 1 group of Sovereign Base Areas), 3 Crown dependencies (autonomous), and 1 dependency claim. Overseas territories (inhabited) Administration ISO 3166 country codes House of Assembly of Anguilla handles domestic affairs. Appears on the United Nations list of Non-Self-Governing Territories. AI- Parliament of Bermuda handles domestic affairs and the territory is defined by the UK as self-governing. Appears on the United Nations list of Non-Self-Governing Territories. BM- Administered by the Commissioner of the British Indian Ocean Territory, reporting to the Foreign and Commonwealth Office. Original population removed between 1967 and 1973, and presently restricted to military personnel. Also claimed by Mauritius, Following resumed negotiations a treaty was signed in 2025 that will formally transfer the sovereignty of the territory to Mauritius once it comes into effect, while the Diego Garcia military base remains under British control during a 99-year lease.. IO- House of Assembly of the British Virgin Islands handles domestic affairs. Appears on the United Nations list of Non-Self-Governing Territories VG- Legislative Assembly of the Cayman Islands handles domestic affairs. Appears on the United Nations list of Non-Self-Governing Territories. KY- Legislative Assembly of the Falkland Islands handles domestic affairs. Appears on the United Nations list of Non-Self-Governing Territories. Also claimed by Argentina. FK- Gibraltar Parliament handles domestic affairs. Almost complete internal self- government. Appears on the United Nations list of Non-Self-Governing Territories. GI- Legislative Council of Montserrat handles domestic affairs. Appears on the United Nations list of Non-Self-Governing Territories. MS- Pitcairn, Henderson, Ducie and Oeno Islands Island Council of the Pitcairn Islands handles some domestic affairs, however decisions are subject to approval by the Governor of the Pitcairn Islands, reporting to the Foreign and Commonwealth Office. Appears on the United Nations list of Non-Self-Governing Territories. PN- Legislative Council of Saint Helena, Ascension Island Council and Tristan da Cunha Island Council handle domestic affairs. Appears on the United Nations list of Non-Self-Governing Territories. SH- House of Assembly of the Turks and Caicos Islands handles some domestic affairs. Appears on the United Nations list of Non-Self-Governing Territories. TC- Overseas territories (uninhabited) Administration ISO 3166 country codes Administered by the Commissioner of South Georgia and the South Sandwich Islands (who is also the Governor of the Falkland Islands), reporting to the Foreign and Commonwealth Office. No permanent population. Also claimed by Argentina. GS- Administered by the Commissioner of the British Antarctic Territory, reporting to the Foreign and Commonwealth Office. No permanent population. The UK's Antarctic claim. within AQ Sovereign Base Areas Administration ISO 3166 country codes Sovereign Base Areas of Akrotiri and Dhekelia Administered by the Commander of British Forces Cyprus, reporting to the Ministry of Defence. Permanent Cypriot population, as well as British military personnel and their families. No ISO 3166 code Crown dependencies Administration ISO 3166 country codes Bailiwick of Guernsey Responsibility for defence, international representation, and good government rests with the United Kingdom. The Parliament of the United Kingdom can legislate on their behalf, if it deems it necessary to do so. GG- JE- IM- ===United States=== Summary: the United States has 11 dependent territories and 2 dependency claims. The uninhabited Palmyra Atoll is administered similarly to some of these territories, but unlike the others is a fully incorporated part of the United States. Unincorporated organized territories (inhabited) Administration ISO 3166 country codes Unincorporated organized territory of the U.S.; policy relations conducted through Office of Insular Affairs, Department of the Interior. Appears on the United Nations list of Non-Self-Governing Territories. US-GU or GU Commonwealth in political union with the U.S.; federal funding administered by the Office of Insular Affairs, Department of the Interior. US-MP or MP Unincorporated organized territory of the U.S. with commonwealth status; policy relations conducted through Office of the President. US-PR or PR Unincorporated organized territory of the U.S.; policy relations conducted by the Office of Insular Affairs, Department of the Interior. Appears on the United Nations list of Non-Self-Governing Territories. US-VI or VI Unincorporated unorganized territories (inhabited) Administration ISO 3166 country codes Unincorporated unorganized territory administered by the Office of Insular Affairs, U.S. Department of the Interior. Appears on the United Nations list of Non-Self-Governing Territories. US-AS or AS Unincorporated unorganized territories (uninhabited) Administration ISO 3166 country codes Unincorporated unorganized territories of the U.S. administered by the Fish and Wildlife Service of the Department of the Interior. US-UM-81 or UM-81 US-UM-84 or UM-84 US-UM-86 or UM-86 US-UM-67 or UM-67 US-UM-89 or UM-89 Unincorporated unorganized territory of the U.S. administered by the Fish and Wildlife Service of the Department of the Interior. No permanent population. US-UM-71 or UM-71 Unincorporated unorganized territory of the U.S. administered by the Fish and Wildlife Service of the Department of the Interior from the Cabo Rojo National Wildlife Refuge in Cabo Rojo, Puerto Rico. Claimed by Haiti and privately via the Guano Islands Act. US-UM-76 or UM-76 Unincorporated unorganized territory of the U.S. administered by the Fish and Wildlife Service of the Department of the Interior. Claimed by the Marshall Islands. No permanent population. US-UM-79 or UM-79 Bajo Nuevo Bank Administered by Colombia. Claimed by the U.S. (under Guano Islands Act) and Jamaica. A claim by Nicaragua was resolved in 2012 in favor of Colombia by the International Court of Justice (U.S. not a party nor recognizes Court's jurisdiction). within CO-SAP Serranilla Bank Administered by Colombia; site of a naval garrison. Claimed by the U.S. (since 1879 under Guano Islands Act), Honduras, and Jamaica. A claim by Nicaragua was resolved in 2012 in favor of Colombia by the International Court of Justice (U.S. not a party nor recognizes Court's jurisdiction). ==Lists of similar entities== The following entities are according to the law of the state as well as some laws of some states, integral parts of the state, but exhibit many characteristics of dependent territories. The list is limited to territories that are related to an internacional treaty, uninhabited, or have some degree of autonomy, and are largely self-governing rather than international affairs. It generally doesn't include areas without some degree of autonomy such as the overseas regions of France, the BES islands of Netherlands, Jan Mayen of Norway and Palmyra Atoll of United States. Areas with only limited degree of autonomy such as Barbuda of Antigua and Barbuda, Sabah and Sarawak of Malaysia, the autonomous regions of Portugal, Nevis of Saint Kitts and Nevis, the Balearic Islands, Canary Islands and the two autonomous cities of Spain and Zanzibar of Tanzania are also not included in this list. Antarctic claims are listed in italics. ===Australia=== Summary: Australia has 6 external territories (3 autonomous and 3 uninhabited) and one Antarctic claim. Although all territories of Australia are considered to be fully integrated in its federative system, and the official status of an external territory does not differ largely from that of a mainland territory, debate remains as to whether the external territories are integral parts of Australia, due to their not being part of Australia in 1901, when its constituent states federated. They are often listed separately for statistical purposes. External territories (inhabited) Administration ISO 3166 code External territory. Administered by the Australian government. CX External territory. Administered by the Australian government. CC External territory. Administered by the Australian government. NF External territories (uninhabited) Administration ISO 3166 country code External territory. Administered by the Australian government. No permanent population. No ISO 3166 code External territory. Administered by the Australian government. No permanent population. within AQ External territory. Administered by the Australian government. No permanent population. No ISO 3166 code External territory. Administered by the Australian government. No permanent population. HM ===China=== Summary: China has two special administrative regions. Special administrative regions Administration ISO 3166 countrycode Former British colony. Special administrative region since 1997. Administred by the Chinese government. Although the territory it is not part of mainland China, it is officially considered an integral part of the People's Republic of China. HK Former Portuguese colony. Special administrative region since 1999. Administred by the Chinese government. Although the territory is not part of mainland China, it is officially considered an integral part of the People's Republic of China. MO ===Denmark=== Summary: Denmark has two autonomous regions. Autonomous region Administration ISO 3166 country code Autonomous administrative division since 1948. Administered by the Danish Goverment. Although it is not part of metropolitan Denmark, it is officially considered an integral part of the Kingdom of Denmark. FO Autonomous administrative division since 1979. Administered by the Danish Goverment. Although it is not part of metropolitan Denmark, it is officially considered an integral part of the Kingdom of Denmark. GL ===Finland=== Summary: Finland has 1 autonomous region Autonomous region Administration ISO 3166 country code Autonomous region. Administered by the Finnish government. AX ===France=== Summary: France has 5 overseas collectivities, 1 sui generis collectivity and two overseas territories (1 autonomous, of which includes an Antarctic claim, and 1 uninhabited). By contrast, the overseas regions of France don't have any degree of autonomy, and therefore excluded from the list. Nonetheless, all of France's overseas territories are considered to be an integral part of the French Republic Overseas collectivities Administration ISO 3166 country code Overseas territory since 2002. Overseas collectivity since 2003. Administered by the French government. PF Overseas territory since 2003. Overseas collectivity since 2007. Administered by the French government. BL Overseas territory since 2003. Overseas collectivity since 2007. Administered by the French government. MF Overseas territory since 1960. Overseas collectivity since 1987. Administered by the French government. SP Overseas territory since 1928. Overseas collectivity since 1953. Administered by the French government. WF Sui generis collectivity Administration ISO 3166 country code. Overseas territory since 1946. sui generis collectivity since 1999. Administered by the French government. NC Overseas territory (inhabited) Administration ISO 3166 country code Overseas territory since 1946. Administered by the French government. Includes an Antarctic claim (Adelié Land). TF/FR-TF Overseas territory (uninhabited) Administration ISO 3166 country code Overseas territory. Administered by the French government. CP ===Netherlands=== Summary:Netherlands has three autonomous territories. Autonomous territory Administration ISO 3166 country code Autonomous territory. Administered by the Dutch government. AW Autonomous territory. Administered by the Dutch government. CW Autonomous territory. Administered by the Dutch government. SX ===Norway=== Summary:Norway has 1 unincorporated area with limited sovereignty. Unincorporated area Administration ISO 3166 country code Unincorporated area. Administered by the Norwegian government. within SJ ==Description== Several terms can be used to refer to the dependencies and/or territories. These terms include overseas territories, crown dependencies, overseas possessions, unincorporated territories, and areas of special sovereignty. Crown dependencies are self-governing crown possessions, which the British government solely protects and represent at international levels. Unincorporated is a term that Americans used to refer to territories where the US Constitution only partially applies. France refers to its semi-autonomous territories as overseas collectivities while the Netherlands uses the phrase constituent countries to refer to its territories. There are 55 dependencies and territories, of which most of them are islands in the world's oceans. Although the British Empire no longer exists, the United Kingdom has the most dependencies or overseas territories. It has 17 unincorporated and dependent territories, including Gibraltar and Falkland Islands, and the United States also have sizeable numbers of dependencies, with some of the US-known territories including Puerto Rico and Guam. However, some dependent territories are affected by territorial disputes. A special case is Antarctica, where they made dependency claims here, including the overlap extent beetwen Argentina, Chile and the United Kingdom ==References== ==Notes== Notes",
 "title": "Dependent territory"
}