{
 "id": "942690",
 "text": "The BAFTA Award for Best Original Music is annual award for movie composers. It is given by the British Academy of Film and Television Arts. It used to be called Anthony Asquith Award for Film Music. John Williams and Hans Zimmer have the most nominations. ==Winners and nominees== ===1960s=== Year Film Composer(s) Anthony Asquith Award for Original Film Music The Lion in Winter John Barry The Charge of the Light Brigade John Addison Live for Life Francis Lai Romeo and Juliet Nino Rota Z Mikis Theodorakis Secret Ceremony Richard Rodney Bennett The Thomas Crown Affair Michel Legrand Women in Love Georges Delerue ===1970s=== Year Film Composer(s) Butch Cassidy and the Sundance Kid Burt Bacharach Alice's Restaurant Arlo Guthrie Figures in a Landscape Richard Rodney Bennett The Railway Children Johnny Douglas Summer of '42 Michel Legrand Little Big Man John Hammond Shaft Isaac Hayes Traffic Charles Dumont The Godfather Nino Rota Lady Caroline Lamb Richard Rodney Bennett The Tragedy of Macbeth Third Ear Band Young Winston Alfred Ralston O Lucky Man! Alan Price Pat Garrett and Billy the Kid Bob Dylan Sounder Taj Mahal State of Siege Mikis Theodorakis Murder on the Orient Express Richard Rodney Bennett Chinatown Jerry Goldsmith Happy New Year Francis Lai Serpico Mikis Theodorakis The Three Musketeers Michel Legrand Jaws The Towering Inferno John Williams The Godfather Part II Nino Rota The Taking of Pelham One Two Three David Shire The Wind and the Lion Jerry Goldsmith Taxi Driver Bernard Herrmann Bugsy Malone Paul Williams One Flew Over the Cuckoo's Nest Jack Nitzsche The Slipper and the Rose Richard M. Sherman and Robert B. Sherman A Bridge Too Far John Addison Equus Richard Rodney Bennett The Spy Who Loved Me Marvin Hamlisch A Star Is Born Paul Williams, Barbra Streisand, Kenny Ascher, Rupert Holmes, Leon Russell, Kenny Loggins, Alan Bergman, Marilyn Bergman and Donna Weiss Star Wars John Williams Close Encounters of the Third Kind John Williams Julia Georges Delerue Saturday Night Fever Barry Gibb, Maurice Gibb and Robin Gibb Days of Heaven Ennio Morricone Alien Jerry Goldsmith Apocalypse Now Carmine Coppola and Francis Ford Coppola Yanks Richard Rodney Bennett ===1980s=== Year Film Composer(s) Best Original Film Music The Empire Strikes Back John Williams Breaking Glass Hazel O'Connor Fame Michael Gore Flash Gordon John Deacon, Brian May, Freddie Mercury, Roger Taylor and Howard Blake The French Lieutenant's Woman Carl Davis Arthur Burt Bacharach Chariots of Fire Vangelis Raiders of the Lost Ark John Williams Best Score for a Film E.T. the Extra-Terrestrial John Williams Blade Runner Vangelis Gandhi George Fenton and Ravi Shankar Missing Vangelis Merry Christmas, Mr. Lawrence Ryuichi Sakamoto Flashdance Giorgio Moroder Local Hero Mark Knopfler An Officer and a Gentleman Jack Nitzsche Once Upon a Time in America Ennio Morricone Carmen Paco de Lucía The Killing Fields Mike Oldfield Paris, Texas Ry Cooder Witness Maurice Jarre Beverly Hills Cop Harold Faltermeyer The Emerald Forest Brian Gascoigne and Junior Homrich A Passage to India Maurice Jarre The Mission Ennio Morricone Out of Africa John Barry A Room with a View Richard Robbins Round Midnight Herbie Hancock The Untouchables Ennio Morricone Cry Freedom George Fenton and Jonas Gwangwa Hope and Glory Peter Martin Wish You Were Here Stanley Myers Empire of the Sun John Williams Bird Lennie Niehaus The Last Emperor Ryuichi Sakamoto, David Byrne and Cong Su Moonstruck Dick Hyman Best Original Film Score Dead Poets Society Maurice Jarre Dangerous Liaisons George Fenton Mississippi Burning Trevor Jones Working Girl Carly Simon ===1990s=== Year Film Composer(s) Cinema Paradiso Andrea Morricone and Ennio Morricone The Fabulous Baker Boys Dave Grusin Memphis Belle George Fenton Postcards from the Edge Carly Simon Cyrano de Bergerac Jean-Claude Petit Dances with Wolves John Barry The Silence of the Lambs Howard Shore Thelma & Louise Hans Zimmer Strictly Ballroom David Hirschfelder Beauty and the Beast Howard Ashman and Alan Menken Hear My Song John Altman The Last of the Mohicans Randy Edelman and Trevor Jones Schindler's List John Williams Aladdin Alan Menken The Piano Michael Nyman Sleepless in Seattle Marc Shaiman Anthony Asquith Award for Film Music Backbeat Don Was The Adventures of Priscilla, Queen of the Desert Guy Gross Four Weddings and a Funeral Richard Rodney Bennett The Lion King Hans Zimmer Il Postino: The Postman Luis Enríquez Bacalov Braveheart James Horner The Madness of King George George Fenton Sense and Sensibility Patrick Doyle The English Patient Gabriel Yared Brassed Off Trevor Jones Evita Tim Rice and Andrew Lloyd Webber Shine David Hirschfelder Romeo + Juliet Nellee Hooper, Craig Armstrong and Marius de Vries The Full Monty Anne Dudley L.A. Confidential Jerry Goldsmith Titanic James Horner Elizabeth David Hirschfelder Hilary and Jackie Barrington Pheloung Saving Private Ryan John Williams Shakespeare in Love Stephen Warbeck American Beauty Thomas Newman Buena Vista Social Club Ry Cooder and Nick Gold The End of the Affair Michael Nyman The Talented Mr. Ripley Gabriel Yared ===2000s=== Year Film Composer(s) Crouching Tiger, Hidden Dragon Tan Dun Almost Famous Nancy Wilson Billy Elliot Stephen Warbeck Gladiator Lisa Gerrard and Hans Zimmer O Brother, Where Art Thou? T Bone Burnett and Carter Burwell Moulin Rouge! Craig Armstrong and Marius de Vries Amélie Yann Tiersen The Lord of the Rings: The Fellowship of the Ring Howard Shore Mulholland Dr. Angelo Badalamenti Shrek Harry Gregson-Williams and John Powell The Hours Philip Glass Catch Me If You Can John Williams Chicago Fred Ebb, Danny Elfman and John Kander Gangs of New York Howard Shore The Pianist Wojciech Kilar Cold Mountain T Bone Burnett and Gabriel Yared Girl with a Pearl Earring Alexandre Desplat Kill Bill: Volume 1 RZA The Lord of the Rings: The Return of the King Howard Shore Lost in Translation Brian Reitzell and Kevin Shields The Motorcycle Diaries Gustavo Santaolalla The Aviator Howard Shore The Chorus Bruno Coulais Finding Neverland Jan A. P. Kaczmarek Ray Craig Armstrong Memoirs of a Geisha John Williams Brokeback Mountain Gustavo Santaolalla The Constant Gardener Alberto Iglesias Mrs Henderson Presents George Fenton Walk the Line T Bone Burnett Babel Gustavo Santaolalla Casino Royale David Arnold Dreamgirls Henry Krieger Happy Feet John Powell The Queen Alexandre Desplat Best Music La Vie en Rose Christopher Gunning American Gangster Marc Streitenfeld Atonement Dario Marianelli The Kite Runner Alberto Iglesias There Will Be Blood Jonny Greenwood Slumdog Millionaire A. R. Rahman The Curious Case of Benjamin Button Alexandre Desplat The Dark Knight James Newton Howard and Hans Zimmer Mamma Mia! Benny Andersson and Björn Ulvaeus WALL-E Thomas Newman Up Michael Giacchino Avatar James Horner Crazy Heart T Bone Burnett and Stephen Bruton Fantastic Mr. Fox Alexandre Desplat Sex & Drugs & Rock & Roll Chaz Jankel ===2010s=== Year Film Composer(s) Best Original Music The King's Speech Alexandre Desplat 127 Hours A. R. Rahman Alice in Wonderland Danny Elfman How to Train Your Dragon John Powell Inception Hans Zimmer The Artist Ludovic Bource The Girl with the Dragon Tattoo Trent Reznor and Atticus Ross Hugo Howard Shore Tinker Tailor Soldier Spy Alberto Iglesias War Horse John Williams Skyfall Thomas Newman Anna Karerina Dario Marianelli Argo Alexandre Desplat Life of Pi Mychael Danna Lincoln John Williams Gravity Steven Price 12 Years a Slave Hans Zimmer The Book Thief John Williams Captain Phillips Henry Jackman Saving Mr. Banks Thomas Newman The Grand Budapest Hotel Alexandre Desplat Birdman Antonio Sánchez Interstellar Hans Zimmer The Theory of Everything Jóhann Jóhannsson Under the Skin Mica Levi The Hateful Eight Ennio Morricone Bridge of Spies Thomas Newman The Revenant Ryuichi Sakamoto and Carsten Nicolai Sicario Jóhann Jóhannsson Star Wars: The Force Awakens John Williams La La Land Justin Hurwitz Arrival Jóhann Jóhannsson Jackie Mica Levi Lion Hauschka and Dustin O'Halloran Nocturnal Animals Abel Korzeniowski The Shape of Water Alexandre Desplat Blade Runner 2049 Benjamin Wallfisch and Hans Zimmer Darkest Hour Dario Marianelli Dunkirk Hans Zimmer Phantom Thread Jonny Greenwood A Star Is Born Bradley Cooper, Lady Gaga and Lukas Nelson BlacKkKlansman Terence Blanchard If Beale Street Could Talk Nicholas Britell Isle of Dogs Alexandre Desplat Mary Poppins Returns Marc Shaiman Joker Hildur Guðnadóttir 1917 Thomas Newman Jojo Rabbit Michael Giacchino Little Women Alexandre Desplat Star Wars: The Rise of Skywalker John Williams ===2020s=== Year Film Composer(s) Soul Jon Batiste, Trent Reznor and Atticus Ross Minari Emile Mosseri News of the World James Newton Howard Promising Young Woman Anthony Willis Mank Trent Reznor and Atticus Ross Dune Hans Zimmer Being the Ricardos Daniel Pemberton Don't Look Up Nicholas Britell The French Dispatch Alexandre Desplat The Power of the Dog Jonny Greenwood All Quiet on the Western Front Volker Bertelmann Babylon Justin Hurwitz The Banshees of Inisherin Carter Burwell Everything Everywhere All at Once Son Lux Guillermo del Toro's Pinocchio Alexandre Desplat Oppenheimer Ludwig Göransson Killers of the Flower Moon Robbie Robertson Poor Things Jerskin Fendrix Saltburn Anthony Willis Spider-Man: Across the Spider- Verse Daniel Pemberton The Brutalist Daniel Blumberg Conclave Volker Bertelmann Emilia Pérez Clément Ducol, Camille Nosferatu Robin Carolan The Wild Robot Kris Bowers == Multiple wins and nominations == ===Multiple nominations=== ;16 nominations * John Williams ;12 nominations * Alexandre Desplat ;10 nominations * Hans Zimmer ;7 nominations * Richard Rodney Bennett ;6 nominations * George Fenton * Ennio Morricone * Thomas Newman * Howard Shore ;4 nominations * T Bone Burnett * Jerry Goldsmith ;3 nominations * Craig Armstrong * John Barry * Jonny Greenwood * David Hirschfelder * James Horner * Alberto Iglesias * Maurice Jarre * Jóhann Jóhannsson * Trevor Jones * Michel Legrand * Dario Marianelli * John Powell * Trent Reznor * Atticus Ross * Nino Rota * Ryuichi Sakamoto * Gustavo Santaolalla * Mikis Theodorakis * Vangelis * Gabriel Yared ;2 nominations * John Addison * Burt Bacharach * Nicholas Britell * Carter Burwell * Ry Cooder * Georges Delerue * Marius de Vries * Danny Elfman * Michael Giacchino * James Newton Howard * Justin Hurwitz * Francis Lai * Mica Levi * Alan Menken * Jack Nitzsche * Michael Nyman * Daniel Pemberton * A. R. Rahman * Marc Shaiman * Carly Simon * Stephen Warbeck * Paul Williams * Anthony Willis ===Multiple wins=== ;7 wins * John Williams ;6 wins * Ennio Morricone ;3 wins * Alexandre Desplat ;2 wins * Craig Armstrong * Marius de Vries * David Hirschfelder * Maurice Jarre * Thomas Newman * Gustavo Santaolalla * Gabriel Yared == References == Category:BAFTA Awards",
 "title": "BAFTA Award for Best Original Music"
}