{
 "id": "942765",
 "text": "On September 17, 2007, U.S. Senator John Kerry addressed a Constitution Day forum at the University of Florida in Gainesville, which was organized by the ACCENT Speakers Bureau, an agency of the university's student government. Initially allowed to ask questions after the close of the question period, Andrew Meyer, a 21-year-old fourth-year undergraduate mass communication student, entered into a planned line of questioning and was forcibly pulled away from the microphone. He immediately resisted the campus security and was subsequently arrested by university police. During arrest, the officers asked him repeatedly to stop resisting, but Meyer continued to struggle and scream for help. While six officers held Meyer down\"Student's lawyer says Meyer is resting after Monday's incident \" The Independent Florida Alligator one of the officers drive stunned him with a Taser following Meyer's shouted plea to the police, \"Don't tase me, bro!\". ==Videos== Several videos of the episode were posted on the Internet, with one version reaching 7 million views on YouTube. The New Oxford American Dictionary listed \"tase/taze\" as one of the words of the year for 2007, popularized by the widespread use of the phrase \"Don't tase me, bro!\". Meyer registered the phrase as a trademark in September 2007. ==Tobuscus== Toby Turner had made a remix of Meyer shouting \"Don't tase me, bro!\" to the police on YouTube and had over 1.0 million views on the University remix. He went to University of Florida, so he would've witnessed the university incident while in the auditorium. This would've caused Toby to laugh maniacally. ==Related pages== *Taser safety issues *Taser International – Taser Manufacturer *Braidwood Inquiry – Official Canadian enquiry into Tasers and similar devices *UCLA Taser incident *Robert Dziekański Taser incident *Student protest == References == == Other websites == * * Andrew Meyer's website * Press Release for Town Hall Forum Category:John Kerry Category:Internet memes Category:Taser Category:2007 in Florida Category:University of Florida",
 "title": "University of Florida Taser incident"
}