{
 "id": "942766",
 "text": "In the morning of June 8, 2017, employees at a Weis Market supermarket in Eaton Township, Pennsylvania were stocking and closing the store for the night. Stair arrived for his overnight shift at the Weis Markets in Dallas, Pennsylvania. He then blocked the entrances and exits of the supermarket over the course of his shift, before shooting and killing three of his co-workers. His first victim was Victoria Brong, who was shot while stacking the aisles alongside his co-worker and friend Kristen Newell. After Victoria was shot, Kristen, who had heard the shooting through her headphones but didn't immediately identify the sounds as gunfire, turned to face Victoria to ask her what the noise was only to find herself face to face with the perpetrator. Stair fired a few more rounds into Victoria before locking eyes with Kristen, who was left completely frozen after witnessing what just happened. Stair continued down the supermarket, proceeding to kill Brian Hayes and Terry Lee Sterling. Kristen would escape through the front entrance of the supermarket after making a call to 911 and hiding in the checkout area. As first responders arrived and prepared to make their entrance into the building Stair would bring an end to his own life in the Deli section of the supermarket, after firing a total of 59 shots. == Autopsy == Autopsy records revealed that Stair had taken large amounts of the antihistamine diphenhydramine before the shooting. Diphenhydramine is a deliriant in high doses and is known to cause hallucinations and delusions. It was also revealed that Stair was wearing women's undergarments under his regular clothing. == Victims == * Victoria Brong, aged 26, mother and 2010 graduate of Tunkhannock High School. Assistant tag manager for Weis Markets. * Brian Hayes, aged 47, United States Navy veteran. * Terry Lee Sterling, aged 63. == Responses == After the shooting, Stairs' parents Robert Stair and Lori Anne Stair offered their condolences towards the victims' families, Stair's father commented. ::\"Our thoughts and prayers are with the victims and their families. We are so sorry for all the pain and loss of life this has caused everyone involved.\" == References == Category:2010s in Pennsylvania Category:2017 murders in the United States Category:2017 mass shootings in the United States Category:June 2017 events",
 "title": "Eaton Township Weis Markets shooting"
}