{
 "id": "942734",
 "text": "Defeated at the Regatta (also known as Sconfitto alla regata or Last Prize in Venice Boat Race) is a 19th-century late impressionist painted in oil by Antonio Rotta. It was painted about 1858, in Venice, Italy. Is in the collection of the Pinacoteca di Brera of Milano. The painting after being purchased, by the will of the House of Savoy, in 1858 for the collection of Palazzo Reale di Torino, and placed on the first floor of Palazzo Reale in the Galleria delle Battaglie Antonio Rotta, Sconfitto alla Regata, Palazzo Reale nella Galleria delle Battaglie catalogo.beniculturali.it it was sold to the Pinacoteca di Brera in Milan. == History == In 1860 in Turin, Antonio Rotta aroused the enthusiasm and emotion of the public for the \"Sorrowful Hunter who takes care of his dying dog\", which remained unsold due to the high sum of 3000 lire (250 gold napoleons), the highest price of the time found throughout the Venice exhibition. The work was strongly applauded by Carlo Tenca. Enciclopedia Treccani, ROTTA, Antonio, di Stefano Franzo - Dizionario Biografico degli Italiani - Volume 88 (2017) In \"The boring page\", created in sequence with \"The profaned page\", Risorgimento and anti-Austrian political allusions were read by a reviewer and the artist was treated as a \"philosopher painter\", capable of instilling noble \"superior ideas\" into childhood. == Description == The painting portrays the despair over the defeat of a regatta in the Republic of Venice. == Exhibitions == * Galeria de Arte Walters, Baltimore, Palazzo della Gran Guardia (Verona, Italy), Ed. Fernando Mazzocca, Giuseppe Mazzariol, Sergio Marinelli, 1979 * Promotrice delle Belle Arti, 1860 and 1861, Milan == Related pages == * Antonio Rotta == References == == Bibliography == * Giuseppe Pavanello, Nico Stringa, Ottocento veneto: il trionfo del colore, 2004 * Giuseppe Pavanello.La pittura nel Veneto: L'Ottocento - Volume 1, 2002 * Federico Zandomeneghi: mostra antologica, 1988 * A Galeria de Arte Walters, Baltimore, Palazzo della Gran Guardia (Verona, Italy), Ed. Fernando Mazzocca, Giuseppe Mazzariol, Sergio Marinelli, 1979, ISBN 9788843528530 * Il Veneto e l'Austria, Vita e cultura artistica nelle città venete, 1814-1866, 1989 * Elenco degli oggetti d'arte ammessi all'esposizione nelle sale della I.R. accademia veneta di belle arti nell'agosto 1858, Biblioteca Nazionale Centrale di Firenze * La Pittura in Italia: l'Ottocento - Volume 2 - Pagina 1000, 1991 == Other websites == * Antonio Rotta, Sconfitto alla Regata, Palazzo Reale nella Galleria delle Battaglie catalogo.beniculturali.it Category:Paintings by Antonio Rotta Category:1850s paintings",
 "title": "Defeated at the Regatta (Rotta)"
}