{
 "id": "942895",
 "text": "Louise Labèque is a French actress who is best known for the 2019 movie Zombi Child. ==Biography== Labèque studied at the French drama school Cours Florent for three years. One day some agents appeared at the school and one of them gave her a card to go through a casting. In 2018, she made her film debut in The Trouble-Shooter (Roulez jeunesse), the first feature film by director Julien Guetta. That same year, she played the role of Marion Malinski in the comedy-drama film In Your Hands (Au bout des doigts) directed by Ludovic Bernard. In 2019, she played Fanny, one of the protagonists in the fantasy film Zombi Child directed by Bertrand Bonello. For her performance in the film, Labèque was included in the shortlist to compete for the César Award for Most Promising Actress, but did not get the nomination. In 2021 and 2022, she played the role of Lisa Dayan in the TV series En thérapie, created by Olivier Nakache & Éric Toledano. In 2022, Labèque played the lead role in the film Coma directed by Bertrand Bonello, their second collaboration after Zombi Child. Her next films are Annie Colère directed by Blandine Lenoir, and Toni, en famille by director Nathan Ambrosioni. ==Filmography== ===Feature films=== Year Title Role Director 2018 The Trouble-Shooter (Roulez jeunesse) Tina Dalmerac Julien Guetta 2018 In Your Hands (Au bout des doigts) Marion Malinski Ludovic Bernard 2019 Zombi Child Fanny Bertrand Bonello 2022 Coma Young Girl Bertrand Bonello 2022 Annie Colère Blandine Lenoir 2023 Toni, en famille Nathan Ambrosioni ===Short films=== Year Title Role Director 2021 The Toddler (Le Têtard) Jessie Nathalie Lenoir ===Television=== Year Title Role Notes 2021–2022 En thérapie Lisa Dayan TV Series; 4 episodes ==Awards and nominations== Year Award / Festival Category Work Result 2021 Festival Jean- Carmet Most Promising Actress The Toddler (Le Têtard) 2022 Vertigo Film Fest Best Performance == References == ==Other websites== * * Louise Labèque on UniFrance * Louise Labèque on AlloCiné * Louise Labèque on Cineuropa Category:Living people Category:French movie actors Category:French television actors",
 "title": "Louise Labèque"
}