{
 "id": "942880",
 "text": "The Kuleshov Effect was an experiment in the 1910s by Lev Vladimirovich Kuleshov. It is part of Soviet montage theory. It connects to montage, which is an editing technique. The principle was that images next to another image add meaning. Two images next to each other have a deeper meaning than just one image. Editing also created deeper emotions. The principle was also that viewers already had mental images about a picture.Movie Acting, the Film Reader. (2004). United Kingdom: Routledge, p. 4. Kuleshov and other Soviet theorists believed this was a basis for film. They said the film is a collection of images next to each other.Dimare, P. C. (2011). Movies in American History: An Encyclopedia. United States: ABC-CLIO, p. 993 == The Experiment == Kuleshov apparently did experiments in the 1910s. It is not clear if these experiments took place and if the results were real. Kuleshov would show an audience one image. He would show the image again with a second image. Kuleshov changed the second image. Each time there was a different second image, the audience had different emotions. The audience thought that the actor changed his facial expression with different images. Kuleshov said that the two images together changed the emotions. The context of the image was important. The second image created the context.Betancourt, M. (2009). Structuring Time (Second Edition). United States: Wildside Press, p. 97 Kuleshov used images with special emotional connotations. He used images of the Russian actor Ivan Moszhukin. Kuleshov showed an image of Ivan and then an image of a child in a coffin. This created an emotion of sadness. Next, he showed the same image of Ivan next to a bowl of food. This created an emotion of hunger. He also showed Ivan with an image of a woman. This created an emotion of lust. In all cases, both Ivan and the second image are facing the viewers. However, it feels like Ivan is looking at the second image. All the images of Ivan were exactly the same. He has the same facial expression. This was like a control group in an experiment. The images of Ivan were the same, but the emotions changed with the second images. == Research == Psychologists have studied the Kuleshov Effect to test if it is true. Prince and Hensley (1992) did experiments with the Kuleshov Effect. They did not find any effect.Stephen Prince; Wayne E. Hensley (1992). \"The Kuleshov effect: Recreating the classic experiment\". Cinema Journal. 31 (2): 59–75. doi:10.2307/1225144 Mobbs et al. (2006) used functional neuroimaging (fMRI). They showed different emotional images with neutral images. They found changes in facial expressions and mental state. Barratt, Rédei, Innes-Ker, and van de Weijer (2016) showed films with different emotions (happiness, sadness, hunger, fear, and desire) and got similar results as Mobbs et al. (2006).Daniel Barratt; Anna Cabak Rédei; Åse Innes-Ker; Joost van de Weijer (2016-04-06). \"Does the Kuleshov effect really exist? Revisiting a classic film experiment on facial expressions and emotional contexts\". Perception. 45: 847–874. == Usage in movies == The Kuleshov Effect was first used in Russian films. Directors Sergei Eisenstein, Vsevolod Pudovkin and Dziga Vertov used the effect. Russian films include The Battleship Potemkin, October, Mother, The End of St. Petersburg, and The Man with a Movie Camera. American and other European directors have also used the effect. It is now a common element in movies. It is important for editing movies. It is also useful to understand the context of an image. An image will often follow another image in time. Images can also be right next to each other at the same time. Alfred Hitchcock often used the Kuleshov effect. A notable example is in his film Rear Window (1954). The main character Jeff used to be a photographer. He watches the neighbors and what they do. Hitchock always shows the face of Jeff, played by James Stewart. Hitchcock then has the camera show the neighbors. Viewers see Jeff and then see Jeff watch women in their apartments. This creates emotions of lust. Viewers see Jeff looking out and then see the murderer, Doyle, attack his friend, Lisa. This creates suspense and fear. The images of Jeff next to images of the neighbors create specific emotions. It also helps viewers to get into the point of view of Jeff. This is also called point of view shot. The technique also creates suspense. Hitchcock uses the effect in other films like Vertigo (1958), North by Northwest (1959),Smith, M. (2017). Film, Art, and the Third Culture: A Naturalized Aesthetics of Film. United Kingdom: Oxford University Press, p. 137-138. Psycho (1960) and The Birds (1963). Hitchcock was aware of the technique and talked about the technique in interviews.Truffaut, Francois (1983). \"11\". Hitchcock/Truffaut. Simon and Schuster. p. 216. ISBN 9780671604295 Steven Spielberg uses the Kuleshov Effect, but often changes it. He does this to show emotions and make scenes more interesting. An example is \"the Spielberg Face\". These are notable shots. In the shots, the characters look at something in awe, wonder or horror. Their eyes look in amazement. However, Spielberg does not right away move the camera to what they are looking at. The shot stays on the faces of the characters for some time. Emotion comes out of this single facial expression. This single shot often shows an important scene. In this case, Spielberg focuses more on a single image and less on the Kuleshov effect. ==References== Category:Experiments",
 "title": "Kuleshov effect"
}