{
 "id": "942934",
 "text": "John Charles Eastman (born April 21, 1960) is an American lawyer and founding director of the Center for Constitutional Jurisprudence, a law firm affiliated with Claremont Institute. He used to be a professor and dean at Chapman University School of Law. In 1990, he ran for California's 34th congressional district as a Republican but didn't succeed. He later ran unsuccessfully for California Attorney General in 2010. He has worked as Supreme Court Justice Clarence Thomas' law clerk in the past. Eastman was one of the people who tried to overturn the 2020 United States presidential election. On January 5, 2021, during an Oval Office meeting, Eastman incorrectly told Vice President Mike Pence that he had the constitutional ability to block the certification of Joe Biden's victory. Pence did not end up doing this. Eastman sent a six- point plan to Republican senator Mike Lee, asking for Pence to not accept the electors from seven states to keep Trump as president, which Lee then rejected. Eastman gave a speech on January 6, 2021, during the White House Trump rally, before the 2021 United States Capitol attack, and then proceeded to ask Vice President Pence to violate the Electoral Count Act and stop the certification of the results of the election, through Greg Jacob, Pence's legal counsel. Federal judge David O. Carter on March 28, 2022, found Eastman and Trump more likely than not to have \"dishonestly conspired to obstruct the joint session of Congress on Jan. 6, 2021\". ==Education== Eastman graduated from Lewisville High School and got an undergraduate degree from the University of Dallas. He received a Juris Doctor and a Doctor of Philosophy in Government from the University of Chicago Law School and the Claremont Graduate School, respectively. Meanwhile, Eastman worked on the law journal University of Chicago Law Review. == References == Category:1960 births Category:Living people Category:People from Lincoln, Nebraska Category:University of Chicago alumni Category:2020 United States presidential election",
 "title": "John Eastman"
}