{
 "id": "943030",
 "text": "Saint Laurent is a 2014 French biographical drama movie co-written and directed by Bertrand Bonello, and starring Gaspard Ulliel as Yves Saint Laurent, Jérémie Renier as Pierre Bergé, and Louis Garrel as Jacques de Bascher. The supporting cast includes Léa Seydoux, Amira Casar, Aymeline Valade, and Helmut Berger playing an older Yves Saint Laurent. The movie is about Saint Laurent's life from 1967 to 1976, when the famous fashion designer was at the peak of his career. The film competed for the Palme d'Or in the main competition section at the 2014 Cannes Film Festival and was released on 24 September 2014. The movie was selected by France to represent the country for the Academy Award for Best Foreign Language Film at the 87th Academy Awards, but it was not nominated. In January 2015, Saint Laurent received ten César Award nominations, including Best Film, Best Director, Best Actor, and Best Supporting Actor. It also received five nominations at the 20th Lumières Awards, winning Best Actor for Gaspard Ulliel. == Cast == * Gaspard Ulliel as Yves Saint Laurent ** Helmut Berger as Yves Saint Laurent in 1989 * Jérémie Renier as Pierre Bergé * Louis Garrel as Jacques de Bascher * Léa Seydoux as Loulou de la Falaise * Amira Casar as Anne-Marie Munoz * Aymeline Valade as Betty Catroux * Valeria Bruni Tedeschi as Madame Duzer * Micha Lescot as Monsieur Jean-Pierre * Jasmine Trinca as Talitha Getty * Valérie Donzelli as Renée * Dominique Sanda as Lucienne == Production == Saint Laurent started filming on 30 September 2013. == Release == The film was originally scheduled to be released on 14 May 2014. In January 2014 the studio announced the release was changed to 1 October 2014. The release date was later changed again to 24 September 2014. In May 2014, Sony Pictures Classics bought the North American distribution rights at the 2014 Cannes Film Festival, where the film premiered in competition. The film was also screened at the 52nd New York Film Festival in September 2014. In May 2015, the film opened in four theaters in New York and Los Angeles to a $36,136 opening weekend. ==Reception== ===Critical reception=== On review aggregator website Rotten Tomatoes, the film has an approval rating of 60% based on 86 reviews, and an average rating of 5.78/10. The website's consensus says, \"A well-intentioned but frustratingly diffuse biopic, Saint Laurent proves an ironically poor fit for a look at the life of a fashion icon.\" On Metacritic, the film has a score 52 out of 100, based on 29 critics, indicating \"mixed or average reviews\". Susan Wloszczyna of RogerEbert.com gave the film 2.5 out of 4 stars, writing, \"If you come away remembering anything from this 150-minute movie as it overstays its welcome, it will be individual scenes rather than the overall effect, for that is where Bonello shines.\" A. O. Scott of The New York Times described it as \"a compulsively detailed swirl of moods and impressions, intent on capturing the contradictions of the man and his times.\" ===Awards and nominations=== Award Category Recipient(s) Result 2014 Cannes Film Festival Palme d'Or Saint Laurent 40th César Awards Best Film Saint Laurent Best Director Bertrand Bonello Best Actor Gaspard Ulliel Best Supporting Actor Louis Garrel Jérémie Renier Best Production Design Katia Wyszkop Best Sound Nicolas Cantin, Nicolas Moreau, Jean-Pierre Laforce Best Cinematography Josée Deshaies Best Editing Fabrice Rouaud Best Costume Design Anaïs Romand Globes de Cristal Award Best Actor Gaspard Ulliel Louis Delluc Prize Best Film Saint Laurent 20th Lumières Awards Best Film Saint Laurent Best Director Bertrand Bonello Best Actor Gaspard Ulliel Best Screenplay Thomas Bidegain and Bertrand Bonello Best Cinematography Josée Deshaies 5th Magritte Awards Best Supporting Actor Jérémie Renier 19th Satellite Awards Best Costume Design Anaïs Romand International Cinephile Society Awards 2016 Best Actor Gaspard Ulliel Best Supporting Actor Helmut Berger Best Production Design Katia Wyszkop == References == == Other websites== * * Category:2014 movies Category:2014 drama movies Category:2010s biographical movies Category:French biographical movies Category:French drama movies Category:2014 LGBT movies Category:French- language movies Category:2010s English-language movies Category:Movies directed by Bertrand Bonello Category:Movies set in the 1960s Category:Movies set in the 1970s Category:Movies set in Paris Category:French LGBT movies Category:LGBT drama movies",
 "title": "Saint Laurent (movie)"
}