{
 "id": "943196",
 "text": "Giovanni Battista Pergolesi (January 4, 1710 March 16, 1736) was an Italian baroque composer, violinist, and organist. His career only lasted six years before he died. He composed operas, religious music and some instrumental music. His most famous works are his Stabat Mater and La serva padrona. == Life == Pergolesi was born in Jesi. His family name was \"Draghi\". His grandfather was from Pergola. So, he was called \"Pergolesi\" (somebody from Pergola). He studied music in Jesi with Francesco Santi, the maestro di capella of the town. He went to study in Naples sometime between 1720 and 1725. He studied with Gaetano Greco, Leonardo Vinci, and Francesco Durante. He played the violin and sang in the music school. Pergolesi left the music school in 1731. He started his career. He started writing operas. His first opera, Salustia, was not successful. He wrote Il prigioniero superbo in 1733. The opera celebrates Empress Elisabeth Christine's birthday. The intermezzo of this opera was another opera, La serva padrona. The intermezzo became popular after Pergolesi's death. He became the maestro di capella to Prince Ferdinando Colonna of Stigliano in 1732. In that year, the Kingdom of Spain invaded Naples. Charles III, king of Spain, became the new King of Naples. So, Prince Ferdinando ran away to Rome. Pergolesi performed one of his masses in Rome. He became the maestro di capella to the Duke of Maddaloni in 1734. Pergolesi started to become sick in 1735. In 1736 he went to stay in a Franciscan monastery in Pozzuoli. He died there in March 16, 1736. He died because of tuberculosis. One of his last works was the Stabat Mater. It was written to replace Alessandro Scarlatti's setting of the Stabat Mater. == Legacy == Pergolesi's operas were popular after his death. His music made people France argue about Italian and French music. This was known as the \"quarrel of the buffoons\" (). La serva padrona and his Stabat Mater was praised by many people. == References == == Other websites == * Category:1710 births Category:1736 deaths Category:18th-century Italian composers Category:Baroque composers Category:Italian violinists Category:Italian organists Category:Deaths from tuberculosis",
 "title": "Giovanni Battista Pergolesi"
}