{
 "id": "943696",
 "text": "The After Hours til Dawn Tour is the seventh tour by Canadian recording artist The Weeknd. It began July 14, 2022, in Philadelphia. It is in support of The Weeknd's fourth album After Hours (2020) and fifth album Dawn FM (2022). The tour was originally called The After Hours Tour, but it was canceled because of the coronavirus pandemic and because The Weeknd wanted to create a larger tour using stadiums instead of arenas. American recording artist Doja Cat was scheduled to be the tour's opening act but canceled due to throat surgery. The Toronto show at Rogers Centre was going to happen on July 8, 2022, but it didn't and he rescheduled it for September 22 due to the nationwide Rogers cellular and internet outage. The second show in Los Angeles, on September 3, 2022, was canceled when The Weeknd lost his voice onstage. He promised to refund the tickets if fans wished and to reschedule the show. == Tour dates == North America Date City Country Venue Opening Act July 14, 2022 Philadelphia United States Lincoln Financial Field Kaytranada Mike Dean July 16, 2022 East Rutherford MetLife Stadium July 21, 2022 Boston Gillette Stadium July 24, 2022 Chicago Soldier Field July 27, 2022 Detroit Ford Field July 30, 2022 Washington, D.C. Fedexfield August 4, 2022 Tampa Raymond James Stadium August 6, 2022 Miami Hard Rock Stadium August 11, 2022 Atlanta AT&T; Stadium Snoh Aalegra Mike Dean August 18, 2022 Denver Empower Field at Mile High Kaytranada Mike Dean August 20, 2022 Las Vegas Allegiant Stadium August 23, 2022 Vancouver Canada BC Place August 25, 2022 Seattle United States Lumen Field Snoh Aalegra Mike Dean August 27, 2022 San Francisco Levi's Stadium August 30, 2022 Phoenix State Farm Stadium Kaytranada Mike Dean September 2, 2022 Los Angeles Sofi Stadium September 22, 2022 Toronto Canada Rogers Centre == Canceled shows == Date City Country Venue Opening Act Reason July 8, 2022 Toronto Canada Rogers Centre Kaytranada Mike Dean Rogers outage September 3, 2022 Los Angeles United States Sofi Stadium Kaytranada Mike Dean Vocal issues == References == Category:Concert tours Category:The Weeknd",
 "title": "After Hours til Dawn Tour"
}