{
 "id": "944351",
 "text": "The Lobster Fisherman (which translates to “L'Aragostaio”) is an artist's multiple by the Italian artist Giovanni De Martino, made in 1875, in bronze, it measures 35 x 56 centimeters, and is part of the Collection of the Museum of Modern and Contemporary Art in Varese. == Description == The fisher child represents a crustacean seller, and will be reprized in the 1916 work \"Le Pêcheur de criquets\" by De Martino. De Martino's most precious works concern the representations of the children of the people, and for this reason he was also called \"the sculptor of children\", in which he highlights a great ability to represent in a realistic way the expressions and characters of children. Benito Mussolini during the Rome quadrennial in 1931 indicated him as an important exponent of Italian art. Giovanni de Martino's sculptures highlight his empathic closeness to the humbler classes, re-entering the movement of social realism. The surface of the sculpture is shiny and dark with a slightly golden tone. For this reason, the light creates decisive contrasts of brightness that highlight the volumes of the body and mark the anatomical modeling. == Museum == Museum of Modern and Contemporary Art in Varese. == Exhibition history == * Il Bello o il Vero. La Scultura Napoletana del Secondo Ottocento e del Primo Novecento, Basilica e Convento di San Domenico Maggiore, Nicola Longobardi Editore, Napoli, 2014 ==Related pages== * Giovanni De Martino === Notes === == Bibliography == * Isabella Valente, Il Bello o il Vero. La Scultura Napoletana del Secondo Ottocento e del Primo Novecento, Basilica e Convento di San Domenico Maggiore, Nicola Longobardi Editore, Napoli, 2014 * Luigi Iaccarino, Mimmo Di Guida, Rossella Manzione, Novevento, un secolo di “novecento”, tra collezionismo privato ed esposizioni pubbliche, Edizioni Vincent, Napoli, 2010 == Other websites == * Giovanni De Martino, Lombardia Beni culturali Category:Conceptual art Category:Sculptures by Giovanni De Martino Category:1875 works",
 "title": "The Lobster Fisherman (De Martino)"
}