{
 "id": "944373",
 "text": "Man with a Movie Camera (Russian: Человек с киноаппаратом) is a Soviet silent documentary film directed by Dziga Vertov. His brother Mikhail Kaufman filmed the movie and appears in the film as the cameraman. The movie is experimentalal and there are no actorss. It shows the city life in Moscow, Kyiv and Odesa for one day. The movie is often considered one of the best movies and documentaries. == Overview == There is no single plot or storyline. The movie starts with people entering a theater and shows a screen. On the screen, the cameraman goes to locations to record on the spot. The cameraman appears several times in the movie. The movie often switches from showing the cameraman to the what the camera is looking at. The camera shows people and machines in the early morning. Everything is still and quiet. The camera goes on to shows the city waking up. It shows workers and transportation (street cars, trains, airplanes, carriages). There are different types of work and classes of people. The camera captures the movement of objects. The movie shows the dense population and busy industries. The movie switches between movement and still images. Later in the day, the camera shows more entertainment like a beach and a carnival and sports like track and field and soccer and music. Other daily events included are personal hygiene, people getting married and divorced, birth of children and a funeral. The movie ends with an image of the camera and the eye of the cameraman looking through it. == Style and Techniques == The movie is very experimental and radical. Vertov wanted to create a universal image that was separate from any language. The movie is very fast-paced. A lot of the montage editing is not linear. The movie used many filming techniques. Examples are multiple exposure, fast motion, slow motion, freeze frames, match cuts, jump cuts, split screens, Dutch angles, extreme close-ups, tracking shots, reversed footage, stop motion animations and self-reflexive visuals. Many movies today use these techniques. == Reception == The movie did not have that good reviews in the beginning. People criticized the movie. Soviet filmmaker Sergei Eisenstein did not like the movie. Critics did not take the film seriously.Roberts, Graham (2000). The Man With the Movie Camera: The Film Companion. I.B. Tauris. p. 99. ISBN 1860643949. The reception has changed over time. Man with a Movie Camera is now viewed as a great movie and even one of the best. The movie has a 97% rating on Rotten Tomatoes. The movie got 8th place in a Sight & Sound poll from 2021. The movie was included in Time magazine's All-time 100 Movies. Roger Ebert gave the movie a four out of four rating. == References == Category:Russian movies Category:Ukrainian movies Category:Movies set in Ukraine",
 "title": "Man with a Movie Camera"
}