{
 "id": "944683",
 "text": "The 2022 Illinois gubernatorial election happened on November 8, 2022, to elect the governor of Illinois. Current governor and lieutenant governor J. B. Pritzker and Juliana Stratton, the Democrat nominees, won reelection to a second term. They defeated Illinois State Senator Darren Bailey and his running mate Stephanie Trussell, the Republican nominees. ==Democratic primary== ===Candidates=== ==== Nominee ==== * J. B. Pritzker, incumbent governor **Running mate: Juliana Stratton, incumbent lieutenant governor ====Eliminated in primary==== *Beverly Miles, U.S. Army veteran, registered nurse and activist **Running mate: Karla Shaw ===Results=== ==Republican primary== ===Candidates=== ==== Nominee ==== * Darren Bailey, state senator ** Running mate: Stephanie Trussell, former radio talk show host ==== Eliminated in primary ==== *Richard Irvin, mayor of Aurora **Running mate: Avery Bourne, state representative *Gary Rabine, businessman **Running mate: Aaron Del Mar, Palatine Township Republican Committeeman *Paul Schimpf, former state senator and nominee for Attorney General in 2014 **Running mate: Carolyn Schofield, member of the McHenry County Board *Max Solomon, Attorney **Running Mate: Latasha H. Fields *Jesse Sullivan, venture capitalist and founder of Alter Global **Running mate: Kathleen Murphy, former director of communications for state representative Jeanne Ives ==== Removed from ballot ==== * Emily Johnson (came up short in the number of signatures required) * Keisha Smith (came up short in the number of signatures required) ====Declined==== *Rodney Davis, U.S. Representative for (running for re-election) *Kirk Dillard, chairman of the Regional Transportation Authority, former state senator, and candidate for governor in 2010 and 2014 *Adam Kinzinger, U.S. Representative for *Todd Ricketts, finance chair of the Republican National Committee, member of the TD Ameritrade Board of Directors, and co-owner of the Chicago Cubs ===Results=== ==General election== ;Graphical summary Poll source Date(s) administered Sample size Margin of error J. B. Pritzker (D) Darren Bailey (R) Scott Schluter (L) Undecided Victory Research (R) August 30 – September 1, 2022 1,208 (LV) ± 2.8% 46% 36% 2% 15% Victory Geek (D) August 25–28, 2022 512 (LV) ± 4.3% 56% 38% – 6% Victory Research (R) July 17–19, 2022 1,208 (LV) ± 2.8% 49% 39% 2% 10% Fabrizio Lee & Associates (R) June 20–21, 2022 800 (LV) ± 3.5% 50% 43% – 7% Victory Research (R) January 18–20, 2022 1,208 (LV) ± 2.8% 55% 27% – 17% ===Results=== ==Notes== ==References== Category:2022 elections in the United States Category:November 2022 events Category:2022 in Illinois",
 "title": "2022 Illinois gubernatorial election"
}