{
 "id": "944711",
 "text": "The Koala Brothers is an stop-motion animated children's television series originally provided by Spellbound Entertainment. A notable quality of the television program is that although there can be differences of opinion and some instances of anti-social or unthoughtful behaviour, there are no villains or antagonistic characters. Rather, the emphasis is on helping and being a good friend. == Characters == All the characters are anthropomorphic native Australian animals mainly speaking with correct accents, with the notable exceptions of Archie, who speaks with a British accent and Penny, who only communicates by chattering. === Main === * Frank (voiced by Keith Wickham) is a koala who is the pilot of the aeroplane. He has demonstrated excellent skills in tennis and was the only member of the community able to defeat Archie, though Frank admitted it was probably just luck. He also fostered an interest in pottery at one point but did not have any great artistic ability. * Buster (voiced by Rob Rackstraw) is a koala who usually sits behind Frank in the aeroplane and uses his telescope to spot friends in need from the air. Buster is always willing to provide a pep talk or a hug to his friends. Buster speaks more softly than Frank, and he has a small tuft of hair on the top of his head. Buster loves to bake, especially butter biscuits. * Jonathan Coleman is the Narrator. === Supporting === * Mitzi (voiced by Lucinda Cowden) is a possum who almost singularly wears thongs exposing her toes which implies an attachment though it is not brought up in stories along with thick-rimmed glasses. Mitzi lives in part of the Koala Brothers' homestead made over as her living quarters and is young and impressionable, often relying on the Koala Brothers to stay in line with her perfection-seeking impulses. Mitzi can get bossy and upset her friends at times, but she means no harm and her friends always forgive her as she is still working out her limits. A recurring sight- gag shows Mitzi slipping out of either or both her thongs due to being constantly on the go. * Ned (voiced by Janet James) is a wombat who is one of the youngest members of the local community behind Mitzi, and lives in a caravan next door to the Koala brothers's homestead. Ned is often not sure of himself, but he dreams of adventure and longs to be a hero like his idols, Frank and Buster. Ned is very determined and easily fixated on an idea, and often will come through with prompting. * George (voiced by Rob Rackstraw) is a turtle who is the outback's local post carrier. George has no established residence whatsoever, but he is always seen delivering the post with his trusty leather satchel. George is very proud of being a post carrier, and tells the best campfire stories in the outback. George also has an interest in stamp collecting. * Sammy (voiced by Rob Rackstraw) is an echidna who lives in town and owns the local general store, which sells fuel in addition to comestibles. His only employee is Josie. As one of the more senior citizens, Sammy has the fewest problems after the Koala Brothers. * Josie (voiced by Janet James) is a roo who is Sammy's only assistant who often works at the outback's general store and is often seen doing so. Josie has a blue skirt with a deep pocket and white shoes. She and Mitzi are still the best of friends. Although Josie is shy, she is always seen with her tummy showing, because of the small red and white striped shirt that she wears. * Alice (voiced by Lucinda Cowden) is a platypus who works at the local café and appears to be the lone employee, though it is unclear if Alice owns the café. Alice is very forgetful. She rides a green motor scooter around, which has its share of drastic engine problems. Alice loves to bake, and is good at following recipes. Alice is also good at reading maps. * Archie (voiced by Keith Wickham) is a crocodile who lives in a well-appointed cottage near the local water hole. Archie is very cheerful and friendly, and is always exercising, stretching, or playing tennis, and is also renowned at being the best at almost every sport. Archie is British and speaks in a memorable rich accent. * Penny (voiced by Janet James) is a penguin who lives in Antarctica, but has visited the outback on certain occasions and keeps up a regular written correspondence with the Koala brothers. Penny communicates by chattering and sang \"The Helping Song\". * Lolly (voiced by Lucinda Cowden) is an emu who is the Outback's female local ice cream vendor and can often be seen driving her ice cream truck around the Outback. Lolly often greets people by answered \"How can I cool you down?\" to them. ==References== Category:2003 television series debuts Category:2007 television series endings Category:British stop-motion television series",
 "title": "The Koala Brothers"
}