{
 "id": "944771",
 "text": "Italian-Palestinian relations are the international relations between the Italian Republic and the State of Palestine. Italy has a general consulate in Jerusalem, and the State of Palestine has an embassy in Rome. ==Relationships over time== After the 1967 war, Palestinian students flocked to study in Italian universities, and with it a branch of the General Union of Palestinian Students was established in Italy, which was the only Palestinian presence until 1974 when it received the delegation of the Palestine Liberation Organization under the name of “the office” at the headquarters of the League of Arab States until 1979. Nimer Hammad was the first Palestinian representative to Italy. ===1980s=== In 1980, Italy recognized the Palestine Liberation Organization as the representative of the Palestinian people. After the Israeli invasion of Lebanon, PLO Chairman Yasser Arafat visited Italy and met with Italian Prime Minister Betino Craxi, and a representative office of the PLO in Italy was opened under the name of “Information and Liaison Office” and Palestinian officials were treated in their representative capacity for the PLO. In 1989, the Palestinian delegation was granted diplomatic status and Italy recognized its Palestinian General Commission. ===2010s=== On November 30, 2011, Italian President Giorgio Napolitano agreed to consider the Palestinian delegation a diplomatic mission and granted the status of ambassador to the head of the mission, and on January 10, 2012, Ambassador Sabri Attia presented his credentials as ambassador. Also, on October 31, 2011, it abstained from voting in favor of Palestine's membership in the United Nations Educational, Scientific and Cultural Organization (UNESCO). In 2012, Italy voted to recognize the State of Palestine as a 2012 observer member at the United Nations. On 27 February 2015, the Italian Parliament recognized the State of Palestine and urged the Italian government to recognize it. In 2016, Italian Prime Minister Matteo Renzi criticized a UNESCO resolution which stated: “It demands that Israel, the occupying power, allow a return to the historical situation that existed until September 2000. Strongly deplores the continued incursion of Al-Aqsa Mosque/Al-Haram Al-Sharif by Israeli right-wing extremists. He denounces the restrictions imposed by Israel on Al-Aqsa Mosque. Reaffirms the obligation of Israel to preserve the integrity, authenticity and cultural heritage of Al-Aqsa Mosque/Al-Haram Al- Sharif, in accordance with the historical situation that existed, as an Islamic holy site of worship and an integral part of a World Cultural Heritage site. He reiterates that the slope of the Mughrabi Gate is an integral part of Al-Aqsa Mosque/Al-Haram Al-Sharif.” His country abstained from voting. ==Italian Consulate General in Jerusalem== The Italian Consulate General in Jerusalem is the highest diplomatic representation of the Italian Republic to the State of Palestine. The Consulate has two offices, one in the Qatamon neighborhood and the other in the Sheikh Jarrah neighborhood in Jerusalem. Giuseppe Fidel has been the Italian Consul General since 2020. ==References== Category:Italy Category:Palestine",
 "title": "Italy-Palestine relations"
}