{
 "id": "944706",
 "text": "Make Way for Noddy is a British CGI children's musical computer-animated television series by Enid Blyton. It originally aired on Channel 5's Milkshake! in the United Kingdom for the first and the second seasons from 2 September 2002 to 7 April 2006. In the United States, the series got an American dub using a British voice actors by BLT Productions and Koko Studios using the American with an American accents by The Character Development and The Sound Company Ltd. on PBS Kids Sprout in 2005. Only the first 2 seasons were dubbed. ==Characters== *Noddy (voiced by Edward Chun in the UK and David A. Kaye in the US) is the protagonist of the series. Noddy is an imaginative wooden boy who lives in Toyland. Although Noddy is characterised as a child, he also serves as the main taxi driver. He sometimes begins nodding uncontrollably, such as after sneezing, and has to physically stop himself from nodding. *Tessie Bear (voiced by Joanna Ruiz in the UK and Britt McKillip in the US) is a neutral and child-like female teddy bear who is Noddy's best friend, always ready to try something new and help everyone she sees. *Big Ears (voiced by Pavel Douglas in the UK and Michael Dobson in the US) is a gnome who serves as a father figure to Noddy and the other toys with astute knowledge and a fine sense-of-humour. *Dinah Doll (voiced by Andrea Harris in the UK and Tabitha St. Germain in the US) is a Toy Town shopkeeper and a big sibling support figure to Noddy. *Mr. Plod (voiced by Pavel Douglas in the UK and Richard Newman in the US) is Toyland's sole police officer who is persistent for maintaining a certain order but means well and whose catchphrase is \"Halt/Stop, in the name of Plod!\" *Bumpy Dog (voiced by Ben Small in the UK and Lee Tockar in the US) is Tessie Bear's extremely playful but loyal and sensitive dog. *Gobbo and Sly (voiced by Ben Small in the UK and Don Brown and Doug Parker in the US) are two goblins who serve as the series' antagonists. Gobbo is the more conniving and intelligent one while Sly is the more airheaded and curious of the two members. *Mr. Sparks (voiced by Ben Small in the UK and Lee Tockar in the US) is Toyland's street-smart mechanic. *Miss Pink Cat (voiced by Carrie Mullan in the UK and Tabitha St. Germain in the US) is the pessimistic and sophisticated owner of Toy Town's ice cream shop. She speaks with a French accent. *Master Tubby Bear (voiced by Carrie Mullan in the UK and Manny Petruzzelli in the US) is a young teddy bear whose role was changed from a tricky mummy's boy (in previous incarnations) to a moody but lovable anti-idol kid in this series, though this was clearly done as it lent more to having him involved in stories, this time in noticeable contrast as a boy hero to Noddy. *Martha Monkey (voiced by Joanna Ruiz in the UK and Kathleen Barr in the US) is a stuffed monkey with an energetic but bossy tomboy personality. *Mr. Jumbo (voiced by Ben Small in the UK and Ian James Corlett in the US) is a mild-mannered stuffed elephant. *Clockwork Mouse (voiced by Joanna Ruiz in the UK and Kathleen Barr in the US) is a perky wind- up toy mouse who isn't sometimes feeling dwarfed by the other inhabitants of Toyland for his size. *Mr. Wobblyman (voiced by Ben Small in the UK and Ian James Corlett in the US) is a roly-poly toy who is always diligent about doing the right thing. *Clockwork Clown (voiced by Ben Small in the UK and Ian James Corlett in the US) is a toy clown. *The Skittles (voiced by Joanna Ruiz, Carrie Johnston and Ben Small in the UK and Teryl Rothery and Chantal Strand in the US) are a family of orderly bowling pins. *Harvey (voiced by Ben Small in the UK and in the US) and Cecilia (voiced by Joanna Ruiz in the UK and in the US) are two beetles. *Mr. Train Driver (voiced by Ben Small in the UK and Ian James Corlett in the US) is a train driver who takes the toytown train. *Mr. Noah (voiced by Pavel Douglas in the UK and Michael Dobson in the US) is Mrs. Noah's husband. *Mrs. Noah (voiced by Andrea Harris in the UK and Tabitha St. Germain in the US) is Mr. Noah's wife. ==Episodes== === Season 1 (2002) === === Season 2 (2003) === ===Specials (2004–2006)=== == Notes == == References == ==Other websites== Category:2002 British television series debuts Category:2003 British television series endings Category:British animated television series Category:2005 American television series debuts Category:2007 American television series endings Category:American animated television series",
 "title": "Make Way for Noddy"
}