{
 "id": "945031",
 "text": "Serratia – genus of Gram-negative anaerobic rod-shaped bacteria, some species of which produce a red pigment, prodigiosin. Members of Serratia were initially considered harmless, however, they cause infections in animals, plants, humans, and insects. The diseases include pneumonia, meningitis, endocarditis, and wound infections. The most common species – Serratia marcescens, was found to be highly pathogenic to humans and animals. S. marcescens is included in hospital-acquired infections; found in urinary, respiratory, and gastrointestinal tracts. They cause disease mainly in individuals with weak immune system. Other species cause bone and cardiovascular system infections. == Habitat == Serratia genus occupies wide range of habitats, including water, both seawater and drinking water; plants, such as vegetables, mushrooms, grasses, mosses; and insects: healthy, diseased and dead. == History == The discovery of Serratia genus began with Serratia marcescens species colonised food in 1819. In the city of Padula, Italy, cornmeal dish, called polenta, of many people turned red. This phenomenon was called “bloody polenta” and was believed to have a diabolical origin. The investigation began, and Pietro Melo wrote a paper where he stated that it was spontaneous fermentation. For four years Bartolomeo Bizio, a Venetian pharmacist observed small red spots which got larger and subsequently merged into a red mass. Later, in 1823, he published a paper where he stated that the organism was a fungus and named him Serratia marcescens (after a Florentine physicist Serafino Serrati). == Transmission and treatment == Transmission occurs hand-to-hand, through hospital equipment, such as catheters, and also sinks, blood products and antiseptics. S. marcescens species are increasingly resistant to antibiotics, they rapidly acquire resistant genes, which makes the infections difficult to treat. Gentamicin is the common antibiotic that was used to treat S. marcescens infections, however, bacteria became resistant to it. S. marcescens has the ability to produce beta-lactamase, which is the enzyme providing bacteria resistance to beta lactam antibiotics, such as penicillin. Now the treatment is more effective in a combination of different antibiotics5. == References == Category:Gram-negative bacteria",
 "title": "Serratia"
}