{
 "id": "945199",
 "text": "DWKC-DTV (channel 31) is a television station in Metro Manila, Philippines, serving as the flagship of Broadcast Enterprises and Affiliated Media, Inc. Its main office is located at the 3rd floor, Globe Telecom Plaza 1, Pioneer St. cor. Madison St., Mandaluyong City, while its transmitter and master control is located at Palos Verdes Subdivision, Sumulong Highway, Brgy. Santa Cruz, Antipolo, Rizal. ==Digital channels== DWKC-DTV currently operates on UHF Channel 31 (575.143 MHz) and is multiplexed into the following subchannels: Channel Video Aspect Short name Programming Notes 31.1 1080i 16:9 BRIGADA NEWS TELERADYO Brigada News TeleRadyo Commercial broadcast 31.3 TELERADYO SERBISYO TeleRadyo Serbisyo 31.4 DWBL TELERADYO DWBL TeleRadyo 31.5 480i 16:9 WION WION 31.6 480i 4:3 LIFE TV Life TV 31.7 1080i 16:9 PILIPINAS HD Pilipinas HD/Oras ng Himala 31.8 480i 16:9 EURONEWS Euronews 31.9 480i 16:9 DEPED TV DepEd TV 31.31 240p 4:3 BRIGADA NEWS TELERADYO OneSeg Brigada News TeleRadyo 1Seg test broadcast ===Transition to digital television=== According to BEAM president Steve Macion, the station is expected to replace the 50 kW (4,050 kilowatt ERP) analog transmitter with a new, DTT-ready transmitter which is currently under transition and would be completed by the end of 2015. Cebu, Davao and Iloilo stations are also expected to upgrade to digital broadcast. Aside from blocktimers, BEAM is now looking for local and foreign partnerships to allocate and generate content up to eight digital free TV channels. In 2016, DYCT-DTV and DXKC-DTV, BEAM's stations in Cebu and Davao, respectively, conducted DTT test transmissions on UHF channel 32. DYRM-DTV, BEAM's Iloilo station, conducted its DTT test in 2017. == Areas of Coverage == === Primary areas === * Metro Manila * Cavite * Bulacan * Laguna * Rizal ==== Secondary Areas ==== * Portion of Pampanga * Portion of Nueva Ecija * Portion of Tarlac * Portion of Zambales * Portion of Bataan * Portion of Batangas * Portion of Quezon == References == Category:Filipino television stations",
 "title": "DWKC-DTV"
}