{
 "id": "945265",
 "text": "This is a list of programs broadcast by The CW. Some programs were broadcast on UPN and The WB. The networks merged with the CW when the networks ceased broadcasting. ==Current programming== ===Drama=== Title Genre Premiere Seasons Runtime Status The Flash Superhero drama Renewed Riverdale Teen drama Season 6 ongoing; Renewed for final season Dynasty Soap opera Final season ongoing All American Sports drama Season 5 due to premiere on October 10, 2022 Roswell, New Mexico Science fiction drama Final season ongoing In the Dark Crime drama Final season ongoing Two Sentence Horror Stories Horror anthology Pending Nancy Drew Mystery drama Renewed Stargirl Superhero drama Season 3 due to premiere on August 31, 2022 Walker Western drama Season 3 due to premiere on October 6, 2022 Superman & Lois Superhero drama Renewed Kung Fu Martial arts action-adventure drama Season 3 due to premiere on October 5, 2022 All American: Homecoming Sports drama Season 2 due to premiere on October 10, 2022 Tom Swift Mystery drama Season 1 ongoing; Canceled Awaiting release Walker: Independence Crime drama TBA TBA Pending The Winchesters Supernatural drama TBA TBA Pending ===Unscripted=== ====Docuseries==== Title Genre Premiere Seasons Runtime Status Mysteries Decoded Docuseries Season 2 ongoing ====Reality==== Title Genre Premiere Seasons Runtime Status Penn & Teller: Fool Us Magic competition Season 9 due to premiere on October 14, 2022 Masters of Illusion Stage magic Renewed World's Funniest Animals Comedy clip show Season 3 due to premiere on October 22, 2022 Killer Camp Reality competition New episodes due to premiere on August 5, 2022 Would I Lie to You? (USA) Panel game show Pending Awaiting release Criss Angel's Magic With the Stars Reality TBA TBA Pending ====Variety==== Title Genre Premiere Seasons Runtime Status Whose Line Is It Anyway? Improvisational comedy Season 11 due to premiere on October 14, 2022 ===Acquired programming=== Title Genre Original network Premiere Seasons Runtime Status Coroner Crime drama CBC Television Season 4 due to premiere on October 2, 2022 Devils Financial thriller Sky Atlantic (Italy) Season 2 due to premiere on August 16, 2022 Wellington Paranormal Mockumentary comedy horror Television New Zealand 2 Final season due to premiere on July 27, 2022 Great Chocolate Showdown Reality competition Food Network Canada Season 2 due to premiere on August 11, 2022 Awaiting release Bump Comedy drama Nine Network/Stan Pending Leonardo Historical drama Rai 1 Pending Family Law Legal drama Global/Sky Investigation Pending Professionals Action adventure Viaplay Pending ==Upcoming programming== ===Drama=== Title Genre Premiere Seasons Runtime Status Gotham Knights Superhero drama 2023 TBA TBA Series order ===Unscripted=== Title Genre Premiere Seasons Runtime Status Recipe for Disaster Reality 2023 TBA TBA Series order ==Former programming== ===Dramas=== Title Premiere date Finale date Notes Seasons 7th Heaven Originally aired on The WB from August 26, 1996 to May 8, 2006. 11 Runaway 1 Gilmore Girls Originally aired on The WB from October 5, 2000 to May 9, 2006. 7 One Tree Hill Originally aired on The WB from September 23, 2003 to May 3, 2006. 4–9 Smallville Originally aired on The WB from October 16, 2001 to May 11, 2006. 6–10 Supernatural Originally aired on The WB from September 13, 2005 to May 4, 2006. 2–15 Veronica Mars Originally aired on UPN from September 22, 2004 to May 9, 2006. 3 Hidden Palms 1 Gossip Girl 1–6 Reaper 1–2 Life Is Wild 1 90210 1–5 Privileged 1 Melrose Place 1 The Vampire Diaries 1–8 The Beautiful Life 1 Life Unexpected 1–2 Hellcats 1 Nikita 1–4 Ringer 1 The Secret Circle 1 Hart of Dixie 1–4 Arrow 1–8 Beauty & the Beast 1–4 Emily Owens, M.D. 1 The Carrie Diaries 1–2 Cult 1 The Originals 1–5 The Tomorrow People 1 Reign 1–4 Star-Crossed 1 The 100 1–7 Jane the Virgin 1–5 iZombie 1–5 The Messengers 1 Crazy Ex-Girlfriend 1–4 Legends of Tomorrow 1–7 Containment 1 No Tomorrow 1 Frequency 1 Supergirl Originally aired on CBS from October 26, 2015 to April 18, 2016. 2–6 Valor 1 Black Lightning 1–4 Life Sentence 1 Charmed 1–4 Legacies 1–4 Pandora 1–2 Batwoman 1–3 Katy Keene 1 The Republic of Sarah 1 4400 1 Naomi 1 ===Comedies=== Title Premiere date Finale date Notes Seasons All of Us Originally aired on UPN from September 16, 2003 to May 15, 2006. 4 Everybody Hates Chris Originally aired on UPN from September 22, 2005 to May 11, 2006. 2–4 Girlfriends Originally aired on UPN from September 11, 2000 to May 8, 2006. 7–8 The Game Moved to BET for seasons 4 through 9 and then moved to Paramount+ for season 10. 1–3 Reba Originally aired on The WB from October 5, 2001 to May 5, 2006. 6 Aliens in America 1 Backpackers 1 Significant Mother 1 ===Reality/non-scripted programming=== Title Premiere date Finale date Notes Seasons America's Next Top Model Originally aired on UPN from May 20, 2003 to May 17, 2006 and moved to VH1 for seasons 23–24 7–22 WWE Friday Night SmackDown Originally aired on UPN from April 29, 1999 to September 2006. It moved to MyNetworkTV for seasons 10–11 and aired subsequently on Syfy and USA Network. The show has aired on Fox since 2019. 8–9 Beauty and the Geek Originally aired on UPN from June 1, 2005 to March 9, 2006. 3–5 Pussycat Dolls Present 1–2 CW Now 1 Online Nation 1 Crowned: The Mother of All Pageants 1 Farmer Wants a Wife 1 Stylista 1 The CW Sunday Movie 1 13: Fear Is Real 1 Hitched or Ditched 1 High Society 1 Fly Girls 1 Plain Jane 1 H8R 1 Remodeled 1 Shedding for the Wedding 1 The Catalina 1 Breaking Pointe 1–2 The Next: Fame Is at Your Doorstep 1 Oh Sit! 1–2 Perfect Score 1 Capture 1 Famous in 12 1 Cedric's Barber Battle 1 A Wicked Offer 1 MADtv 15 My Last Days 2–4 Terry Crews Saves Christmas 1 The Big Stage 1 Hypnotize Me 1 The Christmas Caroler Challenge 1–2 Peaking 1 The CW Happy Hour 1 Legends of the Hidden Temple Originally aired on Nickelodeon from September 11, 1993 to November 24, 1995. 4 March 1 ==References== Cw programs",
 "title": "List of programs broadcast by The CW"
}