{
 "id": "945436",
 "text": "Thomas Sageder (* born 5 September 1983) is an Austrian football manager. == Career == Sageder started with the youth of SV Riedau. In 2008/2009, he was coach of the youth of FC Red Bull Salzburg. The next season he became assistance coach of Andreas Milot in the SV Ried Academy. In 2010 and 2011, he was coach of the Red Bull Academy in Ghana. In 2011 he became the assistance coach of the 2nd league team FC Blau-Weiß Linz. After their relegation he became the assistance coach of Oliver Glasner with SV Ried in the Austrian Bundesliga. Glasner went to LASK so in May 2015 he became caretaker together with Ewald Brenner till the end of the season.http://www.svried.at/news/archiv-news/news-archiv- detail/news/detail/News/brenner-und-sageder-leiten-training-der-sv-josko-ried/ Brenner und Sageder leiten Training der SV Josko Ried In December 2015 he left SV Ried.Ried verpflichtete Brandner – Assistenztrainer Sageder weg kleinezeitung.at, am 16. Dezember 2015, abgerufen am 15. Dezember 2017 In the 2016/17 season, he trained SV Wallern in the 4th league.Sageder wird neuer Wallern-Trainer nachrichten.at, am 24. Mai 2016, abgerufen am 15. Dezember 2017 In December 2017, he came back to FC Blau-Weiß Linz as head coach.Mehr als ein Coach: Thomas Sageder blauweiss-linz.at, am 15. Dezember 2017, abgerufen am 15. Dezember 2017 2019 he resigned after four losses in a row.Vertragsauflösung mit Thomas Sageder blauweiss-linz.at, am 13. März 2019, abgerufen am 13. März 2019 In the 2019/20, season he was assistance coach to Oliver Glasner with VfL Wolfsburg in the Bundesliga.Jetzt live: Oliver Glasner verkündet seinen Abschied vom LASK nachrichten.at, am 23. April 2019, abgerufen am 23. April 2019 In the 2021/22, season he was assistance coach to Fabio Ingolitsch in the Red Bull Academy U18. Together with Ingolitsch he went to FC Liefering in the 2022/23 season. After the season Sageder left Liefering and became head coach of LASK in the Bundesliga == References== Category:1983 births Category:Living people Category:Austrian football managers Category:FC Liefering managers Category:LASK managers",
 "title": "Thomas Sageder"
}