{
 "id": "945662",
 "text": "Alibaba Group Holding Limited, known as Alibaba (), is a Chinese multinational technology company. It started on 28 June 1999, in Hangzhou, Zhejiang. Alibaba focuses on online shopping, retail, the internet, and technology. It helps people buy and sell things online through person-to-person, business-to- customer, and business-to-business sales. It also provides digital media, entertainment, shipping, and cloud computing services. Alibaba owns and runs many companies worldwide in various industries. On 19 September 2014, Alibaba went public on the New York Stock Exchange, raising $25 billion. This made Alibaba worth $231 billion, which was the biggest initial public offering (IPO) in history at that time. It's now among the top 10 most valuable companies and ranked the 31st-largest public company globally on the Forbes Global 2000 2020 list. In January 2018, Alibaba became the second Asian company valued at over $500 billion, following its competitor Tencent. As of 2022, Alibaba is the ninth-highest-valued brand globally. Alibaba is one of the biggest retail and online shopping companies worldwide. In 2020, it was also ranked as the fifth-largest artificial intelligence company. It is also a major venture capital firm and investment company globally and the second- largest financial services group after Visa through its financial technology arm, Ant Group. The company runs the largest online marketplaces for business- to-business (Alibaba.com), person-to-person (Taobao), and business-to-customer (Tmall) sales. Alibaba has been entering the media business, increasing yearly profits. It also made a big record on China's Singles' Day in 2018, the world's largest online and offline shopping day. == History == === Early Years === On 28 June 1999, Jack Ma and 17 friends of his started Alibaba.com, an online business marketplace, in Ma's apartment in Hangzhou, China. In October 1999, Alibaba got a $25 million investment from Investor AB, Goldman Sachs, and SoftBank. The goal of Alibaba.com was to improve online shopping in China, especially for small and medium-sized businesses, and to help Chinese products sell world-wide while dealing with challenges from the World Trade Organization. By 2002, Alibaba.com started making a profit. Jack Ma wanted to make global online shopping better, so Alibaba launched other services like Taobao Marketplace, Alipay, Alimama.com, and Lynx from 2003 onward. When eBay, an American multinational e-commerce company, announced its arrival in China in 2003, Jack Ma saw them as competition and said no to eBay buying Taobao. Alibaba's companies did better than eBay in China by using existing technology, gaining trust, and offering more services even if they didn't initially make money. Eventually, Alibaba's Taobao Marketplace beat eBay in China, and eBay had to close its China website. After six years, eBay and Alibaba broke even. === Expansion === In 2005, Yahoo! invested $1 billion in Alibaba, buying a 40% company share. When Alibaba went public, Yahoo! made $10 billion from their investment alone. In 2012, China Investment Corporation led a group of Chinese investors to buy Yahoo!'s 40% share in Alibaba. In 2013, Alibaba planned to open traditional stores with Wanda Group. They also bought a 25% share in Intime Retail, a Chinese department store chain, in early 2014. In 2017, Alibaba and Intime's creator agreed to take the store chain private for $2.6 billion. In April 2014, Alibaba invested in Lyft, a ride-sharing company, and bought a 50% share of Guangzhou Evergrande F.C., a soccer team. In September 2014, Alibaba went public with the biggest IPO in US history, raising $21.8 billion. Alibaba was sued in California in 2015 by investors alleging Securities Act violations. The company settled in 2018 for $75 million. In 2017, Alibaba and the International Olympic Committee announced an $800 million sponsorship deal for the Olympic Games. In 2018, Jack Ma announced he would step down as chairman to focus on charity work. == Listing == In May 2019, Bloomberg reported that Alibaba might raise $20 billion with a second listing in Hong Kong. In November 2019, they raised $12.9 billion in this listing, the year's largest offering. On 10 September 2019, Jack Ma stepped down as chairman, and Daniel Zhang took over. In November 2020, The Wall Street Journal said CCP general secretary Xi Jinping stopped Jack Ma's Ant Group IPO. This led to new regulations on tech companies by the Chinese government. Alibaba's stock price dropped in December 2020 due to an antitrust investigation. The government fined Alibaba $2.8 billion in April 2021 for anti-competitive practices. During the Singles' Day sales in November 2021, Alibaba received a record $114.4 billion in orders. In July 2022, the SEC said Alibaba could be delisted from US stock exchanges if its books weren't examined by 2024. In December 2022, a Chinese state-owned enterprise invested in two Alibaba subsidiaries controlling Youku and UCWeb. == Restructuring == In March 2023, Alibaba announced a restructuring plan called \"1+6+N\". They divided their business into six separate parts: Cloud Intelligence Group, Taobao and Tmall Group, Cainiao Smart Logistics Network, Local Services Group, Alibaba International Digital Commerce, and the Digital Media and Entertainment group. Each part would have its CEO and board and could raise money and list on the market. Alibaba also created two new committees under this plan. The Wall Street Journal said Jack Ma and CEO Daniel Zhang discussed this plan while Ma was gone. In September 2023, Cainiao Smart Logistics Network Ltd., Alibaba's logistics arm, applied for an IPO in Hong Kong, possibly becoming one of Alibaba's first units to go public. ==References== ==Other websites== * * Category:1999 establishments in Asia Category:Technology companies of the People's Republic of China",
 "title": "Alibaba Group"
}