{
 "id": "945805",
 "text": "Benjamin Rush (January 4, 1746 [O.S. December 24, 1745] – April 19, 1813) was an American politician. He was one of the signers of the Declaration of Independence. He was a leader in the Philadelphia community. Rush was also a physician, social reformer, humanitarian and educator. He founded Dickinson College. He was a professor of medicine and chemistry at the University of Pennsylvania. Rush was also the surgeon general of the Continental Army.Renker, Elizabeth M. (1989). \"'Declaration-Men' and the Rhetoric of Self- Presentation\". Early American Literature. 24 (2): 123 and n. 10 there. JSTOR 25056766. == Early life == Rush was born in Philadelphia on Jan. 4, 1746. He grew up in Philadelphia and went to college at the College of New Jersey (now Princeton University). He did a medical training in Europe. He got a medical degree from the University of Edinburgh. Rush returned to the American colonies. He became a professor at the College of Philadelphia (now University of Pennsylvania). Rush had a medical practice and rescued the American Philosophical Society.Bell, Whitfield J., and Charles Greifenstein, Jr. Patriot-Improvers: Biographical Sketches of Members of the American Philosophical Society. 3 vols. Philadelphia: American Philosophical Society, 1997. His publications include the first American chemistry textbook.Binger, Carl (1966). Revolutionary Doctor / Benjamin Rush (1746–1813). New York: Norton & Co. == Revolutionary era == Rush was politically active. He was part of the Sons of Liberty. He advised Thomas Paine, who wrote Common Sense. Rush signed the Declaration of Independence. He represented Philadelphia at the Constitutional Convention. Rush also gave medical help in battles of the American Revolutionary War. Rush gave directions to keep soldiers healthy. The American military used these guidelines until 1908.Rush, Benjamin (1808). Directions for preserving the health of soldiers : addressed to the officers of the Army of the United States. Philadelphia: Thomas Dobson. However, there was also controversy. Rush sent two letters criticizing George Washington. Rush wrote that the armies were disorderly under Washington. Rush resigned in 1778 and later regretted his letters. == Later life == After the Revolutionary War, Rush worked at the Pennsylvania Hospital. Rush was the treasurer of the United States Mint from 1797 to 1813. He became a fellow of the American Academy of Arts and Sciences in 1788. Rush returned to the University of Pennsylvania as a professor of medicine. William Henry Harrison was a student of Rush. Rush founded Dickinson College in 1773. Rush treated patients during the 1793 Philadelphia yellow fever epidemic. He was also one of the founders of the Pennsylvania Prison Society. Rush prepared Meriwether Lewis for the medical part of the Lewis and Clark Expedition.Woodger, Elin; Toropov, Brandon (2009). Encyclopedia of the Lewis and Clark Expedition. Infobase Publishing. pp. 304–06. ISBN 9781438110233. == Reforms == Rush was a reformer in many ways. He opposed slavery. He spoke out against the slave trade. He argued that African-Americans and Europeans were equal.D'Elia, Donald J (1969). \"Dr. Benjamin Rush and the Negro\". Journal of the History of Ideas. 30 (3): 413–22. doi:10.2307/2708566 He also opposed the death penalty and capital punishment. He believed punishment for criminals should be private. He said the death penalty went against reason and happiness. Rush also supported women's education. He founded the Young Ladies' Academy of Philadelphia. He helped contribute to the ideals of the Republican Motherood.Straub, Jean S (1987). \"Benjamin Rush's View on Women's Education\". Pennsylvania History. 34 (2): 147–57. == Medicine == Medicine at the time was not as advanced. Rush supported heroic medicine. This included things like bloodletting.Rush, Benjamin (1815). \"A Defence of Blood-letting, as a Remedy for Certain Diseases\". Medical Inquiries and Observations. 4. People criticized Rush for this. It is now known to be dangerous. Rush also wrote case reports on infectious diseases like dengue fever.Rush, Benjamin, M.D. (1794). An account of the bilious remitting fever, as it appeared in Philadelphia in the year 1793. Philadelphia, Pa.: Thomas Dobson. Rush believed that blackness was a curable skin disease.Rush, Benjamin (1799). \"Observations Intended to Favour a Supposition That the Black Color (As It Is Called) of the Negroes Is Derived from the Leprosy\". Transactions of the American Philosophical Society. 4: 289–297. doi:10.2307/1005108 Today, this is considered false and wrong. Rush studied Native American health and why they got certain diseases.J. Kunitz; Benjamin Rush (1970). \"Benjamin Rush on Savagism and Progress Stephen\". Ethnohistory. Duke University Press. 17 (1/2): 31–42. JSTOR 481523. Rush also did a lot with mental health. He used mercury for mental problems. He developed occupational therapy and classified mental disorders. Rush treated addiction like a medical condition and not a sin. At the time, people had bad views about mentally sick people. Rush, however, said that mentally ill people were not inhuman animals.\"Rush, Benjamin. Medical Inquiries and Observations, Upon the Diseases of the Mind: Philadelphia: Published by Kimber & Richardson, no. 237, Market Street; Merritt, printer, no. 9, Watkins Alley, 1812\". Their Own Words. Carlisle, Pennsylvania: Dickinson College. July 17, 2003. OCLC 53177922. Archived from the original on January 7, 2004. Elster, Jon (1999). Strong Feelings: Emotion, Addiction, and Human Behavior. MIT Press. p. 131. ISBN 978-0-262-55036-9. == Death == Rush died of typhus fever in 1813. He was buried at Christ Church burial in Philadelphia. ==References== Category:1746 births Category:1813 deaths Category:18th-century American politicians Category:Signers of the U.S. Declaration of Independence Category:Politicians from Pennsylvania Category:Academics from Pennsylvania Category:American physicians",
 "title": "Benjamin Rush"
}