{
 "id": "946018",
 "text": "The Sierra de los Cuchumatanes is a group of mountains in Guatemala. ==Forming== The mountains formed during the Cretaceous Period. The Altos de Chiantla is a table-shaped land in the Sierra. It had an ice cap. ==History== Historians don't know what people used the Sierra and the Altos de Chiantla for before the Spanish came to Mesoamerica. They think only a few people lived there. After the Spanish came to Mesoamerica, they brought sheep. Historians are not sure whether the Spanish brought potatoes to the Sierra or whether South Americans and Mesoamericans brought potatoes there first. But they do know there was more potato farming after the Spanish came. When sheep eat the plants and grass, sometimes the soil is pushed away by the rain and wind. This is called erosion. This is a problem in the Sierra. ==Plants== Some scholars say that the plants of Sierra de los Chuchumatanes are more like the plants in the Andes Mountains in South America than like plants in the rest of Mesoamerica. The plants in this place are páramo grasslands, but there are also some trees: juniper and pines in small groups and forests of fir trees. However, the sheep eat many new plants, so most trees grow in places that are too steep for the sheep to walk. ==Economy== People in the Sierra de los Chuchumantanes grow potatoes and sheep. They do not grow corn the way people closer to sea level do. This is because the weather is colder higher up in the mountains. There are hundreds of miles of stone fences in the Sierra. This keeps the sheep from moving too far away. People put soil on top of the stone fences. They grow plants, for example, agave, in the soil on top of the fences. Many young people leave the Sierra for work. Some of them come to the United States. They send money back home to their families on the Sierra. This money is called remittances. The families use the money to build things: new houses, water systems for their farms, and electricity. They also buy pickup trucks so they can take their potatoes and wool to markets. This way, they can sell them for better prices. ==Houses and buildings== Some people still live in Mayan-style houses: They have roofs made of grass called thatch. But with young people sending money home, their families have built cinder block houses. These houses have roofs made of metal. Most of them have two floors. There are fewer rats in cinder block houses than in houses with grass roofs. The traditional Mayan sweat bath is called a chuj. It is made of rock with a live sod roof. This means the roof is made of earth with plants growing out of it. With young people sending money home, their families have built new chuj out of cinder blocks. ==References== Category:Mountains of North America Category:Geography of Guatemala",
 "title": "Sierra de los Cuchumatanes"
}