{
 "id": "946090",
 "text": "Norris M. Winslow (May 19, 1835 – May 10, 1900) was an American banker and politician. He built almost 100 buildings in Watertown, New York. == Early life and career == Norris Winslow was born on May 19, 1835 in Watertown, New York as the son of John Winslow and Betsey Collins Winslow. He attended public schools in Fields Settlement, New York. He also studied at Falley Seminary and Watertown High School. He graduated in 1854, and he became a clerk in a department store owned by Truman Keeler in Watertown, and he was paid $2 a week. After about two years, he bought the stores stock, and became a merchant. In 1866, he opened the Merchants' Bank of Watertown. In April 1870, the bank was incorporated as a stock company, and he became chief executive officer of the company. In 1869, he bought a cotton factory in Factory Square in Watertown, and he started to heavily improve the square. The Carthage, Watertown and Sackets Harbor Railroad started to be built in 1872, and Winslow was one of the directors. In 1873, he built the Winslow Block, a building in the Public Square in Watertown. He built almost 100 buildings in the southeastern part of Watertown. Winslow was also the chief executive officer of the Watertown Fire Insurance Company, and he was a shareholder of the Davis Sewing Machine Company. The Watertown Spring Wagon Company was started because of him. He was a member of the New York State Senate (18th D.) from 1870 to 1873, in the 93rd, 94th, 95th and 96th New York State Legislatures as a Republican. He was a special agent in the U.S. Treasury Department from 1882 to 1890, but he quit because he was ill. == Personal life and death == He married Julia Elizabeth Eddy on April 16, 1862. They had two children, Harry Eddy Winslow, who was born on June 17, 1863, and Jenny Louise Winslow, who was born on February 21, 1865. Winslow died on May 10, 1900, and he was buried at Brookside Cemetery in Watertown, New York. == References == === Sources === * * == Related pages == * Bradley Winslow, brother of Norris Winslow == Other websites == * Category:1834 births Category:1900 deaths Category:19th-century American politicians Category:American bankers Category:Politicians from New York (state) Category:People from Watertown, New York",
 "title": "Norris Winslow"
}