{
 "id": "946086",
 "text": "The 200 metres at the 1934 Women's World Games was held at the White City Stadium in London, from 9 to 11 August 1934. In the final, the German Käthe Krauß won the event in 24.9 seconds ahead of Polish Stella Walasiewicz and British Eileen Hiscock. ==Entrants== On 9 August an incomple list was published of participating athletes. This list consisted of athletes from seven nations: Austria, Czechslovakia, Great Britain, Germany, Italy, the Netherlands, Poland. Listed below are the athletes from these nations who were entered for the 200 metres event. Nationality Name * * The Dutch Tollien Schuurman injured herself after winning her semi-final 60 metres event. She was replaced and the Dutch Cor Aalten and Beb Martin competed in the 200 metres event. ==Results== ===Heats=== The heats took place on 9 August. ====Heat 1==== Rank Name Nationality Time Notes 1 Stella Walasiewicz 26\" Q 2 Käthe Krauß Q 3 4 5 6 ====Heat 2==== Rank Name Nationality Time Notes 1 Eileen Hiscock 25.5\" Q 2 Barbara Burke Q 3 4 5 6 ====Heat 3==== Rank Name Nationality Time Notes 1 Ruth Dahlin 26.5\" Q 2 Cor Aalten Q 3 4 5 6 ====Heat 4==== Rank Name Nationality Time Notes 1 Nellie Halstead 25.6\" Q 2 Lillian Palmer Q 3 4 5 6 ====Heat 5==== Rank Name Nationality Time Notes 1 Beb Martin 27.3\" Q 2 Spenade Q 3 4 5 6 ====Heat 6==== Rank Name Nationality Time Notes 1 Marie Dollinger 26\" Q 2 Aileen Meagher Q 3 4 5 6 Sources: ===Semi-finals=== The semi-finals took place on 10 August. ====Semi-final 1==== Rank Name Nationality Time Notes 1 Käthe Krauß 25.2\" Q 2 Stella Walasiewicz Q 3 Lillian Palmer Q ? Beb Martin ? ? ====Semi-final 2==== Rank Name Nationality Time Notes 1 Eileen Hiscock 25.3\" Q 2 Marie Dollinger Q 3 Aileen Meagher Q 4 5 6 Cor Aalten Source: ===Final=== The final took place on 12 August 1934. Rank Name Nationality Time Notes Käthe Krauß 24.9\" Stella Walasiewicz 25.0\" Eileen Hiscock 25.2\" 4 Lillian Palmer 5 Aileen Meagher 6 Marie Dollinger Note: in Dutch newspaper sources the Canadian Palmer is listed in third place, without mentioning Hiscock at all. However, all database sources uses Hiscock as third in the event.1934 Women's World Games Intersportstats.com (accessdate 28 July 2022)FSFI Women's World Games GBR Athletics, Retrieved 28 July 2022 Sources: ==Related pages== *Athletics at the Olympics of Grace – 200 metres ==References== Category:Athletics at the 1934 Women's World Games",
 "title": "Athletics at the 1934 Women's World Games – 200 metres"
}