{
 "id": "946001",
 "text": "The 1933 WAAA Championships were the 12th national track and field championships for women in the United Kingdom. The tournament was held on 15 July 1933at the White City Stadium in London, United Kingdom, with the cross country event being held in Warwick. ==Dutch athletes== At the championships also four women from the Netherlands participated, sent by the ENDAT. The Dutch Gerda de Kock became champion in the shot put and javelin throw event, both in a new Enlgish record. According to Dutch newspapers the audience seemed to be pleased with the Dutch participants, their good style and sporting achievements. Gerda de Kock who won two titles, became the focus of photographers and film cameras. The Dutch ladies won two titles and finished three times in second place. Gerda de Kock won the shot put event in a \"new English record\". Dutch newspapers wrote she improved the English national record from 32 ft. 11 inch to 33 ft. 8 inch (10.25 metres). The throw of 10.40 metres of the Dutch Munnikes was invalid. She finished in second place with 10.09 metres. De Kock also became champion in the javelin throw event with 36.10, \"beating the English record with 4 feet and 2 inches\". Title holder Halstead finished in second place. The national records described by the Dutch press, became never official English national records. Bets ter Horst, who was very nervous at the start, finished in second place in the 80 metres hurdles behind Elsie Green. With 12.3 seconds Ter Horst was fasther than the Dutch national record. Cor Pels finished second in the discus throw event behind Ada Holland. ==Results== It rained during the competitions. The stadium was well filled with spectators. 100 metres Eileen Hiscock 12.2\" NR Nellie Halstead 1.5 yards Lillian Chalmers ⚥ 1 yard 200 metres Eileen Hiscock 25.8\" Violet Olney 4 yards Marjorie Pope 1.5 yards 400 metres Nellie Halstead 58.8\" Violet Branch 59.5\" Dorothy Bruty 61.0\" 800 metres Ruth Christmas 2' 23.0\" Violet Humphries 2 yards Dorothy Butterfield 15 yards 80 m hurdles Elsie Green 12.0\" NR Bets ter Horst 12.3\" Marjorie O'Kell 1 foot High jump Mary Milne 1.50 m. Dora Greenwood 1.473 m. Nellie Carrington 1.461 Long jump Phyllis Bartholomew 5.40 m. Nellie Carrington 5.36 m. Josephine Matthews 5.36 m. Shot put Gien de Kock 10.26 m. ~~NR~~ Dicky Munnikes 10.09 m. Kathleen Tilley 9.29 m. Discus throw Ada Holland 33.22 m. NR Cor Pels 31.36 m. Joan Webster 31.55 Javelin throw Gien de Kock 36.11 m. ~~NR~~ Edith Halstead ⚥ 35.21 m. NR Erna Löw 33.36 1600 metres track walk Jeanne Probekk 7' 51.2\" Jessie Howes 20 yards Kitty Bellamy Road walk Jeanne Probekk 25' 56\" Cross-country Lilian Styles 660 yards medley relay London Olympiades 1' 16.8\" ⚥ later identified as a man. Edith Halstead used the name Edwin Halstead when being a man. Lillian Chalmers later used the name Leonard Chalmers. Source: == References == Category:1933 in sports Category:Sport in the United Kingdom Category:Sport in the Netherlands Category:1930s in women's athletics Category:1930s in Europe Category:Sport in London",
 "title": "1933 WAAA Championships"
}