{
 "id": "946378",
 "text": "The 4 × 100 metres relay at the 1934 Women's World Games was held at the White City Stadium in London, from 9 to 11 August 1934. In the final, the Zdena Koubková won the event in a new world record of 2 minutes and 12.8 seconds, ahead of Swedish Märtha Wretman and British Gladys Lunn. ==Entrants== Next to the teams listed, an American team was in London for the 100 metres event and 4x 100 metres event consisting of sprinters Radman, Webb, Whorley and William. The best Dutch sprinter, Tollien Schuurman injured herself after winning her semi-final 60 metres event earlier the day. She was replaced and the Dutch team consisted of the athletes: Cor Aalten, Jo Dalmolen, Agaath Doorgeest and Iet Martin. ==Results== ===Semi-finals=== The semi-finals took place on 9 August. The first semi-final was won by the German women. Canada, who had the second time, was disqualified due to a wrongfully exchange. ====Semi-final 1==== Rank Nation Athletes Time Notes 1 Käthe Krauß, Margarete Kuhlmann, Marie Dollinger, Selma Grieme 48.6\" Q 2 Q DQ Audrey Dearnley wrongfully exchange ====Semi-final 2==== Rank Nation Athletes Time Notes 1 Eileen Hiscock, Elsie Maguire 49.2\" Q 2 Cor Aalten, Jo Dalmolen, Agaath Doorgeest, Iet Martin Q ? ====Semi-final 3==== Rank Nation Athletes Time Notes 1 Veronika Kohlbach, Johanna Vancura, Else Spennader, Gerda Gottlieb 51.6 Q 2 Q ? Sources: The names in italic are highly likely the runners of these nations, as these sprinters are the nations' main 100 metres athletes at the Games. ===Final=== The final took place on 12 August 1934. During the final the British team was leading the race. However the third runner fell down, and so Germany won the race 5 metres ahead of the Netherlands and Austria. Rank Nation Athletes Time Notes Käthe Krauß, Margarete Kuhlmann, Marie Dollinger, Selma Grieme 48.6\" Cor Aalten, Jo Dalmolen, Agaath Doorgeest, Iet Martin +5 metres Veronika Kohlbach, Johanna Vancura, Else Spennader, Gerda Gottlieb 4 5 6 Eileen Hiscock, Elsie Maguire Sources: The names in italic are highly likely the runners of these nations, as these sprinters are the nations' main Athletes in the 100 metres event at the Games. ==Related pages== *Athletics at the Olympics of Grace – 4 × 100 metres relay ==References== Category:Athletics at the 1934 Women's World Games",
 "title": "Athletics at the 1934 Women's World Games – 4 × 100 metres relay"
}