{
 "id": "946505",
 "text": "Michael Feichtenbeiner (born 9 July 1960) is a German football coach. He is coach of Malaysia Super League club Selangor. == Career == He played for the amateur teams of TV Gültstein, SV Vaihingen and FV Germania Degerloch. He started coaching with VfB Stuttgart as youth coach. Then he became head coach of BSC Old Boys Basel from Switzerland and assistant coach at Stuttgarter Kickers Then he was head coach of TSF Ditzingen. From 1993 to 1997 he brought the club from Oberliga Baden-Württemberg to Regionalliga Süd. In 1997 Feichtenbeiner became the assistant coach for KFC Uerdingen 05 and 1998 head coach of SC Pfullendorf. In the summer of 1999 Feichtenbeiner became head coach of Stuttgarter Kickers in the 2. Bundesliga. In the 199-2000 deason the club defeating three Bundesliga clubs (Borussia Dortmund, Arminia Bielefeld and SC Freiburg). In the semi-finals they lost versus Werder Bremen after extra time. But Feichtenbeiner was fired in March 2000 because the results in the league were poor. The following years he coached several Regionalliga Süd teams (SV Darmstadt 98, Rot-Weiß Erfurt, Sportfreunde Siegen). In 2005 he became headcoach of MPPJ FC in the Malaysia Premier League. After being fired by MPPJ FC in early August 2006 he was again head coach of SC Pfullendorf. 2009-10 he was sporting director at Energie Cottbus in 2009-2010 and from 2010-2011 head coach of Bintang Medan FC in Indonesia in 2010-2011. 2012 he went to Wehen Wiesbaden as sporting director. till the end of 2014-15 season. 2016 he was head coach of the German under-15 national football team. With this he was then coach of the Under-16 and then the Under-17 team. In 2019 he became assistance coach for FC Liefering in Austrias 2nd league. After Gerhard Struber left the club he became caretaker coach. In December 2019 he became Technical Director and coach of the reserve team of Selangor F.C. in Malaysia. Since 20 November 2021he is head coach of the team. ==References== Category:1960 births Category:Living people Category:German football managers Category:FC Liefering managers",
 "title": "Michael Feichtenbeiner"
}