{
 "id": "946810",
 "text": "The Indigenous peoples of the Southeastern Woodlands are American Indian tribes with similar cultures in the Southeast United States and northern border of Mexico. It is difficult to create boundaries for this region. This region shared many cultural elements with its neighbors. Neighboring regions include Northeastern Woodlands, Great Plains and a little bit of the Southwest region. The Southeast and Northeast Woodlands combined make the Eastern Woodlands. The region includes coastal area, hilly areas, part of the Appalachian Mountains, savanna grassland and forests. Tribes include the Five Civilized Tribes. They are Chickasaw, Choctaw, Creek, Cherokee, and Seminole. The two large language groups were Caddoan and Muskogean. == History == There are no historical records of early Southeastern Woodlands Native peoples and their stories. Archaeologists study artifacts and remains from these people groups to better understand their history. In the early periods, agriculture led to population growth. Two important cultures in early periods were the Poverty Point Culture and Mississippian Culture. The Poverty Point Culture was in Louisiana during the Archaic period from 2000–1000 BCE. Objects show that they were trading. The Mississippian Culture was from 800 CE to 1500 CE. They grew corn and were mound builders. Many groups were part of the Southeastern Ceremonial Complex. These were religious and trading connections. In the 16th century, the Spanish invaded the Southeastern lands and used the encomienda system. Hernando de Soto traveled the Southeastern Woodlands and attacked settlements. Colonial attacks made tribes weaker. Europeans brought diseases that reduced population sizes. European colonization also led to changes in Southeastern Woodland cultures. Roman Catholic missionaries created missions and tried to convert Natives people In the 17th century. In the 18th century, Natives were involved in international conflicts like the Seven Years' War. In the 19th century, Natives were forced off their lands. Natives had different responses to the Indian Removal Act. In Cherokee Nation v. Georgia case, the Supreme Court decided that the Cherokee had no right to sue. Creeks agreed to move, but a lot of Cherokee were forced to leave. The 20th century included the Natives getting back their rights and sovereignty. == Culture == Southeastern Woodlands people lived in villages. A special building was often in the center of the settlement. This building was either a temple or for ceremonies. Some settlements had large fences around the settlement for defense. Hopewell tradition clans were named after animals.Carr, Christopher and D. Troy Case. Gathering Hopewell: Society, Ritual, and Ritual Interaction. New York: Springer, 2006. ISBN 978-0-306-48479-7, p. 340. The peoples of the Southeastern Woodlands went hunting for wild game and fishing. The main crop was corn. Corn allowed for larger populations. There was also winter squash and climbing beans. These three plants were often grown together. They are called the Three Sisters. Natives also grew other plants and used sunflower to make oil. Work was divided by gender. Men were active in hunting, trade and war. Women did mainly agriculture. There was a lot of interaction with other regions like the Great Plains and Northeastern Woodlands people. Mound building may have come from regions in present-day Mexico. Mound building was common. Southeastern Woodlands natives often traded pottery and shells. These were valuable objects. Chiefs led local settlement groups. These chiefs were often political and religious. There were also separate war leaders. Settlements had social hierarchy. Families were based on matrilineal descent. This meant that things like inheritance of property were based on the mother's side. Exogamy was also common. This was when someone married somebody else outside of the clan. This could create more relations with other clans.Cobb, Daniel M. 2016. Native Peoples of North America. Chantilly, VA: The Great Courses / The Teaching Co. Incest within a clan was not allowed and there were strict rule against it. Native peoples believed in animism. According to this worldview, animals also had souls. Hunting was viewed as sacred. Animals had to be respected. The souls of killed animals could get revenge if they were not respected. Natives also believed that other objects besides plants and animals had spiritual power. There were often medicine people. They were also spiritual leaders.Hudson, Charles M. 1984. Elements of southeastern Indian religion. Leiden: E.J. Brill. Category:Native Americans __FORCETOC__",
 "title": "Indigenous peoples of the Southeastern Woodlands"
}