{
 "id": "946906",
 "text": "The Syrian Arab Armed Forces (SAAF) was the military of Syria formed in 1946 until the ousting of the tyrannical regime of the Al-Assad clique. The SAAF consisted of the Syrian Arab Army, Syrian Arab Air Force, Syrian Arab Navy, Syrian Arab Air Defense Forces and the Paramilitary forces, namely the National Defense Forces. Armed by Russia and Iran * * * * * * * * * * and backed by pro-Russian Western leftists who swayed foreign policies, * * * * * * * * * * the SAAF committed countless atrocities against Syrians, including massacres, starving sieges * * * * * and chemical attacks, * * * * * * * * * * which killed over 400,000 Syrians, in the Syrian civil war (2011–2024) when Assad's tyranny fell under the weight of the large-scale multi-pronged Syrian rebel offensives peaking in the liberation of capital Damascus. * * * * * * * * * * ==History== The SAAF was first formed back in 1920, it was called the French Mandate Volunteer Force. It was considered the \"Special Army of the Levant\". During World War II, they fought against against British and Free French troops but all fights were unsuccessful. There later was a gendarmerie force made to fight off criminals, and political enemies, the force had about 10,000 men and 306 officers with most of the high ranking members being French. ===After World War II=== After the World War II, the SAAF fought against the IDF in the 1948 Arab-Israeli War. Between 1948 and 1967 there were multiple coup d'etats. The first coup was in 1949 led by General Husni al-Za'im, which was successful. With two more coups later that year, in 1954 more coups occurred with a massive officer purge to ensure no more coups. But in 1963 a newer coup happened led by the Ba'ath Party which made Hafez al-Assad the new President of Syria. ===Syrian Civil War=== The SAAF fought against Syrian Protesters in 2011, causing the Syrian Civil War. With about 40 officers defecting and making the \"Free Syrian Army\" that later on turned to the Syrian National Army. With the SAAF fighting in major battles, such as the siege Of Homs, battle of Damascus and battle of Aleppo. ==Conscription in the Syrian Arab Armed Forces== The SAAF is a conscripted force, with a conscription age of 18-42. There are exemptions such as Mental Disabilities, Physical Disabilities, Paying a fee, being an only son. With the Punishments for avoiding service are exiled or jailed. It was first Introduced in May 16th, 2007 with about 18 months of service but no confirmed soldiers were let go. ==Structure== There are 5 branches within the SAAF, based in Damascus with the Forces being made of mainly Sunni Muslims but there are some Alawite, since certain units only accept Alawites, such as the Syrian Republican Guard and 4th Armored Division. ===Syrian Arab Army=== The Syrian Arab Army are the Ground Forces of the SAAF, it is the dominate branch within the SAAF. The SAAF consists of about 3 corps, with 14 Divisions, and more than 40 Brigades. ===Syrian Arab Air Force=== The Syrian Arab Air Force is the Air Branch of the SAAF, the Syrian Arab Air Force consists of 2 Divisions. Made up of 7 Fighter-Bomber brigades, 4 Helicopter Brigades and a single Air Transport Brigade. ===Syrian Navy=== The Syrian Navy is the Naval Branch of the SAAF, with about 4,000 men.The Military Balance 2021 page 366 With about 43 ships, 21 Helicopters and 12 Coastal Defense Systems. ===Syrian Air Defense Force=== The Syrian Air Defense Force is the Anti-Air branch of the SAAF, made up of about 55,000 men. With about 20 Air Defense Brigades and 3 Air Defense Regiments. ===National Defense Forces=== The National Defense Forces is a Pro- Assad militia, with about 50,000-100,000 men.Who are the pro-Assad militias in Syria? Middle East Eye, 25 September 2015 It was formed by the Syrian Government, formed in November 11th, 2012. ==References== Category:Organizations based in Syria",
 "title": "Syrian Armed Forces"
}