{
 "id": "947065",
 "text": "DWDZ-TV (channel 47) is a television station in Metro Manila, Philippines, serving as the flagship of the IBC Plus network. It is owned and operated by Intercontinental Broadcasting Corporation alongside IBC flagship DZTV-TV (channel 13). Both stations share and maintains studios at the IBC Compound, Lot 3-B, Capitol Hills Drive cor. Zuzuarregui Street, Brgy. Matandang Balara, Diliman, Quezon City, DWDZ-TV's hybrid analog and digital transmitting facilities are located at the IBC Central Tower, 125 St. Peter Street, Nuestra Señora Dela Paz Subdivision, Santa Cruz, Antipolo, Rizal (shared with DZTV-TV, as well as DMZ flagship DZMZ 89.1 MHz). ==History== ===As a carrier of VHF 5 Manila=== In 1999, ABC was awarded the channel 47 frequency in Metro Manila, the last remaining UHF frequency in the market, christening it DWDZ-TV. However, has been inactive since 2003. ===Revival, as IBC Plus TV-47 Manila=== On 2024, after 19 years of inactivity and silence, UHF 47 Manila will be back on air and acquired by Intercontinental Broadcasting Corporation as IBC Plus TV-47 Manila ==Digital television== ===Digital channels=== DZTV-DTV's digital signal operates on UHF channel 15 (491.143 MHz) and broadcasts on the following subchannels: Channel Video Aspect PSIP Short Name Programming Note 13.01 1080i 16:9 IBC HD IBC (Main DZTV-TV programming) Commercial broadcast 13.02 1080i 16:9 IBC PLUS HD IBC Plus Commercial broadcast 13.03 1080i 16:9 IBCLASSICS IBC Classics Commercial broadcast 13.04 1080i 16:9 IBCINEMA IBCinema Commercial broadcast 13.05 1080i 16:9 IBC KIDS IBC Kids Commercial broadcast 13.06 1080i 16:9 DZTV TELETRESE DZTV TeleTrese Commercial broadcast 13.07 1080i 16:9 DMZ CHANNEL DMZ Channel Commercial broadcast 13.08 480i 16:9 IBC SD IBC Commercial broadcast Notes: *IBC Classics, IBCinema, IBC Kids, DZTV TeleTrese and DMZ Channel are the digital channels to IBC Digibox, a digital set-top box marketed by the network. NTC released implementing rules and regulations on the re–allocation of the UHF Channels 14–20 (470–512 Megahertz (MHz) band) for digital terrestrial television broadcasting (DTTB) service. All operating and duly authorized Mega Manila VHF (very high frequency) television networks are entitled to a channel assignment from Channels 14 to 20.Rules out on re-allocation of digital TV frequency band | work=The Philippine Star | date=February 23, 2018 | access-date=July 19, 2021 | author=Louella Desiderio On March 18, 2022, IBC began to transmit its digital test broadcast on UHF Channel 15 (491.143 MHz) as its permanent frequency assigned by NTC. On April 1, 2022, the DTT broadcast transmission of IBC is no longer available on UHF Channel 26, but only it can watch digital television broadcast of IBC on UHF Channel 15. ==References== Category:Filipino television stations",
 "title": "DWDZ-TV"
}