{
 "id": "947033",
 "text": "The Raut Cabinet is the Council of Ministers headed by Mohammad Lalbabu Raut in Madhesh Province, Nepal. Raut was sworn in the Chief Ministers of Madhesh Province in February 2018. The arrangement of the cabinet is the result of talks between two Former Deputy Prime Ministers, People's Socialist Party, Nepal President Upendra Yadav and Nepali Congress Vice-president Bimalendra Nidhi. They have strong hold in this region from their parties. == Current arrangement == This is a list of ministers since 9 June 2021 since when PSP-N and Nepali Congress are two major parties in government. S.N. Portfolio Holder Portrait Constituency Party Took office Cabinet ministers 1 Chief Minister Minister for Commerce, Supplies and Science Technology Mohammad Lalbabu Raut Parsa 1(B) People's Socialist Party, Nepal 14 February 2018 2 Deputy Chief Minister Minister for Physical Infrastructure Development Ram Saroj Yadav Dhanusha 3 (A) Nepali Congress 9 June 2021 3 Minister for Industry, Forest and Environment Satrudhan Mahato Dhanusha 4(B) CPN (Unified Socialist) 20 November 2021 4 Minister for Economic Affairs and Planning Shailendra Prasad Sah Saptari 2(A) People's Socialist Party, Nepal 1 March 2018 5 Minister for Internal Affairs and Communication Bharat Prasad Sah Mahottari 1(B) Communist Party of Nepal (Maoist Centre) 17 July 2021 6 Minister for Energy and Drinking Water Om Prakash Sharma Nepali Congress 9 June 2021 7 Minister for Land Management, Agriculture and Co-operatives Bijay Kumar Yadav Siraha 2 (A) People's Socialist Party, Nepal 15 February 2018 8 Minister for Women, Children, Youth and Sports Birendra Prasad Singh Sarlahi 4(A) Nepali Congress 9 June 2021 9 Minister for Social Development Nawal Kishor Sah Sudi Saptari 1(B) People's Socialist Party, Nepal 1 March 2018 10 Minister for Law, Justice and Provincial Assembly Affairs Pramod Kumar Yadav Siraha 3(B) CPN (Unified Socialist) 20 November 2021 State ministers 1 Minister of State for Industry, Tourism and Forest Nagendra Raya Yadav Rautahat 3(A) CPN (Unified Socialist) 6 February 2021 2 State Minister for Economic Affairs and Planning Usha Yadav People's Socialist Party, Nepal 1 March 2018 3 State Minister for Internal Affairs and Law Rubi Karn Communist Party of Nepal (Maoist Centre) 1 March 2018 4 State Minister for Land Management, Agriculture and Co-operatives Yogendra Ray Yadav Rautahat 1(B) People's Socialist Party, Nepal 1 March 2018 == Ministers by Party == ===Since 2021=== Party Cabinet Ministers Ministers of State Total Ministers People's Socialist Party, Nepal 4 2 6 Nepali Congress 3 0 3 CPN (Unified Socialist) 2 0 2 CPN (Maoist Centre) 1 1 2 == Previous arrangements == ===Chief Minister & Cabinet Ministers=== S.No. Name Constituency ( if blank) Portfolio Took office Left office Political Party 1\\. Mohammad Lalbabu Raut Parsa 1(B) Chief Minister Minister of Law, Justice and State Assembly Minister of Commerce, Supplies, Science and Technology 15 February 2018 People's Socialist Party, Nepal 2\\. Jitendra Prasad Sonal Bara 4(B) Minister of Physical Infrastructure Development 15 February 2018 6 June 2021(expelled) People's Socialist Party, Nepal 3\\. Bijay Kumar Yadav Siraha 2(A) Minister of Finance 15 February 2018 People's Socialist Party, Nepal 4\\. Gyanendra Kumar Yadav Dhanusha 4(A) Minister for Internal Affairs and Law 1 March 2018 17 July 2021 (Resigned) People's Socialist Party, Nepal 5\\. Shailendra Prasad Shah Saptari 2(A) Minister of Land Management, Agriculture and Cooperatives 1 March 2018 People's Socialist Party, Nepal 6\\. Nawal Kishore Shah Sudi Saptari 1(B) Minister of Social Development 1 March 2018 People's Socialist Party, Nepal 7\\. Ram Naresh Rae Minister of Industry, Tourism and Forest 1 March 2018 16 November 2021 (expelled) People's Socialist Party, Nepal == Related pages == *Lalbabu Raut * Mahendra Narayan Nidhi Awas Yojana * Krishna Chandra Nepali cabinet * Kul Prasad KC cabinet * Jeevan Bahadur Shahi cabinet * Trilochan Bhatta cabinet == Jhapa == === 2022 Mechinagar municipality election === Municipal election for Mechinagar took place on 13 May 2022, with all 75 positions up for election across 15 wards. The electorate elected a mayor, a deputy mayor, 19 ward chairs and 60 ward members. An indirect election will also be held to elect five female members and an additional three female members from the Dalit and minority community to the municipal executive. ==== 2022 Bhadrapur municipality election ==== Municipal election for Bhadrapur took place on 13 May 2022, with all 50 positions up for election across 10 wards. The electorate elected a mayor, a deputy mayor, 10 ward chairs and 40 ward members. An indirect election will also be held to elect five female members and an additional three female members from the Dalit and minority community to the municipal executive. === Jhapa 3 === ==== Jhapa 3 (A) ==== ==== Jhapa 3 (B) ==== ==References== Category:Nepalese politicians",
 "title": "Lalbabu Raut cabinet"
}