{
 "id": "947291",
 "text": "Abenaki (also spelled as Abnaki or Wabanaki) are Native American people group from the Northeast Woodlands. The group is part of the Algonquian language group. The group was also a member of the Wabanaki Confederacy. The people are broken into two language groups. They are the Eastern and Western Abenaki Language group. The eastern language was in New Brunswick and Maine. The western language was in Vermont, New Hampshire, Massachusetts and southern Quebec. The name Abenaki means \"People of the Dawn Land\" in the Abenaki language.\"Abenaki\". U*X*L Encyclopedia of Native American Tribes. 2008. Archived from the original on June 11, 2014. Retrieved August 14, 2012 – via HighBeam Research. Today the US government recognizes several tribes connected to the Abenaki. == History == Large confederacies like the Iroquois wanted to take over Abenaki land. Agriculture helped the Abenaki to become more powerful and resist such attacks.Muir, Diana, Reflections in Bullough's Pond, University Press of New England. The Abenaki had contact with French and English colonists in the 17th century. They got involved in the fur trade and often allied with the French. Soon they had to move out of their lands to Quebec. This was because there was tension with Colonists. There was also disease that made the Abenaki population smaller. The Abenaki lost several wars and had to move to Quebec in Canada.Spencer C. Tucker; et al., eds. (2011). The Encyclopedia of North American Indian Wars, 1607–1890: A Political, Social, and Military History. ABC-CLIO. p. 249. ISBN 978-1-85109-697-8Kenneth Morrison, The Embattled Northeast: the Elusive Ideal of Alliance in Abenaki-Euramerican Relations (1984) == Culture == The Abenaki were made of small groups of people. Small family groups were led by a chief. The chief helped the group make decisions that the majority could accept. There was also a chief for war. The groups also tried to develop relations with other groups and tribes. Groups usually met in the spring and summer. In the society, descendants were based on the father's side (partrilineal). Telling stories was part of the culture. People told stories from one generation to the next. Storytelling was also a way to teach children how to act. The people had different types of foods and goods. Tribe members went fishing and hunting. They also grew special plants and collected wild plants for food. The Three Sisters squash, corn and beans were also eaten. They often used plants for medical problems. Most Abenaki lived in wigwams. These were dome-shaped homes. They also used canoes for travel. The Abenaki had a particular mythology. They beloved in several gods. Gici Niwaskw was the highest god. This god created the world and brought sound and color. The god also had the title of Niwaskowôgan. This means the Great Spirit. According to the myth, there were three ages after creation. The ages are different based on how humans and animals relate to each other. ==References== Category:Ethnic groups in the United States Category:First Nations Category:Geography of Maine Category:Geography of New Hampshire Category:Geography of Quebec Category:Geography of Vermont Category:Native Americans Category:People from Maine Category:People from New Brunswick Category:People from Vermont",
 "title": "Abenaki"
}