{
 "id": "947243",
 "text": "Djado is a ghost town in Bilma in Niger. The settlement lies on the Djado Plateau. The settlement likely wasn't called Djado. The site is in a location that is quite remote, and no excavation has been done, so the real name of the settlement is unknown. == Geography == The former Djado is located in an oasis, in the northeastern part of Ténéré desert. Ténéré desert is considered part of the Sahara. It is located on the southeastern end of the Djado plateau. There's also a modern-day commune called Djado (with no inhabitants). The modern-day commune also comprises the Menfueni plateau and the Thchigai plateau. Modern-day Djado is the northernmost and easternost commune in Niger. To the north, it borders Algeria and Libya, to the east, it lies on the border to Tchad. Neighboing communes in Niger are Dirkou to the south, Fachi to the southeast, and Iférouane to the west. There are three villages in the commune: Chirfa, Séguédine and Yaba. In addition, there are the nomad camps of Djado and Tchounouk, as well as military camps. The main settlement is the village Chirfa. The ruins of Djado are on top of rocky cliffs. At the bottom of these cliffs are subterranean ponds, which also serve as an ideal breedng ground for mosquitoes. Dpeending on the season, some of these ponds almost dry up completely. From the cliffs, the Kaouar valley can be reached. There's a desert made of pebbles, to the west, beyond lie the Aïr mountains. == History == According to the tradition of the local Kanuri , the Sao founded Djado. They also founded other places, such as Tedjerhe in southern Fessan. Tedjerje is the oldest known setltement in of the Kaouar. It was the most important city culture of the Kotoko south of Lake Tchad. The ruins lookslike those of a city. Their modern-day name links them to Djado in Nafusa Mountains, southwest of Tripolis. These two characteristics seem to point to a people that was sessile, but the current population of the region is mostly nomadic. The people who inhabited Djado had these points in common with Berber people. Djado was part of the kingom of Sayfema of Kanem-Bornu at least since the reign of Dunama Dibalemi (1203–1243). Fr part of the time, they were independent, but they re-joined the empire of Idris Alauma (1564–1596). Idris Alauma moved through the desert, from Fachi to Bilma , south of Djado. As the power of the Bomu empire decreased, the people of the oasis were exposed to several raids of the Touareg, in the 18th and 19th century. They started to leave the place, and settled in Kaouar. Another reason might be that cattle herding in the region also introduced mosquitoes that spread malaria. In 1860, about 1000 Kanuri are said to have been left. In the middle of the 20th century, only a few Kanuri and Toubou were left. They mostly lived form gerowing dates, and harvesting salt. The military outpost Madama was created in 1930, when Niger was a French colony. In 1988. Rallye Sakar passed through Djado. In 2014, gold was discovered, which attracted up to 20.000 people from Niger, Chad, Libya and Sudan. Because there were many heavily-armed foreigers, and working conditions were very bad, Moussa Hassane Barazé, the responsible minister for mining operations, ordered the mines to be closed in 2017. == Population == At the count of 2012, 876 people lived in the commune, in 168 households. In 2001, the count had been 936 people in 202 households. Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) ImageSize = width:500 height:auto barincrement:42 PlotArea = left:40 bottom:20 top:5 right:20 DateFormat = x.y Period = from:0 till:1000 TimeAxis = orientation:horizontal AlignBars = late ScaleMajor = gridcolor:darkgrey increment:100 start:0 ScaleMinor = gridcolor:lightgrey increment:20 start:0 BackgroundColors = canvas:sfondo PlotData= color:skyblue width:16 shift:(-100,-5) fontsize:M anchor:till bar:2001 from:0 till:936 text:936 Einwohner bar:2012 from:0 till:876 text:876 Einwohner In the main village, there were 2088 people in 63 households, at the 2012 count; In 2001, 208 people in 45 households, and in 1998, 260 people in 74 households. When it comes to harvesting, there are Tubu the area near the ghost town. In the eastern part of the commune, the language Tedaga , as well as Lybian Arabic are spoken. On the Algerian border, Tahaggart, a Tuareg language, is common. == Books == * * * * * * * * * * * * * * Plateau et Fortin du Djado auf der Website des Welterbezentrums der UNESCO zu Tentativlisten (französisch). == References == Category:Ghost towns Category:Towns in Africa Category:Settlements in Niger",
 "title": "Djado"
}