{
 "id": "947451",
 "text": "The Koshi Provincial Assembly also known as the Koshi Pradesh Sabha, (Nepali: कोशी प्रदेश सभा) is the unicameral legislature of Koshi Province, one of the seven provinces in Nepal. The assembly is seated at the provincial capital at Biratnagar in Morang District at the District Coordination Committee Office. The assembly has 93 members of whom 56 are elected through first-past-the-post voting and 37 are elected through proportional representation. The term of the assembly is 5 years unless dissolved earlier. == History == The Provincial Assembly of Province No. 1 (now Koshi Province) is formed under Article 175 of the Constitution of Nepal 2015 which guarantees a provincial legislative for each province in the country. The first provincial elections were conducted for all seven provinces in Nepal and the elections in Province No. 1 was conducted for 93 seats to the assembly. The election resulted in a victory for the CPN (Unified Marxist–Leninist) and CPN (Maoist Centre) alliance which later went on to form a coalition government under Sher Dhan Rai from CPN (UML). The first meeting of the provincial assembly was held on 5 February 2018. Pradeep Kumar Bhandari from CPN (UML) was elected as the first speaker of the provincial assembly, and Saraswoti Pokharel from Maoist Centre as the first deputy speaker of the provincial assembly. == List of assemblies == Election Year Assembly Start of term End of term Speaker Chief Minister Party 2017 1st Assembly 5 February 2018 2022 Pradeep Kumar Bhandari Sher Dhan Rai (Cabinet) CPN (UML) Bhim Acharya (Cabinet) Rajendra Kumar Rai (Cabinet) CPN (Unified Socialist) 2022 2nd Assembly 1 January 2023 Incumbent Baburam Gautam Hikmat Kumar Karki (Cabinet) CPN (UML) == Committees == Article 195 of the Constitution of Nepal provides provincial assemblies the power to form special committees in order to manage working procedures. S.No. Committee 1 Justice, Administration and Legislation 2 Good Governance and Planning 3 Finance 4 Public Accounts 5 Social Development 6 Industry, Tourism and Environment 7 Natural Resources and Infrastructure Development == Current composition == Party Parliamentary party leader Seats CPN (UML) Hikmat Kumar Karki 40 Nepali Congress Uddhav Thapa 29 CPN (Maoist Centre) Indra Bahadur Angbo 13 Rastriya Prajatantra Party Bhakti Prasad Sitaula 6 CPN (Unified Socialist) Rajendra Kumar Rai 4 People's Socialist Party Nirmala Limbu 1 Total 93 == Related pages == * Koshi Province ==References== Category:Government of Koshi Province Category:Unicameral legislatures",
 "title": "Koshi Provincial Assembly"
}