{
 "id": "947492",
 "text": "An unintended pregnancy is when women get pregnant, but did not plan to. Such pregnancies happen because of bad timing, or they are unwanted at the time of conception. When people have sex, but do not use contraception, a pregnancy can result. Worldwide, almost half the pregnancies, about 45% of them, are unintended pregnancies. The exact figure varies by geographic region, by level of education, and other socioeconomic factors. Unintended pregnancies may be unwanted pregnancies or mistimed ones. An unintended pregancy is one of the main reasons, why a woman chooses to have an abortion. Depending on the circumstances, a miscarriage can occur. Unintended pregnancies may be unwanted pregnancies or mistimed pregnancies. While unintended pregnancies are the main reason for induced abortions, Unintended pregnancies may also have other outcomes, such as live births or miscarriages. == Factors == Factors that have an influence are: * Younger age: People who are younger do not use contraception as often as older ones; they may also use it incorrectlly * Relationship status: People who live with a partner, but without being married (this is called cohabitation) have a higher rist of an unintended pregnancy * Lower income: In many places in the world, using contraception is expensive. Poorer people might not be able to afford using it. * Lower level of education: People with a lower level of eductation have a higher risk for an unintended pregnancy. In the United States, women without a high school degree had the highest unintended pregnancy rate among any educational level in 2011, at 73 per 1,000 (45% of all pregnancies in this group). Unintended pregnancy rates decreased with each level of education. * Non-consensual intercourse: Sometimes, women get raped, or they are forced to become or stay pregnant against their will. This often happens i a context of domestic violence. Unintended pregnacies also have other problems: Very often, the woman does not seek help with childbirth. It is common that a women get medical attention and counceling during pregnancy, and before the child is born. People who have an unintended pregnancy often do not seek this help. == Public health implications == In the United States in 2011, 42% of all unintended pregnancies ended in abortion, and 58% ended in birth (not including miscarriages). Regardless of the outcome of the pregnancy, unintended pregnancies have significant negative impacts on individual and public health. === Unintended births === Pregnancy, whether intended or unintended, has risks and potential complications. On average, unintended pregnancies that are carried to term result in poorer outcomes for the pregnant woman and for the child than do intended pregnancies. == Related pages == * Pregnancy test * Obstetric ultrasonography * Liquids (chemistry) ==References== Category:Pregnancy and childbirth Category:Contraception",
 "title": "Unintended pregnancy"
}