{
 "id": "947541",
 "text": "The Cahokia Mounds State Historic Site is a historic site of a pre-Columbian city of the Native American Cahokia people. The park has 2,200 acres (900 ha) and 80 mounds made by the Cahokia people. The city was much larger than the area of the mounds. The city of Cahokia was one of the largest in the Mississippian culture. It existed from 1050 to 1350 CE. Cahokia Mounds is a National Historic Landmark and is a UNESCO World Heritage Site. It is one of 24 UNESCO sites in the United States. Cahokia was the largest city of the Mississippian culture. The Mississippian culture was found in what is now the Central and the Southeastern United States. The Mississippian culture began more than 1,000 years before European contact. The Mississippians were the people groups found in this area before the Native American tribes that the Europeans met beginning in the 1500s. Today, Cahokia is considered to be the largest and most complex city of its time north of the great cities in Mexico. Cahokia is very near present day St. Louis, Missouri. It is located on the east side of the Mississipi River in Illinois. The inhabitants of Cahokia left no written records beyond symbols on pottery, shell, copper, wood, and stone The elaborately planned community, woodhenge, mounds, and burials reveal a complex society. The city's original name is unknown. The mounds were later named after the Cahokia tribe found living in the area by the first French explorers. The Cahokia tribe that the French found were a different native group than the Mississippians. Cahokia had about 1,000 people before circa 1050, its population grew rapidly after that date. According to a 2007 study \"Between AD 1050 and 1100, Cahokia's population increased from between 1,400 and 2,800 people to between 10,200 and 15,300 people\". Archaeologists estimate the city's population at between 6,000 and 40,000 at its highest. The population of Cahokia began to decline during the 13th century, and the site was abandoned by around 1350. Scholars have several ideas why. Every large city has to deal with problems regarding food supply and waste disposal. Perhaps is was overhunting, deforestation and pollution, and climatic changes, such as increased flooding and droughts. It could have been a combination of these reasons. The largest remaining feature of Cahokia is Monk's Mound. Monks Mound is a massive platform mound with four terraces, 10 stories tall, it is the largest man-made earthen mound north of Mexico. It is 100 ft (30 m) high, 951 ft (290 m) long, 836 ft (255 m) wide and covers 13.8 acres (5.6 ha). It contains about 814,000 cubic yards (622,000 m3) of earth. All of that earth was moved by human power. A 1 bushel basket holds 1.25 cubic feet or 35 liters. If one person could carry a basketful of dirt holding 1.25 cubic feet, then Monk's Mound represents 17,650,863 baskets full of dirt. For comparison, the Great Pyramid of Giza, is a square 230.3m at the base,146.6m tall, and contains 2,583,283m3 of material. Another large feature at today's Cahokia is Woodhenge. The Cahokia Woodhenge was a large circle of timber posts located roughly 850 m (2,790 ft) to the west of Monks Mound. Excavations found the original placements of many large timber posts. In 1985, a reconstruction of Woodhenge was built with the posts being placed into the original excavated post positions. The circle, which has 48 posts in the circle and a 49th central post, has been used to investigate ancient astronomy at Cahokia. ==References== Category:Native Americans Category:World Heritage Sites in the United States Category:National Historic Landmarks of the United States",
 "title": "Cahokia"
}