{
 "id": "947606",
 "text": "Katheryn Winnick (born December 17, 1977) is a Canadian actress. She is known for her roles in the television series Vikings (2013–2020), Wu Assassins (2019), and Big Sky (2020–present), and her recurring role on the television series Bones (2010–2011). == Education == Winnick was born in Etobicoke, Ontario. She has Ukrainian descent. She spoke Ukrainian as her first language. She began speaking English when she was 8 years old. She began training in martial arts at age 7. She had her first black belt at 13 years old. By age 21, she opened three Taekwondo schools. She taught Taekwondo and self-defense to actors while completing her degree in kinesiology at York University, Toronto. Winnick studied at William Esper Studio. == Early career == Winnick started acting as a young girl at her community center in Toronto. She had directed plays in her high school and won a scholarship for drama and directing while attending Richview Collegiate Institute. ==Career== Winnick entered the movie industry by teaching martial arts to actors on movie sets; the experience inspired her to act professionally. She was then cast on the television series Student Bodies. Since then, she has appeared in many movies, including: *Stand Up Guys *Failure to Launch *Love & Other Drugs *Killers She has guest-starred in many television shows, such as: *House *Bones *Law & Order *Law & Order: Criminal Intent *CSI *CSI: NY *CSI: Miami *Criminal Minds *Person of Interest *Nikita Winnick joined History Channel's television series Vikings. She starred in the role of Lagertha, a legendary figure in Viking history. In July 2017, Winnick stated on Twitter that she had been cast in a mystery role, and that it would be announced at the San Diego Comic-Con International. She was later revealed to be cast as a main character in the Nazi Zombies mode of the video game Call of Duty: WWII.\"'Vikings' Star Katheryn Winnick Joins 'Call of Duty: WWII' Voice Cast\" – Variety, July 17, 2017 In July 2018, Winnick had been cast in the starring role of Christine \"C.G.\" Gavin on the Netflix series, Wu Assassins. In February 2020, Winnick was announced to play the starring role of Jenny Hoyt on the ABC television series Big Sky. ==Personal life== Winnick says she is an American citizen as well as Canadian. ==Filmography== ===Movies=== Year Title Role Notes 2001 Biohazardous Jennifer 2002 Smoking Herb Marcia 2002 The It Factor Herself 2002 Fabled Liz 2002 Two Weeks Notice Tiffany 2003 What Alice Found Julie 2004 50 First Dates Young Woman 2004 Satan's Little Helper Jenna Whooly 2004 Going the Distance Trish 2004 Our Time Is Up Waif Short film 2005 Hellraiser: Hellworld Chelsea 2006 Cloud 9 Olga 2006 Kiss Me Again Chalice 2006 Failure to Launch Melissa 2007 When Nietzsche Wept Lou Andreas-Salomé 2008 Amusement Tabitha 2009 Cold Souls Sveta 2010 Tranced Cleo 2010 Radio Free Albemuth Rachel Brady 2010 Choose Fiona Wagner 2010 Killers Vivian 2010 Love & Other Drugs Lisa 2011 Bat $#*! Crazy Girlfriend 2012 Stand Up Guys Oxana 2012 A Glimpse Inside the Mind of Charles Swan III Ivana 2013 The Art of the Steal Lola 2017 The Dark Tower Laurie Chambers 2018 Speed Kills Emily Gowen 2019 Polar Vivian 2020 Wander Elsa Viceroy 2021 The Marksman Sarah Pennington 2021 Flag Day Patty Vogel ===Television=== Year Title Role Notes 1999 PSI Factor: Chronicles of the Paranormal Suzie Episode: \"Sacrifices\" 1999 Student Bodies Holly Benson Recurring role, 5 episodes 2000 Relic Hunter Roselyn Episode: \"Nine Lives\" 2001 Screech Owls Brianna Styles Episode: \"Face Off\" 2002 Tracker Laura 2 episodes 2002 Law & Order: Criminal Intent Karyn Bennett Episode: \"Seizure\" 2003 Oz Liesel Robson Episode: \"4giveness\" 2003 Wild Card Kendall Episode: \"Hell Week\" 2003 10-8: Officers on Duty Lucy Johnson Episode: \"Lucy in the Sky\" 2004 CSI: Miami Nicole Harjo Episode: \"Rap Sheet\" 2004 1-800-Missing Julie Snyder Episode: \"In the Midnight Hour\" 2005 CSI: NY Lisa Kay Episode: \"Corporate Warriors\" 2005 Trump Unauthorized Ivana Trump Television film 2006 Criminal Minds Maggie Lowe Episode: \"Somebody’s Watching\" 2006 13 Graves Amy Television film 2007 House Eve Episode: \"One Day, One Room\" 2007 Tipping Point Nina Patterson Television film 2007 Law Dogs Lisa Bennett Television film 2008 Law & Order Sarah Shipley Episode: \"Excalibur\" 2008 Law & Order: Criminal Intent Carrie Conlon Episode: \"Faithfully\" 2009 CSI: Crime Scene Investigation Maureen Martin Episode: \"One to Go\" 2010 The Gates Kat Russo Episode: \"Identity Crisis\" 2010–2011 Bones Hannah Burley Recurring role, 11 episodes 2011 The Glades Valerie Dorman Episode: \"Lost and Found\" 2011 Nikita Kelly Episode: \"Partners\" 2012 Transporter: The Series Darcy Daniels Episode: \"Hot Ice\" 2013–2020 Vikings Lagertha Main role 2015 Person of Interest Frankie Wells Episode: \"Skip\" 2019 Wu Assassins Christine \"C.G.\" Gavin Main role 2020–2023 Big Sky Jenny Hoyt Main role ===Video games=== * Call of Duty: WWII (2017), as Marie Fischer ===As director=== * Wu Assassins (2019), episode: \"Legacy\" * Vikings (2020), episode: \"Valhalla Can Wait\" ==Awards and nominations== Year Award Category Work Result Refs. 2012 Beverly Hills Film Festival Best Actress Children of the Air 2014 Canadian Screen Award Best Performance by an Actress in a Continuing Leading Dramatic Role Vikings 2014 Women's Image Network Awards Best Actress in a Drama Series Vikings 2015 Critics' Choice Television Award Best Supporting Actress in a Drama Series Vikings 2015 Golden Maple Awards Best Actress in a TV series broadcast in the U.S. Vikings 2015 Women's Image Network Awards Best Actress in a Drama Series Vikings 2016 Women's Image Network Awards Best Actress in a Drama Series Vikings ==References== ==Other websites== * * The Winnick Foundation Katheryn Winnick's organization Category:1977 births Category:Living people Category:American movie actors Category:American television actors Category:York University alumni",
 "title": "Katheryn Winnick"
}