{
 "id": "947726",
 "text": "Esther Bekkers-Lopes Cardozo (5 December 1880 - 16 April 1943) was a Dutch fencer. She was also a pianist. She was a fencer at the salle of Giovanni Giandomenici and one of the earliest female Dutch fencers. She was international successful. Because she was a Jew, she was deported to Sobibor extermination camp during World War II where she died. ==Fencing career== Bekkers-Lopes Cardozo is claimed by Giovanni Giandomenici as being the first female Dutch fencer. Bekkers-Lopes Cardozo was trained by Giovanni Giandomenici. In the summer of 1913 she had a good results at the 1913 International Exposition in Ghent. She finished in fifth place of the 40 competing fencers. She was eliminated by C. E. Martin Edmunds. On 29 November 1913 she competed by invitation at the 1913 Alfred Hutton Memorial Challenge Cup, an international tournament organized by the “Ladies London Fencing Club” in London. She was one of the four Dutch women. Bekkers-Lopes Cardozo was successful winning the \"strangers cup\" being the best foreigner. In 1914, Bekkers-Lopes Cardozo won the second prize at the 1914 Salle Giandomenici international women's fencing competition, the first Dutch international fencing tournament in Amsterdam. Of the eight matches she only lost to the British champion C. E. Martin Edmunds who won the tournament. Later the year she won the first prize at the international 1914 \"La Femme Contemporaine\" women's fencing competition in Antwerp. In 1918 she finishind first in the national women's competition in Amsterdam. She won the 1919 Netherlands women's fencing championship, the first official women's national championship. In 1920 she couldn’t compete at the natioal championship because she was ill, but was a prize winner at the 1920 Salle Giandomenici international women's fencing competition behind the Danish Larsen and French champion Chevalier. In 1921 she won the third prize at the international “Grand Prix de Dames” in Oostende. ===Fencing style=== She fenced left-handed, which was difficult for her opponents. She fenced with quick movements. According to newspaper Het nieuws van den dag in 1914, Bekkers-Lopes Cardozo had a different technique compared with the female fencers from the school of De Vos, The Hague. Her style was described as “more lively, more fiery and less different from the men's technique”. ==Personal life and death== Esther Lopes Cardozo was born in Amsterdam on 5 December 1880 as the daughter of diamond worker Samuel “Abraham” Lopes Cardozo (1860-1913) and Saartje Lopes Cardozo-Polak (1861-1943).Saartje Knoop-Pollak, joodsmonument.nl She had a sister Rosalina Hendrix-Lopes Cardozo. She would live her entire life in Amsterdam. Lopes Cardozo married to A. Bekkers. They had together a son, who was born on 21 December 1902. She also had another child. Bekkers-Lopes Cardozo played piano with the singing society “De Stem des Volks”. Bekkers- Lopes Cardozo was a Jew. During World War II she was deported to Sobibor extermination camp in Poland where she died on 16 April 1943. ==References== ==Other websites== *Image with the “Alfred Hutton Memorial Challenge Cup” she won in London in 1913 *Image participants international tournament Amsterdam in 1914 *Image 1917 tournament in The Hague Category:1880 births Category:1943 deaths Category:Dutch musicians Category:Dutch fencers Category:Holocaust victims",
 "title": "Esther Bekkers-Lopes Cardozo"
}