{
 "id": "948069",
 "text": "Indian Railways (IR) is a body under the ownership of Ministry of Railways, Government of India. It operates India's national railway system. It manages the fourth largest national railway system in the world by size. It has a total route length of . 83% (Length: ) of all the broad-gauge routes are electrified with 25 kV 50 Hz AC electric traction . In the freight segment, IR runs 9,475 trains daily. The average speed of freight trains is around . The maximum speed of freight trains varies from depending on their axle load. , Indian Railways' rolling stock consisted of 2,93,077 freight wagons, 76,608 passenger coaches and 12,729 locomotives. IR owns locomotive and coach- production facilities at different locations in India. It had 1.254 million employees . It makes the world's eighth-largest employer. The government has committed to electrifying India's entire rail network by 2023–24. IR also committed to become a \"net zero (carbon emissions) railway\" by 2030. == History == The first railway proposals for India were made in Madras in 1832. The country's first transport train, Red Hill Railway (built by Arthur Cotton to transport granite for road-building), ran from Red Hills to the Chintadripet bridge in Madras in 1836-1837. India's first passenger train, operated by the Great Indian Peninsula Railway and hauled by three steam locomotives (Sahib, Sindh and Sultan), ran for with 400 people in 14 carriages on broad gauge track between Bori Bunder (Mumbai) and Thane on 16 April 1853. On 24 February 1873, a tram opened in Calcutta between Sealdah and Armenian Ghat Street. On 9 May 1874, a horse-drawn tramway began operation in Bombay between Colaba and Parel. In 1986, computerized ticketing and reservations were introduced in New Delhi. In 1988, the Shatabdi Express was introduced between New Delhi and Jhansi; it was later extended to Bhopal. Two years later, the first self-printing ticket machine (SPTM) was introduced in New Delhi. In 1993, air-conditioned three-tier coaches and a sleeper class (separate from second class) were introduced on IR. The CONCERT system of computerized reservations was deployed in New Delhi, Mumbai and Chennai in September 1996. In 1998, coupon validating machines (CVMs) were introduced at Mumbai Chhatrapati Shivaji Maharaj Terminus. The nationwide concierge system began operation on 18 April 1999. In February 2000, the Indian Railways website went online. The story of Indian Railways began over a century and a half ago during British colonial rule. The first train journey in India took place in 1853, covering a distance of 34 km from Bombay (now Mumbai) to Thane. Since then, the Indian Railways has come a long way, evolving into one of the world's largest railway networks. == Organisation == Indian Railways is headed by a Four-member Railway Board. The chairman of the board reports to the Ministry of Railways. The Railway Board also acts as the Ministry of Railways. The officers working in the office of Railway Board are mostly from organised Group A Railway Services and Railway Board Secretariat Service. IR is divided into 18 zones, headed by general railway managers or GRM. GRMs report to the Railway Board. The zones are further subdivided into 71 operating divisions, headed by divisional railway managers (DRM). The divisional officers of the various categories - engineering, mechanical, electrical, signal and telecommunication, stores, accounts, personnel, operating, commercial, security and safety branches - report to their respective DRMs. They are tasked with the operation and maintenance of assets. Station masters control individual stations and train movements within their stations' territory. In addition, there are a number of production units, training establishments, public sector enterprises and other offices working under the control of the Railway Board. == Rolling Stock == The Indian Railways has many trains and locomotives. Only a few trains will be mentioned below. Along with that, information will also be given. === Vande Bharat Express === The Vande Bharat Express is the fastest train in India. It goes at a maximum speed of 160 km/h but it goes at an average of only 83 km/h. It is not operated for long distances, only for medium distances. It connects cities less than 800 km(500 mi) apart. This train is currently used in 66 lines around India. === Duronto Express === The Duronto Express (meaning restless) is a long distance train. It was first launched in 2009. It is currently used in 24 lines across India. The maximum speed of the Duronto Express is 130 km/h but only goes at an average speed of 60 - 82 km/h. === Tejas Express === The Tejas Express is a semi high speed train. It is a modern train including automatic doors. It is only used on 4 lines across India. It reaches a maximum speed of 130 km/h but it has reached a speed of 200 km/h during testing. == References == == Further reading == * Aguiar, Marian. Tracking Modernity: India's Railway and the Culture of Mobility (University of Minnesota Press; 2011) 226 pages; draws on literature, film, and other realms to explore the role of the railway in the Indian imagination. excerpt and text search * Bear, Linda. Lines of the Nation: Indian Railway Workers, Bureaucracy, and the Intimate Historical Self (2007) excerpt and text search * Hurd, John, and Ian J. Kerr. India’s Railway History: A Research Handbook (Brill: 2012), 338pp * Kerr, Ian J. Railways in Modern India (2001) excerpt and text search * Kerr, Ian J. Engines of Change: The Railroads That Made India (2006) * Kumar, Sudhir, and Shagun Mehrotra. Bankruptcy to Billions: How the Indian Railways Transformed Itself (2009) * Macpherson, W. J. \"Investment in Indian Railways, 1845-1875.\" Economic History Review, 8#2, 1955, pp. 177–186 online * * ==References== == Other websites == * Official Website * eTicket Reservation * Glossary Category:Rail transport in India Category:Organizations based in India",
 "title": "Indian Railways"
}