{
 "id": "948147",
 "text": "A slam-door train are diesel multiple units (DMUs) or electric multiple units (EMUs) that have doors that can be opened and closed by passengers, these trains were made before automatic door trains were made. They're called slam- door trains because of the noise they made by the passengers slamming the doors shut when the train was about to leave. Some slam-door trains (such as the British Rail Mark 3) had doors that could only be opened from the outside, so passengers had to lean out of the window to reach the outside door handle. In 2005, all slam-door trains were replaced with trains with automatic operated doors. The last slam-door train was withdrawn by South Eastern Trains in December 2005.SET runs last slammer The Railway Magazine issue 1256 December 2005 page 64 == Preservation == South West Trains ran two slam-door '3-CIG' (Class 421) trains on the Lymington branch line in Hampshire until 22 May 2010. These trains had central locking installed so that they couldn't be opened, they ran the service as a 'heritage line'. Other slam door trains are at different museums or are privately owned. Another problem is that many slam-door trains contain asbestos. This was removed from some of the trains when they were improved in the 1980s, but many slam-door trains were incinerated to destroy the asbestos. Preserved trains that have asbestos in them have to have it removed or it has to be treated. == List of slam-door trains == *British Rail Class 302 *British Rail Class 304 *British Rail Class 305 *British Rail Class 307 *British Rail Class 308 *British Rail Class 309 *British Rail Class 310 *British Rail Class 312 *British Rail Class 415 (4EPB) *British Rail Class 421 (4CIG) *British Rail Class 411 (4CEP) *British Rail Class 423 (4VEP) == Gallery == File:Class 421 1497 door to coupe.jpg|alt=|An open passenger door on a British Rail Class 421 train. File:Epping Ongar Railway IMG 6408 (9356139297) (cropped).jpg|alt=|Open passenger doors on a British Rail Class 421 train. File:2017 at Bath Spa - fGWR mind the gap on platform 1 (fGWR TS 42321).JPG|British Rail Mark 3 carriage showing opened doors that can only be opened on the outside File:Last day of GWR HSTs - TS 42003 at Didcot Parkway.JPG|British Rail Mark 3 carriage showing closed doors that can only be opened on the outside ==References== Category:United Kingdom rolling stock",
 "title": "Slam-door train"
}