{
 "id": "948139",
 "text": "The electroscope is an early scientific instrument used to detect the presence of electric charge on a body. It detects charge by the movement of a test object due to the Coulomb electrostatic force on it. The amount of charge on an object is proportional to its voltage. The accumulation of enough charge to detect with an electroscope requires hundreds or thousands of volts, so electroscopes are used with high voltage sources such as static electricity and electrostatic machines. An electroscope can only give a rough indication of the quantity of charge; an instrument that measures electric charge quantitatively is called an electrometer. The electroscope was the first electrical measuring instrument. The first electroscope was a pivoted needle (called the versorium), invented by British physician William Gilbert around 1600. a translation by P. Fleury Mottelay of William Gilbert (1600) Die Magnete, London The pith-ball electroscope and the gold-leaf electroscope are two classical types of electroscope that are still used in physics education to demonstrate the principles of electrostatics. A type of electroscope is also used in the quartz fiber radiation dosimeter. Electroscopes were used by the Austrian scientist Victor Hess in the discovery of cosmic rays. == Pith- ball electroscope == In 1731, Stephen Gray used a simple hanging thread, which would be attracted to any nearby charged object. This was the first improvement on Gilbert's versorium from 1600. The pith-ball electroscope, invented by British schoolmaster and physicist John Canton in 1754, consists of one or two small balls of a lightweight nonconductive substance, originally a spongy plant material called pith, p. 609 suspended by silk or linen thread from the hook of an insulated stand. Tiberius Cavallo made an electroscope in 1770 with pith balls at the end of silver wires. Modern electroscopes usually use balls made of plastic. In order to test the presence of a charge on an object, the object is brought near to the uncharged pith ball. If the object is charged, the ball will be attracted to it and move toward it. The attraction occurs because of induced polarization of the atoms inside the pith ball. Paul E. Tippens, Electric Charge and Electric Force, Powerpoint presentation, pp. 27–28, 2009, S. Polytechnic State Univ. on DocStoc.com website All matter consists of electrically charged particles located close together; each atom consists of a positively charged nucleus with a cloud of negatively charged electrons surrounding it. The pith is a nonconductor, so the electrons in the ball are bound to atoms of the pith and are not free to leave the atoms and move about in the ball, but they can move a little within the atoms. See diagram. If, for example, a positively charged object (B) is brought near the pith ball (A), the negative electrons (blue minus signs) in each atom will be attracted and move slightly toward the side of the atom nearer the object. The positively charged nuclei (red plus signs) will be repelled and will move slightly away. Since the negative charges in the pith ball are now nearer the object than the positive charges (C), their attraction is greater than the repulsion of the positive charges, resulting in a net attractive force. This separation of charge is microscopic, but since there are so many atoms, the tiny forces add up to a large enough force to move a light pith ball. The pith ball can be charged by touching it to a charged object, so some of the charges on the surface of the charged object move to the surface of the ball. Then the ball can be used to distinguish the polarity of charge on other objects because it will be repelled by objects charged with the same polarity or sign it has, but attracted to charges of the opposite polarity. Often the electroscope will have a pair of suspended pith balls. This allows one to tell at a glance whether the pith balls are charged. If one of the pith balls is touched to a charged object, charging it, the second one will be attracted and touch it, communicating some of the charge to the surface of the second ball. Now both balls have the same polarity charge, so they repel each other. They hang in an inverted 'V' shape with the balls spread apart. The distance between the balls will give a rough idea of the magnitude of the charge. == Gold-leaf electroscope == The gold-leaf electroscope was developed in 1787 by British clergyman and physicist Abraham Bennet, as a more sensitive instrument than pith ball or straw blade electroscopes then in use.*[Anon.] (2001) \"Electroscope\", Encyclopaedia Britannica It consists of a vertical metal rod, usually brass, from the end of which hang two parallel strips of thin flexible gold leaf. A disk or ball terminal is attached to the top of the rod, where the charge to be tested is applied. To protect the gold leaves from drafts of air they are enclosed in a glass bottle, usually open at the bottom and mounted over a conductive base. Often there are grounded metal plates or foil strips in the bottle flanking the gold leaves on either side. These are a safety measure; if an excessive charge is applied to the delicate gold leaves, they will touch the grounding plates and discharge before tearing. They also capture charge leaking through the air that accumulates on the glass walls, increasing the sensitivity of the instrument. In the precision instruments the inside of the bottle was occasionally evacuated, to prevent the charge on the terminal from leaking off through the ionization of the air. When the metal terminal is touched with a charged object, the gold leaves spread apart in an inverted 'V'. This is because some of the charge from the object is conducted through the terminal and metal rod to the leaves. Since the leaves receive the same sign charge they repel each other and thus diverge. If the terminal is grounded by touching it with a finger, the charge is transferred through the human body into the earth and the gold leaves close together. The electroscope leaves can also be charged without touching a charged object to the terminal, by electrostatic induction. As the charged object is brought near the electroscope terminal, the leaves spread apart, because the electric field from the object induces a charge in the conductive electroscope rod and leaves, and the charged leaves repel each other. The opposite-sign charge is attracted to the nearby object and collects on the terminal disk, while the same-sign charge is repelled from the object and collects on the leaves (but only as much as left the terminal), so the leaves repel each other. If the electroscope is grounded while the charged object is nearby, by touching it momentarily with a finger, the repelled same-sign charges travel through the contact to ground, leaving the electroscope with a net charge having the opposite sign as the object. The leaves initially hang down free because the net charge is concentrated at the terminal end. When the charged object is moved away, the charge at the terminal spreads into the leaves, causing them to spread apart again. File:Gold-leaf electroscope-2.jpg|Condensing electroscope, Rome University physics dept. File:Gold leaf electroscope with ground strips.png|Electroscope from about 1910 with grounding electrodes inside jar, as described above File:Gold leaf electroscope homemade.jpg|Homemade electroscope, 1900 == Related pages == * Electrical measurements * Electrostatic fieldmeter * Faraday cup electrometer * Radiation ==Footnotes== == Other websites == * * * Category:Electrostatics Category:Electrical instruments Category:Measuring instruments Category:Historical scientific instruments",
 "title": "Electroscope"
}