{
 "id": "948200",
 "text": "Jacqueline R. Walorski (, August 17, 1963 – August 3, 2022) was an American politician. She was the U.S. representative for Indiana's 2nd congressional district from 2013 until her death in 2022. She was a member of the Republican Party. She was a member of the Indiana House of Representatives from 2005 to 2010. ==Early life== Walorski was born in South Bend, Indiana, on August 17, 1963. She studied at Liberty University and at Taylor University. In 1995, she married Dean Swihart. Walorski began her career as a television reporter in South Bend from 1985 to 1989. Walorski moved to Romania in 2000 to focus on charity work and Christian missionary work for children there. She returned to the United States in 2004. ==State Representative== In 2004, Walorski ran for the Indiana House of Representatives. She ran for Indiana's 2nd District. Walorski beat Democrat Carl H. Kaser in a landslide victory with a 64% to 36% vote margin. In 2006, she won a second term with 53% of the vote. In 2008, she won a third term without anyone running against her. ==U.S. House of Representatives== In January 2009, Walorski announced her candidacy to run against Democratic U.S. Representative Joe Donnelly. She won the Republican primary in May 2010. She lost the general election with a 48% to 47% vote margin.2010 Election Results, CNN.com; accessed November 9, 2016. Donnelly decided not to run for reelection in the U.S. House, instead wanted to run for the U.S. Senate in 2012. In May 2012, Walorski won the Republican nomination for the U.S. House seat. Walorski would go on to win the general election with a 49% to 48% vote margin. In June 2017, she was honored with the Commander of the Order of the Star of Romania in Romania for her charity work there in the early 2000s. ===2020 election=== Walorski voted against the second impeachment of Donald Trump and voted to not approve the certification of the 2020 United States presidential election. In December 2020, Walorski was one of 126 Republican members of the House of Representatives who supported Texas v. Pennsylvania, a lawsuit filed at the United States Supreme Court. This was an attempt to overturn the results of the 2020 United States presidential election, in which Joe Biden beat Donald Trump. ==Death== Walorski was killed in a car crash near Nappanee, Indiana on August 3, 2022 at the age of 58. Three other people were killed in the accident including her communications director, Emma Thomson, and her district director, Zachery Potts. The accident was caused when Walorski's car crashed with another car on State Road 19. Her funeral was held on August 11 in Granger, Indiana and she was buried at Southlawn Cemetery in South Bend. U.S. House Speaker Nancy Pelosi said flags would be at half-staff at the United States Capitol in her honor. House Minority Leader Kevin McCarthy, Transportation Secretary Pete Buttigieg, former Vice President Mike Pence, former President Donald Trump, and President Joe Biden released statements after her death honoring her. ==References== ==Other websites== * * * Category:1963 births Category:2022 deaths Category:United States representatives from Indiana Category:Members of the Indiana General Assembly Category:Road accident deaths in the United States Category:People from South Bend, Indiana Category:Republican Party (United States) politicians Category:American Christians Category:People from Elkhart, Indiana",
 "title": "Jackie Walorski"
}