{
 "id": "948634",
 "text": "Hélène Maxime Camille Berr ( – April 1945), commonly referred to as Hélène Berr, was a French-born Jewish woman, who was the author of a diary written from 1942 to 1944. The diary was published as a book for the first time in 2008. == Biography == === Family origin and the feelings she wrote in her diary === Hélène Berr was born into a Jewish family of Alsatian origin, and was a descendant (maternal great-grandaughter) of the French engineer Maurice Lévy. In her diary, Hélène used quotes from authors such as William Shakespeare and Lewis Carroll. In a diary entry, she wrote that \"the war is just a bad dream.\" In her diary, Hélène writes about her daily life during the occupation, and anti-Semitic allusions, such as being forced to wear the yellow star badge, when outside. === Birth and occupation of father === Hélène Berr was born as Hélène Maxime Camille Berr on in the Hôtel-de-Ville arrondissement of Paris, Paris, France. She was the daughter of Raymond Berr, who was a polytechnician in the École polytechnique, a engineer in the Corps des Maines, and a vice-president of the Kuhlmann Establishments (which later merged with Pechiney). === Life during the German occupation and review of Hélène's diary === Hélène's plan was to pass the final exam for the Paris- Sorbonne University. But she was rejected from attending the final exam, because the German government did not allow Jews to study there, any longer. When this did not work for Hélène Berr, who was 21 years old at the time, she decided to go find a job. She presented herself at the headquarters to the General Union of Israelites of France (UGIF). Hélène volunteered to be a social worker. She was accepted, and got the role as a volunteered social worker on 6 July 1942. Just almost three months earlier, she went to visit Paul Valéry, and on that same day, she began writing her diary. The first entry in her diary is dated 7 April 1942. The diary was published for the first time in 2008 by Tallandier Editions. Patrick Modiano once compared Hélène's style of writing to the writing style of Katherine Mansfield. Hélène Berr also became a secretary for Denise Milhaud at the Temporary Mutual Aid, a clandestine group created in 1941, alongside the Social Service for Aid to Emigrants. Lucie Chevalley served as director of the group. === Arrest and detainment === On the morning hours of 8 March 1944, at dawn, Hélène Berr was arrested with her parents at their house, at 5 Avenue Élisée-Reclus. Following their arrest, they were detained at the Drancy internment camp. On 27 March 1944, Hélène's 23rd birthday, she and her father and mother left Drancy, on a deportation to Auschwitz. === Evacuation and death === Faced with the advance of the Soviet Red Army, Hélène left with a convoy of other inmates on a evacuation from Auschwitz, on 31 October 1944, and arrived in their destination in Bergen-Belsen three days later on 3 November. After their arrival, there was a raging typhus epidemic in the camp. Hélène contracted typhus and became ill. Around April 1945, there was a roll-call in the camp, and Hélène was too weak to attend it, so she got beaten to near death by a German officer. She later died as a result of her wounds, in possible addition to typhus. The camp was liberated on 15 April. Mariette Job, Hélène's niece and the publisher and editor of her diary, suggests a death date of 10 April 1945 (five days before the camp was liberated), but does not specify why he suggests this. == Tribute == There is a media library that is named after Hélène Berr, in the Reuilly arrondissement of Paris, Paris, France, as well as a reading hall in the Paris-Sorbonne University (the university Hélène Berr attended) named after her. In the ruins of a 18th century castle named Château de Vivier in Yvelines, France, there is a commemorative plague that is made in the memory of the young diarist was placed near the entrance to the castle. The commemorative plague was made in 2016. There is a plague on 5 Avenue Élisée-Reclus (the house where Hélène and her family lived and were arrested on 8 March 1944) made in Hélène Berr's memory. == The diary == The first entry in Hélène's diary is dated 7 April 1942, the same day she went to visit Paul Valéry. The last entry of her diary is dated 15 February 1944 and is written in the Palais-Bourbon arrondissement of Paris, with the last line in her diary being: \"Horror, Horror, Horror!\", a line from William Shakespeare's play Macbeth. Macduff similarly writes, \"O horror, horror, horror!\" But this line is also the strong reminiscent of \"The horror! The horror!\", as said by Kurtz, a fictional character in the last line of the novel Heart of Darkness as written by Joseph Conrad (This quote is one of the many quotes Hélène Berr used in her diary). Most of the quotes Hélène Berr used in her diary, are those of the English romantic poet John Keats, whose work she studied. The diary consists of 262 loose sheets. Hélène wrote in fine handwriting using both blue or black ink and pencil in the sheets. As the pages in her diary go by, Hélène's handwriting can get very hasty. Mariette Job, Hélène's niece, published and edited her diary. He was also a former bookseller. Once he began reading it, he realized that he was reading a text written by his niece (because of stuff circulating in her family, that she mentioned). The original copy of Hélène's diary was given to Jean Morawiecki, Hélène's fiance, and was in his hands, as she wished when she was still alive. He became a diplomat after the war ended. He also appointed Mariette Job as legatee of the diary. == The deposition and publication of the diary == The original manuscript of the diary was deposited in 2002 at the Shoah Memorial. It was first published in January 2008 by Tallandier Editions, with a preface written by a novelist named Patrick Modiano. It was republished in pocket format by Points Editions in May 2009. (It is also available for reading in \"school edition\"). Category:1921 births Category:1945 deaths Category:Holocaust victims Category:French Jews Category:Diarists",
 "title": "Hélène Berr"
}