{
 "id": "948805",
 "text": "Philippine Collective Media Corporation (PCMC; officially known in their documents as Philippine CollectiveMedia Corporation) is a Philippine broadcast media company. Its headquarters are located in Barangay South Triangle, Quezon City, with offices in Makati City and in Tacloban. It owns a number of radio stations across the country under the FM Radio Philippines (Favorite Music Radio) network and AM radio station Radyo 630, as well as television stations PRTV Prime Media and PRTV Tacloban. ==History== PCMC was founded on May 21, 2008. It was signed into law under Republic Act 9773 in 2009, initially its broadcast operations only limited covering the Eastern Visayas region. In April 25, 2011, PCMC launched 3 stations in Tacloban: AM station DYBR (discontinued in 2013 following the aftermath of Typhoon Haiyan), FM station DYDR, and the first local independent TV station PRTV. The company's legislative franchise was later amended in 2020 under Republic Act 11508, allowing PCMC to operate national broadcast albeit without President Rodrigo Duterte's signature as the bill lapsed into law after 30 days of inaction. PCMC launched its own FM network Favorite Music Radio (or FMR, based on the owner's initials), with its flagship station DYDR in Tacloban was relaunched under the said brand. PCMC is expected to expand the FMR network into 35 radio stations nationwide. In May 2021, PCMC and Prime Media Holdings, Inc. (PMHI/PRIM), a publicly-traded investment firm involving real estate and hospitality, signed a share-for-share swap agreement through a backdoor listing. Under the deal, PCMC shareholders will exchange their shares of common stock to take majority control of PRIM, which will acquire PCMC and will become the latter's subsidiary. With the expansion of its radio and television operations, the company is expected to launch a national TV network with its plans to collaborate with several content providers (among them is ABS-CBN Corporation). On September 20, 2021, PCMC was signed by ZOE Broadcasting Network an affiliation deal to air A2Z's programming on PRTV Tacloban, As a result, PRTV Tacloban became a network-affiliated station for the first time in its history. In 2022, Prime Media's memorandum was later revised following PCMC's shareholders created a holding firm Golden Peregrine Holdings (GPHI) which was already acquired PCMC, therefore GPHI became a direct subsidiary of PMHI with PCMC as its indirect subsidiary. On May 6, 2024, ABS-CBN's flagship newscast TV Patrol begin airing on all Favorite Music Radio stations nationwide.TV Patrol mapakikinggan na rin sa ilang FM Radio stations simula May 6 | TV Patrol On May 27, 2024, PCMC and Prime Media formally launched its own national TV channel Prime TV, which serves as an expansion of the PRTV brand. In October 2024, it was reported by news website Bilyonaryo that PCMC/Prime Media has signed an agreement with MediaQuest Holdings to acquire the radio assets of Nation Broadcasting Corporation (NBC), which houses Radyo5 operated by NBC's sister company TV5 Network. As part of its sale/transfer agreement (subject to regulatory approvals), PCMC will lease NBC radio station in 92.3 Manila, 95.9 Naga and 101.9 Davao, Advanced Media Broadcasting System radio station in 106.3 General Santos and Reliance Broadcasting Unlimited, Inc. 105.5 Pampanga with the new FM Radio Philippines originating stations. ==PCMC stations== ===Television=== ====PRTV==== ;Digital Branding Callsign Ch. # Frequency Power Area of Coverage PRTV DYPR-TV 50 689.143 MHz 2 kW Tacloban UHF Channel 50 (689.143 MHz) Channel Video Aspect Short name Programming Note 27.01 480i 4:3 PRTV PRTV Tacloban (Main DYPR-TV programming) Test broadcast/Configuration testing 27.02 A2Z A2Z (ZOE TV) 27.03 Reserve Test Feed ;Digital affiliate stations Branding Callsign Ch. # Frequency Power Area of Coverage PSUB 50 689.143 MHz 1 kW Nabua, Camarines Sur ====PRTV Prime Media==== Short Name Programming Ch. # (LCN) Frequency Owner PRTV PRIME PRTV Prime Media xx.1 Broadcast Enterprises and Affiliated Media ===Radio=== ====AM stations==== Branding Callsign Frequency Location Notes Radyo 630 DWPM 630 KHz Metro Manila Operated conjointly with ABS-CBN Corporation under Media Serbisyo Production Corporation. ====FM stations==== Source: Branding Callsign Frequency Location FM Radio Manila DWFM 92.3 MHz Metro Manila Cignal Channel 317 Nationwide FM Radio Tacloban DYDR 100.7 MHz Tacloban DYPD 100.7 MHz Ormoc DYPA 101.7 MHz Borongan DYPC 88.5 MHz Calbayog DYPF 106.9 MHz Catbalogan rowspan=\"1\" 91.7 MHz Catarman FM Radio Baguio DWEE 94.3 MHz Baguio FM Radio Tuguegarao DWEX 94.9 MHz Tuguegarao FM Radio Nueva Vizcaya rowspan=\"1\" 93.3 MHz Solano FM Radio Pampanga DWDU 105.5 MHz San Fernando, Pampanga FM Radio Quezon rowspan=\"2\" 94.3 MHz Sariaya FM Radio Palawan 90.3 MHz Puerto Princesa FM Radio Camarines Sur DZRP 94.5 MHz Goa FM Radio Naga DZRB 95.9 MHz Naga University FM DWBT 94.3 MHz Nabua FM Radio Daet rowspan=\"8\" 94.3 MHz Daet FM Radio Catanduanes 97.5 MHz Virac FM Radio Albay 90.5 MHz Ligao FM Radio Sorsogon 90.3 MHz Sorsogon FM Radio Antique 105.3 MHz San Jose, Antique FM Radio Iloilo 90.1 MHz Iloilo City FM Radio Bacolod 91.1 MHz Bacolod FM Radio Bohol 104.7 MHz Tagbilaran FM Radio Cebu DYWF 93.1 MHz Cebu FM Radio Maasin DYAE 96.5 MHz Maasin FM Radio Bukidnon rowspan=\"7\" 105.1 MHz Malaybalay FM Radio Camiguin 98.3 MHz Mambajao FM Radio Cagayan de Oro 107.1 MHz Cagayan de Oro Babe Radio 106.1 MHz Dipolog FM Radio Sibugay 99.3 MHz Ipil FM Radio Pagadian 93.5 MHz Pagadian FM Radio Zamboanga 107.5 MHz Zamboanga City FM Radio Davao de Oro DXPG 96.7 MHz Nabunturan FM Radio DavNor DXTU 89.5 MHz Tagum FM Radio Davao DXFM 101.9 MHz Davao City FM Radio Digos 89.5 MHz Digos Sky Radio DXJF 96.1 MHz Hagonoy FM Radio General Santos DXKM 106.3 MHz General Santos FM Radio Butuan rowspan=\"3\" 101.5 MHz Butuan FM Radio Bagtik 89.3 MHz Surigao Friends Radio 96.7 MHz Iligan ;Affiliates Branding Callsign Frequency Location Owner Happy Radio DZJD 102.5 MHz Tumauini 90 Degrees North, Inc. YK FM rowspan=3 107.3 MHz Montevista YK Broadcasting Service Radyo Asenso 95.7 MHz Monkayo Municipal Government of Monkayo Radio Ignacia 87.9 MHz Cotabato Notre Dame – RVM College of Cotabato ;Notes ===Former/inactive stations=== Branding Callsign Frequency Location Note/s Apple Radio DYBR-AM 711 KHz Tacloban Inactive; transmission destroyed by Typhoon Haiyan in 2013. ==References== Category:Television networks in the Philippines Category:Filipino television stations Category:Radio stations",
 "title": "Philippine Collective Media Corporation"
}