{
 "id": "948815",
 "text": "Paximathia, or Paximadia (; singular: paximathi/paximadi), are hard breads of Greek origin. They are made from wheat, chickpea, or barley-flour.... Paximathia are seen as similar to biscotti or type of biscotti.. They are sold in many Greek bakeries and are a common food in Greece often served as breakfast with marmalade or cheese.. Paximathia are also supplied in Greek stores in many parts of the United States. ==History== The name paximathia comes from the Greek word paximadion (παξιμάδιον), which comes from a 1st- century Greek named Paxamus who wrote a cookbook. The word first appears in a recipe for laxative biscuits written by the Greek doctor Galen. Paximathia were eaten by Greek farmers, the Byzantine army, and priests. Greek farmers would eat paximathia in their fields after softening them by soaking them in water and olive oil. They sometimes ate them with other foods like homemade cheese and a few olives. Paximathia used to be baked outdoors in ovens around every ten to fifteen days, after which the bread would be sliced into thick wedges and put back into the ovens to dry. They were an important food for the people of Crete. ==Making and types== Paximathia are made with wheat, chickpea, or barley-flour. Other ingredients used may include eggs, vegetable oil, cinnamon, cloves, and orange zest.. Today, paximathia are usually baked overnight in ovens that have been turned off, whereby the bread is cooked from the remaining heat. This method cooks the bread to a dry state without creating brittleness that can cause crumbling. Paximathia is sometimes broken into pieces and served in salads after being moistened. Paximathia are in dakos, which is a Greek salad made on the island of Crete. In Crete, a type of paximathi called a koulouri is ring-shaped and served dried with olive oil, oregano and grated tomato. Eptazymo is another type of paximathi made with chickpeas. ==Related pages== *Greek food ==References== ===Citations=== ===Sources=== * * * * * * * Category:Greek food",
 "title": "Paximathia"
}