{
 "id": "948936",
 "text": "Awesomeness (an abbreviation of it’s full name AwesomenessTV) is a Los Angeles-based film and television studio owned by Paramount Digital Studios, a division of Paramount Global. == Filmography == === Television productions === ==== Current programming ==== Years Title Co-production with Network 2020–present Next Influencer N/A AwesomenessTV (2020–21) Paramount+ (2022) ==== Ended programming ==== Years Title Co-production with Network 2013–15 AwesomenessTV Nickelodeon Productions CBS Television Studios Nickelodeon 2015 Richie Rich DreamWorks Animation (Harvey Entertainment) Netflix 2015–17 Project Mc2 MGA Entertainment Guidance N/A go90 2016–18 Foursome YouTube Red 2016–18 T@gged go90 (2016–17) Hulu (2018) 2016–17 Freakish Hulu 2018 My Dead Ex go90 2018–19 Light as a Feather Grammnet Productions Wattpad Studios Hulu 2018 All Night N/A Overthinking with Kat & June YouTube Premium 2019–21 PEN15 Lonely Island Classics Odenkirk Provissiero Family Version Hulu 2019–20 Trinkets Two Blocks Apart Productions Netflix 2020 Niki and Gabi Take Bahamas N/A AwesomenessTV 2021 Drama Club Nickelodeon Productions CBS Studios Nickelodeon === Film productions === Release date Title Co- production companies Distributor June 21, 2014 Terry the Tomboy Nickelodeon Productions Nickelodeon December 12, 2014 Expelled N/A 20th Century Fox July 24, 2015 Smosh: The Movie Smosh Productions Defy Media 20th Century Fox Netflix October 11, 2016 Shovel Buddies Awesomeness Films Film 360 Entertainment 360 20th Century Fox January 21, 2017 Before I Fall Awesomeness Films Jon Shestack Productions Open Road Films June 23, 2017 You Get Me Awesomeness Films Netflix August 17, 2018 To All the Boys I've Loved Before Awesomeness Films Overbrook Entertainment April 12, 2019 The Perfect Date Awesomeness Films Ace Entertainment February 12, 2020 To All the Boys: P.S. I Still Love You October 6, 2020 Spontaneous Awesomeness Films Jurassic Party Productions Paramount Pictures February 12, 2021 To All the Boys: Always and Forever Awesomeness Films Ace Entertainment Netflix September 3, 2021 The J Team Nickelodeon Movies Jojo Siwa Inc. Paramount+ July 29, 2022 Honor Society Awesomeness Films Guardian Pictures == References == == Other websites == * Category:2010s establishments in California Category:Nickelodeon Category:Companies based in Los Angeles",
 "title": "Awesomeness (company)"
}