{
 "id": "948990",
 "text": "The Treaty of Greenville or Treaty with the Wyandots, etc. (1795) was a treaty between the Natives people of the Northwest Territory and United States. The treaty was after the Northwest Indian Wars. Tribes that signed the treaty included Wyandot, Delaware, Shawnee, Ottawa, Chippewa, Potawatomi, Miami, Eel River, Wea, Piankeshaw, Kickapoo, and Kaskaskia. The treaty created new boundaries for American Indian territories. The treaty was signed after the Battle of Fallen Timbers. Native territory was limited to northwestern Ohio. The Natives in the treaty were called the Western Confederacy. == People == General Anthony Wayne was in charge of the treaty. Other Americans included William Wells, William Henry Harrison, William Clark, Caleb Swan, and Meriwether Lewis. Native leaders and signers included Wyandot (chiefs Tarhe, Roundhead, and Leatherlips), Delaware (several bands). Shawnee (chiefs Blue Jacket and Black Hoof), Ottawa (several bands, including Egushawa), Chippewa, Potawatomi (23 signatories, including Gomo, Siggenauk, Black Partridge, Topinabee, and Five Medals), Miami (including Jean Baptiste Richardville, White Loon, and Little Turtle), Wea, Kickapoo, and Kaskaskia. President George Washington signed the treaty and the United States Senate confirmed it.Gaff, Alan D. (2004). Bayonets in the Wilderness. Anthony Waynes Legion in the Old Northwest. Norman: University of Oklahoma Press. p. 366. ISBN 0-8061-3585-9. == Terms == The treaty created the Greenville Treaty Line. Natives had to give up all the land south and east of the line. Natives had to give up their land and the US government gave money and supplies to Natives each year. This supply had a value of $20,000. The treaty line followed rivers in Ohio and Indiana. Natives had to leave forts that were along the Great Lakes. Native gave over important places like Fort Wayne, Indiana; Lafayette, Indiana; Chicago; Peoria, Illinois; and Toledo, Ohio. == References == Category:Native Americans Category:Treaties of the United States",
 "title": "Treaty of Greenville"
}