{
 "id": "948945",
 "text": "Pei Haozheng (Chinese: 裴浩正; Pinyin: Péi Hào Zhèng; born Nanjing, Jiangsu in 1996), also known as Hotz Pei, is a Chinese origami artist, TV program designer, and the holder of two Guinness World Records. He received his master's degree from the Nanyang Technological University (NTU) in Singapore in 2021. Pei has designed several origami-themed TV projects and hundreds of lifelike models, promoting the origami art form to a growing audience. His work has a positive nouveau influence on modern origami art because of its cultural value and humanitarian ideal. For instance, his Zijin Grass is known to over 100 million people as the \"flower of peace\" in remembrance of victims. Pei has been a judge or guest on the programs Super Brain, Forward to the Future, Voice, Day Day Up, and Power of Youth. His artwork has received many awards such as “China Outstanding Cultural, Social, and Educational Case”, etc., and is collected by many museums, including the Guinness World Records Museum, etc. == Origami == Pei started folding paper when he was in kindergarten. At first, he learned origami from teachers and parents, and later he copied the patterns from books. In early 2007, he came across a crease pattern designed by Robert J. Lang, an origami master from the United States. It was mind-blowing for him, and it opened for him a new world of ideas for the art. He continued to learn origami through theory books, such as Origami Design Secrets by Mr. Lang. As the quantity of his work grew, so did its variety and quality. During his middle school education, Pei created several unique designs, including a 60-centimeter-tall work featuring an angel with six wings folded from a 2-meter-long square sheet of paper. It took him numerous attempts to get everything right. In 2016, Pei won a bronze prize at the International Origami Internet Olympiad (IOIO). The next year, he became the champion of the competition. For the event's final task, he folded an ancient Chinese woman holding a mirror from a sheet of handmade xuanzhi (rice paper), which impressed judges with its exquisite shape and Eastern style. In 2018, he was invited to be the event's task designer. His work Bailuyuan was selected as the edition's mascot, which attracted the attention of contestants from 54 countries and regions. In 2019, Pei attended the Zijin Grass International Peace Summer School and taught origami to several international peace envoys. In June of that year, he devoted to the \"Micro Light Program\" jointly initiated by Amity Foundation and Ergeng Public Welfare, which has enlightened more than 50,000 students. In 2021, Pei participated in an exhibition — \"The Praise of Youth · Centennial of the Original Mind\" in Beijing, China, which attracted over 72,500 visitors. In April 2022, to celebrate the 103rd anniversary of the May Fourth Movement, Pei released a tutorial on how to fold a newspaper into a flower, named The Flower in May representing the country’s young generation. On 9 September of that year, he set a Guinness World Record for the most origami flowers made from a single sheet of paper. A team of four led by him spent five days folding an origami deer with 100 twisty roses on its antlers from a 3-meter-long square sheet of paper. In November, he was awarded the honorary title of \"Boao Youth Leader\" by a former Chinese foreign minister at the Boao Youth Development Conference. In March 2023, Pei set his second Guinness World Record for the largest origami snail. He then gave a lecture, \"The Mark of Origami\", at MSL of Tianjin University. In May, he took part in the activity of \"National Science and Technology Workers Day\" at Beijing Institute of Fashion Technology. In June, as a special guest of the Lenovo Beijing Future Center, he gave a lecture, \"A Glimpse of Science and Art with a Piece of Paper\". In July, he attended Youyang Poetry Festival in Chongqing with many famous artists, scientists, and cultural relics experts. == Variety shows == In 2017 and 2018, Pei was invited to the Chinese version of Super Brain, a competitive reality show on Jiangsu Satellite TV. The show gave him an opportunity to meet Mr. Lang, both as judges for the show. Pei made 20 models for display there and received the praise of Mr. Lang for his repertoire of techniques. In late 2018, Pei took up the challenge of creating a solar panel in origami style at Forward to the Future, a science show on China Central Television. He successfully built the panel that folds up to 1 square meter, which when unfolded becomes a structure of 81 square meters. In 2020, Pei participated in 10 episodes of Power of Youth, a competitive reality show on Anhui Satellite TV. He successfully went through all the challenges about ancient and modern civilization and won the most \"power medals\" as well as a scientific research fund. In 2021, on behalf of Chinese youth, Pei was invited to express his ideas at Voice, the first open class for youth on China Central Television. He gave an \"Ice Cube\" Voronoi tessellation model to Zheng Fang, the architect of several Olympic stadiums in the 2008 Summer Olympic Games and the 2022 Winter Olympic Games. In 2022, Pei was invited to deliver a speech titled \"5 Minutes to Change the Future\" at Day Day Up on Hunan Satellite TV, bringing a new perspective to the audience. Year English title Chinese title Notes Ref. 2017 Super Brain 4 《最强大脑第四季》 Episode: Yueran Zhishang 2018 Super Brain 5 《最强大脑之燃烧吧大脑》 Episode: The Mystery of Paper and Dots 2018 Forward to the Future 3 《加油！向未来第三季》 Episode: Aerospace Origami 2020 Power of Youth 《青春的力量》 10 episodes 2021 Voice 《开讲啦》 Episode: 2022 Winter Olympic Games 2022 Day Day Up 《天天向上》 Episode: 5 Minutes to Change the Future == Renowned works == * 2010-19, Zijin Grass, Nanjing Massacre Museum, Nanjing * 2013, Phoenix, Asian Youth Games, Nanjing * 2015, Jiao Ren (\"Mermaid\"), UNESCO, Beijing * 2016, Lotus’ Charm, First China Service Trade Innovation and Development Summit, Wuhan, China * 2018, Crane, Robert Desimone — director of the MIT McGovern Institute, Cambridge, USA * 2018, Shou Wang (\"Antelope\") and Dragonfly Standing on a Lotus, Jiangsu Satellite TV, Nanjing * 2018, Solar Panels, China Central Television, Beijing * 2019, Join Hands to Build a Peaceful China, International Poster Biennale for Peace (IPBP), Nanjing * 2021, Yuanhang Bainian (\"100 Years of Sailing\"), Chinese Communist Party, Beijing * 2022, Huasheng Manlu (\"Deer with 100 Flowers\") and Flower in May, China Daily, Beijing * 2023, Grand Rabbit, Nanjing Gaochun Museum, Nanjing * 2023, Fibonacci Snail, China International Cittaslow Museum, Nanjing File:Deer with 100 Flowers.jpg|Huasheng Manlu File:Zijin Grass Set.jpg|Zijin Grass File:Grand Rabbit.jpg|Grand Rabbit File:Chinese Phoenix.jpg|Phoenix File:100 Years of Sailing.jpg|100 Years of Sailing File:Dragonfly Standing on a Lotus.jpg|Dragonfly Standing on a Lotus File:Origami Poster.jpg|Join Hands to Build a Peaceful China File:Lotus' Charm.jpg|Lotus' Charm File:Qilin Origami.jpg|Qilin File:Ice Cube Tessellation.jpg|Ice Cube File:Deer with a Red Scarf (II).jpg|Bailuyuan File:Flying Apsaras.jpg|Flying Apsaras File:Deity of Deer.jpg|Deity of Deer File:Fibonacci Snail.jpg|Fibonacci Snail File:Deity of Mirror.jpg|Deity of Mirror File:美人鱼.jpg|Mermaid File:Antelope Origami.jpg|Shou Wang File:Nonuple Roses.jpg|Nonuple Roses File:Earth Origami.jpg|Earth File:Chinese Crane.jpg|Crane File:Solar Panel (I).jpg|Solar Panel File:Chang'e (II).jpg|Chang'e File:Countdown to Death 2.jpg|Countdown to Death File:Light from Heaven (Double Angels).jpg|Light from Heaven File:Tale of Two Dragons.jpg|A Tale of Two Dragons File:Hermit Crab Origami.jpg|Hermit Crab File:Giant Squid Attacks a Rosy Boat.jpg|Squid Attacks a Boat File:Flower in May.jpg|Flower in May == Awards and honors == Year Award/honor Ref. 2016-17 Bronze Prize of the IOIO VI and Gold Prize of the IOIO VII 2018 China \"Yilin Cup\" Literature Award 2018 Award of China Central Television English Speaking and Talent Competition 2019 IPBP Finalist Award 2021 China Outstanding Cultural, Social, and Educational Case 2021 China Top 100 Cultural and Creative Product 2021 Excellent Demonstration Project of Museum Education Cases in Jiangsu Province 2022 Boao Youth Leader 2022 Purple Mountain Talent 2022 Zijin Award of Museum Cultural and Creative Design Competition 2022 Nanjing Municipal-Level Museum Education Case 2022-23 Guinness World Records Holder 2023 Cittaslow Goodwill Ambassador 2023 Cittaslow Public Welfare Advocate == Students == * Christoph Reinhardt: the great-grandson of German businessman John Rabe, often described as China's Oskar Schindler * Stephen Brady: a relative of US doctor Richard Freeman Brady, who helped to set up a protection zone during the Nanjing Massacre in 1937 * Angelina Reinhardt: the adopted daughter of Christoph Reinhardt * Rick Magee: the grandson of US Episcopal priest John Magee, who shot films during the Nanjing Massacre * Du Jialei: the award winner in the \"2020 Exhibition of Architectural Design in Developing Countries\" and the bronze medal winner at the IOIO IX * The left- behind children at Nanjing Gaochun Xilian Primary School == References == == Other websites == * Pei Haozheng in Baidu Baike (in Chinese) * Pei Haozheng on Sina Weibo (in Chinese) * Pei Haozheng on Facebook * Interview with Pei Haozheng, by Wang Qian, featured in China Daily, 2021 Category:1996 births Category:Living people Category:People from Nanjing Category:Origami",
 "title": "Pei Haozheng"
}