{
 "id": "949278",
 "text": "Geranium clarkei, called Clarke's geranium, Kashmir Purple Geranium, Kashmir White or the Kashmir's Cranesbill is a species of flowering plant in the family Geraniaceae,IPNI native to India and cultivated for use in gardens. It is an herbaceous perennial growing to in height, with deeply cut 7-lobed leaves and white or purple flowers with pink veining in summer. It spreads by underground rhizomes, and is used for groundcover or the front of a border. A rhizomatous hardy geranium that is native to alpine meadows in the mountains of Kashmir. It typically grows in a clump to 18\" tall, spreading outward by creeping stems to 18\" wide. Purple-violet or white, upward-facing flowers (to 3/4\" diameter) with contrasting dark veins profusely bloom from late spring to early summer. Dark green leaves are deeply cut into 7 segments and form an attractive foliage mat. Genus name comes from the Greek word geranos meaning crane in reference to the fruit which purportedly resembles the head and beak of a crane. Kashmir White is a large-flowered cultivar which typically grows in a clump to 18\" tall, spreading outward by creeping stems to 18\" wide, and features a profuse bloom of white, upward-facing flowers (to 2\" diameter) with contrasting violet-pink veins. Easily grown in average, medium, well-drained soil in full sun to part shade. Prefers moist, humusy, well-drained soils, particularly in hot summer climates. Intolerant of drought. Performs best in cool summer climates, and is intolerant of the heat and humidity of the deep South. Shear off spent flowers after bloom to encourage additional bloom or tidy the planting. In the alternative, plants may be left alone after flowering to promote self-seeding. 'Kashmir White' self-seeds in the garden in optimum growing conditions, but flower colour in particular does not reliably come true from seed. Within Pakistan it is the State flower of Azad Kashmir. == Notes == ==References== Category:Rosids Category:Plants and animals of Kashmir Category:Azad Kashmir Category:Plants of Asia",
 "title": "Geranium clarkei"
}