{
 "id": "949274",
 "text": "The Kashmir Koklass Pheasant (Pucrasia macrolopha biddulphi), although called a pheasant, is related to grouses and is only a distant relative to the pheasants. Grouses are actually birds from the order Galliformes, which are heavy-bodied ground-feeding birds that include chicken and quail. In the monotypic genus Pucrasia, the Koklass Pheasant is the only species. Koklass is an adapted species that has been put into three different groups of species and again divided into subspecies. It is the only species in the genus Pucrasia to be divided into nine subspecies. ==Locations== It is found in a wide range from Asia, across Afghanistan to China. The range of the subspecies can be found at quite a distance from each other. The Koklass Pheasant is part of the few species related to galliforms that regularly fly uphill and can fly at a time for many miles. Galliform species are not normally known to fly. Koklass Pheasants look more similar to the grouses than a regular pheasant. ==Naming== Both the words Koklass and Pheasants from the name of Koklass Pheasants have been derived from the territorial call of the birds. The territorial call of the male is 'kok-kok-kok'. == Appearance == The male Koklass Pheasant is usually black in colour with each feather on the body covered with a pale white border. The male is much larger than the female in size and also much colourful. The male has a metallic green face, head, throat, and crest. They have chestnut on the chest and breast and a streaked appearance to the body. A white cheek patch is found along with a rust throat, chest and belly. The backs of the body are mostly grey and the wings are brown and tan coloured. The male species have a black beak and dark grey legs. The female has a dark grey beak and the same dark grey legs. The female Koklass has a cream-brown body with dark markings, a cream-colored face, white cheeks, and a throat patch. The female has white tips on the outside tail feathers. The female Koklass Pheasants has a fairly dull body. Both the male and female have wedge-shaped tails. The chicks and the first-year adults look similar to the females. They only attain the dark male body coloration after they mature. Within Pakistan it is the State bird of Azad Kashmir. == Notes == . ==References== Category:Birds of Pakistan Category:Azad Kashmir Category:Phasianidae",
 "title": "Kashmir Koklass pheasant"
}