{
 "id": "949395",
 "text": "James Michael Johnson (born January 30, 1972) is an American politician and lawyer. Since 2023, he has been serving as the 56th speaker of the United States House of Representatives. Before becoming speaker, he has also been serving as the United States representative for Louisiana's 4th congressional district since 2017. Johnson is a member of the Republican Party. ==Early life== Johnson was born in Shreveport, Louisiana. He studied at Louisiana State University to become a lawyer. He then became a lawyer in Benton, Louisiana. In 2015, he became a state representative in the Louisiana House of Representatives. ==U.S. Representative== Johnson was elected to the United States House of Representatives in 2016. He replaced retiring Representative John Fleming in the 4th district. He is part of the Republican Party. Johnson chaired the House Republican Study Committee for one term. It is the largest caucus of conservatives in Congress, . Johnson wants a nationwide abortion ban and an end to legal same-sex marriages. In December 2020, Johnson supported Texas v. Pennsylvania, a lawsuit filed at the Supreme Court in an attempt to overturn the results of the 2020 presidential election. In January 2021, Johnson voted to overturn the election results in Pennsylvania. Johnson supportshttps://www.politico.com/news/2024/04/26/march-or-april-how-zelenskyy- gave-johnson-a-deadline-for-military-aid-00154584. Retrieved 2024-04-27 (as of 2024) American military aid to Ukraine in its war against Russia. ===Speaker of the U.S. House=== On October 24, 2023, after three votes by the Republican conference, Johnson became the fourth Republican nominee for Speaker of the House in the October 2023 speakership election. He received 128 votes on the third ballot. Since he has not been a U.S. Representative for a long time, never chaired a full House committee, or served in senior House leadership, Johnson is the least experienced Speaker of the House in terms of service in 140 years. On October 25, 2023, he was elected the 56th Speaker of the United States House of Representatives. He is the first speaker in the history of the United States who comes from Louisiana. Johnson has the shortest House membership tenure of any Speaker in 140 years; John Carlisle, elected speaker in 1883, had a shorter House tenure at the time of his election to the speakership. ==Personal life== Johnson is married to Kelly Lary. They have four children. Johnson used to live in Shreveport, Baton Rouge, and in Allen, Collin County, Texas. Johnson said that early in his marriage, that he and his wife adopted a 14-year-old African American boy. ==Notes== ==References== ==Other websites== * Congressman Mike Johnson official U.S. House website * Campaign website * * * Category:1972 births Category:Living people Category:United States representatives from Louisiana Category:Politicians from Shreveport, Louisiana Category:Republican Party (United States) politicians Category:Lawyers from Shreveport, Louisiana Category:American television personalities Category:Speakers of the United States House of Representatives Category:Businesspeople from Shreveport, Louisiana Category:American political activists Category:Members of the Louisiana State Legislature",
 "title": "Mike Johnson"
}