{
 "id": "949432",
 "text": "The Zijin Grass (Chinese: 紫金草; Pinyin: Zǐ Jīn Cǎo; Japanese: シキンソウ) is a classic Chinese origami flower designed by Haozheng Pei. In Chinese culture, it is used to pay traditional respect to the deceased, especially martyrs; and it is a representation of the Chinese violet cress, referred to as the \"flower of peace\" both in China and Japan. It is often folded on the National Memorial Day on Dec 13 and the eve of Qingming Festival to pay tribute to the victims of the Nanjing Massacre in 1937 and pray for peace and security all over the world. The original Zijin Grass models are in the permanent collection of the Memorial Hall of the Victims in Nanjing Massacre by Japanese Invaders in Nanjing, Jiangsu, China. == Story == > During the War of Resistance against Japanese Aggression (1937-45), a > Japanese army doctor named Yamaguchi Seitarou (Chinese: 山口诚太郎; Japanese: 山口 > 誠太郎/やまぐち せいたろう) was deployed to Nanjing, East China's Jiangsu province. When > he left the ruined city in 1939, he collected a handful of seeds of a local > purple flower blossoming at the foot of Zijin Mountain and brought them back > to Japan. He named the flower Zijin Grass, also known as Chinese violet > cress and February orchid. Yamaguchi sent the seeds as gifts to friends and > family members and suggested them to plant the seeds in their backyards. In > over two decades, every year he would take a train and throw the seeds out > of window in hopes of letting these little wild violet-like flowers bloom > across Japan. At the 1985 World Horticultural Exposition in Tsukuba, Japan, > Yamaguchi's son donated 1 million seeds and told his father's story to > visitors from worldwide. Since then, the flower has been dubbed as \"the > flower of peace\". Its moral is: \"Remember history; cherish peace\". Inspired by the story, Haozheng Pei created several purple flower models and placed them near a bronze statue in the Memorial Hall in the 2000s. These models were noticed by the Memorial Hall and thus became one of its official collections as well as cultural and creative designs. == Influence == * The Zijin Grass tutorials, posters, and related documentaries have received over 170 million of views online. * Many Zijin Grass collection boxes are placed in public places including schools, hotels, communities, cultural exhibition venues, subway stations, etc. * The origami has been folded by many international pacifists from Australia, Canada, China, Germany, Japan, the United States, etc. == Honors == In 2021, a related project titled \"The Zijin Grass in Bloom\" and a series of \"The Zijin Grass Cultural and Creative Products\", both developed by the Memorial Hall, were respectively selected as the China Excellent Cultural, Social and Educational Project and the China Top 100 Cultural and Creative Products. == References == == Other websites == * Zijin Grass tutorial featured in China Culture * Zijin Grass featured on the official website of the Memorial Hall (in Chinese) Category:Origami",
 "title": "Zijin Grass"
}