{
 "id": "949497",
 "text": "The Pequot (/ˈpiːkwɒt/) are Native Americans from Connecticut. They are part of the Northeastern Woodlands. Their language is the extinct Mohegan-Pequot language. It is part of the Algonquian language family. The Pequot used to be with the Mohegan. They fought against colonists in the Pequot War (1634–1638). Many were killed. The Mashantucket Pequot Tribe was created in 1975. The tribe runs the Foxwoods Resort Casino since 1986. Other recognized tribes of the Pequot today include Eastern Pequot Tribal Nation, Mohegan Tribe, Schaghticoke Tribal Nation and Golden Hill Paugussett Indian Nation.Pritzker, Barry (2000) A Native American Encyclopedia: History, Culture, and Peoples, pp. 656–657. Oxford University Press. ISBN 0-19-513897-X. == History == There is debate about the meaning of the name Pequot.Frank Speck, \"Native Tribes and Dialects of Connecticut: A Mohegan-Pequot Diary\", Annual Reports of the U.S. Bureau of Ethnology 43 (1928): 218. The Pequot have lived thousands of year on the land in present-day Connecticut.Kevin McBride, \"Prehistory of the Lower Connecticut Valley\" (Ph.D. diss., University of Connecticut, 1984), pp. 126-28, 199-269 In parts of Connecticut the tribe had a strong presence. Many Pequot died from European diseases like smallpox. They were not immune to these diseases.Sherburne F. Cook, \"The Significance of Disease in the Extinction of the New England Indians,\" Human Biology 45 (1973): 485-508 At first, the Pequot and Dutch were just the main players in the region. They were involved in the fur trade. The English came later and brought unbalance. Tension between Natives and the English developed. The Pequot killed a English colonists in Connecticut. This led to the Pequot War. The Narragansett and Mohegan allied with the English colonists. The Pequot were successful in the beginning. Eventually, the Connecticut armies began a total war. The colonists killed many Pequot. Colonists and Native allies destroyed the Pequot village Mistick. This event is often called the Mistick Massacre. The Pequot lost their control and power of the land. They were forced onto reservations. Many are sold into slavery.Lion Gardiner, \"Relation of the Pequot Warres,\" History of the Pequot War: The Contemporary Accounts of Mason, Underhill, Vincent, and Gardiner(Cleveland, 1897), p. 138; Ethel Boissevain, \"Whatever Became of the New England Indians Shipped to Bermuda to be Sold as Slaves,\" Man in the Northwest 11 (Spring 1981), pp. 103-114; and Karen O. Kupperman, Providence Island, 1630-1641: The Other Puritan Colony(Cambridge, MA: Harvard University Press, 1993), p. 172. In 1976, Pequot sued North Stonington for illegal land purchase. The US government later recognized the Mashantucket Pequot tribe and gave the tribe land. The tribe built the Foxwoods Resort Casino in 1992.See Reagan's initial response in \"Message to the Senate Returning Without Approval the Mashantucket Pequot Indian Claims Settlement Bill\", April 5, 1983, University of Texas. In the 21st century, Pequot have been trying to bring back the lost language. == References == Category:Native Americans",
 "title": "Pequot"
}