{
 "id": "949494",
 "text": "The Penobscot (Abenaki: Pαnawάhpskewi) are Native Americans and First Nation from the Northeastern Woodlands. Their language is part of the Algonquian language family. They are part of the Wabanaki Confederacy. The US government recognizes the Penobscot Nation as a tribe. They are in the regions of Maine, Atlantic provinces and Quebec. Their name means \"the people of where the white rocks extend out.\" == History == The Penobscot did hunting. They moved for different seasons.The Wabanakis of Maine and the Maritimes. American Friends Service Committee, 1989. They traveled in birch bark canoes. They hunted and fished at different times of the year. They joined the fur trade. They traded furs and got goods like alcohol. Many Natives died from European diseases. They were not immune to these diseases. Penobscot encountered French in Canada and English in New England. They supported the Americans in the American Revolution. However, Americans began to push Penobscot off their lands. They were forced onto reservations. At the turn of the 19th century, the Penobscot gave up most of their land to Massachusetts. They could only stay on the Penobscot Indian Island Reservation. The tribe has sued the state of Maine several times. These have included issues like the right to hunt and land claims.Diana Scully. \"Maine Indian Claims Settlement: Concepts, Contexts, and Perspectives\". 14 February 1995, Abbe Museum. == Culture == Penobscot made baskets. They used sweet grass, brown ash, and birch bark. Baskets became more decorative with European trade. For the Penobscot, the lands have spiritual importance. Religion was closely connected to land. The landscape was part of a larger cosmology. Thus, land was very important for the Penobscot. A key figure in legends is Klose-kur-beh (Gluskbe). He gives the Natives practical and spiritual knowledge. He is as old as creation. According to Penobscot cosmology, Gluskbe warned about the greed and lust of white men. Animals and plants also had spiritual elements.Kolodny, Annette (2007). \"Rethinking the \"Ecological Indian\": A Penobscot Precursor\". Interdisciplinary Studies in Literature and Environment. 14 (1): 1–23. doi:10.1093/isle/14.1.1. ISSN 1076-0962. JSTOR 44086555.Kucich, John J. (2011). \"Lost in the Maine Woods: Henry David Thoreau, Joseph Nicolar, and the Penobscot World\". The Concord Saunterer. 19/20: 22–52. ISSN 1068-5359. JSTOR 23395210. Natives converted to Christianity when Europeans arrived. == Maps == Maps showing the approximate locations of areas occupied by members of the Wabanaki Confederacy (from north to south): == References == Category:Native Americans",
 "title": "Penobscot"
}