{
 "id": "949761",
 "text": "The Powhatan people (/ˌpaʊhəˈtæn, ˈhætən/; also spelled Powatan, also known as Virginia Algonquians) are a Native American group historically from eastern Virginia. They were part of the Powhatan Confederacy or Tsenacommacah. The confederacy was made of 30 tribes. They are part of the Northeastern Woodlands culture. Their language is part of the Algonquian language family. Famous people are the chief Powhatan and his daughter Pocahontas. The Powhatans had conflicts with the people of the Jamestown, Virginia settlement. The US government and Virginia recognize several Powhatan tribes. == Tribes == The Powhatan Confederacy was made up of about 30 tribes: Accohanock, Accomac, Cantaunkack, Chepecho, Chesapeake, Chiskiak, Cuttawomans, Kecoughtan, Kiskiack, Mattehatique, Moraughtacund, Mummapacune, Nantaughtacunds, Onaumanients, Opiscopank, Orapaks, Paraconos, Paspahegh, Pataunck, Piankatank, Pissasecs, Portobaccoes, Powchyicks, Quiyoughcohannock, Secacawone, Shamapa, Tappahannocks, Tauxenent, Totas-Chees, Warraskoyack, Werowocomoco, Westmoreland County Appomatux, & Wicocomoco == History == Wahunsenacawh or Powhatan was a famous chief of The Powhatan people. He created the Powhatan Confederacy. The first six tribes included the Powhatan (proper), the Arrohateck, the Appamattuck, the Pamunkey, the Mattaponi, and the Chiskiack. His daughter was the well-known Pocahontas. The Powhatan is also the highest chief. The weroance (leader, commander) was below The Powhatan. The Powhatan people called their land Tsenacommacah (\"densely inhabited Land\"). The British first settled in Jamestown, Virginia in 1607. They were with Captain Christopher Newport. There was conflict right away. John Smith was the first English colonist to see Powhatan. He was a captive of the Powhatan people. According to Smith, Pocahontas saved him. Colonists needed the Powhatans as allies. The colonists needed the Powhtatan for survival and to know the lands.Rountree, Helen C. and E. Randolph Turner III. Before and After Jamestown: Virginia's Powhatans and Their Predecessors. Gainesville: University Press of Florida, 2002. Natives attacked the Jamestown settlement several times.Grizzard, Frank E. (2007). Jamestown Colony: A Political, Social, and Cultural History. Santa Barbara, CA: ABL-CLIO, Inc. pp. Introduction: l-li. ISBN 1-85109-637-X. Conflicts with the colonists included the Anglo–Powhatan Wars (1622-1646). There were three stages to war. Wahunsenacawh died in 1618. With the new chief Opchanacanough, there were more conflicts with colonists. The third and last Powhatan War ended in 1646. Opchanacanough was captured and the Powhatan Confederacy fell. Many Powhatans died from war and European diseases. They were not immune to these diseases. Virginia colonists got black slaves. Slaves that escaped often joined the Powhatans. After Bacon's Rebellion, colonists also enslaved Native Americans.Helen C. Rountree, Pocahontas's People: The Powhatan Indians of Virginia Through Four Centuries, 1990Waugaman, Sandra F. and Danielle Moretti- Langholtz, Ph.D. We're Still Here: Contemporary Virginia Indians Tell Their Stories. Richmond: Palari Publishing, 2006 (revised edition). In the 20th century, Walter Plecker tried to get rid of all Virginian Indian records. All state documents of American Indians in Virginia were lost. Some have called this a \"paper genocide\".Fiske, Warren. \"The Black-and-White World of Walter Ashby Plecker\", The Virginian-Pilot, August 18, 2004 Today, Virginia recognizes eight tribes from the Powhatan people. The Mattaponi and Pamunkey are the only original tribes from the 17th century. Some Powhatans have moved to New Jersey and Delaware. At first, the US Government did not recognize any tribes. In 2018, the Chickahominy, the Eastern Chickahominy, the Upper Mattaponi, the Rappahannock, the Monacan, and the Nansemond tribes got federal recognition. == Related pages == * Powhatan (Native American leader) (the chief) * Tsenacommacah * Pocahontas * Chesapeake Bay * Native Americans in the United States == References == Category:Native Americans",
 "title": "Powhatan people"
}