{
 "id": "949913",
 "text": "Ronald \"Ronnie\" Kray (24 October 193317 March 1995) and Reginald \"Reggie\" Kray (24 October 19331 October 2000), were identical twin brothers, gangsters and convicted criminals from Haggerston. They led organised crime from Bethnal Green in the East End of London, from the late 1950s to 1967. Their gang, \"the Firm\", committed murder, armed robbery, arson, protection rackets and assaults. The Krays, who were homosexual, were protected by two leading homosexuals in Parliament: Robert Boothby (later Lord Boothby), a leading Conservative member, and Tom Driberg, a leading Labour Party member.Barrett, David (26 July 2009). \"Letters shed new light on Kray twins scandal\". Sunday Telegraph. Archived from the original on 29 July 2009. This was at a time when sex between men was still a criminal offence in the UK. The facts were printed in the Sunday Mirror. Although no names were printed, the twins threatened investigating journalists. Boothby threatened to sue the newspaper with the help of Labour Party leader Harold Wilson's solicitor, Arnold Goodman. In the face of this, the Sunday Mirror backed down, sacking its editor, printing an apology and paying Boothby £40,000 in an out-of-court settlement. Because of this, other newspapers were unwilling to expose the Krays' connections and criminal activities. Decades later, Channel 4 established the truth of the allegations and released a documentary on the subject called The Gangster and the Pervert Peer (2009). Eventually, Scotland Yard decided to arrest the Krays, hoping other witnesses would speak once the Krays were in custody. On 8 May 1968, the Krays and 15 other members of the Firm were arrested. It was the longest murder hearing in the history of British criminal justice. Justice Melford Stevenson said of the sentences \"I recommend [they] should not be less than thirty years\". In March 1969, both were sentenced to life imprisonment, with a non-parole period of 30 years for the murders. There right hand man was rayn Linley well known has the big 1 == References == Category:British murderers Category:1960s in the United Kingdom Category:Crime in London",
 "title": "Kray twins"
}