{
 "id": "950424",
 "text": "The Anglo–Powhatan Wars were three wars between the Powhatan People and English colonists of Virginia. The first war went from 1609 to 1614. The second war was from 1622 to 1626. The third war was from 1644 until 1646. The last war ended with the death of Opechancanough. The Powhatan eventually were defeated and lost a lot of land. == Early Conflict == The English settled in Jamestown, Virginia in 1607. The Chief Powhatan wanted the English colonists to leave the land. Captain John Smith was exploring the land. The Powhatan captured him, but he was eventually released. Smith wanted to build several forts close to the Powhatan people. Powhatan tribes attacked English forts in Jamestown, Virginia. Later Powhatans killed Captain John Ratcliffe and several colonists. The English responded with harsh conditions and more violence. == First Anglo-Powhatan War == The first war was from 1609 to 1614. English attacked and mostly destroyed the town of Paspahegh. They killed the queen and several children. The English captured an island from the Arrohattocs. The Appomattoc attacked the English in 1610. In 1611, the English captured Appomattoc. In December 1612, the English attacked Patawomeck and captured Pocahontas. She was the daughter of Powhatan. The Powhatan stopped fighting to get her back. English colonists continued to expand into Weyanoke, Appomattoc, Arrohattoc, and Powhatan territory. The English found Powhatan and created a peace agreement. Pocahantas would marry John Rolfe. This peace lasted for several years. == Second Anglo-Powhatan War == Opechancanough (the younger brother of Powhatan) and his warriors attacked Jamestown in 1622. They killed many colonists. This event was the Jamestown Massacre or Indian massacre of 1622. The English had a quick and strong response. They were allies with the Accomac and Patawomeck. These tribes provided corn. The English attacked the Chickahominy, Appamattoc, Nansemond, Warraskoyack, Weyanoke, and Pamunkey. Opechancanough asked for peace. However, the English tricked and poisoned the Natives. The colonists had a shortage of gunfire from 1625-1626. The English attacked several tribes again in Summer 1627. There was a short time of peace in 1628. However, fighting continued until 1632. The English colonists expanded their land more. The English also created a fence barrier (palisade) to stop Native attacks. == Third Anglo-Powhatan War == There were ten years of peace before the third war. Opechancanough led the fight this time in 1644. He and his men killed many colonists. Governor William Berkeley led an attack to capture Opechancanough. The English were successful. Opechancanough was killed in captivity in October 1646. Necotowance had replaced him as chief of the Powhatan Confederacy. == Treaty of 1646 == The General Assembly of Virginia and Necotowance signed a peace treaty in October 1646. Natives had to give payments to the Virginia governor. The English created a frontier line. It racially separated Naives from English. The treaty also expanded English land. == Related pages == * Virginia Colony * Powhatan People * Northeastern Woodlands * Native Americans in the United States == References == Category:History of Native Americans Category:17th century in the Thirteen Colonies Category:Wars involving North America Category:17th-century conflicts",
 "title": "Anglo-Powhatan Wars"
}