{
 "id": "950577",
 "text": "Togo Anthony Palazzi (August 8, 1932 – August 12, 2022) was an American basketball player. He played in the National Basketball Association (NBA) for the Boston Celtics and Syracuse Nationals between 1954 to 1960. == Life == Palazzi was born in Union City, New Jersey.Palazzi went to Union Hill High School. He was one of the best high school basketball players in the country.Doyle, Bill. \"Togo Palazzi a 'coach, mentor, friend'\", Telegram & Gazette, February 14, 2015. Accessed November 26, 2019. \"Palazzi was named one of the top five high school players in the nation when he played for Union Hill High School in Union City, N.J., the same hometown as his future HC teammates Earle Markey and Tommy Heinsohn.\" He played college basketball at the College of the Holy Cross in the 1950s. He was the captain of the team. In 1954, his team won the NIT Championship and Palazzi was named the best player of the tournament. In 1954, the Boston Celtics picked Palazzi in the NBA draft. He was the fifth overall pick. He played six seasons in the NBA with the Boston Celtics and the Syracuse Nationals. He scored an average of 7.4 points per game. From 1960 to 1962, Palazzi played for the Scranton Miners in the Eastern Professional Basketball League. In 1961, he was chosen for the All-EPBL Second Team. He was also the head coach of the team in the 1960–61 season. That season, the team won 11 games and lost 7. Palazzi later coached the Holy Cross women's basketball team from 1980 to 1985. The team won 103 games and lost 28 during that time. In his last year, he helped the team reach the NCAA Women's Division I Basketball Tournament for the first time. Palazzi died on August 12, 2022, four days after his 90th birthday.Per the Celtics, Boston alumnus Togo Palazzi has passed away at the age of 90 ==References== Category:1932 births Category:2022 deaths Category:Boston Celtics players Category:Philadelphia 76ers players Category:Sportspeople from New Jersey Category:People from Union City, New Jersey",
 "title": "Togo Palazzi"
}