{
 "id": "950614",
 "text": "The Oneida people (autonym: Onʌyoteˀa·ká·, Onyota'a:ka) are a Native American and First Nation tribe. They were part of the Iroquois Confederacy. Their name means \"People of the Standing Stone\".Rudes, B. Tuscarora English Dictionary Toronto: University of Toronto Press, 1999 The Oneida, Mohawk, Onondaga, Cayuga, and Seneca were the first tribes of the Iroquois Confederacy. The Oneida lived in upstate New York and around the Great Lakes. There are four tribes today. The US government recognizes the Oneida Indian Nation in New York and the Oneida Nation in Green Bay, Wisconsin. Canada recognizes the Six Nations of the Grand River and Oneida Nation of the Thames in Ontario, Canada. == History == The Oneida had large amounts of land before colonists came. The Oneida and the Iroquois Confederacy had to give up lands in several treaties with the United States. These treaties created new boundaries for Native lands. The Iroquois signed Treaties of Fort Stanwix in 1764 and 1784. In these treaties, the Iroquois had to give up lands in Pennsylvania, Kentucky, West Virginia, and New York. The Oneida people are known for supporting the Americans in the American Revolution. Oneida were first neutral during the American Revolution. Most eventually supported the Americans. The Mohawks supported the British and attacked the Oneida. Polly Cooper helped American troops at Valley Forge. Chief Skenandon and his people brought food to the troops in 1777. After the war, the Iroquois got back lands in the Treaty of Canandaigua (1794). This treaty created peace and friendship between the United States and the Iroquois. However, the Americans took back these lands. They had contact with Quakers in New York. The Oneida broke up into groups. There were disagreements with Quakers about lands and missions.Tiro, Karim M. “‘We Wish to Do You Good’: The Quaker Mission to the Oneida Nation, 1790-1840.” Journal of the Early Republic26, no. 3 (2006): 353–76. http://www.jstor.org/stable/30043429. In the early 19th century, the Oneida did not have land and moved to Wisconsin. Chief Daniel Bread helped with the Treaty in Wisconsin (1838). == Culture == The main food was corn (agriculture). The tribe farmed the Three Sisters (corn, beans, squash). There were different foods for different seasons. Fall foods included dried fruits, nuts, wild rice. They ate more fatty foods before the winter. Meats included deer, geese, duck and raccoon. In the spring Oneida ate wild onions, leeks, milkweeds, dandelions and maple candy. They also did fishing in the spring. The summer foods included fruits like strawberries, blackberries, raspberries, blueberries, pears, plums, peaches, apples, and grapes. The tribe lived in longhouses. There were about 60 to 100 longhouses in the Oneida Nation. There were individual clans. The three clans of the Oneida Nation are turtle, wolf, and bear. The Oneida nation had a tribal council. Mothers played an important role in decisions. The Oneida were matrilineal. This means descent and family was through the mother. Men did hunting and fishing. Women prepared food, cooked and cleaned. Clothing had meaning in the Oneida culture. Clothing included clan symbols. Oneida wore animal skins. When European settlers came, they wore more cotton and cloths clothing. Women wore headbands with many beads. Men wore a kastoweh or feathered hat. The tribe had social and ceremonial dancing. Social dancing was public. Examples included round dance, rabbit dance, old moccasin dance and canoe or fishing dance. Ceremonial dancing was sacred and more private. Ceremonial dances included Maple Syrup, Strawberry, Bean, Sun and Moon dances. Ceremonial dancing included singing. == Related pages == * Iroquois * Indigenous peoples of the Northeastern Woodlands * Native Americans in the United States == References == Category:Native Americans",
 "title": "Oneida people"
}