{
 "id": "950994",
 "text": "CableCARD is a special PC Card device. It allows consumers in the United States to view and record digital cable television channels on digital video recorders and personal computers. It is also done in television sets on equipment such as a set-top box not provided by a cable television company. The card is generally provided by the local cable operator, typically for a nominal monthly fee. A 2020 FCC decision removed the requirement for cable companies to provide CableCARDs. However they are still required to provide consumer access options via \"separable security\". == Technical overview == CableCARD is a term trademarked by CableLabs for the Point of Deployment (POD) module defined by standards including SCTE 28, SCTE 41, CEA-679 and others. The physical CableCARD is inserted into a slot in the host (typically a digital television set or a set-top box) in order to identify and authorize the customer. It is also to provide decoding of the encrypted digital cable signal without the need for a proprietary set-top box. The cable tuner, QAM demodulator, and MPEG decoder are part of the host equipment. . Interactive features such as video on demand depends on the CableCARD Host device being an OpenCable Host Device. They have nothing to do with the physical card. This makes the common use of the phrase \"CableCARD 2.0\" as a requirement for video on demand misleading. === Physical CableCARDs === The physical CableCARD is a PC Card type II. It handles decryption of video. It also ensures that only authorized subscribers may view it. This is also known as a \"conditional- access module\" function. No actual M-Cards were released before the introduction of CableCARD 2.0, which combined and enhanced the CableCARD 1.0 and Multi-Stream standards. === CableCARDs with personal computers === Integrated cable set-top boxes perform four basic functions: * Enable receiving and selecting digital and analog cable channels * Uniquely identify the customer and authorize the features to which they have subscribed * Decode scrambled digital channels and premium programming such as movie channels * Provide interactive two-way communications for electronic program guides, pay- per-view, video on demand, or switched video streams New digital televisions and other devices that are labeled DCR (Digital cable ready) contain: * Built- in support for receiving digital cable channels (via an internal QAM tuner) * A slot for the current version of CableCARD, which allows decryption of encrypted digital channels == Adoption outside in US == CableCARDs were adopted outside the United States, only in South Korea, in pair with Nagravision and VideoGuard conditional access (CA) systems. U.S. adoptions of CableCARD were mostly paired with Cisco's PowerKEY (originally developed by Scientific Atlanta) and Motorola's (now Arris) MediaCipher CA systems. == References == == Further reading == * * * * * == Other websites == * Category:Cable television Category:History of technology",
 "title": "CableCARD"
}