{
 "id": "951133",
 "text": "The Lliga Nacional de Fútbol, also known as Primera Divisió (First Division) or Campionat de Lliga, is the top football league of Andorra. ==History== The league was established in 1995 through the local federation (Andorran Football Federation). Till that year the clubs played since 1970 an amateur league without any contact to a official institution.. The league joined UEFA and FIFA in 1996 so the Andorran clubscan play in the UEFA competitions. Until 2015 the league was known as Lliga Grup Becier and during 2016 Lliga Grup Sant Eloi. 2017 it was renamed as Lliga Multisegur Assegurances for sponsorship reasons. All the teams in the league play in the six stadiums owned by the federation. That also happens in all other Andorran competitions, such as Copa Constitució and Andorran Supercup. == Titels == * FC Santa Coloma (12) * CE Principat, Inter Club d'Escaldes (3) * FC Encamp, FC Lusitanos, FC Rànger’s, UE Sant Julià (2 ) * Constel·lació Esportiva (1 ) ==2022-23 clubs== Team Parish Inter Club d'Escaldes Escaldes-Engordany FC Santa Coloma Andorra la Vella UE Engordany Escaldes-Engordany UE Sant Julià Sant Julià de Lòria UE Santa Coloma Andorra la Vella Atlètic Club d'Escaldes Escaldes-Engordany FC Ordino Ordino Penya Encarnada Andorra la Vella Flashscore ==Stadiums== The Andorran Football Federation organizes the matches of Primera Divisió and Segona Divisió in the stadiums owned by the local federation. Also the federation distributes the stadiums and fields for the training sessions for each team. Since the 2016–17 season, FC Encamp is the only club that has its own stadium (✚), located in Prada de Moles (Camp de Futbol d'Encamp). Until 2016 the Camp d'Esports d'Aixovall hosted former matches of Primera Divisió and Segona Divisió. Stadium Location Capacity Centre Esportiu d'Alàs Alàs i Cerc (Spain) 1,500 Estadi Comunal d’Andorra la Vella Andorra la Vella 1,300 Centre Esportiu d'Ordino Ordino 200 Centre d'Entrenaments Andorra la Vella 300 CE La Massana La Massana 300 Camp de Futbol d'Encamp (✚) Encamp 550 ==References== Category:1995 establishments in Europe Category:Football leagues in Andorra",
 "title": "Primera Divisió"
}