{
 "id": "951180",
 "text": "Liger is a 2022 Indian sports action movie. It was written and directed by Puri Jagannadh. Liger theatrically released on 25 August 2022. ==Plot== After his father Lion Balram's death in the MMA National Championship, Liger and his mother Balamani move to Mumbai from Banaras/Karimnagar. Balamani is determined to turn Liger into a MMA champion and takes him to a coach named Christopher, who trains him. While Liger is on his way to getting perfect in this sport, he meets Tanya and falls in love with her. After learning from her brother Sanju that Liger has a stammering problem, Tanya leaves him. Liger wins the national championship after getting motivated by his rejection. Liger moves on to participate in the International Championship, sponsored by Tanya's Father. Liger wins every match and moves on to the finals. However, Tanya is kidnapped days before the finals and when confronted, Tanya's father reveals that he borrowed money from a gangster to set up his business, and remains helpless. Liger decides to save Tanya himself which ultimately causes him to miss his finals, where he stumbles across the person who kidnaped Tanya, Mark Henderson, whom Liger admires for his greatness, but challenges him to a fight in order to get Tanya. The fight was being streamed live at the MMA Finals. When Liger is on the verge of losing, he remembers the advice that Balamani gave and defeats Mark. Mark takes a picture with Liger and Tanya, where Liger becomes an international level MMA Fighter. == Cast == * Vijay Deverakonda as Liger * Ananya Panday as Tanya * Ramya Krishnan as Balamani * Ronit Roy as Christopher, MMA coach * Vishu Reddy as Sanju * Ali as Ali Bhai * Makarand Deshpande * Getup Srinu as Ganpath * Chunky Panday as Tanya's father * Mike Tyson as Mark Henderson (extended cameo appearance) ==Music== == References == == Other websites == * Category:2022 action movies Category:2020s sports movies Category:2020s Indian movies Category:Hindi-language movies Category:Telugu-language movies",
 "title": "Liger (movie)"
}