{
 "id": "951379",
 "text": "The Schübler Chorales are a set of chorale preludes written by Johann Sebastian Bach. They are numbered BWV 645 to BWV 650 in the Bach-Werke- Verzeichnis catalogue. The set is named after Johann Georg Schübler, who published them in 1748 or 1749. Five of the preludes are arrangements of movements in Bach's cantatas. One prelude (BWV 646) does not have a matching cantata movement. == Preludes == === Wachet auf, ruft uns die Stimme, BWV 645 === Wachet auf, ruft uns die Stimme, BWV 645 is based on the fourth movement of Wachet auf, ruft uns die Stimme, BWV 140. The hymn tune is Wachet auf, ruft uns die Stimme. It was originally written for tenors, violins and violas playing in unison, and basso continuo. The tenor voices sing the hymn tune. === Wo soll ich fliehen hin, or Auf meinen lieben Gott, BWV 646 === Wo soll ich fliehen hin, or Auf meinen lieben Gott, BWV 646 does not have a matching cantata movement. The hymn tune is Wo soll ich fliehen hin, or Auf meinen lieben Gott. It is commonly thought to be based on a lost cantata's movement. However, Alfred Dürr thought that it is based on another chorale prelude, BWV 694. === Wer nur den lieben Gott lässt walten, BWV 647 === Wer nur den lieben Gott lässt walten, BWV 647 is based on the fourth movement of Wer nur den lieben Gott läßt walten, BWV 93. The hymn tune is Wer nur den lieben Gott läßt walten. It was originally written for soprano and alto soloists, violins and violas playing in unison, and basso continuo. The violins and violas play the hymn tune. === Meine Seele erhebt den Herren, BWV 648 === Meine Seele erhebt den Herren, BWV 648 is based on the fifth movement of Meine Seel erhebt den Herren, BWV 10. The hymn tune is Meine Seele erhebt den Herren. It is also known as the German Magnificat. It was originally written for alto and tenor solists, oboes and a trumpet playing in unison, and basso continuo. The oboes and trumpets play the hymn tune. === Ach bleib bei uns, Herr Jesu Christ, BWV 649 === Ach bleib bei uns, Herr Jesu Christ, BWV 649 is based on the third movement of Bleib bei uns, denn es will Abend werden, BWV 6. The hymn tune is Ach bleib bei uns, Herr Jesu Christ. It was originally written for soprano singers, violoncello solo, and basso continuo. The sopranos sing the hymn tune. === Kommst du nun, Jesu, vom Himmel herunter, BWV 650 === Kommst du nun, Jesu, vom Himmel herunter, BWV 650 is based on the second movement of Lobe den Herren, den mächtigen König der Ehren, BWV 137. The hymn tune is Kommst du nun, Jesu, vom Himmel herunter. It was originally written for alto singers, violin solo, and basso continuo. The altos sing the hymn tune. == References == == Other websites == * * Audio files of BWV 645, BWV 646, BWV 647, BWV 648, BWV 649 and BWV 650 performed by James Kibbie on the 1724–30 Trost organ in the Stadtkirche, Waltershausen, Germany Category:Compositions by Johann Sebastian Bach Category:Solo organ pieces",
 "title": "Schübler Chorales"
}