{
 "id": "951733",
 "text": "Plants vs. Zombies 2: It's About Time is a tower defense game developed by PopCap Games and published by Electronic Arts. The game is a sequel to the original Plants vs. Zombies and was released for iOS on July 9, 2013. The game was later ported to other platforms including Android, Windows Phone, Windows 8.1, and BlackBerry 10. == Gameplay == In Plants vs. Zombies 2, the player takes on the role of Crazy Dave, who uses a time machine to travel back in time and prevent the zombies from eating his brain. The game is divided into several different eras, each taking place in a different time period, such as Ancient Egypt, the Wild West, and the Future. The gameplay in Plants vs. Zombies 2 is similar to that of the original game, with players using a variety of different plants to defend against waves of zombies. However, the game introduces new features such as plant food, which can be used to give plants temporary boosts, and power-ups, which can be used to defeat large groups of zombies. The game also features new zombie types, each with their own unique abilities and weaknesses. For example, the Pirate Zombie can steal plants and carry them to the back of the lawn, while the Chicken Wrangler Zombie can release a swarm of zombie chickens. == Reception == Plants vs. Zombies 2 was generally well-received, with critics praising the game's graphics, gameplay, and overall presentation. However, the game was criticized for its use of microtransactions and the difficulty of some of the later levels. Despite these criticisms, Plants vs. Zombies 2 has maintained a large player base and has been updated regularly with new content and features. == Sequels and Spin-offs == Following the success of Plants vs. Zombies 2, several sequels and spin-offs have been released, including Plants vs. Zombies: Garden Warfare, Plants vs. Zombies: Garden Warfare 2, Plants vs. Zombies Heroes and Plants vs. Zombies 3. == Other websites == * Plants vs. Zombies 2 official website * Category:2013 video games Category:Electronic Arts video games Category:Android (operating system) games Category:Free-to- play video games Category:IOS games Category:Single-player video games Category:Video game sequels Category:Video games about plants Category:Video games about time travel Category:Video games developed in the United States",
 "title": "Plants vs. Zombies 2"
}