{
 "id": "951804",
 "text": "Schweigt stille, plaudert nicht, BWV 211, also known as the Coffee Cantata, is a cantata by Johann Sebastian Bach. Unlike most of his other cantatas, it is not a religious cantata. It is a cantata about coffee. == History == Bach was the leader of the collegium musicum in Leipzig. He performed concerts in Café Zimmermann, a coffeehouse in Leipzig. The text of the cantata was published by Picander in 1732. Bach may have written the music around 1734. In Bach's time, coffee was expensive. People also thought that drinking coffee was not a good thing. == Plot == The cantata begins with the narrator telling the audience to be quiet. Schlendrian enters with his daughter, Liesgen. He is angry because Liesgen likes to drink coffee. Schlendrian threatens to take away everything from Liesgen if she does not stop drinking coffee. Liesgen does not care. Finally, Schlendrian threatens that Liesgen will never get a husband if she does not stop drinking coffee. Liesgen promises to stop drinking coffee. Schlendrian leaves to find Liesgen a husband. Liesgen secretly says that her new husband must allow her to make her coffee whenever she wants. The narrator, Liesgen, and Schlendrian sing a closing chorus together. == Structure == The cantata is written for soprano (as Liesgen), tenor (as the narrator), and bass (as Schlendrian) soloists, a flute, two violins, and basso continuo. It has ten movements. Bach never wrote an opera in his life. Even so, the cantata can be thought of as a mini-opera. # Recitative: # Aria: # Recitative: # Aria: # Recitative: # Aria: # Recitative: # Aria: # Recitative: # Chorus: == References == == Other websites == * Schweigt stille, plaudert nicht, BWV 211: performance by the Netherlands Bach Society (video and background information) * * Schweigt stille, plaudert nicht: history, scoring, Bach website * BWV 211 Schweigt stille, plaudert nicht: English translation, University of Vermont * Bach Cantata Translations : German libretto with parallel English translation by Pamela Dellal Category:Cantatas by Johann Sebastian Bach",
 "title": "Schweigt stille, plaudert nicht, BWV 211"
}