{
 "id": "952676",
 "text": "The Central Bureau of Investigation (known by it's acronym, CBI) is the investigating agency of India. It operates under the jurisdiction of the Ministry of Personnel, Public Grievances and Pensions. It was originally set up in 1965 to investigate bribery and governmental corruption. It also receives expanded jurisdiction to investigate breaches of central laws enforceable by the Government of India, multi-state organised crime, or international cases. The agency has been known to investigate several economic crimes, special crimes, cases of corruption and other cases. CBI is India's officially designated single point of contact for liaison with the Interpol. The headquarters of CBI is located in CGO Complex, near Jawaharlal Nehru Stadium in New Delhi, India. == Organisation == The CBI is headed by a director. The director must be an Indian Police Service (IPS) officer with a rank of Director General of Police. Other ranks in the CBI which may be staffed by the IRS (Indian Revenue Service) officer and the IPS are:- # Special Director, # Additional Director, # Joint Director, # Deputy Inspector General of Police, # Senior Superintendent of Police, # Superintendent of Police, # Additional Superintendent of Police, # Deputy Superintendent of Police. Inspector, Sub-Inspector, Assistant Sub-Inspector, Head constable, Constable are non-gazetted officers. They are recruited through SSC or through deputation from Police, Income Tax Department and Customs Department. == Criticism == === Corruption === In 2013, Judge of the Supreme Court of India (and later Chief Justice of India) R. M. Lodha criticized the CBI for being a \"caged parrot speaking in its master's voice\". This is due to its too much political interference ignoring of which party comes to be in power. Because of the CBI's political overtones, it has been exposed by former officials such as Joginder Singh and B. R. Lall (director and joint director, respectively) as engaging in nepotism, wrongful prosecution and corruption. In Lall's book, Who Owns CBI, he details how investigations are manipulated and derailed. Corruption within the organisation has been revealed in information obtained under the RTI Act, and RTI activist Krishnanand Tripathi has alleged harassment from the CBI to save itself from exposure via RTI. The states that have withdrawn consent to the CBI have accused the CBI of being a tool used by the Union Government to unfairly target parties ideologically rival to them. === Political interference === Generally, cases assigned to the CBI are sensitive and of national importance. It is standard practice for state police departments to register cases under its jurisdiction. If necessary, the central government may transfer a case to the CBI. The agency has been criticised for its mishandling of several scams. It has also been criticized for dragging its feet investigating prominent politicians, like P. V. Narasimha Rao, Jayalalithaa, Lalu Prasad Yadav, Mayawati, Mulayam Singh Yadav and many more. == Sources == == Other websites == * * Category:Government agencies of India",
 "title": "Central Bureau of Investigation"
}