{
 "id": "952988",
 "text": "Phyllodytes is a genus of frogs. They are called heart-tongued frogs in English. These frogs live in eastern Brazil. ==Taxonomy== In 2009, scientists DNA from all the frogs in this group. They decided to split Phyllodytes into Phyllodytes and another group, Phytotriades. This article shows the frog species that are still in Phyllodytes. Some scientists think that some of these frogs should be in other groups instead. ==Description== These are small frogs. They live in trees. These frogs lay eggs in water in the leaves of bromeliad plants. These plants are epiphytes: they grow on trees instead of putting their roots in the ground. For example, a bromeliad might grow on a branch high in the forest canopy. Water falls into the bromeliad leaves and forms a little pool near the plant's axil. Many female frogs lay their eggs on the leaves so that the tadpoles fall into the water when they hatch. The tadpoles swim and grow inside the bromeliad plant without ever going to a river, stream, pond, or the ground. The frogs have large fangs called odontoids. Male Phyllodytes do vocalize, in contrast to Phytotriades. ==Species== This genus has 14 species in it: Binomial name and author Common name Phyllodytes acuminatus Alagoas heart-tongued frog Phyllodytes amadoi Phyllodytes brevirostris Alhandra heart-tongued frog Phyllodytes edelmoi Phyllodytes gyrinaethes Phyllodytes kautskyi Brazilian heart-tongued frog Phyllodytes luteolus yellow heart-tongued frog Phyllodytes maculosus Phyllodytes megatympanum Phyllodytes melanomystax Bahia heart-tongued frog Phyllodytes praeceptor Phyllodytes punctatus Phyllodytes tuberculosus Maracas heart-tongued frog Phyllodytes wuchereri AmphibiaWeb says Phytotriades auratus is in this genus, but other scientific works do not. ==References== ==Other websites== * taxon Phyllodytes at http://www.eol.org. * Taxon Phyllodytes at https://www.itis.gov/index.html. * Taxon Phyllodytes at http://data.gbif.org/welcome.htm Category:Frogs of South America",
 "title": "Phyllodytes"
}