{
 "id": "952981",
 "text": "The Neutral Confederacy (also Neutral Nation, Neutral people, or Attawandaron by neighbouring tribes) were a Native American people. They spoke the Neutral Huron Language. This language is part of the Iroquois language family. They lived in present-day southwestern and south-central Ontario in Canada, North America. The Neutral people were related to other Iroquois Natives. Neighbors were the Huron people, the Petun, the Wenro to the east, Erie people, the Susquehannock and the Iroquois Confederacy. The Iroquois Confederacy was east of the Neutral people. The Iroquois eventually destroyed the Neutral Confederacy. == Name == The Neutrals called themselves Chonnonton, or 'people of the deer'.Noble, William C. \"The Neutral Confederacy\". Retrieved August 19 2022. The French called these people neutral, because they were not in many wars. For instance, the Neutral people did not fight in the wars between the Iroquois and the Huron in the 17th century.Reville, F. Douglas. (1920). The History of the County of Brant. Brantford: Hurley Printing Company., p. 15. == History == Jesuits had contact with the Neutrals and made records of the people. The Neutral allied with the Wenrohronon to defend against the Iroquois Confederacy. However, the Iroquois attacked the Neutral people around 1650.Reville, F. Douglas. (1920). The History of the County of Brant. Brantford: Hurley Printing Company., p. 20. The Iroquois had also destroyed the Huron, Petun and Erie Nations.Brown, Craig (2012). Illustrated History of Canada. McGill-Queen's Press - MQUP. p. 110. ISBN 9780773587885. The Neutral Confederacy fell apart after the 1650s. They fled or joined other Iroquois nations. Many Natives also died from diseases.Editor: Alvin M. Josephy, Jr., by The editors of American Heritage Magazine (1961). pages 180-211 (ed.). The American Heritage Book of Indians. American Heritage Publishing Co., Inc. LCCN 61-14871 == Culture and Society == The Neutral people lived in longhouses. They did hunting, fishing and farming. Main crops were the Three Sisters (corn, squash and beans). Meats included deer, raccoon, wolves, wild cats, squirrels, beavers and turkeys. Apples and chestnuts were also part of the diet. Feast of the Dead was an important ceremony. In this feast, they placed the bones of the dead in a common grave. Tsouharissen or Souharissen (\"Child of the Sun\") was chief of several villages of the Neutral people. The Neutrals used stones to make spearheads and arrowheads. They traded maize, tobacco, and black squirrel and furs for steel axes, glass beads, cloaks, conch shells, gourd containers, and firearms.Kehoe, Alice Beck (2017). North American Indians: A Comprehensive Account. Routledge. ISBN 9781351219969. == Archaeology == There has been much archaeological research since the 19th century. Several sites of the Neutral people have been explored. These include various sites in Ontario. An example is the Southwold Earthworks. == Related pages == * Iroquois * Iroquoian languages * Indigenous peoples of the Northeastern Woodlands * First Nations == References == Category:Native Americans",
 "title": "Neutral Nation"
}