{
 "id": "952920",
 "text": "The Narcotics Control Bureau ( NCB) is an law enforcement and intelligence agency. Its jurisdiction is under the Ministry of Home Affairs, Government of India. The agency is tasked with fighting drug trafficking and the use of illegal substances under the provisions of Narcotic Drugs and Psychotropic Substances Act. It was established in 1986. It is responsible for coordination with the Indian state governments and other central departments, implementation of India's international obligations with regard to drug trafficking, and helping international and foreign drug law enforcement agencies. == Organisation == The Narcotics Control Bureau's national headquarters is located in Delhi, the national capital. Its field units and offices are located in Mumbai, Indore, Kolkata, Delhi, Chennai, Lucknow, Jodhpur, Chandigarh, Jammu, Ahmedabad, Bengaluru, Guwahati and Patna. The Director General of NCB is mostly an officer from the Indian Police Service (IPS) or the Indian Revenue Service (IRS). Apart from the direct feeder grade, officers in this organisation are also drawn from Indian Revenue Service, Indian Police Service and other Paramilitary forces. NCB is affiliated to Home Ministry. It was made responsible for administering The Narcotic Drugs and Psychotropic Substances Act, 1985. The NCB is outside the ambit of the Right to information Act under Section 24(1) of the RTI act 2005. == Functions == The main purpose of the Narcotics Control Bureau is to fight drug trafficking on an all-India level. It works in close cooperation with the Customs and Central Excise/GST, State Police Department, Central Bureau of Investigation (CBI), Central Economic Intelligence Bureau (CEIB) and other Indian intelligence and law enforcement agencies both at the national and states level. The NCB also provides resources and training to people who work for India's Drug Law Enforcement Agencies in fighting drug trafficking. The NCB also watches India's borders to find places where smuggling activities take place with foreign traffickers. == Related pages == * Central Bureau of Investigation, anti organised crime which are international, multi-state or multi-agency * Enforcement Directorate, anti economic crimes * National Investigation Agency, anti terrorism == Sources == Category:Government agencies of India Category:Intelligence agencies",
 "title": "Narcotics Control Bureau"
}