{
 "id": "953168",
 "text": "Ely Samuel Parker (1828 – August 31, 1895), born Hasanoanda (Tonawanda Seneca), later known as Donehogawa was a Native American of the Seneca tribe. He became the first Commissioner of Indian Affairs. He was also a U.S. Army officer, engineer, and tribal diplomat. He spoke English and the Seneca language. He was friends with the anthropoloigsist Lewis Henry Morgan. == Life and career == Parker was born in 1828 at Indian Falls, New York. This was a Seneca Reservation at Tonawanda. His parents were Elizabeth and William Parker. His original name was Ha-sa-no-an-da, but his name was later changed to Ely Parker. He was educated at a Baptist Mission school. For several years, Parker worked at a legal firm in New York. Early on, Parker met scholars like Lewis Henry Morgan, Henry Rowe Schoolcraft, and John Wesley Powell. They were studying ethnology and anthropology. Parker eventually became friends with Lewis Henry Morgan. Morgan helped Parker to study engineering at Rensselaer Polytechnic Institute in Troy, New York. Parker was a civil engineer until the American Civil War. He helped update the Erie Canal.Steven Conn, History's Shadow: Native Americans and Historical Consciousness in the Nineteenth Century, Chicago: University of Chicago Press, 2004, p.210 Parker became a Seneca chief or sachem in 1852.Dee Brown, Bury My Heart at Wounded Knee. 1970. ISBN 0-330-23219-3 Parker fought and served in the American Civil War. He raised an Iroquois military unit to fight for the Union. He only became a captain of this unit in 1863. He became the assistant of Ulysses S. Grant. This was when Grant became commander of the Military Division of the Mississippi. Parker was later secretary to Ulysses S. Grant. Parker was present at the surrender of the Confederates at Appomattox. He wrote the surrender documents. Parker was a military officer and secretary after the war. He resigned from the army in 1869.Parker, Arthur (1919). The Life of General Ely S. Parker. Buffalo Historical Society. p. 154. \"The Life of General Ely S. Parker, by Arthur Parker.\" Later President Ulysses S. Grant appointed Parker as the first Commissioner of Indian Affairs in 1871. Parker also served as interpreter and diplomat for Seneca chiefs. He helped with treaties between the Seneca and the United States. == Personal Life and Death == Parker married Minnie Orton Sackett (1849–1932) in 1867. They had one daughter, Maud Theresa Parker (1878–1956).Hoxie, Frederick E. (1996). Encyclopedia of North American Indians. Houghton Mifflin Company. p. 467. ISBN 0-395-66921-9. After retiring, Parker lived the rest of his life in poverty. He died on August 31, 1895. He is buried at Forest Lawn Cemetery in Buffalo, New York.Adams, James Ring (Fall 2011), \"The Many Careers of Ely Parker\", National Museum of the American Indian, pp. 30–31 == Related pages == * Seneca people * Arthur C. Parker * Ulysses S. Grant * Iroquois * American Civil War == References == Category:1828 births Category:1895 deaths Category:Native American people",
 "title": "Ely S. Parker"
}