{
 "id": "953391",
 "text": "The Numtums is a British computer-animated children's television series. It was created by Barry Quinn for CBeebies. ==Characters== ===The Numtums=== * Stanley \"Stan\" Carlin (also known as Zero) is a shapeshifting Numtum in his yellow number zero. He appears in series one. * Bendy Go \"Ben\" Jarewood (also known as Zero) is the tallest Numtum in his green number one. * Darcy \"Dar Dar\" Jarewood (also known as Zero) is skateboarder Numpup in her pink number two. * Champer \"Champy\" Viceburg (also named Three) is the highest jumper in his yellow number three. * Gladdy Peterson (also known as Four) acts as the parental figure of the Numpups in her blue number four. She likes neatness. * Little Sandy Indicineburg (also known as Five) is the smartest Numpup, and a scientist in her pink number five. * Flord \"Flinders\" Eriwood (also known as Six) is a very old Numtum and gives the Numpups adventures in his green number six. * Humpty Do Indicineburg (also known as Seven) is the hungriest Numpup in his light blue number seven. * Karin \"Coogee\" Umbuson (also known as Eight) is a baby Numpup in her golden number eight. * Toby \"Hobart\" Geridwood (also known as Nine) is a very talented dancing Numtum in his yellow number nine. * Nimbin \"Nimby\" Jackson (also known as Ten) is a painting Numtum in her purple number ten. * Super Numtum is a superhero Numtum in his clear enclosing square. ===Other animals=== * Billy the Hedgehog is an indigo hedgehog. He is the coolest animal in the Gumnut Gorge. He appears in series two and three. * Larry the Lyrebird is a lyrebird. He appears in series two and three. * The Flamingos live in the Gumnut Gorge and need the Numtums to get them in order. * F.T. \"Fluffy\" McTuffy the Koala is a koala. She is Super Numtum's enemy with plans for world domination. * Frilly Lizzie the Frilled Lizard is a frilled lizard. He is Fluffy's smart, timid, silent and somewhat stoic henchman. ==Production== The Numtums was animated by Beakus in series one and A Productions in series two and three. Series one was aimed at toddlers, but series two and three were revamped for an older audience and introduced more complex concepts such as subtraction, shape recognition and numbers from eleven to twenty with computer animation, and using a more Australian theme. The creator Barry Quinn said in an interview that \"we were looking at doing a show about numbers for the early years and an educational expert told us bright, cute characters were a good way to get kids interested.\" A lot of animal names were suggested but he settled on numbats who had 'num' in their name. ==Episodes Include== ===Series 1 (2012)=== # Episode Name Original Airdate 1 Number One 2 Number Two 3 Number Three 4 Number Four 5 Number Five 6 Number Six 7 Number Seven 8 Number Eight 9 Number Nine 10 Number Ten 11 More Number One 12 More Number Two 13 More Number Three 14 More Number Four 15 More Number Five 16 More Number Six 17 More Number Seven 18 More Number Eight 19 More Number Nine 20 More Number Ten 21 Animals 22 Clothes 23 Vehicles 24 Food 25 Games ===Series 2 (2014)=== # Episode Name Original Airdate 26 Very Fast Food 27 You Can Do It, Humpty Do! 28 School Of Cool 29 Numbot 30 The Quest For The Hooded Paw 31 Unstuck With A Stick 32 Termite Takeaway 33 Painting By Numtums 34 Tum Tum Tap Tap 35 Faster, Higher, Funnier 36 Tent-o-saurus 37 Hoedown Havoc 38 Numpups Can't Fly 39 Beak Of The Week 40 Koala On The Loose 41 Larry's Takeaway Trial 42 Treasure Trail 43 The Mysterious Land Beyond Ten 44 Little Sandy's Rocket 45 Don't Forget To Remember 46 The Search For The Five Keys 47 Cafe Chaos 48 Billy And Champer's Big Adventure 49 Humpty Do's Zoo 50 Picture Perfect 51 You've Missed Your Cue, Humpty Do ===Series 3 (2014)=== # Episode Name Original Airdate 52 Feet Don't Fail Me Now 53 Switcheroo 54 Larry Gets the Hiccups 55 Hunt for the Golden Treat 56 Gladdy's Special Birthday 57 Numpup Nursery 58 Gladdy's Secret Recipe 59 Larry and Billy's Dance Game 60 Yo Ho Bendy Go 61 Humpty Do, What about You? 62 Has anyone seen Hobart 63 Never Fear, Nimbin's Here! 64 The Great Hobarto's Magic Act 65 Finding Neddy 66 Find Those Flamingos 67 Running Like Clockwork 68 Little Sandy's Big Bug Hunt 69 The Great Numpup Rally 70 Dar Dar's Not So Lucky Flower 71 Hobart's Hand Bells 72 The Drumtums 73 Rules Are Rules 74 Flinder's First Sunset 75 Champer Loses His Bounce 76 The Best Hobart Ever 77 Flinders' Big Adventure ==Broadcast== The Numtums debuted on CBeebies in the United Kingdom on 27 February 2012 on the channel's Love to Learn block. The series aired on ABC3KIDS in Australia and New Zealand. ==References== ==Other websites== * * * on Beakus * on A Production Category:British animated television series",
 "title": "The Numtums"
}