{
 "id": "953401",
 "text": "San Clemente Literary Prize, complete name Archbishop Xoán de San Clemente Prize,O Instituto de bacharelato Rosalía de Castro celebra a vixésima edición do premio literario Arcebispo Xoán de San Clemente , nova na CRTVG. commercially known as San Clemente Rosalía-Abanca Prize, is an award with a financial endowment that is given annually in Santiago de Compostela and distinguishes works of narrative in Galician language, Spanish and other foreign literature. == History and characteristics == The jury for this award is made up of high school students from IES Rosalía de Castro in Santiago de Compostela and four other institutes in Galicia, ramdolmly chosen. Sometimes high-schools from other parts of Spain or Portugal have also participated. It wants to promote reading among young people. The award in 2015 was 9,000 euros for the best novel of the year in each category: Galician novel, Spanish novel, Foreign Language novel. The first edition of the award was in 1995. The only writers awarded more than once are Pedro Feijoo (Vigo, Galicia), Javier Cercas (Catalonia) and Colm Tóibín (Ireland). === List of winners === Edition Year Galician Language Novel Spanish Language NovelOs títulos en galego son unicamente propostas de tradución do título orixinal. Foreign Language Novel I 1995 Suso de Toro, Tic-Tac Mario Vargas Llosa, Lituma en los Andes Tariq Ali, Shadows of the Pomegranate Tree II 1996 Xurxo Borrazás, Criminal Javier Marías, Mañana en la batalla piensa en mí Jostein Gaarder, Sofies verden III 1997 Miguel Anxo Murado, Ruído Aníbal Malvar, Unha noite con Carla (ex aequo) Antonio Soler, Los héroes de la frontera Antonio Tabucchi Sostiene Pereira IV 1999 Gonzalo Navaza, Erros e Tánatos Jaime Bayly, Los últimos días de “La Prensa” José Saramago, Ensaio sobre a cegueira V 1999 Manuel Rivas, O lapis do carpinteiro Carmen Martín Gaite, Irse de casa Alessandro Baricco, Castelli di rabbia VI 2001 Xelís de Toro, Os saltimbanquis no paraíso Hernán Rivera Letelier, Fatamorgana con banda de música Paul Auster, Timbuktu VII 2003 Bento da Cruz, A Loba Manuel de Lope La sangre ajena Milan Kundera, L'ignorance VIII 2003 Marilar Aleixandre, Teoría do caos Laura Restrepo, Leopardo al sol Amélie Nothomb, Méthaphysique des tubes IX 2004 Rosa Aneiros, Resistencia Almudena Grandes, Los aires difíciles Jonathan Coe, The Rotters' Club X 2005 Pilar Buela, Ácaros verdes Carlos Fuentes, La silla del águila Jeffrey Eugenides, Middlesex XI 2006 Teresa Moure, A xeira das árbores Álvaro Pombo, Una ventana al norte Melania G. Mazzucco, Vita XII 2007 Isidro Novo, Un escuro rumor tralo silencio Javier Cercas, La velocidad de la luz Abraham B. Yehoshua, Hakalá hameshajreret XIII 2009 María Reimóndez, O Club da Calceta Vicente Molina Foix, El abrecartas Haruki Murakami, Umibe no Kafuka XIV 2009 Anxos Sumai, Así nacen as baleas Luis Landero, Hoy, Júpiter Julian Barnes, Artur & George XV 2010 Inma López Silva, Memoria de Cidades sen luz Ignacio Martínez de Pisón, Dientes de leche Henning Mankell, Kinesen XVI 2011 An Alfaya, Areaquente William Ospina, El país de la canela Erri De Luca, Il giorno prima della felicità XVII 2012 Xulia Alonso, Futuro imperfecto Eduardo Mendoza, Riña de gatos Colm Tóibín, Brooklyn XVIII 2013 Xavier Queipo, Extramunde Marina Mayoral, Deseos Peter Stamm, Sieben Jahre XIX 2014 Pedro Feijoo, Os fillos do mar Arturo Pérez-Reverte, El tango de la guardia vieja Petros Márkaris, Pereosi XX 2015 Carlos G. Reigosa, A Vitoria do perdedor Juan Gabriel Vásquez, Las reputaciones Jöel Dicker, La vérite sur l'affaire Harry Quebert XXI 2016 Pedro Feijoo, A memoria da choiva Javier Cercas, El Impostor Colm Tóibín, The testament of Mary XXII 2017 Xabier Quiroga, Izan o da saca Sara Mesa, Cicatriz Pierre Lemaitre, Irène XXIII 2018 Xosé Monteagudo, Todo canto fomos Fernando Aramburu, Patria Ralf Rothmann, Im Frühling sterben XXIV 2019 Marcos Calveiro, O xardineiro dos ingleses Pedro Mairal, La uruguaya Han Kang, 채식주의자 (A vexetariana) == References == ==Other websites== * Award website Category:Santiago de Compostela Category:Literary awards Category:Galicia",
 "title": "San Clemente Literary Prize"
}