{
 "id": "953674",
 "text": "The execution of Saddam Hussein, the former Iraqi President, took place on 30 December 2006. Saddam was sentenced to death by hanging after being found guilty of crimes against humanity by the Iraqi Special Tribunal. These charges were mainly related to Saddam's role for the 1982 Dujail massacre—the killing of 148 Iraqi Shi'ites in the town of Dujail. Before being executed, Saddam began to recite the Shahada twice and shouted his hate for America. When he was at the end of his second recitation and was about to say \"Muhammad\", the trapdoor opened, causing Saddam's death. The execution was recorded by the Iraqi government. The video showed Saddam being taken to the execution location and having the noose placed around his neck. A cellphone video of the execution caused controversy after it showed people cheering after his execution. In the video, the sound of Hussein's neck breaking can be heard. == Legality == === Trial === Some people think Saddam's trial was not fair. Human Rights Watch said the \"execution follows a flawed trial and marks a significant step away from the rule of law in Iraq\". Amnesty International stated that it \"oppose[s] the death penalty in all circumstances but it [is] especially egregious when this ultimate punishment is imposed after an unfair trial\". Two days before the execution, the International Federation of Human Rights released a statement calling upon the head of state to issue a moratorium on the death sentence pronounced against Saddam by hanging. The organization also said Saddam should be treated as a prisoner of war under the Geneva Conventions. === Lawyers' claims === Lawyers for Saddam called the trial \"a flagrant violation of international law\" and said they planned to continue \"using all legal paths available locally and internationally until public opinion gets the truth about this political assassination\". In a separate statement, Saddam's American defense lawyer said: > \"[The execution is] an unfortunate display of arrogant aggressor's justice > by the United States of America under the leadership of American President > George W. Bush. It sets back achievements in international criminal law many > decades and sends a clear message to people all over the world that the > United States' aggression cannot be stopped by the law. It is truly a sad > day for international justice and sad beginning to a new year.\" Juan Cole said that the execution might lead to more sectarian turmoil: > The trial and execution of Saddam were about revenge, not justice. Instead > of promoting national reconciliation, this act of revenge helped Saddam > portray himself one last time as a symbol of Sunni Arab resistance, and > became one more incitement to sectarian warfare. === Arguments === Other legal experts disagreed with these assertions. Miranda Sissons, an independent observer of the trial and a senior associate at the International Center for Transitional Justice, stated \"This was not a sham trial\", and added the Iraqi judges presiding over the trial did \"their best to try this case to an entirely new standard for Iraq\". Jonathan Drimmer (winner of the first U.S. Department of Justice Assistant Attorney General Award for Human Rights Law Enforcement and a teacher at Georgetown University Law Center in Washington, DC) was asked if the trial met the standards of international justice. He said: > The answer is no. But to look at the ultimate verdict, it certainly is > consistent with the evidence presented ... [the trial was] a transparent > proceeding [and] a major step for Iraq\". Michael Scharf, a professor at Case Western Reserve University School of Law at the time, advised the Iraqi tribunal during the trial. Referring to documents signed by Saddam himself approving execution orders, Scharf said: > The U.S. government was not the puppet master of this tribunal ... Saddam > was convicted on the strength of his own documents. ==References== Category:2006 in Asia Category:21st century in Iraq",
 "title": "Execution of Saddam Hussein"
}