{
 "id": "953723",
 "text": "Ionia is the county seat of Ionia County, Michigan, United States. It is the largest community in the county. == History == Ottawa Indians had a village here. Then some Euro-Americans moved here in 1833. Their leader was Samuel Dexter, Jr. The Ottawa moved away. The town was platted in 1841. In 1865, it was incorporated as a village. In 1873, it became a city. == Geography == According to the United States Census Bureau, the city has a total area of 5.54 square miles (14.35 km2), of which 5.41 square miles (14.01 km2) is land and 0.13 square miles (0.34 km2) is water. Ionia is between Michigan's capital, Lansing, and its second largest city, Grand Rapids. === Climate === Ionia's climate has warm to hot (and often humid) summers and cold (sometimes severely cold) winters. This region also has dense and heavy fog, along with spring flooding of the Grand River. According to the Köppen Climate Classification system, Ionia has a humid continental climate, abbreviated \"Dfb\" on climate maps. == Demographics == The population of the city was 13,378 people in 2020. == Government == The mayor is John R. Milewski. The city manager is Precia Garland. The city levies an income tax of 1 percent on residents and 0.5 percent on nonresidents. == Media == === Radio === WION-AM STEREO 1430 in Ionia broadcasts music. === Newspaper === The Ionia Sentinel- Standard is both a paper and an online service. == Library == The city library is housed in an old mansion, the Hall-Fowler home. From 2006 through the summer of 2022, millage votes for the library were defeated. == Prisons and jails == There are five prisons and jails in Ionia. Ionia Correctional Facility and the Michigan Reformatory are major employers in Ionia. Both are located to the west of downtown along Bluewater Highway and Main Street, respectively. == Park, recreation and entertainment == Ionia has twelve parks and the Fred Thwaites Grand River Trail. The Ionia Armory Community Center hosts special events. The Ionia Theater hosts movies and live presentations. The theater is an Art Deco building constructed in 1931. It is run by by the Ionia Downtown Development Authority and the City of Ionia. == Special events == === Ionia Harvest Market === Each Saturday from June through the first of October, an open-air market is held at the Ionia Rotary Hoppough Pavilion. == Notable people == * Frances E. Burns (1866-1937), social leader and business woman * Fred W. Green, the only Governor (1927-1931) to be elected from Ionia. * Nick Bussell, a former Indy Pro Series race car driver * Allen B. Morse, Michigan politician, jurist, and mayor of Ionia * Billy Strings, Grammy Award Winning Bluegrass musician, attended the Ionia public school system ==References== Category:Cities in Michigan Category:County seats in Michigan",
 "title": "Ionia, Michigan"
}