{
 "id": "95383",
 "text": "Octal system (also known as base 8 or octonary), is a numeral system that uses the numerals 0 through 7. The system is similar to binary (base 2) and hexadecimal (base 16). Octal numerals are written using the number 0 before the numeral, for example, 004 or 01242. Octal numbers are also sometimes written with a small 8 to the lower right, as in 12428. At one time, the octal system was used mainly for work with computers. It provided an easier way to work with binary numbers. As computers changed from using 24-bit systems to 32- and 64-bit systems, hexadecimal replaced octal for most uses. Certain groups, for example, Native Americans using the Yuki language in California and the Pamean languages in Mexico, also use an octal numbering system. They do this because when they count, they use the spaces between their fingers instead of counting the actual fingers. ==Octal system== the octal system has no letters of the alphabet {| class=wikitable Octal Binary 1 001 2 010 3 011 4 100 5 101 6 110 7 111 10 001 000 ==Octal and decimal== In the decimal system (base 10), each digit in octal is equal to that digit multiplied by the exponent of 8 that is equal to its location minus one. Location Location Location Location Location Location 6 5 4 3 2 1 Value 32768 (85) 4096 (84) 512 (83) 64 (82) 8(81) 1 (80) Example: o3425 to decimal {| style= \"border: 1px #999 solid\" Octal Decimal o3425 = ( 5 × 1 ) + ( 2 × 8) + ( 4 × 64 ) + ( 3 × 512) o3425 = 5 + 16 + 256 + 1536 o3425 = 1813 ==Octal and hexadecimal== Octal is similar to hexadecimal because they are both easily converted to binary. Where octal is equal to three-digit binary, hexadecimal is equal to four-digit binary. Where octal numerals start with the letter \"o\", hexadecimal numerals end with the letter \"h\". The easiest way to convert from one to the other is to convert to binary and then to the other system. Octal Binary Binary Binary Binary Binary Binary Binary Binary Binary Hexadecimal Octal three digit three digit three digit three digit three digit four digit four digit four digit four digit Hexadecimal o4 100 0100 04h o15 001 101 1101 0Dh o306 011 000 110 1100 0110 C6h o54253 101 100 010 101 011 0101 1000 1010 1011 58ABh ==Related pages== * Binary numeral system * Hexadecimal numeral system * Decimal numeral system == References == == Other websites == * Online Converter for Decimal/Octal Numerals (JavaScript, GPL) Category:Numbering systems",
 "title": "Octal"
}