{
 "id": "95394",
 "text": "Religious conversion is taking a new religious identity, or a change from one religion to another. Conversion can take place not only from one religion to another, but also across different denominations, i.e. within the same faith, or when a person has a strong spiritual experience that changes their life. Three missionary religions are Buddhism, Christianity, and Islam. Followers of these religions try to convert others to their religion. The founders of these religions told their followers to do this. Matthew 28:16-20 Non-missionary religions include Judaism, Zoroastrianism, and Hinduism. These religions spread when their followers go to new places. They do not try hard to convert others. People convert to a different religion for various reasons, including their free choice due to a change in beliefs,Falkenberg, Steve. \"Psychological Explanations of Religious Socialization.\" Religious Conversion. Eastern Kentucky University. August 31, 2009. Some religions have used force to make people accept their beliefs. Some have offered cultural or material advantages. Others simply teach people about their religion. They try to convince them to change their beliefs with words and kindness. == Related pages == *Freedom of religion == References == * Barrett, D. V. The New Believers—A survey of sects, cults and alternative religions (2001) UK, Cassell & Co * Cooper, Richard S. \"The Assessment and Collection of Kharaj Tax in Medieval Egypt\" Journal of the American Oriental Society, Vol. 96, No. 3. (Jul. – Sep., 1976), pp. 365–382. * Barker, Eileen The Making of a Moonie: Choice or Brainwashing? (1984) == Other websites == * \"Proselytism, Change of Religion, and International Human Rights,\" by Natan Lerner, Ph.D. (legal aspects of defining illicit proselytism) * How Does One Convert to Judaism? * All Roads Lead to Rome Catholic conversion experience at The Truth about the Catholic Church * Choosing Judaism: Resource Center for Prospective Converts * Jewish Encyclopedia: Proselyte * Online Book on conversion to Hinduism * Podcast about Mormon conversion experience * Islam converts change face of Europe * Missionary to India, E. Stanley Jones, answers the question, What is conversion?",
 "title": "Religious conversion"
}