{
 "id": "954263",
 "text": "The bowfin (Amia calva) is an ancient species of bony fish in the genus Amia that lives in North America. It is a relict species, last of a group known as the Halecomorphi. That group appeared the Lower Triassic, about 250 million years ago. The bowfin is described as \"primitive\" because they have characteristics of their early ancestors. The closest living relatives of bowfins are gars: the two groups make up the clade Holostei. Their physiology is quite interesting. Like gars, bowfin are bimodal breathers: they can to breathe both water and air. Their gills exchange gases in the water, and they also have a gas bladder. The gas bladder is the secret: it keeps buoyancy, and lets the fish breathe air by a small pneumatic duct which goes from the foregut to the gas bladder. They break the surface to gulp air. This lets them survive conditions of hypoxia which would be lethal to most species. == Bowfin body-shape evolution and development == The first fish lacked jaws and used negative pressure to suck their food in through their mouths. The jaw in the bowfin is a result of their evolutionary need to be able to catch and eat bigger and more nutritious prey. As a result of being able to gather more nutrients, Bowfin are able to live a more active lifestyle. The jaw of a bowfin has several adaptations. == Similar species == Some people mistake northern snakeheads (Channa argus) for bowfin because even if they are in a different genus, they have similarities to them in appearance, most noticeably their elongated, cylindrical shape, and long dorsal fin that runs along their backs. == Diseases == A common parasite of bowfin is the anchor worm from the genus Lernaea. These crustaceans infest the skin and bases of fins, with consequences ranging from slowed growth to death. == Feeding == Bowfin are stalking, ambush predators that move into the shallows at night to prey on fish, and aquatic invertebrates such as crawfish, mollusks, and aquatic insects. == References == Category:Ray-finned fish",
 "title": "Bowfin"
}