{
 "id": "954373",
 "text": "Natalio Alberto Nisman (born December 5, 1963), also known as Alberto Nisman, was an Argentine lawyer. He worked as a federal prosecutor and known for his intervention as a prosecutor in the cases related to the AMIA bombing on July of 1994 in Argentina, the worst terrorist attack in Argentina.\"An explosion within an explosion\", The Economist, UK, Jan. 19, 2015 On Sunday, January 18, 2015, he was found dead with a shot to the head, in his apartment in the Tower Boulevard building of the Torres Le Parc complex, in the Puerto Madero neighborhood where he lived. ==Early life== Alberto Nisman was raised in a Jewish family. His parents were Sara Garfunkel, and Isaac Adolfo Nisman (born 1936), an upper-middle-class textile entrepreneur. ==Education== He studied at the University of Buenos Aires, were he passed half of the exams without attending the lectures (*) and graduated as a lawyer with an average of 8. He began to work \"meritorious\" (free work without a dependency relationship) in the Judicial Department of Morón. After obtaining his degree, he began his judicial career in that jurisdiction. (*) In Argentina undergraduate students can complete courses faster taking exams without attending classes. In this way the duration of the studies can be reduced. ==Family== He was married to federal judge Sandra Arroyo Salgado ―who at the time of Nisman's death was in charge of the San Isidro federal court―, with whom he had two daughters. When he divorced he left his wife the house for his children and rented an apartment in Le Parc. ==Death== At 10:30 p.m. on Sunday, January 18, 2015, Nisman's mother was alerted that her son did not respond to calls and went to the apartment where the prosecutor lived, in the Torre Boulevard building of the Le Parc Tower complex, in the neighborhood of Puerto Madero (Buenos Aires), which was locked from the inside. After trying to get in, a locksmith was able to open the service door. Nisman's body was found in the bathroom, shot in the head, along with a .22-caliber Bersa gun and a shell casing. The next day, Monday, he was scheduled to present his complaint to the Criminal Legislation Commission of the Chamber of Deputies of the Argentina. A few days after the prosecutor's death, the locksmith who was called to open the door stated that it was not locked, but rather: \"The service door was locked (from the inside) and had only the latch ... the latch opens with a little wire, I asked the mother for the key, I made the move, she turned the handle and opened it.\" The day after the locksmith's statements, Nisman's mother clarified that the service door was closed, and that she had previously opened it herself. His remains were buried in the Israelite Cemetery of La Tablada, twenty meters from the tombs of the victims of the AMIA Bombing, in the so- called sector of the \"Martires\". ==References== ==Other websites== * Nisman's charges against the President and Foreign Minister Página/12 (PDF) * * Death of a Prosecutor The New Yorker * Nisman's denunciation YouTube Category:1963 births Category:Argentine lawyers Category:2015 crimes Category:2015 deaths Category:Argentine Jews Category:Argentine judges Category:Assassinated people Category:People from Buenos Aires Category:Unsolved murders",
 "title": "Alberto Nisman"
}