{
 "id": "954395",
 "text": "The Attack on the Israeli embassy in Buenos Aires was a suicide bombing attack happened on Tuesday, March 17, 1992, causing 22 deaths and 242 injuries. The attack completely destroyed the headquarters of the embassy and the consulate, located at numbers 910 and 916 Arroyo Street in the city of Buenos Aires. The attack was investigated by the Supreme Court of Justice, without identifying any suspect and without the case being brought to trial until 2022. ==Attack== On 17 March 1992, at 2:42 pm (UTC−3), a pick-up truck driven by a suicide bomber and loaded with explosives smashed into the front of the Israeli Embassy at the corner of Arroyo and Suipacha, and detonated. The embassy, a Catholic church, and a nearby school building were destroyed. Four Israelis died, but most of the victims were Argentine civilians, many of them were children. The blast killed 29 and wounded 242. It was Argentina's deadliest terror attack until the 1994 AMIA bombing. It remains the deadliest attack on an Israeli diplomatic mission. The attackers are believed to have entered the country through the so-called triple border region, the area where the borders of Argentina, Paraguay and Brazil meet. Two years later, on July 18, 1994, a car bomb exploded in front of AMIA, the most important Jewish mutual organization in the country, also in Buenos Aires, resulting in the death of 85 people. ==Connection with Argentine foreign policy== In 2004, Carlos Menem, who was the president of Argentina between 1989 and 1999, declared in an interview that the fact of having been the only Argentine president to visit Israel could have been what offended these terrorist organizations. And then he added: \"The other thing that could be is the sending of Argentine ships to the Gulf on the occasion of Iraq's invasion of Kuwait.\" The sending of two warships to the Gulf, in 1991, to reinforce the coalition led by the United States against Iraq, was a major event in Argentine foreign policies during the Menem presidency. ==Various official hypotheses== Initially, expertise was carried out by the Federal Police and Gendarmerie. Both agreed that it had been a car bomb, but disagreed on the explosive used: trotyl and pentrite, for the police; hexogen with some kind of initiator, for the Gendarmerie. In 1996, the Supreme Court changed the hypothesis and reported that based on the results of the expertise carried out by the National Academy of Engineering, it could be established \"with a certain degree of certainty\" that the attack was the result of an explosion that occurred inside the building. In 1999, by the agreement issued on December 23, the Court changed its hypothesis again and held that the attack had been carried out with a car bomb, specifying that it could have been a Ford F-100 truck. == References == Category:1992 Category:20th century in Argentina Category:20th century in Israel Category:Arab–Israeli conflict Category:History of Buenos Aires Category:Building bombings Category:Islamic terrorist attacks Category:Suicide car and truck bombings Category:Unsolved murders",
 "title": "1992 attack on Israeli embassy in Buenos Aires"
}