{
 "id": "954592",
 "text": "The Sacro Catino is an artifact preserved in Genoa in the Museum of the Treasure of the Cathedral of San Lorenzo ; tradition has it the authentic Holy Grail, or the simulacrum of the dish used by Jesus Christ during the Last Supper, brought to Genoa after the First Crusade by Guglielmo Embriaco . == The item == The basin is a hexagonal vase made of bright green transparent material. When it was brought to Genoa it was believed that it was emerald . The Sacro Catino ended up shattered during its stay in France and was the subject of various restorations : the first in 1908, in 1951, and finally in 2017. The study of the object made during the period of presence in France by the Académie des sciences of the Institut de France established that it was a Byzantine crystal and not an emerald. The following studies would have postdated the work considering it to be an Islamic artifact of the 9th - 10th century . == History or Legend == The source of this belief is Jacopo da Varagine, who tells in the Genoese Chronicle that, during the first Crusade ( XI century ), the Genoese soldiers under the command of Guglielmo Embriaco participated in the capture of the city of Cesarea ( 1101 ), coming into possession of what was believed to be the dish of Jesus' Last Supper. When Genoa was conquered Napoleon Bonaparte, the dish was brought to Paris in 1806 and, when it was returned on June 14, 1816, it returned to Genoa broken into 10 pieces, one of which was missing. In 2017, the \"emerald vase\" was returned to the city in its transparent color, after the restoration carried out by the Opificio delle Pietre Dure in Florence. According to L. Ciatti, protagonist of the restoration attributed to Daniele Angellotto said it was not obtained from a huge natural emerald, but that it was a simple green glass vase, with no economic value. == References == == Bibliography == * Daniele Calcagno, The mystery of the \"Sacro Catino\", ed. Ecig, 2000. * Fra Agostino Schiaffino, Ecclesiastical Annals of Liguria by the Reverend Father Fra Agostino Schiaffino Genovese, Volume II, f. 174. (\"... in this city * Fra Gaetano da S. Teresa, The eastern emerald basin, a gem consecrated by Our Lady 'year 1101, in the Giovanni Franchelli printing house, Genoa 1726. == Related pages == * Crusade * Grail == Other websites == * San Lorenzo Museum of Genoa * Category:Genoa",
 "title": "Sacro Catino"
}