{
 "id": "954651",
 "text": "Inna Afinogenova (born January 14, 1989) is a Russian journalist, who until May 2022 worked as deputy director of the RT website in Spanish and for the YouTube channel, called Ahí les va. ==Early life== Afinogenova was born on January 14, 1989, in the Republic of Dagestan in southern Russia. She is a journalism graduate from M.V. Lomonosov of Moscow ==Early career== Journalism and the Spanish language are her main interests. She learned Spanish from a very young age and received classes from an Argentine teacher from the ages of 12 to 18. In an interview with the Argentine host Beto Casella she said about her Argentine teacher «She instilled in me the love for that country. And then I had the opportunity to go to Argentina in 2008. I went several times, and I spent a long time in Buenos Aires.\" She worked in several media outlets (from radio in Argentina to television) and worked for the Russian television channel RT en Español, holding various positions on said channel until she became the deputy director of the website. She has worked in Spanish audiovisual content in Spanish called Ahí les va, on the YouTube video platform. ==In the 2020s== On March 1, 2022, Google blocked access to the YouTube channels of Russian news agencies Russia Today and Sputnik throughout the European Union, including Afinogenova's news space There You Go, in compliance with sanctions imposed by the European Union to Russia for the invasion of Ukraine. Previously, Afinogenova had made some controversy since on December 1, 2021, in her program There it goes, she commented: «January will come, then February and March, it will end 2022 and surely in the (Western) media they will continue to read that the invasion is imminent.\" This and other previous controversies were what triggered this information channel to be deleted from the network and elsewhere, since the EU and the US \"consider that their message in favor of the Russian theses is unacceptable in times of war\". On May 3, 2022, she posted a video on YouTube explaining that he had left Russia and the Spanish RT channel because he does not agree with this war and any other war. She also blamed the war, considering it a serious strategic error, because it has greatly strengthened NATO: \"No one who is against NATO supports this war, because nothing has strengthened that organization as much as the decision made by the government Russian, an organization that was in full decline, seemed totally anachronistic\". == Other websites == * * * Category:1989 births Category:Living people Category:Russian journalists",
 "title": "Inna Afinogenova"
}