{
 "id": "954640",
 "text": "{{Infobox writer |name=Jesse Cornplanter|image=Jesse Cornplanter, descendant of Cornplanter, the famous Seneca chief, making a ceremonial mask, Tonawanda Community Hou - NARA - 519161.tif|imagesize=200px|caption=Jesse Cornplanter making a ceremonial mask, Tonawanda Community House, Tonawanda, New York. Photographed in 1940.|birth_name=Hayonhwonhish|birth_place=Cattaraugus Reservation, NY|birth_date=|death_date=|death_place=Genesee, NY|occupation=Actor, Author, Artist, Craftsman, Keeper of Seneca Culture|nationality=|citizenship=American|period=|genre=|subject=Seneca life, culture, and religion|movement=Iroquois Realism|notableworks=Legends of the Longhouse, Iroquois Indian Games and Dances, collection SC12845 at the New York State Library, illustrated The Code of Handsome Lake|spouse=|partner=|children=|relatives=Father Edward Cornplanter (Seneca name Sosondowah) Mother Nancy Jack|awards=|signature=}} Jesse J. Cornplanter (September 16, 1889 – March 18, 1957) was an actor, artist, author, craftsman, Seneca Faithkeeper and World War I decorated veteran.Bartlett, Charles E. (10 July 1957). \"Jesse J. Cornplanter\" (PDF). New York State Archeological Association. The Bulletin. 10: 1–3. Retrieved July 18, 2019. He was the last male descendant of Cornplanter. He wrote books about the Iroquois and Seneca life. He wrote and illustrated Legends of the Longhouse (1938). He was the first Native American with a major role in a movie called Hiawatha. == Biography == Jesse Cornplanter was born in 1889 on the Cattaraugus Reservation in New York. His Seneca parents were Nancy Jack and Edward Cornplanter. He had six sisters and three brothers. Only two sisters survived adulthood.Liberty, Margot, ed. (July 15, 2002). American Indian Intellectuals of the Nineteenth and Early Twentieth Centuries (Red River books ed.). University of Oklahoma Press. pp. 199–222. ISBN 978-0806133720. Cornplanter did not have an education past third grade. However, he knew a lot about Seneca customs.Bartlett, Charles E. (10 July 1957). \"Jesse J. Cornplanter\" (PDF). New York State Archeological Association. The Bulletin. 10: 1–3. Cornplanter served in the U.S. Army during World War One.Aul, Billie (August 1996). New York State Library \"Cornplanter, Jesse: Drawings SC12845\". New York State Library. Many of his relatives, including his father and sisters, died during this time. After the war, Cornplanter had several chief roles. He was ceremonial chief of the Long House and the chief of New Town. He acted in movies. He most notably played Hiawatha in the silent movie Hiawatha (1913). Cornplanter created artwork about Seneca life. Some of his illustrated books include Iroquois Indian Games and Dances (c. 1903) and Legends of the Longhouse (1938). He also illustrated The Code of Handsome Lake. His paintings are part of the Iroquois Realist Style. He also did wood carvings. == Personal life == Cornplanter was married to Elsina Billy. He had no children or descendants. Jesse Cornplanter was the last male descendant of Cornplanter. == Related pages == * Seneca people * Cornplanter * Iroquois * Northeastern Woodlands == References == == Other websites == * * Iroquois Indian games and dances : drawn by Jesse Cornplanter, Seneca Indian boy: Amherst College Archives & Special Collections * American Indian Freemasonry (1919) by Arthur C. Parker Some illustrations by Jesse Cornplanter: Wikimedia Commons * part 1-VOL XIII and Indian Cornhusk Dance by Carrie Cornplanter at the Smithsonian Institution. \"Watercolor sketches by Jesse J. Cornplanter made when he was 12 years of age\" on back. Category:1889 births Category:1957 deaths Category:Native American people",
 "title": "Jesse Cornplanter"
}