{
 "id": "954753",
 "text": "The Central Pollution Control Board (PCB) is a government organization in India responsible controlling pollution and maintaining environmental standards. Its purpose is to protect humans and the environment from pollution. Its many responsibilities include protecting India's natural resources and promoting clean energy sources like solar energy. Several laws give the PCB the responsibility to implement India's National Pollution Control Programme (NPCP). The Pollution Control Board also implements other laws (like the Environment Protection Act of 1986 and Solid Waste Management Rules of 2000) which have been enacted to ensure sustainable development through ecologically sound management of natural resources. == Certificates and clearances == === No Objection Certificates (NOCs) === The Pollution Control Board requires all industries to submit No Objection Certificates before they can carry out any project that might cause air pollution, water pollution, or other harm to the environment. These NOCs are issued by an panel called an Expert Committee. === Consent to Establish (CTE) === Before any industry, plant or process can be established, it requires a Consent to Establish certificate. This is the first step in a clearance process. It requires a business to obtain all necessary consents from the relevant authorities. Once a company has a CTE, it can establish itself and decide on things like ownership, location, and management. The CTE also outlines how the company will be governed and run by its directors. Before a business can obtain a CTE, the Pollution Control Board must verify that it has reviewed all environmental impact studies and conducted site-specific investigations. It must also verify that the business will not affect soil, water, air, or noise pollution. === Consent to Operate (CTO) === The CTO is an important document that provides a detailed outline of how the company will operate. Once the Industry, Plant, or Process being established according to mandatory pollution control systems, the units are required to obtain consent to operate. This is a legal document that confirms that you have all the necessary permits for your plant and operations. == Validity and renewal of consent == The validity and renewal of consent is one of the most fundamental aspects of consent. The concept of validity, as it applies to consent, is an important one to understand. Consent Valid Unless The Person Has A Valid Reason For Refusing To Consent. Mainly the pollution control board issue it for 3 to 5 years. Consent to operate remains valid for a period of 5, 10, and 15 years according to the red, orange, and green category. == Penalty of Consent pollution control board == # The Consent Pollution Control Board shall have jurisdiction over all matters relating to the monitoring and control of air pollution, water pollution, solid waste, noise and vibration pollution, as well as other such activities which may cause or contribute to such conditions. # The Board shall have the power to inspect any premises where it has reason to believe that there is a violation of any law or regulation relating to the prevention of pollution or protection of health or public safety. # The Board shall issue orders requiring persons in charge of any premises where there is probable cause for believing that there is a violation of any law or regulation relating to the prevention of pollution or protection of health or public safety, to cease carrying out any operation which causes an immediate danger to public health or safety; and it may order any person failing so to comply with such order forthwith either to cease from carrying on the operation complained of or if he fails so readily to desist from carrying it on in such manner as will prevent any immediate danger from occurring, then by order requiring him forthwith either temporarily or permanently so far as practicable to cease carrying on the operation complained thereof.\" ==References== Category:Air_pollution Category:Water_pollution",
 "title": "Central Pollution Control Board"
}