{
 "id": "955210",
 "text": "2022 FIFA U-17 Women's World Cup will be the seventh edition of the youth tournament for women under the age of 17. It was held in India from 11 to 30 October. ==Qualified teams== A total of 16 teams qualify for the final tournament. In addition to the hosts, 15 teams qualify from six continental competitions. Confederation Qualifying tournament Team Appearance Last appearance Previous best performance AFC Host nation 1st None Debut AFC Teams were nominated by AFC based on results of 2019 AFC U-16 Women's Championship (qualification cancelled) 3rd 2014 (2012, 2014) AFC Teams were nominated by AFC based on results of 2019 AFC U-16 Women's Championship (qualification cancelled) 7th 2018 (2014) CAF 2022 African U-17 Women's World Cup Qualifying Tournament 1st None Debut CAF 2022 African U-17 Women's World Cup Qualifying Tournament 6th 2016 Quarter- finals (2010, 2012, 2014) CAF 2022 African U-17 Women's World Cup Qualifying Tournament 1st None Debut CONCACAF 2022 CONCACAF Women's U-17 Championship 7th 2018 (2018) CONCACAF 2022 CONCACAF Women's U-17 Championship 6th 2018 (2018) CONCACAF 2022 CONCACAF Women's U-17 Championship 5th 2018 (2008) CONMEBOL 2022 South American U-17 Women's Championship 6th 2018 (2010, 2012) CONMEBOL 2022 South American U-17 Women's Championship 2nd 2010 (2010) CONMEBOL 2022 South American U-17 Women's Championship 5th 2018 (2008, 2012, 2014, 2018) OFC Team was nominated by OFC (qualification cancelled) 7th 2018 (2018) UEFA 2022 UEFA Women's Under-17 Championship 3rd 2012 (2012) UEFA 2022 UEFA Women's Under-17 Championship 7th 2018 (2008) UEFA 2022 UEFA Women's Under-17 Championship 5th 2018 (2018) ;Notes == Venues == On 13 April 2022, FIFA confirmed 3 host cities in 3 Indian states: # Bhubaneswar, Odisha # Margao, Goa # Navi Mumbai, Maharashtra Bhubaneswar Margao Navi Mumbai Kalinga Stadium Pandit Jawaharlal Nehru Stadium DY Patil Stadium Capacity: 15,000 Capacity: 19,000 Capacity: 55,000 ==Draw== The official draw took place on 24 June 2022, 12:00 local time CEST (UTC+2) at the FIFA headquarters in Zürich, Switzerland. The teams were allocated based on their performances in the 5 previous U-17 Women's World Cups, five bonus points are added to each of the confederation's current champions that won the respective qualifying tournament (for this cycle). The original hosts India were automatically assigned to position A1. Teams of the same confederation could not meet in the group stage. Pot 1 Pot 2 Pot 3 Pot 4 ==Squads== Players born between 1 January 2005 and 31 December 2007 are eligible to compete in the tournament. ==Group stage== The draw for the group stage took place on 24 June 2022. === Tiebreakers === The top two teams of each group advance to the quarter-finals. The format for tiebreakers are determined as follows: If two or more teams are equal on the basis of the above three criteria, their rankings are determined as follows: All times are local, IST (UTC+5:30). === Group A === \\---- \\---- === Group B === \\---- \\---- === Group C === \\---- \\---- === Group D === \\---- \\---- ==Knockout stage== In the knockout stages, if a match was level at the end of normal playing time, a penalty shoot-out was used to determine the winner (no extra time was played). ===Bracket=== ===Quarter-finals=== \\---- \\---- \\---- ===Semi-finals=== \\---- ===Third place match=== ===Final=== ==References== Category:FIFA U-17 Women's World Cup Category:2022 in association football Category:2022 in India Category:Football in India Category:October 2022 events",
 "title": "2022 FIFA U-17 Women's World Cup"
}