{
 "id": "95523",
 "text": "Javier Felipe Ricardo Pérez de Cuéllar y de la Guerra (January 19, 1920March 4, 2020) was a Peruvian diplomat who served as the 5th Secretary-General of the United Nations (UN) from 1982 to 1991. From 2000 to 2001, he served as the 135th prime minister of Peru. In 1995, he ran unsuccessfully against Alberto Fujimori for President of Peru. He was the president of the Council of Ministers (Prime Minister), as well as Minister of Foreign Affairs, between November 2000 and July 2001, during the unstable period following Fujimori's resignation over corruption charges. In 2004, he stepped down from his position as Peru's ambassador to France. From the death of Kurt Waldheim in 2007 until his own death in 2020, Pérez de Cuéllar was the oldest-living former secretary-general of the UN. ==Education== He studied in Colegio San Agustín of Lima, and then at Pontificia Universidad Católica del Perú. ==Diplomatic career== Pérez de Cuéllar joined the Ministry of Foreign Affairs in 1940 and the diplomatic service in 1944, serving subsequently as Secretary at Peru's embassies in France, where he met and married his first wife (the former Yvette Roberts); the United Kingdom; Bolivia; and Brazil. Later, he was ambassador to Switzerland, the Soviet Union (at the same time in Poland), and Venezuela. From his first marriage, Perez de Cuellar had a son (Francisco, born in Paris) and a daughter (Agueda Cristina, born in London). He was a junior member of the Peruvian delegation to the General Assembly at its first session, held in London in 1946, and a member of the delegations to the 25th through 30th sessions of the Assembly. In 1971, he was made permanent representative of Peru to the United Nations, and led his country's delegation to all sessions of the Assembly from then until 1975. In 1973 and 1974, he represented his country in the Security Council, serving as its president at the time of the events in Cyprus in July 1974. On 18 September 1975, he was appointed Special Representative of the Secretary-General in Cyprus, a post he held until December 1977, when he rejoined the Peruvian Foreign Service. During his time in Cyprus, Perez de Cuellar married his second wife, the former Marcela Temple Seminario. ==United Nations Secretary-General== On December 31, 1981, Pérez de Cuéllar succeeded Kurt Waldheim as Secretary- General and was re-elected for a second term in October 1986. During his two terms, he led mediations between Britain and Argentina in the aftermath of the Falklands War and promoted the efforts of the Contadora Group to bring peace and stability to Central America. He also interceded in the negotiations for the independence of Namibia, the conflict in Western Sahara between Morocco and the Polisario Front, and the Cyprus issue. Shortly before the end of his second term, he was unofficially requested by members of the Security Council to run for a third term of two years, to give time for a successor to be found. ==Death== Pérez de Cuéllar died in Lima on March 4, 2020, at age 100. ==References== ==Other websites== * * Official U.N.S.G biography Category:1920 births Category:2020 deaths Category:Politicians from Lima Category:Prime ministers of Peru Category:Peruvian Roman Catholics Category:Ambassadors to France Category:South American diplomats",
 "title": "Javier Pérez de Cuéllar"
}