{
 "id": "955347",
 "text": "{{Infobox writer |name=Jo Nesbø|image=Jo Nesbo.jpg|imagesize=|caption=Nesbø in 2008.|pseudonym=|birth_name=Jon Nesbø|birth_date=|birth_place=Oslo, Norway|death_date=|occupation=Novelist, musician, football player|genre=Crime fiction, horror fiction, mystery fiction, children's books; juvenile fiction|subject=Crime, thriller, mystery|notablework=Harry Hole series|website=|children=1|language=Norwegian; English|awards=Riverton Prize}}Jo Nesbø (; born Jon Nesbø;\" 29 March 1960) is a Norwegian writer, musician, economist, journalist, and former footballer. As of March 2014, his novels had sold more than 3 million copies in his home country of Norway, and as of 2021 they have sold 50 million copies worldwide, having been translated into over 50 languages. This has resulted in him being the most successful Norwegian author of all time. \"Headhunters by Jo Nesbø\" (review). Life in Norway. 24 October 2017. Retrieved 1 December 2019. \"As of March 2014 more than 3 million copies of his novels have been sold in Norway, and his work has been translated into over 40 languages, selling 23 million copies.\"Siegel, Lee (5 May 2014). \"Pure Evil: Jo Nesbø and the rise of Scandinavian crime fiction\". The New Yorker. Retrieved 1 December 2019. \"Nesbø’s Harry Hole novels have sold twenty-three million copies, in forty languages.\"Milne, Richard (21 April 2017). \"Jo Nesbo, the Norwegian crime writer, on his climbing addiction\". Financial Times. ft.com. Retrieved 1 December 2019. \"Today, he is a best-selling crime writer, whose novels have sold some 33 million copies worldwide.\"\" Nesbø is best known for writing crime novels featuring Inspector . However, in 2007 he released his first children's book, Doktor Proktors Prompepulver (English translation: ). He also had his book Hodejegerne (English translation: The Headhunters) adapted into the 2011 action thriller film of the same name. Nesbø has also had the idea for the Norweigian political thriller TV series Okkupert (English translation: ). Nesbø is also the main singer and songwriter for the Norwegian rock band , which started in 1992. Nesbø's brother, Knut Nesbø, used to be a guitarist for the band. The band was awarded the Gammleng-prisen, a Norwegian culture award, in 1996. They have also had a number one record chart with Jenter & sånn in 1994. == References == Category:1960 births Category:Living people Category:Norwegian writers Category:Crime writers",
 "title": "Jo Nesbø"
}