{
 "id": "955315",
 "text": "Banco Galicia is a private bank of Argentina. It belongs to the Grupo Financiero Galicia. It was founded in 1905 as Banco de Galicia y Buenos Aires, and traditionally its Board of Directors was made up of members of the Escasany, Ayerza and Braun Menéndez families. Its shares began trading on the Buenos Aires Stock Exchange in 1907. ==History== Banco Galicia was founded in 1905 by a group of businessmen from the Galician community in Argentina, and in 1907 its shares began trading on the Buenos Aires Stock Exchange. In 2000, Grupo Financiero Galicia was created and became the controlling company of the Bank, acquiring 100% of its shares in 2014. The commercial network grew significantly at the end of the 1950s and continued to expand to the 326 branches it has today, developing its potential and earning its reputation as an innovative bank, currently considered a leader and reference within the national banking industry. In the late 1950s, Banco Galicia launched the capital investment fund FIMA Acciones and founded the predecessor of the asset manager Galicia Asset Managment. As part of its growth strategy, Banco Galicia began to expand into rural areas in the interior of the country, where it was believed that there was high growth potential. Access to financial services in the interior was limited compared to Buenos Aires and its surroundings, and its population used fewer banking services. In 1979, it launched the first ATM network in the country, together with 4 of the main banks in the financial system. In order to expand its network throughout Argentina, in 1986 Banco Galicia offered to open 13 branches with ATMs in the province of Santiago del Estero in exchange for placing the Bank's characteristic symbol on the province's flag, as well as It is how today the cross of Santiago can be seen on the provincial flag. Between 1995 and 1999, Banco Galicia acquired shareholdings in various entities and formed several non-banking companies that provided financial services -mainly through the issuance of own-brand credit cards- and insurance. In 2000, it launched the first Internet financial portal in Argentina and in 2006 the first payment service through a bank's cell phone in Argentina. After being significantly affected by a deep economic and financial crisis in 2001 and 2002, Banco Galicia managed to recover to resume its leadership position. It is currently one of the main banks in the Argentine financial system, being the most important among those in the private sector with national controlling capitals. == Other websites == * official website Category:1905 establishments in Argentina Category:Banks of Argentina",
 "title": "Banco Galicia"
}