{
 "id": "95540",
 "text": "José de Sousa Saramago, (pronounced|ʒuˈzɛ sɐɾɐˈmagu; born November 16, 1922; died June 18, 2010) was a Portuguese writer, playwright and journalist. Saramago was awarded the Nobel Prize in Literature in 1998. He lived on Lanzarote in the Canary Islands, Spain. == Biography == Saramago was born into a family of landless peasants in Azinhaga, Portugal, a small village in the province of Ribatejo some hundred kilometers north-east of Lisbon. Saramago married Ilda Reis in 1944. Their only child, Violante, was born in 1947. Since 1988, Saramago has been married to the Spanish journalist Pilar del Río, who is the official translator of his books into Spanish. José Saramago was in his mid-fifties before he had international success; his novel Baltasar and Blimunda brought him an international readership. This novel won the Portuguese PEN Club Award. Saramago was a member of the Portuguese Communist Party from 1969, until his death http://nobelprize.org/nobel_prizes/literature/laureates/1998/bio-bibl.html Nobel Prize citation, 1998 as well as an atheist and self-described pessimist.Langer, Adam. \"José Saramago: Prophet of Doom.\" Book Magazine November/December 2002. His views have aroused considerable controversy in Portugal, especially after the publication of The Gospel According to Jesus Christ. == Themes == Saramago uses for his works fantastic scenarios. In his 1986 novel, The Stone Raft, the Iberian Peninsula breaks off from the rest of Europe and sails about the Atlantic Ocean. In his 1995 novel, Blindness, an entire country is stricken with a mysterious plague called “white blindness”. == Bibliography == Title Year English title Year ISBN Terra do Pecado 1947 Os Poemas Possíveis 1966 Provavelmente Alegria 1970 Deste Mundo e do Outro 1971 A Bagagem do Viajante 1973 As Opiniões que o DL teve 1974 O Ano de 1993 1975 Os Apontamentos 1976 Manual de Pintura e Caligrafia 1977 Manual of Painting and Calligraphy 1993 Objecto Quase 1978 Levantado do Chão 1980 Viagem a Portugal 1981 Journey to Portugal 2000 Memorial do Convento 1982 Baltasar and Blimunda 1987 O Ano da Morte de Ricardo Reis 1986 The Year of the Death of Ricardo Reis 1991 A Jangada de Pedra 1986 The Stone Raft 1994 História do Cerco de Lisboa 1989 The History of the Siege of Lisbon 1996 O Evangelho Segundo Jesus Cristo 1991 The Gospel According to Jesus Christ 1993 Ensaio sobre a Cegueira 1995 Blindness 1997 Todos os Nomes 1997 All the Names 1999 O Conto da Ilha Desconhecida 1997 The Tale of the Unknown Island 1999 A Caverna 2001 The Cave 2002 O Homem Duplicado 2003 The Double 2004 Ensaio sobre a Lucidez 2004 Seeing 2006 Don Giovanni ou o Dissoluto Absolvido 2005 As Intermitências da Morte 2005 Death at Intervals 2008 As Pequenas Memórias 2006 == References == === Bibliography === * Baptista Bastos, José Saramago : Aproximação a um retrato, Dom Quixote, 1996 * T.C. Cerdeira da Silva, Entre a história e aficção : Uma saga de portugueses, Dom Quixote, 1989 * Maria da Conceição Madruga, A paixão segundo José Saramago : a paixão do verbo e o verbo da paixão, Campos das Letras, Porto, 1998 * Horácio Costa, José Saramago : O Período Formativo, Ed. Caminho, 1998 * Helena I. Kaufman, Ficção histórica portuguesa da pós- revolução, Madison, 1991 * O. Lopes, Os sinais e os sentidos : Literatura portuguesa do século XX, Lisboa, 1986 * Carlos Reis, Diálogos com José Saramago, Ed. Caminho, Lisboa, 1998 * M. Maria Seixo, O essencial sobre José Saramago, Imprensa Nacional, 1987 * \"Saramago, José (1922-).\" Encyclopedia of World Biography. Ed. Tracie Ratiner. Vol. 25. 2nd ed. Detroit: Thomson Gale, 2005. Discovering Collection. Thomson Gale. University of Guelph. 25 Sep. 2007 == Other websites == * The Unexpected Fantasist, a portrait of José Saramago, written by Fernanda Eberstadt and published August 26, 2007 in The New York Times Magazine * Introduction and video of Saramago from \"Heroes de los dos bandos\" -spanish civil war- * Interviews with Saramago in video * José Saramago from Pegasos * Translation of interview with Saramago in El País - 12-Nov-2005 Category:1922 births Category:2010 deaths Category:Portuguese writers",
 "title": "José Saramago"
}