{
 "id": "955423",
 "text": "Alexia Putellas Segura (born 4 February 1994) is a Catalan professional footballer. She plays as a midfielder for Barcelona, whom she captains, and for the Spain women's national football team.Alexia Putellas signs for FC Barcelona. futfem.com, 10/07/12 Before this, she played for Espanyol and Levante, and she has represented Catalonia. By 2022, she had won all the major awards available to a European player, both individually and with her club. People widely consider her the best female footballer in the world right now and one of the greatest of all time. In 2022, a football reporter named Asif Burhan mentioned how her dedication to the sport has changed women's football. She has been playing for Barcelona since 2012, after spending most of her younger years with Espanyol. With Barcelona, she has achieved a lot: seven league titles, seven Copas de la Reina, and two UEFA Women's Champions League trophies. In the 2020-21 season, she played a key role in helping Barcelona win the Champions League and two other major titles for the first time in their history. In recognition of her outstanding performance, she won several awards in 2021, including UEFA Women's Player of the Year, Ballon d'Or Féminin, and The Best FIFA Women's Player - a feat that no one had accomplished before in a single year. As of 2022, she's the second player with the most appearances for Barcelona, just behind Melanie Serrano. She's also the second-highest all-time scorer for the club, after Jennifer Hermoso. Moreover, she holds the record for the most appearances for Spain with 104 caps, surpassing Marta Torrejón's previous record of 90 caps in 2021. == Personal life == Putellas was really close to her dad. Even though he was sick with heart problems when she played for Levante, he always came to see her games in Valencia. She thought about studying medicine to help him. He died in 2012, just before an important tournament. When she scores a goal, she points to the sky to remember him. She mostly speaks Catalan, learned Spanish in school when she was young, and started learning English in the 2020s. She has a pet dog named Nala, a Pomeranian, who even has an Instagram account. She doesn't talk much about her relationships, but she did share on social media about being with her teammate Jennifer Hermoso. They even joined an event called Madrid Pride together. After winning the Champions League in 2023, a video of Putellas meeting her girlfriend in the stands became super popular on TikTok. Putellas has lots of tattoos. Some have Latin sayings, like \"Work conquers all.\" She also has symbols like a Hand of Fatima and an Eye of Horus, plus a Barcelona tile with \"Made in\" written on it. She's got a football, the number 112 (combining her first Spain shirt number, 12, and her famous shirt number, 11), and a drawing of her dad holding her as a baby and giving her a football. == Career statistics == === Club === Appearances and goals by club, season and competition Club Season League Cup Supercup UWCL Regional Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Espanyol 2009–10 Superliga Femenina 1 0 0 0 – – ? ? 1 0 2010–11 24 3 4 1 – – ? ? 28 4 Total 25 3 4 1 – – ? ? 29 4 Levante 2011–12 Primera División 34 15 – – – – 34 15 Barcelona 2012–13 Primera División 30 12 5 1 – 2 0 2 0 39 13 2013–14 30 8 5 2 – 6 0 2 1 43 11 2014–15 26 6 2 0 – 4 1 2 1 34 8 2015–16 29 18 3 2 – 5 0 2 0 39 20 2016–17 28 10 3 0 – 8 0 2 4 41 14 2017–18 29 9 4 2 – 4 1 2 0 39 12 2018–19 28 16 2 1 – 8 1 0 0 38 18 2019–20 20 10 3 1 2 2 6 3 2 2 33 18 2020–21 31 18 3 5 1 1 7 2 – 42 26 2021–22 26 18 4 4 2 1 10 11 – 42 34 2022–23 5 1 0 0 0 0 1 0 – 6 1 Total 281 126 34 18 5 4 61 19 14 8 395 175 Career total 340 144 38 19 5 4 61 19 14 8 458 194 ===International=== Appearances and goals by national team and year Year Spain Catalonia Apps Goals Apps Goals 2013 8 1 colspan=2 2014 7 0 1 0 2015 12 2 1 0 2016 9 3 1 1 2017 14 3 0 0 2018 9 4 colspan=2 2019 16 1 0 0 2020 6 4 colspan=2 2021 12 5 colspan=2 2022 7 4 colspan=2 2023 4 1 colspan=2 Total 104 28 3 1 :Scores and results list Spain's and Catalonia's goal tally first, score column indicates score after each Putellas goal. List of international goals scored by Alexia Putellas No. Date Venue Opponent Score Result Competition Spain goals 1 12 July 2013 Linköping Arena, Linköping 3–2 3–2 UEFA Women's Euro 2013 2 10 February 2015 Pinatar Arena, San Pedro del Pinatar 1–0 2–2 Friendly 3 27 October 2015 Sonera Stadium, Helsinki 1–0 2–1 UEFA Women's Euro 2017 qualifying 4 24 January 2016 Stadion pod Malim brdom, Petrovac 3–0 7–0 UEFA Women's Euro 2017 qualifying 5 8 April 2016 Complexo Desportivo da Covilhã, Covilhã 2–0 4–1 UEFA Women's Euro 2017 qualifying 6 15 September 2016 La Ciudad del Fútbol, Las Rozas de Madrid 12–0 13–0 UEFA Women's Euro 2017 qualifying 7 30 June 2017 Pinatar Arena, San Pedro del Pinatar 1–0 7–0 Friendly 8 3–0 9 28 November 2017 Estadi de Son Moix, Palma 1–0 4–0 2019 FIFA Women's World Cup qualification 10 20 January 2018 Pinatar Arena, San Pedro del Pinatar 1–0 2–0 Friendly 11 5 March 2018 AEK Arena – Georgios Karapatakis, Larnaca 2–0 2–0 2018 Cyprus Women's Cup 12 7 June 2018 La Condomina, Murcia 2–0 2–0 2019 FIFA Women's World Cup qualification 13 8 November 2018 Butarque, Leganés 2–1 3–1 Friendly 14 5 April 2019 Estadio Vicente Sanz, Don Benito 1–1 2–1 Friendly 15 5 March 2020 Exploria Stadium, Orlando, Florida 1–0 3–1 2020 SheBelieves Cup 16 11 March 2020 Toyota Stadium, Frisco, Texas 1–0 1–0 2020 SheBelieves Cup 17 23 October 2020 La Cartuja, Seville 4–0 4–0 UEFA Women's Euro 2022 qualifying 18 27 November 2020 La Ciudad del Fútbol, Las Rozas de Madrid 7–0 10–0 UEFA Women's Euro 2022 qualifying 19 10 June 2021 Santo Domingo, Alcorcón 2–0 3–0 Friendly 20 16 September 2021 Tórsvøllur, Tórshavn 4–0 10–0 2023 FIFA Women's World Cup qualification 21 26 October 2021 Kolos Stadium, Kovalivka 1–0 6–0 2023 FIFA Women's World Cup qualification 22 25 November 2021 La Cartuja, Seville 11–0 12–0 2023 FIFA Women's World Cup qualification 23 30 November 2021 La Cartuja, Seville 6–0 8–0 2023 FIFA Women's World Cup qualification 24 17 February 2022 Riverside Stadium, Middlesbrough 1–0 1–1 2022 Arnold Clark Cup 25 23 February 2022 Molineux Stadium, Wolverhampton 1–0 1–0 2022 Arnold Clark Cup 26 7 April 2022 José Rico Pérez, Alicante 1–0 1–1 Friendly 27 1 July 2022 Stadio Teofilo Patini, Castel di Sangro 1–1 1–1 Friendly 28 29 June 2023 Estadio Román Suárez Puerta, Avilés 2–0 7–0 Friendly Catalonia goals 1 22 December 2016 Estadio da Lomba, Vilagarcía de Arousa Galicia 2–0 5–0 Friendly == References == Category:Spanish footballers Category:1994 births Category:Living people",
 "title": "Alexia Putellas"
}