{
 "id": "955928",
 "text": "The Brandenburg Concertos are a set of concertos written by Johann Sebastian Bach. They were written for Christian Ludwig, Margrave of Brandenburg-Schwedt. The original title was Six Concerts à plusieurs instruments, six concertos for several instruments. In each of the concertos, there are several solo instruments, which are accompanied by an orchestra. They are widely regarded as some of the greatest orchestral compositions of the Baroque era. == History == The set was collected and given to the margrave by Bach in 1721. At that time, he was working as Kapellmeister at Cöthen. Christoph Wolff thinks that the concertos may have been written when Bach was working at Weimar. == Structure == As to instrumentation, they are quite unique. * The first and the third concerto are built around a classical Italian ouverture: there is a concert piece, a slower middle part, and a dance movement. They represent the earlier form of a group concert:The instruments are grouped, and the focus is on the groups of instruments. * In the second, and the fourth concerto, there are a number of solo instruments, who play with an orchestra. This is the modern form of a concerto. * The fifth and the sixth concerto are like a collection. Bach uses a national style. In the fifth concerto, this is the style of the court, (where French was commonly spoken), which was current when Bach was alive. In the sixth concerto, he took the style of the court in the generation before him. Both concertos feature a number of solo instruments, but in both cases, the \"orchestra\" (or \"tutti\") that accompanies is very small, just three instruments. In the fifth concerto, these are violin, viola, and violone. Later, Bach added a violoncello. In the sixth concerto, the tutti is made of two viols ('viola da gamba') and a violone. The middle part of these is played by the solo instruments, with basso continuo. == References == == Other websites == * Category:Compositions by Johann Sebastian Bach Category:Concertos Category:Compositions in F major Category:Compositions in B-flat major Category:Compositions in G major Category:Compositions in D major",
 "title": "Brandenburg Concertos"
}