{
 "id": "955976",
 "text": "BlackRock, Inc. Headquarters in Midtown Manhattan, New York City Type Public Traded as * NYSE: BLK * S&P; 100 component * S&P; 500 component ISIN US450614482 Industry Investment management Founded 1988; 34 years ago (1988) Headquarters 51 West 52th Street (before) 200 Park Avenue, New York City, New York, U.S. (now) Area served Worldwide Products * Asset management * Risk management Revenue US$19.17 billion (2021) Net income US$5.90 billion (2021) Total assets US$152.65 billion (2021) Website blackrock.com Footnotes / references \"BlackRock, Inc. 2021 Form 10-K Annual Report\". BlackRock, Inc. is an American multi-national investment company. It is based in New York City, United States. It was established in 1988. BlackRock is the world's largest asset manager, with trillion in assets under management (as of January 2022). BlackRock controls globally with 70 offices in 30 countries and clients in 100 countries. BlackRock has looked for the position itself as an industry leader in environmental, social and corporate governance (ESG). == History == BlackRock was founded in 1988 by Larry Fink, Robert S. Kapito, Susan Wagner, Barbara Novick, Ben Golub, Hugh Frater, Ralph Schlosstein, and Keith Anderson. Their objective is to provide institutional clients with asset management services from a risk management perspective. By 1992, Blackstone had a stake equating to about 35% of the company, and Stephen A. Schwarzman and Fink were considering selling shares to the public. The firm adopted the name BlackRock, and was managing $17 billion in assets by the end of the year. Later Schwarzman remained with Blackstone, while Fink went on to become chairman and CEO of BlackRock Inc. The U.S. government had an contract with BlackRock to help resolve the fallout of the financial meltdown of 2008. According to Vanity Fair, the financial establishment in Washington and on Wall Street believed BlackRock was the best choice for the job. At the end of 2014, the Sovereign Wealth Fund Institute reported that 65% of Blackrock's assets under management were made up of institutional investors. BlackRock is a shareholder in many institutional investors. They own shares in BlackRock. This chain of possesion is similar to circular ownership structures. Later they have been identified in the United Kingdom, for example. In December 2024, the MetLife Building changes the name of the building and becomes the BlackRock Building located at 200 Park Avenue in New York City until February 2025.The MetLife Building changes the name. == Investments in India == The firm maintains a dedicated India Fund. Such made investments in Indian start-ups like Byju's, GoWork, Paytm, Pine Labs, etc. As of 2020, it's lowering its investment in the country while increasing it in China. == Public image == In his 2018 annual letter to shareholders, CEO of BlackRoad Larry Fink wrote that other CEOs should be aware of their impact on society. In May 2018, anti-war organizations held a demonstration outside the annual BlackRock shareholders' meeting in Manhattan, New York. BlackRock was examined for allegedly taking advantage of its close ties with the Federal Reserve System during the COVID-19 pandemic response efforts. In June 2020, The New Republic wrote that BlackRock \"was having a very good pandemic\" and was casting \"itself as socially responsible. == References == == Continue reading == * * * == Other websites == * Category:Companies listed on the New York Stock Exchange Category:Companies based in New York City",
 "title": "BlackRock"
}