{
 "id": "956074",
 "text": "Bruno Morassutti (Padua, December 8, 1920 - Belluno, September 4, 2008) was an Italian architect and designer. He was born into a wealthy family that owns a hardware chain. Morassutti is a protagonist of Italian rationalism. His best known masterpiece is the Bosco Verticale in the exclusive Quadronno district of Milan. He worked with Angelo Mangiarotti for several projects in the United States with Ernesto Nathan Rogers. He was influenced by Gualtiero Galmanini, in 1950 he went to work in Chicago for BBPR first and then with Max Bill, architect, painter , sculptor, designer. == Bibliography == Bruno Morassutt was born in Padua, and studied in Venice, where he graduated in 1946. In 1949 he left for the United States. Morassutti was aware of the limitations of academic training for a new course in architecture, and decided to start research in Teliesin, Arizona, with Frank Lloyd Wright in the 1940s. The research with Wright continued for years both in Arizona and in Wisconsin. They also compared themselves with other designers such as Auguste Perret, Richard Neutra in California, Ludwig Mies van der Rohe in Chicago. From the early 1950s he dedicated himself to industrial design often with Angelo Mangiarotti, his furniture has the characteristic of being free of junctions, thanks to the joint, \"tables, stools, benches and bookcases that combine functionality and decoration, freely assembled and easy to pack \". ==References== == Bibliography == * Maestri del design: Castiglioni, Magistretti, Mangiarotti, Mendini, Sottsass, Ed. B. Mondadori, 2005, ISBN 9788842498261 * Pasquale Belfiore,I maestri del movimento moderno: bibliografia ragionata, 1979 * Giulio Barazzetta, Roberto Dulio, \"Bruno Morassutti 1920-2008 opere e progetti\", Ed.Electa, 2009 * Francesco Scullica, Bruno Morassutti Quattro realizzazioni, un percorso metodologico, Una (ri)lettura, Ed. Franco Angeli, 2022, ISBN 9788835133315 * Bruno Morassutti, Giulio Barazzetta, Roberto Dulio, Bruno Morassutti: 1920-2008 opere e progetti, 2009 * Luciano Setten, Bruno Morassutti. Architettura industrializzata e design, 2020 * Alessandro Colombo, Francesco Scullica, Bruno Morassutti 100+1! La cultura del progetto in Italia, 2021 * Giulio Barazzetta, La chiesa di vetro di Angelo Mangiarotti, Bruno Morassutti, 2015 * Bruno Morassutti, Mario Memoli, Giovanna Gussoni, Gabriella Benevento, Morassutti & associati arch.tti, 1980 * Muriel Emanuel, Contemporary Architects, 2016 * Giuseppe Maria Jonghi Lavarini, Maurizio De Caro, Il condominio a Milano, 1987 * Marco Biraghi, Guida all'architettura di Milano 1954-2014, 2013 * Marco Biraghi, Silvia Micheli, Gabriella Lo Ricco, Guida all'architettura di Milano 1954-2015, 2015 * Florencia Andreola, Marco Biraghi, Gabriella Lo Ricco, Milano. L’architettura dal 1945, 2018 * Domus - Pagina 94, 1975 * Percorsi di ricerca - Pagina 152, Working Papers del LabiSAlp, 2018 * Milano - Pagina 346, Touring club italiano, 1998 * Andrea Branzi, Introduzione al design italiano, 2015 * Il Design italiano degli anni '50 - Pagina 72, Centrokappa · 1981 * Tullia Iori, Sergio Poretti, Gianluca Capurso, Storia dell'ingegneria strutturale in Italia – SIXXI 4, 2018 * Pietro Zennar, La qualità rarefatta. Considerazioni sull'influenza del vuoto nella costruzione dell'architettura, 2000 * Aa. Vv., The Guggenheim. Frank Lloyd Wright and the Making of Modern Museum, Guggenheim Museum Publications, New York 2009. * Argan Giulio Carlo, Progetto e destino, Saggiatore, Milano, 1965. * Barazzetta Giulio e Dulio Roberto (a cura di), Bruno Morassutti 1920-2008 opere e progetti, Electa, Milano 2009. * Colombo Alessandro, “Bruno Morassutti (1920-2008) * Maestro di Modernità”, in Il Giornale dell’Architettura - Professioni, Umberto Allemandi, n.66, ottobre 2008, p.9. * Dulio Roberto, “Modelli lontani: Taliesin attraverso Morassutti” in Tegethoff Wolf e Zanchettini Vitale (a cura di), Carlo Scarpa. Strutture e forme, Marsilio, Venezia 2008, pp.133-147. * Hanna, Paul and Jean, Frank Lloyd Wright’s Hanna House:The Clients’ Report, Architectural History Foundation and MIT Press, New York and Cambridge Mass. 1981. == Other websites == * Fondazione Bruno Morassutti * Bruno Morassutti Enciclopedia De Agostini * Frank Lloyd Wright e Bruno Morassutti, Artribune, 2018 Category:Italian architects Category:Italian designers Category:1909 births Category:1978 deaths Category:People from Padua",
 "title": "Bruno Morassutti"
}