{
 "id": "956160",
 "text": "On 1 September 2022 Argentina's former president and current vice president Cristina Fernández de Kirchner had a gun pointed at her head by a man outside her official residence in the neighborhood of Recoleta, Buenos Aires. As the man tried to kill her, the gun failed. No shots were fired. He was arrested on the scene. ==Facts== On September 1, 2022, at 8:50 p.m. (local time in Argentina), the vice president of Argentina arrived at her home after a session in the Senate. Fernández was signing copies of her book Sinceramente outside her home, when Fernando Andrés Sabag Montiel, about 35 years old, pointed a 32-caliber Bersa gun at the president's head. He pulled the trigger twice but none of the magazine's five serviceable cartridges were chambered. The object had a damaged serial number. Supporters of the vice president gathered at the scene to sing songs in her support. ===Attacker=== Fernando Andrés Sabag Montiel is the person who tried to fire at Cristina Fernández. He has a record for carrying a knife. He lives in the La Paternal neighborhood. In photographs of the attacker released by the media, a tattoo of the black sun, a neo-fascist symbol, can be seen on his elbow. ==Investigation== Sabag was quickly arrested by the victim's security and police elements. He was taken to a police tent where he is interrogated. Elements of the Argentine scientific police carried out expert investigations on the site. Alberto Fernández, president of Argentina, announced that María Eugenia Capuchetti is the judge in charge of the investigations and the prosecutor is Carlos Rívolo. The president asked the judicial authorities for speed in the clarification as well as to take care of the detainee's life. ==Background== For a week, the corner of the vice president's apartment has been in constant presence of sympathetic protesters, this presence responded to the previous presence of opposition protesters, in turn incited in response to a breakthrough in one of the corruption cases linked to Lázaro Báez on August 22. ==Reactions== ===Argentina=== * Alberto Fernández energetically repudiated the events, described it as \"a serious event\" and appealed for the search for justice in the case. At 23:56 (UTC-3), he addressed the country on Cadena nacional and declared Friday the 2nd as a holiday with the aim that the Argentine people \"express their expressions on the fact\". * Mauricio Macri, former President of Argentina, repudiated the incident, calling it \"very serious\", demanding an \"immediate and profound clarification by the justice and security forces\". * The Central de Trabajadores de la Argentina called for a general strike in solidarity with the president. * Patricia Bullrich, president of the Republican Proposal (PRO) party, for her part, described the assassination attempt as an \"individual act of violence\" and what was arranged by President Fernández as \"a political move\", in relation to decreeing the holiday, describing it as opportunity to mobilize militants. * The Government of the province of Mendoza decided not to abide by the holiday ordered by the president, considering that: \"one must work normally, which is the best way to repudiate any expression of violence and adherence to social peace.\" ===International=== * : President Luis Arce emphatically repudiated the attack against Fernández de Kirchner, and sent his support to her, her family and the government of Alberto Fernández. The former president of Bolivia, Evo Morales, also condemned the \"cowardly attempt of assassination\" to Fernández, which she wrote on her Twitter account. The former de facto president of Bolivia, Jeanine Áñez, accused Cristina Fernández of \"self-victimizing herself\" and imposing a political holiday. * : Luiz Inacio Lula da Silva, former president of Brazil, expressed his solidarity by describing the attacker as a \"fascist criminal who does not know how to respect dissidence and diversity.\" The former Brazilian president, Dilma Rousseff, expressed solidarity with the vice president Argentina against the attack. *: President Gabriel Boric said that the attempted attack \"deserves the repudiation and condemnation of the entire continent\" and expressed his solidarity. * : President Gustavo Petro expressed on his Twitter account that \"the attack on Cristina in Argentina is the result of sectarianism that turns into violence,\" and that \"it has become a Latin American practice to think that politics is the elimination physical or legal of the adversary\". * : President Miguel Díaz Canel expressed through Twitter: «From Cuba, dismayed by the attempted assassination of Cristina Fernández de Kirchner, we convey all our solidarity to the vice president, the government and the Argentine people.» Raúl Castro Ruz, former Cuban president, also elaborated on the event: \"all our solidarity and support in the face of the vile attack on your life, with the satisfaction that you have survived this reprehensible act.\" ==Controversy== After the event, several doubts arose from some sectors of the population and the media, due to the way in which the assassination attempt against Fernández was raised. For example, the police had mistakenly broken into a home of the detainee, Sabag Montiel, but his real home had been located after a person showed up at a police station claiming that he had rented it for eight months , citing the serious lack of security on the part of the police to protect Fernández, Sabag Montiel came to aim just a few centimeters from his face. The attacker posted photos of his tattoos with Nazi symbols, such as the black sun, on Instagram, which generated speculation that if he worked alone or is part of an organization; political scientist Pedro Núñez told DW Español that \"the Justice obviously has to act quickly, since the worst that could happen is that this is diluted over time and more and more conspiracy theories appear about what happened.\" Some Peronist politicians accused the opposition of promoting \"hatred\" towards Cristina Kirchner. The former president of Bolivia, Jeanine Áñez, accused Fernández of \"self-victimizing\" and \"blaming\" the opposition without any investigation and impose a political holiday. The provincial deputy of Santa Fe, Amalia Granata, said that the attack on Fernández was \"armed\" and is \"a pantomime\" to victimize her. The attack is added to the list of presidents of Argentina who suffered assassination attempts ==References== Category:2022 crimes Category:2020s in Argentina Category:2022 in South America Category:September 2022 events",
 "title": "Attempted assassination of Cristina Fernández de Kirchner"
}