{
 "id": "956756",
 "text": "Esteban José Bullrich (Born, May 26, 1969) is a Bachelor of Systems and Argentine politician. He served as a national senator from 2017 to 2021 for the province of Buenos Aires. He was previously a national deputy (2005-2007, 2009), Minister of Social Development (2007-2008) and Education (2010-2015) of the city of Buenos Aires and Minister of Education of Argentina (2015-2017). ==Biography== ===Beginnings=== He was born on May 26, 1969 in the City of Buenos Aires. He is the son of Esteban Bullrich Zorraquín (great-grandson of Adolfo Bullrich, founder of what is now known as Patio Bullrich) and María Ocampo Alvear. He is also the third cousin of Patricia Bullrich. He received a Bachelor of Systems from the CAECE University, and has a Master in Business Administration from the Kellogg School of Management at Northwestern University (USA). He ventured into politics under the guidance of Ricardo López Murphy. At the age of 34, he led the party's youth, then held the first Vice Presidency of Recreate Capital. ===Minister of Education=== Mauricio Macri became president in 2015, and announced that he would be his minister of education. His mandate ended in 2017, after he became a senator. He was replaced by Alejandro Finocchiaro. As a senator, he opposed the national campaign for legal, safe and free abortion in 2018, stating religious arguments to do so. ===National Senator (2017-2021)=== In 2017 he presented himself as the first candidate for senator for Cambiemos in the province of Buenos Aires, winning the elections on October 22 with 42.15% of the votes. On December 9, 2021, he presented his resignation in the upper house. ==Personal life== Bullrich is married to María Eugenia Sequeiros, with whom he has five children: Luz, Margarita, Agustín, Lucas, and Paz Bullrich. Bullrich is a devout Catholic. ===Health problems=== On April 28, 2021, Esteban Bullrich declared to the media that he was diagnosed with Amyotrophic lateral sclerosis (ALS), a neurodegenerative disease that currently has no cure and whose treatments are palliative. On June 28, 2022, he appeared at the Movistar Arena stadium located in Buenos Aires, in order to publicize more about his disease and raise funds to create the first Argentine center specialized in the care of ALS patients. This event called \"La vida es hoy\" (\"The Life is today\") had the participation of different artists such as Silvina Moreno and Diego Torres. On August 31, 2022, he was hospitalized for \"respiratory difficulty\". ==References== == Other websites == * Official website * * Category:1969 births Category:Living people Category:Argentine politicians",
 "title": "Esteban Bullrich"
}