{
 "id": "956815",
 "text": "Michael John Knowles (born March 18, 1990) is an American former actor and political commentator. He co-hosts a podcast with Ted Cruz. ==Articles== In 2016, Knowles wrote an article for The Daily Wire called“An Actual Conservative’s Guide to the Alt-Right. In it, he criticized Milo Yiannopoulos, Steve Bannon and Donald Trump and accused them of being too close to the alt- right. In the same article Knowles criticized the alt-right for racism and anti-Semitism. He said it went against the ethics and morals of Christianity. ==Videos== Since then Knowles filmed a Prager University video called “What is the Alt-Right. Knowles said that the alt-right actually had much more in common with left-wing politics than with right-wing politics. Knowles wrote a book called Reasons to Vote for Democrats about all the reasons to vote for the Democratic Party of the United States and the book had no words in it as a joke. It was praised by Ben Shapiro and Donald Trump. Knowles also filmed a Prager University video called “Control the Words, Control the Culture”. It is about how language can be used as a political tool. And inspired by that video, Knowles wrote a book called Speechless: Controlling Words, Controlling Minds. He argues that conservatives should support certain forms of censorship and cancel culture to fight back against left-wing politics. He also filmed a Prager University video called Conservatives Are the Real Environmentalists in which he says that right-wing politics are better for the environment than left-wing politics are. He also made a Prager University video called Celebrating Columbus. He says people should continue to celebrate Columbus Day despite criticism of Christopher Columbus. == Book club == Knowles also hosts a book club for Prager University. ==Controversies== Knowles was banned from ever again appearing on Fox News after he called Greta Thunberg a “mentally ill child” being exploited by the Left. In 2022, The New York Times criticized Knowles for having said on Twitter “the 2020 election was obviously rigged”. Knowles is also extremely critical of Never Trumpers. == References == Category:1990 births Category:Living people",
 "title": "Michael J. Knowles"
}