{
 "id": "957006",
 "text": "Bride kidnapping is when a man abducts the woman he wants to marry. The practice is also known as marriage by abduction or marriage by capture, Bride kidnapping (which is often shortened to bridenapping) has been practiced around the world, throughout history. Peoples as diverse as the Hmong in Southeast Asia, the Tzeltal in Mexico, and the Romani in Europe have done it. Bride kidnapping still occurs in different parts of the world. It is most common in the Caucasus and Central Asia. Most countries see bride kidnapping as a sex crime, and not as a valid form of marriage. In some cases, it is seen somewhere between a forced marriage and an arranged one. In many cases, the woman will cooperate with the kidnapper, to save her face, or to save the honour of her family or her parents. Many countries also have laws that say that this is not a crime, if the woman later marries the man. Very often, there are also customs, which see bride kidnapping as some form of tradition. In most nations, bride kidnapping is considered a sex crime because of the implied element of rape, rather than a valid form of marriage. Some types of it may also be seen as falling along the continuum between forced marriage and arranged marriage. The term is sometimes confused with elopements, in which a couple runs away together and seeks the consent of their parents later. In some cases, the woman cooperates with or accedes to the kidnapping, typically in an effort to save face for herself or her parents. In many jurisdictions, this used to be encouraged by so-called marry-your-rapist laws. Even in countries where the practice is against the law, if judicial enforcement is weak, customary law (\"traditional practices\") may prevail. Bride kidnapping is often (but not always) a form of child marriage. It may be connected to the practice of bride price, wealth paid by the groom and his family to the bride's parents, and the inability or unwillingness to pay it. Bride kidnapping is when one man (or a man and his friends) abduct one woman. When this is done on a larger scale (a large group of men abducting many women), this is known as raptio, and different from bride kidnapping. In the 21st century, there have been more cases of war rape, which may have elements of bride kidnapping. Women and girls abducted by groups such as Boko Haram in Nigeria, the Lord's Resistance Army in Uganda and ISIS in the Middle East have been taken as wives by their abductors. In some countries, there are still rituals, which involve a symbolic bride kidnapping as part of a wedding. Some say that the honeymoon is a relic of such a practice: the husband going into hiding with his wife to avoid reprisals from her relatives, with the intention that the woman would be pregnant by the end of the month. == References == Category:Marriage Category:Kidnapping Category:Sex crimes",
 "title": "Bride kidnapping"
}