{
 "id": "957592",
 "text": "Ezekiel Elijah Elliott (born July 22, 1995) is an American football player. He played in the position of running back for the Dallas Cowboys of the National Football League (NFL). He played college football at Ohio State. From there, he got second-team All-America honors in 2015. He was a three-time Pro Bowl and two-time All-Pro selection. He showed the league in rushing yards in 2016 and 2018. == Early life == Elliott was born in Alton, Illinois. Their parents were both athletes in college. His father, Stacy, was a linebacker for the Missouri football team and CEO of Fifth Down Enterprises. Elliott's maternal grandfather played basketball for Drake University. His uncle is Finnish professional basketball player Shawn Huff. == College career == He was a true freshman at Ohio State University in 2013. Elliott rushed for 262 yards on 30 carries with two touchdowns as a backup to starter Carlos Hyde. == Professional career == Elliott was known as the most complete back to enter the NFL before the draft in 2007. He was predicted to be a top 10 selection. Elliott was selected in the first round with the fourth overall pick by the Dallas Cowboys in the 2016 NFL Draft on April 28, 2016. He was the first running back selected in the draft that year. Elliott was widely regarded as an early favorite for the 2016 Offensive Rookie of the Year. == Personal life == Elliott bought his parents a new house after signing his rookie contracts. He studied marketing at Ohio State University. In August 2020, Elliott became a shareholder of OnCore Golf Technology, Inc.. It is a manufacturer of golf balls located in Buffalo, New York. In May 2021, the police cited Elliott, after one of his dogs bit and injured two people in his Frisco neighborhood. == References == == Other websites == * Twitter * Ohio State Buckeyes bio * Dallas Cowboys bio Category:Dallas Cowboys players Category:American football running backs Category:African-American players of American football Category:Living people Category:1995 births",
 "title": "Ezekiel Elliott"
}