{
 "id": "957766",
 "text": "Irina Ivanovna Alfyorova PARУказ Президента Российской Федерации от 14 февраля 2007 года № 160 (; born 13 March 1951, Novosibirsk, Soviet Union) is a Soviet and Russian actress. ==Selected filmography== Year English Title Original Title Role 1971 Alekseich Алексеич Marya Alexandrovna, rural teacher 1972 A Teacher of Singing Учитель Пения Tamara, daughter of the Solomatins 1977 Black Birch Чёрная Береза Tanya 1977 Walking Through the Torments Хождение по Мукам Daria (Dasha) Dmitrievna Bulavina-Telegina 1978 Autumn Bells Осенние Колокола Queen 1978 d'Artagnan and Three Musketeers д'Артаньян и Три Мушкетёра Constance Bonacieux 1979 Exile No. 011 Ссыльный №011 Alisa Varlamtseva 1980 Uninvited Friend Незваный Друг Kira Strugina 1980 Do Not Part With Your Beloved С Любимыми не Расставайтесь Katya Lavrova 1981 Courage Мужество Clara, architect 1981 Fairy Lala Фея Лала Queen Iris 1982 For No Apparent Reason Без Видимых Причин Nina Petrovna Plyusnina, actress 1982 Vasily Buslaev Василий Буслаев Ksenia 1982 Premonition of Love Предчувствие Любви Elena 1982 Saturday and Sunday Суббота и Воскресенье The mother of a child who dreams of having a dog 1983 Kiss Поцелуй Sonya, a young lady in lilac 1984 The Right to Choose Право на Выбор Tanya 1984 Seven Elements Семь Стихий Valentina Anurova, biologist 1984 TASS Is Authorized to Declare... ТАСС Уполномочен Заявить... Olga Winter 1985 Love Letters with Intent Любовные Письма с Умыслом Melita 1985 Bagration Багратион Princess Elizabeth Skavronskaya 1985 Rough Landing Грубая Посадка Tasia 1985 Two Knew the Password Пароль Знали Двое Irina Kabardina 1985 Man With an Accordion Человек с Аккордеоном Lena (Lyola) Glan 1985 Beauty Salon Салон Красоты Lyalya, Vadim's wife 1985 Did You Call the Snow Maiden? Снегурочку Вызывали? Svetlana Aleksandrovna Nechaeva, actress (Snegurochka) 1987 Such a Story Вот Такая История Galya 1989 And Everything Will Repeat... И Повторится Всё... Anna 1991 Top Class Высший Класс Vera Pavlovna Smirnova 1991 Star of the Sheriff Звезда Шерифа Anna Blay 1991 Blood For Blood Кровь за Кровь Elena G. Vanina 1991 Night Fun Ночные Забавы Anna (Anya) Nikolaevna Silina, wife of Alexei, mother of Olga, mistress of Mikhail Ezepov 1993 Countess Dora Графиня Дора Sidonia Nadgerni 1996 Ermak Ермак Alena, concubine of Khan Kuchum 1997 Love Stories Любовные Истории Tamara 2000 Paradise Lost Потерянный Рай Olga Sapega, Artyom's wife 2001 Lisa Alisa Лиса Алиса Natalie, wife of the cultural attaché 2006 Hero of Our Time Герой Нашего Времени Princess Ligovskaya 2006 Sonya Сонька Mrs. Elena, dressmaker 2007 Trap Капкан Ekaterina Andreevna Volobueva, wife of Mikhail Grigorievich Volobuev 2007 Debt Долг Sofia Markovna 2010 Old People Старики Vera 2011 Yolki 2 Ёлки 2 Yulia Snegireva, beloved of Grigory Zemlyanikin and Boris Vorobyov 2011 Raspoutine Распутин Zinaida Yusupova 2013-2015 The Last of the Magikyans Последний Магикян Lyudmila Sergeevna, mother of Natasha, mother-in-law of Karen Magikyan 2016 Yolki 5 Ёлки 5 Yuliya Snegireva 2018 Last Test Последнее Испытание Natalya Ivanovna 2019 Happiness Is... Part 2 Счастье – это… Часть 2 2020 Whirlpool Водоворот Beata Kocharovska ==References== ==Other websites== * * Official website Category:1951 births Category:Living people Category:Russian movie actors Category:Russian television actors Category:Russian stage actors Category:Soviet actors",
 "title": "Irina Alfyorova"
}