{
 "id": "958596",
 "text": "\"Rufst du, mein Vaterland?\" (\"Do you call, my Fatherland?\") was the national anthem of Switzerland from 1848 to 1961. In 1961, Switzerland changed their national anthem to the Swiss Psalm. It was sung to the tune of God Save the King, the British national anthem. The german lyrics were written in 1811 by Johann Rudolf Wyss. ==Lyrics== ===German lyrics=== The song originally had seven verses, but only the first, second and sixth were commonly sung. German original Close translation Singable, poetic translation Swiss German translation Rufst du, mein Vaterland? Sieh uns mit Herz und Hand All dir geweiht! Heil dir, Helvetia! Noch sind der Söhne da, Wie sie Sankt Jakob sah, Freudvoll zum Streit! Do you call, my Fatherland? See us with heart and hand All devoted to you! Hail to you, Helvetia! You still have sons, Like St. Jacob saw them, Joyfully hasten to the battle. Call'st thou, my Fatherland? See us with heart and hand Vowed to thee, all! Helvetia! hail to thee! True still thy sons shall be, Like them Saint James did see, Leap at war's call! Riefsch du, mis Vaterland Gsehsch uns mit Härz und Hand All dir gweiht Heil dir, Helvetia! Hesch no dr Söhn hejo, Wie si St. Jakob gseh het, Freudvoll zum Stritt! Da, wo der Alpenkreis Nicht dich zu schützen weiss Wall dir von Gott, Stehn wir den Felsen gleich, Nie vor Gefahren bleich, Froh noch im Todesstreich, Schmerz uns ein Spott. There where the circle of the Alps Does not protect you, Rampart made by God, There we stand like rocks, Never turn pale, facing the danger, Happy even in the lethal stroke, Agony a jest to us. There where no Alp-bound Circling thy land around, God's hand hath thrown, Steadfast we stand alike, Blenching not, mountain-like, Still, even though death should strike, Scorning to groan. Do, wo dr Alpekreis nit dich zschütze weiss Wall dir vo Gott, Stömmer dr Felse gliich, Nie vor Gfohre bleich, Froh no im Todesstreich, Schmärz uns e Spott. Nährst uns so mild und treu, Hegst uns so stark und frei, Du Hochlands Brust! Sei denn im Feld der Not, Wenn Dir Verderben droht, Blut uns ein Morgenrot, Tagwerks der Lust. You nourish us mild and true, Raise us so strong and free, You highland's bosom! So be then in the field of danger, When destruction threatens you, Blood us a dawn Labour of joy. Nährsch uns so mild und treu, Hegsch uns so stark und frei, Du Hochlandbrust! Sig denn im Fäld vor Not, Wenn Dr Verdärbe droht, Bluet uns e Morgerot, Tagwerk vor Luscht. Sanft wie der Alpensee, Sturmlos am Gletscherschnee Weht unser Mut. Graus tobt der See geschreckt Wenn ihn Gewitter deckt; So wir zum Kampf erweckt: Wut wider Wut. Gentle like the alpine lake, Stormless on the glacial snow Our courage moves. Dreadfully the lake rages, startled, When thunderstorm covers it, So do we, when awakened to the battle, Rage against rage. Nährsch uns so mild und treu, Hegsch uns so stark und frei, Du Hochlandbrust! Sig denn im Fäld vor Not, Wenn Dr Verdärbe droht, Bluet uns e Morgerot, Tagwerk vor Luscht. Und wie Lawinenlast Vorstürzt mit Blitzeshast – Grab allumher – Werf in den Alpenpfad, Wenn der Zerstörer naht, Rings sich Kartätschensaat Todtragend schwer. And like avalanche's load Crashes down with the speed of lightning – all around a tomb – May into the alpine path, When the destroyer advances, Canister shell's seed be thrown all around Fatally heavy. Nährsch uns so mild und treu, Hegsch uns so stark und frei, Du Hochlandbrust! Sig denn im Fäld vor Not, Wenn Dr Verdärbe droht, Bluet uns e Morgerot, Tagwerk vor Luscht. Frei, und auf ewig frei, Ruf' unser Feldgeschrei, Hall' unser Herz! Frei lebt, wer sterben kann, Frei, wer die Heldenbahn Steigt als ein Tell hinan. Nie hinterwärts! Free, forever free! may this be our battle cry, may this echo in our hearts! Free lives, who is ready to die, Free, who unto the hero's path ascends like Tell, Never moving backwards! Free and for ever free! This shall our war-cry be— Heart's cry — for ever! Free lives who dreads not death, Free, who the hero's path Tell-like upmounted hath, Falteringly never! Vaterland, ewig frei, Sig unser Fäldgeschrei, Siig oder Tod! Frei läbt, wär stärbe cha, Frei, wär die Heldebahn Stigt als e Tell hinan. Mit uns dr Gott! Free and for ever free! This shall our war-cry be— Heart's cry — for ever! Free lives who dreads not death, Free, who the hero's path Tell-like upmounted hath, Falteringly never! But where peace smiles, After the raging battles Crowding game; O, there be more beautiful in store, Far from the weapon's horror Home, to build your fortune, Be our goal! Doch, wo dr Fride lacht Noch dr empörte Schlacht Drangvollem Spiel, O do vil schöner, traun, Färn vo dr Waffe Grau’n, Heimat, dis Glück zu bau’n Winkt uns s Ziil! ===French lyrics=== French original English translation Ô monts indépendants, Répétez nos accents, Nos libres chants. A toi patrie, Suisse chérie, Le sang, la vie De tes enfants. O independent mountains, Repeat our words, our free songs. To you, fatherland, Dear Switzerland, The blood and the life of your children. Nous voulons nous unir, Nous voulons tous mourir Pour te servir. Ô notre mère ! De nous sois fière, Sous ta bannière Tous vont partir. We want to unite, We all are ready to die At your service O our mother! Be proud of us, Under your banner We all will leave. Gardons avec fierté L'arbre au Grutli planté La liberté ! Que d'âge en âge, Malgré l'orage, Cet héritage Soit respecté. Let us guard with pride The tree planted in Grütli, The freedom! From generation to generation, In spite of the storm, This heritage Is respected. Tu soutins nos aïeux, Tu nous rendra comme eux, Victorieux ! Vers toi s'élance Notre espérance, La délivrance Viendra des cieux. You supported him our ancestors You make us like them, Victorious! To you rushed Our hope The issue will come of heaven. ===Italian lyrics=== Italian original English translation Ci chiami, o Patria? Uniti impavidi snudiam l'acciar! Salute Elvezia! Tuoi prodi figli, Morat, Sant' Giacomo, non obliar! Are you calling us, o fatherland? United and fearless we unsheathe the sword! Hail, Helvetia! Your brave sons, Murten, St. Jacob, do not forget! Laddov'è debole dell'Alpi l'egida che il ciel ci diè. Ti farem argine dei petti indomiti: È dolce, o Elvezia morir per te! Where is weak The Alps' aegis that heaven gave us, We'll make your bank by indomitable chests: It is sweet, Helvetia to die for you! Ma quando l'angelo Di pace assidesi Sui nostri allor, Soletta Elvezia, L'arti e l'industrie, Oh! Quanto apprestano Nuovo splendor! ===Romansh lyrics=== Romansh original English translation E clomas, tger paeis, iglis ties unfants baleis an grevs cumbats. Nous suandagn gugent igl ties appel gugent cugl Spiert e cor valent digls antenats. Ma noua tg’igl rampar n’at pò betg ple tgirar, è igl Signour. Sot sia protecziun, davaint’igl pour liun, stat aint cun persvasiun per noss’onour. Ma noua tg’igl rampar n’at pò betg ple tgirar, è igl Signour. Sot sia protecziun, davaint’igl pour liun, stat aint cun persvasiun per noss’onour. ==References== Category:Historical anthems Category:Swiss anthems Category:1810s songs",
 "title": "Rufst du, mein Vaterland"
}