{
 "id": "958813",
 "text": "Chittaranjan Das (5 November 1870 – 16 June 1925), popularly called Deshbandhu (Friend of the Nation), was an Indian freedom fighter, political activist and lawyer. He played an important role during the Indian independence movement. He founded of the Swaraj Party (Independence party) in Bengal during the period of British colonial rule in India. == Early life == Chittaranjan Das was born in Calcutta on 5 November 1870. His family were members of Brahmo Samaj. Das was the son of Bhuban Mohan Das, and nephew of the Brahmo social reformer Durga Mohan Das. His father was a solicitor and a journalist. He edited the English church weekly, The Brahmo Public Opinion. His eldest grandson was Siddhartha Shankar Ray (former chief minister of West Bengal) and his granddaughter is Justice Manjula Bose. He is commonly known as Desh Bandhu. It is an honorific name meaning \"Friend of the nation\". == Career == === Lawyer === Chittaranjan Das again took the brief and successfully defended Sri Aurobindo Ghosh on charges of involvement in the Alipore bomb case in 1909. In his Uttarpara speech, Sri Aurobindo gratefully acknowledged that Chittaranjan Das broke his health to save him. Das made this last statement after an eight day long deliberation. He was actively involved in the activities of Anushilan Samiti. === Politics === Das was a leading figure in Bengal during the Non-Cooperation Movement of 1919–1922. He requested to the people to ban on British-made clothes. It set an example by burning his own European clothes and wearing Khadi clothes. He was the first mayor of Calcutta. He beleived in non-violence and constitutional methods for the realisation of national independence. He advocated Hindu-Muslim unity, cooperation and communal harmony and championed the cause of national education. He resigned his presidency of the Indian National Congress at the Gaya (in Bihar) session after losing a motion on \"No Council Entry\" to Gandhi's faction. He then founded the Swaraj Party, with veteran leader Motilal Nehru and young Hussain Shaheed Suhrawardy, in 1923, to express his uncompromising opinion and position. === Poetry === Das was also known as a distinguished Bengali poet. During the days of National movement, he published the first two volumes of his collection of poems titled \"Malancha\" and \"Mala\". In 1913 he published .\"Sagar Sangeet\" (The Songs of the Sea). Sri Aurobindo was in Pondichery. He was in dire need of financial support. Chittaranjan offered him one thousand rupees as a token of his support for an English translation of the poem. == Death == In 1925 Chittaranjan's health began to fail due to overwork. Chittaranjan went to Darjeeling to recuperate his health staying at Sir N. N. Sircar's house \"Step Aside\" in May 1925. Mahatma Gandhi visited him and stayed with him for some days. Gandhiji wrote, He died on 16 June 1925. == Legacy == * Chittaranjan National Cancer Institute of Kolkata had its humble beginning in the year 1950. Before that, the Chittaranjan Cancer Hospital was founded in the premises of Chittaranjan Seva Sadan. A few years before his death, Chittaranjan gifted this property including his house and the adjoining lands to the nation to be used for the betterment of the lives of women. * Chittaranjan Park, home to large Bengali community, originally EPDP Colony in South Delhi was named after Deshbandhu Chittaranjan Das during 1980's. == References == Category:Indian lawyers Category:1925 deaths Category:1870 births Category:Indian activists Category:Presidents of the Indian National Congress Category:Indian National Congress politicians",
 "title": "C. R. Das"
}