{
 "id": "958955",
 "text": "Le Chant des Wallons (\"The Song of the Walloons\"; ) is the anthem of Wallonia in Belgium. It was written by Théophile Bovy in 1900 in the Walloon language. It (along with the region's flag and coat of arms) became officially recognized on 15 July, 1998. ==Lyrics== Most of the time only the first and third verses are sung. Below are the full lyrics, with translations into English and French. Walloon original French translation English translation (poetic) Nos estans firs di nosse pitite patreye, Ca lådje et lon, on djåze di ses efants. Å prumî rang, on l' mete po l' industreye Et dvins les årts, ele riglatixh ostant. Nosse tere est ptite, mins nos avans l' ritchesse Des omes sincieus k' anôblixhèt leu nom. Et nos avans des libertés timpesse: Vola pocwè k' on-z est firs d' esse Walons ! Nous sommes fiers de notre Wallonie, Le monde entier admire ses enfants. Au premier rang brille son industrie Et dans les arts on l'apprécie autant. Bien que petit, notre pays surpasse Par ses savants de plus grandes nations. Et nous voulons des libertés en masse : Voilà pourquoi l'on est fier d'être Wallons ! Of our Wallonia we are proud. Rever'd are Her children o'er the world Behold the triuer the world. Behold the triumph of Her industry, The grandeur of Her arts! Though our land be small, yet Her science That of many a populous nation surpasseth Our freedom is what we yearn for most 'Tis why we’re proud to be Walloons! Di nosse passé cwand c' est k' on lét l' istwere, On s' recresteye vormint a tchaeke foyou. Et nosse cour crexhe cwand c' est k' on tuze al glwere Di nos vîs peres ki n' avît måy pawou. C' est gråce a zels ki ns djouwixhans del påye. Il ont språtchî l' innmi dzo leu talon. On ls a rclamé les pus vayants k' i gn åye: Vola pocwè k' on-z est fir d' esse Walon ! Entre Wallons, toujours on fraternise. Dans le malheur, on aime s'entraider : On fait le bien sans jamais qu'on le dise, En s'efforçant de le tenir caché. La charité visitant la chaumière S'y prend le soir avec cent précautions : On donne peu, mais c'est d'un cœur sincère : Voilà pourquoi l'on est fier d'être Wallons ! We, Walloons, brothers to each other And assuage one another in disaster Without boast we succeed And try to keep it classified Charity a poor cottage visiteth By night and cautiously goeth A bit we may give, but from the heart it cometh. 'Tis why we're proud to be Walloons! Pitit payis, vos k' a tant d' grandeu d' åme, Nos vos inmans bén, sins k' nos l' breyanxhe tot hôt. Cwand on vs kidjåze, ås ouys montèt nos låmes Et nos sintans nosse cour bate a gros côps ! N' åyîz nole sogne et vikez e liyesse, Di vos efants, les bresses et l' cour sont bons. Et nos avans les tchveas foirt près del tiesse: Vola pocwè k' on-z est fir d' esse Walon ! Petit pays, c'est pour ta grandeur d'âme Que nous t'aimons, sans trop le proclamer. Notre œil se voile aussitôt qu'on te blâme Et notre cœur est prêt à se briser. Ne crains jamais les coups de l'adversaire. De tes enfants les bras te défendront Il ne faut pas braver notre colère: Voilà pourquoi l'on est fier d'être Wallons ! As brothers in Wallonia we love each other We're pleased to shake hands with one another. Yet we're content of not often revealing so. When it wants to do good no one appeareth. The house that charity entereth That to night with a thousand cares goeth. The little that giveth no one in secret giveth: 'Tis why we're proud to be Walloons! On s' voet voltî inte frés del Walonreye Et on-z est presse onk l' ôte a s' diner l' mwin. On fwait plaijhi bén sovint sins k' on l' deye. Nouk ni s' håynêye cwand c' est k' i vout fé l' bén. Li tchårité ki mousse el måjhinete N' î va k' al nute avou meye precôcions. Li pô k' on dene on nel dene k' e catchete: Vola pocwè k' on-z est fir d' esse Walon ! On s'aime entre frères de Wallonie Et on est prêts l'un l'autre à se donner la main. On fait plaisir bien souvent sans qu'on ne le dise. Nul ne s'affiche quand il veut faire le bien. La charité qui entre dans la maisonnette N'y va que de nuit avec mille précautions. Le peu qu'on donne on ne le donne qu'en cachette: Voilà pourquoi nous sommes fiers d'êtres Wallons ! As brothers in Wallonia we love each other We're pleased to shake hands with one another. Yet we're content of not often revealing so. When it wants to do good no one appeareth. The house that charity entereth That to night with a thousand cares goeth. The little that giveth no one in secret giveth: 'Tis why we're proud to be Walloons! ==Related pages== * De Vlaamse Leeuw Category:Belgian anthems Category:Wallonia",
 "title": "Le Chant des Wallons"
}