{
 "id": "959277",
 "text": "The Pas station is a station in The Pas, Manitoba, Canada. The station is served by Via Rail's Winnipeg – Churchill train and the Keewatin Railway train to Pukatawagan, which is also run by Via. The station building was built in 1928 and was designated historical in 1992. == History == The station was built as the terminus of what would become the Hudson Bay Railway in 1908.Piper, Liza (2010). The Industrial Transformation of Subarctic Canada. UBC Press. ISBN 9780774858625.p.52 At first it served by terminating services from the cities in the south. but later destinations were expanded. By 1929 trains were running to Churchill, Thompson, Flin Flon, Lynn Lake, Winnipeg, Saskatoon and Prince Albert. By the 1960s all train services were operated by CN. In 1978 Serives were taken over by Via Rail whom at the time operated a total of 18 departures per week out of the station. The 1978 timetable consisted of: * 3tpw to Thompson * 3tpw to Churchill via Thompson * 3tpw to Lynn Lake * 3tpw to Saskatoon * 6tpw to Winnipeg (3 via Canora, 3 via Swan River) In 1980 terminating services from Saskatoon were cancelled. Then in 1981 Via received a budget cut which saw tri-weekly services to thompson and to Winnipeg via Swan River discontinued. In 2002 services to Lynn Lake were cut back to Pukatawagan followed by the service being cancelled in 2006 and replaced by a twice weekly mixed use train operated by the local first nations. In 2011 one of the 3 weekly trips to and from Churchill was made to terminate here rather than continue on to Winnipeg. In 2018 flooding saw services to Churchill cut back to Gillam and they weren't restored until over a year later. During the Covid 19 Pandemic terminating services were cancelled and service to Winnipeg and Churchill were retained on a once weekly freequency. This is because the route served vital communites without reliable road access. Service has since reached pre-pandemic levels. == Services == Currently The Pas sees 7 departures per week to a few destinations: * 3tpw to Churchill Via Thompson * 2tpw to Winnipeg * 2tpw to Pukatwagan The Pas also sees 1 train per week which arrives from Churchill which terminates there. == References == Category:Rail transport in Canada",
 "title": "The Pas station"
}