{
 "id": "95979",
 "text": ":For the 1936-1939 Spanish Civil War units, see Louise Michel Battalions Louise Michel (29 May 1830 – 9 January 1905) was a French anarchist, school teacher and medical worker. She sometimes used the pseudonym Clémence and was also known as the red virgin of Montmartre. == Life == Louise Michel was born at the Château of Vroncourt (Haute-Marne) on 29 May 1830, the daughter of Marianne Michel, and of Etienne Charles Demahis. She was brought up by her father's parents, and received a libertaria education. After her grandfather's death in 1850 she was trained to teach, but after few times she saw that Napoleon III prevented her from serving in a state school. She became violently anti-Bonapartist, and is said to have thought about the assassination of Napoleon III. She became anarchist in 1866 to a school in the Montmartre quarter of Paris, where she saw that his destiny was to work for charity and follow the revolution. == Paris == She was active during the Paris Commune as an ambulance woman, she helped mutilated or injured on the barricades. During the Siege of Paris she was in resistance against the Prussians. On the establishment of the Commune, she joined the National Guard. She offered to shoot Thiers, and suggested the destruction of Paris for its surrender.Edith Thomas, The Women Incendiaries: The Inspiring Story of the Women of the Paris Commune \"\", Haymarket Books. Accessed June 23, 2009. She was with the Communards who made their last stand in the cemetery of Montmartre, and was closely allied with Théophile Ferré, who was executed in November 1871. Michel dedicated a moving farewell poem to Ferré, l’œillet rouge (The Red Carnation). It is without a doubt that upon learning of this loss, Victor Hugo dedicated his poem to Michel, Viro Major. This ardent attachment was perhaps one of the sources of the exaltation which marked her career, and gave many handles to her enemies. After December 1871, she began composing revolutionary propaganda; demanding assistance for poor people, other measures which threatened the government, and calls for the disenfranchised to arm themselves. She herself took up arms as well and donned a military style uniform. She never renounced the Commune, and after various legal maneuvers city judges sentenced her to death. She spent twenty months in prison and was sentenced to deportation. == Deportation == She was put onto the ship Virginie on the 8th of August, 1873, to be deported. She arrived in New Caledonia 4 months later. On board, she met Henri Rochefort, a famous polemist, who became her friend until her death. She also met Nathalie Lemel, another figure active in the commune. Louise was in New Caledonia for seven years. She refused special treatment reserved for women. In 1878, she was a leader in a revolt. The following year, she received authorisation to become a teacher in Nouméa for the children of the deported—among them many Kabyles (Kabyles du Pacifique) from Cheikh Mokrani's rebellion (1871)—and later in schools for girls. == Return to France == Michel returned to Paris in 1880 after amnesty was given to the Communards. Her revolutionary spirit never died and she controlled freely a libertarian school. She travelled everywhere in France, supporting revolution. In 1883, she led a Paris mob which pillaged a baker's shop. For this she was given six years imprisonment, but was released in 1886, at the same time as Kropotkin and other prominent anarchists. After a short period of freedom she was again arrested for speaking bad about the social system. She was soon free again, but, hearing that her enemies hoped to put her in a lunatic asylum, she went to England in 1890. She returned to France in 1895, taking part in the revolt made by the Dreyfuss affair in 1898. Few months ago she was constantly followed by the police, until she died in \"Room 11\", in the Hotel Oasis, Marseilles on 10 January 1905. == The women in the social == Michel became highly admired by French workers and revolutionaries, particularly for her association with the Paris Commune. From after her death until 1916, a demonstration was held every year at her tomb at Levallois-Perret. Frequently, the language used to describe her is that reserved for saints and heretics; she is often referred to as \"Bonne Louise\" (Good Louise) or the \"Vierge rouge\" (red Virgin). She was always respected same in periods when women were without right. == The Metrò == On 1 May 1946, the Parisian métro station \"Vallier\" was renamed Louise Michel, see: Louise Michel (Paris Metro). == Articles and books == * À travers la vie, poetry, Paris, 1894. * Le Bâtard impérial, by L. Michel and J. Winter, Paris, 1883. * Le claque-dents, Paris. * La Commune, Paris, 1898. * Contes et légendes, Paris, 1884. * Les Crimes de l'époque, nouvelles inédites, Paris, 1888. * Défense de Louise Michel, Bordeaux, 1883. * L'Ère nouvelle, pensée dernière, souvenirs de Calédonie (prisoners' songs), Paris, 1887 * La Fille du peuple par L. Michel et A. Grippa, Paris (1883) Fleurs et ronces, poetry, Paris, * Le Gars Yvon, légende bretonne, Paris, 1882. * Lectures encyclopédiques par cycles attractifs, Paris, 1888. * Ligue internationale des femmes révolutionnaires, Appel à une réunion. Signed \"Louise Michel\", Paris, 1882. * Le livre du jour de l'an : historiettes, contes et légendes pour les enfants, Paris, 1872. * Lueurs dans l'ombre. Plus d'idiots, plus de fous. L'âme intelligente. L'idée libre. L'esprit lucide de la terre à Dieu... Paris, 1861. * Manifeste et proclamation de Louise Michel aux citoyennes de Paris, Signed \"Louise Maboul\", Paris, 1883. * Mémoires, Paris, 1886, t. 1. * Les Méprises, grand roman de mœurs parisiennes, par Louise Michel et Jean Guêtré, Paris, 1882. * Les Microbes humains, Paris, 1886]. * La Misère by Louise Michel, 2nd part, and Jean Guêtré 1st part, Paris, 1882. * Le Monde nouveau, Paris, 1888 * Vol. I. Avant la Commune. Preface by Laurent Tailhade, Alfortville, 1905. * Les Paysans by Louise Michel et Émile Gautier, Paris, (Incomplete). * Prise de possession, Saint-Denis, 1890. * Le Rêve (in a work by Constant Martin), Paris, 1898. * Légendes et chants de gestes canaques. Présentation. Gérard Oberlé. Edition 1900. 1988. * , edition established by Xavière Gauthier, Édition de Paris-Max Chaleil, 1999. ==Related pages== * Anarchism in France * Louise Michel Battalions - Spanish Civil War ==References== ==Other websites== * Louise Michel archive at the Anarchy Archives * Les Louise Mitchels - French D.I.Y. jazz-punk band influenced by the life and work of Louise Michel Category:1830 births Category:1905 deaths Category:French anarchists Category:French teachers",
 "title": "Louise Michel"
}