{
 "id": "959737",
 "text": "Lieutenant General Paul Francis Wynnyk, (born June 29, 1964) is a former Canadian Army officer. He served from 2016 to 2018 as Commander of the Canadian Army. On July 16, 2018, he became the Vice Chief of the Defence Staff, until his retirement in July 2019. == Early life == Paul Wynnyk is of Ukrainian descent. He was the grandson of emigrants in Alberta from Radvantsi, Lviv region, in Western Ukraine. He was born in Edmonton on June 29, 1964, and was raised in the village of Breton, Alberta. Wynnyk attended Royal Roads Military College and the Royal Military College of Canada. He was commissioned into the Canadian Military Engineers in 1986. He became commanding officer of 1 Combat Engineer Regiment in Edmonton in 1997. Then he became the commander of 1 Area Support Group in 2004. Later, he was sent to Combined Security Transition Command in Afghanistan as Assistant Commanding General in March 2009. He went on to be commander of Land Force Western Area in 2010. He became as deputy Commander of the Canadian Army in 2012 and Commander of the Canadian Forces Intelligence Command and Chief of Defence Intelligence in July 2014. In January 2016, it was announced that he would become Chief of the Army Staff and Commander of the Canadian Army. On July 16, 2018, he was named Vice Chief of the Defence Staff. In July 2019, he claimed that Chief of the Defence Staff General Jonathan Vance planned to replace him as the Vice-Chief of the Defence Staff with Vice-Admiral Mark Norman. Then he give his resignation from his position. == Post-military career == In October 2019, Wynnyk was appointed as Deputy Minister of Municipal Affairs for the Government of Alberta. == Awards and decorations == Ribbon Description Notes Order of Military Merit (CMM) * Appointed Commander (CMM) on 26 September 2013 * Appointed Officer (OMM) on 21 September 2006 Meritorious Service Medal (MSM) * Decoration awarded on 26 April 2011 * Military division South-West Asia Service Medal * with AFGHANISTAN Clasp General Campaign Star * South West Asia Ribbon * 1 Rotation Bars Special Service Medal * with NATO-OTAN Clasp Canadian Peacekeeping Service Medal United Nations Advance Mission in Cambodia Medal * UNAMIC United Nation Transitional Authority in Cambodia Medal * UNTAC United Nation Mission in the Democratic Republic of the Congo Medal * MONUC / MONUSCO Queen Elizabeth II Diamond Jubilee Medal * Decoration awarded in 2012 * Canadian version Canadian Forces Decoration (CD) * with two Clasp for 32 years of services Alberta Centennial Medal * Decoration awarded in 2005 Order of Military Merit (Brazil) * Decoration awarded 28 July 2018 * Grand Officer level * Federative Republic of Brazil award Order of Military Merit José María Córdova * Decoration awarded 29 September 2018 * Grand Cross level * Republic of Colombia award Baryaal Darajaah Uak Medal * * Decoration awarded 4 February 2011 * Successful 1st Grade * Islamic Republic of Afghanistan award Legion of Merit * Decoration awarded 28 May 2011 * Officer level * United States award He was a qualified Paratrooper and as such wore the Canadian Forces Jump Wings with Red Maple Leaf Command Commendation == References == == Other websites == Category:Living people Category:1963 births Category:Canadian military people",
 "title": "Paul Wynnyk"
}