{
 "id": "960036",
 "text": "The Confucian church ( or ) is a Confucian religious institution inspired by the Christian church.Ya-pei Kuo, 2010. Chinese people outside of China started their own Confucian churches,Yong Chen, 2012. p. 174 they are especially common in Indonesia and the United States. Since around 2000 interest in Confucianism has been growing, which has renewed talks about a national \"Confucian church\".Billioud, 2010. p. 201 The Holy Confucian Church () was started on November 1, 2015. == Related pages == * Chinese folk religion * Religious Confucianism == References == == Sources == * * * Clart, Philip. Confucius and the Mediums: Is There a \"Popular Confucianism\"?. On: T'uong Pao LXXXIX. Brill, Leiden, 2003. * Fan Lizhu, Chen Na. Revival of Confucianism and Reconstruction of Chinese Identity. Paper presented at: The Presence and Future of Humanity in the Cosmos, ICU, Tokyo, 18–23 March 2015. (a) * Fan Lizhu, Chen Na. The Religiousness of \"Confucianism\" and the Revival of Confucian Religion in China Today. On: Cultural Diversity in China 1: 27–43. De Gruyter Open, 2015. ISSN 2353-7795, DOI: 10.1515/cdc-2015-0005 * Payette, Alex. Shenzhen's Kongshengtang: Religious Confucianism and Local Moral Governance. Part of: Role of Religion in Political Life, Panel RC43, 23rd World Congress of Political Science, 19–24 July 2014. * Stephen C. Angle. Contemporary Confucian Political Philosophy. Polity, 2012. ISBN 0745661300 * Sébastien Billioud. Carrying the Confucian Torch to the Masses: The Challenge of Structuring the Confucian Revival in the People's Republic of China. On: OE 49 (2010) * Yong Chen. Confucianism as Religion: Controversies and Consequences. BRILL, 2012. ISBN 9004243739 * Ya-pei Kuo. \"Christian Civilization\" and the Confucian Church: The Origin of Secularist Politics in Modern China. On: Past and Present (2013) 218 (1): 235–264. DOI: 10.1093/pastj/gts030 * Philip Clart, Charles B. Jones. Religion in Modern Taiwan: Tradition and Innovation in a Changing Society. University of Hawaii Press, 2003. ISBN 0824825640\\. == Other websites == * China Confucian Philosophy * China Confucian Religion * China Confucian Temples * China Kongzi Network * Ruist Masters' Society * Yidan xuetang of Beijing Category:Religious Confucianism",
 "title": "Confucian church"
}