{
 "id": "960043",
 "text": "Sacrifice to Heaven (Jitian 祭天) is the worship of Shangdi originating in China. In Ancient Chinese society, nobles of all levels constructed altars for Heaven. At first only nobles could worship Shangdi but later beliefs changed and everyone could worship Shangdi. Modern Confucian organizations offer this practice to all their followers, and it's still observed in China even though there is no monarch. This tradition has also had an impact on other countries such as Japan, Vietnam, and Korea. The Chinese word \"Jì\" (祭) in the name of this practice is the same word as \"Jesa\" in Korean. == History == This practice has its roots in the Shang dynasty, but during the Zhou dynasty, it was only allowed for the Son of Heaven due to the teachings of Shendao shejiao.雷晓鹏:从清华简《系年》看周宣王“不籍千亩”的真相，《农业考古》，2014,(4) Two specific sacrifices, Sacrifice to Heaven and Feng Shan, were exclusive privileges during that time. The Temple of Heaven has been the location for this ritual since the Ming dynasty, and it still takes place there today. Some people think that Qing's involvement in the ritual resulted in the standardization of Manchu rituals through the book of Manchu rites, but this theory is not supported. In the early years of the Republic of China, Kang Youwei's Confucian movement proposed separating Religious Confucianism from the state bureaucracy, so anyone could perform the Sacrifice to Heaven as per the Christian model.康有為，《中国学会报题词》，1913。載汤志钧编：《康有为政论集》（下），北京，中华书局1981年版，第797页 Nowadays, this ritual is performed without a monarch, and it can take place at locations other than the Temple of Heaven. For example, it was performed in Fujian in 2015. == Korea == In Korea, Sacrifice to Heaven is read as Jecheon (Hanja: 祭天). It is also identified with the word yeonggo 영고 (迎鼓) and has a history linked to Korean shamanism, in addition to Chinese influence == Japan == In Japan Sacrifice to Heaven is called Saiten (祭天) . It is done for Amaterasu rather than Shangdi though. Every year, the festival of Niiname-no-Matsuri (新嘗祭) happens and most peopledo not know it has Chinese origins. The first Niiname-no-Matsuri of the reign of an Emperor is called a Daijosai. == Vietnam == In Vietnam Sacrifice to Heaven is called Nam Giao... Nguyên văn: 如 郊 天 告 廟 聖 節 正 旦 則 行 大 朝 禮 皇 帝 服 衮 冕 升 寶 座 百 官 具 朝 服 朝 冠 (Như giao thiên, cáo miếu, thánh tiết, chính đán tắc hành đại triều lễ, hoàng đế phục cổn, miện, thăng bảo toà, bách quan cụ triều phục triều quan). It was first done by Emperor Đinh Bộ Lĩnh.. Nam Giao was the most important ritual of the Nguyễn dynasty. In the Nguyen Dynasty, the Esplanade of Sacrifice to the Heaven and Earth was made to sacrifice to heaven. It was made in 1807 and sacrifices were done there until 1945 In 2002 people started doing it again. It is done in Festival Huế every two years. == Related pages == * Tian * Temple of Heaven * Wufang Shangdi ==Sources== Category:Religious Confucianism Category:Pages with unreviewed translations",
 "title": "Sacrifice to Heaven"
}