{
 "id": "960143",
 "text": "Bihu is the most prominent festival celebrated by the people of Assam. It is a set of three celebrations performed throughout the year. The three Bihus are celebrated at different times of year, in the months of Bohaag (Baisakhi), Kaati (Kartik) and Maagh, according to the Hindu calendar. These days fall in mid April, October/ November and early January. Assam is a small state in the north-eastern part of the country. Its economy is mainly based on agriculture. Hence all their daily activities and celebrations are around agriculture. These months are significant for farming the paddy. Bohaag bihu is celebrated at the seeding time of paddy. Kaati bihu is celebrated when the sowing of paddy is complete and the transformation of the saplings is done. Maagh bihu is at the harvesting period of the crop. The word bihu is derived from the language of ‘dimasa kacharis’, which is the agricultural community of Assam, since ages. The word was originally ‘Bishu’, which meant ‘to ask for prosperity’ from the tribal god. Bihu is the distorted version of Bishu. Bohaag bihu is also known as Rongali bihu. It is celebrated with the highest joy and mirth among all the three bihus. Bohaag is the first month according to Assamese calendar. it is also celebrated as the New Year festival. People greet the coming season of spring with enthusiasm. Rongali bihu is celebrated over a period of 7 days.The first day is known as goru bihu. Cows are washed and worshipped. This is followed by manuha bihu. Human beings take early day bath and wear new clothes. Then on the third day deities are worshipped and washed. The celebrations culminate by bidding adieu to bihu on the last day of festival. Kati bihu is also known as kongali bihu. The celebrations are quietest of all the three bihus. The farmers are busy in their paddy fields and earthen lamps are lit to mark the celebrations. Farmers pray for a better crop during this time of the farming cycle. Maagh bihu is also known as Bhogaali bihu. Bhogalli means eating and enjoyment. Men folk prepare cottages in the barren fields after harvesting of the crops and spend whole night while singing and dancing. Delicious food and sweets are exchanged among the people. In the very next morning, the cottage is lit up in fire and this brings an end to yearly festival of bihu. Bihu is a festival of the farming community whose livelihood is mainly dependent upon agriculture. Category:Festivals in India Category:Assam",
 "title": "Bihu"
}