{
 "id": "960344",
 "text": "An oblast () is a type of federal subject of the Russian Federation. ==Politics== Oblasts are political entities in a federal union. They have representation in the Federation Council. They serve as a first-level administrative division. Each oblast has a state government. It has control over its territory. They have a state legislature, the Oblast Duma. It is democratically elected. The Governor is the highest executive position of an oblast. He/she is elected by its people. ==Subdivisions under oblasts== Oblasts are divided into raions (districts), cities of oblast significance (district-equivalent independent cities), and autonomous okrugs. These are legally federal subjects equal to an oblast but are different from others. Two oblasts have autonomous okrugs: Arkhangelsk Oblast (Nenets Autonomous Okrug) and Tyumen Oblast (Khanty-Mansi Autonomous Okrug and Yamalo-Nenets Autonomous Okrug). ==Naming== The term oblast can be translated into English as \"province\" or \"region\". There are currently 46 oblasts (48 if counting Kherson and Zaporozhye oblasts, which are internationally recognized as legally a part of Ukraine). It is the most common type of the 85 federal subjects of Russia. Most oblasts are named after their administrative center. It is the official term for a capital city in an oblast, which is usually the largest city. Exceptions to this include Leningrad Oblast and Moscow Oblast, which have no official capital. Sakhalin Oblast is named after an island. Leningrad Oblast and Sverdlovsk Oblast keep the old names of Saint Petersburg and Yekaterinburg. ==Demographics== Oblasts are usually areas that are mostly populated by ethnic Russians and native speakers of the Russian language. They are mostly located in European Russia. ==Statistics== The largest oblast by size is Tyumen Oblast at 1,435,200 km2 (when excluding autonomous okrugs Irkutsk Oblast is the largest at 767,900 km2) and the smallest is Kaliningrad Oblast at 15,100 km2. The most populous oblast is Moscow Oblast at 7,095,120 and the least populous is Magadan Oblast at 156,996. == History == In the Russian Empire, oblasts were a third-level administrative division. It was created in 1849. Oblasts split the larger guberniyas (governorates) within the first-level krais. ===Soviet era=== After the many changes during the Soviet era, the number of oblasts went up as they became the top-level administrative divisions of the Soviet Socialist Republics (SSRs). These oblasts held very little autonomy or power. ===Post Soviet era=== When the Soviet Union dissolved into sovereign states along the lines of the SSRs, they became the first-level administrative divisions. The oblasts of the Russian SFSR, which turned into the Russian Federation, became the first-level administrative divisions of the new country. They received greater devolved power. On September 30, 2022, Russia annexed the Donetsk, Kherson, Luhansk and Zaporizhzhia oblasts of Ukraine after a controversial referendum. These four regions are internationally recognized as part of Ukraine. == List of Russian oblasts == == References == Category:Federal subjects of Russia Category:Government of Russia",
 "title": "Oblasts of Russia"
}