{
 "id": "960567",
 "text": "Vologda () is a city and the administrative center of Vologda Oblast, Russia. It is built on the river Vologda. Vologda is a major transport hub in Northwestern Russia. The Russian Ministry of Culture classified Vologda as a historic city. Also, several buildings in Vologda have been officially named cultural heritage monuments. == History == The year that Vologda was founded is debated by historians. There are two different times (1147 and 1264) that are thought to be the first mentions of the city. 1147 was the year that Vologda was mentioned in a book while 1264 was the first official mention (a document of owned land by the Novgorod Republic after a treaty with the Grand Prince of Vladimir). Throughout its history, Vologda has been a major port city on the river Vologda that several nations have fought over. In World War II, Finnish forces and Soviet forces fought over Vologda. The Soviets pushed the Finns back and used the city as a major transport hub for the rest of the war. == Climate == Vologda's climate is humid continental (Köppen climate classification Dfb) bordering a mild subarctic climate (Dfc). The winters are long. Spring and autumn and cool while summer is warm. == Transportation == Vologda is a major transport hub in Russia with major railways, highways, and waterways going through it or nearby it. It also has a well-developed public transport system. === Railway === The city is the largest and most active stop of the Northern Railway. === Air === The Vologda Airport has regular flights to the Russian cities of Moscow, Ukhta, Velikiy Ustyug, Kichmengsky Gorodok, and Vytegra. == Sports == Vologda has large sports venues such as the stadiums \"Dynamo\", \"Locomotive\", \"Vityaz\", the swimming pools \"Dynamo\" and \"Lagoon\", the sports and concert complex \"Spectrum\", fitness centers, regional athletic spots. Vologda is a home to: * the male soccer team \"Dynamo\" * the female basketball team \"Chevakata\" == Twin towns – sister cities == Vologda is twinned with: * Burgas, Bulgaria * Grodno, Belarus * Kouvola, Finland * Sevastopol, Ukraine * Yevpatoria, Ukraine == References == Category:Cities and towns in Vologda Oblast Category:Capitals of oblasts of Russia",
 "title": "Vologda"
}