{
 "id": "960536",
 "text": "Lucas Valeriu Ntuba Radebe OIS (born 12 April 1969) is a South African former professional footballer. He began playing in South Africa with Kaizer Chiefs, before transferring to Leeds United, where he played 256 matches for the Yorkshire side. He picked up the nicknames \"Rhoo\" and \"The Chief\". He became captain of Leeds United and also of the South African national team, most notably at World Cup 2002. Nelson Mandela said of Radebe: \"This is my hero.\" He also captained Kaizer Chiefs. He played as a centre back. Thebe Mabanga, a Mail & Guardian journalist, wrote that South African fans remember Radebe in his Kaizer Chiefs days as \"a lanky, flamboyant central midfielder who switched to central defence with ease, snuffing out any opposition threat with exquisite, acrobatic scissor kicks and diving headers, and man-marking the most lethal strikers into silence\". He is considered as one of the best South Africa's centre-backs of all time. ==Club career== In 1989 Lucas Radebe signed a contract with Kaizer Chiefs. Instead of the goalkeeper position, he came here to play as a midfielder. He would later be dragged back one line, taking on the role of central defender. He would continue to do this for the rest of his career. He soon became a permanent fixture at the club. Lucas Radebe achieved many successes with Kaizer Chiefs. He was called up for the first time in 1992 to be part of the national selection of South Africa and also made his debut that year. He also became champion of South Africa twice with Kaizer Chiefs, in 1991 and 1992. He also won the BP Top 8 three times., now called MTN 8. This is a kind of supercup, in which the eight best performing teams of the past season participate. In his own words, it was because of his good game that he was shot in 1991. Despite not being seriously injured, he was out for a while. Partly because of the shooting incident, Lucas Radebe decided to leave South Africa in 1994 and sign a contract with a European club. In total, he played 113 games for Kaizer Chiefs. He was able to score five times. In 1994 Lucas Radebe signed a contract with Leeds United . The club paid a transfer fee of £250,000 to Kaizer Chiefs to bring Radebe to England. That season, fellow countryman of Radebe, Phil Masinga, was also bought by Leeds. He did not come from Kaizer Chiefs, but from Mamelodi Sundowns. The South African duo's first season with the club was an immediate success with a fifth place, which gave the right to European football. Radebe only played twelve games that season. It took until the 1996–97 season before Radebe actually got a permanent base place. In the end, Lucas Radebe was named captain of the club. He was also nicknamed \"The Chief\", partly because of his previous club and partly because of his leadership qualities. Five years in a row, from 1998 to 2002, Radebe finished in the top five of the Premier League with Leeds United. In the 2001–02 season, it even took first place in the English league for the first half of the season. These good performances allowed Leeds to participate in both the UEFA Cup and the Champions League. In the latter continental cup tournament, Lucas Radebe reached the semi-finals with Leeds United in 2001. It was lost to Valencia CF. The previous year had already reached the UEFA Cup semi-final, in which Leeds United lost to eventual winners Galatasaray SK. From the season Lucas Radebe experienced the decline of Leeds United. That season started well and Leeds was third for a long time. In November, however, the club dropped to sixteenth place. Ultimately, Leeds United finished 15th that season, narrowly avoiding relegation. The poor performances were partly due to the departures of top players Olivier Dacourt, Rio Ferdinand, Robbie Fowler, Robbie Keane and Jonathan Woodgate. The fact that these players had to leave the club was due to a financial crisis that Leeds United had to contend with. The following season, 2003/2004, was disastrous. Lucas Radebe was relegated along with Leeds to the Football League Championship by finishing 19th in the Premier League. In his last season with the club, 2004–05, Lucas Radebe failed to bring Leeds United an immediate promotion back to the Premier League. The club finished in a disappointing fourteenth place in the second highest league in England. Due to his advanced age and poor performance with Leeds, Radebe decided to end his career that season. He played a total of 200 league matches. However, he never managed to score. ==International career== On July 7, 1992, Lucas Radebe was allowed to play his first international match for South Africa. This was in a match against Cameroon. He won the 1996 African Cup of Nations with South Africa. It was the first time that South Africa won this cup. In the final, played in Johannesburg, Tunisia was beaten 2-0 by two goals from eventual top scorer of the tournament Mark Williams. Radebe captained South Africa at both the 1998 FIFA World Cup, held in France and the 2002 World Cup in Japan and South Korea. On 22 May 2003, he played his last international match for South Africa in a match against England. In total, Radebe played 70 international matches for his homeland. In it he scored twice. ==Personal life== After Radebe decided to retire from football, he played a farewell game on 2 May 2005 at Leeds United's home stadium, Elland Road. Jimmy Floyd Hasselbaink, Mario Melchiot, Clyde Wijnhard, Erik Bakke and Phil Masinga played in this match. In addition, he also played a farewell match in Durban, South Africa. The proceeds of both games plus extra money raised went to charity. Radebe was going to help South Africa with the 2010 World Cup, which would be held in that country. In 2006, however, he withdrew because he was not offered a job and no longer expected it. He also no longer accepted a ceremonial position. Graeme Friedman wrote a book about Radebe and his compatriot and football player Mark Fish. The book is titled \"Madiba's Boys The Stories of Lucas Radebe and Mark Fish\". The foreword was written by the former President of South Africa, Nelson Mandela. Radebe and Mandela have a friendly relationship anyway. When Mandela once visited Leeds, he called Radebe his hero. The British band Kaiser Chiefs says they named themselves after Lucas Radebe's old football club, Kaizer Chiefs. All members of the group are fans of Leeds United and have been able to enjoy Lucas Radebe's game there for eleven seasons. According to the members, Radebe had a great influence on them during their childhood. In 2004 he was awarded 54th place on the list of the Greatest South African of all time. This was not only because of his good football, but also because of his commitment to charities. He is an ambassador for SOS Children's Villages. ==Honours== Kaizer Chiefs *Champion of South Africa: 1991, 1992 *BP Top 8: 1991, 1992, 1994 Leeds United *League Cup; Runner-up: 1996 ===International=== South Africa *1996 African Cup of Nations *1998 African Cup of Nations: Runner-up ===Individual=== *FIFA Fair Play Award: 2000 ==References== Category:1969 births Category:Living people Category:South African soccer players",
 "title": "Lucas Radebe"
}