{
 "id": "960612",
 "text": "Innocent Linda Buthelezi (born 28 June 1969) is a South African former footballer who played at both professional and international levels as a midfielder. Buthelezi played club football for Jomo Cosmos, Kaizer Chiefs, Karabükspor,http://www.mackolik.com/Futbolcu/52019/Imocent-Buthelezi Orlando Pirates, Mamelodi Sundowns and SuperSport United. He went on unsuccessful trials at South Korean Pohang Atoms. Buthelezi was regarded to be one of the best South African players of the 1990s, he was renowned to be a strong midfielder with his tough tackling ability, he was a incredible dribbler and passer and stood up for his speed.http://152.111.1.88/argief/berigte/beeld/1996/04/23/16/6.html ==Club career== Buthelezi began his career in 1986 for Jomo Cosmos. In 1990, he won the South African Cup with the club. In 1991 he moved to Kaizer Chiefs. He won the South African Championship twice (1991, 1992) and the South African Cup once (1992). In 1993 he became a player of the Turkish Karabükspor. In the 1993–94 season, he played there 6 matches in the first Turkish league. After that, Buthelezi returned to South Africa, where he became a player of the Orlando Pirates. In 1994, he won the South African Championship. In 1995 he moved to Mamelodi Sundowns. In the 1997–98 season, he won the championship and the South African Cup. In 1998 he left for Supersport United, in the 1998–99 season he also won the national cup. In 1999, he ended his career. ==International career== Buthelezi was selected to play for South Africa in 1994 against Madagascar with 1-0 victory. He participated the 1996 African Cup of Nations in his home country. In the final the Bafana Bafana beated their opponents Tunisia without fear with 2-0. He made an unwanted international headlines in 1997 against England losing 2-1, when a tackle on Paul Gascoigne saw the English midfielder stretchered off. He was not selected to be playing for South African national team during the 1997 FIFA Confederations Cup in Saudi Arabia and the Bafana Bafana team did not perform well and eliminated in the group stage. He turned down a chance to play for the 1998 African Cup of Nations where South Africa finished as runners-up against Egypt with 2-0 defeat. Buthelezi was left out to prepare for the 1998 FIFA World Cup along with Eric Tinkler, Neil Tovey, Mark Williams, Sizwe Motaung and John Moeti. ==References== ==Other websites== * Category:1969 births Category:Living people Category:South African soccer players Category:Association football midfielders",
 "title": "Linda Buthelezi"
}