{
 "id": "96067",
 "text": "An introduced species is an living thing that is not native to a given place. It has been brought there by human activities. People may have brought the living thing by accident or on purpose. The introduced species can cause problems when it becomes a pest in the new place. It may damage the ecosystem of the new place. This damage can be to other animals, plants and also human activity. One introduced species is the tilapia. It is a fish that comes from warm freshwater areas of Africa, North and South America, India and Sri Lanka. It has been taken to other areas because it is good for fish farming, and it also is a good pet for an aquarium. When the fish is released into other parts of the world, it quickly takes over from the native fish. It can do this because it breeds quickly, eats all the available food, and eats the eggs and babies of native fish. This can cause the water to become so muddy, that the native fish cannot live. Tilapia has been listed as one of the 100 worst introduced species. A person owning or selling one in Australia could be fined up to AU$11,000. An introduced species may have a great advantage over the native species. They usually come in without the predators and parasites which they suffer in their old environment. This allows them to have young quickly. Fire ants and Africanized honeybees became invasive insects in the 20th century. ==Examples== *People brought rabbits to Australia because they wanted to raise and eat them. The rabbits got into the wild and became pests. Australians built the rabbit-proof fence to try to stop them from covering the whole country. *People put mosquitofish in rivers and lakes in western North America because they thought the fish would eat mosquito young. Instead, the mosquitofish killed the other fish that had been eating the mosquitoes. There were more mosquitoes than ever. *People brought cats and stoats to islands. When birds live on islands with no mammal predators, they sometimes do not build nests in trees. Instead, they nest on the ground. This makes it easy for the cats and stoats to eat the chicks and eggs. Some birds, for example the kiwi and kakapo do not fly. The animals that like to eat the kakapo were mostly birds of prey that flew high overhead. They would find the kakapo by seeing it. The kakapo would stand very still so the bird of prey would not find it. But this does not work against a mammal predator that finds its prey by smelling it. The kakapo would stand very still, and the introduced mammal would catch it. *Rats hid on human ships and got onto Easter Island. Historians think the rats might have eaten palm tree seeds and could be what made the trees on the island die out. == Related pages == * Invasive species *Feral == References == Category:Plants Category:Human–animal interaction Category:Ecology",
 "title": "Introduced species"
}