{
 "id": "960714",
 "text": "The \"Anthem of Transnistria\", titled \"We Sing the Praises of Transnistria\", was adopted on 18 July, 2000. ==Lyrics== ===Romanian=== Moldovan Cyrillic script Romanian Latin script IPA transcription ===Russian=== Cyrillic script Latin script IPA transcription as sung ===Ukrainian=== Cyrillic script Latin script IPA transcription ===Translations into English=== Since Transnistria has three official languages, the anthem has official lyrics in Romanian, Russian and Ukrainian; however, they are not all literal translations of one another and all have different semantic meanings. The translations are represented below: Translation from Romanian Translation from Russian Translation from Ukrainian I Long live Mother Transnistria, A country of brothers and sisters This love without notice Gift you daughters, sons. We'll sing orchards and factories, Cities, hamlets, plains, With them also tomorrow O country, prosperous make us be! Through the time we shall carry The name of our proud country Thee, the Republic of liberty You are the belief in peaceful horizons. II We shall sing both valleys and hills, Morning stars from the gray old Dniester Wise and old ballads Which for centuries wanted us worthy. We shall glorify the heroic name Which fell in that battle And in the face of the holy memory We swear to the country to be its shield! 𝄆 I We sing glory to Transnistria, Where the friendship of nations is strong. We are closely connected to our land With great love. Let’s praise gardens and factories, Settlements, fields and towns – Much effort has been put in them For the sake of the Motherland. We’ll bear through the years The name of the proud country, And to the Republic of liberty, And to justice, we’ll be faithful. II We sing the praises of native valleys, The banks of the old Dniester. We remember epic heroic deeds, The glory of our ancestors is dear to us. Let’s sing the praises of every person Who died for the native land. We take an oath to the Motherland In holy memory of the fallen. 𝄆 𝄇 I We praise the land Transnistria Where people are proud Friendship, harmony, love Are forever associated with it. Famous for our plants, Broad fields and cities There are honest people Who labor for the benefit of the Motherland. A shares and water Our proud name The Republic of freedom, Long live the family of people here. II We praise native valley Beauty of the Dniester river banks, And we should not forget the epic Of the deeds of our fathers. Glorify their names Fallen for our father's house, Where the sacred memory of the dead, Fatherland sing the anthem. 𝄆 𝄇 ===Trilingual version=== On official TV broadcasts, a trilingual version is used consisting of the first verse and chorus in Russian, the second verse and chorus in Romanian, the first verse and chorus in Ukrainian and the final repeat of the chorus in Russian. Cyrillic script Latin script IPA transcription as sung ==References== ===Notelist=== Category:Anthems of the Commonwealth of Unrecognised States Category:Moldovan anthems Category:Transnistria",
 "title": "Anthem of Transnistria"
}