{
 "id": "960834",
 "text": "The 1914 Salle Giandomenici international women's fencing competition was the first women's international fencing competition in the Netherlands on 17 March 1914. It was the first international women's fencing competition in the Netherlands. The competition was organized the fencing academy of Giovanni Giandomenici, the Salle Giandomenici, located at the Keizersgracht in Amsterdam. Ten fencers from the Netherlands, England, and Belgium competed against each other. The British C. E. Martin Edmunds won the competition. Dutch Esther Bekkers-Lopes Cardozo of Salle Giandomenici took the second prize. ==Entrants== In the week before the competition it was reported that a total of fourteen women entered the competition. Five from the United Kingdom, two from Salle Verbrugge in Belgium, and seven Dutch fencers from Salle Giandomenici, in the Netherlands. A later article stated two other Dutch women who entered, but didn't compete. Naam Country Club C. E. Martin Edmunds Salle Alibert Rosamund Johnstone Salle Bertrand C. E. Taylor Ealing Fencing Club Polytechnic Gymnasium Jean Colmer Queen Alexandra's House Gymnasium A. M. Cunningham Kensington School of Arms J. De Deken Salle Verbrugge M. Blom Salle Verbrugge Esther Bekkers-Lopes Cardozo Salle Giandomenici Ina Santhagens- Waller Salle Giandomenici J. Goudeket Salle Giandomenici M. Mendels Salle Giandomenici Adrie Meyerink Salle Giandomenici Joyce Haworth Salle Giandomenici Lily Stoop Salle Giandomenici De Jong Utrecht Scharroo Breda The names in italic (Jean Colmer, A. M. Cunningham, Joyce Haworth, Lily Stoop) entered for the competition, but didn’t compete. Felix Vigeveno and Max Zeldenrust both were president of the jury. The jury also included Verbrugge of Salle Verbrugge and Speyer. ==Competition== The matches were in \"competition-format\" meaning that each fencer competed against each other fencer. The early matches were held from 10 a.m. to 12 a.m. The final matches were from 3 p.m. ===Results=== British champion C. E. Martin Edmunds, who won the first prize at the 1913 International Exposition fencing competition in Ghent, lost her first match against Rosamund Johnstone with 3-2. Edmunds won her three next matches against Goudeket, C. E. Taylor and M. Blom. Johnstone lost against the Dutch Esther Bekkers-Lopes Cardozo with 3-1, who had the advantage that she fenced left-handed. With an one hit difference, Bekkers- Lopes Cardozo also beated the Belgian Blom and the Dutch Mendels with 3-1. An important match was Bekkers-Lopes Cardozo against Edmunds. Edmunds with the advantage of being tall was able to beat Bekkers-Lopes Cardozo with her quickness and left-handedness. It was the only match Bekkers-Lopes Cardozo lost. The Dutch Meijerink lost her match against Edmunds but afterwards she won against Johnstone, Goudeket and Taylor. The match that determined the final result was Edmunds against the Belgian J. De Deken. Bekkers-Lopes Cardozo would win overall if Edmunds lost. After a long match, Edmunds won with 3-2, and won the overall competition. Overall classification Rank Name Won Hits 1 8 11 2 8 12 3 4 5 6 7 8 9 10 ===Fencing styles=== The English took advantage of their height and long arms. They fenced with great hesitation. The style was in contrast to the Belgians, who were very graceful and fenced with quick movements. The Dutch's style was between that of the English and Belgians. ==Related pages== *1911 England–Holland women's fencing competitions *1920 Salle Giandomenici international women's fencing competition ==References== ==Other websites== *image of the participants Category:1910s in women's fencing Category:Sport in the Netherlands Category:1914 in Europe Category:1914 in sports",
 "title": "1914 Salle Giandomenici international women's fencing competition"
}