{
 "id": "960890",
 "text": "This is a list of Formula One broadcasters and 'World Feed' producers. Formula One, the highest level of circuit racing defined by the Fédération Internationale de l'Automobile, motor sport's world governing body, can be seen live or tape delayed on television in almost every country and territory around the world. ==Broadcasters== ===2023 broadcasters=== These are the broadcasters for the 2023 Formula One World Championship. 2023 TV broadcasters Country TV network Free-to-air / Free-to-view / Pay Practice 1 Practice 2 Practice 3 Qualifying Race Notes Albania RTSH HDTV. It can also be broadcast on Sport channel if channel one has a different schedule. Rights until 2023. Andorra DAZN F1 Rights until 2023. Argentina Fox Sports Some races live. 16:9 SD/HDTV feed. Rights until 2025. Armenia Setanta Sports 16:9 SD/HD feed Australia Network 10 SD/HD Feed, Australian GP only (on Network 10). Multi- year deal from 2023. Fox Sports Sky Sports F1 coverage. Available in 4K. 'Multi-year' rights deal from 2023. Austria ORF eins rowspan=\"2\" HDTV. 12 races live. Rights until 2023. Servus TV HDTV. 12 races live. Rights until 2026. Sky Sport F1 Ultra HD. Rights until 2027. Azerbaijan Setanta Sports 16:9 SD/HD feed Belarus Setanta Sports 16:9 SD/HD feed Belgium Play Sports HDTV. Rights until 2024. VRT HDTV. Belgian GP only. Highlights of other races. Tipik HDTV. Practice sessions for the Belgian Grand Prix are broadcast live. *Some races on RTBF La Une. Bosnia and Herzegovina Sport Klub Ultra HD. Rights until 2023. Brazil TV Bandeirantes HDTV. Rights until 2025. Free practices and qualifyings are broadcast by BandSports, races and sprint qualifyings are broadcast by Band. Brazil BandSports HDTV. Rights until 2025. Free practices and qualifyings are broadcast by BandSports, races and sprint qualifyings are broadcast by Band. Brunei beIN Sports Sky Sports F1 coverage, Rights until 2025. Bulgaria Diema Sport 16:9 SD/HD feed. Rights until 2024. Canada RDS HDTV, Side-by-Side coverage during the race (live broadcast only). All practices live for Canadian GP. Rights until 2024. TSN HDTV, Sky Sports F1 coverage, Side-by-Side coverage during the race (live broadcasts only). Rights until 2024. Cambodia beIN Sports Rights until 2025. Caribbean ESPN 16:9 SD/HDTV feed. Rights until 2025. Central Asia Setanta Sports 16:9 SD/HD feed China Great Sports Broadcast in Shanghai only. Guangdong Sports Broadcast in Guangdong only. CCTV Nationwide broadcasting.央视网全程视频直播F1奥地利站 周冠宇强势归来 Croatia Sport Klub Ultra HD. Rights until 2023. Cyprus CytaVision Sports Rights until 2022. Czech Republic Sport 1 Also in HD on Sport 1 HD and Sport 2 HD. Rights until 2023. Denmark TV3+ HD 16:9 – Some sessions on TV3 SPORT 1/2 or TV3 Puls, all other remaining races on Viaplay. Rights until 2024. Estonia Viaplay Group HDTV. Rights until 2024. Finland V Sport HDTV. Rights until 2024. France Canal+ Race available in UHD. Rights until 2029. Canal+ Sport FPs and Qualification in HD only C8 HDTV. Bahrain GP, Monaco GP, French GP, US GP and Mexico GP Georgia Setanta Sports 16:9 SD/HD feed Germany Sky Sport F1 Available in Ultra HD. Exclusive coverage from 2021. Rights until 2027. Sport 1 One hour Highlights of all Races on Monday Afternoon Greece ANT1 HDTV 1080i. Qualifying are now streaming on ΑΝΤ1+ with Races, including Sprint Races, aired on ΑΝΤ1. Rights until 2025. Hong Kong beIN Sports Rights until 2025. Hungary M4 Sport HDTV 1080i. Rights until 2025. Iceland Viaplay Group HDTV. Rights until 2024. Indonesia beIN Sports Sky Sports F1 coverage; not available on all providers. Rights until 2025. Iran IRIB Varzesh Available in Ultra HD on IRIB UHD. Only for DVB-T2. MBC Persia Ireland Channel 4 UK HDTV, Live for British GP only (including all of the practices), Highlights for all other races. Sky Sports F1 Available in Ultra HD Sky Showcase British GP Weekend and at least two \"prime time\" races, highlights of all other qualifying and races, Available in Ultra HD, until 2029 Israel Sport 5 Ultra HD only for races. Italy Sky Sport F1 Choice of different perspectives. Available in Ultra HD. Rights until 2027. TV8 HDTV. 5 races live (Emilia-Romagna, Spain, Hungary, Italy & Mexico) other races delayed. Sky Sport F1 coverage with Side-by-side commercials. *Only for the Emilia Romagna and Italian GPs. Japan Fuji TV Next HDTV. Rights until 2025. Kosovo Art Sport HDTV. Choice of different perspectives. Laos beIN Sports Sky Sports F1 coverage. Rights until 2025. Latin America (except Argentina and Mexico) ESPN Some races live. 16:9 SD/HDTV feed. Exclusive rights until 2025. Latvia Viaplay Group HDTV. Rights until 2024. Liechtenstein SRG SSR The qualifyings and the races are broadcast on RSI La 2, RTS Deux and SRF zwei. Rights until 2021. Sky Sport F1 Available in Ultra HD. Rights until 2027. Lithuania Viaplay Group HDTV. Rights until 2024. Luxembourg RTL Qualifyings and races are broadcast on RTL Zwee. Rights until 2023. Sky Sport HDTV. Rights until 2027. Malta Total Sports Network Uses the F1TV commentary used for Channel 4's coverage in the UK, broadcast on TSN. Malaysia beIN Sports Sky Sports F1 coverage. Rights until 2025. Mexico Fox Sports 16:9 SD/HDTV feed. Some races live. Exclusive TV rights until 2025. Canal 5 HDTV. 16:9 feed. Mexican GP only. Middle East and North Africa MBC Action HDTV feed. Some races are live. Rights until 2023. Shahid (SSC) Ultra HD feed. All races are live. Moldova Setanta Sports 16:9 SD/HD feed Monaco Canal+ Rights until 2029. Montenegro Sport Klub Ultra HD. Rights until 2023. Myanmar Canal+ Rights until 2022. Netherlands Viaplay Group HDTV. Rights until 2024 NOS HDTV. Live: Dutch GP; Highlights of other races. New Zealand Sky Sport Prime FTA 1hr highlights package on Monday evening (usually 6pm). Live coverage of Australian GP. North Macedonia Sport Klub HDTV. Rights until 2023. Norway V Sport Available in Ultra HD. Always Norwegian during race. Partly Swedish during some P and Q. Rights until 2024. Pacific Islands and Papua New Guinea Digicel Pakistan A Sports Philippines beIN Sports Sky Sports F1 coverage; not available on all providers. Rights until 2025 Poland Viaplay Group HDTV. Rights until 2025. Portugal Sport TV HD feed. Rights until 2024. Romania Digi Sport HDTV. Rights until 2024. Digi 4K Ultra HD. Only races. Rights until 2024. Prima Sport HDTV. Rights until 2024. Orange Sport HDTV. Rights until 2024. Russia None Match-TV's contract was terminated due to 2022 Russian invasion of Ukraine. No broadcaster from 2022 to 2024. F1TV closed in region. San Marino Sky Sport F1 Choice of different perspectives. Available in Ultra HD. Rights until 2022. Serbia Sport Klub Ultra HD. Rights until 2023. Singapore beIN Sports Sky Sports F1 coverage. Rights until 2025. Mediacorp Channel 5 Singapore GP only. All sessions are also available on MeWATCH. Slovakia Sport 1 Also in HD on Sport 1 HD and Sport 2 HD Rights until 2023. Slovenia Sport Klub Rights until 2023. South Korea Coupang 'Multi-year' deal from 2023. Spain DAZN F1 Choice of different perspectives and Ultra HD only available on Movistar+ IPTV service. Rights until 2023. Mediaset Spanish GP only. Sub-Saharan Africa SuperSport HDTV, Sky Sports F1 coverage. Rights until 2022. Canal+ Sport HDTV Sweden V Sport Available in Ultra HD. Rights until 2024. Switzerland SRG SSR The qualifyings and the races are broadcast on RSI La 2, RTS Deux and SRF zwei. Rights until 2021. Canal+ Rights until 2029. Sky Sport F1 Available in Ultra HD. Rights until 2027. Taiwan Videoland ELTA Chunghwa Telecom MOD broadcast. Tajikistan Varzish TV Thailand beIN Sports Sky Sports F1 coverage; not available on all providers. Rights until 2025. Timor- Leste beIN Sports Sky Sports F1 coverage. Rights until 2025. Turkey S Sport Rights until 2023. Ukraine Setanta Sports SD/HD Feed. Contract uncertain due to 2022 Russian invasion of Ukraine. United Kingdom (including Gibraltar) Channel 4 HDTV complete British GP Weekend, highlights of all other qualifying and races Sky Sports F1 Rights until 2029 Sky Showcase British GP Weekend and at least two \"prime time\" races, highlights of all other qualifying and races, Available in Ultra HD, until 2029 United States (including Puerto Rico) ABC Five races (Miami, Monaco, Canada, USA, and Mexico). HDTV, Commercial-free (live only) Sky Sports F1 coverage. Rights until 2025. ESPN Five races are aired on ESPN2 while thirteen are aired on ESPN. HDTV, Commercial-free (qualifying and race only) Sky Sports F1 Coverage. Broadcast channel for Practice 1 and 2 is on a race by race basis. Spanish broadcasts on ESPN Deportes. Rights until 2025. Vietnam K+ Picked up rights after Fox Sports Asia ceased operation on October 1, 2021. 'Multi-year' rights deal from 2023 (until 2029). ===2024 broadcasters=== These are the broadcasters for the 2024 Formula One World Championship. 2024 TV broadcasters Country TV network Free-to-air / Free-to-view / Pay Practice 1 Practice 2 Practice 3 Qualifying Race Notes Vietnam K+ Picked up rights after Fox Sports Asia ceased operation on October 1, 2021. 'Multi-year' rights deal from 2023 (until 2029). Vietnam VTV2/HTV9 Vietnamese GP only. ==References== Category:Formula One",
 "title": "List of Formula One broadcasters"
}