{
 "id": "96081",
 "text": "Christopher \"Kit\" Marlowe (6 February 1564–30 May 1593) was a major dramatist, poet, and translator of English Renaissance drama. Swinburne has written that: \"Marlowe is a Father of English Tragedy and the creator of English blank verse and therefore also the teacher and guide of Shakespeare.\" He was born the same year as Shakespeare, or at least baptised, but lived only to the age of 29, when he was murdered in a fight.Wilson, Richard (1999). \"Introduction\". In Wilson, Richard (ed). Christopher Marlowe. London, New York: Routledge, p3. Marlowe was the son of a shoemaker in Canterbury. Because he was smart, he got scholarships, to King's School in Canterbury at age 15, and two years later to the University of Cambridge. Marlowe was well-educated; he earned a bachelor's degree in 1584 and a master's degree in 1587. Marlowe's plays were both popular and controversial, while he was still alive and later. His plays deal with disturbing subjects like devil worship (Doctor Faustus), homosexuality (Edward II), and anti-Semitism (The Jew of Malta). Marlowe is generally regarded as master of blank verse.Compare T.S. Eliot, Notes on the Blank Verse of Christopher Marlowe. In addition to seven plays, Marlowe wrote one long poem, Hero and Leander, and one famous shorter poem, \"The Passionate Shepherd to His Love.\" Marlowe's death was also highly controversial. He was killed in a fight at a tavern (similar to a pub/bar) where he was stabbed in the head. Marlowe was, or sometimes claimed to be, an atheist, at a time when atheism was a crime that could be punished by death. Some people have wondered if his death were connected with these other issues. Uncertainty about Marlowe's death has led some people to believe that Marlowe faked his death and continued to write plays using the name \"William Shakespeare.\" This is called the \"Marlovian theory.\" == Plays == * Dido Queen of Carthage * Tamburlaine, Parts 1 and 2 * The Jew of Malta * Doctor Faustus * Edward II * The Massacre at Paris === Other possible works === * The Contention of York and Lancaster (or The First Part of the Contention betwixt the Two Famous Houses of York and Lancaster) is an annoymous work that some people think may have been written by Marlowe. It was the basis for Shakespeare's play Henry VI, Part 2.Logan, Robert A. (2007). Shakespeare's Marlowe: the influence of Christopher Marlowe on Shakespeare's artistry. Aldershot, England; Burlington, VT: Ashgate. pp. 4–5, 21. ISBN 978-0754657637 == References == Category:1564 births Category:1593 deaths Category:Canterbury Category:English murder victims Category:English playwrights Category:English poets Category:Murders by blade weapons Category:People murdered in England Category:Spies Category:Writers from Kent Category:English translators Category:Plays by Christopher Marlowe",
 "title": "Christopher Marlowe"
}