{
 "id": "961075",
 "text": "Autonomous okrugs (, avtonomnyy okrug; more correctly called \"autonomous districts\" or \"autonomous areas\") are a type of federal subject of Russia. Three of the four autonomous okrugs are legally part of an oblast, but keep some autonomy. These are the Nenets Autonomous Okrug, the Yamalo-Nenets Autonomous Okrug, and the Khanty-Mansi Autonomous Okrug. The other autonomous okrug, Chukotka, is not a part of any oblast. == List of Autonomous Okrugs == Flag Map Name Domestic names Capital Population (2010) Area Chukotka Autonomous Okrug () Chukot: Чукоткакэн Aвтономныкэн Округ (Chukotkaken Avtonomnyken Okrug) Anadyr () Chukot: Кагыргын (Kagyrgyn) 50,526 Khanty-Mansi Autonomous Okrug () Khanty: Хӑнты-Мансийской Aвтономной Округ () Mansi: Ханты- Мансийский Автономный Округ () Khanty-Mansiysk () Khanty: Ёмвоҷ () Mansi: Абга () 1,532,243 Nenets Autonomous Okrug () Nenets: Ненёцие Aвтономной Ӈокрук (Nenjocije Awtonomnoj Ŋokruk) Naryan-Mar () Nenets: Няръянa Mарˮ (Nyar'yana Marq) 42,090 Yamalo-Nenets Autonomous Okrug () Nenets: Ямалы-Ненёцие Aвтономной Ӈокрук (Yamaly-Nenyotsiye Avtonomnoj Ŋokruk) Salekhard () Nenets: Саляʼ Xарад (Salja’ Harad) 522,904 === Former Autonomous Okrugs === Flag Map Name Domestic names Capital Population Area Agin-Buryat Autonomous Okrug () Buryat: Агын Буряадай Aвтономито Tойрог (Agyn Buryaaday Avtonomito Toyrog) Aginskoye () Buryat: Ага (Aga) 76,383 (2008) Evenk Autonomous Okrug () Evenki: Эведы Автомоды Округ (Ēvēde Avtōmōde Okrug) Tura () Evenki: Typy (Turu) 16,979 (2007) Komi-Permyak Autonomous Okrug () Komi-Permyak: Коми-Пермяцкöй Aвтономнöй Округ (Komi-Permjacköj Avtonomnöj Okrug) Kudymkar () Komi-Permyak: Кудымкöр (Kudymkör) 132,824 (2005) Koryak Autonomous Okrug () Koryak: Чав’чываокруг () Palana () Koryak: Пылылъын () 22,580 (2007) Taymyr Autonomous Okrug () Dudinka () 38,372 (2007) Ust-Orda Buryat Autonomous Okrug () Buryat: Усть-Ордын Буряадай Aвтономито Tойрог (Ust’-Ordyn Buryaaday Avtonomito Toyrog) Ust-Ordynsky () Buryat: Ордын Адаг (Ordyn Adag) 134,320 (2008) == References == == Related articles == * Autonomous republics of the Soviet Union * Autonomous oblasts of the Soviet Union * Federal subjects of Russia * Republics of Russia Category:Federal subjects of Russia",
 "title": "Autonomous okrugs of Russia"
}