{
 "id": "961090",
 "text": "The 1913 Alfred Hutton Memorial Challenge Cup was a women's international fencing competition held at the Bertand's School of Arms in London, the United Kingdom, from 26 to 27 November 1913. A total of 36 fencers from three nations (the United Kingdon, the Netherlands and the United States) competed against each other. ==Entrants== A total of 36 fencers entered for the competition. 30 fencers from the United Kingdom, 5 from the Netherlands and one from the United States. Among the British fencers did not participated: Gladys Daniell the champion of 1911-12 and C. E. Martin Edmunds who won the fencing competition in Ghent. ==Results== ===Elimination round=== ====Pool 1==== Rank Name Affiliation Lost matches Notes 1 Tassart 0 Q 2 Queen Alexandra House Gymnasium 1 Q 3 Salle de Vos (The Hague) 2 4 Royal Free Hospital L.F.C. 3 5 Academy of Dramatic Art 4 ====Pool 2==== Rank Name Affiliation Lost matches Notes 1 Salle Giandomenici 1 Q, after barrage 1 Salle Bertrand 1 Q, after barrage 3 Salle Alibert 1 4 Ealing Gymnasium 3 5 Academy of Dramatic Art 4 ====Pool 3==== Rank Name Affiliation Lost matches Notes 1 Salle Bertrand 0 Q 1 Salle Alibert 0 Q 3 Tassart 2 4 Queen Alexandra House Gymnasium 3 4 Mimiague 3 6 Acadamy of Dramatic Art 5 ====Pool 4==== Rank Name Affiliation Lost matches Notes 1 Salle Bertrand 0 Q 2 Tassart 1 Q 3 Mimiague 2 4 Salle de Vos (The Hague) 3 5 Gravé 4 6 Salle Bertrand 5 ====Pool 5==== Rank Name Affiliation Lost matches Notes 1 Salle Bertrand 0 Q 2 Tassart 1 Q 3 Salle de Vos (The Hague) 2 4 Queen Alexandra House Gymnasium 3 5 Salle Bertrand 4 5 Ladies' Cercle d'Escrime 4 ====Pool 6==== Rank Name Affiliation Lost matches Notes 1 Mimiague 0 Q 2 Salle Bertrand 1 Q 3 Salle Bertrand 3 3 Salle de Vos (The Hague) 3 3 Ladies' Cercle d'Escrime 3 6 Academy of Dramatic Art 5 ===Semi- finals=== ====Pool 1==== Rank Name Affiliation Lost matches Notes 1 Tassart 0 Q 2 Queen Alexandra House Gymnasium 2 Q 3 Salle Bertrand 3 Q, 3rd after barrage 4 Salle Giandomenici 3 4th after barrage 5 Salle Alibert 3 5th after barrage 6 Salle Bertrand 4 ====Pool 2==== Rank Name Affiliation Lost matches Notes 1 Salle Bertrand 0 Q 2 Tassart 2 Q 2 Mimiague 2 Q 4 Salle Bertrand 3 4 Tassart 3 5 Salle Bertrand 5 ===Final=== The final was held in the evening. Alice Walker was not in her best, and lost her firts match against Jean Colmer with 5-3. However, she won against all the other opponents and so the final classification. Rank Name Affiliation Lost matches Notes 1 Tassart 1 1st place after barrage 2 Queen Alexandra House Gymnasium 1 2nd place after barrage 3 Salle Bertrand 2 4 Salle Bertrand 3 5 Tassart 4 5 Mimiague 4 ;Best foreigner The Dutch Esther Bekkers-Lopes Cardozo was the best foreigner and won the \"strangers cup\". Reference full results ==Related pages== *1911 England–Holland women's fencing competitions ==References== Category:1910s in women's fencing Category:Sport in London Category:1913 in Europe Category:1913 in sports",
 "title": "1913 Alfred Hutton Memorial Challenge Cup"
}