{
 "id": "96114",
 "text": "Copts are a Christian ethno-religious group primarily found living in Egypt. The Coptic Orthodox Church is the largest denomination found in Egypt, the Middle East and North Africa (MENA-region). Copts have a distinct cultural practice and religious doctrine. == History == The Coptic Orthodox Church is believed to be founded by Saint Mark the Evangelist in Alexandria around 42 AD. But already before that the holy family visited Egypt. Joseph and Mary had to flee from Bethlehem with baby Jesus. It is believed that everywhere they came all paegan depictures would vanish. After its foundation by Saint Mark christianity spread fast into the heartlands of Egypt with Alexandria as capital. Connecting the Nile River, Red Sea, and the Mediterranean Sea, Alexandria was one of the largest port cities in Egypt where local produces such as grains were exported to other parts of the word. Which made it easy to spread the Coptic message. Later in the Council of Nicaea organized by Emperor Constantine I in 325 C.E., the Church of Alexandria was elevated to the rank of Patriarchate alongside Rome and Jerusalem. === The Spread of Monastic Christianity === Rooted in the crossroad between East and West, the Church of Alexandria consequently had a profound impact on spreading the faith to its surrounding areas. One greatest achievement of the Church of Alexandria was the spread of monasticism. The spread of monasticism can be traced back to Saint Anthony the Great. Having lived an ascetic life for twenty years in a cave in a desert mountain called Mt. Pispir, only eating bread, salt, and water, Anthony’s action soon attracted followers who voluntarily vowed as his disciple. His disciples then carried his monastic style of teachings and approaches to all directions, including places like Palestine, Marseille, Mesopotamia, Asia Minor, Syria, Ethiopia, and even Ireland. === Era of the Martyrs—Religious Persecution Under the Romans === The Coptic Orthodox Church is known as church of the martyrs, not only because of the many martyrs but also because of the desire of the believers to become a martyr. Under the Roman rule of Egypt the Copts were severely persecuted. This persecution came to a climax during the rule of Diocletian. He personally came to Egypt to destroy christianity, around 800.000 Copts were killed. === Under Islamic rule === The death of Prophet Muhammad in 632 AD marked the start of the Rashidun Caliphate era in the Middle East. The term Rashidun literally means rightly guided; it refers to the first four Islamic caliphs who were considered rightfully elected by the ummah. Under the rule of Caliph Uthman, Rashidun armies started to invade Syria, Mesopotamia, and Fars regions, the former territories of the Byzantine Empire, and the Sassanid Empire. A drastic change happened to the Egyptian religious milieux when Egypt was taken over by Muslim general Amr ibn al-As in 639. Initially, Christians were tolerated because they were redeemed as the Ahl al-Kitab, or the People of the Book. VIn return for tolerance, Christians had to pay the Jizya tax and were forbidden from entering the army. Although tolerated by the system in theory, in practice, Copts in Egypt suffered economically, and several uprisings against their Muslim overlords happened occasionally as well. Meanwhile to suppress the uprisings, the muslim governments from time to time also confiscated church properties and imprisoned some important members of the Church. As a result, many of them converted to Islam to avoid the heavy tax. Eventually by the Ninth century, Muslims gained the majority in Egypt. === European Intervention, Enlightenment, and Nationalism === The French Invasion of Egypt When Napoleon Bonaparte launched his expedition to Egypt in 1798 starting with Alexandria, several local Copts sought this as an opportunity. A formal tax collector of the Upper Egypt under the Ottoman-mamluk rule Mu'allam Ya'qub Tadrus, for instance, became a joint commander alongside general Desiax during his conquest of Upper Egypt. After Napoleon's retreat, Ya'qub was even in charge of a Coptic legion under the French army system. Another former tax collector Mu'allim Girgis al-Gawhari served as the minister of finance under Napoleon's expedition. During his term, he donated some lands to the Coptic Church. Although individual Copts seek opportunities in the French occupation, the Coptic community as a whole remained the same as under the Ottoman rule. They were still marginalized and lack much political power outside their communities. There were only a few individual who could serve as tax collectors or government advisors occasionally, seeking for opportunities both for themselves and for their communities. Under Muhammad Ali Since the departure of Napoleon from Egypt, the Ottoman forces soon regain control over Egypt. Many Christian Egyptians were accused of cooperating with the French army, and many of them got sentenced to death. As Muhammad Ali took control of Egypt however, Copts, alongside Armenians and Jew enjoyed an unprecedented freedom and promotion in Muhammad Ali's government. Contrary to the Millet system under the Ottomans, Muhammad Ali promoted officers based on their merit and connection to local communities. Consequently as a power broker between the government and the regional population, former tax collectors, religious figures, and military officers got promoted to Ali's government as bureaucrats. Under Ali's reform, Copts such as al-Mu'allim Ghali got promoted to Ali's financial advisor. === Coptic Church and its Community === As a continuation of the Ottoman Millet System, Coptic clergy continued to hold a great influence on its community. They were not only in charge of religious services but was also in control of meddling day-to-day activities such as legal disputes. However, since Sharia court also coexisted alongside the Coptic Jurisdiction, and Copts often switched between different courts when the law serves their interests better. In a societal sense, this can be seen as a competition between Islam and Coptic Christianity. Although to individuals, they were only opportunists who tried to maximize their rights and profits. Similar trend continues when the Ottoman Tanzimat Reforms got adopted by the Egyptian government. In this case, Copts continued to switch between affirming Coptic laws and State Laws when the terms suits their interests. == Dogma == === Theology === The main theological ideas of the Coptic Orthodox church are: * Faith in a loving God * Revelation of God through his son Jesus Christ * Monotheïsm and the holy trinity * Angels and Saints pray for the believers from heaven The Church is: * Sole * Holy * Universal * Apostolic The seven sacraments are: * The holy sacrament of baptism * The holy sacrament of chrismation * The holy sacrament of confession * The holy sacrament of eucharist * The holy sacrament of anointment of the sick * The holy sacrament of Marriage * The holy sacrament of priesthood === Icons === Another important theological aspect of the Coptic Orthodox Church is the use of icons. An Icon can be a picture of Jesus or a saint. But it is not just art. An icon is believed to be a vessel through which you can see the light of God. Looking at it surrounds you with the kingdom of God which is accessible through Jesus. Through an icon you can see a glimpse of eternity and God's divine light. Icons proclaim the faith of the church and serve to educate and edify. === Patriarchy === The pope of Alexandria is the patriarch or leader of the Coptic Orthodox Church. The first patriarch was Anianus who was Saint Mark's successor. Since then there is a uninterrupted line of patriarchs. The current patriarch is Theodore II. === Schisms === Despite the elevation of the Church of Alexandria, religious persecutions were still wide spread due to multiple theological controversies throughout the entire Christian world. ==== Arian Controversy ==== Before the concept of Holy Trinity was publicly announced and accepted by most Christian schools in the council of Nicaea, most churches enjoyed freedom of interpretation to the Bible and religious doctrines. Consequently, as a hot topic among theologians, discussions over the essence of God and the Christ prevailed throughout the debates. In either year 318 or 320 AD, Arius, a former presbyter (priest who preaches) in Alexandria publicly announced that the Holy Father and the Christ are different by nature. Arius's idea, known as Nontrinitarianism, holds that the Christ is distinct from the Holy Father himself and is therefore God's creation. Arius's opponent Athanasius of Alexandria and Saint Alexander on the other hand, believed that God the Father, Christ the Son, and the Holy Spirit are consubstantial, or same in their essences. In the Council of Nicaea, Holy Trinity theory was publicly acclaimed; as a result, Arius was expelled from the council and condemned as heresy. Despite Arianism was denounced as heresy, a substantial group of followers in Egypt still believed in Arius's theory, and their influence in Alexandria was still prevalent. Therefore, dispute was inevitable. For instance, Athanasios of Alexandria, although being acclaimed as a great priest by later theologians, had a bad reputation for brutally suppressing his theological opponents in Alexandria while he was the Patriarch of Alexandria. Nevertheless, as Emperor Constantine, the main supporter of the Nicene Creed, died in 337, Arianist theologians in Alexandria led by Gregory of Cappadocia organized an uprising with the support of street mobs. They soon took over the city and charged Athanasios for being an outlawed priest. As a result, Athanasios was forced to be expelled. ==== Chalcedonian Controversy ==== The council of Chalcedon was about the natures of Christ. Nestorian taught that Christ was divided in two natures, God and human. His opponent Eutyche believed there was only one Godly nature. The Coptic Orthodox Church teaches one nature, a whole of God and human. == Identity == === Origin === The word Copt is derived from the Greek word for an inhabitant of Egypt (Αἰγύπτιος): Qibt. The Copts seek to be a distinct ethnicity, both from other Christian denominations and other Egyptians. They view themselves as an ethnie, as the real descendants of the Pharaonic era and the original core of the Egyptian nation. In reality the differences between the Copts and other Egyptians are minor, due to many conversions to Islam and mixed marriages. Besides, some parts of the Coptic community identify as Egyptian, minimizing the ethnical distinction. === Minority === The Copts comprise about 6 to 7 percent of the Egyptian population. They are neither culturally nor ethnically distinctive from other Egyptians. Therefore, we can neither look at the Copts as a cultural nor an ethnical minority, but they are a religious minority within Egypt. The Copts usually stress their Egyptian national identity, which minimize the impact of them being a religious minority set against a muslim majority. There have been multiple disputes within the Coptic community regarding their identity and minority-status in the framework of the Egyptian nation. There is for example a discussion about whether the Copts should cooperate with the Egyptian government against radical Islamist groups or not. This cooperation would lead to the minimization of the impact of being a minority, but the fighting of Muslim extremism coincides with stressing the secular aspect of Egypt and supporting its government. Besides, a part of the Copts feel actively persecuted and discriminated against by the Egyptian government and would never cooperate with them. === Culture === ==== Coptic calendar ==== The Copts use the Coptic calendar. A Coptic year usually starts on the 29th of August and consists of 13 months. It started in 284 CE in the Year of the Martyrs, which corresponded with the first year of Diocletian's rule. ==== Coptic language ==== The Coptic language is an Egyptian language consisting of both Greek and Demotic letters. It is nowadays only used as the liturgical language of the Coptic Church. ==== Occupation ==== Copts can be found at all income levels. The biggest occupational group among them are the peasants who live a simple life in tents in the country, indistinguishable from Muslim peasants. In the cities, Copts are particularly numerous in the private sector, both as employers and as employees. The majority of the pharmacies in Egypt are owned by Copts and a lot of them are doctors, lawyers and engineers. At the very bottom of the social scale are the zabaleen, Cairo's rubbish collectors, who are mainly Coptic christians. They set up an elaborate and efficient system of rubbish-collecting and recycling. The largest zabaleen-settlement is Mokattam village, better known as 'Garbage city'. ==References== ==Other websites== * Copts Category:Copts",
 "title": "Copt"
}