{
 "id": "961243",
 "text": "The western blot is a scientific process. It is a test. Western blotting is also called immunoblotting. Scientists use Western blots to look at proteins. A Western blot can show how big a protein is. Sometimes a Western blot can show how much of the protein is there. Scientists studying proteins do Western blots more than any other test. ==Test== A Western blot is one kind of gel electrophoresis. That means the scientists make a gel in the shape of a rectangle. They put electrodes on two sides of the gel to make electricity. The electricity makes the proteins move from one side of the gel to the other. One end of the gel has a positive electric charge. The other end has a negative electric charge. Most proteins have a negative charge. So the scientists put the proteins on the negative side of the gel. They put them in neat rows so they can see which sample is which. In one row, the scientist puts a mixture of proteins that they already know. This mixture is called a ladder. Then the scientist turns on the electrodes to make a charge. This can be 60V. The proteins have a negative charge, so they move toward the positive side of the gel as if they are running a race. The scientist or technician waits for some time. This can be 90 minutes. Then the scientist turns off the electrodes so that the proteins stop moving. Then they look at the gel to see how far each sample moved. Small proteins move through gel faster than large proteins, so they move further. Proteins with big electric charges move faster than proteins with small electric charges. These are some ways a Western blot helps scientists tell proteins apart. Next, the scientist moves the proteins from a gel onto a blotting membrane. This is why it is called a blot. The scientist puts the rectangular membrane on top of the rectangular gel, so the proteins stay in the same pattern. Most proteins are clear or cloudy, so scientists have to make them easier to see. First, they block the proteins. That means they treat them so they will not bind to anything the scientist does not want. They can use milk to do this. Then they treat the proteins with a primary antibody. The primary antibody sticks to the protein. Then they treat them with a secondary antibody. The secondary antibody sticks to the primary antibody. The secondary antibody either glows or changes color. This way, the scientists can see how much protein is there on the membrane and where it went when it moved through the gel. Sometimes scientists denature the proteins before the Western blot. Proteins are long chains of amino acids, like beads on a string. Most of the time, proteins are crumpled or squashed into balls or other shapes. A large protein in a tight ball will move faster than a large protein unfolded like a string. This can be confusing. Denaturing the protein makes it unfold so it is more like a string. This makes it easier to tell large proteins from small ones. Scientists put the chemical sodium dodecyl sulfate (SDS) in the gel, so the proteins stay unfolded. Otherwise, the proteins shrink into their tight ball shape again. == High-Throughput Western Blotting == In high-throughput Western blotting, researchers often need to process many samples simultaneously. To accommodate this, a 96 well plate template is commonly used. This template facilitates the rapid preparation and analysis of multiple protein samples by allowing automated or semi-automated handling of numerous wells at once. The template is integrated with the sample loading system to ensure consistent distribution of samples across the membrane, making the Western blotting process more efficient and suitable for large-scale studies. Most proteins are clear or cloudy, so scientists have to make them easier to see. First, they block the proteins. That means they treat them so they will not bind to anything the scientist does not want. They can use milk to do this.[2] Then they treat the proteins with a primary antibody. The primary antibody sticks to the protein. Then they treat them with a secondary antibody. The secondary antibody sticks to the primary antibody. The secondary antibody either glows or changes color. This way, the scientists can see how much protein is there on the membrane and where it went when it moved through the gel. Sometimes scientists denature the proteins before the Western blot. Proteins are long chains of amino acids, like beads on a string. Most of the time, proteins are crumpled or squashed into balls or other shapes. A large protein in a tight ball will move faster than a large protein unfolded like a string. This can be confusing. Denaturing the protein makes it unfold so it is more like a string. This makes it easier to tell large proteins from small ones. Scientists put the chemical sodium dodecyl sulfate (SDS) in the gel, so the proteins stay unfolded. Otherwise, the proteins shrink into their tight ball shape again. ==Uses== Most of the time, the scientist already thinks they know which proteins are in the sample. They choose a primary antibody that sticks to that protein. For example, if a doctor knows a patient is sick and thinks that patient has HIV, the doctor will take a cell sample from that patient. They will run a Western blot to look for proteins that HIV makes. ==Results== Scientists say Western blots are semi-quantitative. This means that the scientist can tell whether there is more or less protein but not exactly how much. ==Name== The first Western blot was in 1979. It got its name in 1981. The Western blot is named after the person who invented the Southern blot, Edwin Southern. Southern blots find DNA. When scientists changed the Southern blot to find RNA, they called it a Northern blot. When scientists changed the Southern blot to find proteins, they called it a Western blot. When scientists changed the Southern blot to find lipids (fats), phosphates, and glycoconjugates, they called it an Eastern blot. ==References== Category:Molecular biology Category:Laboratory techniques Category:1979 establishments",
 "title": "Western blot"
}