{
 "id": "961472",
 "text": "The 1913 Breda–The Hague women's fencing competition was the first women's national fencing competition in the Netherlands on 27 April 1913. The competition was held between fencers of the Bredasche Schermvereeniging from Breda and Salle De Vos from The Hague. The competition was organized by the \"Bredasche Schermvereeniging\" (fencing association of Breda). There was a “large” audience, both civilian and military people. The cadets orchestra played during the event. The prize for the winner was offered by the mayor of Breda . The prizes were awarded by chairman of the Bredasche Schermvereeniging, captain P. W. Scharroo. ==Background== In the early 20th century, febcing masters also started training women at their academies. Salle De Vos from The Hague was one the Dutch earliest academies in women's fencing. Already three years before this first national competitions, women fencers of De Vos already competed internationally in London, United Kingdom during the 1911 England–Holland women's fencing competitions. The women of the Bredasche Schermvereeniging started fencing only recently, around half a year before this competition. ==Results== The fencers from The Hague were much better than the ladies from Breda. The first six of the seven prizes were won by the women from The Hague. T. van den Bergh won in a “beautiful way” the first prize. Beelaerts van Blokland and S. C. Scharroo Habbema, who lost both the same amount of matches, won the second and third prize. Their fencing was described as quick and elegant. Rank Name Affiliation 1 T. van den Bergh Salle De Vos 2 Julia Beelaerts van Blokland Salle De Vos 3 S. C. Scharroo Habbema Salle De Vos 4 H. van den Bergh Salle De Vos 5 Zilessen Salle De Vos 6 Lechner Salle De Vos 7 S. Woldring Bredasche Schermvereeniging ==References== Category:1910s in women's fencing Category:Sport in the Netherlands Category:1913 in Europe Category:1913 in sports Category:Breda",
 "title": "1913 Breda–The Hague women's fencing competition"
}