{
 "id": "961477",
 "text": "The Republic of Western Armenia, is a so-called state claiming sovereignty over parts of the Armenian highlands including sections of Western Armenia as well as Artsakh, and Nakhichevan.\"Batı Ermenistan'a Hoş Geldiniz\". Western Armenia TV. (in Turkish). \"Artsakh ve Nahiçevan’ın Batı Ermenistan Cumhuriyeti’nin bir parçası olduğunu biliyor musunuz?\"\"Batı Ermenistan'a Hoş Geldiniz\". Western Armenia TV. (in Turkish). \"Artsakh ve Nahiçevan’ın Batı Ermenistan Cumhuriyeti’nin bir parçası olduğunu biliyor musunuz?\" Also, the self-declared country says it has its own presidency, government, parliament, constitution, national anthem and coat of arms.\"Batı Ermenistan'a Hoş Geldiniz\". Western Armenia TV. (in Turkish). \"Bugün Batı Ermenistan’ın devletin tüm kurumsal yapılarına sahip olduğunu biliyor muydunuz: Cumhurbaşkanlığı, hükümet, parlamento, anayasa, milli marşı ve arması?\" The individuals of the Republic of Western Armenia claim to be the legal successor of the Armenian state recognised by international law in 1920, and therefore internationally recognised.\"Welcome to Western Armenia\". Western Armenia TV. \"Therefore, today there are two internationally recognized Armenian states: (...) The Republic of Western Armenia, the legal successor of the Armenian state recognized by international law in 1920.\" == Background == The presence of Armenians in Anatolia has been documented since the sixth century BCE, about 1,500 years before the arrival of Turkmens under the Seljuk dynasty. In the 16th and 17th centuries, historical Armenia was divided between the Ottomans taking the West and the Safavids taking the East. On the eve of World War I in 1914, around two million Armenians lived in Anatolia out of a total population of 15–17.5 million. According to the Armenian Patriarchate's estimates for 1913–1914, there were 2,925 Armenian towns and villages in the Ottoman Empire, of which 2,084 were in the Armenian highlands in the vilayets of Bitlis, Diyarbekir, Erzerum, Harput, and Van. Armenians were a minority in most places where they lived, alongside Turkish and Kurdish Muslim and Greek Orthodox Christian neighbors. According to the Patriarchate's figure, 215,131 Armenians lived in urban areas, especially Constantinople, Smyrna, and Eastern Thrace. Although most Ottoman Armenians were peasant farmers, they were overrepresented in commerce. As middleman minorities, despite the wealth of some Armenians, their overall political power was low, making them especially vulnerable. The ethnic cleansing of Armenians during the final years of the Ottoman Empire is widely considered a genocide, The Ottoman Empire massacred approximately 600,000–1,500,000 Armenians. The first wave of persecution was in the years 1894 to 1896, the second one culminating in the events of the Armenian genocide in 1915 and 1916. == History == On February 4, 2011 the beginning of the process of formation of the Government-in-Exile of Western Armenia was announced (now – the Government of the State of Western Armenia). In November 2013, through direct elections via Internet, the National Assembly (Parliament) of Western Armenia was formed, whose deputies at the first session of the Parliament on January 20, 2014, in Paris, elected the President of Western Armenia.\"About Government\" . The Government of the Republic of Western Armenia (Armenia). == The claimed lands == The \"Western Armenia TV\" newscaster introduced cities such as Bitlis, Muş, Van, Mardin, Iğdır, Adana, Trabzon and Rize as \"Western Armenia\" in his news bulletins.\"Ermeni spikerden Türk siyasetçiye çok sert 'Batı Ermenistan' yanıtı!\". Rudaw. \"Haber bültenlerinde Bitlis, Muş, Van, Mardin, Iğdır, Adana, Trabzon ve Rize gibi kentleri “Batı Ermenistan” olarak tanıtan \"Western Armenia\" adlı televizyon kanalı spikeri (...)\" Artsakh and Nakhichevan is also claimed lands.\"Batı Ermenistan'a Hoş Geldiniz\". Western Armenia TV. (in Turkish). \"Artsakh ve Nahiçevan’ın Batı Ermenistan Cumhuriyeti’nin bir parçası olduğunu biliyor musunuz?\" The announcer also added that Western Armenia, which was declared an independent and sovereign state in 1920, is now occupied by Turkey. Sooner or later it will return to its true owners, the Armenians,\" he said.\"Ermeni spikerden Türk siyasetçiye çok sert 'Batı Ermenistan' yanıtı!\". Rudaw. \"Ermenistan'da yayın yapan \"Western Armenia\" adlı televizyonun spikeri, “1920’de bağımsız ve egemen bir devlet olarak ilan edilen Batı Ermenistan, şimdi Türkiye tarafından işgal edilmiş durumdadır. Er ya da geç gerçek sahiplerine Ermenilere dönecek” dedi.\" Erzurum, which the Armenians call \"Karin\", is claimed as the capital.\"Deputies of Western Armenia - led by President A. Aprahamian visited Karin - Western Armenia TV\". Western ArmeniaTV. \"Karin is of key importance because it is the capital of Western Armenia.\" == References == == Sources == * * * * Category:Unrecognized countries",
 "title": "Republic of Western Armenia"
}