{
 "id": "961840",
 "text": "is a fictional character from the Pokémon media franchise, which is owned by Nintendo and Game Freak. She first appeared in the video games Pokémon X and Y as one of the two main characters players can choose, along with her male counterpart, Calem. Serena also appears in other Pokémon publications, especially in the anime, where she is Ash Ketchum's traveling companion in the Kalos region. Her dream is to become the Kalos Queen, a title given to the best Pokémon performer in that area. In the manga series, where the characters and storyline are different from the video games and anime, she is known as Yvonne Gabena. Although Serena shares a similar background with other female characters in the Pokémon video game series, she received a positive reception for her appearance in the anime. she was well-received for her appearance in the anime. She gained fame for showing romantic feelings towards Ash Ketchum during the Pokémon XY anime series, which was evident through her blushing and getting flustered whenever she saw, talked to, or was close to Ash. However, this portrayal received criticism for being too exaggerated and not entirely suitable for the target audience of the Pokémon anime, which is children. The scene where Serena kisses Ash in the final episode of Pokémon XYZ became one of the favorite kissing scenes among anime fans in Japan. ==Design== Serena character was designed by Ken Sugimori and Atsuko Nishida for the video game series. While the anime and movie was designed by Toshihito Hirooka, and for manga by Satoshi Yamamoto. Her name comes from the French word serein, meaning \"calm\" or \"peaceful\". Serena's voice actor is Mayuki Makiguchi for Japanese, and Haven Paschall for English. ==Appearance== ===Video games=== Serena first appears in Pokémon X and Y as a playable character if the player chooses, and also as a rival if player chooses a male character, Calem. In Pokémon Masters EX, she appears as a Pokemon Trainer and forms a sync pair with Fennekin and its evolutions Braixen and Delphox. She also appears alongside Calem as a Pokémon Trainer trophy in Super Smash Bros. ===Anime=== Serena first appeared in Pokémon the Series: XY's episode \"Kalos, Where Dreams and Adventures Begin!\" It is known that she already knew each other with Ash Ketchum when they both attended Professor Oak's summer camp in Pallet Town. During the event, Serena lost her way and fell in the forest before being helped by Ash. Since then, she has had a crush on Ash and when Ash arrived at Kalos, her original intention was to return the handkerchief he had used to bandage her wound. Serena then chose to make a career as a Pokemon Performer after attending Sycamore summer camp. She has a dream to become a Kalos Queen. After Ash finished the event in the Kalos League, Serena then decided to continue her career by going to Hoenn. Before parting, she gave Ash a kiss as well as revealing her feelings that were stored all this time. Serena is back in a cameo appearance in Pokémon Ultimate Journeys: The Series. She encouraged Chloe to attend the Lilycove City Pokémon Contest. Just before Ash, Chloe, and Goh departed for Vermillion City, she briefly reunited with Ash where they both shared their respective goals to each other. She also promised to support Ash in World Coordination Series. ===Other appearance=== In Pokémon Adventures chapter X & Y, a female character named Y or Yvonne Gabena is loosely based on Serena. Serena appeared in Diancie and the Cocoon of Destruction and Hoopa and the Clash of Ages manga, serving the same role as in the respective movies they were based on. She appeared in Pokémon Evolutions anime web series on episode \"The Visionary\". ==Reception== Serena got different opinions about her appearance in the Pokémon X and Y video games. Writers like Tom Hoggins from The Telegraph and Griffin McElroy from Polygon said that the main characters in X and Y seemed \"stiff, flat, and predictable\" because they followed the usual storyline from previous Pokémon video games. They pointed out that there wasn't much background information and clear reasons for why the main characters suddenly agreed to become Pokémon Trainers. Jose Otero from IGN mentioned that Serena represented girls and Calem represented boys, and they were actually more interesting as rival characters for players. In the X and Y video games, Nintendo and Game Freak focused more on showing friendship than intense competition. Similar to Otero, Randolph Ramsay from GameSpot stated that the main characters in X and Y had a unique charm even though the game's storyline wasn't very captivating. Meanwhile, Victoria McNally from The Mary Sue liked the character Serena in X and Y because she represented female players and gave them choices to change her hairstyle and clothing style. Serena received positive feedback for her character portrayal in the anime, which was different from her depiction in the video games. In this version, Serena's character development happened gradually. Initially introduced as a shy person, she transformed into someone wise and capable of making tough decisions. This change was also evident in her evolving hairstyle and clothing throughout the season, including when she returned in Pokémon Journeys. Additionally, Serena became well-known for her close relationship with Ash Ketchum, which developed into romantic feelings. Megan Peters from Comic Book described Serena as one of Ash's best friends, if not the best, who not only showcased character growth since her first appearance but also formed a heartfelt connection with Ash. This caused fans to have mixed feelings, some liking it and some not. Similarly, Brian Ashcraft from Kotaku mentioned that Serena wasn't just a regular friend to Ash, as they had known each other since childhood. For the first time, albeit subtly, the Pokémon anime portrayed a romantic connection between the two main characters. However, Serena's portrayal of romantic feelings towards Ash has also faced criticism for being seen as excessive, especially regarding the kissing scene in the final episode of Pokémon XYZ. Scott Wilson from Sora News 24 wrote that it was \"strange to see a kissing scene between Serena and Ash,\" particularly because Ash himself seemed to be \"stuck\" at the age of 10 throughout the Pokémon anime, which has been running since 1997. For Pokémon, a show aimed at children, the addition of such a scene was seen as awkward. Similarly, Max Chang from Nextshark stated that the kissing scene between Serena and Ash was the first time that the Pokémon anime felt odd. This was because the producers had always tried to keep the anime pure by avoiding sensitive scenes that wouldn't be suitable for young viewers. Among fans, the romantic relationship between Serena and Ash is known as \"Amourshipping\", and it's indirectly acknowledged by The Pokémon Company staff. Serena is the first female traveling companion to kiss Ash on the lips. It was later revealed that this storyline was planned by Tetsuo Yajima, the director of the Pokémon XY anime, along with producer Shukichi Kanda. However, since the primary target audience for the Pokémon anime is children, the kissing scene couldn't be shown openly. It was intentionally made ambiguous, with Serena's lifted foot and a surprised expression on Pikachu, Clemont, Bonnie, and Dedenne's faces. A online petition was created by fans in Japan and the United States with the hope of having Serena continue her journey with Ash to the Alola region in the Pokémon Sun & Moon anime. However, this petition didn't ultimately influence the producer's decisions. A fan-made imaginative poster went viral on the internet in early 2020, portraying Serena and Ash as adults who are married and have two children. In a Japanese online poll conducted by Netorabo in 2021, Serena ranked first as the most beloved female Pokémon anime character among fans. Meanwhile, in a poll organized by Anime! Anime! in 2022, which coincided with International Kissing Day on May 23rd, the kissing scene between Ash and Serena ranked fourth as the favorite kissing scene among anime fans in Japan. == Notes == ==References== Category:Pokémon characters Category:Anime characters Category:Fictional characters introduced in 2013",
 "title": "Serena (Pokémon)"
}