{
 "id": "962229",
 "text": "Nick Dixon (born 26 September 1971) is a Scottish journalist, television presenter and a former television producer. ==Work== He is best known for his roles on the ITV breakfast programmes GMTV, Daybreak and Good Morning Britain. In 2005, Dixon joined the GMTV breakfast show as a news reporter and fill-in on the show. When GMTV closed in 2010, he moved to the show's successor, Daybreak, where he worked as a New York City correspondent. He now lives in London working as a correspondent for the current ITV breakfast programme Good Morning Britain. Nick Dixon left school at the age of 16 and started working for BBC Scotland as a postman. In 1991, Dixon started as a copyist in the BBC Radio Scotland newsroom, progressing to writing stories for reporters and correspondents and assisting on the spot. Dixon joined Radio Clyde in Glasgow as a production assistant in 1993 and in the same year worked as a researcher on the BBC quiz programme Catchword. Dixon started at Scottish Television (STV) as advertising director in 1995, where he wrote, edited, voiced and directed on-air advertising material, as well as live continuity adverts. During this time, he created the Formula One news website, which won a BBC Web Award. 1999 marked the beginning of Dixon's time with Scotland's leading television news programme, Scotland Today, starting as a production journalist. During his seven years at the station, he anchored the newscasts, weekend news and breaks, as well as the main evening show. Dixon reported on news such as the Maryhill gas explosion, the so-called Tsunami, the opening of the Scottish Parliament and the Edinburgh Festival. Dixon also produced a documentary on STV entitled Archie McLean: The Forgotten Father of Brazilian Football. Moving to London in July 2005, Dixon joined GMTV as a news producer. He was promoted to reporter in November 2005 and in his first week on the job he reported live from the Paris riots on the Champs Elysees. Dixon reported live from Times Square, New York City on David Blaine's world record attempt in May 2006. He was also a relief newscaster on GMTV. In September 2010, Dixon moved to the ITV show Breakfast Daybreak as a correspondent in New York. From July 2011 to April 2014, he was a journalist for Features based in London. In April 2014, Daybreak was dropped to make way for a new ITV breakfast show called Good Morning Britain, for which Dixon is a news correspondent. Category:1971 births Category:Living people Category:Scottish journalists",
 "title": "Nick Dixon"
}