{
 "id": "962231",
 "text": "In 2022, Iran had a dress-code which specified what kinds of clothes were acceptable in public, and which ones were not. Since the 1980s, women have to cover their hair, using what is called hijab. In 2022, people protested against this ruling. These protests became known as Enghelab protests (). They are seen as part of a wider movement to make Iran a more democratic country since the 1953 Iranian coup d'état, in which the US and the UK overthrow of the democratically elected Prime Minister of Iran, Mohammad Mosaddegh, due to his policy to nationalize Iran's oil industry. The protests were inspired by Vida Movahed (), an Iranian woman known as the Girl of Enghelab Street (). She was given that name, because she stood in the crowd on a utility box on Enghelab Street (Revolution Street) in Tehran on 27 December 2017 during the 2017-2018 Iranian protests; a white cloth, to a stick, and waved it to the crowd as a flag. She was arrested on that day and was released temporary on bail a month later, on 28 January 2018. Some people interpreted Movahed's action as being based on Masih Alinejad's call for White Wednesdays, a protest movement that the presenter at VOA Persian Television started in early 2017. Other women later re-enacted her protest and posted photos of their actions on social media. These women are described as the \"Girls of Enghelab Street\" and \"The Girls Of Revolution Street\" in English sources. Some of the protesters however claim that they were not following Masih Alinejad's call. The protests intensified in 2022 due to the death of Mahsa Amini. == Laws == In the Islamic law of Iran imposed shortly after the 1979 Revolution, article 638 of 5th book of Islamic Penal Code (called Sanctions and deterrent penalties) women who do not wear a hijab may be imprisoned from ten days to two months, and/or required to pay fines from Rls.50,000 to Rls.500,000 . Fines are recalculated in the courts to index for inflation. This has been translated and published by the Legal Information Institute of Cornell Law School. Article 639 says, two types of people shall be sentenced one year to ten years' imprisonment; first a person who establishes or directs a place of immorality or prostitution, second, a person who makes it easier for people to commit immorality or prostitution. or encourages them to do this. == References == Category:Clothing controversies Category:History of Iran Category:2020s protests",
 "title": "Girls of Enghelab protests in Iran"
}