{
 "id": "96245",
 "text": "Ethylene General Molecular formula C2H4 SMILES C==C Molar mass 28.05 g/mol Appearance colorless gas Properties Density and phase 1.178 kg/m³ at 15 °C, gas Solubility in water 3.5 mg/100 ml (17 °C) Melting point −169.2 °C (104.0 K, -272.6 °F) Boiling point −103.7 °C (169.5 K, -154.7 °F) Structure Symmetry group D2h Dipole moment Zero Ethylene or ethene is a chemical compound with two carbon atoms and four hydrogen atoms in each molecule. These molecules are put together with a double bond that makes it a hydrocarbon. It is very important in industry and has even been used in biology as a hormone. It is also the most made chemical. About 75 million tons of it have been made each year since 2005.“Production: Growth is the Norm” Chemical and Engineering News, July 1 0, 2006, p. 59. Its biggest use is to make polyethylene. It is a gas at 25 degrees Celsius at standard atmosphere (a specific pressure). ==History== Since 1795, ethylene was called an olefiant gas, or oil making gas. This was because it came together with chlorine to make the oil of the Dutch chemists. In 1866, the German chemist August Wilhelm von Hofmann came up with a system for naming hydrocarbons. The suffixes -ane, -ene, -ine, -one, and -une were used to call the hydrocarbons with 0, 2, 4, 6, and 8 fewer hydrogen atoms than the alkane it came from. Because of this system, ethylene became ethene. In 1979, the IUPAC decided that ethylene would stay ethylene. ==How it is made== Ethylene is made in the chemical industry by steam cracking. Some of the parts of an ethylene plant can be: # The steam cracking furnaces; # Heat recovery systems; # A steam recycling system; # A system to compress the cracked gas; # A system to remove acid gas; There are other systems in an ethylene plant. The systems listed above were the most important systems in an ethylene plant. Since making ethylene uses a lot of energy, the people making the ethylene try very hard to keep the heat from the gasses from leaving the furnaces. ==References== ==Other websites== *International Chemical Safety Card 0475 2",
 "title": "Ethylene"
}