{
 "id": "962488",
 "text": "The world's fastest train is the Shanghi Maglev in China, It can reach a top speed of The train is unusual because it uses magnetic levitation to float over an elevated track rather than using wheels on railway tracks as most trains do. The train that runs fastest while carrying passengers is the CR400 Fuxing from China. It can go at . The fastest speed on a test run by a regular train was on 3 April 2007 in France. ==Fastest train by country== ===America=== In the United States, the fastest trains are legacy Acelas,They can run at . ===China=== The Shanghi Maglev in China can go as fast as . It is a special type of train that uses magnetic force to hold it off the ground. This causes it to \"fly\" a few centimetres above its special guide track. China also has the CR400 Fuxing trains, They can go at speeds of up to , and have done on a test run. ===France=== France is known for its TGV trains. Some travel up to on some routes. 3 April 2007 - TGV V150 official bite speed record 574,8 km/h: https://en.wikipedia.org/wiki/TGV_world_speed_record ===Germany=== In Germany, the fastest train is their ICE3. It goes up to a speed of . It has also gone as fast as on a special test run. ===Japan=== Japan is known for its bullet trains on its Shinkansen (high speed) railway lines. The fastest, the Japanese Railways East (JR East) E5 go at up to . ===Morocco=== The first high speed line in Africa opened in November 2018 in Morocco. It runs between Tangier and Casablanca. The Alboraq trains came from the French TGV. They have a maximum speed of . ==Historical speed records== The maximum records have usually been set on special test runs and are for conventional (normal) trains: * Some said that on 9 May 1893 engine No. 999 of the New York Central Railway achieved , and on 11 May 1893. Many said this speed was not correct. The New York Central Railway said that the high speed was probably less than . * In England, the City of Truro seems to have close to going down a hill on 9 May 1904.Allen (1992). p. 12 * On 30 November 1934, the English locomotive No. 4472 Flying Scotsman with a speed recording (dynometer) car went faster than . This was first time for a steam engine to go that fast.Allen (1992). p. 18 * In Germany on 11 May 1936, No. 05.002 was seen to go as fast as .Allen (1992). p. 22 * On 3 July 1938 in England, No. 4472 Mallard claimed a world record for a steam engine of .Allen (1992). p. 36 * France set new world speed records for trains several times. In 1955, it set the record at . On 1981, they reached . In 1990, the new record was . They reached on 3 April 2007. == References == Category:Pages created with the Article Wizard from 2022 Category:Trains",
 "title": "Railway speed record"
}