{
 "id": "9624",
 "text": "Rhineland-Palatinate (, Rhine Franconian: Rhoilond-Palz) is one of 16 states () of Germany. It has an area of and 4.073 million people living in it. The capital is Mainz. == History == Rhineland-Palatinate was created on 30 August 1947. It was formed from the northern part of the French Occupation Zone (the Rhenish Palatinate or which had been a part of Bavaria) as well as the southern parts of the Prussian Rhine Province, Birkenfeld which formerly belonged to Oldenburg, parts of the Prussian Province of Nassau (see Hesse- Nassau), and parts of Hesse-Darmstadt as well as Rheinhessen on the western banks of the Rhine. The people of the new state voted to accept the boundary changes in a referendum on 18 May 1947. == Geography == Rhineland-Palatinate borders on (from the north and clockwise) North Rhine-Westphalia (another German state), Hesse (another German state), Baden-Württemberg (another German state), France, Saarland (another German state), Luxembourg, and Belgium. The main axis of the state is the Rhine river, that forms the border with Baden- Württemberg and Hesse in the southeast before running across the northern part of Rhineland-Palatinate. The Rhine Valley is bounded by mountains with some of the historically most significant places of Germany. In the northwest there are the southern parts of the Eifel mountains. Farther south there is the Hunsrück mountain, which is continued by the Taunus mountains on the opposite side of the Rhine. The hilly lands in the south of the state are called the Palatine Forest (Pfälzerwald). These mountains are separated from each other by the tributaries of the Rhine: the Moselle (Mosel), the Lahn and the Nahe. == Government == Rhineland-Palatinate is a parliamentary democracy. Every five years, all Germans over the age of 18 elect the members of the Rhineland- Palatinate Parliament, . This regional parliament or legislature then elects the premier and confirms the cabinet members. Rhineland-Palatinate is the only German Bundesland (state) to have a cabinet minister for winegrowing. == Castles == This is only some of the castles in Rhineland-Palatine: Name Place Burg Arras Alf Alte Burg Boppard Reichsburg Cochem Cochem Dahn Dahn Festung Ehrenbreitstein Koblenz, Ehrenbreitstein district Ehrenburg Brodenbach Burg Eltz Münstermaifeld Burg Falkenstein Falkenstein Frauenburg Frauenberg Hambacher Schloss Neustadt an der Weinstraße, Hambach district Burg Hohenfels Imsbach Burg und Schloss Idar-Oberstein Idar-Oberstein Burg Lahneck Lahnstein Burg Altleiningen Altleiningen Marksburg Braubach Burg Nassau Nassau Nürburg Nürburg Burg Olbrück Niederdürenbach Burg Pfalzgrafenstein on an island in the Rhine, by Kaub Burg Reichenstein Trechtingshausen Burg Rheinfels Sankt Goar Rheinstein Trechtingshausen Schloss und Burg Sayn Bendorf Schloss Bürresheim Sankt Johann, Mayen-Koblenz, Bürresheim district Schloss Neuwied Neuwied Schloss Stolzenfels Koblenz, Stolzenfels district Schmidtburg Schneppenbach Schönburg Oberwesel Burg Sooneck Niederheimbach Burg Stahleck Bacharach Trifels Annweiler am Trifels Schloss Montabaur Montabaur Thurant Alken == Universities == There are 7 universities and 13 \"Fachhochschulen\". * Technische Universität Kaiserslautern * Universität Koblenz-Landau – locations: Koblenz, Landau * Johannes Gutenberg-Universität Mainz * Universität Trier * Fachhochschule Bingen * Fachhochschule Kaiserslautern – locations: Kaiserslautern I and II, Pirmasens and Zweibrücken * Fachhochschule Koblenz – locations: Koblenz, Höhr-Grenzhausen, Remagen * Fachhochschule Ludwigshafen * Evangelische Fachhochschule Ludwigshafen * Fachhochschule Mainz * Fachhochschule Trier – locations: Trier, Idar-Oberstein, Birkenfeld * Fachhochschule Worms * Katholische Fachhochschule Mainz * Fachhochschule für Finanzen Edenkoben * Fachhochschule der Deutschen Bundesbank, Hachenburg * Fachhochschule für öffentliche Verwaltung Mayen * Wissenschaftliche Hochschule für Unternehmensführung Otto-Beisheim-Hochschule (private university) * Philosophisch-Theologische Hochschule Vallendar (church university) == Politics == The Ministers President since 1947: * 1947–1947: Wilhelm Boden, CDU * 1947–1969: Peter Altmeier, CDU * 1969–1976: Helmut Kohl, CDU * 1976–1988: Bernhard Vogel, CDU * 1988–1991: Carl-Ludwig Wagner, CDU * 1991–1994: Rudolf Scharping, SPD * 1994–2013: Kurt Beck, SPD * 2013–present: Malu Dreyer, SPD == Partnerships == * , Bourgogne * , in East Africa * , Province of València * 's German-Speaking Community * , Voivodeship of Oppeln * , Middle Bohemia * , Province of Fujian * , State of South Carolina * , Prefecture of Iwate == Administration == Rhineland-Palatinate is divided into 24 districts, grouped into the three administrative regions: Koblenz, Trier and Rheinhessen-Pfalz. === Districts === (with county code car plate) # Ahrweiler (AW) # Altenkirchen (AK) # Alzey-Worms (AZ) # Bad Dürkheim (DÜW) # Bad Kreuznach (KH) # Bernkastel-Wittlich (WIL) # Birkenfeld (BIR) # Cochem- Zell (COC) # Donnersbergkreis (KIB) # Eifelkreis Bitburg-Prüm (BIT) # Germersheim (GER) # Kaiserslautern (KL) 13. Kusel (KUS) 14. Mainz-Bingen (MZ) 15. Mayen-Koblenz (MYK) 16. Neuwied (NR) 17. Rhein-Hunsrück-Kreis (SIM) 18. Rhein-Lahn-Kreis (EMS) 19. Rhein-Pfalz-Kreis (formerly LU, now RP) 20. Südliche Weinstraße (SÜW) 21. Südwestpfalz (PS) 22. Trier-Saarburg (TR) 23. Landkreis Vulkaneifel (DAU) 24. Westerwaldkreis (WW) === Big cities === # Mainz # Koblenz # Kaiserslautern # Ludwigshafen # Neuwied # Landau # Pirmasens # Mayen # Bad Kreuznach ==Related pages== * List of coats of arms of the districts in Rhineland-Palatinate Category:Wine regions",
 "title": "Rhineland-Palatinate"
}