{
 "id": "962509",
 "text": "The 1914 La Femme Contemporaine women's fencing competition was a women's international fencing competition during the exposition in Antwerp, Belgium on 21 May 1914. The competition was organized the fencing academy of Salle Verbrugge. About half of the over 50 women who entered competed. Each fencer competed against each other fencer. The Dutch Esther Bekkers-Lopes Cardozo of Salle Giandomenici won the competition ahead of the Preetorius of Salle Verbrugge the Belgian J. De Deken. Ahead of the competition it was stated as \"the most important tournament of the last years\". ==Entrants== On 10 May it was reported that over 40 women entered for the competition. With this number of entrants it was stated as \"the most important tournament of the last years\". This number of entrants increased to over 50 women. However, about half of these entrants withdrawn. The Algemeen Handelsblad newspaper stated fencers from three nations competed, being Belgium, the United Kingdom and the Netherlands. Newspaper De Telegraaf lists Preetorius as a German, and newspaper De Maasbode names her fräulein, the German language honorific for unmarried women. Algemeen Handelsblad only states that Preorius is from the Belgian \"Salle Verbrugge\" without indicating a nationality. The only two Dutch entrants (both competed) were: Esther Bekkers-Lopes Cardozo and Adrie Meyerlink, both of Salle Giandomenici. ==Schedule== In the morning of 21 May 1913 the preliminairy matches were held at Salle Verbruggen. In the afternoon the finalists competed at \"Stedelijke Feestzaal\", the main the exposition area. The matches were in \"competition-format\" meaning that each fencer competed against each other fencer. ==Matches== ===Preliminairies=== From the preliminaires, that were held in the morning, the seven women that qualified for the final were: * * * * * * * ===Final=== In the final all fencers competed once against each others. Esther Bekkers-Lopes Cardozo was able to win from all her opponents. With 35 touchés she won the first prize. A silver cup. Rank Name Salle Won Lost Given touche Received touche 1 Salle Giandomenici 7 0 25 2 Salle Verbrugge 6 1 3 Salle Verbrugge 4 3 30 23 4 Salle Giandomenici 4 3 30 24 5 6 (or Cross) Salle Verbrugge ===Gala Assaut=== After the finals, the two Dutch ladies gave a gala assaut, that was won by Esther Bekkers-Lopes Cardozo with 5-3. ==References== Category:1910s in women's fencing Category:Sport in Belgium Category:1914 in Europe Category:1914 in sports",
 "title": "1914 La Femme Contemporaine women's fencing competition"
}