{
 "id": "962663",
 "text": "Net 25 (capitalized and stylized as NET25) is a Philippine television network. It is owned and operated by Eagle Broadcasting Corporation. The network is named for its flagship station in Metro Manila, DZEC-TV, which is carried on UHF Channel 25 on analog terrestrial TV and UHF Channel 28 on digital terrestrial TV. It has carried by major cable operators in the country. The station's broadcast facilities are located at EBC Building #25 Central Ave., Barangay Culiat, New Era, Quezon City. ==Digital television== Net 25, with the help of GEMNET, had the first digital and full HD coverage of the 2010 Philippine elections via the ISDB-T system through their sister station's frequency, Channel 49. It also offered real-time election results via datacasting. However, the coverage was only available in some areas in the Philippines. Test digital broadcasts are still being done by the station by simulcasting their evening news program, Mata ng Agila through Channel 49. From September 7, 2017, in time for its 8th year since INC's Executive Minister Eduardo Manalo took office, INCTV was granted a \"special authority\" from the National Telecommunications Commission (NTC) to move its analog feed from UHF Channel 49 to UHF Channel 48, allowing the Net 25 and INCTV channel to simulcast digitally in full-time, which began two days earlier, on September 5. The shift was arranged for the station until its management announced its intention to permanently shut down analog broadcasts and go digital-only. As of October 2021, NET 25 has started its Digital Terrestrial TV (DTT) broadcasts in the areas of Mega Manila on UHF 28 (557.143 MHz). On January 29, 2022, NET 25's Digital Terrestrial TV transmitter power suddenly increased from 500 watts to 5kW. On April 27, 2022, it further received a signal increase to 10kW transmitter power. In October 2022, Eagle Broadcasting Corporation began its expansion rollout on airing NET 25 and INCTV outside Mega Manila as a provisional authority in Baguio City, covering the northern and central parts of Luzon. ==Net 25 Stations== ===Analog=== Branding Callsign Ch. # Power (kW) Station Type Location (Transmitter site) Net 25 Manila DZEC- TV TV-25 50 kW (150 kW ERP) Originating Metro Manila Net 25 Baguio DWDM-TV TV-46 5 kW Relay Baguio Net 25 Laoag TV-25 10 kW Relay Laoag, Ilocos Norte Net 25 Vigan TV-24 1 kW Relay Vigan, Ilocos Sur Net 25 Tuguegarao TV-41 5 kW Relay Tuguegarao Net 25 Lucena TV-28 5 kW Relay Lucena Net 25 Palawan TV-37 5 kW Relay Puerto Princesa Net 25 Naga TV-34 10 kW Relay Naga Net 25 Legazpi TV-25 5 kW Relay Legazpi, Albay Net 25 Iloilo TV-42 5 kW Relay Iloilo Net 25 Bacolod TV-46 10 kW Relay Bacolod Net 25 Cebu DYFX-TV TV-49 10 kW Relay Cebu Net 25 Dumaguete TV-38 5 kW Relay Dumaguete Net 25 Tacloban TV-46 5 kW Relay Tacloban Net 25 Borongan TV-32 5 kW Relay Borongan City Net 25 Calbayog TV-22 5 kW Relay Calbayog Net 25 Zamboanga TV-43 10 kW Relay Zamboanga Net 25 Cagayan de Oro TV-39 10 kW Relay Cagayan de Oro Net 25 Davao DXED-TV TV-39 10 kW Relay Davao Net 25 General Santos TV-42 10 kW Relay General Santos Net 25 Butuan TV-43 5 kW Relay Butuan Net 25 Cotabato TV-33 5 kW Relay Cotabato ===Digital terrestrial=== Branding Callsign Ch. # Frequency Power kW (ERP) Station Type Location (Transmitter site) Net 25 Manila DZEC-TV 28 (Digital test broadcast) 557.143 MHz 10 kW (25 kW ERP) Originating Metro Manila (Mega Manila) Net 25 Baguio DWDM-TV 46 (Digital test broadcast) 665.143 MHz 5 kW Relay Baguio (Northern and Central Luzon) Net 25 Laoag 49 (Digital test broadcast) 683.143 MHz Laoag, Ilocos Norte (Ilocos Region) Net 25 Vigan Vigan, Ilocos Sur Net 25 Tuguegarao Tuguegarao (Cagayan Valley) Net 25 Lucena 51 (Digital test broadcast) 695.143 MHz Lucena/Batangas (Southern Tagalog) Net 25 Palawan 49 (Digital test broadcast) 683.143 MHz Puerto Princesa, Palawan (Mimaropa) Net 25 Naga Naga, Camarines Sur (Bicol Region) Net 25 Legazpi Legazpi, Albay Net 25 Iloilo Iloilo (Western Visayas) Net 25 Bacolod 46 (Digital test broadcast) 665.143 MHz Bacolod (Negros) Net 25 Cebu DYFX-TV 49 (Digital test broadcast) 683.143 MHz Cebu (Central Visayas) Net 25 Dumaguete Dumaguete Net 25 Tacloban Tacloban (Eastern Visayas) Net 25 Borongan Borongan Net 25 Calbayog Calbayog Net 25 Zamboanga Zamboanga City (Western Mindanao) Net 25 Cagayan de Oro Cagayan de Oro (Northern Mindanao) Net 25 Davao DXED-TV Davao (Davao Region) Net 25 General Santos General Santos (South Central Mindanao) Net 25 Butuan Butuan (Caraga Region) Category:Philippine television networks",
 "title": "Net 25"
}