{
 "id": "962742",
 "text": "Ina van Eibergen Santhagens-Waller (11 December 1878 — 24 October 1969) was a Dutch singer, singing teacher, fencer and artist. ==Biography== Waller was born in Haarlem on 11 December 1878. When she was 13 years old, she was one of the two girls who gave flowers to the queen Wilhelmina of the Netherlands when she and her mother Emma of Waldeck and Pyrmont visited Haarlem in September 1892. Waller married to ir. E. van Eibergen Santhagens. ===Singing=== Santhagens-Waller sang in her early career in 1913 as a solo singer in churches, including in Haarlem and The Hague. Later in 1913 she started giving concerts together with violinist Joyce Haworth led by . Their first concert was on 8 November 1913 in Hilversum, at the time also with singer . Next concerts with Haworth and Cornelis followed in February 1914 at \"De Kroon\" in Haarlem and in Nijmegen on 1 April 1914. In 1917 she gave multiple solo concerts, led by Marga Klatte, in Haarlem and Breda. Criticism has been written about her solo performances. In 1919 she gave a solo concert together with cellist F. Canivez led by on the piano. The same year, she was also a singer of the opara Giovanna d'Arco in Amsterdam. In January she gave a solo concert led by J. Otten-van Warmelo. She continued to perform led by Otten-van Warmelo during readings of artist Richard Roland Holst in March and April. Santhagens-Waller was for years a mistress of Holst. Santhagens-Waller became a teacher at the Conservatorium van Amsterdam in the early 1920s. She contributed to the conservatorium concerts, including singing duets with . From 1924 she gave church concerts. In 1926 she sang in an easter radio concert. Her last church concert was in December 1929. In 1932 she started giving singing courses in Amsterdam. ===Fencing=== Next to singing, Santhagens-Waller was also a fencer at Salle Giandominici of Giovanni Giandomenici in Amsterdam. At the time women’s fencing was new as a sport for women. Santhagens-Waller was Oman early women's fencing pioneers and became a women's fencing propagandist. She participated in a fencing demonstration with different fencing academies during “De Vrouw” exposition in June 1913. British violinist Joyce Haworth, with whom she gave concerts at the time, was also a fencer at Salle Giandominici. Santhagens-Waller competed at the 1914 Salle Giandomenici international women's fencing competition. At the 1919 Netherlands women's fencing championship, the first official national championship, she finished second behind Esther Bekkers-Lopes Cardozo. She continued competing in national competitions until 1930. ====Promotion of women's fencing==== Santhagens-Waller was also a propagandist of women's fencing. She wrote an article about women’s fencing in the magazine “De Vrouw en naar Huis” for the April 1926 issue. The article was later also described in the newspaper De Locomotief. Next to pointing out the positives of fencing, the article shows that sport for women was very uncommon in that era. When fencing master Giandomenici moved back to Italy in 1931, Santhagens-Waller wrote for Algemeen Handelsblad how important he has been for women's fencing in the Netherlands. That newspaper article was republished on Giovanni Giandomenici's death in July 1932. ===Art=== Santhagens-Waller visited as a guest the holliday house of artists Richard Roland Holst very frequently. The first time was in 1907. She would become one of the most frequent guest. She was for years a mistress of Holst. Holst made an ex libris for her in 1915. It shows two people in a boat, pulling in the nets. It has the text in Dutch: \"Iederen dag heeft zijn gouden verwachtingen. Ina Santhagens-Waller\" (translated: Every day has its golden expectations. Ina Santhagens-Waller.) This ex-libris is in the collection of the Rijksmuseum and Leiden University Library. Holst also made made an ex-libris for violinist and fencer Joyce Haworth in 1915 and 1920. Santhagens-Waller was good friends with Haworth; they gave concerts together and were both fencing at Salle Giandominici. Santhagens-Waller made a third ex-libris about the children of Haworth: Eduard and Joyce. The original cliché (mounted on a wooden block) is owned by Museum Meermanno since 2010. The Rijksmuseum has over 40 letters that Holst sent to Santhagens-Waller in their collection. Santhagens-Waller died unexpectedly in Amsterdam on 24 October 1969 at the age of 90 years old. She was cremated in Velsen. After her death, she donated works she owned of Richard Roland Holst to the Rijksmuseum. ==References== ==Other websites== *image including Santhagens-Waller in 1914 Category:1878 births Category:1969 deaths Category:Dutch artists Category:Dutch educators Category:Dutch singers Category:Dutch fencers Category:People from Haarlem Category:Sportspeople from North Holland Category:Sportswomen",
 "title": "Ina Santhagens-Waller"
}