{
 "id": "96275",
 "text": "The Archbishopric of Salzburg was a state of the Holy Roman Empire Archbishop of Salzburg as a Prince-Bishop. This means the archbishop had his ecclesiatical (church) powers and also the powers of an he Archbishopric was about the same size as the modern state of Salzburg in Austria. The most famous Archbishop was probably the last to rule as a prince. He was Hieronymus von Colloredo, who was an early patron of Wolfgang Amadeus Mozart. ==History== ===Abbot-Bishopric (4th century–c. 482)=== In 450 a book was written about the live of St Severinus of Noricum. The book said that Salzburg had two churches and a monastery. St. Maxius is the only abbot-bishop known by name. Soon after Maxius was martyred, Salzburg was destroyed soon after in about 482. ===Bishopric (c. 543/698–798)=== St. Rupert later went back to Salzburg to set up the churches again. He saw the ruins of Salzburg overgrown with brambles, but no one knows whether he arrived about 543 during the time of Theodo I or in about 698 when Bavaria was conquered by the Franks. It was not until after 700 that Christian civilisation started to grow again in the region. The cathedral monastery was named in honour of St. Peter and Rupert's niece Ehrentrudis founded the nunnery at Nonnberg. ===Early Archbishopric (798–1060)=== Arno, Archbishop of Salzburg enjoyed the respect of the Frankish king Charlemagne. Charlemagne asked him to make the land between the Danube, the Raab, and Drave Rivers Christian. This area ad recently been taken from the Avars. Monasteries were founded and all of Carinthia was slowly Christianised. While Arno was in Rome attending to some of Charlemagne's business in 798, Pope Leo III appointed him Archbishop over the other bishops in Bavaria (Freising, Passau, Regensburg, and Säben). When the dispute over the church's border between Salzburg and Aquileia broke out, Charlemagne declared the River Drave to be the border. Arno also began the copying of 150 volumes from the court of Charlemagne. This was the start of the first library in Austria. ===Investiture Era (1060–1213)=== The first archbishop of the era was Gebhard, who during the Investiture Controversy remained on the side of the Pope. Because of this, Gebhard was exiled for nine years, but was allowed to return shortly before his death and was buried in Admont. His successor Thimo was imprisoned for five years, and suffered a horrible death in 1102. After King Henry IV abdicated and Conrad I of Abensberg was elected Archbishop. Conrad lived in exile until the Calistine Concordat of 1122. The Archbishops again took the side of the Pope during the arguments between the Pope and the Hohenstaufens. Archbishop Eberard I of Hilpolstein-Biburg was allowed to reign in peace, but his successor Conrad II of Austria made the Emperor's angry and died in 1168 in Admont trying to hide from the Emperor. Conrad III of Wittelsbach was appointed the Archbishop of Salzburg in 1177 at the Diet of Venice, after the supporters of both Pope and Emperor were deposed. ===Prince-Bishopric (1213–1803)=== Archbishop Eberard II of Truchsess was made a prince of the Empire in 1213, and created three new sees: Chiemsee (1216), Seckau (1218) and Lavant (1225). Eberard was excommunicated in 1245 after refusing to publish a decree deposing the emperor. Eberard died suddenly the next year. During the German Interregnum, Salzburg also suffered confusion. Philip of Carinthia was made ruler of Salzburg, but refused to become a priest. This meant he could not be Archbishop, so he was deposed (sacked) by Ulrich, Bishop of Seckau. King Rudolph I of Habsburg quarrelled with the archbishops. The arguments wer started by Abbot Henry of Admont After Henry died the archbishops and the Habsburgs made peace in 1297. The people and archbishops of Salzburgs remained loyal to the Habsburgs in their struggles against the Wittelsbachs. When the Black Death reached Salzburg in 1347, the Jews were accused of poisoning the wells and suffered severe persecution. The Jews were expelled from Salzburg in 1404. Later, the Jews were allowed to return but were forced to wear pointed hats. Although the Renaissance was a time when new paintings, sculptures and music was being made across Europe, this did not happen in Salzburg because the archbishops were not got rulers, and because of poor conditions in the empire during the reign of Frederick IV. Conditions were at their worst during the reign of Bernard II of Rohr. The country was in depression, local authorities were raising their own taxes and the Turks were attackingthe archdiocese. In 1473, he summoned the first provincial diet (parliament) in the history of the archbishopric, and eventually abdicated. It was only Leonard of Keutschach (reigned 1495–1519) who changedthe situation. He had all the burgermeisters and town councillors (who were charging unfair taxes) arrested at the same time and imprisoned in the castle. His last years were spent in bitter struggle against Matthäus Lang of Wellenburg, Bishop of Gurk, who succeeded him in 1519. Archbishop Paris of Lodron led Salzburg to peace and prosperity during the Thirty Years' War in which the rest of Germany was thoroughly devastated. During the reign of Leopold Anthony of Firmian, Protestants emerged more vigorously than before. He invited the Jesuits to Salzburg and asked for help from the emperor, and finally ordered the Protestants to recant or emigrate - about 30,000 people left and settled in Württemberg, Hanover and East Prussia, and a few settled in Georgia in the United States of America. The last Prince- Archbishop, Hieronymus of Colloredo, is probably the most well known for his patronage of Mozart. His reforms of the church and education alienated himself from the people. ===Modern Archbishopric (1803–present)=== In 1803, Salzburg was secularised (stopped being control by the church) as the Electorate of Salzburg. The former Grand Duke Ferdinand III of Tuscany (brother of Emperor Francis II) was made elector. In 1805 Salzburg became a part of Austria, and in 1809, a part of Bavaria. The Bavarians closed the University of Salzburg, banned monasteries from accepting novices (new monks for training), and banned pilgrimages and processions. The Congress of Vienna returned Salzburg to the Austrians in 1814. ==Bishops of Salzburg== ===Abbot-Bishops of Iuvavum c. 300s–c. 482=== * St. Maximus of Salzburg d. 476 Abandoned after c. 482 === Bishops of Iuvavum (from 755, Salzburg) === * St. Ruprecht c. 543–? or c. 698–c. 718 * Vitalis * Erkenfried * Ansologus * Ottokar * Flobrigis * Johann I * St. Virgilius c. 745 or c. 767–c. 784 == Archbishops of Salzburg == ===Archbishops of Salzburg, 798–1213=== * Arno 784–821 * Adalram 821–836 * Leutram 836–859 * Adalwin 859–873 * Adalbert I 873 * Dietmar I 873–907 * Pilgrim I 907–923 * Adalbert II 923–935 * Egilholf 935–939 * Herhold 939–958 * Friedrich I 958–991 * Hartwig 991–1023 * Günther 1024–1025 * Dietmar II 1025–1041 * Baldwin 1041–1060 * Gebhard 1060–1088 * Thiemo 1090–1101 * Konrad I von Abensberg 1106–1147 * Eberhard I von Hilpolstein-Biburg 1147–1164 * Konrad II of Austria 1164–1168 * Adalbert III of Bohemia 1168–1177 * Conrad III 1177–1183 * Adalbert III of Bohemia (restored) 1183–1200 ===Prince- Archbishops of Salzburg, 1213–1803=== * Eberhard II von Truchsees 1200–1246 * Bernhard I von Ziegenhain 1247 * Philipp of Carinthia 1247–1256 * Ulrich von Sekau 1256–1265 * Ladislas of Silesia-Liegnitz 1265–1270 * Friedrich II von Walchen 1270–1284 * Rudolf von Hoheneck 1284–1290 * Konrad IV von Breitenfurt 1291–1312 * Weichard von Pollheim 1312–1315 * Friedrich III von Liebnitz 1315–1338 * Heinrich Pyrnbrunner 1338–1343 * Ordulf von Wiesseneck 1343–1365 * Pilgrim II von Pucheim 1365–1396 * Gregor Schenk von Osterwitz 1396–1403 * Eberhard III von Neuhaus 1403–1427 * Eberhard IV von Starhemberg 1427–1429 * Johann II von Reichensperg 1429–1441 * Friedrich IV Truchsees von Emmerberg 1441–1452 * Sigismund I von Volkersdorf 1452–1461 * Burchard von Weissbruch 1461–1466 * Bernhard II von Rohr 1466–1482 * Bernhard III Peckenschlager 1482–1489 * Friedrich V von Schallenburg 1489–1494 * Sigismund II 1494–1495 * Leonhard von Keutschach 1495–1519 * Matthäus Lang von Wellenburg 1519–1540 * Ernest of Bavaria 1540–1554 * Michael von Khuenburg 1554–1560 * Johann Jakob Khun von Bellasy 1560–1586 * Georg von Khuenburg 1586–1587 * Wolfgang Dietrich von Raitenau 1587–1612 * Marcus Sittich von Hohenems 1612–1619 * Paris von Lodron 1619–1653 * Guidobald von Thun 1654–1668 * Maximilian Gandalf von Khuenburg 1668–1687 * Johann Ernst von Thun 1687–1709 * Franz Anton von Harrach 1709–1727 * Leopold Anton von Firmian 1727–1744 * Jakob Ernst von Liechtenstein-Castelcorno 1744–1747 * Adnreas Jakob von Dietrichstein 1747–1753 * Sigismund III von Schrattenbach 1753–1771 * Hieronymus von Colloredo 1772–1812 (last prince-archbishop, lost temporal power in 1803 after secularization) ===Duchy of Salzburg 1803–1805=== The secularized Duchy of Salzburg was created in 1803, but annexed by Austria in 1805. The Duke of Salzburg was transferred to the Grand Duchy of Würzburg: * Ferdinand 1803–1805 === Modern Archbishops of Salzburg 1803–present === * Sigmund Christoph, Graf von Zeil und Trauchburg 1812–1814 * Augustin Johann Joseph Gruber 1823–1835 * Friedrich Johann Joseph Cölestin, Fürst zu Schwarzenberg 1835–1849 * Maximilian Joseph von Tarnóczy 1850–1876 * Franz de Paula Albert Eder 1876–1890 * Johann Evangelist Haller 1890–1900 * Johannes Baptist Katschthaler 1900–1914 * Balthasar Kaltner 1914–1918 * Ignaz Rieder 1918–1934 * Sigismund Waitz 1934–1941 * Andreas Rohracher 1943–1969 * Eduard Macheiner 1969–1972 * Karl Berg 1972–1988 * Georg Eder 1988–2002 * Alois Kothgasser 2002–present ==Suffragan Dioceses== * Feldkirch * Graz–Seckau * Gurk * Innsbruck ==Other websites== * Salzburg on the Catholic Encyclopædia * Legate on the Catholic Encyclopædia Category:Salzburg Category:States of the Holy Roman Empire Category:1270s establishments in Europe Category:1803 disestablishments Category:1800s disestablishments in Europe",
 "title": "Archbishopric of Salzburg"
}