{
 "id": "96294",
 "text": "Standing stones or menhirs French, from Middle Breton : men, stone + hir, long. are stones set into the ground vertically. They were put there by Neolithic people in the British Isles and Brittany, and they also occur elsewhere in the world. There may be single standing stones, circles, lines or groups of them. Their dates are mostly from 4000 BC to 1,500 BC. Since Neolithic peoples did not have writing, we do not know much about what they were used for. It is generally thought they had both practical and ceremonial or religious uses. Pottery that has been found near some of these stones suggest some of them in Europe belonged to the so-called 'Beaker culture'. Their shape is generally uneven and squared, usually becoming thinner near the top. Menhirs can be found across Europe, Africa and Asia, but they are mostly found in Western Europe; espically in the British Isles (Great Britain and Ireland), and Brittany. There are about 50,000 megaliths in these areas.Oliphant, Margaret 1992. The atlas of the ancient world, 81. Standing stones are usually hard to date, but pottery found underneath some in western Europe connects them with the Beaker people. They were made as part of a megalithic culture which was powerful in Europe and beyond. Where they appear in groups, often in a round, oval, henge or horseshoe formation, they are sometimes called megalithic monuments. These are sites of very old religious ceremonies, sometimes having burial chambers.Chris Roberts 2006. Heavy words lightly thrown: the reason behind rhyme. Thorndike Press. Patton, Mark. 1993. Statements in stone: monuments and society in neolithic Brittany. New York: Routledge. The developments of radiocarbon dating and tree-ring calibration have helped us learn more of their timing. In some archaeological sites, the remains of wooden henges can be found. Woodhenge was a henge and timber circle monument in the Stonehenge World Heritage Site in Wiltshire, England. It is 2 miles (3.2 km) north-east of Stonehenge. ==History== Not really anything is known of the social group or religious thoughts of the people who made the menhirs. There is not even any trace of their language. We do know that they buried their dead, and had the skills to grow cereal, farm and make pottery, stone tools and jewelry. Some recent research into the megaliths in Brittany suggests a much older origin, maybe back to six to seven thousand years ago.Aviva, Elyn; White, Gary. 1998. Mysterious megaliths: the standing stones of Carnac, Brittany, France. World and I, 13. This is not generally accepted at this time. == Related pages == *Stonehenge *Avebury *Carnac stones == Further reading == *Malone, Caroline. 2005. Neolithic Britain and Ireland. Tempus, Stroud, Gloucestershire. == References == Category:Prehistoric buildings and structures Category:Archaeological sites Category:Neolithic Category:Buildings and structures in Europe",
 "title": "Standing stone"
}