{
 "id": "963109",
 "text": "Wilhelmus Antonius \"Willy\" van de Kerkhof ; born 16 September 1951) is a Dutch former professional footballer. He played as a midfielder. He played for FC Twente from 1970 to 1973 and then for PSV Eindhoven until 1988. With the Eindhoven club he was Dutch national champion six times.He won the UEFA Cup in 1977–78 and the European Cup in 1987–88. Van de Kerkhof and his twin brother René van de Kerkhof were squad members of the Netherlands national team that made the World Cup final in 1974. They became key players in the team that made the 1978 final. He also played for the Netherlands at the Euro 1980. Overall, van de Kerkhof appeared 63 times for his country, scoring five goals. Van de Kerkhof was a fast, much running midfielder. In addition to constructive and attacking, also did co-defensive work. He was nicknamed 'The Vacuum Cleaner' as a football player because of his achievements as a ball conqueror and defensive work, where he went after every ball. He was considered as one of the best Dutch midfielders ever in his position. He was named by Pelé as one of the top 125 greatest living footballers in March 2004. ==Club career== Van de Kerkhof and his twin brother played as amateurs for RKSV MULO. They both made their professional debuts with FC Twente in 1970. Three years later they also went to PSV together . Their brother Gerard was also a professional football player. Father Renier van de Kerkhof (1910–1956), was an amateur footballer for Deurania, which was merged into SV Deurne in 1942. Van de Kerkhof played seventeen seasons with PSV, in ten from 1973 to 1983 together with René. The last two were with the PSV amateurs (1988–1990). He is also a member of merit of PSV. When PSV won the UEFA Cup in 1977–78, he scored the opening goal in the 3–0 final against Bastia. ==International career== Van de Kerkhof made his debut for the Dutch national team on 5 June 1974 in Rotterdam, during a match against Romania in preparation for that year's World Cup in West Germany. Like his twin brother René, he was also selected for the final tournament. He did not play during that World Cup. At the 1978 FIFA World Cup, together with Ruud Krol, he was the only player in the selection who did not miss a minute of the seven matches during the tournament. He played a total of sixty-three games for the Orange squad, in which he - just like his brother - scored five times. Van de Kerkhof also played at the 1976 European Championship and the European Championship 1980. He scored at the 1976 European Championship, in the qualification for the 1978 World Cup, at the 1978 World Cup, during the qualification for the European Championship 1980 and at the European Championship 1980. In 1978, the Van de Kerkhof brothers were the only twins ever to play both in the final of a football World Cup. == Career statistics == === Club === Appearances and goals by club, season and competition Club Season League League League KNVB Cup KNVB Cup Europe Europe Total Total Club Season Division Apps Goals Apps Goals Apps Goals Apps Goals Twente 1970–71 Eredivisie 27 6 7 1 34 7 1971–72 32 6 – 32 6 1972–73 34 2 10 1 34 2 Total 93 14 17 2 110 16 PSV Eindhoven 1973–74 Eredivisie 31 10 – 31 10 1974–75 32 7 7 2 39 9 1975–76 33 6 8 2 41 8 1976–77 31 1 4 0 35 1 1977–78 32 5 12 1 44 6 1978–79 30 3 4 0 34 3 1979–80 30 2 4 1 34 3 1980–81 27 4 4 0 31 4 1981–82 29 8 4 1 33 9 1982–83 26 2 2 1 28 3 1983–84 23 3 4 0 27 3 1984–85 33 2 4 0 37 2 1985–86 29 0 4 0 31 0 1986–87 19 3 2 0 21 3 1987–88 12 1 4 0 16 1 Total 418 57 67 8 486 65 Career total 511 71 84 10 597 81 ==Honours== PSV Eindhoven *Eredivisie: 1974–75, 1975–76, 1977–78, 1985–86, 1986–87, 1987–88 *KNVB Cup: 1973–74, 1975–76, 1987–88 *European Cup: 1987–88 *UEFA Cup: 1977–78 Netherlands *FIFA World Cup runner-up: 1974, 1978 *UEFA European Championship third place: 1976 Individual *FIFA 100: 2004 *FIFA World Cup All-Star Team: 1978 *Ballon d'Or nominee: 1978 == References == Category:1951 births Category:Living people Category:Dutch footballers Category:1974 FIFA World Cup players Category:1978 FIFA World Cup players Category:People from Helmond Category:Association football midfielders",
 "title": "Willy van de Kerkhof"
}