{
 "id": "963413",
 "text": "Climax Blues Band is a British blues rock band. The band was formed in Stafford, England, in 1967 by vocalist and harmonica player Colin Cooper (1939–2008), guitarist and vocalist Pete Haycock (1951–2013), guitarist Derek Holt (b. 1949), bassist and keyboardist Richard Jones (b. 1949), drummer George Newsome (b. 1947), and keyboardist Arthur Wood (1929–2005). ==History== The band was originally known as The Climax Chicago Blues Band. In 1972 the group shortened its name to Climax Blues Band. The band has released at least 19 albums. They had a Top 10 hit in the UK with \"Couldn't Get It Right\". That song and \"I Love You\" were also hits in the United States. \"Couldn't Get It Right\" reached number 3 on the Billboard Hot 100 in 1977, and \"I Love You\" peaked at number 12 in 1981. Jones left the group in 1969 and Holt began playing bass. The band switched labels to Harvest Records in 1970. Later records had a more rock-oriented feel. John Cuffley replaced Newsome in 1971. Albums issued in the 1970s include FM/Live (1973), a double set recorded at a concert in New York, and the studio albums Stamp Album (1975) and Gold Plated (1976), featuring the single \"Couldn't Get It Right\". In the 1970s, the band's concerts in the US were attended by up to 20,000 people. By 1981 the band was moving towards a pop-rock sound. Holt and Cuffley left in 1983. A previously unknown recording of a live performance was released as Climax Blues Band/World Tour 1976 by the Major League Productions (MLP) record label. The album Sample and Hold was recorded for Virgin Records in 1983 by Haycock, Cooper, and Glover, with a rhythm section composed of the session musicians Dave Marquee and Henry Spinetti. A follow-up album was in the works. Cooper bowed out and cited personal reasons. Haycock went on to record several solo projects. The first one was the album Total Climax, with his band, Pete Haycock's Climax. The band toured many times in Europe, including Communist East Germany, and led a well-received tour in Australia. After that, Haycock was asked by his former Climax Blues Band manager Miles Copeland to record an instrumental album, Guitar and Son, and the live album Night of the Guitars (from the tour of the same name) for the I.R.S. No Speak label. After that tour, Haycock teamed up with the guitarist Steve Hunter and former Climax Blues bandmate Derek Holt to record the album H Factor. He was later recruited by Bev Bevan to become a member of Electric Light Orchestra Part II. He recorded and toured with the group as early as 1990. He also started his film score career at this time, playing the lead on Hans Zimmer's score to Thelma and Louise. He also performed on the Night of the Guitars tours, which included Holt on bass, keyboards, and occasional vocals. Holt wrote \"I Love You\", one of the Climax Blues Band's biggest hits. It is included on the Climax Blues Band double album, 25 Years 1968–1993, released by the German label Repertoire in 1993. \"I Love You\" still gets over 20,000 radio hits a year in the US. The song was used in Finn Taylor's 2002 movie Cherish and in Kevin Smith's 2008 movie Zach and Miri make a Porno. In 1983 Holt joined drummer Brendan Day and Nektar guitarist Roye Albrighton to record an album under the name Grand Alliance for the A&M; label. In 1985, Cooper and Glover recruited guitarist Lester Hunt, drummer Roy Adams, and original member Derek Holt to record the Climax Blues Band album Drastic Steps. The line-up toured in support of the album in the UK, Europe, and America. The new line-up soon became established with Cooper, Glover, Hunt, Adams and Neil Simpson in the early 1990s. They released the live album Blues from the Attic in 1993 and Big Blues in 2004. Colin Cooper (born 7 October 1939) died of cancer on 3 July 2008, at age 68. He had two children. He wanted the band to continue, as the other musicians had all been long-serving (Glover since 1980, Adams and Hunt since 1985, and Simpson since 1991). Cooper was replaced by singer and saxophone and harmonica player Johnny Pugh, who retired in 2012. He was replaced in turn by vocalist Graham Dee and saxophone player Chris Aldridge. Pete Haycock died on 30 October 2013, at age 62. The band still continues to tour without any remaining original members. ==Lineups== 1968–1969 1969–1970 1970–1973 1973–1975 *Colin Cooper – vocals, saxophone, harmonica, guitar *Pete Haycock – guitar, vocals, bass *Derek Holt – guitar, bass, keyboards *Richard Jones – bass, keyboards *George Newsome – drums *Arthur Wood – keyboards *Colin Cooper – vocals, saxophone, harmonica, guitar *Pete Haycock – guitar, vocals, bass *Derek Holt – bass, guitar, keyboards *George Newsome – drums *Arthur Wood – keyboards *Anton Farmer – keyboards *Colin Cooper – vocals, saxophone, harmonica, guitar *Pete Haycock – guitar, vocals, bass *Derek Holt – bass, guitar, keyboards *George Newsome – drums *Arthur Wood – keyboards *Peter Filleul – keyboards *Colin Cooper – vocals, saxophone, harmonica, guitar *Pete Haycock – guitar, vocals, bass *Derek Holt – bass, guitar, keyboards, vocals *Peter Filleul – keyboards *John Cuffley – drums 1975–1977 1977–1978 1978–1979 1979–1980 *Colin Cooper – vocals, saxophone, harmonica, guitar *Pete Haycock – guitar, vocals, bass *Derek Holt – bass, guitar, keyboards, vocals *John Cuffley – drums *Richard Jones – keyboards, guitar, bass *Colin Cooper – vocals, saxophone, harmonica, guitar *Pete Haycock – guitar, vocals, bass *Derek Holt – bass, guitar, keyboards, vocals *John Cuffley – drums *Peter Filleul – keyboards *Colin Cooper – vocals, saxophone, harmonica, guitar *Pete Haycock – guitar, vocals, bass *Derek Holt – bass, guitar, keyboards, vocals *John Cuffley – drums *Peter Filleul – keyboards *Nicky Hopkins – keyboards *Colin Cooper – vocals, saxophone, harmonica, guitar *Pete Haycock – guitar, vocals, bass *Derek Holt – bass, guitar, keyboards, vocals *John Cuffley – drums *Peter Filleul – keyboards 1980–1983 1983 1983–1985 1985 *Colin Cooper – vocals, saxophone, harmonica, guitar *Pete Haycock – guitar, vocals, bass *Derek Holt – bass, guitar, keyboards, vocals *John Cuffley – drums *George Glover – keyboards, backing vocals *Colin Cooper – vocals, saxophone, harmonica, guitar *Pete Haycock – guitar, vocals, bass *George Glover – keyboards, backing vocals *Dave Marquee – bass *Henry Spinetti – drums *Colin Cooper – vocals, saxophone, harmonica, guitar *Pete Haycock – guitar, vocals, bass *George Glover – keyboards, backing vocals *John \"Rhino\" Edwards – bass *Jeff Rich – drums *Colin Cooper – vocals, saxophone, harmonica, guitar *George Glover – keyboards, backing vocals *Roy Adams – drums *Lester Hunt – guitar, backing vocals *Roger Inniss – bass 1985–1991 1991–2008 2008–2012 2012–present *Colin Cooper – vocals, saxophone, harmonica, guitar *George Glover – keyboards, backing vocals *Roy Adams – drums *Lester Hunt – guitar, backing vocals *Derek Holt – bass *Colin Cooper – vocals, saxophone, harmonica, guitar *George Glover – keyboards, backing vocals *Roy Adams – drums *Lester Hunt – guitar, backing vocals *Neil Simpson – bass *George Glover – keyboards, backing vocals *Roy Adams – drums *Lester Hunt – guitar, backing vocals *Neil Simpson – bass *Johnny Pugh – vocals, saxophone, harmonica *George Glover – keyboards, backing vocals *Roy Adams – drums *Lester Hunt – guitar, backing vocals *Neil Simpson – bass *Graham Dee – vocals *Chris Aldridge - saxophone ==References== ==Other sources== * ==Other websites== *Climax Blues Band official website Category:1967 establishments in England Category:Musical groups established in 1967 Category:British rock bands Category:English rock bands Category:People from Staffordshire",
 "title": "Climax Blues Band"
}