{
 "id": "963520",
 "text": "The Bee Branch Creek is a creek in Dubuque, Iowa, that flows into the Mississippi River. The city has changed it multiple times over the years to make floods smaller. The newest change involves making the river more like a normal one. This comes after it being in a sewer. == Etymology == No one knows how the Bee Branch got its name. Some think it could have been a name for one of its tributaries. It got the current name by 1863 though the name lived before then. Earlier, the Bee Branch had the name Couler Creek, after the Couler Valley. Couler Creek was used even after 1863, being used in some geology books. == History == In the 1800s, the creek had many floods. On flood along the creek were thought to be especially bad by news stations like the Quad-City Times. An early plan to fix flooding that the Bee Branch did was to move its flow north into the Little Maquoketa River. The Bee Branch Restoration Project is not the first try at making floods smaller. It was planned to put the old creek underground through a storm sewer in the early 1900s. The sewer was finished by 1905. The Dubuque Enterprise, an old newspaper company, thought it was good. The years 1999, 2002, 2004, 2008, 2010, and 2011 saw very damaging floods totaling in costs to $70 million. The first storm prompted the city to research an engineering project on the 100-year floods. It was found that the sewers were not big enough for large storms. Detention basins, ponds that collect water, were added in the area. Also, the sewer became a river to hold more water. == Life in the creek == The creek is will likely have a healthy ecosystem. In the Lower Bee Branch, 14 native species of fish and the common carp has been found in it. Many of these fish are fish that are hunted like the bluegill, largemouth bass, northern pike, and others. The Iowa Department of Natural Resources thought the creek had good levels of life. This was also interesting because of how new it is. ==References== Category:Geography of Iowa",
 "title": "Bee Branch Creek (Iowa)"
}