{
 "id": "963566",
 "text": "Gautam Vig (born 27 September 1987) is an Indian model and actor. He has worked in multiple television shows like Naamkaran, Pinjara Khubsurati Ka, Tantra, and Ishq Subhan Allah. Gautam Vig is best known for Saath Nibhaana Saathiya 2 and participating in the television reality show Colors TV's Bigg Boss 16. == Personal life == Gautam was born in a Punjabi Khatri family to Vijay Vig and Anju Vig in New Delhi, India. He also has a sister named Ankita Vig Suri. He studied at Guru Harkrishan Public School in New Delhi and has a master's degree in Human Resources from George Brown College, Toronto, Canada. After completing his studies, he started working as a Human Resource Manager at a bank in Canada. == Professional life == He did an acting course at Anupam Kher's acting institute, Actor Prepares in 2011. He began his career as a model and featured in several TV commercials for brands like Gionee mobile with Alia Bhatt, Ossum Perfume with Sasha Shetty and Golden Pearl whitening urgent facial. Gautam made his acting debut in Star Plus's TV show Naamkarann (2016) in a supporting role and later went on to star in TV shows like Tantra (2018), Ishq Subhan Allah (2018-19), MTV Nishedh (2020) and Pinjara Khubsurti Ka (2020-21). The actor starred in Saath Nibhaana Saathiya 2 (2021) as a male lead. He made his film debut with Flat 211( 2017). ==Filmography== ===Movies=== Year Title Role Notes Ref. 2017 Flat 211 Sameer Debut Film === Television === Year Title Role Notes Ref. 2016 Naamkarann Ali Debut 2018 Ishq Subhan Allah Miraj Ahmed 2018–2019 Tantra Akshat 2020 Pinjara Khubsurati Ka Piyush 2020 Saath Nibhaana Saathiya 2 Surya Seth 2021 Agni Vayu Vayu 2022 Junooniyat Jordan === Reality show === Year Title Role Notes Ref. 2022 Bigg Boss 16 Contestant === Web series === Year Title Role Notes Ref. 2020 MTV Nishedh Raghav Debut 2021 Hai Taubba == References == == Other websites == * * * Dooriya Song Cast Gautam Vig on IMDb Category:1987 births Category:Living people Category:Actors from Delhi",
 "title": "Gautam Vig"
}