{
 "id": "963506",
 "text": "Willem \"Wim\" van Hanegem (; born 20 February 1944) is a Dutch former football player and coach who played as a midfielder. Over 20 years he won several domestic honours in the Netherlands, as well as a European Cup and a UEFA trophy, all with Feyenoord. He was also a finalist in the 1974 FIFA World Cup. As a manager, he won the league and cup with Feyenoord. He was the Dutch national team's assistant coach. His last job as manager was for FC Utrecht, from 2007 to 2008. Complete midfielder, he played as a playmaker in front of the defense. He has arched legs, always slightly bent and moved with his chin on his chest. Van Hanegem was nicknamed \"de Kromme\", translated as \"the hunchback\". He had a strong character and was rocky and fearless in tackling. He stood for tactical clarity. He made perfect throws with the outside of the left foot. He was also called \"Crooked\", \"the backhand\". He scored goals often on free-kick giving the ball extremely high speed. He is widely considered as one of the best Dutch football players in history. ==Early life== He grew up in Utrecht with his mother Anna and three brothers. He lost his father, three brothers and other relatives in the summer of 1944. ==Club career== After promotion to the Eerste divisie in 1962, he belonged to the squad of semi- professionals of the league team. They were overshadowed by the \"big\" Utrecht clubs DOS and Elinkwijk. He played with Velox in the second division for four years before moving to Rotterdam in 1966 for the newly promoted Eredivisie Xerxes DZB, who finished tenth in their first season. In 1968 he went to local rivals Feijenoord. He celebrated his greatest successes with this club. He was Dutch champion in 1969, 1971 and 1974. In 1970, with Feyenoord. It was the first Dutch club to win the European Cup, before arch-rivals Ajax Amsterdam. In the Milan final, his side beat Celtic Glasgow 2-1. In 1974 he won the championship with Feyenoord, and the UEFA Cup in the final against Tottenham Hotspur. Van Hanegem was known as a tactically skilled midfielder with fine passing. In 1976 he moved to Dutch league rivals AZ Alkmaar for three years. He wanted to end his career in the USA with Chicago Sting in 1979. However, he returned to the Netherlands playing for FC Utrecht until 1981 and again for Feyenoord until 1983. ==International career== Van Hanegem made his national team debut against Scotland on 30 May 1968. At the World Cup in 1974 in Germany and in qualifying for the tournament van Hanegem was a regular player. In the Dutch 4-3-3 system, he usually played in left midfield next to Neeskens and behind Rensenbrink. Van Hanegem was known for rough, passionate play against German sides (before the 1974 final, he exhorted the Dutch side to \"stuff the Germans\"). \"I don't like Germans. Everytime I played against German players, I had a problem because of the war.\" After the game (with Germany winning 2–1) Van Hanegem left the field in tears. Two years later he finished third at the 1976 UEFA European Football Championship in Yugoslavia where he was sent off in the semi-final against Czechoslovakia. He was not selected for the Dutch during the 1978 FIFA World Cup in Argentina along with Hugo Hovenkamp, Johan Cruyff and Willy van de Kuijlen. He played his last international match against Belgium in 1979. ==Coaching career== After ending his playing career, he first became an assistant coach in 1983 at Feyenoord. He was later head coach at AZ Alkmaar, Sparta Rotterdam and at Feyenoord from 1992 to 1995. The team won the league once (1993) and the cup twice (1994 and 1995). He was sacked in October 1995 and then transferred to Saudi Arabia, where he took over Al-Hilal for one season. He worked for the Dutch Football Association as coach of the amateur national team in 1991–92. He was assistant coach to Dick Advocaat in the Netherlands national team from 2002 to 2004. From July 2007 to December 2008 he was the manager of the Dutch first division club FC Utrecht. ==Honours== ===Player=== Feyenoord * Eredivisie: 1968–69, 1970–71, 1973–74 * KNVB Cup: 1968–69 * European Cup: 1969–70 * Intercontinental Cup: 1970 * UEFA Cup: 1973–74 AZ'67 * KNVB Cup: 1977–78 Netherlands * FIFA World Cup: runner-up 1974 * European Football Championship: third place 1976 Individual * Dutch Footballer of the Year: 1971 === Manager === Feyenoord * Eredivisie: 1992–93 * KNVB Cup: 1993–94, 1994–95 == References == == Other websites == * Statistics * Category:1944 births Category:Living people Category:Dutch footballers Category:Association football midfielders Category:1974 FIFA World Cup players Category:UEFA Euro 1976 Category:Dutch football managers Category:Eredivisie managers Category:AZ Alkmaar managers Category:Sportspeople from Zeeland Category:Al Hilal SFC managers",
 "title": "Willem van Hanegem"
}