{
 "id": "963694",
 "text": "Reinier Johannes Maria \"Nico\" Rijnders (30 July 1947 – 16 March 1976) was a Dutch footballer. He played for NAC Breda and Ajax Amsterdam. He was part of their European Cup victory in 1971. He earned 8 caps for the Netherlands national football team.Nico Rijnders – 30 juli 1947. voetbalstats.nl He collapsed on 12 November 1972 while playing for Club Brugge against RFC Liège. He was clinically dead when he was carried off the pitch. He was successfully reanimated by the club doctor but the incident ended Rijnders' playing career. His health never fully recovered. He died three years later at age 28. He was widely regarded to be one of the best defensive midfielders ever. He was renowned as a playmaker who knew how to make assists, pace, dribbling, man- marking and tackling. ==Early life== Rijnders was born on July 30, 1947 in Breda. Rijnders registered with VV Baronie in 1958. As a youth player he made the switch to fellow town NAC in 1963. ==Club career== He made his debut on May 16, 1965. In a cup match against Enschedese Boys. He made the winning goal 2-1 in the last minute. After a year in the First Division, promotion was won in 1966. Rijnders lost the cup final with NAC in 1967. Because winner Ajax was also national champion, the team qualified for European football. With Rijnders in the field, NAC played against Floriana FC and Cardiff City. It was a difficult season for NAC in which relegation was narrowly avoided. After the season, Rijnders moved to sub-topper Go Ahead Eagles for a transfer fee of 150,000 guilders. Rijnders developed further with the Deventer team. Rijnders went from Go Ahead to Ajax for 400,000 guilders in 1969. In his first season, the he became national champion and cup winner with Ajax. The following year, the Amsterdam team again won the cup. They also won the European Cup. Panathinaikos was defeated at Wembley. In this match, Rijnders suffered from tightness in his chest. He was replaced at half time by Horst Blankenburg. Rijnders played 63 league matches for Ajax in two seasons, in which he scored four times. Rijnders left for FC Brugge in the summer of 1971. They offered him a better contract than Ajax wanted to give him. Later it was suggested that the Ajax board led by Jaap van Praag was aware of his heart problems and therefore made little effort to keep him. Rijnders did well in Bruges and had a permanent base place. The team played in the UEFA Cup. They finished second in the league, behind Anderlecht in the 1971–72 season. On 12 November 1972, Rijnders collapsed after ten minutes on the field during a home game against Club Liège. Rijnders was clinically dead. He was resuscitated by the club doctor Michel D'Hooghe. He spent weeks in hospital. Later, he retired from professional football. He then became an assistant coach at Club Brugge. ==International career== In October 1968 he was first included in the selection of the Netherlands national team by national coach Georg Keẞler. He had previously played for the Dutch military team of coach Jan Zwartkruis. On April 16, 1969, he made his debut for the Orange squad, in a friendly against Czechoslovakia. Rijnders was in the Netherlands national team in 1969 and 1970 and appeared in eight international matches. After November 1970 he disappeared from the base under the new national coach František Fadrhonc. ==Coaching career== In 1974 Rijnders became coach of the fourth division team Racing Harelbek. After new heart problems on Christmas Eve 1974, he was disqualified from all sports activities, including coaching. In July 1975, Ajax and Club Brugge organized a benefit match for Rijnders. Bruges was reinforced for the occasion with Johan Neeskens and Johan Cruijff played along with Ajax. The match ended in 3-0 for Bruges. Rijnders also opened a sports shop in Bruges. The business soon went bankrupt. Rijnders' wife left him and is said to have had a drinking problem. ==Death== On March 3, 1976, he became unwell while celebrating carnival in Deventer. After a few days in a Deventer hospital he came to. Rijnders died on March 16, 1976, alone in Bruges, in his home above his old sports shop, from a heart condition. He was 28 years old. A cardiologist who treated Rijnders reported in 2009 on the basis of the medical file that the footballer suffered from congenital heart rhythm disorders. In 1976 these could not be determined and could not be remedied. In 2020, the municipality of Amsterdam named a bridge in Park de Meer after him. ==Honours== ;Ajax *Eredivisie: 1969–70 *KNVB Cup: 1969–70, 1970–71 *European Cup: 1970–71 ;Club Brugge *Belgian First Division: 1972–73 ==References== Category:1947 births Category:1976 deaths Category:Footballers from Breda Category:Association football midfielders",
 "title": "Nico Rijnders"
}