{
 "id": "963756",
 "text": "Chandra Shekhar Sitaram Tiwari () (23 July 1906 – 27 February 1931), popularly known as Chandra Shekhar Azad) was an Indian revolutionary activist and freedom fighter. He re-organised the Hindustan Republican Association (HRA) [en] under its new name of Hindustan Socialist Republican Association (HSRA) after the execution of its founder, Ram Prasad Bismil, and three other prominent party leaders. He hailed from Badarka at Unnao in Uttar Pradesh. His parents were Sitaram Tiwari and Jagrani Devi. He often used the pseudonym \"Balraj\" when signing pamphlets issued as the commander in chief of the HSRA. He was involved in the Kakori Train Robbery of 1925, the shooting of John P. Saunders at Lahore in 1928 to avenge the death of Lala Lajpat Rai, and last, in the attempt to blow up the Viceroy of India's train in 1929. Azad got to read the Communist Manifesto from his comrade Shiv Verma. Despite being a member of Congress, Motilal Nehru regularly gave money in support of Azad. He has also worked with famous freedom fighter Bhagat Singh and helped him during violence in assembly. On 27 February 1931, the CID head of the police at Allahabad, Sir J. R. H. Nott-Bower and Allahabad Police reached at Alfred Park to arrest Azad. The police arrived at the park and surrounded it from all four sides. Some constables along with DSP Thakur Vishweshwar Singh entered the park armed with rifles. Somehow, the shootout began. Azad's companion Sukhdev Raj escaped. But Azad hid behind a tree to save himself and began to fire from behind it. The police fired back. After a long shootout, he shot himself in the head with his gun's last bullet for holding true to his pledge to always remain Azad (Free) and never be captured alive. == References == == Further reading == * Brahmdutt, Chandramani. Kranti Ki Laptain. * Krishnamurthy, Babu. Ajeya (\"Unconquered\"). Biography of Azad == Other websites == Category:1906 births Category:1931 deaths Category:Indian activists Category:Indian independence movement",
 "title": "Chandrashekar Azad"
}