{
 "id": "963730",
 "text": "Pardon Clarence Williams (July 12, 1842 – January 18, 1925) was an American lawyer and judge. == Early life and career == Pardon Williams was born on July 12, 1842 in Ellisburg, New York. His father was William Williams Jr. and his mother was Jerusha Plummer. Williams went to school in Pierrepont Manor. Later, he went to the Union Academy in Fort Plain and the Clinton Liberal Institute in Clinton. He studied at St. Lawrence University for two years. He started to teach in 1856 when he was 14 years old and he tought for six years until 1862. Williams worked on his families farm in the summers when he was a teacher. In spring 1862, he moved to Watertown and started to study law in the law firm Hammond & Bigelow. Williams was admitted to the bar in October 1863. Then, he became a member of the law firm Hammond & Williams after Bigelow became an editor of the Watertown Daily Times. General Bradley Winslow joined the law firm later, and it was renamed to Hammond, Winslow & Williams. In 1867, he started to practice law without a law partner. In 1868, he was elected district attorney of Jefferson County, and he served two terms until 1875. In March 1874, he became partners with Judge John C. McCartin and Williams. == Later life == In 1883, Williams was elected as a justice of the New York Supreme Court in the 5th Judicial District, and he started on June 1, 1884. His term ended in 1898. In 1895, Governor Levi P. Morton made Williams an associate justice of the Appellate Division of the New York Supreme Court, First Judicial Department in New York City. He left the Appellate Division when his term ended in 1898. The local people didn't like that he had to leave his district for New York City, so he promised to stay in the Fifth Judicial District. In 1900, he became an associate justice of the Fourth Department of the New York Supreme Court, Appellate Division, which included New York City. Williams retired in 1912. He was the judge for many murder trials, like for Roxana Druse. Williams had a reputation for being fair, and Governor Roswell P. Flower chose him as the judge for the trial of Bartholomew Shea and John McGough for the murder of Robert Ross. Williams was an important member of the Republican Party in Jefferson County. He was a director of the Agricultural Insurance Company in Watertown. He was a member of the Jefferson County Bar Association, the New York State Bar Association, and the American Bar Association. He attended the Trinity Episcopal Church. == Personal life and death == He married Sarah E. Hewitt on September 9, 1868. Their children were Edith, Robert Plummer, and Marguitte. His son Robert was a clerk for Pardon. Williams died at his home on January 18, 1925. He was buried in Brookside Cemetery in Watertown. == References == === Sources === * * * * * * == Other websites == * * Pardon C. Williams, First Department * Pardon C. Williams, Fourth Department Category:1842 births Category:1925 deaths Category:Lawyers from New York (state) Category:Episcopalians Category:American judges Category:Republicans (United States)",
 "title": "Pardon C. Williams"
}