{
 "id": "963988",
 "text": "Kashubia or Cassubia (, , ) is a language area in the historic Eastern Pomerania (Pomerelia) region of northern Poland. == Geography == Located west of Gdańsk and the mouth of the Vistula river, it is inhabited by members of the Kashubian ethnic group. The region is home to the Kashubian Lake District. According to the 1999 basic study Geografia współczesnych Kaszub (Geography of present-day Kashubia) by the Gdańsk scholar Jan Mordawski 43 municipalities (gminas) of the Pomeranian Voivodeship have a Kashubian share of at least one third of the total population: * Cities: Gdynia (Gdiniô) * Bytów County (Bëtowsczi kréz): Town of Bytów (Bëtowò) with Gmina Bytów, Gmina Czarna Dąbrówka (Czôrnô Dãbrówka), Gmina Lipnica (Lëpnica), Gmina Parchowo (Parchòwò), Gmina Tuchomie (Tëchòmié) * Chojnice County (Chònicczi kréz): Town of Brusy (Brusë) with Gmina Brusy, Gmina Chojnice (Chojnice), Gmina Konarzyny (Kònarzënë) * Człuchów County (Człëchòwsczi kréz): Gmina Przechlewo (Przechlewò) * Lębork County (Lãbòrsczi kréz): Gmina Cewice (Céwice) * Kartuzy County (Kartësczi kréz): Town of Kartuzy (Kartuzë) with Gmina Kartuzy, Town of Żukowo (Żukòwò) with Gmina Żukowo, Gmina Chmielno (Chmielno), Gmina Przodkowo (Przedkòwò), Gmina Sulęczyno (Sëlëczëno), Gmina Sierakowice (Sërakòjce), Gmina Somonino (Somònino), Gmina Stężyca (Stãżëca) * Kościerzyna County (Kòscérsczi kréz): Town of Kościerzyna (Kòscérzëna) with Gmina Kościerzyna, Gmina Dziemiany (Dzemiónë), Gmina Karsin (Kôrsëno), Gmina Lipusz (Lëpùsz), Gmina Nowa Karczma (Nowô Karczma) * Puck County (Pùcczi kréz): Town of Puck (Pùck) with Gmina Puck, towns of Hel (Hél), Jastarnia (Jastarniô) and Władysławowo (Wiôlgô Wies), Gmina Kosakowo (Kòsôkòwò), Gmina Krokowa (Krokòwa) * Wejherowo County (Wejrowsczi kréz): Town of Wejherowo (Wejrowò) and Gmina Wejherowo, towns of Reda (Réda) and Rumia (Rëmiô), Gmina Choczewo (Chòczewò), Gmina Gniewino (Gniewino), Gmina Linia (Lëniô), Gmina Luzino (Lëzëno), Gmina Łęczyce (Łãczëce), Gmina Szemud (Szëmôłd) == Culture == === Kashubian emblem and flag === Although there are no official rules for the use of Kashubian symbols, the griffin is considered the emblem and symbol of the Kashubians. The Kashubian griffin is in black on a yellow or gold background. The colors of the Kashubian flag are taken from the emblem - the upper color is black, and the lower one is yellow or gold. A Kashubian flag with a griffin in the center is also used. If there is an emblem on the flag, then the background is yellow. == References == == Other websites == * kaszubia.com * kaszebsko.com * Ducatus Pomeraniae Tabula Generalis in Qua sunt Ducatus Pomeraniae, Stettinensis, Cassubiae,... 1680",
 "title": "Kashubia"
}