{
 "id": "964144",
 "text": "The Shaggy Dog is a 2006 American science fantasy family comedy movie. It is directed by Brian Robbins. It is written by Geoff Rodkey, Jack Amiel, Michael Begler, Cormac Wibberley and Marianne Wibberley. It is a remake of the 1959 live-action movie of the same name by Charles Barton and loosely based on the 1923 novel The Hound of Florence, produced by Felix Salten. The original film had a character named Wilby Daniels transforming into an Old English Sheepdog after putting on a magic ring. Whereas the remake presents a character named Dave Douglas transforming into a Bearded Collie after getting bitten by a sacred dog. It stars Tim Allen, Robert Downey Jr., Kristin Davis, Danny Glover, Spencer Breslin, Jane Curtin, Zena Grey and Philip Baker Hall. The Shaggy Dog released on March 10, 2006 by Walt Disney Pictures. It received negative reviews from critics and it grossed $87 million against its $50 million budget, which become a box office flop. == Cast == *Tim Allen as David \"Dave\" Douglas/The Shaggy Dog *Robert Downey Jr. as Dr. Kozak *Kristin Davis as Rebecca Douglas *Danny Glover as Kenneth \"Ken\" Hollister *Philip Baker Hall as Dr. Lance Strictland *Zena Grey as Carly Douglas *Spencer Breslin as Joshua \"Josh\" Douglas *Bess Wohl as Dr. Gwen Lichtman *Jordyn Colemon as Tracy *Jarrad Paul as Larry *Jane Curtin as Judge Claire Whittaker *Rhea Seehorn as Lori *Shawn Pyfrom as Trey *Cole as Khyi Yang Po/The Shaggy Dog *Martin Sru as Bin Bag *Joel Moore as a dog pound employee *Crystal the Monkey as Monkey *Jane Hajduk as a news reporter *Adam Hicks as a quarterback == Reception == === Box office === The Shaggy Dog grossed $61.1 million in the United States and Canada and $26 million in other territories for a worldwide total of $87.1 million, against its budget of $60 million. In its opening weekend the film made $16.3 million, finishing second at the box office behind Failure to Launch ($24.4 million). === Critical response === On Rotten Tomatoes, the film has an approval rating of 26% which is based on 105 reviews. It is an average rating of 4.4/10. The site's critical consensus reads, \"This Disney retread has neither inspiration nor originality, but may please moviegoers under the age of ten.\" On Metacritic, the film has a score of 43 out of 100 which is based on 25 critics, indicating \"mixed or average reviews\". Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale. Variety Chief Film Critic Justin Chang noted: \"its occasional lump-in-the- throat moments are almost effortlessly achieved, thanks to strong work from [Kristin] Davis and Spencer Breslin in particular.\" == Soundtrack == The soundtrack to The Shaggy Dog was released on March 14, 2006. The entire score is by Alan Menken. # \"Big Dog\" - 3:38 # \"Man's Best Friend\" - 3:06 # \"Atomic Dog\" - 4:43 # \"Every Dog Has Its Day\" - 2:52 # \"Somethin' About You\" - 3:18 # \"Woof! There It Is\" - 3:02 # \"It's A Dog\" - 2:40 # \"Tibet\" - 2:33 # \"First Signs\" - 3:00 # \"Transformation\" - 4:04 # \"Magic Lab\" - 2:19 # \"Breaking Through\" - 2:50 # \"Kozak Gets A Tail\" - 2:34 # \"Meditation\" - 1:06 # \"Escaping the Lab\" - 4:42 # \"To The Rescue\" - 4:54 # \"Family Time\" - 1:20 == Home media == The film was released on DVD on August 1, 2006. == Related pages == * The Shaggy Dog, the original 1959 theatrical film * Nine Lives, a 2016 family comedy film with a similar premise == References == == Other websites == * * * * * Category:2000s English-language movies Category:2006 comedy movies Category:American movie remakes Category:Movies about dysfunctional families Category:Movies about dogs Category:Movies composed by Alan Menken Category:Disney movie remakes Category:American fantasy-comedy movies Category:American family comedy movies Category:2000s fantasy-comedy movies Category:2006 fantasy movies",
 "title": "The Shaggy Dog (2006 movie)"
}