{
 "id": "964125",
 "text": "The Clemuel Ricketts Mansion (also known as the Stone House, the William R. Ricketts House, and Ganoga) is a Georgian-style house. It was made of sandstone. It was built in 1852 or 1855 on the shore of Ganoga Lake in Sullivan County, Pennsylvania in the United States. It was home to several generations of the Ricketts family, which includes R. Bruce Ricketts and William Reynolds Ricketts. It was originally built as a hunting lodge. Also, it was a tavern and post office and it served as part of a hotel for much of the 19th century. The house has seven rooms, four porches, and its original hardware and woodwork. Dormers and some windows were added in the renovation, and electrical wiring and modern plumbing have been added since. According to the NRHP nomination form, the Clemuel Ricketts Mansion \"is a stunning example of Georgian vernacular architecture\". The mansion and lake are on a part of the Allegheny Plateau known as North Mountain. The plateau was formed about 300 to 250 million years ago in the Alleghenian orogeny. Rocks—gray sandstone with conglomerates and some siltstone—of the Mississippian Pocono Formation underlie the house and lake for more than 340 million years old. The lake is in a shallow valley, deep, which is seized by glacial till up to thick at the southeast end, where Kitchen Creek exits. After the house was built, the land was first part of Northumberland County. Later it became part of Lycoming County in 1795. The Susquehanna and Tioga Turnpike was built between 1822 and 1827. It followed the lake's western shore. It was connected the Pennsylvania communities of Berwick in the south and Towanda in the north. The lake was then known as Long Pond, and the Long Pond Tavern, just north of where the house was later built, was a lunch stop for the stagecoach on the turnpike. Sullivan County was formed from Lycoming County in 1847, and two years later Colley Township was formed from Cherry Township. == References == == Bibliography == * * * * * * Note: The map and architectural drawings included are also used as references in this article. * * (Note: OCLC refers to the 1961 First Edition). == Other websites == * William R. Ricketts House, North Mountain Colley, Colley, Sullivan County, PA: 3 photos, 6 measured drawings, and 6 data pages, at Historic American Buildings Survey Category:Houses in the United States Category:National Register of Historic Places Category:Buildings and structures in Pennsylvania",
 "title": "Clemuel Ricketts Mansion"
}