{
 "id": "964249",
 "text": "The 1969 European Cup Final was a football match held at the Santiago Bernabéu, Madrid, on 28 May 1969. Milan of Italy played against Ajax of the Netherlands to be the champions of Europe that season. Ajax made history by becoming the first Dutch side to reach the final. Although they were beaten by their Italian opponents 4–1. As of 2022, Pierino Prati is the most recent player to score a hat-trick in a European Cup or Champions League final. ==Route to the final== Milan had a bye in the second round due to the withdrawal of a number of Eastern European clubs from the competition. In the quarter-finals, eventual finalists Ajax were deadlocked 4–4 on aggregate against Portuguese side Benfica after two legs, forcing a replay. The Dutch champions won 3–0 in the replay. It took extra time to do so. Milan Milan Milan Milan Round Ajax Ajax Ajax Ajax Ajax Opponent Agg. 1st leg 2nd leg Opponent Agg. 1st leg 2nd leg Play-off Malmö FF 5–3 1–2 (A) 4–1 (H) First round Nürnberg 5–1 1–1 (A) 4–0 (H) Bye Second round Fenerbahçe 4–0 2–0 (H) 2–0 (A) Celtic 1–0 0–0 (H) 1–0 (A) Quarter-finals Benfica 4–4 (r) 3–1 (A) 1–3 (H) 3–0 Manchester United 2–1 2–0 (H) 0–1 (A) Semi-finals Spartak Trnava 3–2 3–0 (H) 0–2 (A) ==Match== ===Details=== {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 1 Fabio Cudicini RB 2 Angelo Anquilletti LB 3 Karl-Heinz Schnellinger RH 4 Roberto Rosato CH 5 Saul Malatrasi LH 6 Giovanni Trapattoni OR 7 Kurt Hamrin IR 8 Giovanni Lodetti CF 9 Angelo Sormani IL 10 Gianni Rivera (c) OL 11 Pierino Prati Manager: Manager: Manager: Nereo Rocco Nereo Rocco Nereo Rocco ==Related pages== * 1968–69 European Cup * 1995 UEFA Champions League Final – contested by the same teams * A.C. Milan in European football * AFC Ajax in European football ==References== ==Other websites== * 1968–69 season at UEFA.com * European Cups Archive at the Rec.Sport.Soccer Statistics Foundation * 1968–69 season at European Cup History * European Cup Final European Cup Final European Cup Final Category:Madrid Category:A.C. Milan Category:AFC Ajax Category:Football in Spain Category:UEFA Champions League finals",
 "title": "1969 European Cup final"
}