{
 "id": "964440",
 "text": "The governor of Bagmati is the head of the province executive of Bagmati Province. The governor is appointed by the President of Nepal as recommended by the federal cabinet for a term of five years. They stay at the President's pleasure. The role was first created in 2018. The current governor is Deepak Prasad Devkota. He was appointed and took office on 1 August 2024. The position has been held by four people since it was created. All the executive actions of the provincial government are taken in the governor's name. The governor must act on the advice of the popularly elected council of ministers. That is headed by the chief minister, which thus holds de facto executive authority at the province-level. The Constitution of Nepal also gives the governor power to act upon his or her own discretion to appoint or dismiss a ministry, or recommend president's rule. == Power and functions == *They must appoint the leader of the parliamentary party with a majority in the State Assembly as the Chief Minister. The State Council of Ministers shall be constituted under his or her chairpersonship. *If no party has a clear majority in the State Assembly they must appoint as the Chief Minister a member of the State Assembly who can command majority with the support of two or more parties representing to the State Assembly. ==Qualified of Governors== Article 164 of the Constitution of Nepal states that the governor must be qualified for being a. member of the Federal Parliament. They must be over the age of thirty five years. They must not be disqualified by any law. == List of governors == Name Took office Left office Tenure 1 19 January 2019 3 November 2019 2 5 November 2019 20 August 2021 3 20 August 2021 1 August 2024 4 Deepak Prasad Devkota 1 August 2024 Ongoing ————————— == Related pages == * President of Nepal * Chief Minister of Bagmati Province ==References == Category:Government of Bagmati Province Category:Governors of Provinces of Nepal",
 "title": "Governor of Bagmati Province"
}