{
 "id": "964515",
 "text": "Belgorod Oblast () is an oblast (region) of Russia.https://www.bbc.com/news/articles/c17gqq0djdgo. Retrieved 2024-08-14It is a federal subject of Russia. Its administrative center (capital city) is the city of Belgorod. Its population is . It is headed by a governor. == History == During the 17th century, Belgorod Oblast was home to a line of military forts that were held by the Cossacks. After the Treaty of Brest- Litovsk, the territory was given to the Ukrainian State. Modern-day Belgorod Oblast was created in 1954 from parts of Kursk and Voronezh Oblasts. The 2025 Belgorod Oblast incursion is ongoing (as of 2025's second quarter). It is part of the warfare of the Russian invasion of Ukraine. == Geography == Belgorod Oblast is part of the Central Black Earth economic region and the Central Federal District. It borders the Ukrainian oblasts of Luhansk, Kharkiv, and Sumy in the south and west, Kursk Oblast in the north and northwest, and Voronezh Oblast in the east. The size of the oblast is around . It is in the southwestern and southern slopes of the Central Russian Upland. Belgorod Oblast has a temperate continental climate with mild winters and long summers. === Natural resources === Over 40% of the known iron ore reserves in Russia are in Belgorod Oblast. There are also large amounts of bauxite and apatite. Some other known resources are gold and graphite. == Culture == The Belgorod region had an important role in the evolution of Russian culture. It was inhabited by different tribes besides East Slavs. It was one of the earliest Rus' principalities. Belgorod Oblast had an important role in the Russian wedding tradition of the Rushnyk. Belgorod is also famous for its wood carving. File:Ложкарь Ракитянский 12.JPG|Wood carving of Belgorod File:Женские наряды Белгородчины 01.JPG|Traditional folk costumes of Belgorod File:Акулиновка 25.jpg|Belgorod bread. Belgorod region was one of the Old Russian regions from which the Bread and Salt tradition spread == Demographics == The oblast is 67th place in area compared to the other Russian federal subjects. In population it is ranked 28th. === Largest cities and towns === === Ethnic groups === Russian is the only official language of the oblast. Ethnicity Number % Russian 1,404,653 94.4% Ukrainian 41,914 2.8% Armenian 7,588 0.5% Azeri 4,621 0.3% Turkish 4,665 0.3% Others 25,073 1.7% == Administrative divisions == Belgorod Oblast is divided into twenty-one districts (raions).These are then divided into 335 rural okrugs. There are ten cities/towns in the oblast. There are also twenty urban-type settlements and 1,592 rural-type settlements. == Economy == Belgorod Oblast's large economy is based mainly on its mineral resources and its unique black soils. There are also many important railways and highways that go through the oblast. These connect Moscow to central Russia and Ukraine. == References == == Other websites == * Official website of Belgorod Oblast * Belgorod Oblast sceneries photos Category:Oblasts of Russia",
 "title": "Belgorod Oblast"
}