{
 "id": "964544",
 "text": "Startup India is a scheme of the Government of India. It was announced by Prime Minister, Narendra Modi during his speech on 15 August 2015. ‘Startup India Campaign’ boost startup talent in India by providing tax exemptions with the condition. These benefits are available to new startups only. Existing businesses for more than 10 years cannot claim this benefit. According to the startup India plan, all eligible entities under this scheme will get 3 consecutive years tax holiday on profits earned. == Eligibility == # Is a Private Limited, Limited Liability Partnership Firm or Partnership firm. # Have not completed 10 years since incorporation or registration. # Annual turnover is not more than 10 crore for any financial year. # Is not formed by merger, splitting or reconstructing business already in existence. # Entity working towards innovation, research and development and improvement of products and services generating employment in India. ==Registration== # Companies must first incorporate or register the business as Limited Liability Partnership, Partnership or Private Limited Company. # Post incorporation registration visit the startup India website. # Fill up the form with details of the business. # Enter the one-time password which is sent to your e-mail and other details like a startup as the type of user, name and stage of the startup, etc. # After entering these details, the Startup India profile is created. ==Objectives== Ease of Doing Business: The initiative aims to simplify regulatory processes for startups, reducing the bureaucratic hurdles they face when starting and operating businesses. Startup Registration: Startups can register and obtain various benefits under this scheme, including tax exemptions, easier compliance, and access to government procurement opportunities. Funding Support: The government has set up funds to provide financial support and venture capital to startups. This includes the creation of the Fund of Funds for Startups (FFS). Intellectual Property Rights (IPR) Protection: Startup India provides assistance in filing patents and trademarks and offers incentives to encourage the protection of intellectual property. Incubators and Accelerators: The program supports the establishment of incubators and accelerators to nurture and mentor startups, providing them with access to necessary resources and guidance. Tax Benefits: Eligible startups can avail of income tax benefits, such as a three-year tax holiday, to encourage entrepreneurship. Networking and Collaboration: Startup India promotes networking and collaboration among startups, industry associations, and educational institutions to facilitate knowledge exchange and partnerships. Innovation Hub: The initiative encourages research and innovation through the establishment of innovation hubs and research parks. Category:Economy of India",
 "title": "Startup India"
}