{
 "id": "964600",
 "text": "The Syrian opposition (Arabic: اَلمَقُاْوْمُةْ اَلَسُوْرِيْةْ) was an umbrella term for multiple anti-government forces present in Syria during the Syrian civil war. These include different militias who's collective goal is the removal of the Syrian president Bashar al-Assad and the ruling Ba'ath Party. Opposition groups in Syria took a new path in 2011 following the outbreak of the Syrian civil war. The conflict between the opposition forces and the government has resulted in numerous clashes where many human rights violations have taken place on both sides. == Background == Syrian opposition groups started forming during the rule of Hafez al-Assad and the Ba’ath party. The Ba’ath party, which advocates for a unified Arab state based on pan-Arabism and Arab nationalism, experienced internal divisions over issues such as the economy, foreign policy, and national unity, leading to the formation of military and civilian wings based on personal loyalty. The military wing emerged as the dominant force in Syria and played a significant role in Hafez al-Assad's rise to power. In February of 1982, Syrian government forces carried out a violent operation in the town of Hama, resulting in the deaths of an estimated 30,000 Syrians over a 27-day period. This event, along with other reported human rights violations, spurred the emergence of opposition groups. On July 7th, 2000 Bashar al-Assad inherited rule over Syria following the death of his father, Hafez al-Assad. The regime led by Bashar al-Assad and the Ba’ath party made promises of economic and political reforms, which have not yet been fully implemented. However, the lack of political freedoms and authoritarian way of ruling present during Hafez al-Assad’s rule continued with Bashar al-Assad. In 2011, anti-government uprisings and protests inspired by the Arab Spring movements in Egypt and Tunisia took place in the city of Daraa, and later spread throughout the entire country. Shortly after, in 2012, a civil war was declared in Syria. As government militias continuously cracked down on protests with violence, and many detainees testified experiencing torture by government forces while detained, the formation of opposition groups has expanded due to the increase of anti-regime attitudes. More recently, Russian support has escalated the war. In 2015, Russia began providing weapons, ammunition, private military contractors, and war advisors to support the Syrian regime. Russia additionally commanded a series of areal strikes in Syria, specifically targeting Free Syrian Army- affiliated groups that receive US support. == Formation == After the start of the Syrian Uprisings and Civil War in 2011, the Free Syrian Army was established by a group of defected Syrian army officers with the goal of overthrowing the regime. Colonel Riad al- Assad came to be the figurehead of the group and called on officers and army personnel to defect and join the so-called ‘freedom fighters’. There exist a number of opposition groups, also called rebel groups, many unified under the National Coalition of Syrian Revolutionary and Opposition Forces and the Syrian National Council. The most wide-spread opposition militia is the Free Syrian Army (FSA). Many smaller opposition groups, such as Syrian Democratic Forces (SDF) and the Syrian National Army (SNA) identify as members of the FSA, even though they aren’t officially a part of it, as the FSA has become a synonym for the armed/military wing of the Syrian people’s opposition to the regime. The term ‘Syrian opposition’, however, includes other non FSA affiliated groups, namely ISIL and Hay’at Tahrir al-Sham (HTS) and certain Turkish and Kurdish-backed militias. Most opposition groups are funded by the US, Turkey, Saudi Arabia and Qatar. == Clashes and regional control == Although no single entity has full control, several Syrian opposition groups have a certain level of presence across seven governorates in Syria. The Idlib Governorate stands out as the location where the Opposition has most influence and control. It was taken over in 2011 by multiple opposition militias, starting with the FSA who targeted the Syrian Army, and in 2017 came under control of HTS. It is also the region where most clashes between Assad’s regime forces and rebel groups take place. Other locations that the rebel groups have or have had partial control over, as well as faced clashes with the Syrian Army, include the Northern Hama Province, Western and Eastern part of Daraa Governorate and the Aleppo Governorate. Additionally, in 2016, Syrian Opposition forces and Syrian government forces had nearly equal control over the Aleppo Governorate. == Human rights violations == There have been numerous human rights and international law violations committed by the Syrian Opposition. According to the United Nations Human Rights Council, both government and anti-government forces use similar tactics and practices in order to reach their goal. Although differing in ideology, the opposition was reported to have committed 1996 detention-related human rights violations, consisting of torture, sexual violence, inhumane or degrading treatment and enforced disappearance, compared to the 3210 of those committed by the regime. Some of these violations are mainly concerned with specific ethnic and/or religious groups, namely the SNA attacking people of Yazidi and Kurdish origin. 87% of the identified victims tortured and killed by the SNA military police and other related militias were of minority ethnic, religious or sectarian background. Most of the violations committed by the groups Hay’at Tahrir al-Sham and ISIL are linked to their interpretations of the Sharia law as well as fundamentalist religious ideologies the groups adhere to. == Notable persons == * Zaher Baadarani == References == Category:Politics of Syria",
 "title": "Syrian opposition"
}