{
 "id": "964723",
 "text": "Self-care is the process of taking care of your own health on a physical and psychological level. Selbstfürsorge – Mehr als nur ein heißes Bad Resilienz- Akademie These include diet, sleep, personal hygiene, social interactions, exercise and recreation. Regular self-care is important for healthy people in terms of health promotion. It only becomes essential (necessary) in the case of physical and psychological complaints and illnesses in terms of prevention and maintaining quality of life. Barbara Riegel et al.: A Middle-Range Theory of Self-Care of Chronic Illness. In: Advances in Nursing Science. Juli/September 2012 – Volume 35 – Band 3 – S. 194-204. doi:10.1097/ANS.0b013e318261b1ba == Origin and history == Although the name suggests its origin in modern times, the origins can be traced back to Socrates in ancient Greece. You've been getting self-care all wrong. It's a political act and always has been. mashable.com Before the 20th century , self-care was still closely tied to wealth . It was not until that time that the middle class was able to afford it. The history of “Self-Care” the good the bad and the ugly Life of Wellness With the release of \"Caring for Yourself.\" 1986 by Michel Foucault, the topic is taken up again in another way. The aim (goal) is to get to know yourself there, to identify mistakes and harmful behavior in order to eliminate or change them. Self-Care Is a Sign of Freedom, Says Michel Foucault Exploring Your Mind == Influencing factors == === Supporting Factors === There are many factors that support self-care, including: *Motivation through human contact and empathy *Tailored Interventions *Supportive social environment *Easier communication with social environment and medical professionals competency-based approaches to building self-care skills routine === Hindering Factors === The hindering factors are factors that stabilize a lack of self-care or make improvement more difficult: *Attachment to Unhealthy Habits. This can be about the social environment. *Lack of motivation to change *Difficulty maintaining healthy habits over the long term *Mental health challenges == Related pages == *executive functions *activities of daily living *resilience == References == Category:Healthcare",
 "title": "Self-care"
}