{
 "id": "964779",
 "text": "Menno Meyer also written as Menno Meijer (16 February 1930 – 30 September 2022) was a Dutch jewelry designer and metal artist. He became internationally known and was repeatedly awarded for his works. One of his first awards was the \"Gold Medal\" of the Bavarian government in München in 1963. Meyer was trained as silversmith at the Vakschool Schoonhoven and pursued a design education at the Fachhochschule Pforzheim in Germany. Meyer was the seventh generation of jewelry designers in a family hailing from Rotterdam. After completing his studies in Germany, Meyer took over the family business, and, in collaboration with his wife and co-designer Helma Winter, started experimenting with new designs and materials such as brass, bronze, enamel, plexiglass, stainless steel, and titanium. Meyer quickly became part of a group of leading designers gaining fame for their modern and expressive jewelry. He was successful thanks to his commercial insight and business entrepreneurship. His works were shown regularly both in The Netherlands and abroad. In the early Seventies, Meyer opened his own showroom adjacent to his workshop in Gouda. A gifted sailor and part of the preselection for the Dutch sailing team for the 1968 Summer Olympics in Mexico, Meyer also made modern jewelry and trophies for water sports. Many trophies created by Meyer are still in use, such as for the Sneekweek and the Menno Meyer Corinthian European Trophy of the Melges 24 sailing class. Meyer was much requested as judge for the International Sailing Federation (ISAF) and attended many international sailing competitions around the World. In this capacity he introduced innovative, artistically designed \"protest sets\" to make the work of protest committees easier. Since 1973, Meyer had his gallery at a historic location in Gouda, the so-called \"Tapijthuis,\" arguably the oldest building in Gouda. For 49 years, Meyer exhibited his work there, as well as that of other artists with whom Meyer had an artistic bond. The “Art Marathons” organized by Meyer in his gallery were a leading and well-attended annual highlight in the Gouda event calendar. Inspired by the climate crisis, Meyer from 2019 onwards began creating objects and paintings from reused materials such as stainless steel. Images of his creations can be found in the jewelry book of the Rijksmuseum: \"Sieraden van het Rijksmuseum\". Meyer also created works for the public space. One of his largest works can be found at Museumhaven Gouda. One of his last major works is located in Gouda at the Ronssehof.Menno Meyer (92) overleden: Gouda verliest een begenadigd kunstenaar Meyer passed away in Bodegraven on 30 September 2022, aged 92. ==References== Category:1930 births Category:2022 deaths Category:Dutch designers Category:Dutch sculptors Category:Artists from Rotterdam",
 "title": "Menno Meyer"
}