{
 "id": "964976",
 "text": "Surgut (; Khanty: Сәрханӆ, Sarkhanl) is the largest city in Khanty-Mansi Autonomous Okrug, Russia. It is on the Ob River near its junction with the Irtysh River. Population: 396,443 (2021 Census); == History == The city was founded in 1594 by order of Tsar Feodor I. For many centuries it was a fortress and center of Russian development in Siberia. It became a major center of oil and gas production in the 1960s. This made the population of the city go up. Surgut is home to the Surgut Bridge. This bridge is the longest one-tower cable-stayed bridge in the world. == Economy == Surgut is the largest port on the Ob River. It is also the largest roadway/railway junction in northwest Siberia. It has two of the world's most powerful power plants, the SDPP-1 (State District Power Plant 1) and SDPP-2 (State District Power Plant 2). These power plants make over 7,200 megawatts and give the region cheap electricity. Surgut is also important in the oil and natural gas industries. === Transportation === The city has the Surgut International Airport, which gives flights to Moscow, St. Petersburg, Dubai, Irkutsk, and many other cities. Surgut also has many trains that go to the east (in Novy Urengoy, Nizhnevartovsk), and to the south-west (in Tyumen, Moscow, Novosibirsk, Ufa, Chelyabinsk, Yekaterinburg). == Climate == Surgut has a continental subarctic climate (Köppen climate classification Dfc). It has long, cold winters and short, warm summers. == Coat of arms == The modern coat of arms of Surgut, featuring \"in the golden field - a black fox with a silver tail end, walking along the azure land\", was approved on November 20, 2003 by the city duma on November 4, 2003. == Twin towns – sister cities == Surgut is twinned with: * Chaoyang, China * Katerini, Greece * Zalaegerszeg, Hungary == Notable people == * Igor Bobkov (born 1991), ice hockey goaltender * Miroslava Duma (born 1985) * Isolda Dychauk (born 1993), actress * Anastasiia Gontar (born 2001), paralympic swimmer * Pavel Ivashko (born 1994), sprinter * Ksenia Klimenko (born 2003), artistic gymnast * Andrei Kolegayev (1887–1937), Left Socialist-Revolutionary, Soviet politician * Aleksandr Kolomeytsev (born 1989), football player * Yelena Terleyeva (born 1985), pop singer == Gallery == == References == == Other websites == * Official website of Surgut * Informational website of Surgut Category:Cities and towns in Khanty-Mansi Autonomous Okrug",
 "title": "Surgut"
}