{
 "id": "96520",
 "text": "Julia Fischer (born 15 June 1983) is a German violinist and pianist.http://www.signandsight.com/features/1636.html ==Biography== Julia Fischer, born in Munich, is of German-Slovakian parentage. Her mother came from the German minority in Slovakia and emigrated from Košice in Slovakia to the Federal Republic of Germany in 1972. Her German father moved in the same year from Eastern Saxony to West Germany. In fall 2004 the label PentaTone released Julia Fischer's first CD: Russian violin concertos with Yakov Kreizberg and the Russian National Orchestra. Julia Fischer began her studies before her fourth birthday, when she received her first violin lesson from Helge Thelen; a few months later she started studying the piano with her mother Viera Fischer. Fischer said, \"my mother's a pianist and I wanted to play the piano as well, but as my elder brother also played the piano, she thought it would be nice to have another instrument in the family. I agreed to try out the violin and stayed with it.\"What's On in London, 20 April 2005 She began her formal violin education at the Leopold Mozart Conservatory in Augsburg. At the age of nine Julia Fischer went to the Munich Academy of Music. Among the most prestigious competitions that Julia Fischer has won are the International Yehudi Menuhin Violin Competition under Lord Yehudi Menuhin's supervision, where she won both the first prize and the special prize for best Bach solo work performance in 1995 and the Eighth Eurovision Competition for Young Instrumentalists in 1996, which was broadcast in 22 countries from Lisbon. In 1997 Julia Fischer was awarded the “Prix d‘Espoir” by the Foundation of European Industry. She recently had the opportunity to play Mozart's own violin in the room in which he was born at Salzburg to honour his 250th birthday. Her repertoire (from Bach to Penderecki, from Vivaldi to Shostakovich), contains over 40 works with orchestra and about 60 works of chamber music. ==Instrument== At the moment she plays on a Guadagnini (See link below) made in 1750 which she bought in summer 2004.WQXR interview on January 4, 2006 For four years since 2000, she had been using a Stradivarius, the 1716 Booth, on loan from Nippon Music Foundation. Before she had the Strad, she played a Guarneri del Gesù and a Gagliano. She uses two bows, one a copy of the Heifetz Tourte by the Viennese maker Thomas Gerbeth, the other a French bow which she uses when she needs to send the Tourte bow away to be rehaired. ==Prizes and honours == Julia Fischer has won five prizes for her violin playing and three prizes for her piano playing a.o. at Jugend musiziert. She won all eight competitions she entered. * 1995: 1st Prize at the international Yehudi Menuhin competition, in addition to a special prize, \"Best Bach Solo-work\". Music journalist Edward Greenfield said, \"I first heard Julia Fischer in 1995 as a 12-year-old in the Yehudi Menuhin Violin Competition. Not only did she win outright in the junior category, she was manifestly more inspired than anyone in the senior category.\"Russian Violin Concertos CD review from Gramophone magazine, January 2005 * 1996: Winner 8th Eurovision Competition for Young Instrumentalists in Lisbon * 1997: Prix d'Espoir the prize of the European music industry * 1997: Soloist prize of the festival \"Mecklenburg-Western Pomerania\" * 1998: EIG Music Award * 2000: Promotion prize Deutschlandfunks * 2005: ECHO Klassik Award for the CD Russian Violin Concertos * 2005: Winner of the Beethoven ring * 2006: During the celebrations of Mozart's birthday in his hometown Salzburg, Fischer played on Mozart's violin (with Daniel Müller-Schott and Jonathan Gilad). About the event she says: \"During the first hour I couldn't play anything I wanted, because during the days of Mozart the violins were a lot shorter and I wasn't used to that\". * 2006: \"BBC Music Magazine Awards 2006 Best Newcomer\" for the CD Johann Sebastian Bach, Sonatas and Partitas for solo violin (BWV 1001–1006). The jury said, “There are many recordings of Bach's works for solo violin but rarely do they reach such breathtaking heights of musicianship as this one. Julia Fischer is an incredible technician and soulful musician who does not let an ounce of ego come between the music and the listener.” * 2007: The Classic FM Gramophone Awards Artist of the Year. * 2007: ECHO Klassik Award for the CD Tchaikovsky Violin Concerto ==Recordings== After releasing ten CDs for PentaTone her eleventh CD was released by Decca.Violinkonzerte Bwv 1043/1041/1042/1060, Amazon.deBach: Violin Concertos / Julia Fischer, Academy of St. Martin in the Fields, et al. CD, Cd UniversePresto Classical Biography, Presto Classical ==Influences== She considers Maxim Vengerov, Evgeny Kissin, and Glenn Gould to be among her greatest influences. Release Composer/Title of Work Performer Label/Catalog No. Format August 2002 Johannes Brahms *Piano Quartets Nos. 1 & 3 *Tatjana Masurenko (viola) *Gustav Rivinius (cello) *Lars Vogt (piano) EMI Classics 5573772 CD October 2002 Antonio Vivaldi *The Four Seasons Academy of St. Martin in the Fields Opus Arte/BBC DVD October 2004 Russian Violin Concertos *Khachaturian Violin Concerto in D minor, op. 46 *Prokofiev Violin Concerto No. 1 (Prokofiev)|No. 1 in D major, Op. 19 *Glazunov Violin Concerto in A minor, Op. 82 *Russian National Orchestra *Yakov Kreizberg (conductor) PentaTone PTC 5186 059 Hybrid-SACD May 2005 Johann Sebastian Bach *Sonatas and Partitas for Solo Violin, BWV 1001–1006 PentaTone PTC 5186 072 Hybrid-SACD September 2005 Wolfgang Amadeus Mozart *Violin Concertos 3 & 4 *Adagio in E major, K. 261 *Rondo in B flat, K. 269 *Netherlands Chamber Orchestra *Yakov Kreizberg (conductor) PentaTone PTC 5186 064 Hybrid SACD June 2006 Felix Mendelssohn *Piano Trios Nos. 1 & 2 *Jonathan Gilad (piano) *Daniel Müller-Schott (cello) PentaTone PTC 5186 085 Hybrid SACD September 2006 Wolfgang Amadeus Mozart *Violin Concertos Nos 1, 2 & 5 *Netherlands Chamber Orchestra *Yakov Kreizberg (conductor) PentaTone PTC 5186 094 Hybrid SACD November 2006 Peter Ilyich Tchaikovsky *Violin Concerto in D major, Op. 35 *Sérénade mélancolique, Op. 26 *Valse – Scherzo, Op. 34 *Souvenir d’un lieu cher, Op. 42 *Russian National Orchestra *Yakov Kreizberg (conductor) PentaTone PTC 5186 095 Hybrid SACD March 2007 Johannes Brahms *Violin Concerto in D major, Op. 77 *Double Concerto in A minor, Op. 102 *Netherlands Philharmonic Orchestra *Yakov Kreizberg (conductor) *Daniel Müller-Schott (cello) PentaTone PTC 5186 066 Hybrid SACD October 2007 Wolfgang Amadeus Mozart *Sinfonia concertante for Violin, Viola and Orchestra in E flat, K. 364 *Rondo in C major, K. 373 *Concertone for 2 Violins and Orchestra in C major, K. 190 *Netherlands Chamber Orchestra *Yakov Kreizberg (conductor) *Gordan Nikolic (violin) (K. 190)/(viola) (K. 364) PentaTone PTC 5186 098 Hybrid SACD January 2009 Johann Sebastian Bach *Concert for two Violinists and Orchestra in D-Moll, BWV 1043 *Violin Concerto in A minor, BWV 1041 *Violin Concerto in E major, BWV 1042 *Concert for Violin and Oboe in C-Moll, BWV 1060 *Academy of St. Martin in the Fields *Alexander Sitkovetsky (Violin) *Andrey Rubtsov (Oboe) Decca DEC B001249002 CD ==Family== Mother: Viera Fischer, maiden name Krenková, born in Nové Zámky Slovakia, pianist Father: Frank- Michael Fischer, a university-educated mathematician ==References== ==Other websites== *Julia Fischer's fanclub *Julia Fischer's homepage *Julia Fischer's General Management *PentaTone's homepage *Audio interview from May 2006 from the website of the Baltimore Symphony Orchestra Musicians site *article featured in Strings magazine, May 2006, No. 139 * Audio interview and Bach performance at WQXR in January 2006 Category:1983 births Category:Living people Category:Classical pianists Category:Musicians from Munich Category:German violinists Category:German pianists Category:Classical violinists",
 "title": "Julia Fischer"
}