{
 "id": "965222",
 "text": "Britainy Colman Beshear (born July 11, 1979) is an American social worker serving as the first lady of Kentucky since 2019 as the wife of Governor Andy Beshear. She advocates to help children, combat human trafficking, and support victims of domestic violence. == Biography == === Life and career === Beshear was born Britainy Colman in Rancho Palos Verdes, California, to Allan and Robin Colman. She is a social worker and was a volunteer at her children's school and Family Scholar House. In 2016, Beshear and her husband founded the Hope Gallery art exhibit that features works by youth assisted by Family Scholar House. From 2013 to 2019, she served on the board of directors of Maryhurst, an organization that provides social services. Beshear married Andy Beshear on April 13, 2006. They have a son and a daughter. She is a deacon at Beargrass Christian, a Disciples of Christ church in St. Matthews, Kentucky. == First lady of Kentucky == Beshear became first lady of Kentucky in December 2019, after her husband became governor of Kentucky. As first lady, she started the Coverings for Kids campaign advocating for face masks during the COVID-19 pandemic. In January 2021, Beshear issued a statement against political divisiveness and called for unity in the state. That year, she started a toy drive which collected over 20,000 toys for families impacted by the 2021 Western Kentucky tornado. She did a drive in 2022 for children impacted by the July–August 2022 United States floods. In support of victims of domestic violence, Beshear works with the Shop and Share program started by former first lady Jane Beshear. Beshear is a member of the National Coalition for the Prevention of Human Sex Trafficking. Before the 2023 Kentucky Derby, she spoke to raise awareness of human trafficking. On April 21, 2023, Beshear traveled to Fort Knox April 21 for Purple Up Day to honor the month of the military child. == References == Category:1979 births Category:Living people Category:Philanthropists from California Category:People from Kentucky Category:American political activists",
 "title": "Britainy Beshear"
}