{
 "id": "966205",
 "text": "Jkvr. C. van Doorn (born c. 1880s — died 20th-century) was a Dutch fencer. As a fencer at Salle De Vos in The Hague she was a pioneer, being one of the earliest Dutch female fencers. Her fencing career was from 1911 to 1919. She became the first international Dutch female fencer in 1911 at the 1911 England–Holland women's fencing competitions together with the four other Dutch competitors. ==Biography== Van Doorn was born in the late 19th-century in c. 1880s. She held the noble title of jonkvrouw. ===Fencing=== Van Doorn was a fencer at Salle De Vos in The Hague of professor J. De Vos. She was one of the earliest female fencers in the Netherlands. Together with four other females of Salle De Vos (H. Luden, Beelaerts van Blokland, E. van den Berg and H. van den Berg) she went to London, United Kingdom for the 1911 England–Holland women's fencing competitions. In Londen they competed against female fencers of the Bertrands Fencing Academy. This was the first international fencing competition for Dutch women. Van Doorn was the best Dutch fencer. She won four of her five matches and won from among the 1908-1909 British champion Millicent Hall. However, the Dutch team lost from the British team. A week later, after coming back in the Netherlands, she had a match against Beelaerts van Blokland during a main fencing event in The Hague. At the end of 1913 she went with four other Dutch women to the international 1913 Alfred Hutton Memorial Challenge Cup in London. Van Doorn was eliminated in the first round. She was in her pool beaten by British fencers Alice Walker and Jean Colmer. As part of the celebration of the new hall of Giovanni Giandomenici, a fencing academy in Amsterdam, she participated in an assaut in February 1914. During the 1914 club championships of salle De Vos she fenced remarkably beautiful matches. In March 1917 she won the third prize in a national competition in The Hague, behind Beelaerts van Blokland and Esther Bekkers-Lopes Cardozo. In April 1918 she competes at the national competition in Amsterdam. Probably her last main competition was in April 1919. This was a competition between three main Dutch women fencing clubs (De Vos, Van Humbeek, Giandomenici). ====Fencing style==== In 1914 it was pointed out that Van Doorn had like the other fencers of Salle De Vos another fencing style compared to Esther Bekkers-Lopes Cardozo of Salle Giandomenici from Amsterdam. Her \"graceful pullings\" were described as opposite to the style of Bekkers-Lopes Cardozodescribed that was described as “more lively, more fiery and less different from the men's technique”. ==References== Category:Year of birth missing Category:Year of death missing Category:1880s births Category:Dutch nobility Category:Dutch fencers Category:Sportswomen",
 "title": "C. van Doorn"
}