{
 "id": "966574",
 "text": "The State Anthem of the Ukrainian SSR was the anthem of the Ukrainian Soviet Socialist Republic. ==Lyrics== ===1949–1978 Version=== Ukrainian original Romanization IPA transcription Russian translation English translation I Живи, Украина, прекрасна и сильна, В Советском союзе ты счастья нашла. Меж равными равна, меж вольными вольна, Под солнцем свободы, как цвет расцвела. Слава союзу Советскому, слава! Слава отчизне народов-братьев! Живи, Украина, советска держава, Возъединенным краем на веки веков! II Нам всегда в битвах за долю народу Был другом и братом – Российский народ, И Ленин осиял нам путь на свободу, И Сталин ведёт нас до светлых высот. III Разобьём все мы ворожьи навалы Народного гнева священным мечом! Под флагом Советским мы крепкими стали И в свет Коммунизму велично идём! I Live, Ukraine, beautiful and strong, You found happiness in the Soviet Union. Equal amid the equal, free amid the free, Under the sun of freedom, you bloomed like a flower. Glory to the Soviet Union, glory! Glory to the Fatherland of brotherly nations! Live, Ukraine, a Soviet nation, A reunited country forever and ever! II Always in the battle for the fate of the people, The Russian people are our brothers and friends. And Lenin illuminated our path to freedom, And Stalin leadeth us to bright heights. III Our foes’ forays we shall expunge With the sacred sword of our people's rage! Under the Soviet flag potent, we’ve become, And loyal we go in the world of Communism! ===1978–1992 Version=== Ukrainian original Romanisation IPA transcription English translation I Live, Ukraine, beautiful and strong, You found happiness in the Soviet Union. Equal amid the equal, free amid the free, Under the sun of freedom, you bloomed like a flower. Glory to the Soviet Union, glory! Glory to the Fatherland forever and ever Live, Ukraine, a Soviet nation, In a united family of brotherly nations! II Always in the battle for the fate of the people, The Russian people are our brothers and friends. Lenin led us on a victorious campaign Under the flag of October to brilliant heights. III We glorify the mighty Fatherland through labor, Affirming the truth of our immortal idea. In the world of Communism there is a great future, The Party of Lenin leads us there wisely! ===Lyrics proposed in 2010=== The following are the lyrics by Igor Ortsev chosen in the competition held by the Luhansk wing of the Communist Party of Ukraine in 2010. Ukrainian original Romanisation English translation I Live Ukraine, beautiful and strong, Happiness has been given to us forever and ever. From the people's will you became united, Under the sun of freedom, you bloomed as a flower. Glory to the great people, glory! Master of destiny in his native land! Live independently, mighty State, Live, Ukraine, we are your children! II We are together forever from the Black Sea, To the gray Carpathians and Donbas steppes. And fills our hearts with love, The majesty of the Holy Dnieper shores. III We glorify our country with labor, For honor and freedom, we will give our lives! And we sacredly believe in our Homeland, We will pass on this faith to our descendants! ==References== ===Notes=== Category:Ukrainian anthems Category:Anthems of Soviet Socialist Republics",
 "title": "Anthem of the Ukrainian Soviet Socialist Republic"
}