{
 "id": "966512",
 "text": "Film Roman, LLC is an American independent animation studio. It is currently based in Woodland Hills, California and formerly in Burbank. == Television series == Show Creator(s) Year(s) Co-production(s) Notes Garfield and Friends Jim Davis 1988–1994 United Media (seasons 1–6) Lee Mendelson Productions (seasons 2–7) Paws, Inc. Now owned by 9 Story Media Group Beavis and Butt-Head Mike Judge 1990-2017 Judgemental Films MTV Paramount Television Studios Seasons 1–27 Zazoo U Shane DeRolf 1990–1991 Fox Children's Productions Currently distributed by Disney–ABC Home Entertainment and Television Distribution Mother Goose and Grimm Mike Peters 1991–1993 Tribune Media Services Grimmy, Inc. Lee Mendelson Productions MGM Television Family Guy Seth MacFarlane 1999–2000 Fuzzy Door Productions 20th Television Seasons 1–2 only The Simpsons Matt Groening 1992–2016 Gracie Films 20th Television Seasons 4–27 only Animated Classic Showcase 1993–1994 Soyuzmultfilm Cro Mark Zaslove Children's Television Workshop Mighty Max Mark Zaslove Rob Hudnut Bluebird Toys Canal+ D.A. Bohbot Entertainment The Critic Al Jean Mike Reiss 1994–1995 Gracie Films Columbia Pictures Television The Baby Huey Show Bob Jaques 1995 Carbunkle Cartoons (season 1) Harveytoons Claster Television Season 2 only Currently distributed by NBCUniversal Television Distribution The Mask: Animated Series Duane Capizzi 1995–1997 Dark Horse Entertainment Sunbow Entertainment New Line Television Currently distributed by Warner Bros. Domestic Television Distribution Klutter! David Silverman Savage Steve Holland 1995–1996 Savage Studios Fox Children's Productions As part of Eek! Stravaganza Currently distributed by Disney–ABC Home Entertainment and Television Distribution The Twisted Tales of Felix the Cat Pat Sullivan Otto Messmer Joseph Oriolo Felix the Cat Productions Currently distributed by NBCUniversal Television Distribution C Bear and Jamal Earl Richey Jones Todd R. Jones 1996–1997 TaurusFilm Mortal Kombat: Defenders of the Realm Sean Catherine Derek 1996 Threshold Entertainment New Line Television USA Studios Currently distributed by Warner Bros. Domestic Television Distribution Richie Rich Timothy Williams Harveytoons Claster Television Currently distributed by NBCUniversal Television Distribution Bruno the Kid Joel Madison 1996–1997 Camelot Entertainment Sales Active Entertainment Bobby's World Howie Mandel 1990-1998 Alevy Productions Fox Children Productions 20th Television Animation produced by (season 7 only) King of the Hill Mike Judge Greg Daniels 1997–2010 Deedle-Dee Productions Judgemental Films 3 Arts Entertainment 20th Television The Mr. Potato Head Show Dan Clark Doug Langdale 1998–1999 Hasbro Mission Hill Bill Oakley Josh Weinstein 1999–2002 Bill Oakley/Josh Weinstein Productions Castle Rock Entertainment Currently distributed by Warner Bros. Domestic Television Distribution The Man Show Adam Carolla Jimmy Kimmel Daniel Kellison Jackhole Industries (seasons 1-5) Stone Stanley Entertainment Comedy Partners Animation Currently distributed by Eagle Rock Entertainment X-Men: Evolution Marty Isenberg Robert N. Skir David Wise 2000–2003 Marvel Studios Currently distributed by Disney–ABC Home Entertainment and Television Distribution The Oblongs Angus Oblong Jace Richdale 2001–2002 Jobsite Productions Mohawk Productions Warner Bros. Television Free For All Brett Merhar 2003 Showtime Networks Charlie's Angels: Animated Adventures Ivan Goff Ben Roberts Sony Pictures Digital Hilltop New Media, Inc. Web series Based on Charlie's Angels: Full Throttle Tripping the Rift Chris Moeller Chuck Austen 2004–2007 Space Teletoon (season 3) CinéGroupe Eloise: The Animated Series Kay Thompson Hilary Knight 2006 HandMade Films Law & Order Dick Wolf Wolf Films NBC Universal Television Studio Visual effects Eon Kid Designstorm 2006–2007 Manga Entertainment BRB Internacional Daiwon Designstorm Screen 21 TVE English dub Slacker Cats Andy Riley Kevin Cecil 2007–2009 Laika ABC Family The Goode Family Mike Judge John Altschuler Dave Krinsky 2009 3 Arts Entertainment Currently distributed by Shout! Factory The Super Hero Squad Show Stan Lee 2009–2011 Ingenious Media (season 1) Marvel Animation Currently distributed by Disney–ABC Home Entertainment and Television Distribution The Avengers: Earth's Mightiest Heroes Ciro Nieli Joshua Fine Christopher Yost 2010–2012 Currently distributed by Disney–ABC Home Entertainment and Television Distribution Dan Vs. Dan Mendel Chris Pearson 2011–2013 The Hatchery Ultimate Spider-Man Marvel Animation 2012–2017 Marvel Animation Currently distributed by Disney–ABC Home Entertainment and Television Distribution Hulk and the Agents of S.M.A.S.H. Paul Dini Henry Gilroy Marvel Animation 2013–2015 Camp WWE Seth Green 2016–2018 Stoopid Buddy Stoodios WWE Studios Heathcliff George Gately TBA Creators Syndicate This Modern World Tom Tomorrow The Untamed == Films/specials == Title Year Co-production(s) Notes Garfield in the Rough 1984 United Media The studio's inaugural production Garfield's Halloween Adventure 1985 Garfield in Paradise 1986 Garfield Goes Hollywood 1987 A Garfield Christmas United Media Paws, Inc. Happy Birthday, Garfield 1988 Paws, Inc. Garfield: His 9 Lives United Media Paws, Inc. Garfield's Babes and Bullets 1989 The Pink Panther MGM Television Unreleased live-action/animated pilot Garfield's Thanksgiving United Media Paws, Inc. Garfield's Feline Fantasies 1990 United Media Lee Mendelson Productions Paws, Inc. Garfield Gets a Life 1991 Tom and Jerry: The Movie 1992 Live Entertainment Turner Entertainment Co. WMG Film Miramax Films Currently distributed by Warner Bros. Pictures Nick & Noel 1993 Bohbot Entertainment A Cool Like That Christmas 1994 The Bears Who Saved Christmas Bohbot Entertainment Izzy's Quest for Olympic Gold 1995 International Olympic Committee The Story of Santa Claus 1996 Arnold Shapiro Productions CBS Productions The Magic Pearl 1997 Greengrass Productions Puss in Boots Super Bowl XXXIII (The Simpsons short) 1999 Gracie Films 20th Television Johnny Tsunami Disney Channel Live-action Hairballs 2000 Unsold TV series pilot created by Mr. Lawrence Motocrossed 2001 Stu Segall Productions Disney Channel Live-action My First Mister Total Film Group ApolloMedia Film Management GmbH Paramount Classics The Santa Claus Brothers Sitting Ducks Productions Disney Channel Nelvana Second Time Around 2002 Mei Ah Entertainment Visual effects Hellraiser: Hellseeker Dimension Home Video Daredevil 2003 20th Century Studios Regency Enterprises Marvel Enterprises Horseshoe Bay Productions The Fallen Ones The Fallen Ones Inc. Sci Fi Channel I, Robot 2004 20th Century Studios Davis Entertainment Laurence Mark Productions Overbrook Films Mediastream IV Demon Hunter 2005 New Arc Entertainment All Souls Day Anchor Bay Entertainment Weebles: Welcome to Weebleville! Playskool Hasbro Weebles: Sharing in the Fun! The Happy Elf HC Productions DKP Studios Voodoo Moon 2006 IDT Entertainment Sci Fi Channel Visual effects Slayer Anchor Bay Entertainment Sci Fi Channel Jackass Number Two Paramount Pictures MTV Films Dickhouse Productions Lynch Siderow Productions Hellboy: Sword of Storms Revolution Studios Mosaic 2007 POW! Entertainment Manga Entertainment Hellboy: Blood and Iron Revolution Studios The Thirst Anchor Bay Entertainment Visual effects The Simpsons Movie 20th Century Studios 20th Century Animation Gracie Films Rough Draft Studios AKOM Pre-production split between Film Roman and Rough Draft Studios Sands of Oblivion Starz Productions Sci Fi Channel Visual effects Rush Hour 3 New Line Cinema Roger Birnbaum Productions Arthur Sarkissian Productions Unlike Film Productions Visual effects Trailer only Illegal Tender Universal Pictures Visual effects Hairspray New Line Cinema Ingenious Media Zadan/Meron Productions Storyline Entertainment Offspring Entertainment Visual effects Trailer only The Great Buck Howard 2008 Magnolia Pictures Playtone Walden Media Bristol Bay Productions Visual effects Turok: Son of Stone Classic Media Speed Racer Warner Bros. Pictures Village Roadshow Pictures Silver Pictures Anarchos Productions Visual effects Sex and the City Warner Bros. Pictures New Line Cinema HBO Films Visual effects Trailer only Tripping The Rift: The Movie CinéGroupe Wubbzy's Big Movie! Bolder Media Dead Space: Downfall Electronic Arts Secrets of the Furious Five DreamWorks Animation Reel FX Creative Studios 2-D sequences Cranberry Christmas Ocean Spray Productions Wow! Wow! Wubbzy!: Wubb Idol 2009 Bolder Media The Haunted World of El Superbeasto Carbunkle Cartoons Planned for theatrical release Dante's Inferno: An Animated Epic 2010 Electronic Arts \"Prologue\", \"The Arrival\", \"Entry to Hell\" only Dead Space: Aftermath 2011 Electronic Arts Visceral Games Max Steel: Turbo-Charged 2017 Mattel Creations Max Steel: Turbo-Warriors == Miscellaneous == * Get in Line (Barenaked Ladies music video) * Frijolero (Molotov music video) * The Simpsons Game (2007, produced by Electronic Arts) (cutscenes only) * The Simpsons Ride (2008, amusement simulator ride film produced for the attraction of the same name at Universal Orlando Resort and Universal Studios Hollywood) * The Simpsons: Tapped Out (2012, freemium mobile game produced for Fox Digital Entertainment and Electronic Arts) (cutscenes only) Commercials * Alpo * Ask Jeeves (2000) (five-minute branding reel) * Burger King (2001–2003) * Butterfinger (1992–1994, 1998–2001, 2007) * CC's (1998) * C.C. Lemon (2000–2002) * Embassy Suites Hotel * Expedia (2003) * Garfield Fruit Snacks * General Foods * Honey Nut Cheerios (1993) (Garfield ad only) * Intel (1998) * Matchbox (2002) (CGI sales presentation animated by Forum Visual Effects) * Microsoft (2003) * Mirinda (2005–2006, 2008) * Partnership for a Drug-Free America (2002) * RC Cola (1999) * SeaWorld (1998) * SHO Too (2002) * Toyota (1992–1993) * Trix (1991) == Related pages == * Phil Roman Entertainment * Starz Animation * Klasky Csupo * Rough Draft Studios * AKOM * Wang Film Productions * Fox Television Animation * Titmouse, Inc. * Saerom Animation * Sunwoo Entertainment * Bardel Entertainment * Boulder Media * Mercury Filmworks * Bento Box Entertainment == References == == Other websites == * * Category:1984 establishments in California Category:American animation studios Category:Companies based in Burbank, California",
 "title": "Film Roman"
}