{
 "id": "966674",
 "text": "The Trudlerbaach is a small river which flows through the communes of Contern and Weiler-la-Tour in Luxembourg.Bulletin - Société Des Naturalistes Luxembourgeois, Issue 50, 1956. Google Books. A-Z.luhttps://contern.lu/wp- content/uploads/2021/04/2020-05-27-PAP-QE-Contern-Plan-de-reperage.pdf == History == The Trudlerbaach has existed in its current course for at least 3000 years. The first crossing over the river was built in the Roman era when one of the main routes between Luxembourg and Trier was constructed. It linked the towns of Luxembourg and Dalheim together as at the time Contern wasn’t a settlement. The first settlement on the river was Syren which was constructed around the 16th-17th century. Locals witnesses the fresh waterspring in the settlement. The existence of the stream was the reason for the naming of the nearby rue de la source. At the time the spring was used for drinking water. Over time the area around the steam was converted into farmland creating fields like the Klappwissen and the Sauerfeld. It is possible that the Trudlerbaach once flowed from the Pettengerbesch as other streams are sources there. However the development of land and construction of new roads prevented all the groundwater from converging into one stream. The resulted in the tributaries from the Roulend and northern Shältgen. Water then collected directly underneath one trail which created Lac Beriton. 1996 Faerscthaff was constructed on the banks of the stream, and then expanded in 2001. Then Trudlermillen was constructed in 2010. No major developments have been constructed on the banks of the river and development in Contern could fill in Lac Beriton and cut the river back to Op der Syrener Head and make the inflows from the source to be exclusively storm drains. == Course == === Lac Beriton and Northern inflows === The Trudlerbaach begins in a small pond in the Schältgen forest which is right next to a small weir, next to that weir there is a smaller pond which feeds the larger one. There are other inflows into the pond however. The pond is directly south of a pathway which has a storm drain on either side of it. One one the south side of the road flows directly into the pond. Additionally the primary inflow into the lake is through a culvert underneath the road. 3 small inflows merge before flowing through the culvert. One being the storm drain on the north side of the road which starts in Shaltend. The other 2 inflows are natural watercourses. One runs from the north-eastern Corner of the Shältgen to the pond roughly following the border of the Shaltgen. The other watercourse stems from the previous one directly above the culvert and the other storm drain spur. Other smaller watercourses exist flowing out of the main one in the Shaltgen however all are intermittent and exceptionally small. One such stream provides a small link between a large pond and this river.This one runs through the northern Sauerfeld directly through the fields. Although not watered all the time, it has forged a path over where it runs. The exact place where the watercourse starts is unknown but it starts at a higher altitude compared to the other inflows and therefore is the highest source of the Trudlerbaach. === Lower Shältgen and Gaartchen Run === To the South of Lac Beriton the Trudlerbaach begins narrow flowing through a narrow channel at the border of the Schältgen. It is next to a small unpaved pathway which marks the border between the Sauerfeld and the Schälgen. Eventually it flows towards Beriton and crosses under a pathway used for access to the shooting lodge through a culvert. Further south the Trudlerbaach nears the southern end of the Shältgen and begins to broaden and deepen. The river flows much slower relative to just south of Lac Beriton. Eventually the river narrows once more and becomes very shallow to the point where the water ripples as it flows. By this point the river has left the Shältgen and now forges the border between the Sauerfeld and am Grond. Eventually the path it has been parallel to ends and the river flows directly through one of the fields in the Sauerfeld. At the end of the path, the stream crosses directly under a fence dividing plots of land. The Trudlerbaach soon after begins to split into several small channels separated by large sedge plants and at one point the path of the stream forges and island. Further south the Trudlerbaach crosses through another culvert which links a field in the Southern Sauerfeld and am Grond. === Storm Drain inflows and Faerschthaff bridges === The Trudlerbaach soon after flows south to meet Rue de Prés wherein a storm drain flows into the stream. The drain has seen construction to filter out sewage to prevent polution of the river further downstram and prevent flooding. The Trudlerbaach then flows west through the path named Faerschthaff which was formerly a part of Rue de Prés. The river forges the border between the road and the Bei der Bëtsenheck field. The Trudlerbaach later flows underneath the Fearschthaff road and through the Iwwert der Suelwiss locality and just south of Faerschthaff farm aswell as the Am ale Weier locality. From there the Stream passes directly South of Faerschthaff and enters a small collection of trees from where another small storm drain. === Old Roman Bridge and Poteschtbesch entrance === The Trudlerbaach passes underneath what is now a farming bridge however was once a part of one of the main roads between Luxembourg and Trier during the Roman Times, directly before crossing this bridge, the river sharply changes direction and flows west as opposed to south which was how it flowed through the row of trees before it. The stream then encounters some stepping stones as it traverses the locality of op de Syrener- head. Following this the stream crosses under another farming bridge before encountering the Poteschbesch. Upon reach the edge of the forest, the brook passes through an array of scattered stepping stones. Throughout most of the rivers traversing of the Poteschbesch, it forms the boundary between the forest and fields used for farming although a small handful of trees are almost always on the north bank.. Around the same location where the river enters the forest, the stream crosses the border between the communes of Contern and Weiler-La-Tour. == Tributaries == The Trudlerbaach has several inflows. Most of them are manmade Storm drain and intermittent stream however there is one permanently watered brook which flows into the Trudlerbaach in the North of Syren Tributaries of the Trudlerbaach from direction of Inflow Left Right Mouth In Syren Storm Drain Xandirinne Trudlermillen Storm Drain Intermittent Storm Drain Intermittent Brook (Flows from the Hempspelt) Storm Drain Faerschthaff Gaardebaach (Intermittent brook) Intermittent Storm Drain Intermittent Brook (Flows from the Shaltgen Intermittent Storm Drain Intermittent Brook (Flows from the Roulend) === Intermittent Shältgen inflow === The Intermittent brook which flows from the Shältgen begins at a small intermittent pond near the North-Eastern corner of the Shältgen. This pond is fed through direct precipitation as well as channels which flow from the fields around the Shältgen such as Am Säitert. The stream then flows on the border between the Shältgen and Am Säitert. There are several islands formed by rock along the way. As the stream aproaches An De Steng, it becomes mostly unwatered in an area where the river bed consists of wet sand and clay.Further south, a brook which obtains water from Am Säitert and Roulend flows into this stream, then followed by a storm drain which follows An De Steng. Then the stream flows through a culvert underneath An De Steng into Lac Beriton. === Gaardebaach === The Gaardebaach is a intermittent tribuatary of the Trudlerbaach which runs from the Gaardebesch north west of Contern to Am Grond where it reaches the Trudlerbaach. The stream flows south into the Ostrich farm and then flows though bushes onto the unpaved area of Beim Schmilberbour. The stream recieves water from Further up Beim Schmilberbour as well as 2 others from the ostrich farm. === Xandirinne === The Xandirinne is the only natural, non-intermittent tributary of the Trudlerbaach. It flows from the Southern end of Trudlermillen to where is meets the Trudlerbaach around Moschelton. The Stream begins at a pond/collection of ponds at the Southern end of Trudlermillen, directly below the southernmost house in the area. From there the river starts narrow and meanders towards a dense forrest. In an area underneath a canopy of fallen trees the river becomes wider and deeper, there is a small natural dam which causes this. Directly north of the dam, a small intermittent tributary flows into the Xandirinne from the east. Further South the stream narrows once more before 2 small intermittent brook flow into it. From there, the stream widens and meanders through a cutting and goes through a lot of vegetation. Finally one more brook flows into it. While it is intermittent, there are 3 ponds which help form it which aren’t. Eventually, the river narrows again and flows into the Trudlerbaach. The stream has been undocumented until recently and does not appear on many maps. == References == Category:Rivers of Luxembourg",
 "title": "Trudlerbaach"
}