{
 "id": "966766",
 "text": "The Super Mario Bros. Movie is a 2023 American computer-animated musical adventure comedy movie directed by Aaron Horvath and Michael Jelenic and produced by Chris Meledandri of Universal Pictures, and by Illumination and Nintendo. The movie was released in the United States on April 5, 2023. It received mixed reviews from critics, while reviews from the audience were mostly positive. A sequel was announced on March 2024 and will release on April 3, 2026. == Plot == Italian-American brothers Mario and Luigi have started a plumbing business in Brooklyn, which their ex-employer Spike and their father did not like. After seeing a significant water main leak on the news, Mario and Luigi go underground to fix it but are sucked into a Warp Pipe and separated. Mario lands in the Mushroom Kingdom, ruled by Princess Peach, while Luigi arrives in the Dark Lands, ruled by the evil Koopa king Bowser. Bowser seeks to marry Peach and will destroy the Mushroom Kingdom using a Super Star if she refuses. He imprisons Luigi to threaten Mario, whom he sees as competition for Peach's love. Mario meets Toad, who takes him to Peach. Peach plans to ally with the primate Kongs to help repel Bowser and allows Mario and Toad to travel with her. She also tells Mario that she ended up in the Mushroom Kingdom as a baby, where the Toads took her in and eventually made her their leader. In the Jungle Kingdom, King Cranky Kong agrees to help if Mario defeats his son, Donkey Kong, in a fight. Despite Donkey Kong's immense strength, Mario defeats him using a Cat Suit. Mario, Peach, Toad, and the Kongs use karts to drive back to the Mushroom Kingdom, but Bowser's army ambushes them on Rainbow Road. When a blue-shelled Koopa General destroys part of the road in a kamikaze attack, Mario and Donkey Kong fall to the ocean while the other Kongs are captured. Peach and Toad return to the Mushroom Kingdom and urge the citizens to evacuate. Bowser arrives aboard his flying castle and proposes to Peach, who reluctantly accepts after Bowser's advisor Kamek tortures Toad. Mario and Donkey Kong, having been eaten by an eel-like Maw-Ray, learn they both want the respect of their fathers. They escape the Maw-Ray by riding a rocket from Donkey Kong's kart and hurry to Bowser and Peach's wedding. At the wedding ceremony, Bowser intends to execute all of his prisoners in lava in Peach's honor. Toad smuggles an Ice Flower into Peach's bouquet, which she uses to freeze Bowser. Mario and Donkey Kong arrive and free the prisoners, with Mario using a Tanooki Suit to save Luigi. Bowser frees himself and summons a Bomber Bill to destroy the Mushroom Kingdom, but Mario knocks it off course and directs it into the Warp Pipe, where it explodes, creating a vacuum that causes everyone and Bowser's castle to be transported to Brooklyn. Mario attempts to grab the Star but is violently assaulted by the enraged Bowser, who also swiftly defeats Peach, Toad and Donkey Kong. Mario is encouraged by his advert to stand up and face Bowser, who almost burns him. Luigi saves Mario, with both grabbing the Super Star. They defeat the Koopas, destroy Bowser's castle and defeat Bowser. Peach then shrinks Bowser with a Blue Mushroom and imprisons him. Mario and Luigi are hailed as heroes by the people of Brooklyn, including their parents and Spike. Afterwards, the brothers move to a house in the Mushroom Kingdom and begin a day of plumbing work together. == Voice cast == * Chris Pratt as Mario, a struggling plumber from Brooklyn, New York, who is accidentally transported to the world of the Mushroom Kingdom and embarks on a quest to save his brother. * Anya Taylor-Joy as Princess Peach, the ruler of the Mushroom Kingdom, Mario's mentor and love interest, who entered the world of the Mushroom Kingdom as an infant and was raised by the Toads. * Charlie Day as Luigi, Mario's timid younger fraternal brother and fellow plumber, who is captured by Bowser and his army. * Jack Black as Bowser, a dragon-turtle hybrid and the King of the Koopas, who rules the Dark Lands, steals a powerful Super Star, and plots to conquer the Mushroom Kingdom by marrying Peach. * Keegan-Michael Key as Toad, a Mushroom Kingdom resident whose species is also named Toad, who aspires to go on his first real adventure. * Seth Rogen as Donkey Kong, an anthropomorphic gorilla and heir to the throne of the Jungle Kingdom. * Fred Armisen as Cranky Kong, an elderly anthropomorphic gorilla, the ruler of the Jungle Kingdom, and Donkey Kong's father. * Sebastian Maniscalco as Foreman Spike, Mario and Luigi's antagonistic former boss from the Wrecking Crew. * Kevin Michael Richardson as Kamek, a Koopa sorcerer and Bowser's advisor and informant. * Eric Bauza as Diddy Kong, an anthropomorphic monkey and Donkey Kong's nephew. * Scott Menville as Koopa General, the winged, blue-shelled leader of Bowser's army. * Charles Martinet as Papa, Mario and Luigi's father * Jessica DiCicco as Mama, Mario and Luigi's mother == Marketing == On September 23, 2021, a teaser poster was released following the cast announcement. On October 4, 2022, another teaser poster was released featuring Mario in the Mushroom Kingdom. On October 6, 2022, a teaser trailer was released. The teaser shows Bowser and Kamek fighting penguins, Mario arriving in the Mushroom Kingdom, and Luigi being chased by Dry Bones. Black and Key were praised for their roles as Bowser and Toad while Pratt was heavily criticized for sounding too similar to his regular voice. On November 28, 2022, another teaser poster featuring Peach's Castle was released. The next day, a trailer was released online. The trailer shows Mario losing a fight to Donkey Kong, Peach rallying the Toads for a battle against Bowser, who is seemed to have kidnapped Luigi, Mario training on a Super Mario-themed course, and many characters racing on Rainbow Road. During the 2022 Game Awards, a clip was released. The clip features Toad showing Mario around the Mushroom Kingdom. Pratt's performance in the clip seemed to get better. On January 29, 2023, a new ad was released. The ad features Cat Mario and Rogen's voice for Donkey Kong. On February 3, 2023, an official poster for the film was released featuring the Rainbow Road track from the second trailer, the cast of characters, Peach's Castle, and the Dark Lands. 3 days later, a promo for the film featuring Mario constantly going through the pipes was released on the film's Twitter account. More new posters featuring Mario, Luigi, and Peach were released the following days before an ad for the Super Mario Bros. Plumbing company was released on February 12, followed by more new posters featuring Bowser, Donkey Kong, and Toad. ==References== Category:2023 movies Category:2023 comedy movies Category:2023 adventure movies Category:2023 animated movies Category:2020s computer-animated movies Category:American animated movies Category:American adventure movies Category:American comedy movies Category:Illumination movies Category:Reboot animated movies Category:Universal Pictures movies",
 "title": "The Super Mario Bros. Movie"
}