{
 "id": "966905",
 "text": "Victor Steeman (15 June 2000 – 11 October 2022) was a Dutch motorcycle racer.Motorcoureur Victor Steeman overleden na crash in Portugal He competed in the Supersport 300 World Championship until his death after a crash at the during the 2022 Supersport 300 World Championship. ==Biography== Born in Zevenaar, Steeman made his world debut in 2018 in the Supersport 300, participating in the last two Grans Prix of the 2018 Supersport 300 World Championship as a replacement driver. Riding the KTM RC 390 R he earned his first world championship point, and ended in fifteenth position in the Portimão GP. For the 2019 Supersport 300 World Championship he was hired as a starting driver for the German team Freudenberg, riding a KTM. He had his first pole position in the Jerez GP, which allowed him to start in the lead in both races held during the grand prix. His best position during the season was in Donington with a fourth place. He closed the season with the fifth position overall. In 2020, he competed in the German IDM championship in the 600 class. He won both races in Assen and finished the season in fifth position. In 2021, he returned to the 2021 Supersport 300 World Championship, with Freudenberg riding a KTM. In the Most GP in the Czech Republic, Steeman had his second pole position and won the first race.SSP300, MOST: VICTOR STEEMAN VINCE IN SOLITARIA, SECONDO KONIG, motosprint.corrieredellosport.it, 7 August 2021. He finished the season in overall in tenth place. In 2022 he moved to the Dutch MTM team riding a Kawasaki. In the Assen GP, he had his fourth pole position and his second career victory. He won three more races with the possibility becoming the overall champion. In the last race of the season on 8 October at the Algarve International Circuit of the he had a serious accident in the first race and could't finish and could't start the second race.2022 SBK 2022. GP del Portogallo. Alvaro Diaz campione della Supersport 300. Ancora in gravissime condizioni Victor Steeman, caduto sabato a Portimao, moto.it, 10 October 2022 He finished second en the overall classification. He died three days later on 11 October 2022 in hospital in Faro from injuries of the accident. He was 22 years old.Nederlandse motorcoureur Steeman (22) overleden na crash in Portugal, NOS, 12 October 2022Motorcoureur Victor Steeman overleden na crash: ’Iets waar je altijd bang voor bent’ De Telegraaf, 12 October 2022 Two days after his death, his mother Flora van Limbeek died from a heart attack at the age of 59.Na Victor Steeman ook moeder Flora van Limbeek overleden racesport.nl, 14 October 2022Victor Steeman’s mother Flora van Limbeek has died, two days after her son’s death crash.net, 14 October 2022 ==References== Category:2000 births Category:2022 deaths Category:Dutch motorcycle racers Category:Sportspeople from Gelderland",
 "title": "Victor Steeman"
}