{
 "id": "967012",
 "text": "Competitions in aquatic sports were held at the 1922 Women's Olympiad. The aquatics events were held between 20 and 23 April 1922. During the competitions Sweden secured 4 victories, the Netherlands 3 victories, France won 2 events and United Kingdom won 1 event.Échos & Nouvelles (in French) Journal de Monaco April 25, 1922, page 1, Retrieved January 4, 2017Bernett, Hajo: Die ersten olympischen Wettbewerbe im internationalen Frauensport (in German) Sozial- und Zeitgeschichte des Sports, Heft 2/1988, page 66-86 (ISSN 0931-7031), Retrieved January 4, 2017 ==Venue== The venue of the aquatics events was the so called \"Stade Nautique du Port\" at the Port Hercules, the port of Monaco. The harbour contained the water was of the Mediterranean sea. The swimmers had to deal with the temperature of the sea water of 13 degrees Celcius. A rectangular competition area in the harbor was created by means of the quay and boats, and measured 50x12 metres. The public could watch the matches from the quay as well as from the boats.The Women's Olympic Games Comité Olympique Monégasque, Retrieved January 4, 2017 From the quay, a scaffolding had been built for the diving competitions with the springboard and above it the 5-meter platform. ==Nations== In mid-April it was announced 52 athletes entered for the aquatic events. Athletes from eight European countries participated: Belgium, France, Italy, Netherlands, Sweden and the United Kingdom. Denmark that has been named as a participating nation didn't compete. The participants from all nations gathered in Paris. From there they made together the journey to Monte Carlo. In Monte Carlo the participants were welcomed by Drigny, the secretary of the French Swimming Federation and board members of the International Sporting Club Monaco. Denmark is named as one of the competing nations. However, another source indicates they were not officialy registered a few days before the event, and no results of Danish swimmers have been found. Participating nations * * * * * * * ==Schedule== Thursday (20 April): * 400m freestyle (series) Friday (21 April): * 200 metre breaststroke (series and final) * 100 metre freestye (series and final) * 3m springboard * 4x 50 metre medley relay Saturday (22 April): * 100 metre backstroke (series) * 400 metre freestyle (final) * 100 metre backstroke (final) * 4x 50 metre freestyle relay * water polo * 5 metre springboard ==Swimming== Six international swimming events were held, including two relay events. Next to the international events, one regional swimming event was held with only French participants. The event was the 100 metres freestyle. 100 m freestyle Aina Berg 1:22 Carin Nilsson 1:26 Germaine van Dievoet 100 m backstroke Truus Klapwijk 1:43 Doris Hart 1:43.6 Alice Harlfinger 1:44.4 Doris Hart 3:35 Elisa van den Bogaert Hjördis Töpel 400 m freestyle Carin Nilsson 7:05 Ernestine Lebrun 7:28 D. Roux 4 × 50 m medley relay Alice Harlfinger Alice Stoffel Ernestine Lebrun Mariette Protin 2:56 Truus Klapwijk Loes Brandt Annie Treffers Rie Beisenherz 2:59 De Coniak Elisa van den Bogaert Germaine van Dievoet J. Weiters 4 × 50 m freestyle relay Margit Bratt Hjördis Töpel Carin Nilsson Aina Berg 2:25 Alida Bolten Annie Treffers Truus Klapwijk Rie Beisenherz 2:29 ;Regional swimming event Also a 100 metres freestyle was organized from swimmers from the region. Five swimmers entered for the competition from Nice, Marseille and Toulon. 100 m freestyle Mariette Protin Nice Bienna Pélégry Marseille A. Veglio Nice ==Diving== 3 m springboard Truus Klapwijk Eva Olliwier Henriette Delbort 5 m platform Eva Olliwier Hjördis Töpel Cecily O'Bryen ==Water polo== Water polo Alida Bolten Annie Treffers Truus Klapwijk Rie Beisenherz Jo Evelein H. van Leeuwen Loes Brandt Doris Hart Verrall Newman ? ? ? ? ? ==Medal table== At the time the \"medal table' consisted of the number of vitories per country. The medal table included the regional swimming event. Rank Nation Victories 1 4 2 3 3 2 4 1 ==References== ==Other websites== *Image of the venue *Diving images and Dutch team images *Water polo match image *Dutch water polo team image Category:1922 Women's Olympiad Category:Water sports",
 "title": "Aquatics at the 1922 Women's Olympiad"
}