{
 "id": "967119",
 "text": "Zatanna Zatara is a superheroine. She appears in American comic books published by DC Comics. The character was created by Gardner Fox and Murphy Anderson. She first appeared in Hawkman #4 (November 1964). She has been a member of the Justice League of America, the Sentinels of Magic, the Seven Soldiers, and the Justice League Dark. == Fictional character biography == Zatanna Zatara was the daughter of famed magician Giovanni \"John\" Zatara. Zatanna was a successful stage illusionist herself before she discovered her true magical powers. She was once in a relationship with the powerful mage Nick Necros in New York City. == Powers and abilities == Zatanna can cast a wide variety of spells, including telekinesis, teleportation, healing, and elemental control. Her versatility in magic allows her to adapt to different situations. At times, Zatanna has demonstrated the ability to alter reality, such as changing the fabric of existence or rewriting events. She can create powerful illusions that can deceive even the most perceptive beings. Zatanna has shown the ability to manipulate fire, water, air, and earth. While primarily a magician, Zatanna is also trained in various forms of combat, making her formidable even without her magic. She is intelligent and resourceful, often using her magic in creative ways during battles. Zatanna's spells must be spoken, which can limit her in situations where she cannot speak or is interrupted. While she is powerful, she is not omnipotent and can be outmatched by other high-level beings or entities, especially those with reality-warping powers or cosmic abilities. == In other media == Zatanna has appeared in several different media adaptations, including appearing in several television series in the DC Animated Universe, notably voiced by Julie Brown and Jennifer Hale. She has also appeared as a recurring character in the final three seasons of Smallville, portrayed by actress Serinda Swan. A younger version of the character also appears in Young Justice and Justice League Action, voiced by Lacey Chabert, and in DC Super Hero Girls, voiced by Kari Wahlgren. Category:DC Comics characters Category:Fictional characters introduced in 1964",
 "title": "Zatanna"
}