{
 "id": "96712",
 "text": "Kyffhäuserkreis is a rural district in the northern part of Thuringia, Germany. == History == In the 12th century there was a castle on the Kyffhäuser mountains, which was built during the reign of emperor Frederick I. According to the local legend, the emperor did not die, but instead went to sleep in this castle. From 1579 on the region belonged to Saxony, but after 1815 it was divided between the Prussian Province of Saxony and Schwarzburg- Sondershausen. In 1952 the two districts of Artern and Sondershausen were set up by the East German government. These districts were merged in 1994, with only a few municipalities joining other districts. ==Partnerships== The district has a partnership with the district Ahrweiler in Rhineland- Palatinate, which was actually established with the district Artern in 1990. == Geography == The district is named after the Kyffhäuser mountains. The main river is the Unstrut, which flows through the east of the district. == Coat of arms == The main symbol of the coat of arms is the lion of the counts of Schwarzburg, who historically ruled most of the district. The lion holds a shield which contains the coat of arms of the Counts of Mansfeld, who owned the area around Artern in the 18th century. The three green hills in the bottom symbolize the mountainous landscape with many forest, the big wavy line stands for the river Unstrut, the small one for the Wipper river. ==Towns and municipalities== Verwaltungsgemeinschaft-free towns and municipalities # Artern # Bad Frankenhausen # Ebeleben # Großenehrich # Roßleben # Sondershausen # Wiehe # Abtsbessingen # Bellstedt # Donndorf # Freienbessingen # Helbedündorf # Holzsußra # Rockstedt # Thüringenhausen # Wolferschwenda Verwaltungsgemeinschaften Verwaltungsgemeinschaften Verwaltungsgemeinschaften 1\\. An der Schmücke # Bretleben # Etzleben # Gorsleben # Hauteroda # Heldrungen1, 2 # Hemleben # Oberheldrungen # Oldisleben 2\\. Greußen # Clingen2 # Greußen1, 2 # Niederbösa # Topfstedt # Trebra # Wasserthaleben # Westgreußen 3\\. Kyffhäuser # Badra # Bendeleben1 # Göllingen # Günserode # Hachelbich # Oberbösa # Rottleben # Seega # Steinthaleben 4\\. Mittelzentrum Artern [seat: Artern] # Borxleben # Gehofen # Heygendorf # Ichstedt # Kalbsrieth # Mönchpfiffel-Nikolausrieth # Nausitz # Reinsdorf # Ringleben # Voigtstedt 1seat of the Verwaltungsgemeinschaft;2town 1seat of the Verwaltungsgemeinschaft;2town 1seat of the Verwaltungsgemeinschaft;2town ==References== ==Other websites== * Official website (German) * Touristic website (English, German) Category:Rural Districts of Thuringia",
 "title": "Kyffhäuserkreis"
}