{
 "id": "967368",
 "text": "\"The Diary of the Rose\" is a 1976 dystopian science fiction novelette by Ursula K. Le Guin. It was first published in the Future Power collection. The story happens in a totalitarian society which uses brainwashing by \"electroshocks\" to erase any political dissent. ==Story== The story is the diary of psychodiagnost (\"psychoscopist\") Dr. Rosa Sobel. She worked for state security to enter the mind of Flores Sorde and look for signs of \"political psyschosis.\" Sobel used a brain-mapping device called a psychoscope. Conversations with Sorde caused Dr. Sobel to understand politics in a new and different way. ==Awards and nominations== All events were in 1977. *Jupiter Award in the novelette category * Runner-up in the Locus Award for Best Novelette.Award Years for Locus Poll Award : 1977 *Hugo Award finalistAward Years for Hugo Award: 1977 * Le Guin refused a Nebula Award for \"The Diary of the Rose.\" She protested the Science Fiction Writers of America's canceling Stanisław Lem's membership. Le Guin thought the SFWA disliked Lem's criticism of American science fiction and that he lived in the Eastern Bloc. She did not want to receive an award \"for a story about political intolerance from a group that had just displayed political intolerance\" toward communism. She withdrew the novelette shortly before the announcement of the winners. The SFWA asked her not to do that since she had in fact won, but Le Guin insisted on the withdrawal. The award was instead given to Isaac Asmiov's \"The Bicentennial Man.\" ==Publication history== The first publication was in the Future Power collection in 1976. The same year it was translated into French. In 1977 it was published in the anthologies Psy Fi One: An Anthology of Psychology in Science fiction and Best Science Fiction Stories of the Year: Sixth Annual Collection.\"Best Science Fiction Stories of the Year: Sixth Annual Collection, edited by Gardner Dozois, 1977\", a review at SF Magazines It was part of the author's collection The Compass Rose in 1982.The Compass Rose, Stories by Ursula K. Le Guin, Kirkus Reviews, July 1st, 1982, posted online Sept. 27th, 2011 It was translated into French (Le journal de la rose, 1976), Dutch (Het dagboek van de roos, 1978; De Roos in de Winter,The Dutch title De Roos in de Winter is reminiscent of the last words of the novelette: \"<...>, the winter rose\". 1985), German (Das Tagebuch der Rose, 1979), Italian (Il diario della rosa, 2003),As cited in: and Russian (Дневник Розы, 2008)Урсула Ле Гуин Роза ветров, collection description at fantlab.ru BBC Radio first broadcast an audiobook version of The Diary of the Rose 2009.\"Ursula K Le Guin - The Diary of the Rose\", BBC Radio (retrieved January 28, 2020) ==Notes== ==References== Category:American novels Category:Science fiction books Category:1976 books",
 "title": "The Diary of the Rose"
}