{
 "id": "967478",
 "text": "The 400 m freestyle event at the 1922 Women's Olympiad was held from 20 to 22 April 1922. The venue of the competition was the Port Hercules, the harbour of Monte Carlo, Monaco. There was nice summer weather, but the water of the Mediteranian Sea was not warm. ==Results== ===Heats=== The heats took place on 20 April 1922 September and were the first competitions on the first day of the swimming competitions from 10:00-12:00. The heats of the 400 metres freestyle was the only swimming event held that first day. The fastest swimmer of each heat and the fast nummer two of the heats continued to the final. There would initially be three heats. This was later adjusted to four heats. In the initial third heat, the Italian Togier and British Wehman (might be a typo with Neman) are named, but they were not mentioned in a Dutch results article. They may have withdrawn or didn't swim noteworthy in the heats. The first heat was won by the 17-years old Swedisch champion Carin Nilsson. Her swimming style was described of very fast and beautiful. Her time of 7:11 was stated as a very good time. The second heat was a walk-over by the French champion Ernestine Lebrun of Tourcoing. In the third head, the Dutch Evelien of swimming club H. D. Z. won in an easy way of her French opponent. The fourth heat was a tough battle between the British V. Newman and the Belgian Elisa van den Bogaert. Van den Bogaert swam in breaststroke. She led the race but was caught in the last part of the reace, just before the finish. Newspaper La Natation Belge stated that Carin Nilsson and Ernestine Lebrun swam a new French record with a time of 7:30.2. ====Results==== The winner of each heat and the fastes number two continued to the final. Heat Rank Name Nationality Time Notes 1 1 Carin Nilsson 7:11 Q 1 2 D. Roux 7:44 q 1 M. Veglio 2 1 Ernestine Lebrun 7:27 Q 2 L. Cevasco 2 Suzanne Porte 3 1 Jo Evelein 8:01/8:10.6 /8:19.6 Q 3 2 Marcelle Lebrun 3 E. Togier 4 1 Verrall Newman 7:47 Q 4 2 Elisa van den Bogaert Juliette Gardelle Sources: ===Final=== Rank Name Nationality Time Notes Carin Nilsson 7:05 Ernestine Lebrun 7:28 or 7:23 French record D. Roux 4 Verrall Newman 5 Jo Evelein Sources: ==References== Category:1922 Women's Olympiad Category:Women's swimming",
 "title": "Swimming at the 1922 Women's Olympiad – 400 metre freestyle"
}