{
 "id": "967415",
 "text": "The Royal High School (RHS) of Edinburgh is today a co-educational school. It is owned and run by the City of Edinburgh Council. The school was founded in 1128 and is one of the oldest schools in Scotland. Until modern times it was only a school for boys. It is one of the oldest schools in the world. It dates from the 12th century AD. It was first the seminary of Holyrood Abbey, founded for Alwin and the Augustinian canons by David I in 1128. In 1505 the school was described as a \"high school\", the first recorded use of this term in either Scotland or England.James J. Trotter, The Royal High School, Edinburgh (London: Sir Isaac Pitman & Sons, 1911), p. 186.J B. Barclay, The Tounis Scule: The Royal High School of Edinburgh (Edinburgh: Royal High School Club, 1974), p. 137. The Romantic era at the turn of the 19th century caused an influx of foreign students, among them French princes.Murray, John 1997. A History of the Royal High School. Edinburgh, p52. \"Walter Scott stood head and shoulders above other writers\".Ross, William C.A. 1934. The Royal High School. Edinburgh: Oliver and Boyd, p11. By the end of the Napoleonic Wars, an old scholar remembered, 'there were boys from Russia, Germany, Switzerland, the United States, Barbadoes, St. Vincent, Demerara, the East Indies, besides England and Ireland'.Ross, pp. 58, 74. The Royal High School was used as a model for the first public high school in the United States, the English High School of Boston, in 1821. The Royal High School moved to its current site at Barnton in 1968, leaving the Old Royal High School buildings. In 1973 it became a co-educational state comprehensive. This means it has no entrance qualifications, and accepts pupils of all intellectual standards, and both boys and girls. That is what the word \"comprehensive\" means in this context. The school's premises underwent extensive refurbishment between 2001 and 2003, funded by a £10 million public-private partnership project with Amey plc.Mark Smith, City school's private cash revamp stalls, The Scotsman (13 November 2002).Ian Fraser, \"£360m schools project row goes to high court\", Sunday Herald (Glasgow, 10 July 2005). == References == Category:Schools in Scotland Category:Organisations based in Edinburgh",
 "title": "Royal High School, Edinburgh"
}