{
 "id": "967743",
 "text": "Komsomolsk-on-Amur () is a city in Khabarovsk Krai, Russia. It is on the west bank of the Amur River in the Russian Far East. It is on the Baikal-Amur Mainline, northeast of Khabarovsk. Population: == Geography == The city and its suburbs stretch for over along the left bank of the Amur River. The river at this point is up to wide. Lake Khummi is southeast of the city.Google Earth The distance to Khabarovsk—the administrative center (capital city) of the krai—is ; to the Pacific Ocean—about . The nearest other major town is Amursk, which is about south. It is about east of Moscow. It is at the eastern end of the BAM Railway. == History == The future site of Komsomolsk-on-Amur was conquered by the Mongols in the 13th century. It became part of the Mongol Empire under the Mongol Yuan Dynasty. ===19th century=== It was later held by the Manchus until the area was ceded (given) to the Russian Empire in the treaty of Aigun in 1858. The village of Permskoye () was created on the later site of Komsomolsk in 1860 by migrant peasants from what is now the Perm Krai. ===20th century=== ====1930s==== The government of the Russian SFSR announced plans in 1931 to build a shipyard on the Amur at the modern site of Komsomolsk. Construction began in 1932. The town was mainly built using volunteer labor from the Communist youth organization Komsomol. This is how the town received the name Komsomolsk. However, the construction of the town was helped by the use of penal labour from the prison camps in the area.Aleksander Solzhenitsyn, The Gulag Archipelago: 1918-1956, 592-593 The suffix on Amur was added to differentiate from other towns with the same name. ====1940s==== By the end of the 1940s, the shipyards plus facilities for other heavy industry had been completed. The city turned into a regional center for industries such as aircraft manufacturing, metallurgy, machinery, oil refining, and shipbuilding. Currently, Komsomolsk-on-Amur is the main center for the manufacture of Sukhoi military aircraft and the Sukhoi Superjet airliner. The MiG-15bis and the Lisunov Li-2http://www.oldwings.nl/st/li2.pdf were both built in Komsomolsk-on-Amur. == Climate == Komsomolsk-on-Amur has a humid continental climate (Köppen Dfb). == Twin towns – sister cities == Komsomolsk-on-Amur is twinned with: * Jiamusi, China (1994) * Kamo, Japan (1991) * Weinan, China (2016) == Notable residents == * Alex Chubrevich, Israeli-Russian professional basketball player for Maccabi Haifa of the Israeli Super League. * Yuliya Chepalova, cross-country skier. * Anatoly Dyatlov, deputy chief-engineer of the Chernobyl Nuclear Power Plant * Yury Gazinsky, footballer, scorer of the first goal at the 2018 FIFA World Cup, was born in the city * Alexandra Ivanovskaya, \"Miss Russia 2005\" * Valentina Khetagurova (1914–1992), founder of the Khetagurovite Campaign * Pasha Kovalev, professional dancer * Sergei Plotnikov, ice hockey player with Pittsburgh Penguins, NHL * Ivan Shtyl, sprint canoer == References == == Other websites == * Sports in Komsomolsk-on-Amur * FC Smena (Komsomolsk-on- Amur) Category:Cities and towns in Khabarovsk Krai Category:1860 establishments in Asia",
 "title": "Komsomolsk-on-Amur"
}