{
 "id": "967738",
 "text": "On 12 September 2014, a guesthouse in the Synagogue Church Of All Nations (SCOAN) area collapsed to the ground. The National Emergency Management Agency (NEMA) and other emergency services were criticized for not giving enough information about the accident. == Incident == On 12 September 2014, a guesthouse collapsed in the SCOAN's area in Lagos, killing at least 115 people, 84 of them were South Africans. == Predictions == The senior pastor of the church, T. B. Joshua has claimed to have predicted the Synagogue Church building collapse \"three weeks before it happened\". While another Nigerian religious figure, Isaiah Ogedegbe seemed to have also predicted the incident eight months before it happened. == Casualties == Nigerian emergency services refused to release the nationalities of the victims. However, other countries have given some details about those who died. Most of the casualties were from South Africa. Casualties by nationality Nation Number 84 1 Nationality unknown 30 Total 115 == Reactions == The then governor of Lagos State; Babatunde Fashola, ordered all church workers away from the scene in order to properly rescue trapped bodies. The government also claimed the church did not get government approval before construction. Journalist Nicholas Ibekwe released an audio recording that allegedly captures T. B. Joshua offering bribes to journalists in return for reporting the incident in a way that favourably portrayed the church. == Cause == The senior pastor of the church, T. B. Joshua has linked the tragedy to a strange aircraft \"hovering\" above the building shortly before it fell. A video was released on YouTube that allegedly showed the plane hovering around the building before its collapse. However, the coroner's report discovered the cause to be due to structural failure. Three government agencies - the Nigeria Building And Road Research Institute (NBRRI), the Council for the Regulation of Engineering in Nigeria (COREN) and the Building Collapse Prevention Guild (BCPG) examined the site and found the following errors: *Inadequate beams of 750mm by 225mm (should have been 900mm by 300mm). *Inadequately reinforced columns (should have been reinforced with 12 x Y25 bars or 20 x Y20mm bars. Instead they used 10 x Y20 bars (as seen in the video released by SCOAN). *Inadequate bearing pressure for the central column due to the 2m x 2m x 0.9m foundations. *Failure to introduce rigid zones for bracing the structure and did not design the frames as an unbraced structure. *Failure to introduce movement joints that could have absorbed any movement due to creep, contraction, expansion and differential settlement etc. *8 out of the 12 main beams of the structure failed because they were undersized, under-reinforced (both in tension and shear), the tension bars were poorly anchored to the column supports and 8 x Y20 was used instead of 14 x Y20. *The ground floor columns were slender and readily gave in to buckling. ==Trial== Joshua failed to appear at a November 2015 hearing and SCOAN's lawyers have filed many applications to stop the trial. The Lagos State government has repeatedly insisted that this case receive trial. Local radio host Freeze made unfavorable comparisons to a similar incident in Lekki, in which Lekki Gardens managing director Richard Nyong was jailed for illegally unsealing a building that he was having constructed and that which later collapsed. Freeze was unhappy because Nyong had been arrested quickly, Joshua had not. ==Related pages== *T. B. Joshua *Synagogue, Church of All Nations ==References== Category:2010s in Nigeria Category:2010s disasters in Africa",
 "title": "Synagogue Church building collapse"
}