{
 "id": "968033",
 "text": "The communes of Luxembourg ( ; French: communes; ) are the country's lowest level administrative divisions. There are currently 102 communes of Luxembourg. The communes are often merged and divided. They were adopted in 1795 when Luxembourg was annexed into France. == Communes and cities == There are currently 102 communes in the 12 cantons. The 12 communes with city status are Diekirch, Differdange, Dudelange, Echternach, Esch-sur-Alzette, Ettelbruck, Grevenmacher, Luxembourg, Remich, Rumelange, Vianden, and Wiltz.Carte des communes. luxembourg.public.lu == Creation of communes after independence == * On 1 July 1849 the commune of Rollingergrund was created from the commune of Eich by law on 8 May 1849 * On 1 January 1850 the commune of Strassen was created from the commune of Bertrange by law on 6 August 1849 * On 1 July 1850 the communes of Schieren and Erpeldange were created from the commune of Ettelbruck by law on 22 January 1850 * On 1 January 1851 the commune of Walferdange was created from the commune of Steinsel by law of 25 November 1850 * On 1 July 1853 the commune of Kopstal was created from the parts of the communes of Kehlen and Steinsel by law of 22 February 1853 * On 1 July 1856 the commune of Leudelange was created from the commune of Reckange by law of 3 March 1856 * On 1 January 1874 the commune of Hamm was created from the commune of Sandweiler by law of 20 December 1873 * On 30 December 1874 the commune of Mertzig was created from the commune of Feulen by law of 20 November 1874 * On 15 August 1876 the commune of Schifflange was created from the commune of Esch-sur-Alzette by law of 6 July 1876 * On 25 September 1891 the commune of Rumelange was created from the commune of Kayl by law of 27 June 1891 == Former communes == Since the country's creation in 1839, eight communes have changed their name and thirty-nine communes have been merged, resulting in the 102 communes that exist today. These defunct communes are listed in the table below. Name Year dissolved Reason Arsdorf 1979 merged to form Rambrouch Asselborn 1978 merged to form Wincrange Bascharage 2011 merged to form Käerjeng Bastendorf 2006 merged to form Tandel Bigonville 1979 merged to form Rambrouch Boevange 1978 merged to form Wincrange Boevange-sur-Attert 2018 merged to form Helperknapp Burmerange 2011 merged into Schengen Clemency 2011 merged to form Käerjeng Consthum 2011 merged to form Parc Hosingen Eich 1920 merged into Luxembourg City Ermsdorf 2011 merged to form Vallée de l'Ernz Eschweiler 2015 merged into Wiltz Folschette 1979 merged to form Rambrouch Fouhren 2006 merged to form Tandel Hachiville 1978 merged to form Wincrange Hamm 1920 merged into Luxembourg City Harlange 1979 merged to form Lac de la Haute-Sûre Heiderscheid 2011 merged into Esch-sur-Sûre Heinerscheid 2011 merged into Clervaux Hobscheid 2018 merged to form Habscht Hollerich 1920 merged into Luxembourg City Hoscheid 2011 merged to form Parc Hosingen Hosingen 2011 merged to form Parc Hosingen Kautenbach 2006 merged to form Kiischpelt Mompach 2018 merged to form Rosport-Mompach Mecher 1979 merged to form Lac de la Haute-Sûre Medernach 2011 merged to form Vallée de l'Ernz Munshausen 2011 merged into Clervaux Neunhausen 2011 merged into Esch-sur-Sûre Oberpallen 1846 merged into Beckerich Oberwampach 1978 merged to form Wincrange Perlé 1979 merged to form Rambrouch Rodenbourg 1979 merged into Junglinster Rollingergrund 1920 merged into Luxembourg City Rosport 2018 merged to form Rosport-Mompach Septfontaines 2018 merged to form Habscht Tuntange 2018 merged to form Helperknapp Wellenstein 2011 merged into Schengen Wilwerwiltz 2006 merged to form Kiischpelt == References == Category:Subdivisions of Luxembourg",
 "title": "Communes of Luxembourg"
}