{
 "id": "968061",
 "text": "The federal districts (, federalnyye okruga) are groupings of the federal subjects of Russia. Federal districts are not mentioned in the nation's constitution. They exist only to monitor the government's control over the region and to compare the federal and regional bodies of law. == List of federal districts == Federal district Date established Area (km2) 2010 census HDI (2019) Gross regional product (2020) Federalsubjects Administrativecentre Map of Federal District Population per km2 GRP GRP per capita Central 18 May 2000 650,200 38,438,600 59.1 0.847 ₽33.637 trillion (€B) 854,978 ₽ (€) 18 Moscow Northwestern 18 May 2000 1,687,000 13,583,800 8.1 0.835 ₽10.644 trillion (€B) 762,357 ₽ (€) 11 Saint Petersburg Southern 18 May 2000 427,800 16,141,100 37.7 0.801 ₽6.710 trillion (€B) 407,280 ₽ (€) 8 Rostov-on-Don North Caucasian 19 January 2010 170,400 9,496,800 55.7 0.795 ₽2.404 trillion (€B) 241,662 ₽ (€) 7 Pyatigorsk Volga 18 May 2000 1,037,000 29,900,400 28.8 0.806 ₽13.669 trillion (€B) 468,462 ₽ (€) 14 Nizhny Novgorod Ural 18 May 2000 1,818,500 12,082,700 6.6 0.842 ₽11.675 trillion (€B) 945,711 ₽ (€) 6 Yekaterinburg Siberian 18 May 2000 4,361,800 17,178,298 3.9 0.796 ₽9.027 trillion (€B) 529,091 ₽ (€) 10 Novosibirsk Far Eastern 18 May 2000 6,952,600 8,371,257 1.2 0.810 ₽6.044 trillion (€B) 741,938 ₽ (€) 11 Vladivostok Source: == History == The federal districts of Russia were established by President Vladimir Putin in 2000 to help with the federal government's task of controlling the then 89 federal subjects across the country. On 19 January 2010, the new North Caucasian Federal District split from the Southern Federal District. ===Crimea=== In March 2014, after the annexation of Crimea, the Crimean Federal District was created. However, most countries say that this annexation was illegal. On 28 July 2016 the Crimean Federal District was removed and put into the Southern Federal District to improve the governing of the region. ===Far East=== In November 2018, Buryatia and Zabaykalsky Krai were removed from the Siberian Federal District and added to the Far Eastern Federal District. The administrative centre of the Far Eastern Federal District was moved from Khabarovsk to Vladivostok in December 2018. == References == == Other websites == * Wilson Center article on Russia's federal districts Category:Subdivisions of Russia",
 "title": "Federal districts of Russia"
}