{
 "id": "968028",
 "text": "Novgorod Oblast (, Novgorodskaya oblast) is a federal subject of Russia. Specifically, it is an oblast. Its administrative center (capital city) is the city of Veliky Novgorod. Some of the oldest Russian cities, including Veliky Novgorod and Staraya Russa, are in the oblast. The historic monuments of Veliky Novgorod and surroundings have been made a UNESCO World Heritage Site. Population: 634,111 (2010 Census). == Geography == Novgorod Oblast borders Leningrad Oblast in the north and in the northwest, Vologda Oblast in the east, Tver Oblast in the southeast and in the south, and Pskov Oblast in the southwest. ===Lake Ilmen=== In the center of the oblast is Lake Ilmen. Lake Ilmen is one of the largest lakes in Central Russia. The major tributaries of Lake Ilmen are the Msta, the Lovat, the Pola, the Polist, and the Shelon. The only outflow of the lake is the Volkhov, a major tributary of Lake Ladoga. ===Protected areas=== Two areas in Novgorod Oblast have been made protected natural areas of federal significance. These are Valdaysky National Park in the southeast of the oblast and Rdeysky Nature Reserve in the southwest of the oblast, which protects the Polist-Lovat Swamp System and is next to Polistovsky Nature Reserve in Pskov Oblast. == History == Novgorod is one of the oldest centers of Russian civilization. It was on the historical trade route from the Varangians to the Greeks. This route followed the Volkhov upstream to Lake Ilmen and then followed the course of the Lovat before reaching the Dnieper. In 1136, Novgorod became the center of the Novgorod Republic. The Novgorod Republic included the major part of what is today northwestern Russia. Novgorod was part of the Hanseatic League. It was one of the few areas of Rus not affected by the Mongol invasions. It was also a major cultural center. Towards the end of the 15th century, Novgorod was defeated by the army of Ivan III, the prince of Moscow. It was included into the Grand Duchy of Moscow. In 1560, Ivan the Terrible, fearing treason, sent his army to sack the city. This event was known as the Massacre of Novgorod. It had terrible consequences for the city, which lost the majority of its population and never recovered. Additionally, Novgorod was looted by the Swedish army in the beginning of the 17th century, during the Time of Troubles. ===19th century=== Before the 19th century, the areas around Novgorod were much better developed than the areas which are currently in the center and the east of the oblast. In 1851, Moscow – Saint Petersburg Railway opened. It was the first long-distance railway in Russia. It went around Novgorod as it was built on a straight line between Moscow and Saint Petersburg. The railway construction lead to the development of the nearby areas and eventually to creation of new towns such as Malaya Vishera, Okulovka, and Chudovo. ===20th century=== On August 1, 1927 the governorates of the Russian Empire were removed. The territory of present-day Novgorod Oblast merged into newly created Leningrad Oblast. German troops occupied the area between autumn of 1941 and spring of 1944 during World War II. After its liberation on 5 July 1944, Novgorod Oblast was created. In 1999, the city of Novgorod was renamed Veliky Novgorod. == Administrative divisions == The oblast is administratively divided into three cities and towns under the oblast's jurisdiction (Veliky Novgorod, Borovichi, and Staraya Russa) and twenty-one districts. Another seven towns (Chudovo, Kholm, Malaya Vishera, Okulovka, Pestovo, Soltsy, and Valday) have the status of the towns of district significance. == Demographics == Population: 634,111 (2010 Census), down from 694,355 recorded by the 2002 Census, and further down from about 753,054 recorded in the 1989 Census. Novgorod Oblast has the lowest population of any oblast in the European part of Russia. One of the reasons for the low population is that the area took large losses during World War II. The population is 70.6% urban. === Ethnic groups === In the 2010 Census, these were the largest ethnicities in Novgorod Oblast: 560,280 Russians (95.1%); 7,025 Ukrainians (1.2%); 3,598 Romani (0.6%); 3,438 Belarusians (0.6%); 15,054 others. == Gallery == File:Annunciation Ustyuzhskoe.jpg|Ustyug Annunciation, a Novgorod icon from the 12th century File:ЦЕРКОВЬ СПАСА ПРЕОБРАЖЕНИЯ НА ИЛЬИНЕ УЛИЦЕ - Iglesia de la Transfiguración..jpg|Church of the Transfiguration on Ilyina Street, Veliky Novgorod File:Gusli Гусли.jpg|The Gusli instrument was first recorded in 12th century in Novgordian Rus'. File:Saint Sophia Cathedral in Novgorod (cropped).jpg|The Saint Sophia Cathedral of Novgorod was one of the first churches which introduced Onion domes File:Birch bark document 210.jpg|The birch bark manuscript No. 202 written by Onfim, unearthed in Novgorod == References == == Other websites == * * Information for tourists * Central Eurasian Information Resource: Images of Novgorod Oblast—University of Washington Digital Collections Category:States and territories established in the 1940s Category:Oblasts of Russia",
 "title": "Novgorod Oblast"
}