{
 "id": "968089",
 "text": "Kefee Obareki Don Momoh (5 February 1980 - 12 June 2014), commonly referred to as Kefee was a female gospel musician in Nigeria. ==Early life== She was born in Sapele, Delta on 5 February 1980 to the family of Andrew Obareki who were at a time Deacons at a church founded by the parents of her ex-husband Alec Godwin. Kefee graduated from University of Benin with a degree in Business Administration. Growing up as teen, she actively engaged herself with church activities especially singing in the choir. ==Career== As her passion for music kept growing bigger, she started writing and composing songs. In 2000 she released an album titled \"Trip\" and that made way for her into the Nigerian music scene as a Gospel artist. In 2003, she got signed to Alec's Entertainment, a record label founded by her former choir director and she released her debut studio album \"Branama\" shortly after that. The Branama album brought her into the spot light as a fulfilled Gospel artist with sales both national and international. Branama sold nine thousand cassettes in three weeks and over two million CD/VCDs in a month. It served as a starting part to her successful career as Nigerian Gospel artist. The late singer's best known hits are \"Branama\" and \"Kokoroko\". ==Awards== She was awarded the International Young Ambassador for Peace Award in 2009. Kefee won the 2010 Headies Awards for Best Collaboration with Timaya for \"Kokoroko\". ==Private life== Kefee was married twice. She was married to Alec Godwin for three years until 2008. She married radio host Teddy Esosa Don-Momoh on 3 March 2012 in Sapele, Delta State. ==Death and burial== Though the cause of death was rumoured to be pre-eclampsia, Kefee Obareki Don Momoh died of lung failure at a hospital in Los Angeles, California on June 12, 2014. She had been in a coma for fifteen days. She was buried on Friday July 11, 2014 in her hometown Okpara Inland, Ethiope East Local Government Area of Delta State, Nigeria. Also on July 11, 2014, a Nigerian religious figure Isaiah Ogedegbe wrote one poem about Kefee to praise her life. On September 29, 2022, Isaiah Ogedegbe wrote another poem about Kefee. ==References== Category:1980 births Category:2014 deaths Category:Nigerian gospel singers Category:Deaths in childbirth",
 "title": "Kefee"
}