{
 "id": "968268",
 "text": "Daniel LaRusso is the protagonist of the 1984 movie The Karate Kid and its first two sequels The Karate Kid Part II and The Karate Kid Part III. Daniel LaRusso is also the deuteragonist of the television series Cobra Kai. He is played by Ralph Macchio. ==Role in The Karate Kid== Daniel LaRusso was trained in karate at the YMCA in New Jersey and then moved to California with his single mother. Daniel falls in love with a girl named Alli but her ex- boyfriend Johnny Lawrence ends up bullying Daniel and even though Daniel tries to fight back, he still loses because Johnny Lawrence knows more karate than Daniel knows. After Mister Miyagi rescues Daniel he tells him to go to Johnny’s sensei and ask him to tell his students to stop bullying him. But when they go to Johnny’s dojo, his sensei named John Kreese tells Daniel to fight his students and Mister Miyagi says Daniel will fight at the tournament. Mister Miyagi teaches Daniel karate using muscle memory but tells him to use karate only for self-defence and never for revenge. Sensei John Kreese tells his student Bobby to break Daniel’s leg to beat him but Mr. Miyagi heals Daniel and Daniel beats Johnny Lawrence with a karate move he learned based on a crane kicking. ==Role in Karate Kid Part Two== Daniel goes with Mister Miyagi back to Okinawa and falls in love with a girl named Komiko. Daniel is harassed by someone named Chozen, whose uncle Sato wants to kill Mr. Miyagi, because Daniel found out that Chozen was cheating people out of their money. When Daniel and Miyagi save a little girl from a hurricane Sato helps them and Chozen is angry about that. Chozen gets revenge by kidnapping Komiko and says he won’t let her go unless Daniel agrees to fight him until one of them dies. Daniel says yes. Daniel fights Chozen and wins. Chozen thinks that Daniel will kill him but Daniel doesn’t because he believes in mercy and forgiveness. ==Role in Karate Kid III== In The Karate Kid Part III, Terry Silver sends people to rob Mister Miyagi’s store, steal his plants and destroy his property and attack Daniel and they say that they won’t stop unless Daniel fights in the karate tournament. Mister Miyagi tells Daniel not to fight in the tournament so Daniel goes to the police instead. Then the people who were harassing Daniel tell him that they will drown him and the girl with him unless he says yes and then Daniel agrees. So Daniel goes to Terry Silver and asks him to teach him karate. But then Daniel thinks that what Silver is teaching him is making him a bad person and asks him to stop so Silver tells him that John Kreese is alive and has Kreese attack him. After that Mr. Miyagi teaches Daniel fighting and Daniel wins the tournament. ==Cobra Kai== In the television series Cobra Kai, Daniel believes that Cobra Kai karate is evil and tries to get rid of it and when he can’t he starts his own dojo called Miyagi- Do to teach kids how to defend themselves from bullies and teaches them what he learned from Mister Miyagi. Then John Kreese comes back and wants to destroy Miyagi-Do for revenge against Daniel so Daniel ends up working with Johnny Lawrence to stop Kreese. Category:Fictional American people",
 "title": "Daniel LaRusso"
}