{
 "id": "968488",
 "text": "James Charles Rodgers (born September 8, 1897 – May 26, 1933 in New York) was an American blues and Old-Time musician. He became country music's first major star along with the Carter Family. He was the founder of Blue Yodeling. He was nicknamed \"Singing Brakeman\", \"America's Blue Yodeler\" and Labeled \"The Father of Country Music\". His best-known songs include \"T for Texas (Blue Yodel No. 1)\" and \"In the Jailhouse Now\". ==Life== ===Early life=== Born in 1897, Rodgers was the youngest of three sons, probably near Meridian, Mississippi. After the death of his mother, relatives in Mississippi and Alabama raised him. Eventually, Rodgers returned to his father Aaron Rodgers (and his second wife), a foreman at the Mobile and Ohio Railroad. Rodgers began singing and playing guitar as a child. He won a talent show when he was 12 and decided to pursue music for a living. His father originally placed him on the railroad. He worked there for several years in various jobs, including as a brakeman on the New Orleans and Northeastern Railroad, which earned him the nickname \"Singing Brakeman\". Besides his work, he took every opportunity to play music and improve his technique and style. He processed the experiences from these years again in his songs. In 1924, he contracted tuberculosis, had to give up his job on the railroad and struggled to make ends meet with music and the occasional job. ===Career=== In 1927, Rodgers auditioned for music producer Ralph Peer, who was looking for rural talent to market. A single was produced and earned Rodgers $27. His next recording \"T for Texas (Blue Yodel No. 1)\" became a top hit. It sold over a million copies, an extraordinary success for the time. In 1928 more Blue Yodels were recorded. One of his most famous titles, In the Jailhouse Now, also dates from that year. Rodgers quickly became a star. His records sold very well, the concerts were mostly sold out. Under the constant strain, his health continued to deteriorate. He spent the money lavishly, bought a luxurious villa and the most expensive cars. So he was forced to constantly produce more records and give concerts. ===Death=== The world economic crisis that followed the stock market crash of 1929 aggravated his situation, because the population no longer had money for records and concert tickets. In early 1933, Rodgers ran into serious financial difficulties. Despite his serious illness, he was forced to take every opportunity to make money. After a breakdown, he decided to do one last recording session. A bed was set up in the studio and a nurse was present. Jimmie Rodgers recorded the last twelve tracks of his life. He died two days later, on May 26, 1933, at the age of 35. ==Works and Reception== His career had only lasted six years. Still, the \"Singing Brakeman\" had a significant influence on all country musicians who came after him. Virtually every star of the 1940s, 1950s and 1960s referred to him. The mostly self-written lyrics of his songs went far beyond the usual hillbilly themes. He was one of the first country performers to incorporate personal experiences into their songs. The best-known example is the TB Blues. Stylistically, too, he broke away from his predecessors. He used blues elements and developed American yodelling into Blue Yodel. His compositions have been re-recorded many times over the decades and have always been hits. Webb Pierce & the Wilburn Brothers' version of In the Jailhouse Now spent 21 weeks at number one on the country charts in 1955. This was a record only Eddy Arnold and Hank Snow could equal, and it stood for 58 years until 2013. Also in 1955, Rodgers himself came out with a version of In the Jailhouse Now No. 2 on the country charts to number seven. Johnny Cash had a Top 10 hit within the Jailhouse Now in 1962. Sonny James placed 15th in 1977 with a live version. In 1960, his Mule Skinner Blues by The Fendermen was in the top 5 of the US pop chart and even reached the UK chart. The first singer with a Rodgers hit was Dolly Parton, who propelled the Mule Skinner Blues to number three on the country chart in 1970. Other country music greats such as Tommy Duncan, Lefty Frizzell, Jim Reeves and Grandpa Jones also had top 10 hits with Rodgers' compositions. In 1997, Bob Dylan issued a tribute album, interpreting the well-known musicians Rodgers songs. Dylan himself contributed My Blue Eyed Jane and accompanying text. The title of Dylan's album Rough and Rowdy Ways (2020) is also borrowed from Rodgers. ==Honors== *Inducted into the Country Music Hall of Fame (1961) *Inducted into the Songwriters Hall of Fame (1970) *Inducted into the Nashville Songwriters Hall of Fame (1970) *Inducted three Grammy Hall of Fame titles : Blue Yodel (T for Texas) (1985), Blue Yodel #9 (Standing on the Corner) , and In the Jailhouse Now (both 2007) *Inducted into the Rock and Roll Hall of Fame (1986) *Inducted into the Alabama Hall of Fame (1993) *Inducted into the Rockabilly Hall of Fame (1998) *Inducted into the Blues Hall of Fame (2013) *Inducted into the Mississippi Musicians Hall of Fame ==References== Category:1897 births Category:1933 deaths Category:Musicians from Mississippi Category:People from Meridian, Mississippi",
 "title": "Jimmie Rodgers"
}