{
 "id": "968456",
 "text": "Amílcar Barbuy (29 March 1893 - 24 August 1965) was an Italian Brazilian football player and manager. He was a talented and well-rounded midfielder. He was known for his commanding presence, pinpoint tackling, ability to read the game, powerful kicks and great long passes. He was one of the greatest players of Corinthians. Amílcar was a prolific forward who later became a midfielder. He had a powerful shot and a keen sense of goal. ==Club career== Amílcar is of Italo-Brazilian descent. He was with the club since the founding of Corinthians in 1910. He played in the team that first played in the Campeonato Paulista in 1913 . Barely a year later, the club became champion for the first time. The club could not participate in the competition in 1915 due to problems. They returned in 1916 and he became champion with the club again. Paulistano dominated the league for the next few years. The next titles did not come until 1922 and 1923. In 1923 he transferred to Palestra Itália, today's Palmeiras. With this club he won the Campeonato Paulista in 1926 and 1927. In 1931 he moved to Italy to become a player-trainer for Lazio. He attracted many Brazilians to the club, including Matturio Fabbi, Armando Del Debbio and Wellington Rato, earning it the nickname Brasilazio. He was the first Brazilian to play for an Italian club. ==International career== In 1916, he was the first player ever to be called up to the national team for Corinthians. He entered the South American Championship with Brazil. A year later, he was back again and scored the 4-0 in the game against Chile. In 1918 he even briefly trained the national team. In 1919 Brazil was able to triumph for the first time and won the trophy. Amílcar scored against arch-rival Argentina. Brazil was able to triumph again in 1922. He scored first in the match against Paraguay. They first drew three times and in the fourth game he and teammate Neco scored a goal against Argentina, putting Brazil, Uruguay and Paraguay in first place. Uruguay withdrew from the final battle as they protested the umpires who would favor Brazil. Brazil played the final against Paraguay and again became champions. ==Coaching career== At the end of his playing career, Amílcar converted to coaching. His first experience was on the Lazio bench during the 1931–1932 season. After the Italian adventure, he returned to his native country to coach Corinthians, São Paulo, Palestra Itália, Portuguesa, Portuguesa Santista and Atlético Mineiro. ==Honours== ===Club=== ;Corinthians *Campeonato Paulista: 1914, 1916, 1922, 1923 *Taça Competência: 1922, 1923 *Torneio Início do Campeonato Paulista: 1919, 1920, 1921 *Taça Ballor (champion 1 round of Paulista): 1923 ;Palestra Itália *Campeonato Paulista: 1926, 1926 (extra edition), 1927 *Taça dos Campeões Estaduais Rio-São Paulo: 1926 *Taça Competência: 1926, 1927 *Torneio Início do Campeonato Paulista: 1927, 1930 *Taça Ballor (champion 1 round of Paulista): 1926, 1927 ===International=== ;Brazil *South American Championship: 1919, 1922 ;São Paulo national team *Campeonato Brasileiro de Seleções Estaduais: 1922 ===Individual=== *South American Championship 2nd best player of the tournament: 1919 *IFFHS Brazilian Player of the 20th Century (8th place) *IFFHS South American Player of the 20th Century (24th place) ==References== Category:1893 births Category:1965 deaths",
 "title": "Amílcar Barbuy"
}