{
 "id": "968580",
 "text": "Some weapons are able to wait over an area before they hit their target. They are called loitering weapons. Other names include loitering munition, suicide drone or kamikaze drone. During the Russian invasion of Ukraine, Ukraine has used loitering weapons including Switchblade (drone) and Bayraktar. Russia has used Lancet,Под крышей дрона: ВМФ усиливается БПЛА-камикадзе, Izvestia, 20 October 2021Russian naval ships to be armed with kamikaze drones, The Defense Post, 2 November 2021 and Geran-2 (also known as Shahed 136). Loitering weapons are different from cruise missiles, because cruise missiles do not wait (loiter) over the target area. They are different from UCAVs in that a loitering weapon is intended to be used in an attack and has a built-in warhead. Loitering weapons are more similar to a drone, but they also have some properties of a missile. In this type of weapon, the munition waits, until it detects a target. Sometimes, it waits until it is given a command to attack. Loitering weapons allow selecting targets more precisely. ==History== The first loitering weapons were built in the 1980s. At that time, they were used against surface-to-air missiles (SAMs). They were used to suppress enemy air defenses in the 1990s. From the 2000s, loitering weapons have been developed for extra roles such as large ones for relatively long-range strikes and fire support, or tactical, very short range battlefield systems that fit in a backpack. == Law == Some of these weapons are capable of making decisions on whether to hit a target or not, on their own. If no human being is involved in this decision, this raises a number of ethical issues, and problems with international law. In many respects loitering weapons are not comparable to a missile, that is fired at a target. A loitering weapon may spend hours waiting for a target to appear. While it may request final clearance before the hit, this does not have to be the case. In other words: With a loitering weapon, there may be no human who decides what target is hit. ==Related pages== *Drone (or unmanned aerial vehicle) ==References== Category:Weapons Category:Drones",
 "title": "Loitering weapon"
}