{
 "id": "968684",
 "text": "Djalma Pereira Dias dos Santos known simply as Djalma Santos (; also spelled Dejalma Santos), (27 February 192923 July 2013) was a Brazilian footballer who started for the Brazil national team in four World Cups, winning two, in 1958 and 1962. Santos is considered to be one of the greatest right-backs of all time. He was known for defensive skills and also displayed some impressive technical and attacking skills. He was also renowned as a set-piece taker. He is one of the only three players to be included into three FIFA World Cup All- Star Team (in 1954, 1958 and 1962) along with Franz Beckenbauer who was included (in 1966, 1970 and 1974) and Phillipp Lahm (in 2006, 2010 and 2014). He was known as a respected player and he was never sent off from the field. ==Club career== Santos started his career with Portuguesa, the fourth biggest club in his home city. The club had one of the strongest teams in club history at the time, with players such as Brandãozinho, Simão, Julinho, Ipojucan and Pinga. In 1952 and 1955 he won the Torneio Rio-São Paulo with the club. After eleven years, he made the move to Palmeiras, for which he would play for nine years. With that club he won the Campeonato Paulista three times, the Torneio Rio-São Paulo once and became national champion three times. He ended his career with Atlético Paranaense from Curitiba, with which he won the Campeonato Paranaense in 1970. ==International career== He played his debut match for the national team against Peru on April 10, 1952, alongside Ademir, Didi and Nílton Santos. The match, which ended 0-0, was for the 1952 Pan American Football Championship, which Brazil would win. Two years later he was in the squad for the 1954 FIFA World Cup. He scored the 2-1 tie against Hungary from the spot in the quarterfinals against Hungary. In the second half, the match would escalate very violently, and after the defeat, the Brazilians even attacked the Hungarians in the dressing room. The match went down in history as the Battle of Bern. At the 1958 World Cup, he had to wait until the final before he could play his first game. He ensured that Swedish left winger Lennart Skoglund was neutralized and Brazil won 5-2. Four years later, star player Pelé injured himself in the group stage, forcing Brazil to rely on defensive rather than offensive football. In addition to Garrincha and Pelé's replacement Amarildo, Djalma Santos was one of the strongholds of the team, which could extend the world title. He was also present at the 1966 FIFA World Cup in England. However, the adventure already ended in the group stage. In 1968, he played his last international match in the 2-0 win against Uruguay. Until July 3, 1998, he was the player with the most appearances for the Seleção with 98 games. ==Later life and death== After his active time he became a trainer of Panama. He later became the coach of the Brazilian football club EC Bahia, and in the mid-1980s he worked in Kuwait. He later taught at a football school in the Brazilian state of Minas Gerais. From July 1, 2013, 84-year-old Santos had pneumonia, from which he died three weeks later. == Honours == ===Club=== Portuguesa *Torneio Rio – São Paulo: 1952, 1955 Palmeiras *Campeonato Paulista: 1959, 1963, 1966 *Campeonato Brasileiro Série A: 1960, 1967 (Torneio Roberto Gomes Pedrosa), 1967 (Taça Brasil)Ídolo eterno do Verdão, Djalma Santos morre aos 84 anos em MG *Torneio Rio – São Paulo: 1965 ===International=== Brazil *FIFA World Cup: 1958, 1962 *Panamerican Championship: 1952 *South American Championship Runner-up: 1953, 1957, 1959 (Argentina) *South American Championship Fourth place: 1956 *Roca Cup: 1957, 1960, 1963 *Copa Río Branco: 1968 *Taça Oswaldo Cruz: 1955, 1956, 1958, 1961, 1962 *Taça Bernado O'Higgins: 1959, 1961 Individual *FIFA World Cup All-Star Team: 1954, 1958, 1962 *World Soccer World XI: 1962, 1963, 1965\"ERIC BATTY’S WORLD XI – THE SIXTIES\" Retrieved on 26 November 2015 *FIFA XI: 1963FIFA XI´s Matches - Full Info *FIFA World Cup All-Time Team: 1994 *FIFA 100 *The Best of The Best – Player of the Century: Top 50\"The Best of The Best\" Retrieved on 17 November 2015 *Brazilian Football Museum Hall of Fame == References == Category:Footballers from São Paulo Category:1929 births Category:2013 deaths",
 "title": "Djalma Santos"
}