{
 "id": "968723",
 "text": "José María Minella (1909–1981) was an Argentine football player and manager. He played for and managed Argentina's national team. He played as a midfielder; he was predominantly centre-half, although he initially held more offensive roles, such as in the 1930 world tour, in which he scored 11 times playing for Gimnasia La Plata. The first position he was employed in was that of left midfielder, at Independiente; later, due to his playing characteristics, which led him to manage the game, he was moved to the center, where he was assigned the number 5 of the centromediano. He was gifted with his marking technical ability. Considered as one of the best Argentine midfielders of all time. ==Early life== Son of Italian immigrants, he was born in the La Perla district of Mar del Plata from a father originally from Villanova Monferrato. ==Club career== He first met football in his native neighborhood, and later moved to Club Independiente in Mar del Plata. He moved to Gimnasia y Esgrima in La Plata. On June 4, 1931 he played there for the first time at a professional level, taking the field against Boca Juniors in Buenos Aires. He made a solid midfield trio with Montañez and Míguez. He was part of the so-called Expreso, the Gimnasia line-up that came close to winning the 1933 championship, also becoming its captain. He was sold to River Plate for 37,500 pesos, a considerable figure for the time. With the new jersey he was immediately the owner, competing in the tournaments of 1936, 1937 and 1941, won by the club by the red band. In the last of these, however, he was scarcely employed, given his advanced age. In 1942 he left Argentina for Uruguay, and played two editions of the local championship, obtaining two consecutive second places. In 1944 he passed to the Chileans of the Green Cross, where he ended his career. ==International career== Minella made his debut in the Argentine national selection in 1933. That team, however, was not properly considered official by the Federation. On January 6, 1935 he officially made his debut during the South American Championship in 1935, facing Chile in Lima. In 2-3-5 chosen by Manuel Seoane Minella was deployed as center-half. He played the whole tournament in this position. On January 20 he took the field against Peru and on January 27 against Uruguay, both times as a starter. Argentina reached second place in the competition. In 1937 he was in the second South American Championship, which was held entirely in Buenos Aires. Once again as a central midfielder, Minella played all the matches of the tournament. He made his debut on December 30, 1936 against Chile, and attended against Peru (January 16, 1937), Uruguay (January 23) and Brazil (January 30). At the end of the tournament a play-off had to be played, in which Minella did not take part. He was replaced by Ernesto Lazzatti. In 1940 he participated in the Copa Juan R. Mignaburu and the Copa Héctor Rivadavia Gómez. The following year he was part of the squad that played the Copa Presidente Roque Saenz Peña. In 1941 he was also called up for the South American, organized in Santiago. He was in the midfield together with Esperón and Sbarra in the first match against Peru on 12 February. On February 16 he was the starter against Ecuador, and on February 23 he played the first 40 minutes of the match with Uruguay. This was his last game in South American Championship premier international tournament. Minella turned down a chance to play for the South American Championship in 1942 where Argentina finished as runners-up. ==Managerial career== Minella joined the River Plate bench the year after his retirement as a player. He replaced Renato Cesarini, creator of La Máquina, capable of winning several championships. In 1945, at his debut, Minella's first title as coach arrived, obtained one day from the end thanks to a 2-0 win over Chacarita Juniors. Minella deployed the team following the 2-3-5, the so-called \"WM\", module particularly popular in South America in those years. The 1946 season saw River hit third place, five points behind the winner, San Lorenzo de Almagro. In 1947 the team led by Minella was still champion, again one day from the end of the championship, defeating Rosario Central. In the 1950s he made an important contribution to the club's victories between 1952 and 1957. Key elements of that team were Ángel Labruna, Néstor Rossi and Amadeo Carrizo. The first trophy was obtained not without difficulty. In 1953 the River got the better of Racing from Avellaneda. In 1955 the title also came thanks to a positive streak of 16 matches. In 1956 and 1957 the championships were dominated by River. Following the transfer of Omar Sívori to Juventus , the period of success came to an end, and Minella left the bench. In 1964 the coach was called by the Argentine Football Federation to hold the position of coach of the Albiceleste national team. He made his debut on May 31 in Rio de Janeiro against Portugal. Minella was called up to direct the selection during the Taça das Nações, a tournament that included four national teams. In this event the Argentines obtained the victory, thanks to the three successes with Portugal, Brazil and England, without conceding any goals. The CT made some particular choices, placing lesser known elements at the international level alongside already established players. After this title, he was confirmed on the bench, and took part in various tournaments, mainly of a friendly nature, including the Dittborn Cup and the Chevallier Boutell Cup. He was also the coach who led the national team to qualify for England 1966. He was replaced by Osvaldo Zubeldía first and then Juan Carlos Lorenzo, with the latter sitting on the Argentine bench during the Rimet Cup. In 1968 he was recalled as a replacement for Cesarini, and he was the coach for eight other matches, all friendly, collecting three defeats, three draws and two victories. ==Honours== ===As a player=== ====Club==== Gimnasia La Plata *Argentine championship: 1929 River Plate *Primera División Argentina: 1936, 1937, 1941 *Copa Aldao: 1937 ====International==== Argentina *Copa América: 1937, 1941 ===As a manager=== ====Club==== River Plate *Primera División Argentina: 1945, 1947, 1952, 1953, 1955, 1956, 1957 *Copa Aldao: 1947 *Copa Ibarguren: 1952 Argentina *Taça das Nações: 1964 ==References== Category:Argentine footballers Category:1909 births Category:1981 deaths",
 "title": "José María Minella"
}