{
 "id": "968898",
 "text": "The Chilean recluse spider, Loxosceles laeta, is a highly venomous spider of the family Sicariidae. It usually hides in cracks and corners that are difficult to access, hence its name. It is considered the most dangerous of the spiders of the genus Loxosceles, since its bite frequently produces severe systemic reactions and even death. The Sicarius spider is related to this spider and is therefore also considered dangerous. ==Distribution and Habitat== Loxosceles laeta is native to South America. It is very common in Chile, Peru, Ecuador, Argentina, Uruguay, Paraguay, and southern Brazil. It has been introduced to North America and several Central American countries, but does not naturally thrive in these countries. In the United States, the species became established in the Los Angeles area. Infestations have also been reported in Florida, Cambridge, Massachusetts, and Vancouver, Canada. ==Behavior== The violinist spider is mainly nocturnal, its activity being increased on hot summer nights and with the moon. Although it is active throughout the year, its vitality decreases with the arrival of cold. That is why its favorite places during the day are the dark corners, from which it comes out to hunt. This species of spider hides in dusty and unclean places, for example, under gas tanks, behind pictures, cornices, bookcases or in closets, especially with clothes. One way to detect their presence is thanks to the existence of exoskeletons, left by the spider behind paintings, cornices, etc. A single individual can leave three moults before reaching its adult size. Another way is through its spider web, which has a messy and irregular design, and is generally located in right-angle profiles (corners), where it weaves a short, hammock-shaped horizontal web. White and cottony, it is not very effective for aerial hunting of insects. ==Bite effect== Within the genus Loxosceles, this spider is the one with the largest distribution in South America and is the most dangerous. The anaphylactic picture produced by the toxin of the bite is called loxoscelism. ===Poison Action=== The venom of Loxosceles laeta is potentially fatal depending on the inoculum-mass ratio of the individual. Its action is essentially proteolytic and necrotic (dissolves tissues causing cell death). It contains powerful proteolytic enzymes that destroy everything that has protein, and can be 15 times more toxic than a cobra and 10 times more powerful than sulfuric acid burn. In addition, its venom has a high power of penetration in the liver and bile ducts. Its main toxic component is sphingomyelinase D, which interacts with cell membranes, triggering an immune reaction within the first 24-48 hours after the bite. == References == Category:Araneomorphae",
 "title": "Chilean recluse spider"
}