{
 "id": "968893",
 "text": "Terry Silver is a fictional character from the movie The Karate Kid Part III and is the main villain. He’s also the antagonist of Season 5 of Cobra Kai. Terry Silver is played by Thomas Ian Griffith. ==Role in Karate Kid 3== After Johnny Lawrence loses a fight to Daniel LaRusso, Johnny’s Sensei John Kreese tells his friend Terry Silver that he’s going to close his dojo and quit karate but Silver tells him to try to get revenge instead. Silver hires someone named Mike Barnes and some other people to harass Daniel LaRusso into agreeing to fight in the karate tournament. Silver also lies to Daniel and tells him that John Kreese is dead so that Daniel will let Silver teach him karate at Kreese’s dojo called Cobra Kai. Silver teaches Daniel to use violence to solve problems and to hate mercy. When Daniel tells Silver that he’s changed his mind and now won’t fight Silver tells him that John Kreese is alive and sends both Kreese and Mike Barnes to attack him but they’re stopped by Mister Miyagi. Silver gets Mike Barnes to try to win against Daniel by cheating in the tournament. ==Role in Cobra Kai Season 4== Terry Silver was John Kreese’s best friend when they were soldiers in Vietnam and Kreese saved Silver’s life so Silver paid for Kreese’s dojo called Cobra Kai. But after The Karate Kid Part III, their dojo was banned from the tournament so Silver decided to leave karate. Silver then fell in love with a woman who got him to become a vegan. Kreese then came back and asked Silver to join him and Silver said yes. Silver got their dojo to win the tournament by bribing the referee. And he also framed Kreese for attempted murder to get him sent to prison so that Silver could be the new sensei. ==Role in Cobra Kai Season 5== Terry Silver wants Cobra Kai to be part of a global martial arts competition but Daniel LaRusso thinks Cobra Kai is evil so he goes to Mike Barnes from The Karate Kid Part III and asks for his help. Silver finds out so he sets Barnes’s store on fire. When Daniel tries to wikt:surrender, Silver beats him up and tells him that the reason he doesn’t kill him isn’t mercy but because he wants him to suffer. Johnny Lawrence, Mike Barnes and Chozen from The Karate Kid Part II break into Silver’s house and attack him but Silver stops them by stabbing Chozen and letting his security fight the other two. Silver then goes back to his dojo, fights Daniel LaRusso and loses. Then the police arrest Silver for bribery. Category:Movie characters",
 "title": "Terry Silver"
}