{
 "id": "969079",
 "text": "{{Infobox mountain | name = Gabilan Range | native_name = | other_name = Gabilán Range | etymology = | photo = Gabilan Range.JPG | photo_caption = Gabilan Range panorama. | country = United States | state = California | region = | district = San Benito County & Monterey County | topo_map = Mount Johnson | topo_maker = USGS | border = | range_coordinates = | highest =Fremont Peak | elevation_m = 1053 | coordinates = | length_mi = | length_orientation = | width_mi = | width_orientation = | area_mi2 = | geology = | orogeny = | period = | map = California | map_relief = yes | map_size = 220 | map_caption = Location of Gabilan Range in California }} The Gabilan Range is a mountain range in the U.S. state of California. It is near the central coast of California in Monterey and San Benito counties. The Gabilan Range is part of the larger California Coast Ranges. The word Gabilán is Spanish for sparrowhawk.Napa Valley Register - San Benito - California's Hidden Wine RegionHistoric Spots in California (1966; Hero Eugene Rensch, Ethel Grace Rensch, Mildred Brooke Hoover)Wines & Vines Analytics - Central Coast Vineyard Changes Hands Pinnacles National Park is in the southern section of the range. ==Geography== thumb |left |Gabilan Mountains in Pinnacles National Park thumb|left |Geologic map of the pre-Cenozoic basement rocks of the Gabilan Range in Monterey and San Benito Counties, California The Gabilan Range goes from northwest to southeast along the border of Monterey County and San Benito County. It is bordered on the east by the Diablo Range, the San Andreas Fault, and State Route 25; and on the west by the Salinas Valley, Santa Lucia Range, and U.S. Route 101. The northern limit of the Gabilan Range is just south of Pinecate Peak and San Juan Bautista, California. Fremont Peak, which is high, is the range's highest point. There are several other peaks also over in the range. ==History== In Spanish, gavilán (gabilan is an older spelling) means \"sparrow hawk\". Hawks, especially the red-tailed hawk, are common in the range. The Gabilan Mountains and other nearby places are mentioned in several novels by John Steinbeck, such as Of Mice and Men and East of Eden. In The Red Pony, the main character (Jody Tiflin) names his pony \"Gabilan\" after the mountain range. Fremont Peak was named for John C. Frémont, an American explorer and a Captain in the U.S. Army Corps of Topographical Engineers. He traveled to the peak in 1846 to decide if it was useful for the U.S. military against Mexico. It is now a California State Park. ==Ecology== Wild animals can travel through a relatively undeveloped area between the southern Santa Cruz Mountains and the northern Gabilan Range. This area extends from Mount Pajaro in southern Santa Cruz County and Rancho Juristac in southern Santa Clara County, to lands between Pinecate Peak and San Juan Bautista in San Benito County. California State Route 129 and U.S. Highway 101 cross this area. In 2020, The Land Trust of Santa Cruz County bought the first block of land intended to protect the Santa Cruz Mountains-Gabilan Range Wildlife Corridor: the Rocks Ranch in Aromas at the border of San Benito and Monterey counties. == References == == Other websites == * National Park Service: Pinnacles National Park website Category:Mountain ranges of the United States Category:Mountains of California",
 "title": "Gabilan Range"
}