{
 "id": "969057",
 "text": "Ankush Hazra is an Indian actor, movie producer, dancer and television personality. He debuted in 2010 with the movie Kellafate. He has also appeared in Khiladi, Kanamachi, Ami Shudhu Cheyechi Tomay, Villain, Bibaho Obhijaan, Magic, and FIR. He created the movie company Ankush Hazra Motion Pictures on 15 August 2022. ==Filmography == Denotes movies that have not been released yet Year Movie Role Director Studio(s) Notes Ref. 2010 Kellafate Shibu Pijush Saha Prince Entertainment P4 2012 Idiot Samrat Rajiv Kumar Biswas Eskay Movies 2013 Kanamachi Abir Raj Chakraborty 2013 Khiladi Suleman/ Krishna Ashok Pati 2014 Ami Shudhu Cheyechi Tomay Abhijeet Ashok Pati Kalakar Awards 2015 Romeo vs Juliet Romeo Ashok Pati Indo-Bangladesh joint venture 2015 Aashiqui Rahul Ashok Pati 2015 Jamai 420 Joy Rabi Kinagi Shree Venkatesh Films Star Jalsha Parivaar Awards 2016 Ki Kore Toke Bolbo Akash Rabi Kinagi Star Jalsha Parivaar Awards 2016 Kelor Kirti Apurbo Raja Chanda 2016 Zulfiqar Akhtar Ahmed Srijit Mukherji 12th Highest-grossing Bengali movie 2016 Haripada Bandwala Haripada Pathikrit Basu IBFA Awards 2017 Ami Je Ke Tomar Aditya Ravi Kinagi 2017 Bolo Dugga Maiki Sammyo Raj Chakraborty 2018 Villain Joy / Raja Baba Yadav 2019 Bibaho Obhijaan Anupam Birsa Dasgupta Films and Frames Digital Film Awards, Kalakar Awards 2021 Magic Indrajit Raja Chanda SSG Entertainment F.I.R No. 339 ACP Abhrajit Dutta Joydip Mukherjee Shadow Films, Roadshow Productions, RT Network 2022 Kishmish Ankush Hazra Rahul Mukherjee Dev Entertainment Ventures Special Appearance Savings Account Abhimanyu Sen Raja Chanda Shadow Films Zee5 OTT Release on 11 November 2022 Zee Bangla Cinema World TV Premiere on 20 November 2022 Ogo Bideshini AB (Anath Bondhu) Anshuman Pratyush Eskay Movies Releaising on 18 November Love Marriage Premendu Bikash Chaki Surinder Films Filming Mon Kharap Nirban Sen Pavel M.K Media pvt ltd Filming ==Television== Year Show Role Channel 4 July 2016 - 23 November 2016 Dance Bangla Dance (Season 9) Judge Zee Bangla 19 September 2017 Didi No. 1 (Season 7) Guest 10 February 2021 (Season 8) Guest 3 March 2018 - 9 September 2018 Dance Bangla Dance (Season 10) Judge 2020-2021 Hasiwala & Company (Season 1) Judge Dance Dance Junior (Season 2) Guest Judge Star Jalsha 2021 May Dance Bangla Dance (Season 11) Host Zee Bangla 2022 February Mon Phagun Guest appearances Star Jalsha ==Web series== Denotes webseries that have not yet been released Year Web Series Role Director Platform 2020 Case Jaundice Mr. Das Subhankar Chattopadhyay Hoichoi 2022 Shikarpur Keshto Nirjhar Mitra ZEE5 ==Advertisement music videos== Year Video Singer(s) Composer(s) Music label reference 2022 Let's 1xbat Mimi Chakraborty 1xBet ==Awards and nominations== Year Award Category Movie Result 2015 Kalakar Awards Best Actor Ami Shudhu Cheyechi Tomay 2016 Star Jalsha Parivaar Awards Best Jodi (Ankush & Nusrat) Jamai 420 2017 Best Jodi (Ankush & Mimi) Ki kore toke bolbo 2017 IBFA Awards Best Jodi (Ankush & Nusrat Jahan) Haripada Bandwala 2019 Tele Cine Awards Best Actor Bibaho Obhijaan 2020 Films and Frames Digital Film Awards Best Actor (Comic Role) 2020 Kalakar Awards Best Actor 2021 Star Jalsha Parivaar Awards Style Icon (Non-fiction) Hasiwala & Company 2022 Zee Bangla Sonar Sansar Awards Priyo Sadasya Dance Bangla Dance ==References== ==Other websites== * * * * * Category:1989 births Category:Living people Category:Indian actors",
 "title": "Ankush Hazra"
}