{
 "id": "96914",
 "text": "In sociology, Social class refers to the hierarchical distinctions between individuals or groups in societies or cultures. There are various ways to divide classes. The working class do hard work for others. Where money is used, they are paid for it, but they seldom have much money. Where money is used little, as in feudalism, or not at all, as in the Inca Empire there are still classes. Historians usually see two other groups - people who are rich or have a lot of influence, called the upper class, and all the remaining people who are in between, called the middle class. Not all societies have social classes. Scientists have found no proof for hierarchical power structures during the Stone Age.Gowdy, John (2006) \"Hunter-gatherers and the mythology of the market,\" in Richard B. Lee and Richard H. Daly (eds.), The Cambridge Encyclopedia of Hunters and Gatherers, pp.391-394. New York: Cambridge University Press ==Determinants of class== In societies where classes exist, one's class is determined largely by: * occupation * education and qualifications * income, personal, household and per capita * wealth, including the ownership of land, property, means of production, et cetera * family background. In the United Kingdom there are upper class, middle class, working class and underclass people. ==Related pages== *Bohemianism *Caste *Constitution *Constitutional economics *Class struggle *Clergy *Household income in the United States *Social status *Social structure *Working class *Upper class ==References== ==Further reading== * Marx, Karl & Engels, Frederick; The Communist Manifesto, (1848). (The key statement of class conflict as the driver of historical change). * Savage, Mike; Class Analysis and Social Transformation (London: Open University Press, 2000). * Sennett, Richard & Cobb, Jonathan; The Hidden Injuries of Class, (Vintage, 1972) (classic study of the subjective experience of class). * Wlkowitz, Daniel J.; Working with Class: Social Workers and the Politics of Middle-Class Identity (University of North Carolina Press, 1999). * \"Class, Status and Party\", Max Weber, in e.g. Gerth, Hans and C. Wright Mills, From Max Weber: Essays in Sociology, (Oxford University Press, 1958). (Weber's key statement of the multiple nature of stratification). * Wright, Erik Olin; Class Counts: Comparative Studies in Class Analysis (Cambridge University Press, 1997) ==Other websites== *Class Action: * http://www.atimes.com/atimes/Central_Asia/IL06Ag01.html Dargin, Justin, The Birth of Russia's New Energy Class. The Asia Times (Dec. 6, 2007) *Dictionary of the history of ideas: Class *Charles Dunoyer And The Theory Of Industrialism and Comte And Dunoyer After The 1830 Revolution: The Impact Of Their Ideas in The Radical Liberalism Of Charles Comte And Charles Dunoyer by David M. Hart. *Marxist and Austrian Class Analysis (PDF) by Hans-Hermann Hoppe *Classical Liberal Roots of the Marxist Doctrine of Classes (PDF document), Classical Liberal Roots of Marxist Class Analysis (MP3 audio file), lecture by Ralph Raico. *Rethinking Cultural and Economic Capital - Jan Rupp",
 "title": "Social class"
}