{
 "id": "969288",
 "text": "The water polo competition at the 1922 Women's Olympiad was held on 22 April 1922. It was the first ever women's water polo championship. The venue of the competition was the Port Hercules, the harbour of Monte Carlo, Monaco. The competition was won by the Netherlands, who beated the United Kingdom with 6-0. ==Background== Women's water polo was in the early 20th-century a rising sport. Until 1922 not many international matches have been held. However the Netherlands and Great Britain already played once against each other. In January 1914 the Ladies Water Polo Club played two matched in the Netherlands against the Dutch women's water polo team of the Hollandsche Dames-Zwemclub (H.D.Z.) in Amsterdam and The Hague. At the last Olympics, the 1920 Summer Olymipics, women's water polo was a demonstration event, where two women's teams from the Netherlands played against in each other in an exhibition match. ==Teams== Initially the teams of the tournament were named to be The Netherlands and France. On 11 April 1922 it was stated a team from The Netherlands and a team from the United Kingdom would compete, with possibility of a French team. The French Swimming Federation withdrew the French water polo team because the French women's water polo players would not be good enough against the Dutch team. ===Netherlands=== In late January 1922 it was announced a Dutch team of seven players was invited to participate at the 1922 Women's Olympiad. On 13 February 1922 newspaper Het Volk published an initial Dutch selection: Alida Bolten (A.D.Z.), B. Noorwegen (A.D.Z.), Jo Evelein (H.D.Z.), Job van Laar (H.D.Z.), Loes Brandt (H.D.Z.), Annie Treffers (R.D.Z.) and Truus Klapwijk (R.D.Z.). Broer (R.D.D.) was named as the reserve. In the announcement two days later on 15 February of newspaper De Telegraaf and later in other newspapers, B. Noorwegen was not in the main selection but listed as a reserve. Goalkeeper H. van Leeuwen (H.Z. & P.C.) was listed in the selection. 'Former' reserve Broer was not mentioned anymore. On 15 March it was annouced that reserve player B. Noorwegen withdrew due to illness. Rie Beisenherz (A.D.Z.) became the new reserve player. Ahead of the Olympiad, special training sessions were organized with the team in Amsterdam. A week before the departure to Monte Carlo, midfielder Job van Laar had to withdrew due to family circumstances. Annie Treffers switched from attacker to midfielder and Beisenherz became attacker. It was stated that \"her speed will be an improvement\" for the team. B. Duykers became the new reserve player, but would't play. About the complete team was stated that it was a good team cohesion, but that it was not the best team that could have been sent to Monaco. Name Pos. Club Image H. van Leeuwen goalkeeper H.Z. & P.C. Jo Evelein defender H.D.Z. Truus Klapwijk defender R.D.Z. Annie Treffers midfielder R.D.Z. Alida Bolten attacker A.D.Z. Loes Brandt attacker H.D.Z. Rie Beisenherz attacker A.D.Z. Beb Duykers reserve ===United Kingdom=== The British team consisted of water polo players from London. Name Pos. Club Doris Hart goalkeeper Verrall Newman ==Match== The match of the Netherlands against the United Kingdom was won with 6-0 for the Netherlands. Multiple reports stated that the Dutch played very good together. The British ladies didn't have a good interplay. It was also stated that the Dutch ladies were predominantly better, especially in speed. The Dutch shots also attempted to score from a long distance, but these shots not successful and could easily be stopped by goalkeeper Doris Hart. The half-time score was 4-0. In the second half there were due to the cold water of the Mediterranean, less quick attacks. The British women were not able to score and only had during the match one shot at goal, that was stopped by goalkeeper Van Leeuwen. Top scorer of the match was Rie Beisenherz with three goals. The other goal scorers were Alida Bolten, Loes Brandt and Jo Evelein. The best players of the British team were goalkeeper Hart and Verrall Newman. The referee of the match was mr. Bergwall from Norway and received possitive feedback. H. van Leeuwen, Jo Evelein , Truus Klapwijk , Annie Treffers, Alida Bolten, Loes Brandt and Rie Beisenherz ==Aftermath== Shortly after the match the 5 metre platform diving event was held. Truus Klapwijk (who won the gold medal in the 3 metre diving event) was too tired after the match, and withdrew for the diving event. Partly due to the water polo victory, the Dutch ladies were officialy honored on their return to the Netherlands at the American Hotel in Amsterdam. ==References== ==Other websites== *Image of the match Category:1922 Women's Olympiad Category:Women's water polo",
 "title": "Water polo at the 1922 Women's Olympiad"
}