{
 "id": "969380",
 "text": "The London Ladies Waterpolo Club went in January 1914 to the Netherlands. The club played two water polo matches against the Hollandsche Dames Zwemclub (H.D.Z.) and Haagsche Dames Zwem- en Poloclub also competed in swimming events. The water polo matches were one of the earliest international women's water polo meetings. The first match took place in Amsterdam on 27 January and the second match in The Hague on 28 January. In early November 1913 it was announced the London Ladies Waterpolo Club would come in January 1914 to the Netherlands. ==27 January: Amsterdam== On 16 December 1913 it was announced the London Ladies Waterpolo Club would compete against H.D.Z. on 27 January 1914 in Amsterdam. The events were held at the . The event was advertised in national newspapers and tickets could be bought in advance. Next to water polo match of the London Ladies Waterpolo Club against the Nederlandsche Hollandsche Dames Zwemclub an international 4x 40 metre relay took place (also including ladies of the Haagsche Dames Zwem- en Poloclub) and national events were held. The evening started at 8 p.m. with an ochestra playing the British national anthem. Next to the international events, national events were held including a water polo match of the second team of the HDZ against the first team of The Hague (1–1). Three HDZ women (Evelein, Lachman and Helweg) gave diving demonstration from the 1 metre and 3 metre springboard. Another three women (A. Kolk, Spangenthal and B. Duijkers) demonstrated doll diving. ===4x 40 metre relay=== Three teams competed in the 4x 40 metre relay. In the first part of the race, the Nederlandsche Hollandsche Dames Zwemclub were leading the race. But the women of the London Ladies Waterpolo Club won with a considerable gap ahead of Nederlandsche Hollandsche Dames Zwemclub and Haagsche Dames Zwem- en Poloclub. It’s described that miss G. Anndson, the last swimmer of the British team, had a fantastic swimming style. 4x 40 metre relay Place Team Time 1 2’ 27.6\" 2 2’ 35\" 3 3’ 04.2\" ===Water polo=== ==== Teams ==== Hollandsche Dames Zwemclub Name Position goalkeeper defender defender midfielder attacker attacker attacker Job van Laar became at the last moment a member of the team, after one team member withdrawn. London Ladies Waterpolo Club Name Position goalkeeper defender defender (captain) midfielder attacker attacker attacker ;Referees :Johanna Triebels–Koen (Hollandsche Dames Zwemclub president) :W. E. Bredius (chairman swimming federation) :C. V. Kramer (IJ secretary) sources ==== Match ==== During the water polo match the Dutch women had a good teamwork, while the British women had very good shots and precision. In the first half the Dutch A. van Laar made the first goal, quickly followed by a second goal. At the end of the first half the British E. Ballard scored the first goal for the team. In the second half the British women were stronger. Especially captain D. Anderson played very well and scored. Just before the end of the match Ballard scored again and so the London Ladies Waterpolo Club won with 2-3. The best Dutch defenders were named Job van Laar and Evelein, and best Dutch attacker being Annie van Laar. In another match report the names of the goal scores are different, with names as Brandt scoring the second goal for the Netherlands and the British Annison scoring twice. ==28 January: The Hague== The events were organized as part of the first anniversary of the Haagsche Dames Zwem- en Poloclub. It was held on 27 January 1914 at the covered swimming venue in The Hague. An international water polo match and an international 20 metre freestyle was held. Next to the international events the evening started with a junior 20 metre freestyle, a water polo match of the Haagsche Dames Zwem- en Poloclub against H.D.Z. Amsterdam won the match with 4-0. Also other swimming events were held including: blind swimming, girls candle swimming, diving and doll diving. ===Relay=== A team of four swimmers of the London Ladies Club competed against four women of ADZ. The British team won in a time of 2:24.8, ten seconds ahead of the Dutch team. 4x 40 metre relay Place Team Time 1 2’ 24.8\" 2 + 10” ===20 metre freestyle=== Ahead of the water polo match, an “extra” event was held: the 20 metre freestyle. Four women from different cities competed against each other: London, The Hague, Rotterdam and Amsterdam. The British D. Anderson competed against the Dutch Van Laar, Schnwiert and Van Kappen. Anderson won in a time of 17.3, ahead of Van Laar. 20 metre freestyle Place Swimmer City Time 1 London 17.6\" 2 Amsterdam 18.2\" ===Water polo=== It was planned the British team would play against a mixed team of players from the clubs from Amsterdam and The Hague. However, shortly before the international water polo match, it was announced that players of the Dutch Hollandsche Dames Zwemclub were too tired to compete. This annoyed the Haagsche Dames Zwem- en Poloclub. While three women from Amsterdam still wanted to compete, the team from The Hague decided that the match would be played with only players from the club from The Hague. ==== Teams ==== Haagsche Dames Zwem- en Poloclub Name Position goalkeeper defender defender midfielder attacker attacker attacker London Ladies Waterpolo Club Name Position goalkeeper defender defender (captain) midfielder attacker attacker attacker source ====Match==== The match was described as an attractive match. The British team was much better compared to the Dutch team and had a very good accuracy and good shots and were faster. The British team won with 4–1. The Dutch goal was made with a good shot of an English substitute. ==References== Category:1914 in sports Category:Sport in the Netherlands Category:Sport in the United Kingdom Category:1914 in Europe Category:Women's water polo Category:Women's swimming Category:Amsterdam Category:The Hague Category:1910s in women's sport",
 "title": "London Ladies Waterpolo Club in the Netherlands in 1914"
}