{
 "id": "96946",
 "text": "Dentistry is a specialty in medicine, which is practiced by a dentist. Dentists find out what's wrong, fix, and help prevent problems with teeth. A dentist has other people that help him with their job. Dental hygienists help people keep their teeth clean. A dental assistant helps the dentist when they are treating a patient. Dental surgeons will perform surgery to fix large or dangerous problems with people's teeth. There are also dentists called orthodontists, who can move people's teeth using braces. Dental surgeons and orthodontists are called specialists. ==Dental specialties== * Dental public health - The study of dental epidemiology and social health. * Endodontics - The study, diagnosis, and treatment of diseases of the dental pulp.Walton, R. E., & Torabinejad, M. (2002). Principles and practice of endodontics. Saunders,. * Oral pathology - The study, diagnosis, and sometimes the treatment of oral and maxillofacial related diseases.Regezi, J. A., Sciubba, J., & Jordan, R. C. (2016). Oral pathology: clinical pathologic correlations. Elsevier Health Sciences.Rajendran, R. (2009). Shafer's textbook of oral pathology. Elsevier India.Soames, J. V., & Southam, J. C. (2005). Oral pathology. Oxford University Press. * Oral and Maxillofacial Radiology - The study and radiologic interpretation of oral and maxillofacial diseases. * Oral and Maxillofacial Surgery - Tooth extractions, dental implants, and facial surgery. * Orthodontics - The straightening of teeth.Graber, L. W., Vanarsdall, R. L., Vig, K. W., & Huang, G. J. (2016). Orthodontics-e-book: current principles and techniques. Elsevier Health Sciences.Proffit, W. R., Fields, H. W., Larson, B., & Sarver, D. M. (2018). Contemporary orthodontics- e-book. Elsevier Health Sciences. * Periodontics - Dentists which specialize in the treatment of periodontal (gum) diseaseWilson Jr, T. G., & Kornman, K. S. (2003). Fundamentals of periodontics. Quintessence Publ.. * Pediatric dentistry - Dentistry for children...Koch, G., Poulsen, S., Espelid, I., & Haubek, D. (Eds.). (2017). Pediatric dentistry: a clinical approach. John Wiley & Sons.Cameron, A. C., & Widmer, R. P. (2013). Handbook of Pediatric Dentistry E-Book. Elsevier Health Sciences. * Prosthodontics - Dentures, bridges and the restoration of implants. Some prosthodontists train more in \"oral and maxillofacial prosthodontics\", to learn how to replace missing facial parts, such as ears, eyes, noses, etc. ==Other websites== *The History of Dentistry *Qualitymanagement für dentistry *Information for UK dental professionals *The American Dental Association *Good Smile Dental *National Dentist Registry ==References== Category:Dentistry",
 "title": "Dentistry"
}