{
 "id": "969427",
 "text": "The Global Development Initiative ( its full name: Global Development Initiative —Building on 2030 SDGs for Stronger, Greener and Healthier Global Development) is a global initiative proposed by China in 2021. As of September 2022, more than 100 countries and international organizations have expressed their support to the Initiative. More than 60 countries have joined the Group of Friends of the GDI at the UN. == Content == On 21 September 2021, CCP general secretary Xi Jinping addressed the General Debate of the 76th session of the United Nations General Assembly. He put forward the Global Development Initiative in his speech titled “Bolstering Confidence and Jointly Overcoming Difficulties to Build a Better World”. In June 2022, CCP general secretary Xi Jinping chaired the High-level Dialogue on Global Development under the theme “Foster a Global Development Partnership for the New Era to Jointly Implement the 2030 Agenda for Sustainable Development”. As the outcome of the Dialogue, the Chair’s Statement was released with an annex which listed 32 practical measures for cooperation. === Core Principles === * Staying committed to development as a priority * Staying committed to a people-centered approach * Staying committed to benefits for all, to leave no country and no person behind * Staying committed to innovation-driven development * Staying committed to harmony between human and nature * Staying committed to results- oriented actions === Priority areas === * Poverty alleviation * Food security * Pandemic response and vaccines * Financing for development * Climate change and green development * Industrialization * Digital economy * Connectivity in the digital-era === Pathways === * Stay committed to development as a priority and focusing on the central task of implementing the 2030 Agenda; * Stay committed to results-oriented actions and project-led approach in promoting policy dialogue, experience sharing, capacity building and practical cooperation; * Welcome extensive participation, with the UN as an important partner for cooperation and the Group of Friends of the GDI as the main driver fostering fine examples of cooperation to encourage the participation of others; * Increase input by fully leveraging the Global Development and South- South Cooperation Fund and the UN Peace and Development Trust Fund to pool more resources, encourage donors to participate in cooperation with projects; * Advance GDI cooperation in an all-round way by strengthening cooperation in all areas of the Initiative for timely attainments of all the 17 SDGs; * Focus on current pressing challenges and jointly address key issues including poverty alleviation, food and energy security as well as disruption to industrial and supply chains turbulence, while advancing GDI cooperation in an all-round way; == Group of Friends of the Global Development Initiative == === Launch === On January 2022, the Permanent Mission of the People’s Republic of China to the UN held the Launch Meeting of the Group of Friends of Global Development Initiative. This marked the official establishment of the Group. The UN Deputy Secretary-General Ms. Amina Mohammed, Under-Secretary-General Mr. Liu Zhenmin, Under-Secretary-General and Special Adviser on Africa to the Secretary-General Ms. Cristina Duarte, Associate Administrator of UNDP Ms. Usha Rao-Monari, Deputy Executive Director of UN Women Ms. Anita Bhatia, and more than 20 heads of UN agencies were present at the meeting and spoke. Delegates from over 100 countries participated in the meeting, including more than 80 ambassadors. Deputy Secretary-General Amina Mohammed noted in her remarks that the UN welcomes and supports the GDI, and believes this Initiative will help ensure the world keep the promise of “leaving no one behind”. She also mentioned that the GDI shows China’s continued commitment to supporting the SDGs. TRhe UN looks forward to working with the Group on the next-phase pragmatic cooperation. === Event === On May 9, 2022,the High-Level Virtual Meeting of the Group of Friends of the Global Development Initiative, with the theme of “Deepening Cooperation under Global Development Initiative for Accelerated Implementation of the 2030 Agenda”, was held at the United Nations Headquarters in New York. Chinese State Councilor and Foreign Minister Wang Yi addressed the meeting via video link. UN Secretary-General António Guterres delivered a video message. Deputy Prime Minister and Minister of Foreign Affairs of Thailand Don Pramudwinai, Deputy Prime Minister and Minister of Foreign Affairs of Kazakhstan Mukhtar Tileuberdi, Foreign Minister of Pakistan Bilawal Bhutto Zardari, Foreign Minister of Cuba Bruno Rodríguez Parrilla, Secretary of State of Ministry of Planning of Cambodia Thavrak Tuon, Deputy Foreign Minister of Egypt Hamdi Sanad Loza, Under-Secretary-General for Economic and Social Affairs Liu Zhenmin, UNDP Administrator Achim Steiner, FAO Director General Qu Dongyu, and representatives of UNEP, UNFPA, UNICEF, UN Women, UNIDO and other UN development agencies were there and spoke. In his speech, Secretary-General Guterres said that we are fast-approaching the mid- point of the time to achieve the Sustainable Development Goals. Progress is in peril. We must and can do better. Discussions through the GDI can help move the needle on development progress across all countries. For people, for planet, and for our common future, it’s time to rescue the SDGs. On September 20, 2022, Chinese State Councilor and Foreign Minister Wang Yi chaired the Ministerial Meeting of the Group of Friends of the GDI in New York. UN Secretary General António Guterres sent a video message. Cambodian Deputy Prime Minister & Foreign Minister Prak Sokhonn, Lao Deputy Prime Minister & Foreign Minister Saleumxay Kommasith, Thai Deputy Prime Minister & Foreign Minister Don Pramudwinai, Ethiopian Deputy Prime Minister & Foreign Minister Demeke Mekonnen Hassen, along with foreign ministers of nearly 40 countries including Mongolia, Malaysia, Sri Lanka, Uzbekistan, Tajikistan, Saudi Arabia, Egypt, Algeria, Morocco, Tunisia, Nigeria, Sierra Leone, Zimbabwe, and Nicaragua, Permanent Representatives of the Group members to the United Nations, and representatives of international organizations such as the United Nations Development Programme, the Food and Agriculture Organization of the United Nations, the International Organization for Migration, and the International Renewable Energy Agency, were present. Secretary-General Guterres said in his remarks that the holistic Global Development Initiative is a valued contribution to addressing common challenges and accelerating the transition to a more sustainable and inclusive future. At the meeting, China briefed positive outcomes of its implementation of the Global Development Initiative, put forward three suggestions for forming synergy of the international community to advance the GDI, and expressed willingness to strengthen strategic synergy with UN development agencies and work with members of the Group of Friends to take seven additional measures to implement the 2030 Agenda. A press statement was issued following the meeting. ==References== Category:China Category:Development",
 "title": "Global Development Initiative"
}