{
 "id": "969589",
 "text": "The Conservative Party leadership election in October 2022 determined Liz Truss's successor as Leader of the Conservative Party and Prime Minister of the United Kingdom following her resignation on October 20, 2022. By the end of October 24, the two favorites were Penny Mordaunt and Rishi Sunak. After Mordaunt dropped out of the election, Sunak became the leader on the same day, at 2pm. ==Background== ===July 2022 Conservative Party leadership election=== Eleven candidates put forward for the July 2022 party leadership election. Eight people were fully nominated by Conservative MPs: Kemi Badenoch, Suella Braverman, Jeremy Hunt, Penny Mordaunt, Rishi Sunak, Liz Truss, Tom Tugendhat and Nadhim Zahawi. After five rounds of voting, MPs chose Sunak and Truss to nominate party members to vote. Truss was elected by members on September 5 with 57.4 percent of the vote. ===Economic policies=== Truss appointed Kwasi Kwarteng as Chancellor of the Exchequer. In September 2022, he announced a small budget with tax cuts and spending increases. What followed was a sharp fall in the value of the pound. This drew widespread criticism. Truss and Kwarteng defended the budget for more than a week before they started announcing the repeal of the most controversial measures: The removal of the 45% income tax rate for the top earners; and the removal of the planned corporate income tax freeze. === Government crisis === On October 14, 2022, Truss replaced Kwarteng with Jeremy Hunt. On October 19, Suella Braverman resigned as Home Secretary. There were allegations of manhandling, bullying, physical intimidation at a vote on Labour's motion to ban fracking that night. On October 20, 2022, Liz Truss met with the Chairman of the 1922 Committee Sir Graham Brady and Chairman of the Conservative Party Sir Jake Berry before announcing her resignation. == Election details == On October 20 Truss wrote in her resignation letter that the election would be completed \"within the next week.\" Sir Graham Brady instituted a fast procedure. ===Qualification=== Deadline for nominations was 2:00pm, October 24, 2022. Candidates needed support from at least 100 members of Congress by the deadline. == Candidates == === Declared === Candidate Political office and constituency Date declared Previous Leadership Election (July–September 2022) Chancellor of the Exchequer MP for Richmond 23 October 2022 Second, in the runoff on 5 September 2022 === Withdrawn === The following Conservative MP declared her intention to stand for leadership but subsequently withdrew from the race: Candidate Political office and constituency Date declared Date withdrew Ref. Leader of the House of Commons MP for Portsmouth North 21 October 2022 24 October 2022 === Explored === The following Conservative MP explored a possible candidacy but declined to stand. Candidate Political office and constituency Date declined Ref. Prime Minister of the United Kingdom MP for Uxbridge and South Ruislip 23 October 2022 === Declined === Commentators suggested the following Conservative Party politicians as candidates, who declined to stand: * Michael Gove, former Secretary of State for Levelling Up, Housing and Communities (September 2021–July 2022), MP for Surrey Heath (2005–present) * Jeremy Hunt, Chancellor of the Exchequer (since October 2022), MP for South West Surrey (2005–present) *Theresa May, former Prime Minister of the United Kingdom (July 2016–July 2019), MP for Maidenhead (1997–present) * Tom Tugendhat, Minister of State for Security (since September 2022), MP for Tonbridge and Malling (2015–present) * Brandon Lewis, Secretary of State for Justice (since September 2022), MP for Great Yarmouth (2010–present) * Ben Wallace, Secretary of State for Defence (since July 2019), MP for Wyre and Preston North (2005–present) (suggested preference for Boris Johnson) * Grant Shapps, Home Secretary (since October 2022), MP for Welwyn Hatfield (2005–present) * James Cleverly, Foreign Secretary (since September 2022), MP for Braintree (2015–present) * Sajid Javid, former Chancellor of the Exchequer (July 2019–February 2020), MP for Bromsgrove (2010–present) (endorsed Rishi Sunak) * Kemi Badenoch, Secretary of State for International Trade (since September 2022), MP for Saffron Walden (2017–present) (endorsed Rishi Sunak) * Suella Braverman, former Home Secretary (September–October 2022), MP for Fareham (2015–present) (endorsed Rishi Sunak) ==Results== Penny Mordaunt dropped out of the election because she was unable to get the support of 100 MPs by the deadline of the election. This allowed Rishi Sunak to win the election unopposed, and became the Leader of the Conservative Party. ==References== Category:2022 in the United Kingdom Category:2022 elections in Europe Category:2020s elections in the United Kingdom Category:October 2022 events",
 "title": "October 2022 Conservative Party leadership election"
}