{
 "id": "969722",
 "text": "Anneke Staring (born 1942 or 1943 — October 2022) was a Dutch field hockey player who played as a defender. She played with HC Bloemendaal and was a member of the Netherlands women's national field hockey team. As captain of the Dutch team she became world champion at the inaugural unofficial 1971 Women's Hockey World Cup. ==Biography== ===International career=== Staring made 42 appearances for the Netherlands women's national field hockey team from 1966 to 1972. She made her debut on 7 May 1966 in a match against Germany. They won the match with 0-1. The team played ahead of the 1971 Women's Hockey World Cup a number of preparation matches. During this preparation matches the Dutch team beated for the first time England. Staring was the captain of the team at the first unofficial 1971 Women's World Cup in Auckland, New Zealand. In the preliminary round they won from Ireland and Fiji and played 2-2 against the United States. In the final round they played two matches and The Netherlands finished second behind the Indian team in the preliminary round and defeated the Germans 1-0 in the semi-finals. The Netherlands team won from Australia (3-0), played 1-1 against England and 0-0 against West-Germany. These results were enough to win the unofficial World Cup. As captain of the team, Staring was awarded the cup. She played her last international match against Argentina 1972. ===Post playing career=== After her playing career Staring was from 1972 to 1977 commissioner of the Board of the field hockey district North Holland. In 1976 and 1977 she was also a member (commissioner) of the Board of Directors of the national hockey federation (KNHB). In 1974 the KNHB appointed Staring as Member of Merit for all her works for the field hockey sport. Staring died in October 2022. ==References== Category:1940 births Category:2022 deaths Category:Place of death missing Category:Dutch field hockey players Category:Sportswomen",
 "title": "Anneke Staring"
}