{
 "id": "969721",
 "text": "Justin Scott Hartley is an American actor. He is known for his television roles that include Fox Crane on the NBC. ==Filmography== Film roles Year Title Role Notes 2005 Race You to the Bottom Joe 2008 Red Canyon Tom 2009 Spring Breakdown Todd 2009 Ted Rawlings 2010 Scorpio Men on Prozac Bill King 2015 James 2017 A Bad Moms Christmas Ty Swindle 2018 Another Time Eric Laziter also executive producer 2019 Little Mr. Marshall 2019 Jexi Brody 2020 The Hunt Trucker Uncredited 2021 The Exchange Gary Rothbauer 2021 Injustice Kal- El / Clark Kent / Superman Voice role 2022 Senior Year Blaine Television roles Year Title Role Notes 2002–2006 Passions Nicholas Foxworth 'Fox' Crane Series regular 2006 Aquaman Arthur 'A.C.' Curry Unsold television pilot 2006–2011 Smallville Oliver Queen / Green Arrow Recurring role (seasons 6–7); main role (seasons 8–10); 72 episodes Also director (\"Dominion\"); writer (\"Sacrifice\") 2007 CSI: NY Elliott Bevins Episode: \"Heart of Glass\" 2007 Cold Case Mike Delaney (1982) Episode: \"Justice\" 2008 Gemini Division Nick Korda Web series, 12 episodes 2009 MegaFault Dan Lane Television film 2011 Chuck Wesley Sneijder Episode: \"Chuck Versus the Bearded Bandit\" 2012 Castle Reggie Starr Episode: \"An Embarrassment of Bitches\" 2012 Hart of Dixie Jesse Kinsella Episode: \"Bachelorettes & Bullets\" 2012–2013 Emily Owens, M.D. Will Collins Main role 2013 Melissa & Joey Noah Butler Episode: \"Fast Times\" 2013–2014 Revenge Patrick Osbourne Recurring role (season 3), 13 episodes 2014–2016 Mistresses Scott Trosman Recurring role (seasons 2–4) 2014–2016 The Young and the Restless Adam Newman Series regular 2016–2022 This Is Us Kevin Pearson Main role, occasional director 2019 Jane the Virgin Himself Episode: \"Chapter Eighty-Nine\" 2020 Robot Chicken Ice Road Trucker Voice role; episode: \"Sundancer Craig in: 30% of the Way to Crying\" 2022 Family Guy Jamie, Jamie's Twin Brother Voice role; Episode: \"Girlfriend, Eh?\" 2022 Quantum Leap Jake Episode: \"A Decent Proposal\" ==References== Category:Living people Category:1977 births Category:American television actors Category:American movie actors Category:Actors from Illinois",
 "title": "Justin Hartley"
}