{
 "id": "969755",
 "text": "In September and October 2022, the government of the United Kingdom, led by the Conservative party and the newly-appointed prime minister Liz Truss, went through an energy, economic and political crisis. ==Budget and economic crises== The crisis began after the 23 September 2022 United Kingdom mini- budget, which had many critics and negative responses by the world financial markets. This caused Truss to fire Chancellor of the Exchequer, Kwasi Kwarteng, on 14 October. In the next days Truss had many pressures to continue reversing many of her economic policies and by 17 October five Conservative Members of Parliament had called for her resignation. Many world leaders such as U.S. President Joe Biden criticized Truss's economic policies. Overall, her economic policies caused the pound to fall to a record low against the US dollar and there was an increase in the cost of government borrowing. ==Political crises== On 19 October Suella Braverman, the home secretary, resigned over a technical breach of the Ministerial Code. Braverman's resignation letter was very critical of Truss. Later that day, MPs voted on a Labour Party motion to create time to debate a ban on fracking in the United Kingdom. The vote caused confusion among Conservative MPs who were not clear if it was a confidence vote. On 17 and 20 October, Truss had meetings with Graham Brady, the chair of the 1922 Committee. The meeting on 17 October caused Truss to miss an emergency Prime Minister's Questions, in which Penny Mordaunt, answered on Truss's behalf. Truss not going to the debate was criticized by many politicians. ==Truss's resignation== On 20 October Truss announced that she would resign, but remain in office until the Conservative Party had chosen her replacement. She is the shortest serving Prime Minister in history. The leadership election was held shortly after with Rishi Sunak elected to replace her on 24 October 2022. ==Lettuce comparison== On 11 October, The Economist published an article criticising Truss and said that she had seven days in control of the economy. They wrote: \"That is roughly the shelf-life of a lettuce.\" Since then, many commentators were comparing Truss's time as prime minister to lettuce. On 14 October, the Daily Star began a live stream on YouTube of a lettuce dressed as Truss to see if it would rot before the Prime Minister resigned, which it did not. ==References== Category:September 2022 events Category:October 2022 events Category:2022 in the United Kingdom",
 "title": "October 2022 United Kingdom government crisis"
}