{
 "id": "969824",
 "text": "Richard Treat Williams (December 1, 1951 – June 12, 2023) was an American actor, writer and aviator. He has appeared on movie, stage and television in over 120 credits.\"The Doctor Is In - Again\". The Washington Post. 17 June 2007. (TV Week, p. 5). He first became well known for his starring role in the 1979 musical film Hair. == Filmography == ===Theatrical releases=== Year Title Role Notes 1975 Deadly Hero Billings 1976 Michael Brick Marathon Man Central Park Jogger Uncredited Captain Harry Clark 1979 Hair George Berger Nominated: Golden Globe Award for New Star of the Year – Actor 1941 Corporal Chuck 'Stretch' Sitarski 1980 The Empire Strikes Back Echo Base Trooper Uncredited Why Would I Lie? Cletus 1981 Prince of the City Daniel Ciello Nominated: Golden Globe Award for Best Actor – Motion Picture Drama D.B. Cooper 1983 Neapolitan Sting Ferdinando 1984 Once Upon a Time in America James Conway O'Donnell Flashpoint Ernie Wyatt 1985 Smooth Talk Arnold Friend Nominated: Independent Spirit Award for Best Male Lead 1986 Terry 1988 Sweet Lies Peter Night of the Sharks David Ziegler The Third Solution Mark Hendrix Dead Heat Detective Roger Mortis 1989 Heart of Dixie Hoyt Cunningham 1990 Beyond the Ocean Christopher 1993 Where the Rivers Flow North Champ's Manager 1994 Hand Gun George McCallister 1994 Texan Man In Chinos Short film; also director Chicago International Film Festival Award for Best Short 1995 Things to Do in Denver When You're Dead Bill 'Critical Bill' 1996 Mulholland Falls Colonel Nathan Fitzgerald Xander Drax 1997 Billy Burke 1998 Deep Rising John Finnegan The Substitute 2: School's Out Karl Thomasson 1999 The Deep End of the Ocean Pat Cappadora The Substitute 3: Winner Takes All Karl Thomasson 2000 Critical Mass Mike Jeffers 2001 Jason Ross Skeletons in the Closet Will The Substitute: Failure Is Not an Option Karl Thomasson Venomous Dr. David Henning 2002 Gale Force Sam Garrett Hollywood Ending Hal Spencer Runcie 2005 Miss Congeniality 2: Armed and Fabulous FBI Assistant Director Walter Collins 2007 Moola Luis Gordon The Hideout Father Amy 2008 What Happens in Vegas Jack Fuller Sr. 2010 Maskerade Mr. Tucker Howl Mark Schorer 127 Hours Larry Ralston Martino's Summer Captain Jeff Clark 2011 Jack Corbett Oba: The Last Samurai Colonel Wessinger 2012 Attack of the 50 Foot Cheerleader Dr. Grey Deadfall Sheriff Marshall T. Becker 2013 In the Blood Robert Grant Reaching for the Moon Robert Lowell 2014 Barefoot Mr. Wheeler Operation Rogue General Hank Wallace 2016 The Congressman Charlie Winship 2017 The Etruscan Smile Frank 2018 Second Act Anderson Clarke 2019 The Great Alaskan Race Dr. Welch Drunk Parents Dan Henderson 2020 Run Hide Fight Sheriff Tarsy Dolly Parton's Christmas on the Square Carl 2021 12 Mighty Orphans Amon Carter TBA The Dougherty Gang Jameison R. Donovan Post-production 2022 The Noel Diary ===Television series=== Year Title Role Notes 1985 American Playhouse Hudley T. Singleton III Episode: \"Some Men Need Help\" 1987 Faerie Tale Theatre Prince Andrew Episode: \"The Little Mermaid\" Echoes in the Darkness Rick Guida 2 episodes 1990 Drug Wars: The Camarena Story Ray Carson 3 episodes 1991 Eddie Dodd Eddie Dodd Main cast; Season 1 1992 Tales from the Crypt Howard Prince Episode: \"None But the Lonely Heart\" Batman: The Animated Series Dr. Achilles Milo (voice) 2 episodes 1993 Road to Avonlea Zak Morgan Episode: \"Moving On\" 1993–94 Good Advice Jack Harold Main cast; Season 1-2 1999 Journey to the Center of the Earth Theodore Lytton 2 episodes 2002 UC: Undercover Teddy Collins Episode: \"Teddy C\" Going to California Officer Terrence 'Terry' Miller Episode: \"The West Texas Round- up and Other Assorted Misdemeanors\" 2002–06 Everwood Dr. Andrew 'Andy' Brown Main cast; Seasons 1-4 Nominated—Satellite Award for Best Actor – Television Series Drama Nominated—SAG Award for Outstanding Performance by a Male Actor in a Drama Series (2003–04) Nominated—Teen Choice Award for Choice TV Parental Unit 2006 Brothers & Sisters David Morton 3 episodes 2007 Heartland Dr. Nathaniel \"Nate\" Grant Main cast; Season 1 2009 The Storm Robert Terrell 2 episodes 2011 Against the Wall Don Kowalski Main cast; Season 1 Law & Order: Special Victims Unit Jake Stanton Episode: \"Spiraling Down\" 2012 Leverage Pete Rising Episode: \"The Blue Line Job\" The Simpsons Himself/William Sullivan (voice) Episode: \"A Totally Fun Thing That Bart Will Never Do Again\" 2012–13 White Collar Samuel Phelps/James Bennett Recurring role; Season 4 2013–18 Chicago Fire Benny Severide Recurring role; 16 episodes (seasons 1-7) 2013 Eve of Destruction Max Salinger 2 episodes Hawaii Five-0 Mick Logan 2 episodes 2014 CSI: Crime Scene Investigation Sam Episode: \"Dead in His Tracks\" 2015 American Odyssey Col. Stephen Glen Main cast; Season 1 2016–22 Chesapeake Shores Mick O'Brien Main cast 2016–21 Blue Bloods Lenny Ross Recurring role; 5 episodes (season 6-12) 2022 We Own This City Brian Grabler === Television films === Year Title Role Notes 1983 Dempsey Jack Dempsey 1984 A Streetcar Named Desire Stanley Kowalski Nominated - Golden Globe Award for Best Actor – Miniseries or Television Film 1987 J. Edgar Hoover J. Edgar Hoover 1989 Third Degree Burn Scott Weston 1990 Max and Helen Max Rosenberg 1991 Final Verdict Earl Rogers 1992 Till Death Us Do Part Alan Palliko The Water Engine Dave Murray Deadly Matrimony Alan Masters 1993 Bonds of Love Robby Smith 1994 Parallel Lives Peter Barnum 1995 In the Shadow of Evil Jack Brenner Johnny's Girl Johnny 1996 The Late Shift Michael Ovitz Nominated - Primetime Emmy Award for Outstanding Supporting Actor in a Miniseries or a Movie Nominated - Satellite Award for Best Supporting Actor – Series, Miniseries or Television Film 1998 Escape: Human Cargo John McDonald Every Mother's Worst Fear Mitch Carson 1999 36 Hours to Die Noah Stone 2000 Hopewell David Jonas 2002 Guilty Hearts Stephen Carrow 2007 The Staircase Murders Michael Peterson 2008 Good Behavior Burt Valencia Front of the Class Norman Cohen 2009 Safe Harbor Doug Chasing a Dream Gary Stiles 2010 Boston's Finest Jack Holt 2011 Beyond the Blackboard Dr. Warren 2013 Age of Dinosaurs Gabe 2016 Confirmation Ted Kennedy 2020 The Christmas House Bill Hallmark Channel 2021 The Christmas House 2: Deck Those Halls Bill Hallmark Channel ==References== ==Other websites== * Category:1951 births Category:2023 deaths Category:American movie actors Category:American stage actors Category:American television actors",
 "title": "Treat Williams"
}