{
 "id": "970039",
 "text": "\"Believer\" is a song by American pop rock band Imagine Dragons. The song was released on February 1, 2017, through Interscope Records and Kidinakorner. It was the lead single from the band's third studio album, Evolve (2017). It was written by Dan Reynolds, Wayne Sermon, Ben McKee, Daniel Platzman, Justin Tranter and its producers Mattman & Robin. \"Believer\" peaked at number four on the US Billboard Hot 100. It became the band's third top ten single after \"Radioactive\" and \"Demons\". It also reached the top ten in Austria, Canada, Czechia, France, Italy, Poland, Portugal, and Switzerland. The song had a large boost in popularity after it was used in the season finale for the first season of the CW's Riverdale. The song was played often in advertisements, like for the Nintendo Switch Super Bowl LI advertisement, and several movie and television trailers. It became the fifth best-selling song of 2017 in the United States and one of the best-selling singles of all time. On January 8, 2019, another version of the song was released, featuring American rapper, Lil Wayne. == Background == In March 2017, Dan Reynolds told People that the song was inspired by his experiences with ankylosing spondylitis in 2015. He said that, \"The meaning of the song is really reflecting on specific things in my life that were painful, whether it was anxiety and dealing with crowds, feeling overwhelmed by that or the success of the band, disease, going through depression—anything that was a source of pain in my life. And just rising above that, finding a place of perspective where I could be appreciative of the pain in my life and make it my greatest strength.\" == Music video == The official music video for the song was released on March 7, 2017, on the Imagine Dragons Vevo account, and was directed by Matt Eastin. It features a boxing match between Reynolds and Dolph Lundgren, with some scenes showing what seems to be a young Dan drawing on his notepad in scenes. Dan is losing, and he says that he wants to stop, but Dolph replies \"We can't.\" It ends with Reynolds barely conscious, while Young Dan is revealed to have sketched a symbol identical to the one on Reynolds' chest, the \"Evolve\" symbol. As of 2022, the video has over 2 billion views and over 20 million likes. It is currently the most-viewed and most-liked video on the band's YouTube channel. It is also the 21st most-liked video on the platform. == Commercial performance == \"Believer\" reached number four on the Billboard Hot 100. It was at the top of the Billboard Hot Rock Songs (29 weeks), Alternative Songs (13 weeks), and Adult Pop Songs (6 weeks). Among component charts, it was also at the top of Rock Airplay, Rock Streaming Songs, Rock Digital Sale Songs, and Top TV Commercials Charts. It was also at the top of the Canada Alternative Rock Chart. \"Believer\" broke the 14-year-old record for the most spins on the Mediabase Alternative chart. \"Believer\" has reached the top ten in Austria, Canada, Czech Republic, France, Hungary, Italy, Poland, Portugal, Slovakia, Switzerland, and the United States. \"Believer\" was the number one song on several Billboard year-end charts, including the Hot Rock Songs chart, the Rock Airplay chart, and the Alternative Songs chart. The song was the fifth best-selling song of 2017 in the United States, selling 1,598,000 copies in the year. == Live performances == The first televised performance of \"Believer\" was during the March 22, 2017 episode of ABC late-night talk show Jimmy Kimmel Live!. They then performed the song at BBC Radio 1's Big Weekend. \"Believer\" was performed again during the 2019 College Football Playoff National Championship halftime show. Grammy Award-winning singer Michelle Williams performed the song on the second US series of The Masked Singer. == Track listing == == Charts == ===Weekly charts=== Chart (2017–2018) Peak position France (SNEP) 7 Mexico Airplay (Billboard) 28 Philippines (Philippine Hot 100) 89 Romania (Airplay 100) 28 Chart (2021) Peak position India (IMI) 18 ===Year-end charts=== Chart (2017) Position Australia (ARIA) 72 Austria (Ö3 Austria Top 40) 8 Belgium (Ultratop Flanders) 71 Belgium (Ultratop Wallonia) 63 Canada (Canadian Hot 100) 12 Denmark (Tracklisten) 89 France (SNEP) 30 Germany (Official German Charts) 37 Hungary (Single Top 40) 13 Hungary (Stream Top 40) 3 Iceland (Plötutíðindi) 15 Italy (FIMI) 10 Netherlands (Single Top 100) 70 New Zealand (Recorded Music NZ) 36 Poland (ZPAV) 63 Portugal (AFP) 9 Romania (Airplay 100) 95 Russia (Tophit) 61 Sweden (Sverigetopplistan) 47 Switzerland (Schweizer Hitparade) 9 UK Singles (OCC) 97 US Billboard Hot 100 9 US Adult Contemporary (Billboard) 33 US Adult Top 40 (Billboard) 3 US Dance/Mix Show Airplay (Billboard) 37 US Hot Rock & Alternative Songs (Billboard) 1 US Mainstream Top 40 (Billboard) 15 US Rock Airplay (Billboard) 1 Chart (2018) Position Australia (ARIA) 99 CIS (Tophit) 23 France (SNEP) 128 Hungary (Single Top 40) 34 Portugal (AFP) 84 US Billboard Hot 100 100 US Adult Contemporary (Billboard) 22 US Hot Rock & Alternative Songs (Billboard) 3 Chart (2019) Position Hungary (Single Top 40) 97 Portugal (AFP) 121 South Korea (Gaon) 85 US Rolling Stone Top 100 82 Chart (2021) Position France (SNEP) 174 Global 200 (Billboard) 53 Hungary (Single Top 40) 89 US Hot Rock & Alternative Songs (Billboard) 81 ===Decade-end charts=== Chart (2010–2019) Position US Hot Rock Songs (Billboard) 1 == Certifications and sales == == Notable usage in media == * The instrumental version of Believer used in the American film The 15:17 to Paris by Clint Eastwood. * The song was used in a Nintendo Switch commercial shown during Super Bowl LI. * The song appeared in the trailer for the 2017 film Murder on the Orient Express where its usage was met with mixed response. * The song appeared on the CW series Riverdale. * The song appeared on the Netflix series Lucifer in the opening scene of Season 05 Episode 11, \"Resting Devil Face\". * The song is in the dance rhythm game Just Dance 2022. * The song appears in a 2021 advert for the Samsung Galaxy Z Fold 3 and Z Flip 3. * In 2022, The song appeared in commercials for 2K Sports' WWE brand video game, WWE 2K22 == Notes == == References == == Other websites == * Category:2016 songs Category:Imagine Dragons songs Category:Pop rock songs",
 "title": "Believer (Imagine Dragons song)"
}