{
 "id": "970041",
 "text": "\"Natural\" is a song by American pop rock band Imagine Dragons. Its members co- wrote the song with Justin Tranter, Klinsmann Lucas S. Bernardo and their producers Mattman & Robin. It was released by Kidinakorner and Interscope Records on July 17, 2018. It was the lead single from the band's fourth studio album, Origins (2018), as well as the seasonal anthem of the 2018 ESPN College Football. It became their fifth number one song on the US Hot Rock Songs chart. == Background == Lead singer Dan Reynolds said that \"Natural\" is about \"finding yourself and being willing and able to stand up to whatever adversity comes your way\". He said in a press release announcing the song: \"Living in a dog-eat-dog world can bring out the worst in you, and sometimes, the best. It would be a lie to tell you I haven't become somewhat skeptical about some things in the last decade of my life. However, I believe that when you truly learn to love yourself, the judging eyes and hateful words become meaningless.\" The song was chosen by ESPN as the anthem of the 2018 College Football season. It is the second time that an Imagine Dragons song was chosen, the first being \"Roots\" in 2015. \"'Natural' has the energy, spirit and drama of each team's journey to the College Football Playoff, and that is why it was chosen as this year's anthem,\" said Emeka Ofodile, ESPN vice president of sports marketing. It is also part of the soundtrack for EA Sports' NHL 19. == Composition == \"Natural\" is a pop rock song which features a \"mix of explosive drums and inspiring lyrics\", with \"stadium-rocking instrumentation\" over the chorus. == Music video == A music video for the song was released on August 24, 2018. It shows frontman Dan Reynolds as the owner of a spooky house including shots of a woman in a bathtub, the same woman being chased by other inhabitants of the house and a very tall man that looks like Slenderman, a supposed funeral for the woman, Wayne Sermon, Ben McKee and Daniel Platzman fading into dust, Reynolds digging a grave and burying the woman alive, and other shots of the house and its inhabitants, along with a clip of a lion mauling a zebra. Its music video has gotten over 410 million views and 4 million likes as of March 2021. == Live performances == On July 19, 2018, Imagine Dragons made a live television debut of the single on Jimmy Kimmel Live!. The performance featured a guitar solo by lead guitarist Wayne Sermon that expanded on the studio recording. == Personnel == Credits adapted from Tidal. * Mattman & Robin – production, engineering * Serban Ghenea – mixing == Charts == ===Weekly charts=== Chart (2018–2019) Peak position Argentina (Argentina Hot 100) 96 Bolivia (Monitor Latino) 10 Croatia (HRT) 19 Estonia (Eesti Tipp-40) 33 Greece (IFPI) 22 Puerto Rico (Monitor Latino) 19 Romania (Airplay 100) 50 Slovenia (SloTop50) 8 South Korea International (Gaon) 87 ===Year-end charts=== Chart (2018) Position Austria (Ö3 Austria Top 40) 52 Belgium (Ultratop Flanders) 40 Canada (Canadian Hot 100) 89 CIS (Tophit) 54 Hungary (Single Top 40) 30 Iceland (Plötutíóindi) 83 Netherlands (Dutch Top 40) 18 Netherlands (Single Top 100) 64 Poland (ZPAV) 31 Portugal (AFP) 46 Russia (Tophit) 69 Switzerland (Schweizer Hitparade) 24 US Billboard Hot 100 69 US Adult Top 40 (Billboard) 25 US Hot Rock Songs (Billboard) 5 US Mainstream Top 40 (Billboard) 50 US Rock Airplay (Billboard) 5 Chart (2019) Position CIS (Tophit) 18 France (SNEP) 136 Hungary (Single Top 40) 78 Portugal (AFP) 103 Russia Airplay (Tophit) 39 Slovenia (SloTop50) 36 Switzerland (Schweizer Hitparade) 67 Ukraine Airplay (Tophit) 5 US Adult Top 40 (Billboard) 35 US Hot Rock Songs (Billboard) 3 US Rock Airplay (Billboard) 10 ===Decade-end charts=== Chart (2010–2019) Position US Hot Rock Songs (Billboard) 13 == Certifications == == Release history == Region Date Format Label Various July 17, 2018 United States July 31, 2018 Alternative radio August 28, 2018 Contemporary hit radio == References == == Other websites == * Category:2018 songs Category:Imagine Dragons songs Category:Pop rock songs",
 "title": "Natural (Imagine Dragons song)"
}