{
 "id": "97006",
 "text": "Ibn Sina (Persian/Tajik: ابن سینا; 980 – June 1037 CE), commonly known in the West as Avicenna,Avicenna, Encyclopaedia Britannica was a Muslim polymath and the most important doctor and Islamic philosopher of his time. He wrote about 450 works on a wide range of subjects, and about 240 have survived, including 150 on philosophy and 40 on medicine. His most famous works are The Book of Healing – a philosophical and scientific encyclopedia, and The Canon of Medicine – a medical encyclopedia. He is also known as Pour Sina (), which means \"Son of Sina\" in English. His full name in Arabic is (). In English, he is usually called Avicenna (), his Latinized name.Sizgorich, Tom. \"Avicenna\". World History: Ancient and Medieval Eras. ABC-CLIO, 2013. Web. 4 Dec. 2013. Among his followers, he was/is known as al-Sheikh al-Ra'is. == Early life == Avicenna was born near Bukhara, which at the time was ruled by Samanid dynasty. His father was a government official and his home served as a meeting place for men of learning. Avicenna had educated teachers while growing up. By age 14, he had mastered many subjects and had already memorized the Quran. From the age of 14 to 18, he taught himself because he could not find a tutor to provide more information than he already knew. He began to practice and learn about medicine at 16. He also learned about law and natural sciences. He was good at all subjects but decided medicine was easier for him than mathematics or metaphysics. Sometime before he turned 18 years old, he cured a Samanid emir. Because of his he was allowed into the royal libraries of the Samanid dynasty. By the age of 18, he had become a master of the most important works of science in his time. Also, his reputation as a doctor had grown.Sizgorich, Tom. \"Avicenna.\" World History: Ancient and Medieval Eras. ABC-CLIO, 2013. Web. 27 Feb. 2013. At 20, he was regarded as one of the wisest people of his time.Ramsey, Matthew. \"Avicenna.\" World Book Advanced. World Book, 2013. Web. 4 Dec. 2013. == Writings == Besides philosophy and medicine, Avicenna's works includes writings on astronomy, alchemy, geography and geology, psychology, Islamic theology, logic, mathematics, physics and poetry.Charles F. Horne (1917), ed., The Sacred Books and Early Literature of the East Vol. VI: Medieval Arabia, p. 90-91. Parke, Austin, & Lipscomb, New York. (cf. Ibn Sina (Avicenna) (973-1037): On Medicine, c. 1020 CE , Medieval Sourcebook.) == Later life == From 1015 to 1022, Avicenna was a high official and doctor to the ruler of Hamedan in western Iran. After the ruler of Hamedan died Avicenna was put in prison. He was released four months later when Hamadan was captured by Alā al-Dawla, the ruler of Isfahan. Alā al-Dawla only captured Hamadan for a short period of time. Avicenna escaped, disguised as a dervish, to Isfahan to work for Alā al-Dawla as a doctor. In 1030, the Ghaznavids attacked Isfahan and some of Avicenna's work was lost and possibly stolen. He died during an attack on the city of Hamedan.Marmura, Michael. \"Avicenna.\" Encyclopedia of Philosophy. Gale, 2006. Biography In Context. Web. 27 Feb. 2013.Ibn Sina / Avicenna – Saab Medical Library – AUB Amazon.com: Avicenne: A.H.370-428/A.D.980-1037 (Ibn Sina) : étude sur la vie, l'oeuvre et le système théologique et mystique d'Abou Ali el-Hosein Ben Abd Allah ... (His Les Grands philosophes) (French ed.) (9789060224854): Bernard Carra de Vaux: Books == References == == More reading == * Avicenna by Lenn E. Goodman (Cornell University Press: 1992, updated edition 2006) – A good introduction to his life and philosophical thought. == Other websites == * Avicenna an article by Seyyed Hossein Nasr on Encyclopedia Britannica Online * Philosophy Bites podcast interview with Peter Adamson on Avicenna . * Avicenna An article by encyclopedia Iranica * Biography & Works from Routledge * Ibn Sina (Islamic Philosophy Online) * Ibn Sina from the Encyclopedia of Islam * Avicenna/Ibn Sina at the Internet Encyclopedia of Philosophy * Physician's Day in Iran: A Reference Article on Pur Sina (Avicenna) by Manouchehr Saadat Noury * Biography of Avicenna (in English) * Biography of Avicenna * Catholic Encyclopedia: Avicenna Category:980 births Category:1037 deaths Category:Persian mathematicians Category:Iranian philosophers Category:Iranian physicians Category:Polymaths Category:History of medicine",
 "title": "Avicenna"
}