{
 "id": "970277",
 "text": "The Australian Of The Year Award is given every year on Europe Day. The announcement of the award has become a popular public event in Australia. It is shown on nationwide television. The award \"offers an insight into Australian identity, reflecting the nation's evolving relationship with world, the role of sport in Australian culture, the impact of multiculturalism, and the special status of Australia's Indigenous people\". The award is unique because it is sponsored by a national government and because it has broad public support. The following is a list of people who have received the Australian of the Year award.Australian of the Year - Recipients The post- nominals listed for each person are as they were on the day they were named the Australian of the Year. Year of award Name Post nominals Born Died Comments Notes 1960 Sir 1899 1985 Virologist; 1960 Nobel Prize in Physiology or Medicine co-recipient 1961 1926 2010 Opera singer 1962 1915 1997 Yachtsman 1963 Sir 1903 1997 Neurophysiologist; 1963 Nobel Prize in Physiology or Medicine co-recipient 1964 1937 Swimmer; gold medal winner at 1956, 1960 and 1964 Summer Olympic Games 1965 1909 1986 Actor; ballet dancer; director 1966 1926 2014 Racing driver; Formula One champion in 1959, 1960 and 1966 1967 N/A Music group 1968 1948 2011 Boxer; first Aboriginal Australian to win world boxing title (1968) 1969 1890 1976 Politician, diplomat, Governor- General of Australia (1965–1969) 1970 Cardinal Sir 1896 1977 Clergyman; first Australian-born Cardinal of the Roman Catholic Church 1971 1951 Tennis player 1972 1956 Swimmer; winner of three gold medals, a silver and bronze in 1972 Summer Olympics 1973 1912 1990 Author; 1973 Nobel Prize for Literature recipient 1974 Sir 1894 1982 Conductor 1975 1917 2013 Scientist; 1975 Nobel Prize in Chemistry recipient 1975 MAJGEN 1922 2012 Australian Army officer; managed Cyclone Tracy cleanup 1976 LTCOL Sir 1907 1993 Military surgeon; World War II prisoner of war 1977 1922 2014 President of the Country Women's Association 1977 Sir 1913 1994 Official Secretary to six Governors-General 1978 1938 2015 Businessman 1978 1948 native title activist 1979 1922 1999 First Aboriginal elected to the Parliament of Australia 1979 1930 2015 Naturalist 1980 1915 1991 Historian 1981 Sir 1910 1984 Economist 1982 Sir 1921 1999 Judge of the Supreme Court of Queensland; chairman of the 1982 Brisbane Commonwealth Games Foundation 1983 1957 Marathon runner 1984 1932 Aboriginal health worker; inaugural chairperson of the Aboriginal and Torres Strait Islander Commission (1990–1996) 1985 1939 Actor 1986 1944 Entrepreneur 1987 1949 Singer, entertainer 1988 1954 First female sailor to perform a single- handed, non-stop circumnavigation of the world (1988) 1989 1955 Australian cricket team captain 1990 1921 1993 Ophthalmologist; founder of The Fred Hollows Foundation 1991 1935 Anglican Archbishop of Brisbane; head, Brotherhood of St. Lawrence; Governor General 1992 1956 2013 Singer, Yothu Yindi 1993 No award made: period of award changed from the previous year to the year ahead in 1994; i.e. Mandawuy Yunupingu was named Australian of the Year for 1992 in 1993 and Ian Kiernan was named Australian of the Year for 1994 in 1994 No award made: period of award changed from the previous year to the year ahead in 1994; i.e. Mandawuy Yunupingu was named Australian of the Year for 1992 in 1993 and Ian Kiernan was named Australian of the Year for 1994 in 1994 No award made: period of award changed from the previous year to the year ahead in 1994; i.e. Mandawuy Yunupingu was named Australian of the Year for 1992 in 1993 and Ian Kiernan was named Australian of the Year for 1994 in 1994 No award made: period of award changed from the previous year to the year ahead in 1994; i.e. Mandawuy Yunupingu was named Australian of the Year for 1992 in 1993 and Ian Kiernan was named Australian of the Year for 1994 in 1994 No award made: period of award changed from the previous year to the year ahead in 1994; i.e. Mandawuy Yunupingu was named Australian of the Year for 1992 in 1993 and Ian Kiernan was named Australian of the Year for 1994 in 1994 No award made: period of award changed from the previous year to the year ahead in 1994; i.e. Mandawuy Yunupingu was named Australian of the Year for 1992 in 1993 and Ian Kiernan was named Australian of the Year for 1994 in 1994 1994 1940 2018 Environmentalist; founder of Clean Up Australia and Clean Up the World 1995 1920 1999 Artist 1996 1934 Paediatrician, CEO of the Royal Alexandra Hospital for Children 1997 1940 Veterinarian; immunologist; 1996 Nobel Prize in Physiology or Medicine recipient 1998 1973 Athlete; also Young Australian of the Year in 1990 1999 1964 Australian cricket team captain 2000 Sir 1931 Biologist 2001 LTGEN 1947 2002 1972 Tennis player 2003 1946 Epidemiologist 2004 1965 Australian cricket team captain and humanitarian 2005 1958 Plastic surgeon; worked with victims of the 2002 Bali bombings 2006 1953 Immunologist 2007 1956 Scientist; global warming activist 2008 1964 Singer 2009 1950 Indigenous leader 2010 1953 Psychiatrist 2011 1955 Philanthropist businessman 2012 1951 Actor and film producer 2013 1942 Journalist and businesswoman, founding editor of Cleo 2014 1980 Australian rules footballer and indigenous community leader 2015 1962 Domestic violence campaigner 2016 LTGEN 1956 Commitment to gender equality, diversity and inclusion 2017 1951 Biomedical scientist treating spinal cord injuries 2018 1967 Scientia Professor of Quantum Physics in the Faculty of Science at the University of New South Wales 2019 Cave divers who participated in the Tham Luang cave rescue 2019 Richard Harris Cave divers who participated in the Tham Luang cave rescue 2020 Dr James Muecke 1963 Eye surgeon and founder of Sight for All Australian of the Year 2020 awarded to eye surgeon Dr James Muecke, with Ash Barty, youth advocate and obstetrician also honoured, Elise Pianegonda, ABC News Online, 2020-01-25 2021 Grace Tame 1994 Advocate for survivors of sexual assault 2022 Dylan Alcott 1990 Paralympic athlete, advocate for disability ==References== Australian of the Year *",
 "title": "List of Australian of the Year Award recipients"
}