{
 "id": "970259",
 "text": "The Ingeniero Marcial Candioti Bridge, better known as the Santa Fe Suspension Bridge (), is a suspension bridge in the city of Santa Fe, Santa Fe Province, Argentina. It goes across the Setúbal lagoon. It connects the west coast of the lagoon to the east coast of the lagoon. It is also a symbol of the city of Santa Fe and a symbol of its people. It has a long history that includes an almost total collapse in 1983 and its restoration after twenty years. It was originally made to take water from the Colastiné neighborhood and to connect the city with the Universidad Nacional del Litoral and the El Pozo neighborhood, among other places. The bridge is now a tourist attraction. As a landmark and monument in Santa Fe, it is a meeting point for celebrations, social gatherings and festivities. It has inspired poets, artists, photographers and documentaries. == Collapse == After standing for 55 years, one of its pillars collapsed on September 28, 1983 because of a strong flood that had lasted several months. It was a surprise to everyone, and many photos and videos from the neighbors and journalists of that time show a slow fall. The east antenna collapsed at 4:35 p.m., keeping only half of the structure standing. The Santa Fe newspaper El Litoral published that day, “A goodbye that wants to be see you later\". Part of the bridge sank into the Setúbal lagoon and was recovered in 1984. The bridge was not rebuilt until 20 years later. The administration of the then governor José María Vernet was associated with the image of the fallen bridge. First, due to the interventions of man in the flood valley, caused by the occupation of the river land by buildings, and the mismanagement of dredging. Second, due to the scandal that produced the verification of irregularities in the sale of parts of the suspension bridge. The recovered material was taken to the city port, where it was left in the custody of the provincial government. Months later, that material was sold for scrap. ==Reconstruction== The reconstruction of the bridge was wanted by most of the people of Santa Fe, since it had always been a source of pride for the city. The works began in April 2000 by the company CCI Construcciones and an attempt was made to largely respect the original structure of the 1920s. This is clear, for example, in the inclusion of a pipe that does not fulfill any function, but that it did in its first construction. The bridge, once rebuilt, preserved the original elements, integrating them with the new ones and contrasting them, without breaking the visual unity of the work. This new bridge preserves the original west antenna, assembled in 1924. The new antenna was built in the city of Esperanza, by the Ferma company. It arrived in Santa Fe at the end of April 2001 and was assembled with a gigantic crane on July 6 of that year. It differs from the old antenna in that it lacks rivets, and its joints are made by welding. It reopened in September 2002. ==New lights for the bridge== On May 25, 2017, the work of the new lighting of the bridge was inaugurated, the sodium lamps were replaced by LED lighting integrated with Philips Color Kinetics technology, which allow 1,600,000 light possibilities, which required an investment of $23 million of Argentinian pesos. It has 320 artifacts in linear form and 104 devices and projectors to illuminate the towers, it also contains programmable controllers that allow lighting scenes to be generated. ==References== == Other websites == Category:Suspension bridges Category:Santa Fe, Argentina Category:Buildings and structures in Argentina",
 "title": "Puente Colgante de Santa Fe"
}