{
 "id": "970283",
 "text": "Dzerzhinsk () is a city in Nizhny Novgorod Oblast, Russia. It is on the Oka River. It is about east of Moscow and west of Nizhny Novgorod. Population: It was previously known as Rastyapino (until 1929). == History == It was first mentioned in 1606 as Rastyapino (). It is now named after Felix Dzerzhinsky. Dzerzhinsky was a Bolshevik leader who was the first leader of the Soviet Cheka (secret police). == Chemical weapons and other production == Dzerzhinsk is a large center of the Russian chemical production industry. In the past, the city was also one of Russia's main areas for the making of chemical weapons. Because of its strategic importance, the city was, until recently, officially closed to foreign visitors. The making of chemical weapons started in 1941. It was mainly focused on the making of lewisite and yperite (mustard gas). The factory producing these substances was named the Kaprolactam (or Caprolaktam) Organic Glass Factory. It also made prussic acid and phosgene. The making of chemical weapons at Dzerzhinsk stopped in 1965. Some materials were moved to storage areas. Lots of waste material was buried in dumps at the site of the factory. The yperite facility was destroyed in 1994. As of 1998, the lewisite production area was still not completely destroyed. , Dzerzhinsk had 38 large industrial enterprises, which export their goods worldwide. About one thousand types of chemical products are made in Dzerzhinsk. == Notable people == * Sergey Chigrakov, rock performer and songwriter * Aleksandr Demenshin, former Russian professional football player * Eduard Limonov, writer and politician * Natali, pop singer and songwriter * Irina Voronina, Playboy playmateIrina Voronina page on IMDB == Twin towns and sister cities == Dzerzhinsk is twinned with: * Bitterfeld-Wolfen, Germany (since 1996) * Grodno, Belarus (since 2005) * Druskininkai, Lithuania (since 2009) * Zelenodolsk, Russia (since 2011) == References == == Other websites == * * Official website of Dzerzhinsk * Dzerzhinsk Business Directory Category:Cities and towns in Nizhny Novgorod Oblast Category:1929 establishments in Europe",
 "title": "Dzerzhinsk, Russia"
}