{
 "id": "970581",
 "text": "Fluoroantimonic acid is a mixture of hydrogen fluoride and antimony pentafluoride. It is one of the strongest known acids. It is a liquid at 25 degrees Celsius at standard atmosphere (a specific pressure). This chemical is a superacid that can be more than 1016 times stronger than pure sulfuric acid, with pH generally dependent on the ratios of hydrogen fluoride and antimony pentafluoride. It is reported to have a pKa of -31.3. It is a highly volatile liquid at moist air, releasing irritating toxic fumes. Extreme care must be taken when handling and storing fluoroantimonic acid; it is more than corrosive enough to dissolve ordinarily corrosion-resistant materials, including glass. It is generally stored in PTFE-coated (commonly known as Teflon) containers, as only the fluoride-carbon bonds in PTFE are strong enough to resist protonation from fluoroantimonic acid. Extreme corrosion is not the only hazard as it is highly unstable, oxidizing, poisonous and irritating. Overall hazards are corrosion, irritation, oxidizing hazard, toxicity, health hazard, environmental hazard and potential explosiveness due to moisture. == Properties == === Acidity === Fluoroantimonic acid is often rated as around 1016 times stronger than pure sulfuric acid, giving it one of the highest known acidities. === pH === This acid is so strong that it doesn't have a measurable pH value in the traditional sense, as it readily donates protons in virtually any environment. Hammett acidity function (H0) is the proper unit for measuring superacids stronger than Sulfuric acid (H0: -12). Fluoroantimonic acid's H0 is about -28 or more negative than that. === Protonation Power === Fluoroantimonic acid can protonate even weak bases and hydrocarbons, which are typically non-reactive to most other acids. === Reactivity === Its extreme reactivity means it can corrode glass, metals, and most organic materials. However sometimes it's seen to corrode glass rather slowly, which might be due to impurities. It reacts violently and dehydrates cellulose based materials (paper or wood). It dissolves most hand gloves. However it seems to react less violently with latex gloves, resulting in discoloration. It is also a strong oxidant and reacts violently (explodes) with water. It is highly volatile in moist air, releasing fumes violently and heating up. It decomposes in to toxic Hydrogen fluoride gas when heated to 40°C. It's one of the most unstable substance known on earth, unless stored properly. It's stored in specialized containers, typically made of Teflon or other highly resistant fluorinated materials. == Structure and Chemistry == Fluoroantimonic acid is often written as , but this is not a real chemical species. The actual mixture contains various fluoronium cations and fluoroantimonate anions, with the acidity coming from the fluoronium. A more accurate representation of the acid is , but this is still only a small portion of the actual species present. === Formation === HSbF6 is created by mixing HF and SbF5. The reaction generates an equilibrium of the complex and ions. The proton (H+) in this complex is extremely mobile, which accounts for its high acidity. === Solvent Properties: === Because of its ionizing power, fluoroantimonic acid is used as a protonating solvent in some highly specialized chemical reactions, especially in research involving carbocations and organic reaction mechanisms. == Uses and Handling == === Research Applications === Due to its extreme strength, fluoroantimonic acid is used mainly in laboratory research, especially in organic chemistry and superacid studies, to create highly charged intermediates and study their reactions. === Safety Concerns === This acid is exceptionally dangerous. Direct exposure can lead to severe burns and even respiratory damage due to its fumes. It's a potent toxin and a carcinogen too. It's fumes, which are composed of Hydrofluoric acid and other carcinogenic antimony compounds are strong irritants and contact toxins. Handling requires strict safety protocols, including the use of specialized protective gear and containment equipment. The use of fume hoods or specialized glovebox is recommended. As this acid reacts with most gloves, special acid-resistant gloves must be used. == Storage and Stability == === Storage === Fluoroantimonic acid is corrosive to glass and most metals. It cannot be stored in containers made out of those materials. Fluoropolymers such as polytetrafluoroethylene (Teflon) or perfluoroalkoxy alkane (PFA) protect containers against the acid. Fluoroantimonic acid must be stored at a relatively cool temperature, away from moisture. It must not be stored in warmer places, where temperatures may exceed its decomposition point. This will lead to container bursting due to gas pressure. === Instability === The acid is one of the most unstable substances known and extremely volatile, decomposing violently in the presence of moisture, releasing toxic and corrosive gases. It is explosive in the presence of water. Heating it is dangerous as well, as it decomposes to toxic gases. Rapid heating may cause it to explode. Heating it in a closed container is even more dangerous as it can explode due to pressure building up. It must be handled in dry, controlled environments == References == . Category:Antimony compounds Category:Fluorine compounds Category:Superacids Category:Solvated proton acids",
 "title": "Fluoroantimonic acid"
}