{
 "id": "971149",
 "text": "The 2024 FIM MotoGP World Championship will be the premier class of the 76th F.I.M. Road Racing World Championship season. == Teams and riders == Entrant Constructor Chassis Race rider No. rider name Aprilia Racing Aprilla RS-GP24 12 Maverick Viñales 41 Aleix Espargaró Trackhouse Racing RS-GP23 25 Raúl Fernández RS-GP24 88 Miguel Oliveira Ducati Lenovo Team Ducati Desmosedici GP24 1 Francesco Bagnaia 23 Enea Bastianini Prima Pramac Racing 21 Franco Morbidelli 89 Jorge Martín Gresini Racing MotoGP Desmosedici GP23 73 Alex Márquez 93 Marc Márquez Pertamina Enduro VR46 Racing Team 49 Fabio Di Giannantanio 72 Marco Bezzecchi LCR Honda Castrol Honda RC213V 5 Johann Zarco LCR Honda Idemitsu 30 Takaaki Nakagami Respol Honda Team 10 Luca Marini 36 Joan Mir Red Bull GasGas Tech3 KTM RC16 31 Pedro Acosta 37 Augusto Fernández Red Bull KTM Factory Racing 33 Brad Binder 43 Jack Miller Monster Energy Yamaha MotoGP Yamaha YZR-M1 20 Fabio Quartararo 42 Álex Rins 87 Remy Gardner All teams use series-specified Michelin tyres. ===Team changes=== RNF Racing will not enter the 2024 season after being found breaching the participation agreement. The replacement is yet to be decided. Trackhouse Racing MotoGP was later announced as the replacement for RNF Racing, taking over as Aprilia's independent team. and retaining riders Miguel Oliveira and Raúl Fernández from RNF. ====Rider changes==== * Álex Rins will move to Monster Energy Yamaha MotoGP from LCR Honda, replacing Franco Morbidelli who will move to Prima Pramac Racing, replacing Johann Zarco. * Johann Zarco will move to LCR Honda from Prima Pramac Racing, replacing Álex Rins. Zarco previously raced with the team as a replacement rider in 2019. * Marc Marquez will move to Gresini Racing from Repsol Honda, replacing Fabio Di Giannantonio who will move to VR46 Racing Team, replacing Luca Marini. Márquez leave Repsol Honda after 11 seasons, winning six Riders' Championships during his stint with the team. and will team up again with his brother Álex, who was his teammate in Repsol Honda in 2020. * Pedro Acosta will enter the MotoGP class with the Red Bull GasGas Tech3 team, replacing Pol Espargaró who will leave the premier class after 10 seasons. * Luca Marini will move to Repsol Honda from VR46 Racing Team, replacing Marc Márquez. ====Mid-season changes==== *Álex Rins will miss the German round after an injury sustained at the Dutch TT and will be replaced by Remy Gardner. == Calendar == The following Grands Prix are provisionally scheduled to take place in 2024: Round Date Grand Prix Circuit 1 10 March Grand Prix of Qatar Losail International Circuit, Lusail 2 24 March Grande Prémio de Portugal Algarve International Circuit, Portimão 3 14 April Grand Prix of The Americas Circuit of the Americas, Austin 4 28 April Gran Premio de España Circuito de Jerez – Ángel Nieto, Jerez de la Frontera 5 12 May Grand Prix de France Circuit Bugatti, Le Mans 6 26 May Gran Premi de Catalunya Circuit de Barcelona-Catalunya, Montmeló 7 2 June Gran Premio d'Italia Autodromo Internazionale del Mugello, Scarperia e San Piero 8 30 June TT Assen TT Circuit Assen, Assen 9 7 July Motorrad Grand Prix Deutschland Sachsenring, Hohenstein-Ernstthal 10 4 August British Grand Prix Silverstone Circuit, Silverstone 11 18 August Motorrad Grand Prix von Österreich Red Bull Ring, Spielberg 12 1 September Gran Premio de Aragón MotorLand Aragón, Alcañiz 13 8 September Gran Premio di San Marino e della Riviera di Rimini Misano World Circuit Marco Simoncelli, Misano Adriatico 14 22 September Emilia Romagna Grand Prix 15 29 September Grand Prix of Indonesia Mandalika International Street Circuit, Central Lombok 16 6 October Grand Prix of Japan Mobility Resort Motegi, Motegi 17 20 October Australian Motorcycle Grand Prix Phillip Island Grand Prix Circuit, Phillip Island 18 27 October Thailand Grand Prix Chang International Circuit, Buriram 19 3 November Grand Prix of Malaysia Sepang International Circuit, Sepang 20 17 November Gran Premio de la Comunitat Valenciana Circuit Ricardo Tormo, Valencia The following Grand Prix is planned as a reserve venue: Grand Prix Circuit Hungarian Grand Prix Balaton Park Circuit, Balatonfőkajár === Calendar and changes === * The Grand Prix of Qatar will return as the season opener after being the penultimate round in 2023. * The Kazakhstan Grand Prix is set to make its debut this season after its cancellation in 2023 due to homologation works at the circuit along with global operational challenges. * The Grand Prix of Aragon will return this season after not being held in 2023. * The Grand Prix of Aragón will return this season after not being held in 2023. * The Grand Prix of Argentina has been Cancelled due to Government issues. * The Grand Prix of Kazakhstan was \"postponed until later in the season\" on 3 May, due to the on-going Central Asian flooding. It was announced on 29 May that it will be held on 22 September, the date which the Grand Prix of India is scheduled to be held. It was also announced on the same day the Grand Prix of India will not be held in 2024 and will be postponed to March 2025. On 15 July, it was announced that the Kazakhstan Grand Prix would not take place, and its date would be replaced by a second round at Misano. ==References== Category:2024 in sports Category:2020s in motorsport Category:Grand Prix motorcycle racing",
 "title": "2024 MotoGP World Championship"
}