{
 "id": "971187",
 "text": "Tropical Storm Nalgae, also known in the Philippines as Severe Tropical Storm Paeng, was a severe tropical cyclone that hit the northernmost island of the Philippines. Nalgae was a very large and deadly storm that impacted the Philippines, Hong Kong and Macau. It was the 22nd named storm of the 2022 Pacific Typhoon Season. == History == On October 26th, the JTWC noticed an area of low pressure in an area where it could develop into a Tropical Cyclone. Later the same day, PAGASA named the system Paeng in the Philippines, with the JTWC a day later naming it Nalgae on October 27th for the rest of the world. The following morning on October 28th the JTWC upgraded Nalgae into a Severe Tropical Storm. On October 29th in the Philippines, Nalgae made landfall in Southern Luzon, and traversed the island in about a day while maintaining its strength. Nalgae exited the island early next morning, and entered the South China Sea. It briefly weakened into a tropical depression, before restrengthening over the following few days into a storm the same intensity as a Category 1 according to the JTWC. While it restrengthened, Nalgae turned north and began to approach southern China. It made its final landfall near Hong Kong after weakening due to unfavorable conditions. == Impacts == Tropical Storm Nalgae, although not very strong, still impacted the Philippines significantly. It caused heavy rains, which helped created landslides in the hilly areas. The storm caused the deaths of 164 people, while 34 are still reported missing. Nalgae also is reported to have caused 225 million dollars in USD of damages. ==Maximum Level of Typhoon Storm Warning Signal per Area== PSWS LUZON VISAYAS MINDANAO PSWS #3 Bataan, Batangas, Bulacan, Cavite, Laguna, Metro Manila, Pampanga, Quezon, Rizal, Tarlac, Zambales NONE NONE PSWS #2 Aurora, Camarines Norte, Camarines Sur, Catanduanes, Masbate, Marinduque, Occidental Mindoro, Oriental Mindoro, Nueva Ecija, Sorsogon Northern Samar, Eastern Samar NONE PSWS #1 Abra, Benguet, Ifugao, Ilocos Norte, Ilocos Sur, Isabela, La Union, Pangasinan, Quirino, Romblon Biliran, Leyte, Samar Agusan del Norte, Kapuluang Dinagat, Surigao del Norte == Other websites == https://www.unhcr.org/ph/sts-nalgae-paeng https://earthobservatory.nasa.gov/images/150549/tropical-storm-nalgae-batters- the-philippines https://satlib.cira.colostate.edu/event/tropical-storm-nalgae/ https://disasterscharter.org/web/guest/activations/-/article/storm-hurricane- rural-in-philippines-activation-789- Category:2022 disasters in Asia Nalgae Nalgae Nalgae",
 "title": "Tropical Storm Nalgae"
}