{
 "id": "971260",
 "text": "Adekunle Almoruf Kosoko (born 28 January 1987) popularly known as Adekunle Gold or AG Baby, is a Nigerian Afrobeat's singer and songwriter.https://www.vanguardngr.com/2015/08/i-didnt-lobby-to-be-signed-by- olamide-adekunle-gold/ Adekunle Gold became known after he released the 2015 hit single \"Sade\". He signed a record contract with YBNL (Yahoo Boy No Laptop) Nation. He released his 2015 debut studio album Gold. ==Early life== Adekunle Almoruf Kosoko was born into the Kosoko royal family of Lagos State, Nigeria on 28 January 1987. ==Education== He attended Lagos State Polytechnic, where he had his Higher National Diploma (HND) in Arts and Design. https://www.naijanews.com/ ==Career== Adekunle Gold interest in music started while listening to songs by King Sunny Ade and Ebenezer Obey while he was growing up. He became a member of his church's junior choir during his teenage years and went on to write his first song at the age of 15. In 2014, Adekunle went solo after leaving a music group he formed with a friend while in school. On 19 December 2014, he released \"Sade\". The song became well known and was nominated for Best Alternative Song at The Headies 2015. He released his first official single titled \"Orente\" through YBNL (Yahoo Boy No Laptop) Nation after signing a music contract with the record label on 5 March 2015. https://www.channelstv.com/2015/07/02/ybnl-act-adekunle-gold-sings-orente/ On 18 July 2016, Adekunle released his first studio album titled Gold. The album is a 16-track project, with musical production from Pheelz, Masterkraft, B Banks, Sleekamo, Oscar and Seyikeyz. he left YBNL Nation after his contract expired, he then announced his band \"The 79th Element\" pointing out to the atomic number of gold. On 15 January 2018, Unity Bank announced Adekunle Gold as their brand ambassador. On 21 August 2020, He Released another Album titled 'Afro Pop Vol. 1. Adekunle Gold released his fourth studio album titled \"Catch Me If You Can\" containing 14 tracks and featuring artist like Davido, Fatoumata Diawara, Lucky Daye, Stefflon Don, Foushee, and TY Dolla Sign On 4 February 2022, ==References== Category:1987 births Category:Living people Category:Nigerian singer-songwriters",
 "title": "Adekunle Gold"
}