{
 "id": "971866",
 "text": "Toon City is a Filipino animation studio located in Manila. == List of animated movies and TV series == Toon City has provided animation for: ===TV series=== TV series Studio Country Years Notes 101 Dalmatians: The Animated Series Walt Disney Television Animation Jumbo Pictures United States Aladdin: The Animated Series Walt Disney Television Animation United States Angry Birds Toons Rovio Entertainment Finland 2013-2016 (from \"Gardening with Terence\" to \"Love is in the Air\"; from \"Clash of Corns\" to \"Jingle Yells\"; \"Hiccups\"; \"Hambo\"; from \"Oh, Gnome!\" onward) Bonkers Walt Disney Television Animation United States 1993 Brandy & Mr. Whiskers Walt Disney Television Animation Wang Film Productions United States Bratz MGA Entertainment Mike Young Productions United States 2005 Brickleberry Fox 21 United States Bunnicula Warner Bros. Animation United States 2016 Buzz Lightyear of Star Command Walt Disney Television Animation Pixar Animation Studios United States 2016 Curious George Universal Animation Studios Imagine Entertainment WGBH Boston United States 2006-2022 Dawn of the Croods DreamWorks Animation United States DuckTales Disney Television Animation Snipple Animation United States The Emperor's New School Walt Disney Television Animation Wang Film Productions Synergy Animation Studios United States Gargoyles Nelvana Walt Disney Television Animation Canada United States 1994-1997 Geronimo Stilton MoonScoop Group Rai Fiction Atlantyca Entertainment Italy 2008-2015 Hercules: The Animated Series Walt Disney Television Animation United States 1998 Hero: 108 Gamania China 2006 House of Mouse Walt Disney Television Animation United States Jake and the Never Land Pirates Disney Television Animation United States (From Season 4 on) Jungle Cubs Walt Disney Television Animation United States Kim Possible Walt Disney Television Animation United States The Land Before Time Universal Animation Studios Amblin Entertainment United States 2007-2008 The Legend of Tarzan Walt Disney Television Animation United States Lilo & Stitch: The Series Walt Disney Television Animation United States The Looney Tunes Show Warner Bros. Animation United States 2011-2014 (first season only) Uncle Grandpa Cartoon Network United States 2013-2017 Mickey Mouse Works Walt Disney Television Animation United States 1999-2000 (season 2 only) The Mighty B! Nickelodeon Animation Studios Paper Kite Productions Polka Dot Pictures United States 2008-2011 (Season 1 only) Mighty Ducks: The Animated Series Walt Disney Television Animation United States Mixed Nutz Big Bad Boo Canada Mother Up! Broadway Video Mass Animation Bardel Entertainment Rogers Media Canada The New Adventures of Winnie the Pooh Walt Disney Television Animation United States Quack Pack Walt Disney Television Animation United States Recess Walt Disney Television Animation United States The Replacements Walt Disney Television Animation United States Rick and Morty Williams Street Canada United States 2013-present (Season 1 only) Star vs. the Forces of Evil Disney Television Animation United States 2015-2018 (Season 1 only) Teacher's Pet Walt Disney Television Animation United States Teamo Supremo Walt Disney Television Animation United States The 7D Walt Disney Television Animation Wang Film Productions Digital eMation United States Timon & Pumbaa Walt Disney Television Animation United States Tom and Jerry Tales Warner Bros. Animation Turner Entertainment United States Voltron Force Zodiac Entertainment World Events Productions Classic Media Kickstart Productions Nicktoons United States Canada 2011 === Direct-to-video films === * Belle's Magical World (1998, Walt Disney Television Animation) * The Lion King II: Simba's Pride (1998, Walt Disney Television Animation) * Hercules: Zero to Hero (1999, Walt Disney Television Animation) * Mickey's Magical Christmas: Snowed in at the House of Mouse (2001, Walt Disney Television Animation) * Tarzan & Jane (2002, Walt Disney Television Animation) * Mickey's House of Villains (2002, Walt Disney Television Animation) * Atlantis: Milo's Return (2003, Walt Disney Television Animation) * Winnie the Pooh: Springtime with Roo (2004, DisneyToon Studios) * Bratz the Video: Starrin' & Stylin (2004, MGA Entertainment) * Mickey, Donald, Goofy: The Three Musketeers (2004, DisneyToon Studios) * Tom and Jerry: Blast Off to Mars (2005, Warner Bros. Animation) * Tarzan II (2005, DisneyToon Studios) * Pooh's Heffalump Halloween Movie (2005, DisneyToon Studios) * Kronk's New Groove (2005, DisneyToon Studios) * Bah, Humduck! A Looney Tunes Christmas (2006, Warner Bros. Animation) * The Fox and the Hound 2 (2006, DisneyToon Studios) * Disney Princess Enchanted Tales: Follow Your Dreams (2007, DisneyToon Studios) * The Little Mermaid 3: Ariel's Beginning (DisneyToon Studios Australia) (2008, DisneyToon Studios) * Holly Hobbie and Friends: Fabulous Fashion Show (2008, Sony Wonder) * Holly Hobbie and Friends: Marvelous Makeover (2009, Sony Wonder) * Curious George 2: Follow That Monkey! (2009, Universal Animation Studios) Feature films * (1997, TFC Trickompany Filmproduktion GmbH) * The Jungle Book 2 (2003, DisneyToon Studios) * Piglet's Big Movie (2003, DisneyToon Studios) (uncredited) * Teacher's Pet (2004, Walt Disney Television Animation) * Curious George (2006, Universal Animation Studios) [Digital Ink and Paint only]) * The Three Robbers (2007, Animation X Gesellschaft zur Produktion von Animationsfilmen mbH) * Santa's Apprentice (2010, Cartoon Salon) * Titeuf, le film (2011, MoonScoop Productions) * The Golden Horse (2014, Acme Film) * Henry and Me (2014, Sunset Studios) * La Leyenda del Chupacabras (2016, Ánima Estudios) * Rabe Socke (2017, Seru Films) * Fritzi: A Revolutionary Tale (2018, Trick Studio) * The Last Sheep (2019, Trick Studios) * The Little Vampire (2019, The Magical Society) * Koati (2019, Los Hijos de Jack) === Television specials === * Boo to You Too! Winnie the Pooh (1996, Disney Television Animation) == References == == Other websites == * Category:Animation studios in Asia Category:Movie production companies Category:1993 establishments in Asia Category:Companies of the Philippines",
 "title": "Toon City"
}