{
 "id": "971927",
 "text": "The SUBE card (standing for Sistema Único de Boleto Electrónico; literal English translation: Unique Electronic Ticket System), is a system implemented in Argentina as of 2011 that allows each user with their respective smart card to pay for trips on buses, subways, trains, among other means of transportation. transport adhered to the 'Red SUBE', both in public transport in the Metropolitan Area of Buenos Aires (AMBA) and in the interior of the country. The SUBE Card is similar to other solutions implemented in highly concentrated cities, both in Argentina (Rosario, Córdoba, Posadas, Salta or San Miguel de Tucumán, Bahía Blanca) and in the rest of the world (London, Paris, Hong Kong, Seoul, Rio de Janeiro, São Paulo, Bogotá, Santiago de Chile, Asunción, Montevideo or Andalusia). It is the only valid payment method for all public transport services in the City of Buenos Aires since December 10, 2015. ==History== ===Incorporation and implementation=== The distribution of the cards was initially carried out free of charge; All you had to do was complete a form and present a document that validates the applicant's identity. To this end, a strong promotional campaign was launched and collection centers were set up. ===Expansion=== The SUBE card arrived in the big cities of Argentina in 2015. This was announced by the Ministry of the Interior and Transport, which published resolution 1535/2014 in the Official Gazette to implement the SUBE throughout the country. country. Other urban agglomerations to join the system are San Juan and Partido de la Costa (Province of Buenos Aires). On January 5, the Goverment presented the card in Villa Gesell. On February 2, the SUBE was inaugurated in the cities of Paraná and Santa Fe, capitals of the provinces of Entre Ríos and Santa Fe, respectively. It was also implemented in Mendoza and in Formosa. ===SUBE Digital=== In December 2019, a digital version of the SUBE card was presented. This would allow paying for public transport using an Android cell phone with NFC technology. It works even without mobile data in the system. cell phone. This application would enable users to travel without carrying a physical card. At the time of the presentation, it was estimated that its launch would take place between five and seven months later. Another mobile application for Android called Carga SUBE allows, by bringing the physical card close to an NFC-compatible cell phone, reading the balance, the last trips made and activating electronic charges. Category:Transport in Argentina",
 "title": "Sistema Único de Boleto Electrónico"
}