{
 "id": "972052",
 "text": "The Faculty of Humanities, Charles University is part of Charles University in Prague, Czech Republic. Its main focus is the humanities and social and cultural anthropology, including ethnomusicology. It is in Libeň, Prague 8. There are 240 faculty members and about 2,500 students. ==History== The Faculty of Humanities is the youngest faculty of Charles University. Founded as the Institute for Liberal Education in 1994, the faculty gained full academic autonomy in 2000. The first dean of the faculty was the former Minister of the Ministry of Education, Youth and Sports Jan Sokol. Sokol ran for President of the Czech Republic in the 2003 election but lost to Václav Klaus. He was replaced in 2007 by Ladislav Benyovszky. The current acting dean is Marie Pětová. In 2013, Czech President Miloš Zeman refused to approve the professorship of anthropologist Martin C. Putna at the faculty because of Putna's involvement in Prague Gay Pride in 2011. After many protests from academic and broader circles, Zeman capitulated. Putna was appointed by the Minister of Education Petr Fiala in June 2013.Putna se dočkal profesorského dekretu, místo Zemana mu ho předal Fiala, iDNES.cz, 25. 6. 2013 ==Facilities== The faculty's main building used to be located at U Kříže 8, Jinonice district, Prague 5, with two separate facilities, one in Hůrka district, Prague 13, and another at Máchova street 7, Prague 2. The faculty moved to a new building in Libeň, Prague 8 in 2020. The new building won a national architecture award in 2021. The faculty's three-floor library is located beneath the university building on náměstí Jana Palacha by Staroměstská metro station. File:Jinonice building.jpg|Old building File:PXL 20210617 090002732.MP.jpg|New building ==Departments== Departments of Faculty of Humanities, Charles University In English In Czech Department of Philosophy Katedra filosofie Department of Historical Studies Katedra historických věd Department of Languages and Literature Katedra jazyků a literatury Department of Applied Social Sciences Katedra aplikovaných sociálních věd Department of Psychology and Life Sciences Katedra psychologie a věd o životě Department of Social and Cultural Anthropology Katedra sociální a kulturní antropologie Department of Sociology Katedra sociologie Department of Theory of Art and Artworks Katedra teorie umění a tvorby Doctoral Studies Office Pracoviště doktorských studií ==Notable people== File:Jan Sokol.jpg|Jan Sokol File:Doc.Ladislav Benyovszky.jpg|L. Benyovszky File:Martin C. Putna (Hana Rysová).JPG|Martin C. Putna File:Jaro-Křivohlavý2007b.jpg|Jaro Křivohlavý File:Vopenka.jpg|Petr Vopěnka File:Miloslav_Petrusek_za_katedrou%2802%29.jpg|Miloslav Petrusek File:Bedřich Moldan (cropped).jpg|Bedřich Moldan ==Literature== * Kovalcsik, Katalin. \"The music of the Roma in Hungary.\" In Romani Music at the Turn of the Millennium. Proceedings of the Ethnomusicological Conference. Praha: Studio Production ‘Saga’& Faculty of Humanities, Charles University, pp. 85-98. 2003. * Otčenášek, Jaroslav. \"Rumyana Greorgieva, Buhlaři v Čechách, imigrační proces a společenská integrace v současné době. FHS UK, Praha 2011, 177 s.-.\" Český lid: Etnologický časopis 100, no. 4 (2013): 500-501. * Morávková, Naděžda. \"VANĚK, Miroslav-HOUDA, Přemysl-MÜCKE, Pavel (eds.). Deset let na cestě. Orální historie na Sovinci 2002-2011. Praha: Fakulta humanitních studií. Univerzity Karlovy, 2011. ISBN 978-80-87398-12-8.\" (2012). ==References== ==Other websites== * Official Website (Czech) * Official Website (English) Category:Charles University",
 "title": "Faculty of Humanities, Charles University"
}