{
 "id": "972078",
 "text": "The Thousand Days War was a civil war in Colombia which was fought from October 17th 1899 to November 21st 1902. It was fought over whether Colombia should have federalism or centralism. ==History== In 1863, Colombia got a Constitution giving the people freedom of speech, freedom of religion and the right to own guns. It also gave Colombia a system of federalism and the separation of church and state. In 1884, Rafael Núñez was elected president of Columbia and wanted to get rid of federalism and get rid of the separation of church and state and get rid of secularism and used the slogan “one nation, one goal, one God”. When Núñez retired, his Vice President Miguel Antonio Caro took over as president. Caro used government censorship to stop criticism by banning newspapers which criticized him and had major politicians who opposed him arrested. Then the Colombian Liberal Party rebelled against him and he crushed three different rebellions. In 1894, the rebels attacked Caro’s government but in 1895 they surrendered. ==Breakout== In 1896, Caro quit being president after members of the Liberal Party asked that he lift martial law and in the next election in 1898, Manuel Antonio Saclemente won while 84 years old. Then in 1899, the Liberals attacked Santander to protest Saclemente’s policies and started a civil war. ==Battles== Between the 11th and 13th of November, 1899, the Battle of Bucaramanga killed 1000 people and injured 500. Soon the war spread to all of Colombia. In 1901, President Cipriano Castro of Venezuela sent his army to Colombia to help the Liberals. In 1902, General Uribe Uribe decided he couldn’t win and agreed to surrender. ==Treaties== The American President Theodore Roosevelt sent his navy to protect the Panama Canal so after the two factions signed a treaty in Panama, they signed a second on an American ship which officially ended the war on the 21st of November, 1902. ==In Popular Culture== Gabriel Garcia Márquez wrote some novels about the war. The Disney movie Encanto is about a family of refugees from the war. Category:Civil wars Category:History of Colombia",
 "title": "Thousand Days' War"
}