{
 "id": "972422",
 "text": "John Callahan's Pelswick (or simply Pelswick) is a Canadian - Chinese (Taiwan) animated television series. It is co-produced by Nelvana and Suzhou Hong Ying Animation Corporation Limited. The title character uses a wheelchair but the series shows that he lived a normal life. The series was based on the books by John Callahan. The series was positive and life-affirming. The show aired on Nickelodeon in the United States and was billed as the network's original programming, despite not being a Nicktoons show. == Characters == * Pelswick Eggert (voiced by Robert Tinkler) – A 13-year-old boy who uses a wheelchair. How he became a paraplegic is not revealed in the series, but the series' creators imply through commentary that it was due to a car accident. He dislikes it when people treat him differently because of his disability. He dislikes following the crowd and he goes by his own rules. * Ace Nakamura (voiced by Phil Guerrero) – Pelswick's best friend. Ace is technologically smarter than any of his friends, and is often the thinker of the situation. * Goon Gunderson (voiced by Peter Oldring) – Pelswick's other best friend. Huge and slow-witted in his actions and thoughts, Goon is generally good-hearted but rather dangerous when angry. He does not know that wrestling is staged. * Julie Smockford (voiced by Julie Lemieux) – A pretty girl and Pelswick's love interest. She hates all the cliques and popularity contests at school and seems to care mostly about her popularity and image. Julie is smart, dramatic, sometimes annoying, but cares a lot about Pelswick. Pelswick has a crush on her but she is completely oblivious about it. Julie believes in justice for all. * Sandra Scoddle (voiced by Kim Kuhteubl) – Julie's snooty and arrogant best friend/rival and one of Pelswick's friends. She thinks she is better than everyone else and often disputes with Julie. She thinks she is cool, but she's not. She gets caught into the latest trends. * Mr. Jimmy (voiced by David Arquette) – Pelswick's guardian angel who often gives him advice that confuses him until the last moment, no matter what it is. Pelswick cannot stand it when his advice doesn’t make sense. He is also the comic relief of the show. * Kate Eggert (voiced by Tracey Moore) – Pelswick's precocious younger sister. She treats her reputation as a little sister like a business and usually blackmails Pelswick when butting into his business. She has dreams of owning a big corporation. She is 10 years old. * Bobby Eggert – Pelswick's and Kate's baby brother. He rarely talks and admires Pelswick. Because their mother died in a car accident Bobby doesn’t remember her. * Quentin Eggert (voiced by Tony Rosato) – Pelswick, Kate and Bobby's politically correct father who works as a college professor until he is fired in \"The Case of the Filched Files.\" He later gets his job back. He wants to do everything by papers. His wife was killed in the same car accident that made Pelswick into a paraplegic. * Priscilla \"Gram-Gram\" Eggert (voiced by Ellen-Ray Hennessy) – Quentin's mother and Pelswick, Kate and Bobby's deranged grandmother. She often does \"extreme\" acts beyond that of a grandmother. Most of these acts results in her getting arrested. * Boyd Scullarzo (voiced by Chuck Campbell) – The bully of Pelswick's school who likes bullying Pelswick and others, not physically (he's particularly against hitting Pelswick because he's in a wheelchair), but with humiliation. * Vice Principal Ziegler (voiced by David Huband) – The vice principal of Alcatraz Jr High, Pelswick’s school. Despite his title, he usually assumes the role of a principal. Throughout the show, there is no mention of there being a principal at Alcatraz Jr High. During the second episode of the series, this issue was lampshaded by Goon Gunderson who questioned why their school had a vice principal but no principal. == Episodes == === Season 1 (2000) === No. Title Directed by Written by Original release date 1 \"Inherit the Wheeled\" Charles E. Bastien Andrew Nicholls & Darrell Vickers October 6, 2000 Fearing for his safety, the school forbids Pelswick to go on a class camping trip, even though he correctly points out that \"I'm the only kid who can't get accidentally paralyzed!\" 2 \"I Won't Run, Don't Ask Me\" Charles E. Bastien Darwin Vickers October 13, 2000 Unable to threaten Pelswick physically, Boyd decides to humiliate him on a whole different level—by nominating him for school president. 3 \"Brain Suckers of Skuldeth 5\" Charles E. Bastien Alan Daniels October 20, 2000 Ace and Goon lure Pelswick into participating in the latest craze, the Brain Suckers trading card game. Soon Pelswick is totally hooked—and Boyd has the one ultra-rare card Pelswick would do anything to get. 4 \"Me, Myself And Irate\" Charles E. Bastien Andrew Nicholls, Darrell Vickers & Leonard Dick October 27, 2000 Pelswick tries to avoid the humiliation of having Gram-Gram deliver a guest lecture at school. 5 \"Draw!\" Charles E. Bastien Todd Thicke November 3, 2000 Pelswick's anonymously drawn cartoon is banned from the school newspaper, leading to a suspension for editor Julie when she won't reveal who drew it. 6 \"'NTalented\" Charles E. Bastien Todd Thicke November 10, 2000 A pre-packaged boy band has all the girls swooning. Pelswick, meanwhile, desperately tries to hate the band, but to his horror finds that he actually kinda likes their music. Note: The episode's title is a play-on for the band *NSYNC. 7 \"Assault And A Battery\" Charles E. Bastien Darwin Vickers & Todd Thicke November 17, 2000 Pelswick and Boyd build a chili-powered battery that ends up turning Pelswick's wheelchair into a 50-mph menace. 8 \"The Wheel World\" Charles E. Bastien Todd Thicke & Alan Daniels November 24, 2000 A camera crew invades the Eggert household when a producer sees Pelswick as the ideal subject for a reality-based TV show. 9 \"David And Goonliath\" Charles E. Bastien Leonard Dick & Darwin Vickers December 1, 2000 Despite a noticeable lack of talent, Goon becomes a professional wrestler—and Pelswick must figure out a way to keep him from getting slaughtered in the ring. 10 \"Spring Broken\" Sean V. Jeffrey Jennifer Pertsch December 8, 2000 Ace, Goon and the Eggert family head off to Camp Self-Esteemawa for Spring Break...but the camp's determinedly non-competitive atmosphere prevents anyone from having fun. 11 \"Transmission Impossible\" Charles E. Bastien Kenn Scott & John Pellatt December 15, 2000 When Bayview's only rock-and-roll radio station changes its format to all-news, Pelswick opens a pirate rock music station of his own—one that quickly begins consuming all his time and energy. 12 \"Blink And You're At 182\" Charles E. Bastien Andrew Nicholls & Darrell Vickers December 22, 2000 The school is thrown into an uproar when a website publishes a list of students in order of popularity. Note: The episode's title is a play-on for the band Blink-182. 13 \"Nursing Home Alone\" Charles E. Bastien John Pellatt, Kenn Scott & Darwin Vickers December 29, 2000 Gram-Gram and her friends decide to check into a shady nursing home without even saying good-bye to their families. It's up to a bewildered Pelswick to organize a rescue mission while simultaneously planning a surprise party for Quentin. === Season 2 (2001) === No. Title Directed by Written by Original release date 14 \"Eggertggedon\" Sean V. Jeffrey Andrew Nicholls & Darrell Vickers September 7, 2001 All of Bayview starts panicking when it appears that a nuclear-powered space station is going to plunge through the atmosphere and destroy the town. 15 \"Wheeldini\" Sean V. Jeffrey Andrew Nicholls & Darrell Vickers September 14, 2001 The mayor of Bayview somehow manages to lose all of the town's money, so he hires a magician to find it. Though it's obvious the magician is a sham, no one but Pelswick realizes this. Meanwhile, Gram-Gram and Agnes go searching for the missing money on their own, with some help from a mule. 16 \"The Birdboy of Alcatraz\" Sean V. Jeffrey Darwin Vickers September 21, 2001 Pelswick is deemed terminally uncool when he takes up birdwatching to impress Julie. Meanwhile, Gram-Gram and Agnes get jobs as store detectives, and a trainee guardian angel takes over for Mr. Jimmy. 17 \"Boyd, Here Comes The Flood\" Sean V. Jeffrey Christian Murray & Mary Colin Chisholm September 28, 2001 Substitute teacher Gram-Gram spins tales about the Bayview flood of 1921 in order to impress Pelswick's class, little dreaming of the disastrous consequences that will follow. 18 \"It Must Be The Shoes\" Sean V. Jeffrey Steven Sullivan October 5, 2001 Basketball fever sweeps Bayview as Pelswick considers trying out for the school basketball team, Sandra and Julie try to organize a girls' team, and Quentin tutors Boyd and his gang so that they can remain eligible to play. 19 \"Oh Bully, Where Art Thou?\" Sean V. Jeffrey Andrew Nicholls & Darrell Vickers October 12, 2001 Pelswick enters the Paraquest Games for handicapped athletes, and is surprised to find that Boyd is his chief competitor. Meanwhile, Julie and Sandra try to save a tree. 20 \"The Case of The Filchered Files\" Sean V. Jeffrey Darwin Vickers October 19, 2001 The Eggert family are forced to scrimp and save when Quentin loses his job; Alcatraz Junior High celebrates its 75th anniversary. 21 \"Pelswick On A String\" Sean V. Jeffrey John Mein October 26, 2001 A decidedly flaky therapist forces the students in Pelswick's class to build marionettes in their own self-images as a therapeutic exercise. When Pelswick refuses to include a wheelchair as part of his self-image puppet, he's deemed to be deliberately undermining the therapy, and is suspended until he can put his puppet on a wheelchair. 22 \"Shall We Dance?\" Sean V. Jeffrey Al Schwartz November 2, 2001 Pelswick goes on a blind date with a girl who doesn't know about his wheelchair. When he discovers that his date loves dancing, he goes to extreme lengths to keep her from finding out that he's paralyzed from the waist down. 23 \"A Rap And A Hard Place\" Sean V. Jeffrey Christian Murray & Mary Colin Chisholm November 9, 2001 Julie tries to shake everyone out of their apathy by forming a band; Sandra obsesses on the healing powers of yellow boots; Gram-Gram and Agnes go gambling. 24 \"Hear No Evil, P.C. No Evil\" Sean V. Jeffrey Andrew Nicholls & Darwin Vickers November 16, 2001 Quentin's politically correct new girlfriend wins over everyone in the Eggert family except Pelswick. 25 \"Kick Me Kate\" Sean V. Jeffrey Andrew Nicholls & Darwin Vickers November 23, 2001 Pelswick tries to get Kate's new boyfriend to stand up for himself; Julie gets increasingly frustrated with Sandra's outrageous clothing; Gram-Gram and Agnes go on dates. 26 \"Invasion of The Buddy Snatchers\" Sean V. Jeffrey Darwin Vickers November 30, 2001 Almost everyone in town gets caught up in a bizarre pyramid scheme to sell laundry detergent. The only exceptions are Julie and Sandra (who are too busy embarking on a recycling drive of truly epic proportions) and poor Pelswick, who, as usual, is trying to be the voice of reason amidst all the chaos. ==Broadcast== The show aired in reruns on CBS during the Nick on CBS block from September 14 to November 23, 2002, and on Nicktoons from May 2002 to May 2005. ==References== Category:Nickelodeon television series Category:Children's television series Category:Canadian television series Category:Chinese television series Category:2000 television series debuts Category:2000 Canadian television series debuts Category:2002 Canadian television series endings",
 "title": "Pelswick"
}