{
 "id": "972596",
 "text": "The \"State Anthem of the Lithuanian SSR\" (, ) was the anthem of Lithuania from 1950 to 1988. It was replaced by the original anthem, \"Tautiška giesmė\" (\"The National Hymn\"). ==Lyrics== === 1978-1988 version === Lithuanian original Russian translation English translation Tarybinę Lietuvą liaudis sukūrė, Už laisvę ir tiesą kovojus ilgai. Kur Vilnius, kur Nemunas, Baltijos jūra, Ten klesti mūs miestai, derlingi laukai. Priedainis: Tarybų Sąjungoj šlovingoj, Tarp lygių lygi ir laisva, Gyvuok per amžius, būk laiminga, Brangi Tarybų Lietuva! Į laisvę mums Leninas nušvietė kelią, Padėjo kovoj didi rusų tauta. Mus Partija* veda į laimę ir galią, Tautų mūs draugystė kaip plienas tvirta. Priedainis Tėvynė galinga, nebijom pavojų, Tebūna padangė taiki ir tyra. Mes darbu sukursim didingą rytojų, Ir žemę nušvies komunizmo aušra. Priedainis Советской навечно по воле народа Ты стала, моя дорогая Литва. Здесь Вильнюс, здесь Неман, Балтийское море, Цветут наши нивы, растут города. Припев: В Союзе братском обрели мы Средь равных равные права. Живи в веках и будь счастливой, Моя Советская Литва! Нам русский народ помогал в битве грозной, Нам Ленин открыл лучезарную даль. Союз нерушимый наш Партией создан, И дружба народов прочнее, чем сталь. Припев Никто нам не страшен - могуча Отчизна! И небу быть мирным и чистым всегда. Приблизим трудом торжество коммунизма, Свети над планетою, счастья звезда. Припев Soviet Lithuania was built by the people, who fought for their freedom for a long time. Where Vilnius, where Nemunas, where the Baltic Sea is, Let our cities and our fields flourish. Chorus: In thy glorious Soviet Union, Amid the equal and free, Live for centuries, be happy precious Soviet Lithuania! Lenin showed us the way to freedom, The great Russian land helped us in the fight. The Party leads us to fortune and power, Our friendship between nations is strong as steel. Chorus Our fatherland is mighty, we fear no danger, May the skies be peaceful and pure. We will work to build a great tomorrow, the earth will be illuminated by the dawn of Communism. Chorus === 1950-1953 version === Lithuanian original Russian translation English translation Tarybinę Lietuvą liaudis sukūrė, Už savąją laisvę kovojus ilgai. Kur Vilnius senasis, kur Baltijos jūra, Ten klesti mūs miestai, derlingi laukai. Priedainis: Tarybų Sąjungoj šlovingoj, Tarp lygių lygi ir laisva, Gyvuok per amžius, būk laiminga, Brangi Tarybų Lietuva! Į laisvę mums Leninas nušvietė kelią, Padėjo kovoj didi rusų tauta. Mus Stalinas veda į laimę ir galią, Tautų mūs draugystė kaip plienas tvirta. Priedainis Šalis mūs galinga, nebijom pavojų, Apginsim Tėvynę nuo priešų visų. Mes žengiam pirmyn į didingą rytojų Skaidriuos spinduliuos komunizmo šviesų. Priedainis Советской навечно по воле народа Ты стала, моя дорогая Литва. Здесь Вильнюс старинный, Балтийское море, Цветут наши нивы, растут города. Припев: В Союзе братском обрели мы Средь равных равные права. Живи в веках и будь счастливой, Моя Советская Литва! Нам русский народ помогал в битве грозной, Нам Ленин открыл лучезарную даль. Союз нерушимый наш Сталиным создан, И дружба народов прочнее, чем сталь. Припев Никто нам не страшен — могуча Отчизна! Мы орды врагов победим навсегда! Идём мы вперёд, к торжеству коммунизма, Свети над планетою, счастья звезда. Припев Soviet Lithuania was built by the people, who fought for their freedom for a long time. Where is old Vilnius, where the Baltic Sea, Let our cities and our fields flourish. Chorus: In thy glorious Soviet Union, Amid the equal and free, Live for centuries, be happy precious Soviet Lithuania! Lenin showed us the way to freedom, The great Russian nation helped in the fight. Stalin leads us to fortune and power, Our friendship between nations is strong as steel. Chorus Our country is mighty, we fear no danger, Let's defend the Homeland from all enemies. We're moving forward into a great tomorrow, With transparent rays of the light of Communism. Chorus ==References== Category:Anthems of Soviet Socialist Republics Category:Lithuania",
 "title": "Anthem of the Lithuanian Soviet Socialist Republic"
}