{
 "id": "972569",
 "text": "Stickin Around is a Canadian animated television series produced by Nelvana Limited, produced in association with YTV. == Characters == * Stacy Stickler: One of the main protagonists. An 8-year-old quiet but bossy girl who loves imagining many things with Bradley. She often says \"For your big fat information\" and \"Real mature, Bradley\". She sometimes serves as the voice of reason for Bradley's silliness and recklessness. * Bradley: The other main protagonist is Stacy's 9-year-old best friend. He wears thick black-framed glasses and a red backwards cap. He often imagines himself as a superhero, secret agent, robot, or vampire, namely as Rubber Guy, Cap Crusader, 00 Bradley, Robo Bradley, or Count Vladley. His favourite fantasy is that \"Aliens from Uranus\" are behind whatever problem they are facing, much to Stacy's annoyance. * Frank: Stacy's fat pet wiener dog who sometimes shares in their adventures and loves to eat. Due to his insatiable appetite, he often sees things as food. He is very lazy and does not exercise much apart from chasing Stacy on the way to school. * Lester: Bradley's pet chameleon who blends into the background and causes a lot of trouble. * Lance: A bully who loves to pick on everyone in school, especially Bradley, whom he nicknames \"Scradley\". * Russell: Lance's dimwitted best friend and sidekick and carries around with him a horrible odor. He always says \"What?\" when everyone says \"Whoa Man! What's that funky smell?\" and he repeats everything that Lance says. He actually says \"Yeah…… [either what Lance said, or a synonym/variant]\". He does surprisingly well in class. * Polly: Lance's friendly, intelligent younger half-sister who always gives words of knowledge and wisdom. She is often seen walking her lifeless pet poodle, Pepperoni, whom she refuses to believe is dead; she hates being called a baby, though. * Dill: Friend of Stacy and Bradley who has a very loud voice. Often, uses the words \"HOLY MACKEREL!\". * Stella Stickler: She's Stacy's caring but also a hot-headed mother. She loves fashion, she works hard, and hates being annoyed by Stacy and Bradley sometimes. She is divorced from Stacy’s father Stanley. She is very annoyed when Stanley is trying to \"fix\" things. * Stanley Stickler: Stacy's ambitious father. His inventions go wrong and he isn't good at cooking. A running gag is that he's always trying to fix appliances. As mentioned in the first episode entitled \"Aaand Action!\", he lives in \"his own place\" in the same apartments (Latchkey Garden Apartments). He also seems to be kind of forgetful, because in the episode \"Madam Know-It-All\" it's a running gag that he thinks that his family has a lawn, but it's green gravel. He is divorced from Stacy’s mother Stella. He still doesn't seem to get that this \"lawn\" is never made out of grass because in the episode \"We're Doomed\" from the third season he still thinks that it is grass; and on the episode \"It's My Parties\" from the second season, in which he didn't realize it was Stella's turn to throw a surprise birthday party for Stacy. * Ms. Mobley: Stacy and Bradley's cheerful but crazy teacher. She frequently says \"Won't that be fun?\" to one of them. * Principal Coffin: A scary school principal who looks like a zombie and a vampire. He speaks in a slow, spooky accent. * Mr. Lederhosen: Stacy and Bradley's tough P.E. teacher who acts like an army sergeant major. * Mr. Doddler: A senior citizen who wears a fez with a crescent moon on it. He is a farmer who often grows the ingredients to make the kids' favourite snack, Cheez Poopers, that are similar to Wotsits. Stacy usually calls him \"Mr. D\". * William: A chubby boy who loves eating. * Melody: Stacy and Bradley's classmate who uses a wheelchair. She occasionally teams up with Stacy against Bradley and Dill. * Ashley: Stacy's rival and the wealthiest girl in school. She always wears a beret and is actually seen acting as somewhat of a snob and a spoiled brat. * Mrs. Salazar: A Spanish speaking woman who is Stacy and Bradley's kind-hearted neighbour. * Pickle: Pickle is Dill's pet parrot. His name is a pun on a dill pickle (a food). * Scooter: Scooter is William's pet hamster. * Freddy: Freddy is Melody's pet maggot. * Pepperoni: Pepperoni, as mentioned above, is Polly's lifeless pet dog. Polly is usually seen dragging Pepperoni around by his leash. == Cast == * Ashley Taylor (Tickell) as Stacy Stickler * Ashley Brown as Bradley * Marianna Galati as Polly * Andrew Craig as Lance * Amos Crawley as Russell * Daniel Goodfellow as Dill * Catherine Disher as Stella Stickler * Philip Williams as Stanley Stickler * Melleny Brown as Ms. Mobley * Benedict Campbell as Principal Coffin * Ron Rubin as Mr. Lederhosen * Nicholas Rice as Mr. Doddler * Daniel DeSanto as William * Leah Renee Cudmore as Melody * Lisa Yamanaka as Ashley * Allegra Fulton as Mrs. Salazar == Episodes == === Season 1 (1996) === The first season of the show. No. overall No. in season Title Original release date 1 1 \"Aaand Action!\" \\----\"Night of the Living Dumpster\" August 14, 1996 \"Aaand Action!\": Stacy and Bradley decided to make a movie for Uncle Saggy's Really Really Bad Home Videos Show, which results in chaos when they, Polly, Lance and Russell get inexplicably lost downtown. \"Night of the Living Dumpster\": Taking out the garbage turns into a volcanic experience! 2 2 \"Disappearing Act\" \\----\"And the Wiener Is...\" August 17, 1996 \"Disappearing Act\": Stella orders Stacy to clean her messy room, and when Stacy discovers her mom's vanishing cream can make more than wrinkles disappear, she uses it to make her room look clean and she and Bradley use it to become invisible. \"And the Wiener Is...\": The kids go on a journey to prevent Lance and Russell from stealing their winning lottery ticket. 3 3 \"Beware the Lunchwad\" \\----\"Madam Know-It-All\" August 28, 1996 \"Beware the Lunchwad\": Stacy and Bradley face the disgusting lunchroom. \"Madam Know-It-All\": Stacy claims she is a psychic, like her favorite TV star Madam Know-It-All. 4 4 \"Return Your Seats to an Uptight Position\" \\----\"Yams Away!\" October 15, 1996 \"Return Your Seats to an Uptight Position\": Stacy pretends to be an airplane pilot. \"Yams Away!\": Stacy's Thanksgiving might not be the best she's hoping for it to be. 5 5 \"The Good, the Bad, and the Bradley\" \\----\"Bye Bye, Baby Birdie\" October 18, 1996 \"The Good, the Bad, and the Bradley\": Bradley becomes the new hall monitor, but it goes way too much in his head. \"Bye Bye, Baby Birdie\": Stacy and Bradley play outside and go on a safari, and encounter a dead baby bird and give it a proper funeral. 6 6 \"Didn't'cha, Mr. D?\" \\----\"The Amazing Rubber Guy\" October 29, 1996 \"Didn't'cha, Mr. D?\": Mr. D reminisces the simple days when he was a child, also taking Stacy, Polly and Bradley on an adventure during the process. \"The Amazing Rubber Guy\": Stacy and Bradley play a game of baseball against Lance, Russell and Bradley's Superhero personas. 7 7 \"If It Ain't Fixed, Break It\" \\----\"The Mucus Touch\" November 1, 1996 \"If It Ain't Fixed, Break It\": Frank runs away from home, when Stella wants to take him to the vet to \"get fixed\". \"The Mucus Touch\": When Bradley's illness makes him miss a surprisingly fun day at school, Stacy cheers him up by telling fairy tales. 8 8 \"Jumbo Frank\" \\----\"Owed to a Tree\" August 31, 1996 \"Jumbo Frank\": Frank goes on a rampage after Stella notices he gets stuck in his doggy door too often and forces him to go on a diet. \"Owed to a Tree\": Bradley and Stacy try to prevent their favorite tree from being chopped down by the cityworks department. 9 9 \"Lassie Go Home\" \\----\"Hit the Showers\" November 19, 1996 \"Lassie Go Home\": All the kids at Middlestick Elementary bring their pets into the win best pet award. \"Hit the Showers\": As if gym class wasn't bad enough, Bradley and Stacy also have to suffer through the ever-gross school shower. 10 10 \"This is a Hiccup!\" \\----\"Disciplinary Action\" November 22, 1996 \"This is a Hiccup!\": Stacy's hiccups become contagious when it spreads the entire neighborhood. \"Disciplinary Action\": Bradley thinks Stacy was got to be interrogated about him putting whoopie cushions in Mr. Lederhosen's shoes when goes to Principal Coffin's dungeon. 11 11 \"Buttnocchio\" \\----\"Dill, Man of Letters\" December 3, 1996 \"Buttnocchio\": Instead of getting muffin mix for Stella, Bradley and Stacy sneak into a movie theater and tell lies to grown ups. \"Dill, Man of Letters\": Dill takes Stacy and Bradley to the library to escape from Lance and Russell. 12 12 \"Coat of Many Troubles\" \\----\"Environmentally Frenzied\" December 6, 1996 \"Coat of Many Troubles\": Stella gives Stacy a new coat, which makes her become the new popular girl in school. However, she soon discovers it has a dark secret. \"Environmentally Frenzied\": Stacy and Bradley are forced to, along with the other kids, make a pro-environmentalist project. 13 13 \"Photo Oops\" \\----\"Casa Blank Stare\" September 8, 1996 \"Photo Oops\": Stacy, to prevent having the same bad dream over and over again, does picture day her way. \"Casa Blank Stare\": Stacy and Bradley argue over which types of movies are \"classics\". === Season 2 (1997) === This is the only season that used Toon Boom. No. overall No. in season Title Original release date 14 1 \"Lights Out\" \\----\"Do the Russell\" January 21, 1997 \"Lights Out\": When Stacy and Bradley discover Lance is afraid of the dark, they use this as an advantage to get back at him and Russell. \"Do the Russell\": The kids try to entertain themselves when a storm prevents them from having recess. 15 2 \"Hold It!\" \\----\"Journey to the Center of Stacy's Closet\" January 24, 1997 \"Hold It!\": Bradley drinks six cans of Mr. Fizzy and desperately searches for a bathroom to pee in. \"Journey to the Center of Stacy's Closet\": Even though she's supposed to clean her closet, Stacy and Bradley go on a spelunking adventure. Note: Stacy's name is incorrectly spelled as \"Stacey\" in the title card. 16 3 \"Gross Anatomy\" \\----\"Stacy and Bradley Sittin' in a Tree\" February 4, 1997 \"Gross Anatomy\": Stacy and Bradley journey into Dill's body. \"Stacy and Bradley Sittin' in a Tree\": After a rumor stating Stacy and Bradley are dating spreads, they quit being friends. 17 4 \"Bar None\" \\----\"All Washed Up\" February 7, 1997 \"Bar None\": Selling chocolate bars for a school trip leads to an adventure in the ruthless world of big business. \"All Washed Up\": After having to constantly clean up after the kids at the Latchkey Complex, Stanley volunteers the gang in the Saturday Morning Garbage Patrol. 18 5 \"It's My Parties\" \\----\"Do the Hooky Pokey\" February 18, 1997 \"It's My Parties\": Stacy finds herself in the middle of a war when Stella and Stanley are each throwing simultaneous birthday parties for her. \"Do the Hooky Pokey\": Stacy and Bradley skip school then eventually driven back for their own fear of trouble. 19 6 \"What's the Flap, Jack?\" \\----\"Pool Party\" February 21, 1997 \"What's the Flap, Jack?\": Stacy and Bradley spend their entire day trying to break world records by making the biggest pancake. \"Pool Party\": Bradley, Russell and Lance try to sneak into Melody's \"girly\" party once they hear that the party will have a good deal of Mr. Fizzy and cake at the swimming pool. 20 7 \"Temper, Temper\" \\----\"Aqua Chumps\" September 19, 1997 \"Temper, Temper\": Stacy and Bradley's teasing of each other causes an accidental feud between themselves, their friends, enemies and families. \"Aqua Chumps\": Bradley uses \"Aqua Chimps\" to become famous. Meanwhile, Frank has gone desperately hungry over his own bowl that Bradley used for his \"Aqua Chimps\". 21 8 \"Mouse in the Midst\" \\----\"Texas Chainsaw-Ectomy\" November 4, 1997 \"Mouse in the Midst\": Stacy's home supply of food disappears when the mice overrunning the streets. \"Texas Chainsaw-Ectomy\": Bradley tries to avoid his tonsillectomy. 22 9 \"Report Card of Doom\" \\----\"Ring Toss\" November 7, 1997 \"Report Card of Doom\": The kids receive very weird report card grades. As it turns out, the weird grades are printed errors when Bradley accidentally crashed the whole line of school computers when he find an space action game earlier in the episode, leaving Russell mistakenly chosen for the youngest genius program as he builds a stink bomb. \"Ring Toss\": Stacy accidentally throws away Stella's diamond wedding ring while pretending to be a princess, and Lance and Russell want to cash it in for money. 23 10 \"Doll Day Afternoon\" \\----\"Send in the Clones\" November 18, 1997 \"Doll Day Afternoon\": Bradley's overpowering desire to own a megadestroyer action figure serves as a catalyst for him and Stacy to organize a used toy sale. \"Send in the Clones\": When Stacy and Bradley photocopy themselves, the photocopies come to life and they do Stacy and Bradley's work. They later get tired of doing the work and later become rogue. 24 11 \"What's the Scoop?\" \\----\"Doddler's List\" November 21, 1997 \"What's the Scoop?\": Stacy and Bradley join the school newspaper, but things go terribly awry when their idea of a news headline results in Mr. Lederhosen and Mrs. Mobley getting suspended from Middlestick Elementary. \"Doddler's List\": It's summer vacation, and when the kids have nothing to do, Mr. D sends them out on a scavenger hunt. 25 12 \"Have a Cow, Man\" \\----\"Ice Cream, You Scream\" December 2, 1997 \"Have a Cow, Man\": Bradley and Stacy must consult Mr. D on the matters of farming, when a serious shortage of Cheez Poopers in the Latchkey Gardens area occurs. \"Ice Cream, You Scream\": Stacy and Bradley rush to get ice cream from an ice cream truck, but it disappears the moment they get there. When Mr. D tells them that the owner of the ice cream truck froze to death after he fell off a cliff, they investigate to see if the truck's ghost is haunting them. 26 13 \"The Great Outside\" \\----\"The Treasure of Sierra Latchkey\" December 5, 1997 \"The Great Outdoors\": Stacy and Bradley both disagree on the definition of \"roughing it\". \"The Treasure of Sierra Latchkey\": Stacy and Bradley find a winning token in a bag of Cheez Poopers. But when Frank takes it, they must get it back. === Season 3 (1998) === The show switches back to traditional animation. No. overall No. in season Title Original release date 27 1 \"Battle of the Band\" \\----\"The Scarlet Pimple\" January 20, 1998 \"Battle of the Band\": Stacy and Bradley watch a rock music video, but Stella prefers if they could spend some time outside. So they form a rock band, but have trouble finding members. \"The Scarlet Pimple\": Stacy awakens to find that she has a pimple on her face and worries that people will run away from her. 28 2 \"We're Doomed!\" \\----\"It's Gone Baby, Wheel Gone\" January 23, 1998 \"We're Doomed!\": Bradley thinks the world will end after seeing a tabloid in the newspaper, and decided to spend his last day pranking Lance and Russell, spend all his money, and send a spitball to Principal Coffin, but Stacy knows the world won't end. \"It's Gone Baby, Wheel Gone\": Bradley loses his bike. So he and Stacy try to find it. 29 3 \"A Man Named Gym\" \\----\"A Pizza Carol\" February 3, 1998 \"A Man Named Gym\": Bradley becomes a sports jock. \"A Pizza Carol\": The kids are shocked when Bradley declares that he is going to be the first kid ever in the Latchkey Garden apartments to order a 32-slice mega pizza. 30 4 \"Scared Stupid\" \\----\"Bad News\" February 6, 1998 \"Scared Stupid\": Stacy and Bradley watch a horror movie. \"Bad News\": Stacy and Bradley begin a paper route. 31 5 \"The Great Race\" \\----\"The Ghost and Mr. Coffin\" February 17, 1998 \"The Great Race\": Stacy and Bradley compete in a go-kart race for Dill's birthday. \"The Ghost and Mr. Coffin\": Stacy and Bradley don't know what to wear for Halloween. 32 6 \"Tree's Company\" \\----\"Dear Diary\" February 20, 1998 \"Tree's Company\": Stacy and Bradley form a treehouse club. \"Dear Diary\": Bradley wants Stacy to bring back his overdue library book. 33 7 \"Slime-a-Bean\" \\----\"Voice of Doom\" March 3, 1998 \"Slime-a-Bean\": Bradley comes over to Stacy's for dinner. \"Voice of Doom\": Stacy and Bradley compete to see who can throw their voices farther. 34 8 \"Mission: Implausible\" \\----\"Saturday Afternoon Fever\" March 6, 1998 \"Mission: Implausible\": Stacy and Bradley become secret agents. \"Saturday Afternoon Fever\": Stacy and Bradley lose all sense of decorum in their quest for the most elusive of all collectible action figures: Arm Sling Andy. 35 9 \"Little Barbershop of Horrors\" \\----\"Hippity Hop to the Top\" March 17, 1998 \"Little Barbershop of Horrors\": To avoid missing the season finale of his favorite show, Bradley skips a haircut that his mom assigned him to do. \"Hippity Hop to the Top\": Lance and Russell seek revenge on Bradley's pet frog after Bradley feeds him Lance's pet fly. 36 10 \"Wimbled-uh\" \\----\"Naptitude, Dude\" March 20, 1998 \"Wimbled-uh\": Stacy breaks her arm, preventing her from playing a school table tennis tournament with Bradley. \"Naptitude, Dude\": Bradley studies for an aptitude test. 37 11 \"We're Outta Here\" \\----\"Night of the Living Doddler\"\" March 31, 1998 \"We're Outta Here\": Fed up with life at the Latchkey Garden apartments, Stacy and Bradley leave home. \"Night of the Living Doddler\": Scary noises come to be heard in the Latchkey apartments. 38 12 \"Christmas of Doom!\" April 3, 1998 Stanley regretfully tells Stacy and Bradley that the Latchkey Garden apartments will be demolished. 39 13 \"A Loooong Weekend\" \\----\"Goodbye, Adios, Sayonara Bradley\" April 12, 1998 \"A Loooong Weekend\": Bradley is desperate for Mr. Lederhosen's Friday afternoon gym class to end so he and Stacy can go to the Soaked-till-Sick Waterpark. But something weird happens every time they try to duck out just five teeny weenie minutes early. \"Goodbye, Adios, Sayonara Bradley\": Bradley is moving away from Latchkey Garden Apartments and even Lance and Russell get a little teary eyed. Series Finale. == Production == The series was executive produced by Michael Hirsh, Patrick Loubert, Gerard Mital and Clive A. Smith, supervising produced by Vince Commisso and Stephen Hodgins, and co-ordinating produced by Patricia R. Burns. Laura Kate Wallis, Marianne Culbert and Tom McGillisserved as producers, with the series being directed by John Halfpenny, John Van Bruggen and Chad Hicks. Dale Schott and Hugh Duffy served as story editors and Michelle McCree and Alan Gregg served as YTV executive producers. Dan Hennessey served as a voice director and Karyn Bonello-Tester served as a casting administrator. Category:1996 Canadian television series debuts Category:1998 Canadian television series endings Category:Canadian children's television series",
 "title": "Stickin' Around"
}