{
 "id": "972632",
 "text": "This is a list of people who were born, raised, or closely related with Atlanta, Georgia, United States. ==Academics== Name Known for Association Ron Clark worked with disadvantaged students in rural North Carolina and New York City, and co-founded the Ron Clark Academy in Atlanta; contestant on Survivor: Edge of Extinction lives in Atlanta Thomas E. Hill Professor of Philosophy at University of North Carolina; fellow of the American Academy of Arts and Sciences born in Atlanta Sheryl McCollum crime analyst, professor, founder and director of the non-profit Cold Case Investigative Research Institute born in Atlanta Bazoline Estelle Usher educator and administrator in the Atlanta Public Schools, Georgia Woman of Achievement lived in Atlanta Blake Ragsdale Van Leer former president of Georgia Tech, during his tenure, he was first to admit women and make steps towards integration lived in Atlanta James W. Wagner former president of Emory University lives in Atlanta ==Actors== Name Known for Association Isabella Acres appeared as Rose on the sitcom television series Better Off Ted born in Atlanta Matt Battaglia Emmy Award-winning producer; co-produced a two-time Golden Globe Award-nominated film; acted in over 90 films network pilots and television shows grew up in the towns of Tucker and Lithonia, suburbs of Atlanta Johanna Braddy actress, The Grudge 3, Paranormal Activity 3 and The Levenger Tapes born in Atlanta Toni Braxton singer, actress and reality TV star of Braxton Family Values formerly lived in Atlanta Monica Calhoun actress, The Players Club, The Best Man, The Salon; graduate of Los Angeles County High School for the Arts Katie Carpenter Costume Designer | Producer, Internet Movie Data Base (IMDB), https://www.imdb.com/name/nm5298237/, accessed 23 May 2021 lives and works in AtlantaVoyageATL: Conversations with the Inspiring Katie Carpenter, February 12, 2019, http://voyageatl.com/interview/conversations-inspiring-katie-carpenter/, last accessed 23 May 2021. C. Martin Croker voice actor, Zorak and Moltar on Space Ghost: Coast to Coast David Cross stand-up comedian and actor born in Atlanta Stephen Dorff Actor born in Atlanta Wylie Draper actor, portrayed older Michael Jackson in The Jacksons: An American Dream Corri English actress, in 2006 honored at International Horror and Sci-Fi Film Festival as Best Actress for Unrest Elle Fanning actress and model; younger sister of actress Dakota Fanning; known for I Am Sam, Daddy Day Care, The Curious Case of Benjamin Button, We Bought a Zoo, Maleficent Niles Fitch actor, known for This Is Us and stage work born in Atlanta Jane Fonda Academy Award-winning actress, ex-wife of Atlanta television mogul Ted Turner formerly lived in Atlanta Jeff Foxworthy comedian born in Atlanta Donald Glover actor, Atlanta; rapper under name Childish Gambino Jasmine Guy actress, star of A Different World and film Harlem Nights grew up and lives in Atlanta Omari Hardwick grew up in Atlanta Oliver Hardy comedian and actor studied in Atlanta Steve Harvey actor and comedian resides in Atlanta Ed Helms actor, The Office born in Atlanta Holly Hunter Academy Award-winning actress born in Conyers, outside Atlanta DeForest Kelley actor best known as Dr. McCoy on Star Trek born in Toccoa, outside Atlanta Elijah Kelley Nene Leakes reality TV star of The Real Housewives of Atlanta resides in Atlanta RonReaco Lee Chris Lowell Veronica Mars born in Atlanta Christopher Massey Zoey 101 born in Atlanta Kyle Massey That's So Raven born in Atlanta China Anne McClain actress, The A.N.T. Farm born in Atlanta AnnaLynne McCord Actress born in Atlanta Chloë Grace Moretz actress and model, known for roles in Kick-Ass, Hugo, Carrie; winner of two Saturn Awards born in Atlanta Brittany Murphy actress born in Atlanta Melissa Ordway actress and model; known for her roles on Hollywood Heights, The Young and the Restless born in Atlanta Kip Pardue actor born in Atlanta Robert Patrick actor, played \"T-1000\" in Terminator 2: Judgment Day Ty Pennington Tyler Perry actor, director, screen and playwright, producer, author and songwriter; first film Diary of a Mad Black Woman (2005) moved to Atlanta Victoria Principal actress, Dallas Raven-Symoné actress, The Cosby Show, Hangin' with Mr. Cooper, That's So Raven, The View born in Atlanta Storm Reid actress, Euphoria born in Atlanta Chandler Riggs actor, The Walking Dead born in Atlanta Julia Roberts Academy Award-winning actress; films include Pretty Woman and Erin Brockovich born at Crawford Long Hospital Faith Salie actress, comedian, journalist moved to Atlanta; grew up in Dunwoody Ryan Seacrest TV and radio personality; host of reality-television series American Idol attended Dunwoody High School Christopher Tavarez Kenan Thompson actor and comedian, Saturday Night Live, Fat Albert born in Atlanta Chris Tucker actor and comedian born in Atlanta Barry Van Dyke actor born in Atlanta Devon Werkheiser Ned's Declassified School Survival Guide Porsha Williams reality TV star of The Real Housewives of Atlanta born in Atlanta Scott Wilson actor, In Cold Blood, The Great Gatsby, The Walking Dead Atlanta native Kim Zolciak reality TV star of The Real Housewives of Atlanta ==Sports== Name Known for Association Jordan Adams basketball player born in Atlanta Dennis Allen New Orleans Saints defensive coordinator born in Atlanta Al-Farouq Aminu basketball player born in Atlanta Harris Barton All-Pro NFL offensive lineman grew up in Atlanta Malik Beasley basketball player for Minnesota Timberwolves born in Atlanta Gordon Beckham Major League Baseball player, Seattle Mariners born in Atlanta Stetson Bennett football player born in Atlanta Gunnar Bentz Olympian born in Atlanta Eric Berry football player born in Atlanta Ron Blomberg baseball player born in Atlanta Brandon Boykin football player, Minnesota Vikings born in Atlanta Malcolm Brogdon basketball player for Indiana Pacers born in Atlanta Anthony Carter basketball player, assistant coach for Sioux Falls Skyforce raised in Atlanta, attended Alonzo A. Crim High School Wendell Carter Jr. NBA player for Orlando Magic born in Atlanta, attended Pace Academy Rajah Caruth NASCAR driver born in Atlanta Kristi Castlin track and field athlete born in Atlanta Kelvin Cato basketball player born in Atlanta Ricardo Clark soccer player born in Atlanta Javaris Crittenton basketball player born in Atlanta, attended Southwest Atlanta Christian Academy Ben DiNucci football player born in Atlanta Amanda Doherty golfer born in Atlanta, attended The Galloway School Cameron Dollar basketball player born in Atlanta Derrick Favors basketball player for Oklahoma City Thunder born in Atlanta John FitzPatrick football player for Atlanta Falcons born in Atlanta Joseph Forte basketball player born in Atlanta Dexter Fowler baseball player born in Atlanta Walt Frazier basketball player born in Atlanta World B. Free basketball player born in Atlanta Coco Gauff tennis player born in Atlanta Mark Gilbert Major League Baseball player, ambassador to New Zealand and Samoa born in Atlanta JJ Hickson basketball player born in Atlanta Evander Holyfield world champion heavyweight boxer raised in Atlanta Dwight Howard basketball player for the Los Angeles Lakers born in Atlanta Tim Hyers baseball player and coach born in Atlanta Grady Jarrett football player for the Atlanta Falcons born in Atlanta Ernie Johnson Jr. sportscaster, Turner Sports, TNT raised in Atlanta, attended University of Georgia Adam Jones former football player born in Atlanta Bobby Jones golfer born in Atlanta Brandon Jones NASCAR driver born in Atlanta DeAngelo Malone football player for the Atlanta Falcons born in Atlanta Robert Mathis football player born in Atlanta Erskine Mayer baseball player born in Atlanta Adam Nelson track and field athlete, Olympic champion born in Atlanta Cam Newton football player born in Atlanta Matt Olson Major League Baseball player, Atlanta Braves born in Atlanta Tony Parker basketball player born in Atlanta Lew \"Sneaky Pete\" Robinson drag racer born in AtlantaMotorsportmemorial.org (retrieved October 4, 2018) Jamaree Salyer football player for the Los Angeles Chargers born in Atlanta Kobi Simmons basketball player born in Atlanta Jonantan Villal USL Championship player for the Atlanta United 2 born in Atlanta David Villar Major League Baseball player for the San Francisco Giants born in Atlanta LeRoy T. Walker president of United States Olympic Committee born in Atlanta Bryce Washington soccer player born in Atlanta Ibi Watson basketball player born in Atlanta Darius Watts football player born in Atlanta Caleb Wiley soccer player born in Atlanta Sam Wyche football player and coach born in Atlanta ==Business people== Name Field Known for Association F. Duane Ackerman executive last CEO of Bellsouth lived in Atlanta George Adair developer early Atlanta real-estate developer Dean Alford chief executive officer and politician president and chief executive of Allied Energy Services; member of the Georgia General Assembly Ray Anderson entrepreneur founder of carpet manufacturer Interface, Inc. Charles Brewer businessman founder of Internet service provider MindSpring, which later merged with EarthLink Asa Griggs Candler entrepreneur founder of beverage manufacturer The Coca-Cola Company S. Truett Cathy entrepreneur founder of the fast-food restaurant chain Chick-fil-A Anne Cox Chambers entrepreneur co-owner of mass-media company Cox Enterprises Lemuel Grant businessman and engineer early-Atlanta railroad man, landowner, engineer and businessman James M. Henderson advertising born in Atlanta; lived in Greenville, South Carolina, Republican candidate for lieutenant governor of South Carolina in 1970 Anne T. Hill fashion designer founded Taffy's of California born in AtlantaTaffy Original Designs says fall line will be all cotton with full skirts. Women's Wear Daily. May 10, 1955. Evelyn Greenblatt Howren aviator former WASP who founded aviation businesses in Atlanta, lobbied for aviation industry born in Atlanta William LeGate entrepreneur and activist Thiel Fellowship recipient, founder of multiple companies, activist born in Atlanta Bernard Marcus entrepreneur co-founder of home-improvement retailing chain Home Depot; primary funding source for the Georgia Aquarium Myra Miller entrepreneur and baker famous Black food entrepreneur and baker in Atlanta during Reconstruction worked and buried in Atlanta John Pemberton chemist chemist and inventor of the carbonated soft drink Coca-Cola Richard Peters businessman early-Atlanta railroad man, landowner and a founder of Atlanta John C. Portman Jr. architect international architect and developer, designer of the groundbreaking atrium-style hotel Neel Reid architect student of École des Beaux-Arts; designed various buildings now listed on the National Register of Historic Places Ted Turner media mogul founder of cable-news channel CNN Blake R Van Leer III entrepreneur and producer entrepreneur, partner of business mogul Kathy Ireland whose companies generate $3.1B in sales, produced film about his grandfather Blake R Van Leer in a 1956 Sugar Bowl film born in Atlanta Robert W. Woodruff executive president of beverage manufacturer The Coca-Cola Company ==Directors== Name Known for Association Matt Hullum director of films, music videos and web series including Lazer Team and Red Vs Blue born in Atlanta Spike Lee director of films including She's Gotta Have It, School Daze, and Do the Right Thing, and several music videos born in Atlanta Kenny Leon director of several Broadway plays and several television episodes Tyler Perry director of films, plays, and television series, including Meet The Browns and Madea plays and movies moved to Atlanta Steven Soderbergh film director, Out of Sight, Erin Brockovich, Traffic, Ocean's Eleven ==Journalists== Name Known for Association Brooke Baldwin journalist, currently works for CNN born in Atlanta Pat Conroy author, journalist, educator born in 1945 in Atlanta William Emerson covered the Civil Rights Movement as Newsweeks first bureau chief assigned to cover the Southern United States; later editor in chief of The Saturday Evening Post moved to AtlantaStaff (August 28, 2009). \"William Emerson Dies at 86; Newsweek Journalist Covered the South He Was the Magazine's First Bureau Chief Covering the South a Year Before the Brown vs. Board of Education Ruling and Wrote About the Fight for Civil Rights\". Associated Press (via the Los Angeles Times). August 28, 2009. Retrieved July 13, 2012. Bob Jordan television news journalist, author former news anchor born in Atlanta Frank Stanton Georgia's first Poet Laureate died in Atlanta Ted Turner media mogul, TBS and CNN founder; owned Atlanta Braves moved to Atlanta ==Musicians== Name Known for Association 2 Chainz, real name Tauheed Epps rapper from Atlanta 21 Savage, real name Shayaa Bin Abraham-Joseph rapper born in London, England, moved to Atlanta in his teens 6LACK, real name Ricardo Valdez Valentine rapper, singer, and songwriter moved to Atlanta at very young age André 3000, real name André Lauren Benjamin rapper, singer-songwriter, record producer, actor, and multi-instrumentalist; half of the rap group OutKast born in Atlanta Johntá Austin singer-songwriter, signed to Jermaine Dupri's So So Def Recordings; won two Grammy Awards for songs \"We Belong Together\" by Mariah Carey and \"Be Without You\" by Mary J. Blige born in Atlanta B.o.B, real name Bobby Ray Simmons Jr. rapper from Atlanta Bankroll Fresh, real name Trentavious Zamon White, Sr. rapper from Atlanta and died in Atlanta David Berkeley singer-songwriter with four studio albums and one live album moved to Atlanta for his wife to finish school Big Kuntry King, real name Sean Merrett rapper from Atlanta Bobby V, real name Bobby Wilson singer (nicknamed \"Valentino\" because he was due to be born on Valentine's Day) attended North Atlanta High School and Clark Atlanta University John Burke solo pianist and composer born and lives in Atlanta Kandi Burruss, stage name Kandi singer, songwriter, member of Xscape, reality TV star of The Real Housewives of Atlanta born in and resides in Atlanta K Camp, real name Kristopher Thomas Campbell rapper from Atlanta Cash Out, real name John-Michael Hakim Gibson rapper from Atlanta Cat Power, also known as Chan Marshall, real name Charlyn Marshall singer-songwriter, actress and model born in Atlanta Eddie Chamblee jazz tenor saxophonist born in Atlanta in 1920 Ciara, real name Ciara Harris singer-songwriter, dancer, actress and fashion model moved to Atlanta[ \"Ciara\"]. Billboard. Retrieved December 14, 2006. Clairo, real name Claire Elizabeth Cottrill singer-songwriter born in Atlanta Roscoe Dash, real name Jeffery Lee Johnson Jr. rapper from Atlanta Davido singer, songwriter, and record producer born in Atlanta but based in Nigeria Drumma Boy, real name Christopher James Gholson record producer, songwriter lives in Atlanta Future, real name Nayvadius DeMun Wilburn rapper, singer, songwriter, and record producer born and lives in Atlanta CeeLo Green, real name Thomas DeCarlo Gallaway singer and rapper born in Atlanta Gunna, real name Sergio Giavanni Kitchens rapper and singer from Atlanta Keri Hilson singer-songwriter and actress from Decatur attended Emory University iLoveMakonnen, real name Makonnen Kamali Sheran rapper from Atlanta India.Arie, real name India Arie Simpson singer-songwriter and record producer; has sold over 3.3 million records in the U.S.; has won four Grammy Awards, including Best R&B; Album moved to Atlanta Graham W. Jackson, Sr. theatre organist, pianist and choral conductor moved to Atlanta in 1923 Trinidad James, real name Nicholas Williams rapper from Atlanta Erika Jayne singer born in Atlanta JID, real name Destin Route rapper, singer born in Atlanta Elton John singer-songwriter, English-born entertainer whose songs include \"Your Song\", \"Crocodile Rock\" and \"Candle in the Wind\" lives part-time in Atlanta Kap G, real name George Ramirez rapper and actor born in Long Beach, California, moved to Atlanta R. Kelly singer, songwriter, record producer resided in Atlanta Killer Mike, real name Michael Santiago Render rapper, actor and activist born and lives in Atlanta Gladys Knight singer-songwriter, actress, businesswoman and author born in Atlanta Latto, real name Alyssa Michelle Stephens rapper born in Columbus, Ohio, moved to Atlanta Brenda Lee performer who sang rockabilly, pop and country music; had 37 US chart hits during the 1960s, known for songs \"I'm Sorry\" (1960) and \"Rockin' Around the Christmas Tree\" (1958); recipient of Grammy Lifetime Achievement Award (2009) born in Atlanta in 1944 Mable Lee dancer, entertainer, 2008 inductee into the Tap Dance Hall of Fame born in Atlanta in 1921 Lil Baby, real name Dominique Jones rapper born in Atlanta Lil Gotit, real name Semaja Zair Render rapper from Atlanta Lil Jon, real name Jonathan H. Smith rapper, record producer, songwriter and Grammy winner born and lives in Atlanta Lil Keed, real name Raqhid Jevon Render rapper from Atlanta Lil Nas X, real name Montero Lamar Hill rapper, singer from Atlanta Lil Scrappy, real name Darryl Raynard Richardson III rapper from Atlanta Lil Yachty, real name Miles Parks McCollum rapper, singer from Atlanta Baylee Littrell singer-songwriter and actor; son of Backstreet Boys member Brian Littrell born and raised in Alpharetta Ludacris, real name Christopher Brian Bridges rapper and actor born in Champaign, Illinois, moved to Atlanta Vivek Maddala composer, producer, multi-instrumental performer attended Georgia Tech MadeinTYO, real name Malcolm Jamaal Davis rapper originated in Atlanta Gucci Mane, real name Radric Davis rapper, actor lives in Atlanta China Anne McClain singer-songwriter and actress (Jasmine Payne on TV series Tyler Perry's House of Payne, Chyna Parks on A.N.T. Farm) born in Atlanta Big Maceo Merriweather blues singer-pianist, made many recordings in the 1940s for Bluebird and Victor born in Atlanta in 1905 Monica singer, songwriter, producer, and actress from Atlanta Eric Nam Korean-American singer-songwriter, television host, entertainer and entrepreneur currently based in South Korea born in Atlanta OJ da Juiceman, real name Otis Williams Jr. rapper from Atlanta Pastor Troy rapper from Atlanta Duke Pearson jazz pianist and composer, noted for work on the Blue Note label born in Atlanta 1932, died in Atlanta 1980 Rich Homie Quan, real name Dequantes Lamar rapper from Atlanta Jerry Reed country-music singer-songwriter, guitarist and actor who appeared in more than a dozen films; signature songs include \"Guitar Man\", \"East Bound and Down\", \"A Thing Called Love\" and \"When You're Hot, You're Hot\" born in Atlanta Rich the Kid, real name Dimitri Leslie Roger rapper from Atlanta Rocko rapper from Atlanta Kelly Rowland singer-songwriter with Destiny's Child and as a solo artist; actress and television personality; two-time Grammy Awards winner born in Atlanta Russ rapper from Atlanta SahBabii, real name Saaheem Valdery rapper and songwriter born in Chicago, raised in Atlanta Cappriccieo Scates drummer and record producer; won Phoenix Award in 2011 lives and works in Atlanta Silentó, real name Richard Lamar Hawk rapper, singer from Atlanta Natalie Lauren Sims, also known as Suzy Rock musician, songwriter, graphic and art designer, and music executive moved to Atlanta in 2007 Skooly, real name Kazarion Fowler rapper from Atlanta Musiq Soulchild singer, songwriter resides in Atlanta Soulja Boy, real name DeAndre Cortez Way rapper from Atlanta Southside, real name Joshua Howard Luellen record producer and rapper from Atlanta Angie Stone singer and record producer moved to Atlanta T.I., real name Clifford Joseph Harris Jr. rapper, actor and businessman born in Atlanta Rozonda \"Chilli\" Thomas singer-songwriter, dancer, and actress from TLC born in Atlanta Chris Tomlin contemporary Christian music artist, worship leader and songwriter from Grand Saline, Texas moved to Atlanta and began church DJ Toomp record producer, songwriter and Grammy winner born and lives in Atlanta Trouble, real name Mariel Semonte Orr rapper from Atlanta Unk, real name Anthony Platt rapper from Atlanta Usher, real name Usher Raymond singer-songwriter, dancer and actor; rose to fame in late 1990s with release of second album My Way attended North Springs High School V.I.C., real name Victor Grimmy Owusu rapper from Atlanta Summer Walker singer from Atlanta Florence Warner singer-songwriter; best known for her appearance on television commercials and local television image campaigns born in Atlanta Tionne \"T-Boz\" Watkins singer-songwriter, dancer, and actress from TLC lived in Atlanta Kanye West rapper, record producer, singer-songwriter and fashion designer; one of the best-selling artists of all time born in Atlanta, raised in Chicago YC, real name Christopher Daniels Miller rapper from Atlanta YFN Lucci rapper from Atlanta Young Dro, real name D'Juan Montrel Hart rapper from Atlanta Young Nudy, real name Quantavious Tavario Thomas rapper from Atlanta Young Scooter, real name Kenneth Edward Bailey rapper from Atlanta Young Thug, real name Jeffery Lamar Williams rapper, singer, songwriter born and lives in Atlanta Yung Joc, real name Jasiel Amon Robinson rapper from Atlanta ==Politicians and activists== Name Known for Association Paul V. Applegarth ormer CEO of the Millennium Challenge Corporation raised in Atlanta until college James Earl \"Jimmy\" Carter Jr. governor of Georgia and 39th president of the United States lived in Atlanta, attended the Georgia Institute of Technology Nathan Deal governor of Georgia lived in Atlanta Andre Dickens 61st mayor of Atlanta born in Atlanta John Brown Gordon Confederate lieutenant general and governor of Georgia lived in Atlanta Cora Catherine Calhoun Horne Black suffragist, civil rights activist, and an Atlanta socialite. born and raised in Atlanta, attended Atlanta University Maynard Holbrook Jackson Jr. first black mayor of Atlanta attended college and lived in Atlanta Martin Luther King Jr. civil rights leader, religious leader born in Atlanta Lester Maddox 75th governor of Georgia born and lived in Atlanta Michelle Nunn foreign service, candidate for senator, non-profit CEO born and lived in Atlanta Jon Ossoff US senator of Georgia born and lived in Atlanta Kasim Reed 59th mayor of Atlanta lived in Atlanta Randolph W. Thrower former commissioner of Internal Revenue lived in Atlanta Raphael Warnock first African American US senator of Georgia lived and pastored in Atlanta Charline White first African-American woman to be elected to the Michigan Legislature born in Atlanta Christopher C. Wimbish African-American Illinois state senator and lawyer born and lived in Atlanta'Illinois Blue Book 1953–1954,' Biographical Sketch of Christopher C. Winbish, pg. 188–189 ==Religious leaders== Name Known for Association Paul S. Morton founding pastor of Changing a Generation Full Gospel Baptist Church in Atlanta; founder and first presiding bishop of the Full Gospel Baptist Church Fellowship; Grammy-nominated Gospel recording artist lives in Atlanta Andy Stanley senior pastor of North Point Community Church, Buckhead Church, and other local churches; founded North Point Ministries, a worldwide Christian organization born in Atlanta Charles Stanley senior pastor of First Baptist Church in Atlanta; founder and president of In Touch Ministries; served as president of the Southern Baptist Convention from 1984 to 1986 lives in Atlanta ==Writers and artists== Name Known for Association Violet Chachki drag queen born in Atlanta Lewis Grizzard writer and humorist lived in Atlanta Joel Chandler Harris wrote the Uncle Remus stories lived in West End of Atlanta Cheryl McKay wrote The Ultimate Gift lives in Atlanta Margaret Mitchell wrote Gone With the Wind born in Atlanta Flannery O'Connor Southern gothic writer lived in Atlanta Judith Pordon poet and editor born in Atlanta Lucy May Stanton artist born in AtlantaFowler, Betty Alice (2009). \"Lucy May Stanton (1875–1931)\". New Georgia Encyclopedia. Retrieved March 25, 2013. Natasha Tretheway poet lived in Atlanta ==Related pages== * List of people from Georgia (U.S. state) ==References== People Category:Lists of American people",
 "title": "List of people from Atlanta"
}