{
 "id": "972717",
 "text": "This is a listing of notable people born in, or notable for their relations with the U.S. state of Alabama. __NOTOC__ ==A== * Hank Aaron, Hall of Fame Major League Baseball player (Mobile) * Ralph Abernathy, civil rights leader, Baptist Minister (Linden) * Austin Adams, MLB pitcher, Cleveland Indians (Montgomery) * Mario Addison, NFL player, Carolina Panthers (Birmingham) * Robert Aderholt, representative from Alabama's 4th congressional district since 1997 (Haleyville) * Tommie Agee, MLB player (Magnolia) * Tommie Agee, former NFL player, Dallas Cowboys (Maplesville) * Daniel Alarcón, novelist (Birmingham) * David Donald Albritton, Olympic medalist and politician (Danville) * Doyle Alexander, MLB player (Cordova) * Chalmers Alford, musician (Huntsville) * James B. Allen, U.S. senator (1969–1978) (Gadsden) * Jason Allen, NFL player (Muscle Shoals) * Jonathan Allen, NFL player, Washington Commanders (Anniston) * Maryon Pittman Allen, U.S. senator (1978) (Gadsden and Birmingham) * Mel Allen, sportscaster, Alabama football and New York Yankees (Birmingham) * Viola Allen, stage actress (Huntsville) * Bobby Allison, NASCAR driver (Hueytown) * Davey Allison, NASCAR driver (Hueytown) * David Allison, professor at University of Alabama at Birmingham (Birmingham) * Donnie Allison, NASCAR driver (Hueytown) * John Amari, circuit judge and former member of both houses of the Alabama legislature (Trussville) * Mary Anderson, actress (Birmingham) * Ray Anderson, boxer (Anniston) * Glenn Andrews, U.S. representative (1965–1967) (Anniston) * Ivy Andrews, MLB player (Dora) * Sheila Andrews, country music singer (Athens) * John Archibald, Pulitzer- prize-winning journalist, author (Birmingham) * Anthony J. Arduengo, III, chemist, material scientist, professor at University of Alabama (Tuscaloosa) * R.G. Armstrong, actor (Birmingham) * Lloyd Austin, Secretary of Defense nominee (Mobile, Alabama) * Ethel Ayler, actress (Whistler) ==B== * Spencer Bachus, representative from Alabama's 6th congressional district 1993–2015 (Vestavia Hills) * Mary Badham, actress (Birmingham) * David Baker, activist (Anniston) * Locy Baker, Alabama House of Representatives 1994–2010 (Abbeville) * Hank Ballard, singer (Bessemer) * Tallulah Bankhead, actress (Jasper) * Charles Barkley, Hall of Fame basketball player, television commentator (Leeds) * Reggie Barlow, NFL wide receiver, college football coach (Montgomery) * Desi Barmore (born 1960), American-Israeli basketball player * Mark Barron, NFL player, St. Louis Rams (Mobile) * Inez Baskin, African American journalist and civil rights activist (Florala) * Cynthia Bathurst, animal activist, founder of Safe Humane Chicago and the Court Case Dog Program * Bill Baxley, lieutenant governor (Dothan) * Lucy Baxley, lieutenant governor (2003–2007) (Vestavia Hills) * Colter Bean, former MLB player, New York Yankees (Birmingham) * Paul Bearer, WWE manager and wrestling promoter (Mobile) * Jere Beasley, born in Tyler, Texas, lieutenant governor (1971–1979) (Clayton) * Killer Beaz (born Truett Beasley Jr.), stand-up comedian (Andalusia) * Scott Beason, Alabama state senator (2006–2014) (Hartselle) * Barry Beckett, keyboardist, composer, record producer, original member of Muscle Shoals Rhythm Section (Muscle Shoals) * Ann Bedsole, member of both houses, consecutively, of the Alabama State Legislature 1979 to 1995 (Mobile) * Regina Benjamin, Surgeon General of the United States (Mobile) * Earl Bennett, NFL wide receiver (Birmingham) * Amber Benson, actress (Birmingham) * Bo Bice, singer, American Idol runner-up (Huntsville) * Michael Biehn, actor (Anniston) * James Gillespie Birney (1792–1857), planter, attorney, abolitionist (Huntsville) * Sanford Bishop, U.S. representative from Georgia's 2nd congressional district (Mobile) * Hugo Black, U.S. senator, United States Supreme Court justice (Harlan) * Lucas Black, actor (Speake) * Thomas Edwin Blanton Jr., white supremacist and co-conspirator in the 16th Street Baptist Church bombing (Birmingham) * Eric Bledsoe, NBA player, Milwaukee Bucks (Birmingham) * Winton Blount, businessman, U.S. postmaster general (1969–1972) (Union Springs) * Michael Boley, NFL linebacker (Gadsden) * Jo Bonner, representative from Alabama's 1st congressional district (2003–2013) (Mobile) * Neil Bonnett, NASCAR driver (Hueytown) * Margaret Boozer, sculptor (Anniston) * Young Boozer, state treasurer (Montgomery) * Stephen \"tWitch\" Boss, freestyle hip-hop dancer, entertainer, and actor (Montgomery) * Th-resa Bostick, IFBB professional bodybuilder (Birmingham) * Albert Boutwell, lieutenant governor (1959–1963), mayor of Birmingham (1963–1967) (Birmingham) * Bobby Bowden, college football coach, Florida State (Birmingham) * Larry Bowie, former NFL player, Washington Football Team (Anniston) * Frank W. Boykin, former U.S. representative (Bladon Springs) * Robert Bradley's Blackwater Surprise, music group (Evergreen) * Rick Bragg, Pulitzer Prize- winning author (Possum Trot) * Debbie Bramwell-Washington, IFBB professional bodybuilder (Birmingham) * Jeff Brantley, MLB player, ESPN sportscaster * Albert P. Brewer, governor (1968–1971) (Birmingham) * Jeff Briggs, businessman, video game pioneer (Florence) * Bobby Bright, mayor of Montgomery (1999–2009), representative from Alabama's 2nd congressional district (2009–2011) (Montgomery) * Eric Brock, former NFL player (Alexander City) * David G. Bronner, CEO for Retirement Systems of Alabama (Montgomery), born in Cresco, Iowa * Mo Brooks, representative from Alabama's 5th congressional district since 2011 (Huntsville) * Janice Rogers Brown, U.S. Court of Appeals judge (Luverne) * Jerry Dolyn Brown, folk artist, traditional potter (Hamilton) * Johnny Mack Brown, football player for Alabama, actor (Dothan) * Michael Brown, astronomer (Huntsville) * Roger Brown, artist, member of the Chicago Imagists (Hamilton) * Paul \"Bear\" Bryant, iconic coach of Alabama football, born in Camden, Arkansas (Tuscaloosa) * John Hall Buchanan Jr., representative from Alabama's 6th congressional district (1965–1981) (Birmingham and thereafter Bethesda, Maryland) * Jimmy Buffett, singer- songwriter (Mobile), born in Pascagoula, Mississippi * Bill Burgess, college football head coach, Jacksonville State (Birmingham) * Edward M. Burgess, chemist (Birmingham), inventor of the Burgess reagent * Edward A. Burkhalter, admiral, United States Navy, Chief of Naval Intelligence, Chief of Staff, Defense Intelligence Agency (Roanoke) * Brett Butler, actress (Montgomery) * Keith Butler, NFL coach, Pittsburgh Steelers (Anniston) * Pat Buttram, actor (Addison) * Larry Byrom, rock music guitarist, Steppenwolf (Huntsville) ==C== * Matt Cain, baseball player, San Francisco Giants (Dothan) * Antoine Caldwell, NFL player, Houston Texans (Montgomery) * Sonny Callahan, representative from Alabama's 1st congressional district (1985–2003) (Mobile) * Julia Campbell, actress (Huntsville) * Eli Capilouto, twelfth president of the University of Kentucky (Montgomery) * Truman Capote, author of In Cold Blood, born in Louisiana (Monroeville) * Robert Daniel Carmichael, mathematician (born in Goodwater) * Edward Earl Carnes, judge, United States Court of Appeals for the Eleventh Circuit (Albertville) * DeMarre Carroll, NBA player, Brooklyn Nets (Birmingham) * Clarence Carter, soul singer and musician (Montgomery) * Forrest Carter, writer * Jonathan Carter, former NFL player (Anniston) * Nell Carter, actress, singer (Birmingham) * George Washington Carver, scientist, botanist, born in Diamond, Missouri (Tuskegee) * Herman Frank Cash, white supremacist and co-conspirator in the 16th Street Baptist Church bombing (Birmingham) * Tim Castille, NFL player, Kansas City Chiefs (Birmingham) * Reg E. Cathey, actor (Huntsville) * Quinton Caver, former NFL player (Anniston) * Robert Edward Chambliss, white supremacist and co- conspirator in the 16th Street Baptist Church bombing (Birmingham) * Hosea Chanchez, actor (Montgomery) * Josh Chapman, NFL defensive lineman, Indianapolis Colts (Hoover) * Teresa Cheatham, Miss Alabama 1978 (Wellington) * Elaine Cheris (born 1946), Olympic fencer * Bobby Frank Cherry, white supremacist and co-conspirator in the 16th Street Baptist Church bombing (Birmingham) * Fred Child, host of American Public Media's Performance Today (Huntsville) * Mark Childress, writer (Monroeville) * Stewart Cink, professional golfer (Huntsville) * Bill Clark, college football head coach, University of Alabama (Piedmont) * Bob Clark, actor, director, screenwriter (Birmingham) * Jeremy Clark, NFL player, Dallas Cowboys (Daphne) * Mattie Moss Clark, gospel artist, mother of gospel group The Clark Sisters (Selma) * Clever, rapper (Gadsden) * Nat King Cole, singer (Montgomery) * Ronnie Coleman, football player, Alabama A&M; and NFL's Houston Oilers (Jasper) * Marva Collins, educator (Monroeville) * Commodores, funk/soul band (Tuskegee, Alabama) * Fred Cone, football player for Clemson and NFL's Green Bay Packers, Dallas Cowboys (Pine Apple) * Bull Connor, politician who opposed the activities of the Civil Rights Movement (Selma) * Jared Cook, NFL player, St. Louis Rams (Birmingham) * Jeff Cook, country music guitarist, Alabama (Fort Payne) * Timothy Cook, CEO of Apple Inc. (Robertsdale) * Algernon J. Cooper, former Mayor of Prichard, Alabama (Mobile) * Charles J. Cooper, former Assistant United States Attorney General (Birmingham) * Miles Copeland Jr., musician, CIA officer (Birmingham) * Jerricho Cotchery, NFL player, Carolina Panthers (Birmingham) * DeMarcus Cousins, basketball player, Golden State Warriors (Mobile) * Dennis Covington, author (Birmingham) * Courteney Cox, actress (Mountain Brook) * Tony Cox, actor (Uniontown) * Clayne Crawford, actor (Clay) * Rick Crawford, NASCAR Craftsman Truck Series driver (Mobile) * Julia Pleasants Creswell, poet, novelist (Huntsville) * Howard Cross, football player for Alabama and NFL's New York Giants (Owens Cross Roads) * Ashley Crow, actress (Birmingham) * Brodie Croyle, NFL player, Kansas City Chiefs (Rainbow City) * Korey Cunningham, NFL player, New England Patriots (Montevallo) * Michael Curry, NBA coach, Philadelphia 76ers (Anniston) == D == * Marcell Dareus, NFL player, Buffalo Bills (Birmingham) * Angela Davis, communist activist (Birmingham) * Artur Davis, representative from Alabama's 7th congressional district (2003–2011) (Birmingham) * Mollie Evelyn Moore Davis, poet, writer, educator (Talladega) * N. Jan Davis, astronaut, born in Cocoa Beach, Florida (Huntsville) * Russ Davis, baseball player (Birmingham) * Tae Davis, NFL player, New York Giants (Oxford) * Felicia Day, actress, writer, director, violinist, and singer (Huntsville) * Joe Dawson, American- Israeli basketball player, 1992 Israeli Basketball Premier League MVP * Grant Dayton, baseball player (Huntsville) * Oscar Stanton De Priest, U.S. Congressman from Illinois, civil rights advocate (Florence) * Morris Dees, founder of Southern Poverty Law Center (Montgomery) * Sam Dees, soul music singer (Birmingham) * Diana DeGarmo, American Idol contestant (Birmingham) * David L. DeJarnette, influential archaeologist (Bessemer) * Jeremiah Denton, prisoner of war in Vietnam, U.S. Senator (1981–1987) (Mobile) * Donna D'Errico, actress (Dothan) * James Deshler, Confederate brigadier general (Tuscumbia) * Quinton Dial, NFL player, San Francisco 49ers (Andalusia) * Kim Dickens, actress (Huntsville) * Chris Dickerson, bodybuilder (Montgomery) * Mahala Ashley Dickerson, lawyer (Montgomery) * Parnell Dickinson, NFL quarterback, Tampa Bay Buccaneers (Brighton) * William Louis Dickinson, representative from Alabama's 2nd congressional district (1965 to 1993) (Montgomery) * Oliver W. Dillard, military leader (Margaret) * Larry Dixon, state representative and state senator, Oklahoma native (Montgomery) * Larry Donnell, football player, New York Giants (Ozark) * Vince Dooley, football coach (Mobile) * Deidre Downs, 2005 Miss America (Pelham) * John Drew, NBA player, Atlanta Hawks Utah Jazz (Vredenburgh) * DSharp, violinist, DJ (Anniston) * Erwin Dudley, basketball player (Uniontown) * Benjamin Minge Duggar, botanist, discoverer of tetracycline (Gallion) * Luther Duncan, 4-H pioneer, educator and administrator (Auburn) * Alan Dunn, MLB bullpen coach, Baltimore Orioles (Gadsden) ==E== * Bobby Eaton, pro wrestler (Huntsville) * Annie Easley, mathematician and rocket scientist (Birmingham) * Cleveland Eaton, jazz bassist (Birmingham) * Dennis Edwards, soul music singer (Birmingham) * Jack Edwards, state representative (1965–85) (Mobile) * Joe F. Edwards Jr., astronaut, born in Richmond, Virginia (Roanoke and Lineville) * Carl Elliott, state representative (1949–65) (Jasper) * Jake Elmore, MLB player, Tampa Bay Rays (Pleasant Grove) * Trae Elston, football player (Anniston) * Eric Esch, a.k.a. Butterbean, boxer (Jasper) * James Reese Europe, bandleader, composer (Mobile) * Rodney J. Evans, Medal of Honor winner (Florala) * Terry Everett, state representative (1993–09) (Enterprise) ==F== * Nick Fairley, NFL defensive lineman, St. Louis Rams (Mobile) * Red Farmer, former NASCAR driver (Hueytown) * Paul Finebaum, columnist, author, radio personality, born in Memphis * Howard Finster, folk artist (Valley Head) * Zelda Fitzgerald, writer (Montgomery) * Fannie Flagg, author and actress (Birmingham) * Louise Fletcher, Oscar-winning actress (Birmingham) * Richmond Flowers Jr., football player (Dothan) * Richmond Flowers, Sr., attorney general and activist (Dothan) * Trey Flowers, NFL defensive end, New England Patriots (Huntsville) * Vonetta Flowers, Olympic gold medalist in bobsled, 2002 Salt Lake City Olympics (Birmingham) * Wayne Flynt, editor-in-chief of Encyclopedia of Alabama (Auburn) * Emory Folmar, mayor of Montgomery (1977–1999), Republican gubernatorial nominee in 1982 (Montgomery) * James Folsom Jr., governor (1993–1995), lieutenant governor (1987–1993 and 2007–2011) (Cullman) * Jim Folsom, governor (1947–1951 and 1955–1959) (Cullman) * Dee Ford, NFL player, Kansas City Chiefs (Odenville) * Joe Forehand, CEO of First Data (Alexander City) * George Foster, MLB player (Tuscaloosa) * Reuben Foster, NFL player, Washington Football Team (Roanoke) * Jalston Fowler, NFL player, Tennessee Titans (Mobile) * Melvin Franklin, soul music singer (Montgomery) * Chris Fryar, drummer for Zac Brown Band (Birmingham) ==G== * Noah Galloway, former United States Army soldier and contestant on Dancing with the Stars season 20 (Birmingham) * Oscar Gamble, Major League Baseball outfielder (Ramer) * Pat Garrett, sheriff of Lincoln County, New Mexico, killed Billy the Kid (Cusseta) * A.G. Gaston, businessman, civil rights activist (Birmingham) * Betty Lou Gerson, voice actress, \"Cruella de Vil\" of One Hundred and One Dalmatians (Birmingham) * Charles Ghigna, poet, author (Homewood) * Robert Gibbs, press secretary for President Barack Obama (Auburn) * Kenneth A. Gibson, first black mayor of major eastern city (Newark, New Jersey, 1970–1986) (Enterprise) * Kenneth R. Giddens, director of Voice of America, TV and radio station founder (Pine Apple) * Wallace Gilberry, NFL defensive end, Cincinnati Bengals (Bay Minette) * Horace Gillom, NFL player, Cleveland Browns (Roanoke) * Samuel Ginn, pioneer in wireless communications industry (Anniston) * Brian Ginsberg (born 1966), gymnast, two-time US junior national gymnastics champion * Mark Gitenstein, former U.S. Ambassador to Romania (Florala) * Mickell Gladness, NBA player, Miami Heat (Sylacauga) * Harvey Glance, track and field athlete (Phenix City) * Walton Goggins, actor (Birmingham) * Eli Gold, sportscaster, born in New York (Birmingham) * William Lee Golden, country music singer, The Oak Ridge Boys (East Brewton) * Bobby Goldsboro, singer (Dothan) * Tina Gordon, NASCAR driver (Cedar Bluff) * William C. Gorgas, U. S. Army Surgeon General (Mobile) * Vern Gosdin, country and gospel singer (Woodland) * Mike Gottfried, former college football coach, ESPN commentator (Mobile) * Charles Graddick, judge and Attorney General of Alabama (1975–1983) (Mobile) * Beth Grant, actress (Gadsden) * John Grass, college football coach, Jacksonville State University (Ashville) * Kendall Graveman, MLB player, Oakland A's (Alexander City) * Chris Gray, NFL player (Homewood) * Floride Green, photographer (Eutaw or Mobile) * Hank Green, vlogger and musician (Birmingham) * Leamon Green, visual artist (Anniston) * Urbie Green, jazz trombonist (Mobile) * Frances Nimmo Greene, educator and author (Tuscaloosa) * Kevin Greene, NFL player (Anniston), born in Schenectady, New York * Rusty Greer, MLB player, Texas Rangers (Albertville) * John Grenier, Republican politician (Birmingham) * Parker Griffith, representative from Alabama's 5th congressional district (2009–2011) (Huntsville) * David G. Grimes, insurance agent, Republican politician (Montgomery) * Dexter Grimsley, Alabama House of Representative since 2010 (Abbeville) * Steve Grissom, NASCAR driver (Gadsden) * Winston Groom, author of Forrest Gump (Fairhope) * Gabe Gross, MLB player, Oakland A's (Dothan) * Lafayette Guild, pioneer in research of yellow fever (Tuscaloosa) * Marquies Gunn, former NFL player (Alexander City) * Annabelle Gurwitch, actress (Mobile) ==H== * Rick Hall, record producer (Muscle Shoals) * Mary Katharine Ham, journalist, video blogger, Fox News contributor (Montgomery) * Mia Hamm, soccer player, Olympic and World Cup champion (Selma) * Chris Hammond, MLB pitcher (Vestavia Hills) * Cully Hamner, comic book artist and writer\"Comic creator: Cully Hamner\". Lambiek Comiclopedia. Retrieved July 25, 2013.Wake, Matt (January 23, 2013). \"Cully Hamner, Huntsville native, discusses Superman artist gig and Bruce Willis sequel based on his comics\". AL.com. * Lionel Hampton, jazz musician (Birmingham) * Jon Hand, football player (Sylacauga) * W. C. Handy, jazz composer (Florence) * Charley Hannah, former NFL player (Albertville) * John Hannah, Hall of Fame football player, Alabama and NFL's New England Patriots, born in Georgia (Albertville) * John M. Harbert, billionaire businessman (construction, investments, coal mining properties) (Mountain Brook) * Marguerite Harbert, billionaire heiress (Mountain Brook) * George Hardy, actor, Troll 2 (Alexander City) * James Harman, singer (Anniston) * Roman Harper, NFL player, Carolina Panthers (Prattville) * Emmylou Harris, singer (Birmingham) * William R. Harvey, president of Hampton University (Brewton) * Gustav Hasford, writer, screenwriter (Russellville) * Erskine Hawkins, jazz composer (Birmingham) * George C. Hawkins, member of both houses of the Alabama legislature (Gadsden) * Alexander T. Hawthorn, Confederate States Army general (Conecuh County) * Glenn Hearn, mayor of Huntsville, Alabama, FBI special agent, Alabama legislator (Albertville) * Howell Heflin, Chief Justice, Alabama Supreme Court, United States Senator (1979–1997), born in Poulan, Georgia (Tuscumbia) * Kurt Heinecke, music composer, songwriter, voice actor, photographer (Cullman) * John S. Hendricks, founder, chair and CEO of Discovery Networks (Huntsville) * Richard Hendrix, basketball player (Athens) * Alexis Herman, former Secretary of Labor (Mobile) * Will Herring, NFL player, New Orleans Saints (Opelika) * Jake Hess, gospel quartet singer (Haleyville) * Taylor Hicks, singer, American Idol winner 2006 (Hoover) * Harlon Hill, football player, Chicago Bears (Killen) * Howard Hill, professional archer and stunt archer for films (Wilsonville) * J. Lister Hill, United States Senator (1938–1969) (Montgomery) * Sammie Lee Hill, football player, Detroit Lions (West Blocton) * Joe Hilley, author (Grand Bay) * Brent Hinds, singer, guitarist, Mastodon (Pelham) * Eddie Hinton, musician (Birmingham) * Sylvia Hitchcock, Miss USA and Miss Universe 1967 (Tuscaloosa) * Chandler Hoffman, Major League Soccer player, Los Angeles Galaxy (Birmingham) * Robert Hoffman, actor (Madison) * Bill Holbrook, syndicated comic strip artist (Huntsville) * Mitch Holleman, actor, Reba (Auburn) * Lonnie Holley, artist (Birmingham) * Polly Holliday, actress (Jasper) * Fred Nall Hollis, artist (Troy) * Condredge Holloway, CFL player (Huntsville) * Hardcore Holly, WWE star (Mobile) * Cliff Holman, television personality (Mobile) * Evander Holyfield, World Heavyweight Championship boxer (Atmore) * Perry O. Hooper Jr., member of the Alabama House of Representatives 1984–2003 (Montgomery) * Perry O. Hooper, Sr., former chief justice of the Alabama Supreme Court, first Republican to hold that office (Montgomery) * Robert Horry, basketball player (Andalusia) * Hunter Horton, disc golf player (Chelsea) * Frank House, baseball player and legislator (Bessemer) * Brittany Howard, musician (Athens, Alabama) * Jordan Howard, football player (Gardendale) * Linda Howard, romance writer (Gadsden) * Glenn Howerton, actor (Montgomery) * Freeman A. Hrabowski III, academic, university president (Birmingham) * Cooper Huckabee, actor (Mobile) * Delvin Lamar Hughley, former football player, Colorado Crush (Anniston) * William Bradford Huie, journalist, author (Hartselle) * Bobby Humphrey, former NFL player (Birmingham) * Guy Hunt, governor (1987–1993) (Cullman) * Alan Hunter, original MTV VeeJay (Birmingham) * Zora Neale Hurston, author (Notasulga) ==I== * Osmond Kelly Ingram, Gunner's Mate First Class, U.S. Navy, WWI Medal of Honor recipient (Oneonta) * Kay Ivey, politician and current governor (Camden) ==J== * Bo Jackson, multi-sport athlete (Bessemer) * Kate Jackson, actress (Birmingham) * Katherine Jackson, mother of the Jackson 5 (Barbour County) * Tarvaris Jackson, NFL player (Montgomery) * Henry James, former NBA player * Sonny James, country music singer (Hackleburg) * Mae C. Jemison, astronaut (Decatur) * Desmond Jennings, MLB player, Tampa Bay Rays (Birmingham) * Jerrel Jernigan, NFL player, New York Giants (Eufaula) * Brandon Johnson, former NFL player (Birmingham) * Frank Minis Johnson, federal judge (Haleyville) * Jamey Johnson, country music singer (Montgomery) * Lonnie Johnson, inventor (Mobile) * Michael Johnson, NFL player, Cincinnati Bengals (Selma) * Nico Johnson, former NFL player (Andalusia) * Rashad Johnson, NFL defensive back, Arizona Cardinals (Sulligent) * Samuel E. Johnson, businessman (Birmingham) * Christion Jones, football player (Adamsville) * Dean Jones, actor (Decatur) * Don Jones, NFL player, San Francisco 49ers (Town Creek, Alabama) * Julio Jones, NFL player, Atlanta Falcons (Foley) * Orlando Jones, actor (Mobile) * Robbie Jones, NFL player, New York Giants (Demopolis) * Walter Jones, NFL Hall of Famer, Seattle Seahawks (Aliceville) * Lee Roy Jordan, football player, Alabama and NFL's Dallas Cowboys (Excel) * Ralph \"Shug\" Jordan, football coach, Auburn University (Selma) * Tom Joyner, radio personality (Tuskegee) * Percy Lavon Julian, research chemist (Montgomery) ==K== * Helen Keller, author and activist (Tuscumbia) * Eddie Kendricks, soul music singer (Union Springs) * Jimmy Key, MLB pitcher (Huntsville) * Caitlín R. Kiernan, author (Birmingham) * Craig Kimbrel, MLB pitcher, Atlanta Braves (Huntsville) * Alveda King, minister, anti-abortion activist, author (Birmingham) * Brandon King, NFL safety, New England Patriots (Alabaster) * Coretta Scott King, civil rights leader (Marion) * Martin Luther King Jr., civil rights activist, lived in Alabama in the mid-1950s (Montgomery) * Reggie King, former NBA player (Birmingham) * Troy King, state attorney general (2004–2011) (Montgomery) * William R. King, United States Senator from Alabama (1848–1852), 13th Vice President under President Franklin Pierce (1853–1853) (born in Sampson County, North Carolina) * Woodie King Jr., director, producer (Baldwin Springs) * Dre Kirkpatrick, NFL cornerback, Cincinnati Bengals (Gadsden) * Freddie Kitchens, University of Alabama quarterback, NFL head coach of Cleveland Browns (Gadsden) * Corey Kluber, MLB pitcher, Cleveland Indians (Birmingham) * Mathew Knowles, father of Beyoncé and Solange (Gadsden) * Simmie Knox, painter (Aliceville) * David Koonce, rock musician, Within Reason (Pelham) ==L== * Larry Langford, former mayor of Birmingham (Birmingham) * Adam Lazzara, singer, Taking Back Sunday (Sheffield) * Terry Leach, MLB pitcher (Selma) * Harper Lee, Pulitzer Prize-winning writer of To Kill a Mockingbird (Monroeville) * Perry Lentz, author (Anniston) * Lash LeRoux, professional wrestler, painter, artist (Oxford) * Leon Lett, NFL defensive tackle (Fairhope) * Carl Lewis, track and field athlete, Olympic gold medalist (Birmingham) * David Peter Lewis, governor (1872–1874) (Huntsville) * John Lewis, U.S. Congressman, civil rights leader (Troy) * Monte Lewis, football player (Abbeville) * George Lindsey, actor (Jasper) * Angela Little, model, actress, Playboy Playmate of the Month (Albertville) * Tandy Little, Republican member of the Alabama House of Representatives (1962–1966), real estate developer (Montgomery) * Herman H. Long, college administrator (Birmingham) * Theodore Long, professional wrestling authority figure (Birmingham) * Sarah Ashley Longshore, painter * Joe Louis, boxer, 12-year world heavyweight champion (Lafayette) * Fred L. Lowery, Southern Baptist clergyman and author (Montevallo) * Joseph Lowery, civil rights leader (Huntsville) * Theodore J. Lowi, political scientist (Gadsden) * Rebecca Luker, singer and actress (Helena) * Shelby Lynne, country music singer, born in Virginia (Frankville) ==M== * Sunny Mabrey, model, actress (Gadsden) * Harry Mabry, television newscaster (Birmingham) * Everette Maddox \"Rhett\" Maddox, poet (Montgomery) * Anthony Madison, NFL player, Pittsburgh Steelers (Thomasville) * Boots Mallory, actress (Mobile) * Alfred Malone, NFL player, Houston Texans (Frisco City) * Gucci Mane, musician (Birmingham) * William March, writer, World War I hero (Mobile) * Sharon G. Markette, Illinois state representative, Montgomery * Sen'Derrick Marks, NFL player, Jacksonville Jaguars (Mobile) * Debra Marshall, WWE wrestler (Tuscaloosa) * Kerry James Marshall, artist (Birmingham) * Chris Martin, NFL player (Huntsville) * Harold E. Martin, newspaperman (Montgomery) * Hugh Martin, songwriter (Birmingham) * James D. Martin, U.S. representative from Alabama's 7th congressional district (1965 to 1967) (Gadsden) * Sonequa Martin-Green, actress (Russellville) * F. David Mathews, educator (Grove Hill) * Evan Mathis, NFL player, Denver Broncos (Birmingham) * Jordan Matthews, NFL player, Philadelphia Eagles (Madison) * Bruce Maxwell, MLB player (Huntsville) * Kivuusama Mays, former NFL player (Anniston) * Willie Mays, Hall of Fame center fielder (Birmingham) * Lewis McAllister, businessman and Republican former member of the Mississippi House of Representatives (Tuscaloosa) * Jim McBride, songwriter (Huntsville) * Robert R. McCammon, horror writer (Birmingham) * A. J. McCarron, football quarterback (Mobile) * Elvin McCary, politician (Anniston) * Antoine McClain, former NFL player (Anniston) * Rolando McClain, NFL player, Dallas Cowboys (Athens) * Mary Sue McClurkin, Alabama House of Representatives 1998–2014 (Abbeville) * Mitch McConnell, politician, long-time U.S. Senator from Kentucky since 1985, and Republican Leader of the United States Senate 2015–2021 (Sheffield/Athens) * Willie McCovey, Hall of Fame first baseman (Mobile) * Michael McCullers, screenwriter * K. J. McDaniels, NBA player (Birmingham) * Alexander McGillivray, Creek Indian Chief (Montgomery) * Lachlan McGillivray, Scots-Indian trader (Montgomery) * Garnie W. McGinty, Louisiana historian (Montevallo) * Joe McInnes, corporate and state executive (Wetumpka) * Frank McIntyre, U.S. Army general (Montgomery) * Ronald McKinnon, NFL player, Arizona Cardinals (Elba) * Steve McLendon, NFL player, Pittsburgh Steelers (Ozark) * Gertrude Michael, actress (Talladega) * Chuckie Miller, former NFL player (Anniston) * Don Mincher, MLB player (Huntsville) * Grover Mitchell, jazz trombonist (Whatley) * John Mitchell, NFL coach, Pittsburgh Steelers (Mobile) * Anthony Mix, NFL player (Bay Minette) * Wilmer Mizell, U.S. representative from North Carolina, Major League Baseball pitcher (Vinegar Bend) * Jamario Moon, basketball player (Goodwater) * Charles Moore, civil rights photojournalist (Hackleburg) * Mal Moore, University of Alabama athletic director, former quarterback and offensive coordinator (Dozier) * Roy Moore, chief justice of the Alabama Supreme Court (2001–2003, 2013–2016) (Gadsden) * Thomas Hinman Moorer, admiral, U.S. Navy, Chairman of the Joint Chiefs of Staff (Mount Willing) * Kathryn Morgan, ballet dancer, former soloist with New York City Ballet * Lamar Morris, country singer (Andalusia) * Randall Morris, former NFL player, Seattle Seahawks (Anniston) * C. J. Mosley, NFL player, Baltimore Ravens (Mobile) * Eric Motley, public administrator (Montgomery) * Morgan Murphy, humorist and author (Mountain Brook) * Roger Murrah, songwriter, recording artist (Athens) * Albert Murray, writer (Nokomis) * Johnny Musso, football player (Birmingham) * Pete Myers, basketball player and coach (Mobile) ==N== * Jim Nabors, actor and singer (Sylacauga) * Joe Namath, Hall of Fame quarterback, Alabama and NFL player, born in Beaver Falls, Pennsylvania (Tuscaloosa) * Siran Neal, NFL player, Buffalo Bills (Dothan) * Larry Nelson, PGA golfer (Fort Payne) * Bert Nettles, politician and lawyer, formerly from Monroeville and Mobile (Birmingham) * Elijah Nevett, NFL player (Bessemer) * Ozzie Newsome, football player, Alabama and NFL's Cleveland Browns, executive for Baltimore Ravens (Leighton) * Matthew Newton, conductor, professional railroader (Prattville) * Jimmy Nolen, guitarist (Roanoke) ==O== * Philip Ober, stage and screen actor (Fort Payne) * Benjamin Obomanu, NFL player, Seattle Seahawks (Selma) * Scott Oden, writer (Somerville) * Cathy O'Donnell, actress (Siluria) * Spooner Oldham, songwriter, keyboardist (Center Star) * Stan O'Neal, chairman and CEO of Merrill Lynch (Roanoke) * Katherine Orrison, screenwriter (Anniston) * Osceola, Seminole leader (Tallassee) * Victoria Osteen, co-pastor of Lakewood Church (Huntsville) * Randy Owen, lead singer for band Alabama (Fort Payne) * Jesse Owens, iconic track and field athlete, Olympic gold medalist (Oakville) * Terrell Owens, NFL Hall of Famer (Alexander City) ==P== * Satchel Paige, baseball player (Mobile) * Michael Papajohn, actor, stuntman (Vestavia Hills) * Rosa Parks, civil rights activist (Tuskegee) * Gail Patrick, actress and television producer (Birmingham) * Albert Patterson, Attorney General of Alabama (Phenix City) * John Malcolm Patterson, Governor of Alabama (Phenix City) * Jake Peavy, baseball pitcher (Mobile) * Charley Pell, head football coach at Clemson and Florida (Albertville) * Dan Penn, singer, songwriter, record producer (Vernon) * Blake Percival, Whistleblower (Montgomery) * Walker Percy, author (Birmingham) * Tito Perdue, author (Anniston) * Wayne Perkins musician (Birmingham) * Chuck Person, NBA player (Brantley) * Wesley Person, NBA player (Brantley) * Jesse Lee Peterson, minister, author (Midway) * Sidney Phillips, World War II veteran, physician (Mobile) * Wilson Pickett, R&B; and soul singer (Prattville) * Juan Pierre, MLB outfielder (Mobile) * Charles Redding Pitt, attorney, politician (Decatur) * Adrian Pledger (born 1976), basketball player * Willie Pless, CFL Hall of Famer, Edmonton Football Team (Anniston) * Nathan Poole, former NFL player (Alexander City) * Chris Porter, NBA player (Abbeville) * Monica Potter, actress (Arab) * Paula Poundstone, comedian (Huntsville) * Alma Powell, audiologist, children's author (Birmingham) * Michael Powell, attorney and politician (Birmingham) * Jerraud Powers, NFL player, Arizona Cardinals (Decatur) * Tyrone Prothro, football player, Alabama (Heflin) * Jeremy Pruitt, college football coach, University of Tennessee (Rainsville) ==Q== * I. T. Quinn, conservationist, one of the founders of the National Wildlife Federation (Belgreen) ==R== * Sun Ra, jazz musician (Birmingham) * Sam Raben (born 1997), soccer player * Anthony Radetic, professional water skier (Abbeville) * Max Rafferty, California Superintendent of Public Instruction (1963–1971), education dean at Troy University (Troy) * Thom S. Rainer, writer (Union Springs) * Howell Raines, former New York Times editor (Birmingham) * Albert Rains, representative of Alabama's 7th congressional district (1945–1965) (Gadsden) * Geoff Ramsey, voice actor and producer for Rooster Teeth Productions (Mobile) * LaJuan Ramsey, former NFL player (Anniston) * Theo Ratliff, center for the Charlotte Bobcats (Demopolis) * Ray Reach, jazz pianist, vocalist, arranger, composer, music producer, Director of Student Jazz Programs for the Alabama Jazz Hall of Fame (Birmingham) * Gary Redus, baseball player (Decatur) * Margaret Renkl, writer (Birmingham) * Scottie Reynolds, basketball player at Villanova * Condoleezza Rice, former United States Secretary of State (Birmingham) * Rich Boy, rapper (Mobile) * Al Richardson, former NFL player, Atlanta Falcons (Abbeville) * Tony Richardson, NFL player, New York Jets (Daleville) * Lionel Richie, singer, composer, instrumentalist, producer, and four-time Grammy award winner (Tuskegee) * Bob Riley, Governor of Alabama (2003–2011) (Ashland) * Chris Richards, soccer player (Birmingham) * Alex Ríos, MLB outfielder (Coffee County) * Philip Rivers, quarterback for NFL's San Diego Chargers and North Carolina State University (Decatur) * Robin Roberts, broadcaster on ABC's Good Morning America (Tuskegee) * David Robertson, pitcher for the New York Yankees (Birmingham) * Denard Robinson, NFL player, Jacksonville Jaguars (Birmingham) * Martha Roby, representative from Alabama's 2nd congressional district (2011–2021) (Montgomery) * Chester Rogers, NFL wide receiver (Huntsville) * Jim Rogers, businessman, investor (Demopolis) * Roy Rogers, former NBA player, assistant coach for the Houston Rockets (Linden) * Wayne Rogers, actor (Birmingham) * Michael Rooker, actor (Jasper) * Frank Rose, educator, former President of the University of Alabama (Tuscaloosa) * Marie Rudisill, a.k.a. \"The Fruitcake Lady,\" Truman Capote's aunt (Monroeville) * Council Rudolph, former NFL player (Anniston) * Grayson Russell, actor, Diary of a Wimpy Kid (Clanton) * Jeff Rutledge, NFL quarterback (Birmingham) * Josh Rutledge, MLB infielder (Cullman) * Debby Ryan, actress (Huntsville) * DeMeco Ryans, NFL player, Philadelphia Eagles (Bessemer) ==S== * Warren St. John, author, journalist (Birmingham) * Ed Salem, football player, born in Tucson, Arizona (Birmingham) * Charles E. Samuels Jr., 8th director of the United States Federal Bureau of Prisons (Birmingham) * Chris Samuels, former NFL player for Washington Redskins (Mobile) * Sonia Sanchez, poet (Birmingham) * John Solomon Sandridge, painter, sculptor, author, born in Gadsden, Alabama (Chelsea) * David Satcher, Surgeon General of the United States, second ever and first African-America four-star admiral in United States Public Health Service Commissioned Corps (Anniston) * Eugene Sawyer, 53rd mayor of Chicago (Greensboro) * Bo Scarbrough, NFL player, Detroit Lions (Tuscaloosa) * Beverly Jo Scott, singer and coach on The Voice Belgique (Deer Park) * Richard M. Scrushy, founder and former CEO of HealthSouth (Selma) * Doc Scurlock, a.k.a. Josiah Gordon Scurlock, a founding member of the Lincoln County New Mexico Regulators, member of Billy the Kid's gang (Tallapoosa) * Jay Sebring, hair stylist, Charles Manson murder victim (Birmingham) * Waldo Semon, inventor of vinyl (Demopolis) * David Sessions, member of the Alabama Legislature (Grand Bay) * Jeff Sessions, longtime Alabama Senator 1997–2017; U.S. Attorney General * Joe Sewell, baseball player (Titus) * Luke Sewell, baseball player (Titus) * Rip Sewell, baseball player (Decatur) * Glenn Shadix, actor (Bessemer) * Earnie Shavers, former heavyweight boxer (Garland) * Tommy Shaw, rock musician (Montgomery) * Richard C. Shelby, United States Senator (Birmingham) * Ashton Shepherd, country singer (Coffeeville) * Danny Sheridan, sports broadcaster and prognosticator (Mobile) * Fred Shuttlesworth, civil rights activist (Birmingham) * George Siebels, mayor of Birmingham (1967–1975), state representative (1975–1990) (Birmingham) * Don Siegelman, former governor of Alabama (1999–2003) (Mobile) * Eugene Sledge, World War II veteran, teacher, writer (Mobile) * Percy Sledge, soul singer (Leighton) * Kirby Smart, football coach, defensive coordinator University of Alabama (Montgomery) * Rickey Smiley, comedian (Birmingham) * Albert Lee Smith Jr., representative from Alabama's 6th congressional district (1981–1983) (Birmingham) * Andre Smith, NFL offensive lineman, Cincinnati Bengals (Birmingham) * Ella Gaunt Smith, doll manufacturer (Roanoke) * Holland Smith, general, United States Marine Corps during World War II, father of amphibious warfare (Hatchechubbie) * Johnny Smith, jazz guitarist (Birmingham) * Leighton W. Smith Jr., admiral, United States Navy (Mobile) * Ozzie Smith, Hall of Fame baseball player (Mobile) * Patrick \"j.Que\" Smith, songwriter (Anniston) * Tremon Smith, NFL player, Indianapolis Colts (Saks) * Zeke Smith, football player (Uniontown) * Les Snead, general manager of the St. Louis Rams (Eufaula) * Dylan Riley Snyder, actor, singer (Tuscaloosa) * James Spann, meteorologist, podcast host (Huntsville) * John Sparkman, United States Senator (1946–1979) (Hartselle) * Chauncey Sparks, governor (1943–1947) (Eufaula) * Mark Spencer, president/CEO of Digium (Huntsville) * Octavia Spencer, Academy Awards and Golden Globes award-winning actress (Montgomery) * The Springs, band (Enterprise) * Ken Stabler, NFL player, The University of Alabama and Oakland Raiders (Foley) * Zac Stacy, NFL player, St. Louis Rams (Centreville) * John Stallworth, NFL player, Pittsburgh Steelers (Tuscaloosa) * Bart Starr, Hall of Fame football player, Alabama and Green Bay Packers (Montgomery) * Elizabeth Willisson Stephen, writer, novelist, poet (Marengo County) * Darian Stewart, NFL player, Denver Broncos (Huntsville) * Donald W. Stewart, United States Senator (Anniston) * Mike Stewart, author (Vredenburgh) * Dwight Stone, former NFL player (Florala) * Luther Strange, Attorney General of Alabama (2011–2017) (Mountain Brook) * J. Curry Street, physicist (Opelika) * T. S. Stribling, author (Florence) * Gail Strickland, actress (Birmingham) * Hut Stricklin, NASCAR driver (Calera) * Ruben Studdard, 2003 American Idol winner (Birmingham) * Jimmy Lee Sudduth, artist and blues musician (Fayette) * Pat Sullivan, football player (Birmingham) * Kevin Sumlin, football head coach, Texas A&M; (Brewton) * Don Sutton, Hall of Fame baseball player (Clio) * Barret Swatek, actress and comedian (Birmingham) * Ward Swingle, jazz arranger and composer (Mobile) * Dabo Swinney, football head coach, Clemson (Pelham) ==T== * Tua Tagovailoa, NFL player, Miami Dolphins (Alabaster) * Jaquiski Tartt, NFL football player (Mobile) * Channing Tatum, actor (Cullman) * Toni Tennille, singer of the duo Captain and Tennille (Montgomery) * Adalius Thomas, NFL football player (Equality) * Bryan Thomas, football player (Birmingham) * Fred Thompson, former United States senator from Tennessee, actor (Sheffield) * Fresco Thompson, former major league baseball player and executive * Myron Herbert Thompson, Senior United States District Judge * Neil Thrasher, country singer-songwriter (Birmingham) * Carson Tinker, NFL player, Jacksonville Jaguars (Decatur) * Frank Tipler, mathematical physicist and cosmologist (Andalusia) * Andre Tippett (born 1959), NFL Hall of Fame football player (Birmingham) * Mose Tolliver, artist (Pike Road) * Harry Townes, actor (Huntsville) * Pat Trammell, Alabama Crimson Tide football player, physician (Scottsboro) * William Barret Travis, Commander of the Alamo at San Antonio, Texas (Claiborne) * Jack Treadwell, World War II Medal of Honor winner (Ashland, Alabama) * Justin Tuck, NFL football player (Kellyton) * Cynthia Tucker, columnist and editor (Monroeville) * Joe Turnham, chairman of the Alabama Democratic Party (2005–2011) (Auburn) * Tom Turnipseed, Democratic political activist (Mobile) * Chief Tuskaloosa, Creek Indian chief and leader * Richard Tyson, actor (Mobile) == U == * P. W. Underwood, football player and college coach (Cordova) * Courtney Upshaw, NFL player, Atlanta Falcons (Eufaula) == V == * Robert J. Van de Graaff, engineer, physicist (Tuscaloosa) * Robert Smith Vance, federal judge (Talladega) * Ed Vaughn, Michigan House of Representatives 1979–1980, 1995–2000 (Abbeville) * Ned Vaughn, actor (Huntsville) * Mack Vickery, singer, songwriter (Town Creek) * Scottie Vines, former NFL player (Alexander City) * Wernher von Braun, engineer, physicist (Huntsville) born in Wirsitz, Province of Posen, Poland (then part of German Empire) * Hans A. von Spakovsky, attorney (Huntsville) == W == * Mark Waid, writer (Hueytown) * Jimmy Wales, co-founder of Wikipedia (Huntsville) * Frank Walker, NFL player, Dallas Cowboys (Tuskegee) * Margaret Walker, poet, author (Birmingham) * Ben Wallace, NBA player (White Hall) * Bubba Wallace, NASCAR driver (Mobile) * Cornelia Wallace, second wife of George C. Wallace, First Lady of Alabama (1971–1978) (Montgomery) * Daniel Wallace, writer (Birmingham) * George C. Wallace, four-term governor and four-time presidential candidate (Clio and Montgomery) * George Wallace Jr., former Alabama Public Service Commission member (Montgomery) * Gerald Wallace, basketball player (Childersburg) * Lurleen Burns Wallace, governor (1967–1968) (Montgomery) * Eugene Walter, writer-actor (Mobile) * Jimmie Ward, NFL player, San Francisco 49ers (Mobile) * Kevin Ward, songwriter (Anniston) * DeMarcus Ware, NFL player, Denver Broncos (Auburn) * Adam Warren, MLB pitcher, New York Yankees (Birmingham) * Mervyn Warren, musician (Huntsville) * Dinah Washington, singer (Tuscaloosa) * Mary Burke Washington, economist (Tuskegee) * Ken Watters, jazz trumpeter (Huntsville) * William Weatherford, a.k.a. Red Eagle, Creek Indian leader * Joe Webb, NFL player, Carolina Panthers (Birmingham) * Katherine Webb, model, Miss Alabama USA (Montgomery) * Lardarius Webb, NFL player, Baltimore Ravens (Opelika) * Fred Wesley, musician (Mobile) * Mario West, NBA player, Atlanta Hawks (Huntsville) * Joseph Wheeler, Confederate and US General, US Congressman, namesake of Wheeler State Park and Wheeler National Wildlife Refuge, author (Hillsboro) * Chris White, NFL player, Buffalo Bills (Mobile) * D. J. White, NBA player, Charlotte Bobcats (Tuscaloosa) * Pat White, NFL player, Miami Dolphins (Daphne) * Heather Whitestone, 1995 Miss America (Dothan) * Chase Whitley, MLB player, New York Yankees (Ranburne) * Joe Whitt Jr., NFL coach, Green Bay Packers (Auburn) * Barbara Wiedemann, poet and English professor (Montgomery) * Deontay Wilder, professional boxer (Tuscaloosa) * Mark Wilkerson, musician (Enterprise) * Billy Williams, Hall of Fame baseball player (Mobile) * Carnell Williams, NFL player, Tampa Bay Buccaneers (Attalla) * Cootie Williams, jazz trumpeter (Mobile) * Hank Williams, country musician (Georgiana) * Hank Williams Jr., country musician (Cullman) * Holly Williams, country musician (Cullman) * Lee Williams, professional golfer (Alexander City) * Nick Williams, NFL player, Kansas City Chiefs (Birmingham) * Paul Williams, soul singer (Birmingham) * Josh Willingham, MLB left fielder, Kansas City Royals (Florence) * James Willis, former NFL linebacker (Huntsville) * E. O. Wilson, biologist and writer (Birmingham) * Martha Loftin Wilson, missionary worker, educataor (Clarke County) * Kathryn Tucker Windham, storyteller and author (Dallas County) * Jameis Winston, NFL quarterback, Heisman Trophy winner (Bessemer) * Reynolds Wolf, meteorologist (Jemison) * Tobias Wolff, author (Birmingham) * Roy Wood Jr., stand-up comedian (Birmingham) * Ray Woodard, \"Father of soccer in Alabama\" (Pelham) * Tricia Woodgett, screenwriter (Anniston) * Mark Woodyard, MLB pitcher, Detroit Tigers (Mobile) * Wesley Wright, MLB pitcher, Baltimore Orioles (Montgomery) * Tammy Wynette, country singer (Red Bay) == Y == * YBN Nahmir, rapper (Birmingham) * Yelawolf, rapper (Gadsden) * T. J. Yeldon, running back (Daphne) * Byron York, conservative political columnist (Birmingham) * Tom York, television personality (Hoover) * Coleman Young, former mayor of Detroit, Michigan (Tuscaloosa) * Delmon Young, baseball player (Montgomery) * Martevious Young, football player (Alexander City) == Z == * John Zimmerman, professional pair skater and coach (Birmingham) ==References== People",
 "title": "List of people from Alabama"
}