{
 "id": "972720",
 "text": "This is a list of notable people born in, or notabe for their relations with the U.S. state of Indiana. ==Creators and explorers== * Squire Boone, frontiersman (Laconia) * Jonathan Jennings, first Governor of Indiana * Dennis Pennington, first speaker of the house in Indiana, also built the first capitol building (Corydon) * Spier Spencer, militia leader who died in the Battle of Tippecanoe ==Military== * Jeremy Michael Boorda, Admiral, Chief of Naval Operations (South Bend) * Ambrose Burnside, General in the Civil War, sideburns are named after him (Liberty) * John Howard Cassady U.S. Navy Admiral, Commander in Chief Naval Forces Eastern Atlantic and Mediterranean (Spencer) * George Rogers Clark, man who conquered Indiana for the United States (Clarksville) * Sammy L. Davis, Medal of Honor recipient (receiver) from the Vietnam War, U.S. Army (Freedom) * Jonathan D. George, retired Air Force brigadier general. 9th District congressional candidate (Bedford) * William Grose, Civil War General (New Castle) * Scott S. Haraburda, Colonel, U.S. Army. President of the Indiana Society of Professional Engineers (Spencer) * Horace Meek Hickam, Lieutenant Colonel, U.S. Army Air Corps. Aviation pioneer. The Hickam AFB was named in his honor (Spencer) * Jonas Ingram, Medal of Honor recipient, Atlantic Fleet commander in World War II (Jeffersonville) * Henry Maston Mullinnix, Rear Admiral, U.S. Navy. was named in his honor (Spencer) * John Poindexter, Vice Admiral, U.S. Navy. National Security Advisor to President Ronald Reagan, figure in the Iran-Contra affair (Odon) * David M. Shoup, Medal of Honor recipient, 22nd Commandant of the Marine Corps (Battle Ground) * Walter Bedell Smith, General, U.S. Army, chief of staff to General Dwight D. Eisenhower (Indianapolis) * Raymond Ames Spruance, Admiral, U.S. Navy, Flagship Commander USS Indianapolis (Indianapolis) * Lew Wallace, General in the Civil War (Crawfordsville) * Anthony Wayne, known for being mad and overrunning Chief Little Turtle (Fort Wayne) * Samuel Woodfill, most decorated American soldier in World War I (Jefferson County) Category:People from Indiana",
 "title": "List of people from Indiana"
}