{
 "id": "972876",
 "text": "Muhammad Alauddin Siddiqui (; 1 January 1938 – 3 February 2017) was an Islamic scholar. He appeared in islamic programmes on ARY Q TV and on NOOR TV. He established madrassas for religious education and mosques in Pakistan and England. He was also the founder ofMohiudin Islamic University in Nerian Sharif and Mohiudin Islamic Medical College in Mirpur. == Education == Siddiqui studied his early Islamic education in the presence of his father, Pir Ghulam Mohi-ud-Din. Later, in Jamia Haqqa’iq al Uloom he studied Mishkat Sharif and Jalalayn. His passion for further studies brought him to Jamia Naeemia Lahore where he completed lessons. Then he participated in the Daura e Qur'an with Abdul Ghufar Hazarawi. He next completed the teaching of Hadith Mubarakah from Sardar Ahmad Chishti. == Protest against Islamophobia == On October 6, 2012 to express his outrage at the recent film Innocence of Muslims, Siddiqui called for a protest outside Parliament of London. He appealed to the Muslim to unite under the banner of the Prophet of Islam. He spoke on the importance of a united front of the Muslim Ummah against Islamophobia. Thousands of Muslims gathered outside the Houses of Parliament in London on Saturday, October 2012 to express their feelings about the honoring of Muhammad. It was attended by Muslims from all sects of the Islamic community, including speakers from Sunni and Shia Islam. == Awards and honors == On 10 June 2012,Siddiqui was awarded the Lifetime Achievement Award for humanitarian, education and health services by Institute of Peace and Development. Siddiqui's name was appeared seven times in the list of 500 Most Influential Muslims in the list of \"Preachers and Spiritual leaders\" from UK. == Death == Alauddin Siddiqui died in London, February 3, 2017 after a short illness. == Funeral == Two funeral prayers were offered for him. First funeral prayer was held in Birmingham's Austin Park. More than 20,000 people attended. His second funeral prayer was led by his older son Sultan Ul Arfeen Siddiqui held in his home town Nerian Sharif. Was attended by more than 50,000 people . He was buried in Nerian Sharif, Azad Kashmir. ==References== Category:No local image but image on Wikidata Category:2017 deaths Category:1936 births",
 "title": "Muhammad Alauddin Siddiqui"
}