{
 "id": "972993",
 "text": "Judah is a person from the Book of Genesis. He was the ancestor of the tribe that became the Kingdom of Judah. ==Birth== It is written in the Torah, in the Book of Genesis that Jacob married both Leah and her sister Rachel. He loved Rachel but not Leah. So Leah prayed to the Lord for a son so that she wouldn’t be hated. Then Leah became pregnant and gave birth to a son and she said “now my husband shall love me” and named him Reuben. Then Leah gave birth to a second son and said that the Lord had heard her voice so she named him Simeon. Then Leah gave birth to a third son and said “I have poured my heart unto the Lord” and named him Levi. Then Leah gave birth to a fourth son. She said “this time I will thank the Lord” and she named him Judah. ==Family History== After Judah was born, Rachel came to Jacob and said “give me children otherwise I am dead”. Jacob told her that he couldn’t give her a miracle like that since he was only human. So Rachel told Jacob to marry her servant Bilhah. Bilhah gave birth to two sons named Dan and Naphtali. Leah then told Jacob to marry her servant Zilpah. Zilpah gave birth to two sons named Gad and Asher. Then Leah gave birth to Zebulun and Issachar. Then Leah gave birth to a daughter Dinah and Rachel gave birth to a son Joseph. Later, Rachel died in childbirth and her son was named Benjamin. ==Sale of Joseph== Jacob loved Joseph more than all of his other children. Joseph was born when he was an old man. It took many years for Rachel to be able to give birth. So Jacob gave Joseph a coat with many colours. And Joseph had dreams about his brothers all bowing to him so they became jealous and they took Joseph and threw him in a big hole in the ground and left him to die. But then Judah felt guilty about that. He told his brothers that instead of letting Joseph die, they should take him and sell him as a slave to the Ishmaelites and they did. And when Reuben found out, he was angry with Judah because Reuben was planning to rescue Joseph. ==Tamar== Judah married a woman and had three sons named Er, Onan and Shelah. Er married a woman named Tamar but Er died childless so Judah told Onan to marry Tamar and raise their children to think of themselves as the children of Er to honour his memory. But instead of having children with her, Onan threw his semen on the ground. The Lord killed Onan for this. After Onan died, Judah’s son Shelah was supposed to marry Tamar. Judah didn’t let him do that because he was scared Shelah would also die. So Tamar dressed up as a prostitute and had sex with Judah but asked for his staff and seal to let her know that he would pay. When Judah came back to pay her, not having recognized her as Tamar, she was gone. When the people told Judah that Tamar was pregnant Judah said to burn her for prostitution. Tamar said that the father was the person who owned the staff, seal and cord. Then Judah said “she is indeed more righteous than I am” and said he was the father. So Judah married Tamar and she gave birth to twins named Peretz and Zerach. ==Reunion with Joseph== When there was a famine in Canaan, Judah and his brothers except for Joseph and Benjamin came to Egypt to ask for grain. Joseph was the viceroy. Judah and the others didn’t recognize him. Joseph asked them if they had any other brothers and they told him about Benjamin. Joseph then said they were spies. He jailed Simeon and said that he would only free him if they brought Benjamin to Egypt to prove they were telling the truth. When they told Jacob this, he said “first, I lost Joseph, then I lost Simeon, and now you would have me lose Benjamin!”. Judah still convinced Jacob to let him bring Benjamin to Egypt by making a promise to protect him. And when they made it to Egypt, Joseph freed Simeon and gave the brothers everything they wanted. He framed Benjamin for stealing from him and said he would enslave Benjamin as punishment. So Judah begged Joseph to have mercy on Benjamin and enslave Judah instead. Then all of Judah’s brothers joined in saying the exact same thing. Joseph told them “I am Joseph, your brother”. Judah and his brothers thought that Joseph would want revenge but instead Joseph gave them his forgiveness saying that the Lord had brought him to Egypt to save lives. ==Tribe of Judah== In the Tanakh, Judah’s descendants are a tribe called the Tribe of Judah. In the Book of Exodus, Nacshon is the first person to jump before the splitting of the sea and is from the Tribe of Judah. And when Moses sends twelve spies to Canaan in the Book of Numbers, one for each tribe, Caleb is the spy for Judah. Aside from Joshua he is the only one of them to say nice things about the Promised Land. In the Book of Judges the first Judge Othniel is from the Tribe of Judah. Judah is normally the tribe that leads the Israelites in battle. ==Davidic Ancestry== In the Book of Ruth, Judah’s son Peretz became the ancestor of Boaz. Boaz married Ruth. They had a son Jesse and Jesse became the father of David. In the Books of Samuel, David became King of the tribe of Judah after Saul died. He only became King of Israel after the death of Saul’s son Ishbosheth. ==Kingdom of Judah== After David’s son King Solomon died, his son Rehoboam couldn’t keep the kingdom together so it split into two kingdoms. The one in the north was called the Kingdom of Israel and the one in the south was called Judah. The kingdom of Judah was eventually destroyed by Nebuchadnezzar II who exiled its people. ==The Jews== After the Kingdom of Israel was conquered and destroyed by Assyria, the kingdom of Judah survived under the leadership of Hezekiah.Its people came to be known as the Judahites or the Jews, meaning the people of Judah. And even after the exile to Mesopotamia started, they still called themselves the Jews. ==Zerubabel== In the later books of the Tanakh, a man named Zerubabel, who is a descendant of Judah is important in rebuilding the Temple of Jerusalem. ==The Messiah== Prophecies in the Tanakh and Old Testament say that the Messiah would be a descendant of David, who was descended from Judah, and that he would bring Judah and Israel back from exile. ==Christianity== The New Testament begins the Gospel of Matthew with a family tree. This has Judah become the father of Peretz and Zerach, with Peretz becoming the ancestor of Jesus’s stepfather Joseph. The Gospel of Luke says that the Virgin Mary is also a descendant of David making Judah an ancestor of Jesus. Category:Old Testament people",
 "title": "Judah (son of Jacob)"
}