{
 "id": "972999",
 "text": "The \"State Anthem of the Moldavian SSR\" (, ) was the anthem of Moldova from 1945 to 1991. ==Lyrics== ===Original version (1945–1953)=== Cyrillic script (then official) Latin script (now official) IPA transcription (Moldavian dialect) Poetic English translation I Молдова ку дойне стрэбуне пе плаюрь, Ку поамэ ши пыне пе дялурь ши вэй. Луптынд ку-ажуторул Русией мэреце, А врут неатырнаря пэмынтулуй ей. Рефрен: Славэ ын вякурь, Молдовэ Советикэ, Креште ку алте републичь сурорь, Ши ку драпелул Советик ыналцэ-те, Каля сэ-ць фие авынт крятор. II Пе друмул луминий ку Ленин ши Сталин, Робия боерилор крунць ам ынвинс. Пе ной дин избындэ-н избындэ ынаинте, Не дуче слэвитул партид комунист. Рефрен III Ын армия ноастрэ, луптынд витежеште, Пе душманий цэрий ый вом бируй, Ши-н маря фамилие а Униуний, Молдова Советикэ-н вечь а-нфлори. Рефрен I Moldova cu doine străbune pe plaiuri, Cu poamă și pâne pe dealuri și văi. Luptând cu-ajutorul Rusiei mărețe, A vrut neatârnarea pământului ei. Refren: Slavă în veacuri, Moldovă Sovietică, Crește cu alte republici surori, Și cu drapelul Sovietic înalță-te, Calea să-ți fie avânt creator. II Pe drumul luminii cu Lenin și Stalin, Robia boierilor crunți am învins. Pe noi din izbândă-n izbândă înainte, Ne duce slăvitul partid comunist. Refren III În armia noastră, luptând vitejește, Pe dușmanii țării îi vom birui, Și-n marea familie a Uniunii, Moldova Sovietică-n veci a-nflori. Refren 1 [mol.do.va ku doj.ne strə.bu.ne ce pla.jurʲ ku po̯a.mə ʃi pɨ.ne pe de̯a.lurʲ ʃi vəj lup.tɨnd kwa.ʒu.to.rul ru.si.jej mə.re.tse a vrut ne̯a.tɨr.na.re̯a pə.mɨn.tu.luj jej] [re.fren] [sla.və ɨɱ ve̯a.kurʲ mol.do.və so.vje.ti.kə] kreʃ.te ku al.te re.pu.blit͡ʃʲ su.rorʲ ʃi ku dra.pe.lul so.vjə.tik ɨ.nal.tsə.te ka.le̯a sət͡sʲ fi.je a.vɨnt kre̯a.tor] 2 [pe dru.mul lu.mi.nij ku le.nin ʃi sta.lin ro.bi.ja bo.je.ri.lor krunt͡sʲ am ɨn.vins pe noj din iz.bɨn.dən̩ iz.bɨn.də ɨ.na.in.te ne du.t͡ʃe slə.vi.tul par.tid ko.mu.nist] [re.fren] 3 [ɨn ar.mi.je no̯as.trə lup.tɨnd vi.te.ʒəʃ.te pe duʃ.ma.nij t͡sə.rij ɨj vom bi.ru.i ʃiɲ̩ ma.re̯a fa.mi.li.je a u.ni.u.nij mol.do.va so.vje.ti.kəɲ̩ vet͡ʃʲ aɱ.flo.ri] [re.fren] I Moldova, land of ancestral doina-s abound, Its hills and valleys, where grapes and bread are found. With the aid of Great Russia, we fight in battle, To make thy land free, we conquer thy struggle. Refrain: O Soviet Moldova, eternally flourish, With the others, we are able to grow, And around the Soviet flag, up it riseth, Let the path be thy great gifted flow. II Lenin and Stalin, with us, in thy path agleam, We have defeated the cruel boyar's bondage. For us from victory to victory alee, The glorious Communist Party leadeth us! Refrain III Among our Army, fighting valiantly, We'll beat the enemies of thy country, And in the great family of the Union, Soviet Moldavia shall flourish evermore. Refrain ===Post-Stalinist version (1980–1991)=== Moldovan Cyrillic script (then official) Romanian Latin script (now official) IPA transcription (Moldavian dialect) Poetic English translation I Молдова Советикэ, плаюл ностру-н флоаре, Алэтурь де алте републичь сурорь. Пэшеште ымпреунэ ку Русия маре, Спре ал Униуний сенин виитор. II Дойна ынфрэцирий прослэвеште Цара, Ку ынцелепчиуне кондусэ де Партид. Кауза луй Ленин – каузэ мэряцэ – О ынфэптуеште попорул стрынс унит. III Славэ ын вякурь, ренэскут пэмынт! Мунка сэ-ць фие крятор авынт! Ши комунисмул – цел нестрэмутат – Ыналцэ-л прин фапте пентру феричиря та!Духовой оркестр МО СССР - Государственный гимн Молдавской ССР текст песни I Moldova Sovietică, plaiul nostru-n floare, Alături de alte republici surori. Pășește împreună cu Rusia mare, Spre al Uniunii senin viitor. II Doina înfrățirii proslăvește Țara, Cu înțelepciune condusă de Partid. Cauza lui Lenin – cauză măreață – O înfăptuiește poporul strâns unit. III Slavă în veacuri, renăscut pământ! Munca să-ți fie creator avânt! Și comunismul – țel nestrămutat – Înalță-l prin fapte pentru fericirea ta! 1 [mol.do.va so.vje.ti.kə pla.jul nos.truɱ̩ flo̯a.re a.lə.turʲ de al.te re.pu.blit͡ʃʲ su.rorʲ pə.ʃəʃ.te ɨm.prew.nə ku ru.si.je ma.re spre al u.ni.u.nij se.nin vi.ji.tor] 2 [doj.na ɨɱ.frər.t͡si.rij pro.slə.veʃ.te t͡sa.ra ku ɨn.t͡se.lep.t͡ʃi.u.ne kon.du.sə de par.tid kaw.za luj le.nin kaw.zə mə.re̯a.tsə o ɨɱ.fəp.tu.jeʃ.te po.po.rul strɨns u.nit] 3 [sla.və ɨɱ ve̯a.kurʲ re.nəs.kut pə.mɨnt muŋ.ka sət͡sʲ fi.je kre̯a.tor a.vɨnt ʃi ko.mu.niz.mul t͡sel nes.trə.mu.tat ɨ.nal.tsəl̩ priɲ fap.te pen.tru fe.rɨ.t͡ʃi.re̯a ta] 1 Soviet Moldova, our land of flowers, Along with our sister republics, Together with Great Mother Russia we march on, Toward the Union's future so serene. 2 The fraternal doina the country praiseth, As our great Party sagaciously us leadeth. The cause of Lenin, a cause so noble, Brought about by our undivided people. 3 Of aeons glorious, oh land renewed! For thee may labour be a sire great! And communism, this goal unshaken – Thou raisest it through the achievements for thy blessing! ==References== Category:Anthems of Soviet Socialist Republics Category:Moldovan anthems",
 "title": "Anthem of the Moldavian Soviet Socialist Republic"
}