{
 "id": "972996",
 "text": "The \"State Anthem of the Georgian SSR\" (, ) was the anthem of Georgia from to 1991. == Lyrics == === Post-Stalinist version === Georgian IPA transcription Russian English translation იდიდე მარად, ჩემო სამშობლოვ, გმირთა კერა ხარ განახლებული, დიად პარტიის ნათელი აზრით ლენინის სიბრძნით ამაღლებული. შენი ოცნება ასრულდა, რისთვისაც სისხლი ღვარეო, მშრომელი კაცის მარჯვენით აყვავებულო მხარეო. დიდი ოქტომბრის დროშის სხივებმა შენ გაგინათეს მთები ჭაღარა, თავისუფლებამ და შემართებამ გადაგაქციეს მზიურ ბაღნარად. მოძმე ერების ოჯახში ამაღლდი, გაიხარეო, მეგობრობით და გმირობით გამორჯვებულო მხარეო. უხსოვარ დროდან ბრწყინავდა შენი აზრი, ხმალი და გამბედაობა, დღეს საქართველოს ნათელ მომავალს სჭედს ლენინური წრთობის თაობა. კომუნიზმის მზე დაგნათის, კაშკაშა, მოელვარეო, იდიდე მრავალჟამიერ, ჩემო სამშობლო მხარეო. t͡ʃʰɛmɔ sɑmʃɔblɔw ‖] [gmirtʰɑ k’ɛrɑ χɑr gɑnɑχlɛbuli ‖] [diɑd p’ɑrt’iːs nɑtʰɛli ɑzritʰ] [lɛninis sibr̩d͡znitʰ ɑmɑʁlɛbuli ‖] [ʃɛni ɔt͡sʰnɛbɑ ɑsruldɑ ‖] [ristʰwisɑs sisχli ʁwɑrɛɔ |] [mʃrɔmɛli | k’ɑt͡sʰis mɑrd͡ʒwɛnitʰ] [ɑq’wɑwɛbulɔ mχɑrɛɔ ‖] [didi ɔkʰt’ɔmbris drɔʃis sχiwɛbmɑ] [ʃɛn gɑginɑtʰɛs mtʰɛbi t͡ʃ’ɑʁɑrɑ |] [tʰɑwisupʰlɛbɑm dɑ ʃɛmɑrtʰɛbɑm] [gɑdɑgɑkʰt͡sʰiɛs mziur bɑʁnɑrɑd ‖] [mɔd͡zmɛ ɛrɛbis ɔd͡ʒɑχʃi |] [ɑmɑʁldi | gɑiχɑrɛɔ |] [mɛgɔbrɔbitʰ dɑ gmirɔbitʰ] [gɑmɔrd͡ʒwɛbulɔ mχɑrɛɔ ‖] [uχsɔwɑr drɔdɑn br̩t͡s’q’inɑwdɑ ʃɛni] [ɑzri | χmɑli dɑ gɑmbɛdɑɔbɑ |] [dʁɛs sɑkɑrtʰwɛlɔs nɑtʰɛl mɔmɑwɑls] [ʃt͡ʃ’ɛd͡z lɛninuri t͡s’r̩tʰɔbis tʰɑɔbɑ ‖] [k’ɔmunizmis mzɛ dɑgnɑtʰis |] [k’ɑʃk’ɑʃɑ mɔɛlwɑrɛɔ |] [ididɛ mrɑwɑlʒɑmiɛr |] [t͡ʃʰɛmɔ sɑmʃɔblɔ mχɑrɛɔ ‖] Славься в веках, моя Отчизна, Обновленный очаг героев; Ты светлым разумом великой партии И мудростью Ленина возвышена. Сбылась твоя мечта, За которую ты кровь проливала, Неутомимая рука труженика Тебя к расцвету привела. Сияние знамен Великого Октября Озарило твои седые вершины, Свобода, мужество и доблесть Превратили тебя в солнечный край. В братской семье народов Ты достигла невиданных высот, Дружбой и силой всенародной Побеждала ты и побеждаешь. С незапамятных времен блистали Твой разум, твой меч и твоя отвага. Сегодня светлое будущее Грузии Кует поколение ленинской закалки. Солнце коммунизма сияет Все ярче над тобой, Славься в веках, моя Родина, Мой край родной! Glory to you for ever, my Fatherland, A new forge of heroes; By the Great Party's blessing mind And Lenin's wisdom you've been risen. Your dream has come true, For which you shed your blood: A worker's tireless hand Has led you to prosperity. The Great October's banners' shining Has lit up your ancient peaks, Liberty, courage and audace Have turned you into a sunny land. In the family of the fraternal peoples You've reached unachievable heights, By friendship and nationwide strength You've triumphed and will triumph. Since long ago were shining Your mind, your sword and your courage, Now the generation of Lenin's temper forges Georgia's grandeur and serene future. The sun of communism is shining Brighter and brighter over you, Glory to you for ever, my Motherland, My native land! === Original version === Georgian IPA transcription English translation იდიდე მარად, ჩვენო სამშობლოვ, გმირთა კერა ხარ გაუქრობელი, ქვეყანას მიეც დიდი სტალინი ხალხთა მონობის დამამხობელი. შენი ოცნება ასრულდა, რისთვისაც სისხლი ღვარეო, აყვავდი, ტურფა ქვეყანავ ილხინე, ქართველთ მხარეო. დიდი ოქტომბრის შუქით ლენინმა შენ გაგინათა მთები ჭაღარა, სტალინის სიბრძნემ ძლევით შეგმოსა გადაგაქცია მზიურ ბაღნარად. მოძმე ერების ოჯახში დამკვიდრდი, გაიხარეო, აყვავდი, ტურფა ქვეყანავ ილხინე, ქართველთ მხარეო. უხსოვარ დროდან ბრწყინავდა შენი აზრი, ხმალი და გამბედაობა, დღეს შენს დიდებას, ნათელ მომავალს სჭედს სტალინური წრთობის თაობა. საბჭოთა დროშა დაგნათის, მზესავით მოელვარეო, აყვავდი, ტურფა ქვეყანავ ილხინე, ქართველთ მხარეო. t͡ʃʰwɛnɔ sɑmʃɔblɔw |] [gmirtʰɑ k’ɛra χɑr gɑukʰrɔbɛli |] [kwɛq’ɑnɑs miɛt͡sʰ didi st’ɑlini] [χɑlχtʰɑ mɔnɔbis dɑmɑmχɔbɛli ‖] [ʃɛni ɔt͡sʰnɛbɑ ɑsruldɑ |] [ristʰwisɑs sisχli ʁwɑrɛɔ |] [aq’wɑwdi | t’urpʰɑ kʰwɛq’ɑnɑw] [ilχinɛ | kʰartʰwɛltʰ mχarɛɔ ‖] [didi ɔkʰt’ɔmbris ʃukʰit lɛninmɑ] [ʃɛn gɑginɑtʰɑ mtʰɛbi t͡ʃ’ɑʁɑrɑ |] [st’ɑlinis sibr̩d͡znɛm d͡zlɛwitʰ ʃɛgmɔsɑ] [gɑdɑgɑkʰt͡sʰiɑ mziur bɑʁnɑrɑd ‖] [mɔd͡zmɛ ɛrɛbis ɔd͡ʒɑχʃi |] [dɑmk’widr̩di | gɑiχɑrɛɔ |] [ɑq’wɑwdi | t’urpʰɑ kʰwɛq’ɑnɑw] [ilχinɛ | kʰɑrtʰwɛltʰ mχɑrɛɔ ‖] [uχsɔwɑr drɔdɑn br̩t͡s’q’inɑwnɑ ʃɛni] [ɑzri | χmɑli dɑ gɑmbɛdɑɔbɑ] [dʁɛs ʃɛns didɛbɑs | nɑtʰɛl mɔmɑwɑls] [ʃt͡ʃ’ɛd͡z st’ɑlinuri t͡s’r̩tʰɔbis tʰɑɔbɑ ‖] [sɑbt͡ʃ’ɔtʰɑ drɔʃɑ dɑgnɑtʰis |] [mzɛsɑwit mɔɛlwɑrɛɔ |] [ɑq’wɑwdi | t’urpʰɑ kʰwɛq’ɑnɑw] [ilχinɛ | kʰɑrtʰwɛltʰ mχɑrɛɔ ‖] Be glorious eternally, our homeland, You are an inextinguishable forge of heroes; You gave the world great Stalin, Who destroyed the slavery of nations. Your dream is accomplished, For the sake of which dream you bled: Blossom, our beautiful country, Exult, the Georgian land. With the great October's light, Lenin has illuminated your ancient mountains; Stalin's wisdom has made you victorious, Turned you into a sunny garden. In the family of the fraternal peoples You've gained a foothold, rejoice; Blossom, our beautiful country, Exult, the Georgian land. Your thought, your sword and your courage Have been shining from time immemorial, Now the generation of the Stalin's temper forges Your grandeur, your serene future. The Soviet banner, shining as the sun, Is fluttering over you; Blossom, our beautiful country, Exult, the Georgian land. == References == Category:Anthems of Soviet Socialist Republics Category:Georgian anthems",
 "title": "Anthem of the Georgian Soviet Socialist Republic"
}