{
 "id": "973001",
 "text": "The \"State Anthem of the Turkmen SSR\" (, ) was the anthem of Turkmenistan from 1946 to 1991. ==Lyrics== ===1978–1991 version=== Turkmen original Transliteration IPA transcription English translation I The bulwark of peoples' friendship is unbreakable. The entire Soviet Union's become a united family! And the Russians have become a stronghold of friendship. We're blessed with happiness in our native land. Sing to the native land sunny and free! The Party of Lenin's a wise helmsman. Your victorious step is headed towards communism, Blossom, Soviet land! Flourish, dear Turkmenistan! II Lenin's paved us a clear way to freedom And led us to eternal happy life. He raised the people to fight for justice, And inspired them to exploits and labour triumph! III We selflessly serve the cause of communism, We've tied our destinies to it – today to come. And with the scarlet banner, the banner of the Motherland, To the greatest aim valorously we march on! ===1946–1978 version=== Turkmen original Transliteration IPA transcription English translation I The friendship of our people with equal rights, The Soviet Union's transformed it into a fortress, The leader of friendship is the Russian folk, And the brotherhood's helped us as well. Long live and glorify, O beautiful Motherland, If hardships try to overwhelm you, We're willing to spare our lives for you, Sunny Motherland, O Turkmenistan! II By opening the wide path of Lenin's freedom, He has brought us to happiness, Stalin, son and leader of the people, From victory to victory. Long live and glorify, O beautiful Motherland, If hardships try to overwhelm you, We're willing to spare our lives for you, Prosperous Motherland, O Turkmenistan! III Our country's developed during the Soviet era, We've long achieved our dream, We're a free people of the Soviet Union, We're strong in both labour and struggle. Long live and glorify, ye beautiful Motherland, If hardships try to overwhelm you, We're willing to spare our lives for you, Dear Motherland, O Turkmenistan! ==Notes== ==References== Category:Anthems of Soviet Socialist Republics Category:Turkmen culture",
 "title": "Anthem of the Turkmen Soviet Socialist Republic"
}