{
 "id": "973260",
 "text": "Megadeth is an American thrash metal band. It was made by Dave Mustaine and David Ellefson in 1983. ==Albums== In 1985, Megadeth made its first album, named Killing is My Business... and Business is Good!. The Combat Records record label released the album. After the album came out, larger record labels noticed Megadeth, and the band joined Capitol Records. Their first album with Capitol Records, Peace Sells... but Who's Buying?, was released in 1986. Some Megadeth band members were addicted to drugs, so they got a lot of bad publicity during the 1980s. Still, the band released many popular albums, such as So Far, So Good... So What! in 1988, Rust in Peace in 1990, and Countdown to Extinction in 1992. The band took a break in 2002, but came back together later. They have released six albums since then. == Members == Megadeth has had many different guitarists, drummers, and bassists. Mustaine is the last member of the original group who is still in the band. Megadeth's current members are guitarist and singer Dave Mustaine, guitarist Kiko Loureiro, drummer Dirk Verbeuren and bassist James LoMenzo. === Current === Picture Name Years in band Instruments Played music on Dave Mustaine All Megadeth albums James LoMenzo Dirk Verbeuren 2016–present drums The Sick, the Dying... and the Dead! (2022) Teemu Mäntysaari 2023–present none === No longer in Megadeth === Picture Name Years in band Instruments Played music on David Ellefson John Cyriis 1983 singing none Richard Girod drums Dijon Carruthers Lee Rausch 1984 Last Rites demo (1984) Gar Samuelson 1984–1987 Greg Handevidt 1983 guitar none Chris Poland Mike Albert 1985 none Jay Reynolds 1987 Chuck Behler 1987–1989 drums So Far, So Good... So What! (1988) Jeff Young guitar Nick Menza all Megadeth releases from Rust in Peace (1990) to Cryptic Writings (1997) Marty Friedman 1990–2000 all Megadeth releases from Rust in Peace (1990) to Risk (1999) Jimmy DeGrasso 1998–2002 Al Pitrelli 2000–2002 The World Needs a Hero (2001) and Rude Awakening (2002) Shawn Drover 2004–2014 drums all Megadeth releases from That One Night: Live in Buenos Aires (2005) to Countdown to Extinction: Live (2013) Glen Drover 2004–2008 James MacDonough 2004–2006 bass Chris Broderick 2008–2014 All Megadeth releases from Endgame (2009) to Super Collider (2013) Chris Adler 2015–2016 drums Dystopia (2016) Kiko Loureiro 2015–2023 === Session === A session musician is someone hired by a band to help make music. Picture Name Years in band Instruments Played music on Steve Jones 1988 guitar solo on \"Anarchy in the U.K.\" So Far, So Good... So What! (1988) Jimmie Wood 1994 harmonica on \"Train of Consequences\" and \"Elysian Fields\" Youthanasia (1994) Bob Findley Heather Keckler 2001 Talking on \"The World Needs a Hero\" and \"1000 Times Goodbye\" The World Needs a Hero (2001) Suzie Katayama 2001 strings on \"Promises\" and \"Losing My Senses\" Ken Mary 2001 Pro Tools (a software used for making music) Chris Vrenna 2001–2002 Vinnie Colaiuta 2004 drums The System Has Failed (2004) Jimmie Lee Sloas bass Tim Akers keyboards Darien Bennet singing on \"Blackmail the Universe\" Eric Darken 2004, 2016 percussion Charlie Judge Michael Davis 2004 extra sounds The System Has Failed (2004) Lance Dean singing Scott Harrison Celeste Amber Montague singing on \"Blackmail the Universe\" Justis Mustaine singing Ralph Patlan Chris Rodriguez 2004–2011, 2016 singing Robert Venable 2004 singing The System Has Failed (2004) Jonathan Yudkin Axel Mackenrott 2007 keyboards United Abominations (2007) Cristina Scabbia singing on \"À Tout le Monde (Set Me Free)\" Brett Caldas-Lima singing on \"United Abominations\" Marie Soler Chris Clancy 2009 singing Endgame (2009) Mark Newby-Robson keyboards on \"The Hardest Part of Letting Go...Sealed with a Kiss\" David Draiman 2013 singing on \"Dance in the Rain\" Super Collider (2013) Yao Zhao cello on \"Dance in the Rain\" Tom Cunningham The Shannon Rovers Irish Pipe Band (Brian Costello, Sean Costello, Mary Kate Peterson) bagpipes on \"Built for War\" Electra Mustaine singing on \"Forget to Remember\" and \"Beginning of Sorrow\" Sarah Phelps singing on \"Beginning of Sorrow\" Willie Gee talks in \"The Blackest Crow\" Farah Siraj 2016 singing on \"The Threat Is Real\" and \"Poisonous Shadows\" Dystopia (2016) Miles Doleac talks in \"Conquer or Die!\" Blair Masters keyboards Steve Di Giorgio 2022 bass The Sick, The Dying...The Dead (2022) === At concerts === Picture Name Years in band Instruments Notes Kerry King 1984 guitars Slayer guitarist Kerry King played with the band when Mustaine started singing. He did not stay in the band because he was in Slayer. Tony Laureano 2015–2016 drums Laureano played the drums instead of Chris Adler when Adler could not play. == Timeline == == References ==",
 "title": "List of Megadeth band members"
}