{
 "id": "973462",
 "text": "The Yakovlev Yak-9 () is a single-engine, single-seat multipurpose fighter aircraft. It was used by the Soviet Union and its allies during World War II and the early Cold War. The Yak-9 played a major role in taking back air superiority from the Luftwaffe's new Focke-Wulf Fw 190 and Messerschmitt Bf 109G fighters during the Battle of Kursk in summer 1943. It was one of the most produced Soviet fighters of World War II. The Yak-9 stayed in production from 1942 to 1948, with 16,769 built (14,579 during the war).Drabkin 2007, p. 146. After World War II, the Yak-9 would also be used by the North Korean Air Force during the Korean War.Angelucci and Matricardi 1978, p. 246. == Users == ; * Albanian Air Force was given 72 aircraft in 1947, including 12 Yak-9V trainers. ; * Bulgarian Air Force ; * People's Liberation Army Air Force ; * French Air Force (Armée de l'Air) ** Normandie-Niemen squadron ; * Hungarian Air Force was given aircraft in 1949. The type's Hungarian name was \"Vércse\" (Kestrel). ; was given 34 aircraft in late June 1945. ; * North Korean Air Force ; * Air Force of the Polish Army * Polish Air Force used several aircraft from 1947 to 1953. * Polish Navy ; * Soviet Air Force * Soviet Air Defence Forces ; * SFR Yugoslav Air Force – 16 Yak-9T, 40 Yak-9P, 47 Yak-9D/M and 68 Yak-9V aircraft in 1944–1950/1960Yugoslav Air Force 1942–1992, Bojan Dimitrijevic, Belgrade 2006 ** 111th Fighter Aviation Regiment (1947–1948) ** 112th Fighter Aviation Regiment (1947–1948) ** 94th Fighter Aviation Regiment (1948–1952) ** 116th Fighter Aviation Regiment (1948–1950) ** 117th Fighter Aviation Regiment (1948–1950) ** 141st Training Aviation Regiment (1952–1953) ** 2nd Training Aviation Regiment (1946–1948) ** 101st Fighter-Training Aviation Regiment (1948–1950) ** 103rd Reconnaissance Aviation Regiment (1950–1951) ** 104th Training Aviation Regiment (1948–1950) ** Training Squadron of 32nd Aviation Division (1953–1959) ** Training Squadron of 39th Aviation Division (1953–1959) ** Training Squadron of 44th Aviation Division (1953–1954) == Surviving aircraft == ; Bulgaria * Yak-9P on display at the Aviation Museum in Krumovo, Plovdiv. ; North Korea * Yak-9P on display at Victorious War Museum in Pyongyang. ; Poland * Yak-9P on static display at the Museum of the Polish Navy in Gdynia, Pomerania. It is tactical number 2 and was used by the Navy Aviation Escadrille until 1956. On 12 December 1956, it was transferred to the museum on behalf of the Navy Command. * Yak-9P on static display at the Museum of the Polish Army in Warsaw, Mazovia. It is tactical number 23 and was used by the 1st Fighter Aviation Regiment from 1947 until 1950. It was transferred to the museum on 10 August 1950 on behalf of the Air Force Command. ; Russia * Yak-9U on static display at the Central Air Force Museum in Monino, Moscow Oblast. * Yak-9 on static display at the Vadim Zadorozhny Museum of Technology in Krasnogorsky District, Moscow Oblast. * Yak-9 on static display at the Museum of the Air Forces of the Northern Fleet in Safonovo, Murmansk Oblast. ; Serbia * Yak-9P in storage at the Aeronautical Museum Belgrade in Surčin, Belgrade. ; Ukraine * Yak-9 on static display at the National Museum of the History of Ukraine in the Second World War in Kyiv. ; United States * Yak-9U on static display at the Museum of Flight in Seattle, Washington. == Specifications (Yak-9U) == == References == === Citations === === Bibliography === * Angelucci, Enzo and Paolo Matricardi. World Aircraft: World War II, Volume II (Sampson Low Guides). Maidenhead, UK: Sampson Low, 1978. . * Bergström, Christer. Bagration to Berlin – The final Air Battle in the East 1944–45. Hersham, UK: Classic Publications, 2008. . * Bock, Robert. Yak-7, Yak-9 (Aircraft Monograph 14) (English translation of Polish original). Gdańsk, Poland: AJ-Press, 1999. . * Drabkin, Artem. The Red Air Force at War: Barbarossa and The Retreat to Moscow – Recollections of Fighter Pilots on the Eastern Front. Barnsley, South Yorkshire, UK: Pen & Sword Military, 2007. . * Gordon, Yefim and Dmitri Khazanov. Soviet Combat Aircraft of the Second World War, Volume One: Single-Engined Fighters. Earl Shilton, Leicester, UK: Midland Publishing Ltd., 1998. . * Green, William. Warplanes of the Second World War, Volume Three: Fighters. London: Macdonald & Co. (Publishers) Ltd., 1961 (seventh impression 1973). . * Green, William and Gordon Swanborough. WW2 Aircraft Fact Files: Soviet Air Force Fighters, Part 2. London: Macdonald and Jane's Publishers Ltd., 1978. . * Gunston, Bill. Aerei della 2ª Guerra Mondiale (in Italian ). Milan: Alberto Peruzzo Editore, 1984. NO ISBN. * Gunston, Bill. The illustrated Directory of Fighting Aircraft of World War II. London: Salamander Book Limited, 1988. . * Kopenhagen, W., ed. Das große Flugzeug-Typenbuch (in German). Stuggart, Germany: Transpress, 1987. . * Leonard, Herbert. Encyclopaedia of Soviet Fighters 1939–1951. Paris: Histoire & Collections, 2005. . * Liss, Witold. The Yak 9 Series (Aircraft in Profile number 185). Leatherhead, Surrey, UK: Profile Publications Ltd., 1967. * Mellinger, George. Yakovlev Aces of World War 2. Botley, UK: Osprey Publishing Ltd., 2005. . * Morgan, Hugh. Gli assi Sovietici della Seconda guerra mondiale (in Italian). Milano: Edizioni del Prado/Osprey Aviation, 1999. . * Morgan, Hugh. Soviet Aces of World War 2. London: Reed International Books Ltd., 1997. . * Panek, Robert. Yakovlev Yak-9U & P. Sandomierz, Poland/Redbourn, Hertfordshire, UK: Mushroom Model Publications, 2006. . * Шавров, В.Б. История конструкций самолетов в СССР 1938–1950 гг. (3 изд.). Kniga: Машиностроение, 1994 (Shavrov, V.B. Istoriia konstruktskii samoletov v SSSR, 1938–1950 gg.,3rd ed. History of Aircraft Design in USSR: 1938–1950). Kniga, Russia: Mashinostroenie, 1994.) . * Stapfer, Hans-Heiri. Yak Fighters in Action (Aircraft number 78). Carrollton, Texas: Squadron/Signal Publications, Inc., 1986. . * Степанец, А.Т. Истребители ЯК периода Великой Отечественной войны. Kniga: Машиностроение, 1992. Stepanets, A.T. Istrebiteli Yak perioda Velikoi Otechestvennoi voiny (Yak Fighters of the Great Patriotic War). Kniga, Russia: Mashinostroenie, 1992. . * Williams, Anthony G. and Emmanuel Gustin. Flying Guns: The Development of Aircraft Guns, Ammunition and Installations 1933–45. Ramsbury, UK: Airlife, 2003. . * Якубович, Н.В. Истребитель Як-9. Заслуженный «фронтовик». Москва: Коллекция, Яуза, ЭКСМО, 2008. Yakubovich, N.V. Istrebitel’ Yak-9. Zasluzhenny ”frontovik” (Yak-9 Fighter. A Honored “Veteran”). Moscow, Russia: Collection, Yauza, EKSMO, 2008. . Category:World War II Soviet aircraft",
 "title": "Yakovlev Yak-9"
}