{
 "id": "973528",
 "text": "This is a list of notable people who are or were natives, or notable as residents of, or relation with the U.S. city of New Orleans, Louisiana. == Academia == *Stephen Ambrose, historian and University of New Orleans professor *Mary L. Good, scientist and university professor *Salman Khan, educator *Andrew V. Schally, endocrinologist and Nobel Laureate == Architecture == *Leon C. Weiss, architect commissioned by Huey P. Long == Arts and literature == *John James Audubon, painter, ornithologist, naturalist *Roark Bradford, fiction writer *Poppy Z. Brite, writer *William S. Burroughs, writer *George Washington Cable, writer *Truman Capote, writer *Kate Chopin, writer, feminist *Andrei Codrescu, poet and commentator *Edgar Degas, artist *George Washington Dixon, newspaper editor *George Dureau, artist and photographer *William Faulkner, writer *Rolland Golden, artist *Shirley Ann Grau, writer *Lafcadio Hearn, writer *Lillian Hellman, writer *George Herriman, Krazy Kat cartoonist *Walter Isaacson, writer, journalist, public policy analyst *Frances Parkinson Keyes, writer *Dominique Lapierre, writer *Elmore Leonard, author *Michael Lewis, writer *Bunny Matthews, cartoonist *John McCrady, artist *James Michalopoulos, artist *Anne Rice, writer of vampire tales and other Gothic fiction *John Kennedy Toole, writer of A Confederacy of Dunces == Business and economics == *Isaac Delgado, businessman and philanthropist, benefactor of Delgado Community College *Avram Glazer, businessman and sports franchise owner *John McDonogh (1779–1850), shipping, land speculation (world's largest private landholder ca. 1850), philanthropist and namesake of many New Orleans schools *Clay Shaw, businessman *David Voelker, businessman and philanthropist *Samuel Zemurray, businessman and philanthropist == Cuisine == *Leah Chase, chef *Ruth Fertel, businesswoman and restaurateur, Ruth's Chris Steak House == Crime == * Axeman of New Orleans, mysterious mass murderer * Antoinette Frank, former New Orleans Police Officer * Jean Lafitte, pirate and brother of Pierre Lafitte * Pierre Lafitte, pirate and brother of Jean Lafitte * Lee Harvey Oswald, assassin == Movie and television == *Yahya Abdul-Mateen II, actor *Sandra Bullock, actress, resident *Kitty Carlisle, entertainer *John Carroll, actor and singer *Laura Cayouette, actor and author *Patricia Clarkson, actress *Marshall Colt, psychologist and former actor *Ellen DeGeneres, comedian, talk show host *Vance DeGeneres, actor, screenwriter, and musician (bass) *Raquel \"Rocsi\" Diaz, television host and personality on BET's 106 and Park *Faith Domergue, actress *Donna Douglas, actress (Ellie Mae from The Beverly Hillbillies) *Allison Harvard, runner-up of twelfth cycle of America's Next Top Model *Dwight Henry, actor *Gloria Henry, actress born in 1923 *Eddie Jemison, actor *Bayn Johnson, former actress and singer *Leatrice Joy, actress *Dorothy Lamour, actress *John Larroquette, actor *Anthony Mackie, actor *Adah Isaacs Menken, actress *Garrett Morris, comedian (SNL), actor *Ed Nelson, actor *Arthel Neville, journalist *Pauley Perrette, actress *Tyler Perry, actor, director *Wendell Pierce, actor (Detective Bunk Moreland in The Wire) *Godfrey Reggio, experimental filmmaker/documentarian (Qatsi trilogy) *Neferteri Shepherd, model and actress *Richard Simmons, entertainer *Harold Sylvester, actor *Jay Thomas, actor *Sam Trammell, actor, best known for his role as Sam Merlotte in True Blood *Ben Turpin, silent film comedian *Ray Walston, actor *Carl Weathers, actor, football player *Tommy Wiseau, actor, director *Reese Witherspoon, actress *Grace Zabriskie, actress *Bianca Del Rio, drag queen and comedian; best known for winning the sixth season of RuPaul's Drag Race == Law, politics, and military == *Bryan Adams, former member of the Louisiana House of Representatives from Jefferson Parish since 2012; born in New Orleans. *Reverend Avery Alexander, civil rights leader, state legislator *Andres Almonaster y Rojas, Spanish civil servant in colonial New Orleans, also a philanthropist *Jeff Arnold, former member of the Louisiana House for the Algiers section, 2002–2016 *John B. Babcock, Medal of Honor recipient *Algernon Sidney Badger, government official during and after Reconstruction *Amy Coney Barrett, U.S. Supreme Court Justice and academic *P.G.T. Beauregard, Confederate general and inventor *Clyde F. Bel Jr., businessman and state representative for Orleans Parish, 1964–1972 and 1975–1980 *Judah P. Benjamin, U.S. Senator, Confederate Attorney General, Secretary of War and Secretary of State *David H. Berger, commandant of the United States Marine Corps *Hale Boggs, former U.S. Representative *Lindy Boggs, former U.S. Representative and retired U.S. Ambassador to The Vatican *Thomas Hale Boggs Jr., lawyer/lobbyist in Washington, D.C., born in New Orleans in 1940, son of Hale and Lindy Boggs, brother of Cokie Roberts and Barbara Boggs Sigmund *Joseph Bouie Jr., Democratic member of the Louisiana House of Representatives for District 97 in Orleans Parish since 2014; retired faculty member and administrator at Southern University at New Orleans *Stephen Bradberry, community organizer, Robert F. Kennedy Human Rights Award laureate *Juan Davis Bradburn, freedom fighter for Mexico, officer in the Battle of New Orleans *Henry Braden, politician *Elward Thomas Brady Jr., state representative from Terrebonne Parish 1972–1976, born in New Orleans *Donna Brazile, political strategist *Jared Brossett, member of the New Orleans City Council since 2014; state representative for District 97, 2009–2014 *J. Marshall Brown, insurance agent and politician *Benjamin F. Butler, administrator of Union-occupied New Orleans during the Civil War *John A. Butler, U.S. Marine Corps officer and Navy Cross recipient *Pascal F. Calogero Jr., Chief Justice Louisiana Supreme Court *Gary Carter Jr., member of the Louisiana House from the Algiers neighborhood, effective 2016 *James Carville, political consultant, political science professor *Harry Connick Sr., district attorney, father of singer Harry Connick Jr. *A.G. Crowe, politician *Milton Joseph Cunningham, attorney, state legislator, state attorney general for three nonconsecutive terms ending in 1900 *Bernard de Marigny, politician and land developer *Étienne de Boré, first Mayor of New Orleans in the U.S. administration *James D. Denegre, Minnesota state senator and lawyer *Jean Noel Destréhan, early Creole politician and plantation owner *David Duke, state representative for Metairie 1989–1992; White nationalist *H. Garland Dupré, attorney and politician; Speaker of the Louisiana House 1908–1910; U.S. representative from Louisiana's 2nd congressional district, 1910–1924 *Frank Burton Ellis, attorney, politician, federal judge *Albert Estopinal, former U.S. representative and member of both houses of the Louisiana State Legislature *Olaf Fink, member of the Louisiana State Senate 1956–1972; New Orleans educator *C.B. Forgotston, attorney, political activist, state government watchdog *Henry L. Fuqua, governor who defeated Huey Long in an election *Randal Gaines, state representative since 2012 for St. Charles and St. John the Baptist parishes; former assistant city attorney in New Orleans *Gerald J. Gallinghouse, U.S. Attorney for the United States District Court for the Eastern District of Louisiana 1970–1978; known for prosecuting corruption in government *Jim Garrison, district attorney of Orleans Parish *Robert T. Garrity Jr., attorney and former state representative for Jefferson Parish *Charles Gayarré, state legislator noted for his histories of Louisiana *Newt Gingrich, U.S. Congressman from Georgia, Speaker of the U.S. House of Representatives *Nicholas Girod, early mayor of New Orleans *John Grenier, Birmingham lawyer and Alabama Republican Party figure, born in New Orleans in 1930 *Brenda Hatfield, former Chief Administrative Officer of the City of New Orleans *F. Edward Hebert, Democrat U.S. Representative for Louisiana's 1st congressional district, 1941–1977 *Cynthia Hedge-Morrell, former member of the New Orleans City Council for District D, 2005–2014 *Frederick Jacob Reagan Heebe, former judge of the United States District Court for the Eastern District of Louisiana *David Heitmeier, state senator for District 7 since 2008, optometrist *Francis C. Heitmeier, state senator for District 7, 1988–2008; businessman and lobbyist *David Hennessy, police chief, assassinated in 1890 *Clay Higgins, Republican member of the United States House of Representatives for Louisiana's 3rd congressional district; born in New Orleans in 1961 *Stephanie Hilferty, Republican state representative for Orleans and Jefferson parishes, effective January 2016 *Walker Hines, former state representative *Jean Joseph Amable Humbert, army general, subordinate to Andrew Jackson at the Battle of New Orleans *Bernette Joshua Johnson, Chief Justice of the Louisiana Supreme Court since 2013; associate justice, 1994–2013, native and resident of New Orleans *Jeannette Knoll, associate justice of the Louisiana Supreme Court; reared and educated in New Orleans, where the court meets; resides in Marksville *Mary Landrieu, state representative, state treasurer, U.S. senator *Mitch Landrieu, state representative, lieutenant governor, former mayor of New Orleans *Moon Landrieu, judge and politician, mayor of New Orleans *Hank Lauricella, former professional football player; state senator from Jefferson Parish, 1972–1996 *Bob Livingston, Republican former U.S. Representative for 1st congressional district *Edward Livingston, drafted Louisiana Civil Code *Lt. Gen. James Longstreet, Confederate general *Joseph Mansion, Louisiana state legislator, state tax assessor *Bessie Margolin, labor lawyer *Danny Martiny, state senator from Jefferson Parish, born in New Orleans *Harold A. Moise, state representative for the 12th Ward, Orleans civil court judge 1937–1948, and associate justice of the Louisiana Supreme Court 1948–1958 *Ernest Nathan Morial, American political, legal, and civil rights leader *Marc Morial, former mayor, son of Ernest Nathan Morial *deLesseps Story Morrison, former mayor and ambassador to the Organization of American States *deLesseps Morrison Jr., late state representative *William Mumford, Confederate resistor in Union-occupied New Orleans during the Civil War *Ray Nagin, former mayor of New Orleans *Michael H. O'Keefe, president of the Louisiana State Senate 1976–1983; convicted felon *Alejandro O'Reilly, governor of Louisiana, known as \"Bloody O'Reilly\" *James E. Paxton, district attorney of Louisiana 6th Judicial District based in St. Joseph, practiced law in New Orleans 1988–1993 *Leander Perez, district judge, district attorney, and president of the Plaquemines Parish Commission Council *P.B.S. Pinchback, politician *James Pitot, third mayor of New Orleans *Loulan Pitre Jr., New Orleans lawyer and former state representative for Lafourche Parish *Edward Joseph Price, state representative for District 58, Gonzales businessman, and former resident of New Orleans *William P. Quigley, activist attorney and academic *Max Rafferty, educator author and columnist, California politician, born in New Orleans in 1917 *Cokie Roberts, journalist, daughter of Hale and Lindy Boggs *Steve Scalise, House Minority Whip and U.S. Representative of Louisiana's 1st district *Tom Schedler, former state senator from St. Tammany Parish and current Louisiana secretary of state *Pat Screen, Louisiana State University quarterback, lawyer, and former Mayor-President of East Baton Rouge Parish *Ronal W. Serpas, Superintendent of the New Orleans Police Department since 2010 *Joseph A. Shakspeare, Mayor of New Orleans at the time of the March 14, 1891 lynchings *Eric Skrmetta, attorney from Metairie, Louisiana; Republican member of the Louisiana Public Service Commission for District 1 *Jefferson B. Snyder, lived in New Orleans 1893–1897; later district attorney in three delta parishes in northeast Louisiana 1904–1948 *James Z. Spearing, attorney, school board member, U.S. representative from Louisiana's 2nd congressional district, 1924–1931 *Dorothy Mae Taylor, first African-American woman to serve in the Louisiana House, 1971–1980; member of the New Orleans City Council, 1986–1994 *Charles Laveau Trudeau, early 19th century mayor of New Orleans *A.P. Tureaud, attorney *Jorge Ubico, exiled president of Guatemala *José de Villamil (or José Villamil), father of the independence of Ecuador *David Vitter, U.S. Senator, 2005–2017 *David Voelker, businessman *Frank Voelker Jr., lawyer, politician *John Volz, late U.S. attorney for the Eastern District of Louisiana *Chatham Roberdeau Wheat, leader of the Louisiana Tigers during the US Civil War *Edward Douglass White, Chief Justice of the United States Supreme Court * John C. White, Louisiana education superintendent since 2012; superintendent of the Recovery School District in New Orleans, 2011 *Robert Wilkie, National Security Assistant to the President *Clint Williamson, U.S. Ambassador, White House policy official, United Nations envoy *John Minor Wisdom, judge of the United States Court of Appeals for the Fifth Circuit *Andrew Young, politician == Invention == *Levi Spear Parmley, inventor of dental floss *John Leonard Riddell, inventor of the binocular microscope == Sports == *D.J. Augustin, NBA player *Tom Benson, owner of the New Orleans Saints *Will Clark, former Major League Baseball star, infielder *Orleans Darkwa, professional football player *Tom Dempsey, former NFL kicker, held longest field goal record for over 43 years *David Dixon, professional sports advocate for New Orleans Saints, Louisiana Superdome, USFL, World Championship Tennis *Scott Dohmann, former MLB pitcher *Corey Dowden, former NFL defensive back *Clyde Drexler, former University of Houston and NBA star, member of Basketball Hall of Fame *Bobby Duhon, professional football player *Marshall Faulk, professional football star (St. Louis Rams), member of Pro Football Hall of Fame *Steve Foley, former defensive back for Denver Broncos *Matt Forte, running back for Chicago Bears, New York Jets *John Fourcade, former NFL and CFL quarterback, sports analyst *Nolan Franz, former Green Bay Packers wide receiver *Leonard Fournette, NFL player, running back for the Tampa Bay Buccaneers *Harry P. Gamble, football player, swimmer, gymnast, boxer, and attorney *Eddie Garcia, former Green Bay Packers placekicker *Larry Gilbert, Major League Baseball player *Tad Gormley, athletic trainer, coach, and official *Danny Granger, forward for NBA's Indiana Pacers, Miami Heat *Cortez Hankton, former NFL player who is currently the passing game coordinator & wide receivers coach for the LSU Tigers *Adrian Hardy, NFL player *Chris Henry, former NFL wide receiver *Kevin Hughes, former NFL offensive tackle *Avery Johnson, former National Basketball Association player, former coach of Dallas Mavericks *Deion Jones, NFL linebacker for the Atlanta Falcons *Junkyard Dog, stage name of Sylvester Ritter, former professional wrestler *Robert Kelley, Washington Redskins running back *Shaun King, former NFL quarterback *Kerry Kittles, former NBA player for New Jersey Nets *Dominik Koepfer, professional tennis player *Lester Lautenschlaeger, football player, politician, first director of New Orleans Recreation Department *Kendrick Lewis, NFL free safety, played for Kansas City Chiefs and Baltimore Ravens, attended Ole Miss *Rydell Malancon, former NFL linebacker *Archie Manning, former New Orleans Saints quarterback, father of Peyton and Eli *Eli Manning, New York Giants quarterback *Peyton Manning, former Indianapolis Colts and Denver Broncos quarterback *Pete Maravich, basketball Hall of Famer, played for LSU and NBA's New Orleans Jazz *Sammy Martin, former New England Patriots running back *Tyrann Mathieu, player for NFL's Kansas City Chiefs *Bo McCalebb, Macedonian basketball player who plays for Montepaschi Siena *Max McGee, NFL player on five championship teams *Sylvester McGrew, former Green Bay Packers defensive end *Greg Monroe, college basketball player for Georgetown University *Paul Morphy, world chess champion *Patrick Mullins, professional soccer player *Steve Mura, retired pitcher in Major League Baseball *Eddie Murray, prolific NFL placekicker *Antonio Narcisse, football player *Herman Neugass, Track & field athlete who boycotted the Berlin Olympic trials *Mel Ott, Major League Baseball Hall of Famer *Micah Owings, MLB pitcher *Robert Pack, NBA player, assistant coach for New Orleans Pelicans *Emmett Paré, professional tennis player and coach *Joe Pasternack, head basketball coach at UC Santa Barbara *Audrey Patterson, first African- American woman to win Olympic medal *Chris Quinn, former NBA player and current Miami Heat assistant coach *Eldridge Recasner, former NBA player *Ham Richardson, professional tennis player *Alana Shipp, American/Israeli IFBB professional bodybuilder *Nate Singleton, former wide receiver for San Francisco 49ers *Neil Smith, former defensive end, Kansas City Chiefs *Truett Smith, former football player *Rusty Staub, Major League Baseball player *Ricky Starks, professional wrestler for All Elite Wrestling *Kordell Stewart, former NFL quarterback *Patrick Surtain, former NFL cornerback *Ron Swoboda, former New York Mets outfielder *Ike Taylor, cornerback, Pittsburgh Steelers *Roosevelt Taylor, safety, 1963 NFL champion, Chicago Bears *Vincent Taylor, defensive tackle for the Atlanta Falcons *Taryn Terrell, professional wrestler for Total Nonstop Action Wrestling *Mike Wallace, wide receiver for Pittsburgh Steelers *Aeneas Williams, former cornerback for St. Louis Rams *Jason Williams (born 1983), basketball player for Hapoel Be'er Sheva of the National Basketball League of Israel *John \"Hot Rod\" Williams, longtime professional basketball player == Other == *Ruby Bridges, commemorated for her role, as a child, in racial integration of the New Orleans Public School System *David Ferrie, pilot investigated in the assassination of John F. Kennedy *Marie Alice Heine, first American Princess of Monaco *Marie Laveau, \"voodoo queen\" *Paul Morphy, unofficial world chess champion *Homer Plessy, early civil rights activist in the Plessy v. Ferguson case *Paul Tulane, benefactor of Tulane University ==Related pages== *List of people from Louisiana ==References== New Orleans *",
 "title": "List of people from New Orleans"
}