{
 "id": "973957",
 "text": "Jo Evelein also written as Jo Eveleyn (born 1890s) was a Dutch competitive swimmer, diver and water polo player. Evelein was active in the early 20th- century, in the early era of women's aquatics. She was a member of the Hollandsche Dames Zwemclub (H.D.Z.) and the earliest Netherlands women's water polo team. Evelein initiated the women's water polo demonstration event at the 1920 Summer Olympics. She won the gold medal at the 1922 Women's Olympiad in the water polo event. ==Biography== ===Sport career=== One of her first achievements was in July 1911 at the 25th anniversary competition of the Hollandsche Dames Zwemclub (H.D.Z.). Together with A. E. van Laar and S. Soutberg she finished second and won art prizes in the 60 metres relay event. In 1912 she competed at the 1912 Kleve international aquatics competitions in Kleve, Germany. The first time HDZ competed internationally. She won the second prize in the junior 60 metre event and the HDZ (likely including Evelein) won the water polo match. At a national competition in January 1913 in Rotterdam she won the 40 metre breaststroke. From 1913, she also won at national level in water polo with her team, where she was for the team an important player. She also competed in diving, were she also became a winner in national competitions. The London Ladies Waterpolo Club came to the Netherlands in 1914 for swimming and water polo competitions. This was the first time a British water polo team played in the Netherlands. Evelein was selected as goalkeeper in the water polo match against the British team. HDZ lost the match with 3-2. In that era women's water polo was not an Olympic discipline, and wouldn't be until 2000. Evelein had taken the initiative that a water polo match was played at the 1920 Summer Olympics as an exhibition match and managed to raise the necessary money for it. In this Olympic demonstration event two Dutch teams played against each other in the same venue as the men's competition. Evelein was also one of the players herself. Evelein was the national record holder in the 200 metres freestyle. Her record was beaten by Maria Vierdag in June 1922. Evelein was selected to compete at the 1922 Women's Olympiad, the earliest women's international swimming championships in Monte Carlo. She was selected for the 400 metre freestyle and Evelein was the a member of the earliest Netherlands women's national water polo team to play Water polo at the 1922 Women's Olympiad. She became with the team champion after winning the decisive match against the British team. They won with 6–0. Evelein scored one of the goals. In the 400 metre freestyle event she reached the final, but didn't win a medal. ===Sport administration=== Evelein was also a board member of H.D.Z.. She was elected in 1912 together with Anna Helweg and R. Frederiks, became the next year also a member of the water polo commission, and was re-elected in 1914, 1916, 1918, and 1920. She was a delegate to the Dutch Swimming Federation. ===Personal life=== In June 1924 she emigrated to Canada with the . At her goodbye she received from the Hollandsche Dames Zwemclub a honorary golden pin for all her services. ==References== ==Other websites== *Newspaper articles of Evelein via Delpher * Category:Dutch water polo players Category:Dutch swimmers Category:Dutch divers Category:Sportswomen Category:1890s births Category:Year of death missing",
 "title": "Jo Evelein"
}