{
 "id": "973948",
 "text": "This is a list of notable people who were born, raised, or lived in Baton Rouge, Louisiana at some point in their life. ==Sportspeople== * Seimone Augustus, former WNBA player who is currently an assistant coach for the Los Angeles Sparks (b. 1984) * Brandon Bass, NBA power forward (b. 1985) * Billy Cannon, former All-American and 1959 Heisman Trophy winner (b. 1937) * Michael Clayton, former NFL wide receiver (b. 1982) * Willie Davenport, Olympics gold medal winner * Glen Davis, NBA forward for the Los Angeles Clippers (b. 1986) * David Dellucci, MLB outfielder for the Cleveland Indians (b. 1973) * Warrick Dunn, NFL running back for the Tampa Bay Buccaneers (b. 1975) * Chad Durbin, MLB pitcher for the Cleveland Indians (b. 1977) * Alan Faneca, NFL guard for the Pittsburgh Steelers (b. 1976) * Randall Gay, NFL cornerback for the New Orleans Saints (b. 1982) * Stephen Gostkowski, American football placekicker * Darryl Hamilton, MLB outfielder for various clubs (b. 1964) *Jeremy Hill, NFL running back for the New England Patriots * Russ Johnson, major league infielder (b. 1973) * Lolo Jones, track and field athlete * Stefan LeFors, former quarterback in American and Canadian football * Norman LeJeune, NFL former football safety * Pete Maravich, LSU and NBA player in Basketball Hall of Fame * Todd McClure, former NFL offensive lineman for Atlanta Falcons (b. 1977) * Buddy Myer, MLB 2-time All-Star second baseman, batting and stolen base titles *Aaron Nola, MLB All Star baseball pitcher (b. 1993) * Jonathan Papelbon, MLB pitcher for the Boston Red Sox (b. 1980) * Carly Patterson, Olympic gold medalist (b. 1988) * Bob Pettit, Basketball Hall of Famer (b. 1932) * Andy Pettitte, MLB pitcher for the New York Yankees (b. 1972) * Bobby Phills, former professional basketball player (d. 2000) * Pat Screen, former LSU quarterback, Mayor-President of East Baton Rouge Parish from 1981 to 1988 (1943–1994) * Ben Sheets, MLB pitcher for the Milwaukee Brewers (b. 1978) * Marcus Spears, NFL defensive end for the Dallas Cowboys (b. 1982) * Jim Taylor, Football Hall of Famer (b. 1935) * Tyrus Thomas, NBA forward for the Chicago Bulls (b. 1986) * Reggie Tongue, NFL safety for the Kansas City Chiefs, Seattle Seahawks, New York Jets, and Oakland Raiders * Reggie Torbor, NFL linebacker for the Miami Dolphins * Jimmy Williams, NFL cornerback who graduated from Vanderbilt University and played for the Houston Texans * Joe Williams, NFL player * Kevin Windham, professional motocross racer ==Entertainers== * Boosie Badazz, rap artist (b. 1982) * Wes Brown, actor, We Are Marshall, Glory Road, Beach Girls * Andrei Codrescu, writer * Bill Conti, conductor and composer * Stormy Daniels, porn star and porn director (b. 1979) * Trent Dawson, actor, As the World Turns (b. 1971) * Donna Douglas, actress, The Beverly Hillbillies (1933-2015) * Louis Edmonds, actor, All My Children * Wesley Eure, actor, author * John Fred, singer, best known for the song \"Judy in Disguise (With Glasses)\" (1941-2005) * Larry Garner, blues guitarist * Kevin Gates, rap artist * Jiminy Glick, fictional Hollywood socialite and former host of Primetime Glick * Dale Houston, singer, best known for the song \"I'm Leaving It Up To You\" (1940-2007) * Randy Jackson, musician, record producer, and American Idol judge (b. 1956) * Chris Thomas King, blues musician and actor (b. 1962) * David Lambert, actor (b. 1992) * Don Lemon, CNN TV personality and host of CNN Tonight (b. 1966) * Jonathon \"Boogie\" Long, blues rock musician * Master P, rap artist * Rod Masterson, actor (1945–2013) * Reiley McClendon, actor (b. 1990) * John McConnell, actor, radio personality (b. 1958) * Casey McQuiston, author of NYT Bestseller, \"Red, White, and Royal Blue\" * Elemore Morgan Jr., landscape painter and photographer (b. 1931) * James Paul, Conductor Emeritus of the Baton Rouge Symphony (b. 1940) * Cameron Richardson, actress, Open Water 2: Adrift (b. 1979) * Percy Sledge, singer, \"When a Man Loves a Woman\" * Slim Harpo, blues musician * Steven Soderbergh, director * Tabby Thomas, blues musician and club owner (b. 1929) * Pruitt Taylor Vince, actor (b. 1960) * Rosalie \"Lady Tamborine\" Washington, gospel musician and tambourine player (b. 1957) * Webbie, rap artist (b. 1985) * Shane West, actor (b. 1978) * Lynn Whitfield, actress * YoungBoy Never Broke Again, rap artist ==Politicians== * Larry S. Bankston, lawyer and former state senator, son of Jesse Bankston, D (b. 1951) * Regina Barrow (b. 1966), member of the Louisiana State Senate, former state representative for East and West Baton Rouge parishes, 2005-2016 * V.J. Bella (b. 1927), former state representative from St. Mary Parish and state fire marshal, based in Baton Rouge, 1990–1992 and 1996–2004, R *Sherman A. Bernard (1925-2012), state insurance commissioner from 1972 to 1988; convicted felon, D * Morton Blackwell (b. 1939), political activist in Louisiana and later Virginia, R * Mike Branch (b. 1968), state senator and commercial pilot, later of Las Vegas, Nevada, R * Overton Brooks (1897-1961), U.S. representative from 1937 to 1961, representing Louisiana's 4th congressional district based about Shreveport, was born in Baton Rouge, D *Chad M. Brown, member of the Louisiana House of Representatives for Iberville and Assumption parishes, effective January 2016, lives in Plaquemine, former Baton Rouge resident * H. Rap Brown, African American activist imprisoned in Georgia *George A. Caldwell, contractor who supervised the construction of twenty-six public buildings in Louisiana; imprisoned in the \"Louisiana Hayride\" scandals of 1939–1940, D *Barbara West Carpenter (b. 1943), dean of international relations at Southern University and African-American Democrat state representative from District 63 in East Baton Rouge Parish since 2016 *Sally Clausen (b. 1945), former university president and commissioner of Louisiana higher education, retired in Baton Rouge * Thomas G. Clausen (1939-2002), last person to be elected to the since appointed position of Louisiana education superintendent; St. Mary Parish native and Baton Rouge resident * Luther F. Cole (1925-2013), legislator, judge, state Supreme Court associate justice, D * Paula Davis (b. 1973), state representative for District 69 in East Baton Rouge Parish since 2015 *William J. \"Bill\" Dodd (1909-1991), state representative, lieutenant governor, state auditor, member of Louisiana Board of Education, state education superintendent, D *Gil Dozier, Louisiana agriculture commissioner from 1976 to 1980; convicted felon, D *Rick Edmonds, state representative for District 66 in East Baton Rouge Parish since 2016, R * Mike Edmonson, superintendent of the Louisiana State Police since 2008, R * Ronnie Edwards (c. 1952–2016), member of the Baton Rouge Metro Council and the Louisiana House of Representatives in January and February 2016, D * Jimmy Field, Louisiana Public Service Commissioner (1996-2012), R *Jeff Fortenberry, U.S. representative from Nebraska (b. 1960), R * Mike Futrell, former state representative and Metro Council member, R * William H. Gray (1941-2013), U.S. representative from Philadelphia, Pennsylvania, born in Baton Rouge, first African American to serve as a House majority whip, D * Douglas D. \"Doug\" Green (b. c. 1950), state insurance commissioner, 1988–1991; convicted felon, D *Anthony Guarisco Jr. (b. 1938), former state senator from Morgan City; lawyer, formerly practiced in Baton Rouge, D * Dudley A. Guglielmo, (1909-2005) Louisiana insurance commissioner from 1964 to 1972, D *Rufus D. Hayes (1913-2002), first state insurance commissioner, former East Baton Rouge Parish district attorney and judge, former state Democratic chairman, D * Betty Heitman, co-chairwoman of the Republican National Committee from 1983 to 1987; resided in and died in 1994 in Baton Rouge, R * Kip Holden, Mayor- President of East Baton Rouge Parish (b. 1952), D * Barry Ivey (b. 1979), businessman and current member of the Louisiana House from District 65 (b. 1979), R * Alphonse J. Jackson (1927-2014), state representative from Caddo Parish, 1972–1992; operated public relations firm in Baton Rouge after leaving the legislature; died in and buried in Baton Rouge, D * Edward C. James (b. 1981), member of the Louisiana House of Representatives for East Baton Rouge Parish since 2012, D *Louis E. \"Woody\" Jenkins (b. 1947), former Louisiana state representative and three-time U.S. Senate candidate, D-turned-R * Bobby Jindal (b. 1971), Governor and Louisiana congressman, R * Johnnie Jones (Civil Rights) (b. 1920), member of the Louisiana House between 1972 and 1976.The Advocate. \"WWII veteran-turned-civil rights lawyer from Baton Rouge awarded Purple Heart. ELLYN COUVILLION, STAFF WRITER. June 26, 2021. https://www.theadvocate.com/baton_rouge/news/article_eea43d96-d6c5-11eb-9e22-3baf9053b010.html * Edmond Jordan (b. 1971), member of the Louisiana House since 2016 for District 29 in West and East Baton Rouge parishes *Edith Killgore Kirkpatrick (b. 1918), former member of Louisiana Board of Regents, D *Jeannette Knoll (b. 1943), associate justice of the Louisiana Supreme Court; born in Baton Rouge, resident of Marksville, D *Fred S. LeBlanc, mayor of Baton Rouge (1941-1944), state attorney general (1944-1948; 1952–1956), D *Coleman Lindsey (1892-1968), state senator, lieutenant governor, state district court judge, D *John Maginnis (1948-2014), Louisiana political journalist, author, and commentator; reared and resided in Baton Rouge * Robert M. Marionneaux (b. 1968), attorney and state senator, D * Sidney McCrory (1911-1985), entomologist who served as state agriculture commissioner from 1956 to 1960, D *Eugene McGehee (1928-2014), member of the Louisiana House of Representatives, 1960–1972; state district court judge in East Baton Rouge Parish, 1972–1978, D * Nolan Mettetal (1945-2020), Mississippi state representativeNolan Mettetal-obituary *Henson Moore, U.S. representative from Sixth Congressional District, 1975–1987, R * W. Spencer Myrick, state legislator from West Carroll Parish, later resided in Baton Rouge, D * J. Kelly Nix (b. 1934), Baton Rouge businessman since 1984; Louisiana superintendent of education, 1976 to 1984, D * Bob Odom (1935-2014), state agriculture commissioner, 1980–2008, D * Jessel Ourso, colorful, controversial sheriff of Iberville Parish, began his career in law enforcement in the middle 1950s as a Baton Rouge municipal police officer, D. * John Victor Parker (1928-2014), judge of the United States District Court for the Middle District of Louisiana, 1979-2014 *Edward Grady Partin (1924-1990), Teamsters Union figure, D * Tony Perkins (b. 1963), former state representative and president of the Family Research Council, R * Ralph Perlman, Louisiana state budget director, 1967-1988 * Melvin Rambin, mayor of Monroe from 2000 to 2001; former banker in Baton Rouge, interred at Roselawn Memorial Park in Baton Rouge, R *Buddy Roemer, former governor and Baton Rouge businessman (b. 1943), I *Sean Reilly, state representative from 1988 to 1996 and current chief operations officer of Lamar Advertising, D *Buddy Roemer, former governor of Louisiana; resides in Baton Rouge * Frank P. Simoneaux, member of the Louisiana House of Representatives for East Baton Rouge Parish, 1972–1982; lawyer in Baton Rouge, D *Patricia Haynes Smith, state representative for District 67 in East Baton Rouge Parish since 2008 * Mason Spencer, state representative from Madison Parish from 1924 to 1936, born in Baton Rouge in 1892, D * Raymond Strother, political consultant, lived in Baton Rouge from 1960 to 1980, D * Zachary Taylor, military leader and the twelfth President of the United States(1784–1850), W * David C. Treen, former Louisiana governor (1928-2009), was born in Baton Rouge, R *Lillian W. Walker, former state representative (1964-1972), D * Gus Weill, public relations consultant, author, television host, D * Mack A. \"Bodi\" White Jr., state representative since 2004, R * John C. White, Louisiana education superintendent since 2012, I * J. Robert Wooley, insurance commissioner from 2000 to 2006; attorney with Adams & Reese in Baton Rouge, D ==Related pages== *List of people from Louisiana ==References== Category:Lists of American people",
 "title": "List of people from Baton Rouge, Louisiana"
}