{
 "id": "974163",
 "text": "Jan Jacob Vermaat (21 May 1939 – 7 November 2022) was a Dutch sculptor and draughtsman from Woerden. His significance for the development of art and culture in Woerden has been described as 'great'. For about fifteen years he took part in international sculptor symposia where he won several prizes. His works is in public areas in the Netherlands, France, Italy, Portugal and the United States. In the Netherlands, statues of him can be found in: schools, villas, public buildings and public gardens. While working in Canada, Vermaat made a small change to the official design of the Maple Leaf in the flag of Canada. ==Biography== Vermaat was born in Maasland as the eighth and last child of a tailor. His father started working at the Defense clothing depot, which is located in Woerden Castle. When he is three months old, the family starting living at the Kruittorenweg in Woerden. Initially he went to the Wilhelmina School, and later to the Emma School. Especially at the Emma school he started to express his sense of art. After primary school, Vermaat followed an evening study at the Academy of Fine Arts in Utrecht, a training institute that was called at the time. During his studies he worked for the Utrecht University, where he made technical drawings of archaeological history. In 1964 he moved temporary to Toronto, Canada. One of his older sisters lived there for some time. Vermaat started working for Dominion Regalia Ltd., a company that designed clothing and flags. In that period the flag of Canada had to be adjusted a bit by the government, because the old flag of Canada was related to the British flag. The company he worked for got the contract to carry it out. In the official design Vermaat ajusted the Maple Leaf a bit. He made the straight stem a bit wider near the bottom. He did it because he \"liked it better\". He never heard anything back about his adjustment, but it was adopted in the official Canadian flag. He later worked for the Royal Ontario Museum as a decorator, and in his spare time he learted stained glass techniques. In 1966 he moved back to Woerden, and gets a studio from the municipality. In 1969 he met his future wife Tonny Rasing and they moved to Rijnkade 38-I. They had three children, two sons and a daughter. In the period 1972-1985, Vermaat worked as a creative therapist at the General Hospital on the Meeuwenlaan in Woerden. In 1988 Vermaat received a grant from the Boellaard Fund for a sculpting course in Portugal. The sculpture he made in Portugal were exhibited at the International Sculptor Symposium in Lisbon. It turned out to be the first in a series of international exhibitions. In 1997 and 2007 Vermaat was the initiator of an international sculptor symposium. Ten European sculptors worked on a series of sculptures that are placed in the public area in Woerden (Van Kempensingel). Vermaat participated in this symposium outside of competition, and the sculpture he made are in the public area in Woerden (Weddesteyn nursing home). In 1997 he received the Woerden Culture Prize for his efforts. Woerden has a special 'Vermaat walk'. A walking route along ten statues of Vermaat. In 2021 a biography about Jan Vermaat was published with his entire oeuvre. Vermaat died on 7 November 2022, aged 83. ==Gallery== File:Aalsmeer kunstwerk veulen.jpg|Veulen, Aalsmeer File:Bodegraven kunstwerk man met baby.jpg|Man met baby (man with baby), Bodegraven File:Gevelornament van Jan Vermaat.jpg|tennis players facade ornament, Woerden File:Voor de mensenrechten Jan Vermaat PrHendrikkade Woerde.JPG| Voor de mensenrechten (for human rights), Woerden File:Zwemmer- Woerden-P8070205.JPG|Sculpture of a swimmer, Woerden ==References== Category:Dutch sculptors Category:Dutch artists Category:1939 births Category:2022 deaths Category:Place of death missing",
 "title": "Jan Vermaat"
}