{
 "id": "974155",
 "text": "The 1912 Kleve international aquatics competitions took place on Sunday 1 September 1912 at Hallenbad Kleve in Kleve, Germany. The competitions were organized by the Schwimm-Sport Club Kleve. Swimming, diving and water polo competitions were held for men and women.Kleves erste Badeanstalt, nrz.de, 22 October 2018 ==Entrants== There were a total of 170 entrants, from 26 different swimming clubs. Most of the swimmers were from West-Germany, Maagdenburg and Berlin registered. From the Netherlands nine female swimmers and water polo players from the Hollandsche Dames Zwemclub of Amsterdam entered. It was the first time that Hollandsche Dames Zwemclub competed internationally. For the men's diving event, the German 1912 Olympic Champion Paul Günther entered. Minnes entered for the 200 metre event and 400 metre event. ==Competitions== ===Women=== ====Swimming==== In general, the German women were better than the Dutch women, especially in the diving event. The best Dutch swimming achievements were the second place in the 4x 40m relay race and the first, second and fourth place in the junior 60 metre event. These prizes in the 60 metres were won by A. E. van Laar, Jo Evelein and A. van Laar. ====Water polo==== The women's water polo match was played between a mix of players from West-Germany against the Dutch Hollandsche Dames Zwemclub. The Dutch women were well practiced ahead of the match in Amsterdam by A. Kloppenburg. The match was easily won by the Dutch ladies. The referee of the match was criticized. He did not have an easy job during the match due to rough play but also because Germany was not familiar with the rules. The halftime score was 2-0. In the second half the Dutch women scored another two times. One of the German women scored while standing on the ground two meters in front of the goal, throwing with two hands. However, the goal was approved by the referee. Before the end of the game, the German goalkeeper scored an own goal, but this goal was not awarded to the Netherlands. So the official result of the match was 4-1. ==References== ==Other websites== * Image of the competition Category:1910s in women's sport Category:1910s in sports Category:Sport in Germany Category:1910s in Germany Category:North Rhine- Westphalia Category:Women's swimming Category:Women's diving Category:Swimming Category:Women's water polo Category:1912",
 "title": "1912 Kleve international aquatics competitions"
}