{
 "id": "974125",
 "text": "Johanna Elisabeth Triebels-Koen (1865 – 3 June 1955) was a Dutch swimming feminist and figurehead of Dutch swimming. She was the founder and president of the Hollandsche Dames Zwemclub, the first women's swimming club in the Netherlands. She became known as the \"swimming mother\". ==Biography== In 1886 Triebels-Koen founded the Hollandsche Dames Zwemclub (HDZ), the first swimming club for women in the Netherlands. She was until a late age president of the club. She was able that the club grew out to a leading swimming club. She made it possible for women participate in the swimming disciplines that was taken seriously within the world of Dutch swimming. For instance the club already started competing internationally in 1912 at the 1912 Kleve international aquatics competitions. The first time a British water polo team played in the Netherlands was against HDZ in 1914. In this match Triebels-Koen was the referee. Several members of the club won international medals, including Jo Evelein and Loes Brandt at the 1922 Women's Olympiad. Triebels-Koen was not only interested in the competitive side of swimming, but also in safety. In that era, many Dutch people could not swim and women could not swim at all. In 1889, the Hollandsche Dames Zwemclub started promoting swimming by offering free lessons to (underprivileged) women and girls. In the 1930s her swimming lessons became known undr the slogan \"Elke Nederlander Zwemmer\" (translated: \"Every Dutch swimmer\"). In July 1914 Anna Helweg saved a 21-year old maid from drowning in the in Gorredijk, while male bystanders who couldn't swim did't dare to jump into the water. In 1929 she became treasurer of the swimming federation. She hold that position for nineteen years. Triebels-Koen was also a promotor of the second women's swimming club in the Netherlands (A.D.Z.). The \"Mother Triebels Cup\", a cup that could be won at annual HDZ swimming competitions, is named after her. In 1935 Triebels-Koen became Knight in the Order of Orange-Nassau for her work. She became also an honorary member of the Dutch national swimming federation (KNZB). Triebels-Koen died after a long illness in The Hague on 3 June 1955, aged 89. She was commemorated with all swimming competitions being interrupted and the federation president giving a speech. She was cremated at Westerveld. ==References== Category:Dutch swimmers Category:Sportswomen Category:1865 births Category:1955 deaths Category:Feminists",
 "title": "Johanna Triebels-Koen"
}