{
 "id": "974253",
 "text": "The Seyrani Monument is a sculpture of Turkish folk poet Seyrani (1800–1866) in Develi, a town in Kayseri Province of Turkey. Seyrani is from Develi. The mayor of Develi asked the sculptor Gürdal Duyar to make it. The sculpture was finished in 1976. Then the monument became a symbol of Develi. In Turkish the monument is called: . A translation of this is Ashik Seyrani monument. The monument is a sculpture of Âşık Seyrani (1800–1866), a Turkish folk poet. In the sculpture he is holding a Bağlama, which is a stringed instrument. The sculpture is high. The sculpture weighs . == History == When Haşim Nezihi was the principal of the middle school he received a letter from students asking for a sculpture of Seyrani to be made and put in the town. In the letter it also said that a sum of money was collected to make the sculpture. The organisation: Develi Seyranî Public Library and Monument Building Development Association was created in the 1970s. The organisation had a goal make a monument of Seyrani in the middle of Develi. The organisation was symbolic, they did not even start to make the monument. No one did anything to make the monument until 1976. On February 14 of 1976, the leaders of Develi talked with the sculptor Gürdal Duyar and they made some plans together. The Mayor of develi at that time, whos name is, Mehmet Özdemir, officially asked Duyar to make the sculpture. The sculpture was finished on 4 April 1976 and it was placed in public on 30 April 1976 in a park in front of the Develi Çarşı Mosque. The name of the park was the Cumhuriyet Square of Develi. The money it cost to make the sculpture was 55,000 Lira. In 1983 a base was added to the sculpture. On the base there is text. This written text includes the name of Seyrani, the birth and death date of Seyrani, and some words from the poems of Seyrani. Years later the mosque was renovated and the sculpture was moved to the old market square of Develi. It would go on to become a symbol of the Develi district. Today the sculpture is on a square which is called the Aşık Seyrani Square. A couple years ago the sculpture was renovated again. The sculpture was put onto a new marble base. Poems of Seyrani are written on this base. The renovations were finished by June 2018. == References == === Citations === === Bibliography === * * * * * * * * * Category:Sculptures Category:1976 works Category:Monuments and memorials Category:1970s in art",
 "title": "Seyrani Monument"
}