{
 "id": "974249",
 "text": "Blazing Dragons is a 1996-98 Canadian/French/British animated television series produced by Burbank animation studio Nickelodeon Animation Studios and co-produced by Canadian animation studio Nelvana Limited and French animation studio Ellipse Animation. It was produced with the participation of Teletoon and M6, and in association with YTV. The series' protagonists are anthropomorphic dragons who are beset by evil humans, reversing a common story convention. The series parodies that of the King Arthur tales as well as the periods of the Middle Ages. From 1996 to 1998, Blazing Dragons was produced by Nelvana in Canada, Ellipse Programme in France and Nickelodeon Animation Studio in United States. In the series, King Allfire and his Knights of the Square Table fight against the evil Count Geoffrey and his inept minions. It ran for two seasons consisting of 26 episodes in total. The cartoon episodes that ran in the United States, namely Toon Disney (except for Teletoon, YTV and the Canadian version of Nickelodeon), were censored. Parts of episodes considered too risqué, such as the implied homosexuality of an effeminate character named Sir Blaze, and minor profanity, were cut for the American release, as such matters were deemed taboo to American children's programming at the time. Although the voice actors are of Canadian and American nationality in real life, they voiced some of the characters with British accents (mainly the dragons were given that aforementioned accent), while some characters, such as Count Geoffrey, had Canadian accents, and Merle the Wizard has an American accent. == Characters == === Dragons === * Squire Flicker: The main character of the series, a squire under Sir Loungelot, he happily accepts any task his master gives him. Flicker longs for the day he'll become a Dragon Knight himself, yet it seems the only reason he's not is that Loungelot typically takes credit for Flicker's heroic deeds. He is secretly in love with Princess Flame though he is very shy about showing it. Flicker is generally smarter and more competent than the Knights, and is a Machinist far ahead of his time even though his inventions do not always go well as he planned. In Season 2, he is also deemed as a fellow knight aside from being a squire. * Princess Flame: The daughter of King Allfire and stepsister of Blaze. Like Flicker, she also appears to be smarter and more competent than the Knights, though on a lesser scale. She is somewhat of a tomboy and will go through great lengths to save herself, the knights and/or the kingdom such as fighting in a tournament. She has a deep crush on Flicker. In season one, Flame was purple-haired (although often concealed by a veil), but in season two, she became a blonde. Her role seemed to diminish in season two. * King Allfire: King Allfire is the king of Camelhot, the head of the Knights of the Square Table, and married to Queen Griddle. King Allfire is also wielder of the legendary sword Excaliburn, but rarely uses it since he is semi-retired from fighting. * Queen Griddle: The second wife of King Allfire. She is the daughter of the gigantic Queen Mum, and is infatuated with Sir Loungelot. Griddle is also very short-tempered, and tends to get violent when angry. Due to her robustness, she is often the butt of many fat jokes. * Sir Loungelot: Head Knight of the Square Table, but as his name implies, is an incredibly lazy knight. Loungelot loves gambling, sleeping, and most of all food, especially pastries (such as biscuits, which he calls \"bickies\"). Loungelot rarely proves to be a useful companion in quests (though he is sometimes shown to be a good fighter) and often tries to get out of them except if it involves rescuing a damsel in distress or if threatened/forced by King Allfire. Despite these shortcomings, Loungelot is the favourite knight of the King and especially Queen Griddle. This is because he kisses up to her and invariably takes credit for Flicker's successes. The King and Queen, however, seem to be oblivious to Flicker's actions and often credit Lougelot for the work. Flicker is his squire, though he treats him more like a servant than a knight in training. Loungelot is the son of the Lady of the Lake (something he is not proud of since she nags him constantly and talks about his choir boy brother who is a monk). Loungelot is usually the cause of much of the knight's trouble due to his crass and selfish nature. * Sir Blaze: Sir Blaze, \"The Smartly Dressed and Fashionably Late\", is the flamboyant and effeminate son of Queen Griddle and the stepbrother of Princess Flame. Blaze is unusually energetic and is described as having amazing panache. Like Loungelot, he doesn't seem to be enthusiastic about participating in quests, preferring to work on \"home\" activities such as dressing the castle walls. He is one of the only three knights (the others Loungelot and Burnevere) who stays throughout the series. It is implied that he is homosexual. Unlike the other dragons in the series (with the exception of Flame), Blaze has long-limbered legs like a human rather than short stubby ones. in season 1, Sir Blaze's quote; \"Oh me oh my oh oh gracious.\" * Sir Burnevere: Sir Burnevere, \"The Overly Educated\", is a plucky hero with a Scottish accent and a tendency to use large words none of the other knights understand. Burnevere appears to be the oldest and wisest of the knights and often screams \"Hoot McGregor!\" when something bad happens to him. Burnevere is actually linked to the Scottish royal family, but turned down the throne at the thought of being surrounded by all his relatives. * Sir Galahot: Sir Galahot, \"The Proper\", is a large and imposing knight of the Square Table and the first knight to be introduced. He only appears in season one. * Sir Hotbreath: Sir Hotbreath, \"The Not So Proper\", is a short knight who has many ideas. Unfortunately, he often ends up torching everything near him due to uncontrollable outbursts of fire-breathing burps. Like Sir Galahot he only appears in season one. * The Wandering Minstrel: In season one, the Minstrel introduced and closed out most episodes with a short verse or song related to the content of the episode. While breaking the fourth wall in \"Knights and Knightresses\", Flicker remarks that he \"thought he was just a background character who served as mere bridges between the scenes\". In the second season, due to the shorter episode lengths, the Minstrel only appeared in the episode \"Shamrocks and Shenanigans\" as a secondary character, explaining that he was fired from Castle Camelhot. He speaks in a Liverpool accent. * Cinder and Clinker: A two-headed dragon jester. Cinder, the left- sided head, is upbeat and perpetually happy, whilst Clinker, the right-sided head, is always depressed and sullen. The duo serve as the comic relief in most episodes. Cinder's side of the body is a dark green, and Clinker's is a lighter shade. Cinder has light blue hair, and Clinker has brown hair. They both speak with Cockney accents. === Humans === * Count Geoffrey: The principal bad guy of the series, Geoffrey styles himself Dread Count Geoffrey de Bouillon, Oppressor Par Excellence of the Poor and Weak. His appearance changed from a purple knight's armour and red hair in season one to silver knight's armour with a dragon skull helmet and black hair in season two. His personality in the 2nd season also changes to be darker and more serious in tone to reflect his new appearance. Owner of Threadbare Castle, Geoffrey is always coming up with sinister \"plans\" to relieve the Dragon Knights of Castle Camelhot. * Evil Spy: An agent of Count Geoffrey dressed up in a purple dragon costume to infiltrate the Dragon Knights. His presence within the Dragon Knight ranks, usually while sensitive strategy is being discussed, never seems to be questioned by the other dragons, even though the costume is quite conspicuous. There are actually two within the show; the first is eaten by crocodiles in the second episode when Geoffrey pushes him into the moat, and is replaced with an identical evil spy. * Merle the Wizard: Merle the Wizard is a short, wise-cracking female magician who fits the stereotype of a witch much more than that of a wizard. She speaks with an American accent and often claims to have visited the future. When Count Geoffrey needs that extra edge in his fight against the Dragon Knights, Merle is often called upon and appears from a cloud of purple smoke. * Evil Knights No. 1, #2, and #3: The bumbling henchmen of Count Geoffrey. No. 1 is of medium height, fat, and has a bushy moustache. No. 2 is short and skinny with a long pointy nose, and speaks in an Italian accent. No. 3 is muscular, bald, and appears to be the stupidest of the three. It is possible the trio are brothers, since No. 3 mentioned his mother in the sense she was the mother of them all. * Peasants: Count Geoffrey is always exploiting the peasants of the village for either tax money or using them in some manner of slave labour such as catapult ammunition, or as human columns to hold up the ceiling of his crumbling castle. == Episodes == === Season 1 === * S01E01 - The Quest for the Holy Quail: written by Erika Strobel * S01E02 - A Gift for Griddle: written by Bob Ardiel * S01E03 - Tournament Day: written by Dale Schott * S01E04 - Excaliburn: written by Peter Sauder * S01E05 - Newt for a Day: written by Dale Schott * S01E06 - Knights & Knightresses: written by Erika Strobel * S01E07 - Merle's Mirror: written by Bob Ardiel * S01E08 - Renaissance Dragon: written by Peter Sauder * S01E09 - Robbing Hoodlum: written by Erika Strobel * S01E10 - The Stone of Wisdom: written by Bob Ardiel * S01E11 - Hermits & Heroes: written by Dale Schott and Erika Strobel * S01E12 - Sir Hare: written by Frank Diteljan * S01E13 - Bleepin' Beauty: written by Nadine Van der Velde === Season 2 === * S02E01 - A Killer Makeover (written by Hugh Duffy) & The Age of Retention (written by Hugh Duffy) * S02E02 - The Lost Ruby Hat of Omar the Ham (written by Hugh Duffy) & Achy Breaky Mace (written by Ben Joseph) * S02E03 - Shamrocks and Shenanigans (written by Erika Strobel) & Three Dragons and a Baby (written by John May and Suzanne Bolch) * S02E04 - King for a Day (written by Ben Joseph) & Erik the Well-Read (written by Hugh Duffy) * S02E05 - Chain Mail Letter (written by John May and Suzanne Bolch) & You Dim Sum, You Lose Some (written by David Dias) * S02E06 - Excalibroke (written by Erika Strobel) & Infernal Flame (written by Hugh Duffy) * S02E07 - MacBreath (written by John Slamma) & Attila's Hot Buns (written by Erika Strobel) * S02E08 - The Isle of Dwight (written by Hugh Duffy) & Ice Try (written by David Dias) * S02E09 - Single Green Dragon (written by John May and Suzanne Bolch) & Sphinx Jinx (written by Ben Joseph) * S02E10 - Griddle's Sleepless Knights (written by Erika Strobel) & Whine & Roses (written by Bonnie Chung) * S02E11 - The Reign in Spain (written by Ben Joseph) & Geoffrey's Evil Pancakes (written by John Slamma) * S02E12 - The Golden Thimble of Theodora (written by Erika Strobel) & Seven Dragon Sins (written by Erika Strobel) * S02E13 - Quest to Success (written by Erika Strobel) & Slay the Dragon (written by David Dias) == Voice talent == * Edward Glen as Flicker * Aron Tager as King Allfire * Suzanne Coy as Merle the Wizard * Steven Sutcliffe as Queen Griddle * John Koensgen as Count Geoffrey/Evil Knight No. 1 (season 1) * Cedric Smith as Count Geoffrey/Evil Knight No. 1 (season 2) * John Stocker as Sir Burnevere/Evil Knight No. 2 * Dan Hennessey as Sir Hotbreath/Evil Knight No. 3 * Richard Binsley as Sir Blaze/Minstrel * Stephanie Morgenstern as Princess Flame * Scott Wentworth as Sir Loungelot (season 1) * Juan Chioran as Sir Loungelot (season 2) * Rick Waugh as Cinder and Clinker/Sir Galahot == Production == === Animation === * The show was animated in 2D hand-drawn/traditional animation by Hanho Heung-Up Co., Ltd. in Seoul, South Korea, Studios Animage in Tokyo, Japan, and Le Studio Ellipse in Paris, France using Toon Boom Harmony. == Legacy == The series has gained a loyal fan following and several fan-written continuations of the series have been published online. Since July 2016, a new project called #BDRevolution or #BlazingDragonsRevolution appeared, consisting of making the fanbase grow through fanwork and converting new fans, bringing back old fans, convincing people who worked on the franchise (game and show) to support it, to convince Gavin Scott or Terry Jones to give the franchise a new chance, through any forms such as a new broadcasting, DVDs, a theatrical animated film adaptation released by Nickelodeon Movies and Paramount Pictures, a game based on the movie, or comic books, and so on. The project is slowly growing and was co-created by a fan and former story editor of season 2 Erika Strobel. Currently the entire series is available for purchase (for streaming only) at Amazon. No DVD set of the complete series is known to be produced as of June 2019, however an Australian DVD release with four episodes was released in 2005 by Magna Pacific entitled Excaliburn and a Canadian DVD release with twenty-six episodes was released in 2007 by Kaboom! Entertainment as seen on YTV entitled Blazing Dragons: The Complete First and Second Seasons. Category:1996 Canadian television series debuts Category:1998 Canadian television series endings Category:Canadian animated television series Category:Traditional animation",
 "title": "Blazing Dragons"
}