{
 "id": "97443",
 "text": "Bartolomé de Las Casas (1484 – 1566), known as the Apostle of the Indies, was a 16th century Spanish priest and writer, and the first Bishop of Chiapas, Mexico. Las Casas was the Dominican priest who condemned the treatment of Indians in the Spanish empire. His widely disseminated 'History of the Indies' helped to establish the Black Legend of Spanish cruelty. ==Biography== Bartolome de Las Casas was born in Seville, Spain in 1484. He was there when Christopher Columbus went to Seville in 1493 after Columbus' first trip to the Americas. His father, Pedro de las Casas, and his uncle went to the Americas in the second voyage of Columbus that left in November 1493. With his father, he went to the Caribbean island of Hispaniola in 1502 together with Nicolás de Ovando, the new governor of the island. In 1506 he went to Rome, Italy, where he became a Catholic priest. He went back to Hispaniola in 1508 and moved to Concepción de la Vega, in the Cibao valley, and got an encomienda (land with the indigenous people living there). Then he went in 1513 to Cuba and the governor Diego Velázquez gave him an \"encomienda\". But soon Las Casas began to understand that the native people (Taínos in Cuba and Hispaniola) were treated as slaves in a very bad way, and he began to defend the native people. Las Casas became the first official priest in the New World in 1512. In 1515 he went to Hispaniola, and from there to Spain to defend the native people of the Americas. From 1517 to 1523, and with the title Protector of the Indians, he tried to develop a model settlement in northern Venezuela to protect the native people but the experiment failed. From there, he went to Hispaniola, joining the Dominican Order (an order of Catholic priests) in 1523. He stayed in the city of Santo Domingo until 1527 when he was sent to Puerto Plata, on the northern coast, to found a new religious community and where he began to write his History of the Indies. He became Bishop of Chiapas, Mexico, from 1544 to 1547. He wrote a book about the abuse of Indians called A short account of the destruction of the Indies. The book was finished in 1542 but it was not released as a book until 1552. It is his most famous book. He went to Spain and he stayed here until he died in 17 July 1566 in Madrid. ==Works== Some of his more important written works are: * Historia de las Indias (\"History of the Indies\") * De Unico Vocationis Modo Omnium Infidelium ad Veram Religionem, known in Spanish as Del único modo de atraer a todos los pueblos a la verdadera religión, 1530 * Brevísima relación de la destrucción de las Indias (\"A Brief Account of the Destruction of the Indies\"), 1552 * Apologética historia sumaria (\"Apologetic History\") * De thesauris ==Further reading== * Bartolomé de las Casas, Short Account of the Destruction of the Indies (Paperback). Translated by Nigel Griffin. Penguin Classics; 1st ed edition (September 8, 1999) * Bartolomé de las Casas, The Devastation of the Indies, a Brief Account. Translated by Herma Briffault. Johns Hopkins University Press, Baltimore, 1974. ==References== ==Other websites== * A Brief Account of the Destruction of the Indies, at Project Gutenberg * Website dedicated to Las Casas Category:Spanish Roman Catholics Category:1484 births Category:1566 deaths Category:Spanish writers Category:Mexican Roman Catholic bishops Category:People from Chiapas",
 "title": "Bartolomé de Las Casas"
}