{
 "id": "974460",
 "text": "The following is a list of notable deaths in September 2006. Entries for each day are listed alphabetically by surname. A typical entry lists information in the following sequence: * Name, age, country of citizenship at birth, subsequent country of citizenship (if applicable), reason for notability, cause of death (if known), and reference. ==September 2006== ===1=== *Tommy Chesbro, 66, American wrestler and coach (Oklahoma State University), heart attack. *Nellie Connally, 87, American widow of Texas Governor John Connally, shared car at John F. Kennedy assassination. *Anil Kumar Dutta, 73, Indian artist, founder of Academy of Creative Art. *György Faludy, 95, Hungarian poet, writer and translator. *Rashid Maidin, 89, Malaysian leader of the Communist Party. *Ronald Mansbridge, 100, British-born American publisher, founded first US branch of Cambridge University Press. *Richard Frewen Martin, 88, British fighter pilot and test pilot. *Warren Mitofsky, 72, American pollster, creator of the exit poll, heart failure. *Bob O'Connor, 61, American Mayor of Pittsburgh, Pennsylvania, brain cancer. *Travis I. Payze, 60, Australian footballer, prostate cancer. *Sir Kyffin Williams, 88, Welsh artist, lung and prostate cancer. *Pierre Monichon, 80, French musicologist and inventor of the Harmoneon. ===2=== *Bob Mathias, 75, American decathlete, twice Olympic gold medalist, United States Representative, cancer. *Deforrest Most, 89, American gymnast, helped establish Muscle Beach, heart failure. *Willi Ninja, 45, American dancer and choreographer, AIDS. *Clermont Pépin, 80, Canadian composer, liver cancer. *Silverio Pérez, 91, Mexican bullfighter, renal illness. *Lionel Pickering, 74, British businessman, chairman of Derby County, cancer. *Anthony Poon, 61, Singaporean abstract artist, lung cancer. *Dewey Redman, 75, American jazz saxophonist, father of Joshua Redman, liver failure. *Monty Stickles, 68, American football player (San Francisco 49ers), heart failure. *Charlie Williams, 77, British comedian and footballer (Doncaster Rovers), Parkinson's disease. *Sahibzada Muhammad Ishaq Zaffar, 61, Pakistani politician, heart attack. ===3=== *Françoise Claustre, 69, French ethnologist and archaeologist. *Levi Fox, 92, British conservationist and historian, Director of the Shakespeare Birthplace Trust. *Ian Hamer, 73, British jazz trumpeter. *Eva Knardahl, 79, Norwegian classical pianist. *Annemarie Wendl, 91, German actress, heart failure. ===4=== *Rémy Belvaux, 38, Belgian writer, film producer and director (Man Bites Dog), suicide. *Ingrid Bjoner, 78, Norwegian soprano. *John Conte, 90, American actor, founded TV station KMIR, natural causes. *Giacinto Facchetti, 64, Italian footballer, cancer. *James Fee, 56, American photographer, liver cancer. *Tamás Fejér, 86, Hungarian movie director. *Mark Anthony Graham, 33, Canadian Olympian and soldier, friendly fire. *Steve Irwin, 44, Australian naturalist (The Crocodile Hunter), stabbed in the chest by a stingray barb. *Khadaffy Janjalani, 31, Filipino militant, leader of Abu Sayyaf, gunshot wounds. *Moses Khumalo, 26, South African jazz saxophonist, Best Newcomer at South African Music Awards (2002), suicide by hanging. *Clive Lythgoe, 79, British pianist. *Colin Thiele, 85, Australian children's author, heart failure. *Astrid Varnay, 88, American soprano. ===5=== *Sir Michael Davies, 85, British jurist. *Anne Gregg, 66, British television presenter (Holiday), cancer. *Gösta Löfgren, 83, Swedish football player. *Hilary Mason, 89, British character actress. *John McLusky, 83, British comics artist (James Bond). *J. Bazzel Mull, 91, American Christianity preacher and gospel music promoter. ===6=== *Warren Bolster, 59, American surf and skateboard photographer, suicide by gunshot. *Sir John Drummond, 71, British controller of BBC Radio 3 and The Proms. *Lovette George, 44, American Broadway theatre singer and actress, ovarian cancer. *Peter Greenough, 89, American finance columnist (The Boston Globe), husband of Beverly Sills, after long illness. *Peter Hyndman, 64, Canadian politician and lawyer, cancer. *Gordon Manning, 89, American television journalist (NBC and CBS), heart attack. *Sir Michael Marshall, 76, British politician, MP for Arundel (1974–1997), President of the Chichester Festival Theatre. *Mohammed Taha Mohammed Ahmed, c.50, Sudanese newspaper editor, beheaded. *Agha Shahi, 86, Pakistani diplomat and foreign minister, heart attack. *Mark Wright, 27, British soldier, posthumously awarded George Cross. ===7=== *Efraim Allsalu, 77, Estonian painter. *Sir Norman Blacklock, 78, British physician, Medical Officer to the Queen (1976–1993). *Clem Coetzee, 67, Zimbabwean conservationist, heart attack. *James deAnda, 81, American lawyer and federal judge, part of the legal team in Hernandez v. Texas, prostate cancer. *Jorge di Giandoménico, 75, Argentine Olympic sports shooter. *Joan Donaldson, 60, American founding head of the CBC Newsworld television network, complications from injuries. *Sir Stephen Egerton, 74, British diplomat, Ambassador to Italy (1989-1992). *James Hawthorne, 74, British controller of the BBC in Northern Ireland (1979–1989). *Robert Earl Jones, 96, American actor, father of James Earl Jones. *Ronald St. John Macdonald, 78, Canadian legal academic and jurist. *Cornelius O'Leary, 78, Irish historian. *John M. Watson, 69, American jazz musician and actor, non- Hodgkin lymphoma. ===8=== *Hilda Bernstein, 99, British-born South African author and anti-apartheid activist, heart failure. *Peter Brock, 61, Australian touring car racer, car accident. *William Harper, 90, Rhodesian politician *Thomas Lee Judge, 71, American Governor of Montana (1973–1981), pulmonary fibrosis. *Frank Middlemass, 87, British character actor (As Time Goes By). *Erk Russell, 80, American college football coach (University of Georgia, Georgia Southern University), stroke. *Fred Spiess, 86, American oceanographer and marine explorer, cancer. ===9=== * Gérard Brach, 79, French screenwriter (The Fearless Vampire Killers, The Name of the Rose), cancer. *Clair Burgener, 84, American Representative for California (1973–1983), complications from Alzheimer's disease. *Matt Gadsby, 27, British footballer (Hinckley United), ARVC. *Émilie Mondor, 25, Canadian Olympic distance runner, car accident. *Elisabeth Ogilvie, 89, American author. *Herbert Rudley, 95, American actor. *Keshavram Kashiram Shastri, 101, Indian founder of VHP, natural causes. *William Bernard Ziff, Jr., 76, American publishing magnate, prostate cancer. ===10=== *Ernestine Bayer, 97, American rower, complications from pneumonia. * Patty Berg, 88, American golf pioneer, founder of the LPGA, complications from Alzheimer's disease. * James C. Hickman, 79, American actuary and academic administrator, Dean of University of Wisconsin–Madison School of Business (1985-1990). * Sir John Johnston, 84, British courtier, Comptroller of the Lord Chamberlain's Office (1981-1987). * Ramanlal Joshi, 80, Indian literary critic and editor. * Melanie Lomax, 56, American civil rights lawyer, former president of the Los Angeles Board of Police Commissioners, car accident. *Ted Risenhoover, 71, American Representative for Oklahoma (1975–1979). * Bennie Smith, 72, American blues guitarist, heart attack. * Daniel Wayne Smith, 20, American actor, son of Anna Nicole Smith, drug overdose. * Taufa'ahau Tupou IV, 88, Tongan royal, King of Tonga, after illness. ===11=== * William Auld, 81, British poet, author and supporter of Esperanto. * Peter Clentzos, 97, American-born Greek 1932 Summer Olympics competitor in pole vault. * Pat Corley, 76, American actor (Murphy Brown), heart failure. *János Dévai, 66, Hungarian Olympic cyclist. * Solange Fernex, French ecologist and green politician. * Joachim Fest, 79, German historian and journalist. *Joseph Hayes, 88, American author (The Desperate Hours). *Johannes Bob van Benthem, 85, Dutch lawyer, first president of the European Patent Office (1977–1985). ===12=== *John S.R. Duncan, 85, British diplomat. *Raymond Mikesell, 93, American economist at the Bretton Woods Conference. *Emily Perez, 23, American first female African-American Army officer to die in combat, improvised explosive device. *Craig Roberts, 38, Canadian Olympic wrestler. *Bill Saul, 65, American football player (Pittsburgh Steelers), cancer. *Edna Staebler, 100, Canadian cookbook and non-fiction author, stroke. ===13=== *Brian Biggins, 66, English football player (Chester City). *Cesare Barbetti, 75, Italian actor and voice actor. *Sir Douglas Dodds-Parker, 97, British Conservative minister and wartime SOE officer. *Christopher Essex, 61, Australian fashion designer, cancer. *N. V. Krishnaiah, 76, Indian politician. *Ann Richards, 73, American Governor of Texas (1991–1995), esophageal cancer. *Peter Tevis, 69, American musician, Parkinson's Disease. ===14=== *Norman Brooks, 78, Canadian singer, Al Jolson imitator, emphysema. *Silviu Brucan, 90, Romanian ambassador to the United States, opponent of Nicolae Ceauşescu. *Elizabeth Choy, 95, Singaporean war heroine, first female legislator, pancreatic cancer. *Miklós Hargitay, 80, Hungarian former Mr. Universe and actor, ex-husband of Jayne Mansfield, father of Mariska Hargitay. *J. William Kime, 72, American former commandant of the Coast Guard. *Andrey Kozlov, 41, Russian First Deputy Chairman of the Central Bank of Russia, shot. *Peter Ling, 80, British television writer, creator of Crossroads. *Paulo Marques, 58, Brazilian journalist and presenter, brain cancer. *Esme Melville, 87, Australian film and television actress. *Terry O'Sullivan, 91, American television actor (Search for Tomorrow), pancreatic cancer. *Johnny Palmer, 88, American golfer, seven-time PGA Tour winner. *Frederic Wakeman, 68, American scholar of Chinese history. ===15=== *Raymond Baxter, 84, British television presenter (Tomorrow's World). *Oriana Fallaci, 77, Italian journalist and writer, breast cancer. *Guy François, Haitian Army colonel, participated in failed coups in 1989 and 2001. *Charles L. Grant, 64, American horror and science fiction author, heart attack. *Douglas Henderson, 71, British politician. *Donald Kimball, 62, American defrocked Roman Catholic priest, convicted in sex abuse scandal. *Nitun Kundu, 70, Bangladeshi artist and sculptor. *David T. Lykken, 78, American professor of psychology (University of Minnesota). *Abe Saffron, 86, Australian nightclub owner and property developer. *Pablo Santos, 19, Mexican actor (Greetings from Tucson), plane crash. *Sergio Savarese, 48, Italian furniture designer, plane crash. *Meredith Thring, 90, British engineer. ===16=== *John Allen, 80, American Olympic athlete. *Sten Andersson, 83, Swedish Minister for Foreign Affairs (1985–1991) and Minister for Social Affairs (1982–1985), heart attack. *Floyd Curry, 81, Canadian four-time Stanley Cup winner (Montreal Canadiens). *George Estman, 84, South African Olympic cyclist. *E. H. H. Green, 47, British historian, multiple sclerosis. *Zsuzsa Körmöczy, 82, Hungarian tennis player and coach, won 1958 French Championships. *Rob Levin, 51, American founder of freenode, head injury from bicycle accident. *Esther Martinez, 94, American Tewa storyteller and linguist, car accident. *Fouad el-Mohandes, 82, Egyptian comedy actor, heart failure. ===17=== *Jack Banta, 81, American Major League Baseball player (Brooklyn Dodgers). *Al Casey, 89, American rock and country music guitarist. *George Heslop, 66, English footballer (Manchester City). *Patricia Kennedy Lawford, 82, American socialite, sister of John F. Kennedy, ex-wife of actor Peter Lawford, pneumonia. *Nathaniel Lubell, 90, American Olympic fencer and artist. *Edward D. Re, 85, American lawyer and judge. *Leonella Sgorbati, 65, Italian nun, shot. *Kazuyuki Sogabe, 58, Japanese anime voice actor (Sailor Moon, Dragon Ball). * Dorothy C. Stratton, 107, American first director of the Coast Guard Women's Reserve. ===18=== *Seán Clancy, 105, Irish oldest War of Independence veteran. *Edward J. King, 81, American Governor of Massachusetts (1979–1983). *Philip H. Melanson, 61, American academic, expert on assassinations, cancer. *Nilton Pereira Mendes, 30, Brazilian footballer, heart attack. *Leo Navratil, 85, Austrian psychiatrist. *Syd Thrift, 77, American general manager of the Pittsburgh Pirates and Baltimore Orioles. ===19=== *Elizabeth Allen, 77, American actress (Donovan's Reef, Do I Hear a Waltz?, The Jackie Gleason Show). *Danny Flores, 77, American saxophonist and vocalist (The Champs), pneumonia. *Joe Glazer, 88, American singer-songwriter. *Martha Holmes, 83, American Life photographer, natural causes. *Sir Hugh Kawharu, 79, New Zealand academic and Māori leader. *Vico Magistretti, 86, Italian architect and designer. *Manuel Mindán Manero, 103, Spanish philosopher and priest, natural causes. *Roy Schuiten, 55, Dutch track and road racing cyclist. *Terry Smith, 47, Australian rules football player (Richmond, St Kilda), cancer. ===20=== *Phạm Xuân Ẩn, 78, Vietnamese journalist, North Vietnamese spy during Vietnam War, emphysema. *Clarence Hill, 48, American convicted murderer, executed by lethal injection. *Henri Jayer, 84, French winemaker. *Armin Jordan, 74, Swiss conductor. *Beth Levine, 91, American shoe designer. *Sven Nykvist, 83, Swedish cinematographer and two-time Academy Award-winner. *John W. Peterson, 84, American gospel hymn writer, cancer. *Lillian Robinson, 65, American professor of women's studies (Concordia University). *Don Walser, 72, American country singer and yodeler, complications from diabetes. *Muddy Waters, 83, American college football coach (Michigan State University). *Dean Wooldridge, 93, American physicist, co-founder of TRW. ===21=== *Boz Burrell, 60, British bassist and vocalist (Bad Company, King Crimson), heart attack. *Margaret Ekpo, 92, Nigerian politician and women's rights activist. *Alan Fletcher, 75, British graphic designer. *Gilbert Jonas, 76, American fundraiser for the NAACP. *Charles Larson, 86, American television writer and Emmy Award- nominated producer (The F.B.I.). *Charles Rees, 78, British chemist. ===22=== *Edward Albert, 55, American actor, son of actors Margo and Eddie Albert, lung cancer. *Carla Benschop, 56, Dutch basketball player. *Tommy Garnett, 91, English-born Australian cricketer and educator. *Enrique Gorriarán Merlo, 64, Argentine revolutionary and guerrilla leader, cardiac arrest due to abdominal aortic aneurysm. *Tommy Olivencia, 64, Puerto Rican salsa singer and bandleader. *Mary Orr, 95, American author whose story \"The Wisdom of Eve\" inspired the film All About Eve. ===23=== *Sir Malcolm Arnold, 84, British Academy Award-winning film score composer (The Bridge on the River Kwai), chest infection. *Etta Baker, 93, American piedmont blues guitarist. *Sir Charles Cutler, 88, Australian Deputy Premier of New South Wales (1965–1975), cancer. *Aladár Pege, 67, Hungarian jazz musician. *Tim Rooney, 59, American actor, son of Mickey Rooney, dermatomyositis. ===24=== *John S. Boskovich, 49, American artist and screenwriter (Without You I'm Nothing). *Joel Broyhill, 86, American Republican congressman for Virginia (1953–1975), heart failure and pneumonia. *Michael Ferguson, 53, Irish republican politician, testicular cancer. *Sally Gray, 90, British actress. *Joan Hatcher, 82, New Zealand cricketer. *Ben Heppner, 63, Canadian politician, bone cancer. *Padmini, 74, Indian actress in Tamil, Malayalam, Hindi, Telugu and Kannada films, heart attack. *Patrick Quinn, 56, American actor, president of Actors' Equity Association (2000–2006), heart attack. *Thomas Stewart, 78, American bass- baritone opera singer. *Tetsuro Tamba, 84, Japanese actor. *Henry Townsend, 96, American blues guitarist, pianist and songwriter, pulmonary edema. ===25=== *Safia Ahmed-jan, 65, Afghan women's rights advocate, shot. *Omar al- Faruq, 35, Kuwaiti senior member of al-Qaeda, shot. *Jeff Cooper, 86, American small arms expert. *Maureen Daly, 85, American author (Seventeenth Summer). *John M. Ford, 49, American science fiction and fantasy writer, natural causes. *Sir Vijay Singh, 75, Indo-Fijian lawyer and politician, cancer. * Sir Iain Tennant, 87, Scottish businessman and public servant. *Metropolitan Vitaly Ustinov, 96, Russian First Hierarch of the Russian Orthodox Church Outside Russia (1985–2001). ===26=== *Gerhard Behrendt, 77, German inventor of Sandmännchen children's television character. *Giuseppe Bennati, 85, Italian film director. *Laurence Jonathan Cohen, 83, British philosopher. *Iva Toguri D'Aquino, 90, Japanese American convicted and later pardoned of being World War II propagandist \"Tokyo Rose\". *Mihály Fülöp, 70, Hungarian Olympic fencer. *Byron Nelson, 94, American professional golfer. *Sir Philip Randle, 80, British biochemist. *Sir Martin Roth, 88, Hungarian-born British president of the Royal College of Psychiatrists. *John Salisse, 80, British businessman and magician. *Ralph Story, 86, American radio broadcaster and television host (The $64,000 Challenge), emphysema. ===27=== *Geraldine Guest, 83, American baseball player (AAGPBL). *William Horwitz, 88, American chemist. *Helmut Kallmeyer, 95, German chemist and Aktion T4 perpetrator. *Craig Kusick, 57, American former first baseman for the Minnesota Twins, leukemia. *Arthur Marwick, 70, British historian, first professor of history at the Open University. *Sir Michael Pollock, 89, British admiral, First Sea Lord (1971-1974). ===28=== *George Balzer, 91, American writer for Jack Benny's radio and TV shows. *Adam Curle, 90, British academic and peace activist. *James Hamilton, 4th Baron Hamilton of Dalzell, 68, British aristocrat and politician, cancer. *Virgil Ierunca, 86, Romanian writer. ===29=== * Rosamond Carr, 94, American fashion illustrator turned humanitarian and activist. * Billy Mauch, 85, American child actor and sound editor. *Jan Werner Danielsen, 30, Norwegian singer, heart failure. *Gerry Gazzard, 81, English footballer. *Walter Hadlee, 91, New Zealand cricketer, stroke. *Louis-Albert Vachon, 94, Canadian Archbishop Emeritus of Québec. ===30=== *Isabel Bigley, 80, American stage actress, Tony Award-winner for Guys and Dolls. *Josh Graves, 79, American bluegrass dobro player. *Bert James, 92, Australian politician, MP for Hunter (1960-1980). *Adolf H. Lundin, 73, Swedish oil and mining entrepreneur, leukemia. *Pino Mlakar, 99, Slovenian ballet dancer. *André Schwarz-Bart, 78, French novelist. *András Sütő, 79, Romanian writer of Hungarian descent, melanoma. ==References== *2006-09 Category:September 2006 events",
 "title": "Deaths in September 2006"
}