{
 "id": "974434",
 "text": "Jupiter Icy Moons Explorer (JUICE) is a space probe made by the European Space Agency that will explore Jupiter's major moons, mostly just Ganymede, Europa, and Callisto. It is powered by solar panels, like NASA's Juno spacecraft. The spacecraft launched on 14 April 2023. It will reach Jupiter's orbit in July 2031 after four gravity assists and eight years of travel. It will fly near the moons before going into orbit around Ganymede. == Instruments onboard JUICE == JANUS- An optical camera system MAJIS- Moon and Jupiter imaging Spectrometer GALA- Ganymede laser Altimeter J-Mag- A magnetometer for JUICE RPWI- Radio & Plasma Wave Investigation UVS- UV imaging Spectrograph SWI- Sub- millimeter Wave Instrument RIME- Radar for Icy Moons Exploration PEP- Particle Environment Package 3GM- Gravity & Geophysics of Jupiter and Galilean Moons == History == Juice builds on the previously proposed Europa Jupiter System Mission (EJSM-Laplace), a planned collaborative mission between ESA and NASA that would have carried out an in-depth study of the Jovian system and its icy moons. It is now foreseen that the Juice and NASA Europa Clipper spacecraft will be exploring the Jovian system simultaneously. == Milestones JUICE will achieve == * It will be the first spacecraft to orbit a moon in the outer solar system(Ganymede) * Juice’s flyby of the Earth-Moon system, known as a Lunar-Earth gravity assist (LEGA), is a world first: by performing this maneuver — a gravity assist flyby of the Moon followed just 1.5 days later by one of Earth—Juice will be able to save a significant amount of fuel. == Spacecraft structure == Three-axis stabilized with 10 solar panels and a 2.5-metre-long High Gain Antenna, with a dry mass of approximately 2400 kg and a wet mass (including fuel) of approximately 6000 kg. Each solar panel measures about 2.5 m x 3.5 m; with five on each side of the spacecraft deployed as two distinctive cross-shaped arrays, these total an area of about 85 square meters. == Journey == Juice will spend approximately eight years cruising to Jupiter, during which it will complete fly-bys of Venus, Earth and the Earth-Moon system. It will reach Jupiter in July 2031; six months before entering orbit around Jupiter, Juice will begin its nominal science phase. The spacecraft will go on to spend many months orbiting Jupiter, completing fly- bys of Europa, Ganymede and Callisto, and finally conducting an orbital tour of Ganymede. == Details == Details about the JUICE mission Life time 4yrs. Launch Kourou, French guinia Rocket Ariane 5 Launch date April 13, 2023 Launch Time 12:15UTC (8:15am EDT) (5:35pm IST) ==References== Category:2020s in spaceflight Category:European Space Agency spacecraft Category:April 2023 events",
 "title": "Jupiter Icy Moons Explorer"
}