{
 "id": "974647",
 "text": "The Government of Nepal () is the federal executive authority of Nepal. Before the end of the Nepali monarchy in 2006 (became republic in 2008), it was officially known as His Majesty's Government. The head of state is the president. The prime minister holds the position of the head of executive. The role of president is largely ceremonial. The functions of the government are managed entirely by the prime minister (PM). The PM is appointed by the Parliament. The heads of constitutional bodies are appointed by the president on the recommendation of Constitutional Council, with the exception of the attorney general (AG). AG is appointed by the president on the recommendation of the prime minister. == List of governors == Portrait Name (borndied) Home Province Tenure in office Chief Minister(s) Appointed by From To Time in office Minister Party 1 Baburam Kunwar बाबुराम कुँवर Lumbini Province 19 January 2018 3 November 2019 Prithvi Subba Gurung Communist Party of Nepal (Unified Socialist) Bidya Devi Bhandari He was appointed First Governor, as per Article 162 (2) of the Constitution of Nepal by the President on the recommendation of the Council of Ministers on 19 January 2018. Previously, he served as the twenty-first Attorney General of Nepal. 2 Amik Sherchan अमिक शेरचन Gandaki Province 5 November 2019 3 May 2021 Prithvi Subba Gurung Communist Party of Nepal (Unified Socialist) Bidya Devi Bhandari He was appointed second Governor of Gandaki Province, per Article 163 (2) of the Constitution of Nepal by President on the recommendation of the Council of Ministers on 5 November 2023. Previously, he served as the Deputy Prime Minister and Minister of Health and Population of Nepal in the interim government under Girija Prasad Koirala cabinet. 3 Sita Kumari Poudel सिता कुमारी पौडेल Bagmati Province 3 May 2021 27 July 2021 Prithvi Subba Gurung Communist Party of Nepal (Unified Socialist) Bidya Devi Bhandari Krishna Chandra Nepali Pokharel Nepali Congress She was appointed by President of Nepal on recommendation of the council of ministers of the federal government on 3 May 2021. She was appointed as third Governor of Gandaki Province after removing Amik Sherchan. 4 Prithvi Man Gurung पृथ्वीमान गुरुङ 27 July 2023 Incumbent Krishna Chandra Nepali Pokharel Nepali Congress Bidya Devi Bhandari Khagaraj Adhikari Communist Party of Nepal (Unified Socialist) Surendra Raj Pandey Nepali Congress He was appointed fourth Governor, as per Article 163 (2) of the Constitution of Nepal by the President on the recommendation of the Council of Ministers on 27 July 2021 to succeed Sita Kumari Poudel. == References ==",
 "title": "Government of Nepal"
}