{
 "id": "974872",
 "text": "Nueva Ecija ( Filipino : Bagong Esiha/Nuweba Esija ) is one of the provinces not next to water in the Philippines, located in the Central Luzon region . The City of Rice Fields is its capital. Nueva Ecija is near Bulacan, Pampanga, Tarlac, Pangasinan, Nueva Vizcaya, Zambales, Bataan and Aurora. == Economy == Nueva Ecija is considered the main growing rice in the province of Philippines. It also the leading generate of theonions (in the municipality of Bongabon) in Southeast Asia. Buffalo Milk,vegetables and fruits gathered in the crops in Nueva Ecija are also famous here. Nueva Ecija is a beautiful place to visit. You can see a mountain range and calmness view and there is lot of delicious food everywhere in Nueva Ecija. Nueva Ecija also known as \"Rice bowl of the Philippines\". Every corner in Nueva Ecija has rice stores because rice is very famous in Nueva Ecija. == Geography == === Political === The Nueva Ecija is divided into 27 municipalities and 5 cities . ==== Cities ==== * Cabanatuan City * Gapan City * Paddy City * City of San Jose * Science City of Muñoz ==== Towns ==== * Aliaga * Bongabon * Cabiao * Carranglan * Cuyapo * Gabaldon (Bitulok and Sabani) * Gen. M. Nativity * General Tinio (Papaya) * Guimba * Jaen * Laurel * Licab * Llanera * Lupao * Nampicuan * help * Peñaranda * Quezon * Rizal * San Antonio * San Isidro * San Leonardo * Santa Rosa * Santo Domingo * Talavera * Lugtug * Zaragoza == History == Nueva Ecija was formed as a military of comandancia in 1777 by Governor General Clavería, with the capital at Baler (now part of Aurora). Formerly belonging to the province of Pampanga . From its initial establishment, the area of the land grow to cover the entire island of Luzon . There are Spanish records that recognize 2 Spanish provinces ( counties ) in the Pacific —Las Islas Filipinas and Nueva Ecija. Poverty was the only reason why the King of Spain did not noticed that Nueva Ecija will separated country in the Philippines in the 1840s. From 1777 to 1917, the territory of Nueva Ecija was split to give way to the creation of another province. The province of Tayabas (now Aurora and Quezon ) including the islands of Polilio, the province of Palanan (now Isabela ), Cagayan, the province of Nueva Vizcaya, the territory that became part of the Province of Quirino, and the province of Manila north of the province of Tondo in 1867, and the District of Morong (now Rizal ) that was created from Nueva Ecija. The province was named after the old city of the Nueva Écija in Sevilla, Spain . In 1896, Nueva Ecija was one of the first province to rebilion against Spain, and one of the provinces to declare the independence in 1898. The \"First Scream of Nueva Ecija\" was a strike in 1896 led by General Mariano Llanera, who was accompanied by General Manuel Tinio and Pantaleon Valmonte of the Town of Gapan, Nueva Ecija and colonel Alipio Tecson of Cabiao, Nueva Ecija who later became Brigadier General. The strike was held in Cabiao, Nueva Ecija. Alipio Tecson became Governadorcillo of Cabiao, Nueva Ecija. == House Sideco == General Emilio Aguinaldo inaugurated San Isidro, Nueva Ecija as the capitol of the First Republic of the Philippines on March 29, 1899. General Aguinaldo lived in this house owned by Crispulo \"Kapitan Pulong\" Sideco which then became the de facto Philippine capitol. When the Americans arrived in the town of San Isidro, the Sideco House became the home of Col. Frederick Funston who also captured General Aguinaldo in Palanan, Isabela . It was also in this house that the arrest of General Aguinaldo was discussed. ==References==",
 "title": "Nueva Ecija"
}