{
 "id": "975565",
 "text": "Grimm's law is the name for sound laws in Proto-Indo-European languages. In the 1st millennium BC, some sounds in these languages changed. The law is named after the German linguist Jacob Grimm, who described the sound changes in the early 19th century. It is known that almost all modern European languages originated in (grew out of) early Indo-European language. Proto- Indo-European (PIE) is the reconstructed common ancestor of those modern languages. Grimm's law is sometimes called First Germanic sound shift. There also was a Second Germanic sound shift, which affected mostly German dialects and happened much later. == Historical background == Jacob Grimm based his theory on the Danish philologist Rasmus Christian Rask’s essay On the Origin of the Icelandic Language. He examined the relationship between consonants in Germanic languages and other Indo-European languages such as Latin or French. The results of the change in consonants are still visible in English, Dutch, and the Scandinavian languages. == The first Germanic sound shift == A chain shift is a series of interrelated sound changes. The assumption behind the chain shift is that all the phonemes of a language build a balanced system and so a change in one part of the system can cause changes in its other parts. Many chain shifts are vowel shifts because many sets of vowels are naturally arranged on a multi-value scale (such as vowel height or frontness). However, chain shifts can also occur in consonants. The modern word apple used to be pronounced with b (Gaulish abalom or Lithuanian obuolỹs), a change that occurred with Grimm's law. Therefore, in terms of consonants, the shift from PIE to Proto-Germanic (PG) can be split into three stages: # PIE voiceless stop consonants (stops) changing into voiceless fricative consonants (fricatives). The voiceless stops remain unaffected after the letter s. # PIE unaspirated voiced stops (aspirated consonants) changing into unaspirated voiceless stops. # PIE aspirated voiced stops changing into unaspirated voiced fricatives and/or unaspirated voiced stops (allophones at the time). 1\\. 2. 3. => 1. 2. 3. p b bh / f [f] p b [v] t d dh / þ [θ] t d [ð] ḱ ǵ ǵh / h [x] k ʒ [ɣ] kw gw gwh / h [xw] kw ʒ [ɣw] == Explanation == The first group of voiceless stop consonants: * For example, p changed to f. Latin pater became father in Modern English. Equally, duo became two. * Additionally, the PIE tréyes became þrīz in Proto-Germanic, which turned into the 'odern English three (as in [ˈθriː]). * The word káput or better-known Latin equivalent corpus shifted towards head. * Lastly, PIE *kwo- transformed into Old English hwaet. All of the words that consisted of the presented consonants were affected by Grimm's law. Some words may have undergone only one or two of the changes, but others may have undergone all of them. == Similarities in Germanic languages == The impact of the first Germanic sound shift can be followed across most of the Germanic languages. We can see that many words are similar in sound and meaning because of the shift. Grimm's law provides an insight into why and how core words sound so similar in Germanic languages but are, in some respects, quite distinct from other Indo-European languages: *bh changed into b (English: brother; West Frisian, Dutch: broeder; German: Bruder; Gothic: broþar; Icelandic, Faroese: bróðir; Danish, Norwegian, Swedish: broder) *ǵ switched to k (English: cold; West Frisian: kâld; Dutch: koud; German: kalt; Icelandic, Faroese: kaldur; Danish: kold; Norwegian: kald; Swedish: kall) Thpse changes may also have created consonant clusters in words that contain two or more consonants: **t with the shift *kt —> *ht (English: eight; West Frisian, Dutch, German: acht; Gothic: ahtáu; Icelandic: átta) **k with the shift *kʷt→ht (English: night; West Frisian, Dutch, German: Nacht; Gothic: nahts; Icelandic: nótt) == When did it happen? == It is not possible to exactly say when it happened. Most people say that it was around 500 BC since several loanwords in Germanic language were not afftected by the shift before the 5th century BC. There are some examples that show that the shift was completed in the 1st century BC. * Cimbri teutonique should have been chimbri theudonique after the shift. * Julius Caesar talks about Vacalus (the River Waal, one of the two main branches of the estuary of the Rhine). About 150 years later, Tacitus uses Vahalis for the same river. * In De Bello Gallico, Cesar mentions tribes around the River Meuse: Condruses, Eburones, Caerosos, Paemanos, qui uno nomine Germani appellantur (Condrusi, Eburones, Caerosi and Paemani, which are called Germani by name) (2,4,10). Today, most people think that Eburones is the only Germanic name (with the shift) and that the others are Celtic (without the shift). Category:Linguistics == References == Category:Germanic languages",
 "title": "Grimm's law"
}