{
 "id": "975842",
 "text": "\"L-Innu Malti\" (\"The Hymn of Malta\") is the national anthem of Malta. It is written like a prayer to God. ==Lyrics== ===Maltese original=== Maltese original IPA transcription ===Translations=== Poetic English translation by René Micallef English translation by May Butcher Literal English translation by Peter Streich I Guard, Lord, forever, as you've done erst and ceasing never, This land whose name we received, our motherly-named Mother. Her you have draped with a light whose grace exceeds all other. II On those who govern, sovereign God, bestow understanding, Grant wellness to those who work, largesse to those employing, Make firm, make just all our bonds, the peace we are enjoying. I Guard her, Oh Lord! As ever Thou hast guarded! This Motherland so dear whose name we bear! Keep her in mind, whom Thou hast made so fair! II May he who rules, for wisdom be regarded! In master mercy, strength in man increase! Confirm us all, in unity and peace! I This sweet land, the Mother that gave us her name, Protect (her), Lord, as always You protected (her): Remember that her (You) clothed with the sweetest light. II Give, great God, discernment to (those) who rule her, Return mercy to the owner, health to the worker: Render righteous the unity in the Maltese and the peace. Italian translation (version 1) Italian translation (version 2) Arabic translation Questa nostra bella terra, che noi chiamiamo Madre Patria Guardala, Dio, come hai sempre fatto ricordati che l'hai adornata della più alta luce. Dona, Dio Onnipotente, saggezza e misericordia a chi governa, salute a chi lavora, e assicura al popolo maltese unità e pace. Questa dolce terra, la Madre che ci diede il proprio nome, Guarda, Signore, come l'hai sempre guardata: Rammentati che Tu della luce più dolce la ricopristi. Da', o grande Dio, la saggezza a chi la governa, Dona la bonta' al padrone, la forza al bracciante: Rafforza l'unione tra i maltesi e la pace. احرسها يا مولاي كما حرستها دائما وتذكر أنك ألبستها أجملَ حلةِ ضياء أعطِ يا الله العظيم الحكمة لمن يحكمها. أعط يا الله الحكمة لمن يحكمها ، رحمة للمالك قوة العامل: الصديق الوحدة في المالطية والسلام. ==References== Category:European anthems Category:National symbols of Malta",
 "title": "L-Innu Malti"
}