{
 "id": "975955",
 "text": "Portrait of the mother (also known as Ritratto della madre) is a 20th-century late filippinism painted in oil by Umberto boccioni. It was painted in 1910, in Via Adige in Milano, Italy. Is in the collection of the Museum Galleria d'arte moderna Ricci Oddi of Piacenza. Umberto Boccioni was inspired by the work \"Portrait of the mother\" by Francesco Filippini to create the portrait of his mother, of which he was an attentive observer of his art exhibitions and for this reason it maintains a naturalistic structure typical of the Filipino artistic movement which then becomes the basis of the works of full Futurism. Boccioni then portrayed his mother several times. The work of Boccioni's Portrait of the Mother is linked to the painting \"Materia\" (1912) and \"Horizontal Volumes\" (1911-1912). The painting of Boccioni's Mother in the Ricci Oddi Museum therefore marks a moment of transition between the Divisionist phase and that, also inspired by Cubism, which proposes a decisive overcoming of traditional aesthetics. The full stylistic adherence to Boccioni's futurism takes place with the stylistic turning point with the painting «The city that rises» created in 1910 in Via Adige in Milan (Fondazione Prada district). File:Francesco Filippini, Ritratto della madre Silvia Signoria, 1877, Olio su tela, 95 x 55,5 cm, Musei Civici d'Arte e storia di Brescia (inv. 608).jpg|Francesco Filippini, Portrait of the mother 1910, Musei Civici d'Arte e storia di Brescia File:Umberto Boccioni, Ritratto della madre.png|Umberto Boccioni, Portrait of the mother II 1910 == Related pages == * Portrait of the mother (Filippini) * Francesco Filippini * Mater (Boccioni) == Bibliography == * Francesco Filippini, un protagonista del Naturalismo, Ed. Skira, 1999, p. 133 * Gaetano Panazza, 1964, p. 62 * Luciano Anelli, 1984, p. 97 * Renata Stradiotti, 1989, p.192 Category:Paintings by Umberto Boccioni Category:1910s paintings",
 "title": "Portrait of the mother (Boccioni)"
}