{
 "id": "97593",
 "text": "Sonic the Hedgehog 2 (also called Sonic 2) is the second video game in the Sonic the Hedgehog series. It is a sequel to Sonic the Hedgehog. It was made by Sonic Team and published by Sega for the Sega Genesis in 1992. Unlike the first game, it has a half-pipe special stage and has seven Chaos Emeralds instead of six. It also introduces Miles \"Tails\" Prower. Development of the game began in November 1991, five months after the first game released. The game was developed by both Japanese and American staff at Sega Technical Institute. ==Plot== Dr. Robotnik has begun making his ultimate weapon: the Death Egg. He searches for the seven Chaos Emeralds, which are hidden on West Side Island, to use as the spaceship's power source. Sonic goes to West Side Island to chase Robotnik down, and meets a two-tailed fox nicknamed Tails. To stop Robotnik's evil plans, Sonic and Tails travel through 11 zones: Emerald Hill, Chemical Plant, Aquatic Ruin, Casino Night, Hill Top, Mystic Cave, Oil Ocean, Metropolis, Sky Chase, Wing Fortress and finally the Death Egg. At the end of the game, after Sonic defeats Robotnik and his Death Egg Robot, Tails saves Sonic from falling to the ground with his plane, the \"Tornado\". The Death Egg crashes into Angel Island, setting up the events of Sonic the Hedgehog 3. ==Gameplay== The gameplay is similar to the first Sonic the Hedgehog game; the player can run, curl up into a ball and jump, and perform a new move, the Spindash. The Spindash is a move where Sonic can curl up, gain energy, and roll at high speeds. Tails follows Sonic through most of the levels so he can help pick up rings and destroy enemies. When the player touches a checkpoint with at least 20 rings, they can go to a special stage where they must collect as many rings as they can while dodging bombs. If the player wins a special stage, they earn a Chaos Emerald. Getting all seven lets the player turn into Super Sonic, a form that makes Sonic invincible and lets him run faster and jump higher. Using Super Sonic drains one ring every second, and hitting 0 will turn Sonic back to normal. Getting all seven emeralds also unlocks the good ending. ==Development== After the release of the original Sonic the Hedgehog, creator Yuji Naka quit Sega due to disagreements over corporate policy. Mark Cerny, who had recently created Sega Technical Institute (STI) in California, met with Naka in Japan. He offered Naka a higher salary and more creative freedom if he joined STI. Naka agreed. Hirokazu Yasuhara, the lead level designer of Sonic the Hedgehog, also decided to join STI. ==Reception== {{Video game reviews | GR = (SMD) 88% | MC = (X360) 82/100 (iOS) 60/100 (3DS) 87/100 | CVG = 94%Computer & Video Games, issue 132 (November 1992) | EGM = 35/40Electronic Gaming Monthly, 1998 Video Game Buyer's Guide, page 87 | EuroG = (X360) 9/10 | Fam = 30/40Famitsu, issue 206 | GameFan = 197/200GameFan, volume 1, issue 2 (December 1992), pages 9 & 14-17 | GamePro = 19.5/20 | GI = 27.25/30Game Informer, issue 8 (January/February 1993), pages 56-57 9.5/10 | GSpot = (X360) 8/10 | IGN = (WII) 8.5/10 | ONM = (WII) 94% | OXM = (X360) 9/10 | rev1 = Bad Influence! | rev1Score = Bad Influence, issue 2, pages 46-47 | rev2 = Mean Machines | rev2Score = 96% | rev3 = Mega | rev3Score = 94% | rev4 = Mega Zone | rev4Score = 93% | rev5 = Sega-16 | rev5Score = 10/10 | rev6 = Sega Force | rev6Score = 97% | rev7 = Sega Force Mega | rev7Score = 95% | rev8 = TouchArcade | rev8Score = (iOS) | award1Pub = Electronic Gaming Monthly | award1 = Best Game of the Year (Genesis) | award2Pub = GameFan Golden Megawards | award2 = Best Action Platform GameGameFan, volume 1, issue 3 (January 1993), pages 70-71 | award3Pub = Game Informer | award3 = Best Action/Adventure Game, Best Graphics in a Video GameGame Informer, issue 8 (January/February 1993), page 34 | award4Pub = GamePro | award4 = Action/Adventure Game of the Year, 16-Bit Game of the Year (Runner-Up), Award for Excellence in Graphics (Runner-Up)GamePro, issue 44 (March 1993), pages 22-24 | award5Pub = MegaTech | award5 = Hyper Game }} Because of the popularity of its predecessor, Sonic the Hedgehog 2 already had a fanbase waiting for its release. The game received a lot of praise, and it was a bestseller in the UK charts for 2 months. As of 2006, the game had sold over 6 million copies. This makes it the second best-selling game on the Sega Genesis. Electronic Gaming Monthly said it was the best Genesis game of 1992. The most common criticisms were about the two-player mode, a first for the series. ==References== Category:1992 video games Category:Sonic the Hedgehog games Category:Android (operating system) games Category:Cooperative video games Category:IOS games Category:Nintendo 3DS games Category:Platform games Category:PlayStation Network games Category:Sega Genesis games Category:Side-scrolling platform games Category:Side-scrolling video games Category:Video game sequels Category:Video games developed in the United States Category:Virtual Console games Category:Windows games Category:Xbox 360 Live Arcade games",
 "title": "Sonic the Hedgehog 2"
}