{
 "id": "976098",
 "text": "Vu Cat Tuong ( October 2, 1992 in Long An) is a Vietnamese singer, songwriter, and record producer. She can sing R&B;, neo soul, pop, blues, jazz, funk and ballad. == 1992-2013: Childhood and career start == Vu Cat Tuong was born on October 2, 1992 in Long An city, in family with tradition of education; Her father and grandfather are teachers. In 5 years old, she learned organ and start learning music in 2013. Vũ Cát Tường auditioned for The Voice of Vietnam season 2, singing \"Đông\" in her blind audition. All four coaches, Đàm Vĩnh Hưng, Mỹ Linh, Quốc Trung and Hồng Nhung turned her chair for her and Tường eventually chose to join team Đàm Vĩnh Hưng. Vũ Cát Tường was pitted against fellow team Đàm Vĩnh Hưng member, Song Tú, who defeated her after singing \"One Night Only\". Although not chosen as the winner, she received three \"steals\" from other coaches and opted for Hồng Nhung. In the Knockout round, Vũ Cát Tường sang \"Cám ơn tình yêu tôi\" by Phương Uyên and advanced to the Live shows. In the semi-final round, coach Hồng Nhung gave her all 100% of her point, which advanced her to the finale without any public vote counted. In the live finale broadcast on December 15, 2013, she was declared the second runner-up of the second season, behind team Đàm Vĩnh Hưng's Vũ Thảo My and team Mỹ Linh's Nguyễn Hoàng Tôn. == 2014–2016: Release MV, Album Vol.1, The Voice Kids == In 2014, Vũ Cát Tường released her first products created by herself: \"Yêu xa\" is a love story of two lovers who must be temporarily apart. On pop background played by piano, the song has bright colors but still full of narrative feelings. This is the first single from Vũ Cát Tường's debut album, which marked her collaboration with musician Huy Tuấn, who is the music producer of the album. After the debut, this song received a lot of attention and reached the top of the music charts. Vũ Cát Tường also released this music video, the MV uses body language to create a poetic but daring multidimensional way of romance over geographical distances. At the end of 2014, Vũ Cát Tường released her first album Giải mã (Decode) (December 23). The songs in this album were all composed by Vũ Cát Tường with her true nostalgia and emotions about life. After that, Vũ Cát Tường also produced an MV for a song in the album Giải mã (Decode): \"Anh và Anh\". In 2015, Vũ Cát Tường released two singles that were \"Góc đa hình\" for fans in the summer and single \"Phai\" with a new remix. These two years also marked the moments when the name Vũ Cát Tường \"bombarded\" the awards, the rankings. These are the recognition for Tường's creation, the music products regarded by the audience and highly appreciated by the experts. After 1 gap year, Vũ Cát Tường returned, the first shot in 2016 was the release of the \"Mơ\" single – one of the hits that built Vũ Cát Tường's music career. \"Mơ\" is a soulful version of Soul & R&B; music that had Vũ Cát Tường's hidden minds. The song still holds the style of Tường with the loosened melody and the romantic lyrics. The message that she wants to convey in this song is \"the peaceful moments watching the moon on the terrace\". Category:Living people Category:1992 births Category:Singer-songwriters Category:Record producers",
 "title": "Vũ Cát Tường"
}