{
 "id": "976191",
 "text": "Marthe Olivier, sometimes written as Marthe Olivet and Marthe Ollivier, (born 1893) was a French competitive swimmer and sport administrator from Paris. As a competitve swimmer she was active between 1909 and 1922. She won many prize in France including becoming twice national champion. She represented France at the 1922 Women's Olympiad. Olivier was a member of Mouettes de Paris and later also a member of the L'Association Sportive des Postes, des Télégraphes et Téléphones team. ==Career== One of her first main competitions was in June 1909, when she competed at the annual gala of the CNP. In January 1914 she wins the third prize during the aquatics competitions week organized by the Nouveau Cirque of Paris. Two years later she won the second prize in the 100 metres event during the celebration of family bath in Charenton-le-Pont with a time of 1:58.6 on 17 September 1916. She won third prize in the 100 metres event on 5 August 1917 in Poissy, on 13 September 1918 in Nogent-sur-Marne and on 15 July 1919 during the aquatics festival in Calais. In 1919 she also finished third in the 500 metres event in Nantes on 20 September. Her first main victory was in 1920 winning the 100 metres event in Vitry-sur-Seine on 20 June. The next week she became champion of Paris in the 100 metres event. Later the year she also became champion of Paris in the 100m breaststroke. In 1920 she also won the 100 metres during the 3rd Olympic day in Saint-Denis in July and in Pantin in September. Olivier represented France at the 1922 Women's Olympiad in Monte Carlo in the 200 metre breaststroke event. ==Sport administration== Olivier became vice-president of the Mouettes de Paris in 1916. In 1919, she became a member of the sports commission and in 1921 sports director. ==Personal life== Olivier was born in 1893. She lived in the 4th arrondissement of Paris. In 1913 she married to M. Comte. She worked at the Postes, Télégraphes et Téléphones (PTT). ==References== Category:Swimmers from Paris Category:Sportswomen Category:1893 births Category:Year of death missing Category:French sport administrators",
 "title": "Marthe Olivier"
}