{
 "id": "976299",
 "text": "The 1st Provisional Marine Brigade was a brigade in the United States Marine Corps. It was founded in 1912 and was disbanded on September 13, 1951. It was not made as a permanent unit in the United States Marine Corps, but it served as an Ad Hoc unit. When they were first founded, they were sent in to fight in the \"Negro Rebellion\" in Cuba. Then they fought in World War II in Iceland where they had no real action, but in Guam they fought alongside the 1st Marine Division. After the war ended, they were disbanded, then fought in the Korean War. They were quickly reactivated during 1950 for the Korean War. They fought in the Battle of Pusan Perimeter, as well as the Battle of Yongsan. After their time in the Korean War, they were disbanded shortly after they returned home. The Brigade earned multiple streamers throughout its history. ==History== ===Negro Rebellion & Formation=== The Negro Rebellion happened in 1912, the year the 1st Provisional Marine Brigade was formed. The Negro Rebellion was a war where Black Cubans rioted and fought the Cuban Government for freedom and equality. The Cuban Government requested support from the United States - the 1st Provisional Marine Brigade was sent to guard certain locations. A small regiment named the 1st Provisional Marine Regiment was commanded by colonel Lincoln Karmany. The regiment was founded in Philadelphia, Pennsylvania on May 22nd. It numbered around 450 men. There was also the 2nd Provisional Marine Regiment that was created at the same time, led by Colonel James Mahoney in Key West, Florida. It numbered about 750 men. They both came to Cuba in the USS Prairie, which was an amphibious transport ship made to transport marines and assets. The 1st Battalion of the 2nd Provisional Marine Regiment was in Havana, Cuba, but the rest were in Guantanamo. They protected American farms in Siboney and El Cobre. After the rebellion stopped they left. The first Regiments soon became the 1st Provisional Marine Brigade in June. They were led by now Colonel Lincoln Karmany. ====1st Marine Brigade==== The 1st Marine Brigade was a very different Brigade that was made in 1935, but people got confused because they also were in Cuba in 1940. It was first made in 1913 as a unit in the 1st Advance Force Brigade, but they weren't \"Provisional.\" They were in Mexico and Puerto Rico. When it was disbanded, people confused the two. ===World War II=== ====Iceland==== In May of 1940, the United Kingdom invaded Iceland even if they were neutral. They invaded because they were scared that Germany would attack Iceland. The Natives didn't like the British because of that, but they liked the Americans more. Iceland signed an agreement with the United States so that they were defended. As soon as it happened, the United States Marine Corps quickly reactivated the 1st Provisional Marine Brigade on July 14th, 1941. The first people to join were taken from the 2nd Marine Division, and they were trained and organized in Camp Elliott in San Diego. They had about 4,095 men. They were some of the first men to enter Iceland under Major General Holland M. Smith. They stayed there with the 1st Marine Division, but the 1st MD was called to fight somewhere else, so the United States Army were the ones to come in after the 1st MD left to help the occupation. The 1st PMB also left with the 1st Marine Division. Now under Brigadier General John Marston and Colonel Leo D. Hermle, the 1st Provisional Marine Brigade sailed from San Diego to Charleston in attack transports, the USS Heywood, USS William P. Biddle, and USS Fuller. They also met other ships on the way that carried supplies for the 1st PMB. Those ships were the USS Arkansas, USS New York, USS Brooklyn and USS Nashville. They stopped at Newfoundland then continued to Iceland. They landed in Reykjavík on July 7th. They helped the British 49th Infantry Division. The British commanders split the 1st Provisional Marine Brigade evenly around Reykjavík and places next to it. The 49th ID also gave their own patch to the 1st Provisional Marine Brigade. The 1st PMB were also with the United States Army and Army Air Corps. They made a lot of forts to stop any German invasion for most of their time there. On September 22nd, 1940, the British left Iceland and the United States Army was commanding the place. and doing combat drills for if the Germans attacked. After Pearl Harbor, the 1st Provisional Marine Brigade was moved away and sent to fight in the Pacific. They came back to New York in the USS McCawley and SS Borinquen. A lot of the former marines in the 1st PMB joined the 2nd Marine Division to fight in the Guadalcanal Campaign. ====Guam==== On April 18th of 1944, the 1st Provisional Marine Brigade was activated again, but this time to fight in Guadalcanal. They were a reserve force for a bit, and they were commanded by Brigadier General Lemuel C. Shepherd. In July, the 1st Provisional Marine Brigade went to the Marshall Islands for the Invasion of Guam. Guam was under the Empire of Japan. They waited for a bit then they got about 9,886 men and had the 4th and 22nd Marine Regiment join them. They joined the Third Amphibious Corps, which had almost 60,000 men and they would attack Guam, the 305th Infantry Regiment also joined. They were preparing in the Eniwetok Atoll, which is in the Marshall Islands. At 08:32 AM on the 21st of July, the 22nd Marine Regiment landed in Bangi Point, Hågat which was in the West. They started to fight some of the 22,000 Japanese men on the Island of Guam. Most of the fights were in the West, since it was where most of the Japanese soldiers were. But the main 1st PMB didn't have much fighting. The Japanese soldiers had a lot of fortifications with Type 41 Mountain Guns and Bunkers, and reconnaissance did not see them. The Japanese soldiers used Type 41 Mountain Cannons that shoot 75mm rounds against the 22nd Marine Regiment. They also used them against 20 amphibious vehicles to stop them from moving. The 22nd Marine Regiment spent most of the day fighting the Japanese in Hågat. The 1st Battalion finally took Hågat while the 2nd Battalion took Mount Alifan. Also the 1st Battalion, the 4th Marines Regiment took over Bangi Point with help of the 3rd Battalion. They both started to move forward to Mount Alifan but Japanese resistance on the island delayed them. The Japanese tried to make a big counter-offensive at night but failed. By the end of the day, the 4th and 22nd Regiments took places about 2,000 meters or 6,000 feet inside Guam. The 1st Brigade, 3rd Marine Division was in the south and the 77th Infantry Division cut off and split the Orote Peninsula. By July 29th, they fully cleared the place and killed about 2,500 Japanese soldiers. The 4th Marines were in the right of the West Flank while the 22nd Marine Regiment was on the left of the East Flanks, they quickly killed off the Japanese. On August 6th, the Japanese made a last stand, meaning that they stayed in their positions and fought until they died. Mount Santa Rosa was cleared on August 8th and Ritidian Point and Pati Point on August 10th. BY 11:32 AM of August 10th, the Island was officially clear after 11,000 Japanese soldiers died. The 1st PMB was disbanded and the men there were moved to the 6th Marine Division. ===After WWII=== After World War II, the 1st Provisional Marine Brigade became way smaller and had men, their name would change to 1st Provisional Artillery Battalion on 11th October, 1947. They used to be a Brigade, but became a Battalion, which has about 1,000 men and it became something called a \"paper unit\". Some of the men that used to be in the Brigade became a part of the 1st Battalion, 11th Marines. ===The Korean War=== During the Korean War, the United States Marine Corps was becoming smaller and they weren't prepared for the Korean War. During 25 of June, 1950, the Joint Chiefs of Staff (the people who lead the Military) told the Marines to get a 15,000 man division to help the United Nations Command (a group of countries fighting in the war). The 1st Provisional Marine Brigade was the first unit to be sent to Korea, under General Edward A. Craig. The United States Marine Corps prepared the 1st Marine Division and other units to fight in the war. On July 7th, the 1st Provisional Marine Brigade was reactivated in California to fight in the war. One week later, they arrived in Pusan. Edward A. Craig was leading them and they were helped by Marine Aircraft Group 33. They fought a lot in the south of Korea. ====Task Force Kean==== The 1st Provisional Marine Brigade was immediately sent to Masan. They were sent to the westernmost flank of The Pusan Perimeter. The Eighth Army set up to resist the North Korean Army, which was trying to overwhelm United Nation Forces. The 1st PMB joined the 5th Regimental Combat Team and 25th Infantry Division under Major General William B. Kean. The three units of about 20,000 men banded together and made \"Task Force Kean.\" General Walker and the Eight Army were about to make the first counter offensive by the United Nations. They were going to start by taking Chinju from the North Korean 6th Division. The attack the Geumgang River in the middle of the month. One of Walker's goals was to stop North Koreans from grouping together next to Taegu. He wanted to do this by pushing some of the enemies south to keep them away. On August 6th, the Eighth Army was allowed to attack. but it depended on the arrival of a few battalions of tanks from the 2nd Infantry Divisions. Task Force Kean started on August 7th and left Masan. The 1st Provisional Marine Brigade rushed Pansong and the North Korean 6th Division Headquarters. There were 350 casualties on the North Korean side. But the other units in Task Force Kean were slowed down by North Korean resistance. The Task Force attacked Jindong-myeon which led to a weird battle where the 6th North Korean Division had air support and airdrops while Task Force Kean kept meeting the 6th Division and fighting. A lot of fighting happened in three days, and by August 9th, Task Force Kean was sure that they could take Jinju-si. Even if there was a lot of North Korean resistance, they were supported by airstrikes. On August 10th, Task Force Kean started to advance and met the North Korean 83rd Motorized Regiment, 105th Armored Division. They were surprised and tried to retreat, but F4U Corsairs from the 1st Marine Aircraft Wing attacked them multiple times. 200 men were killed and over 100 vehicles were destroyed. The 1st Provisional Marine Brigade couldn't continue and were redeployed somewhere else on August 12th, but Task Force Kean kept on going and took Chondong-ni. The 8th Army needed some help in Taegu, specifically in the Naktong Bulge. By August 14th, Task Force Kean failed it's objective of splitting the North Koreans at the Chinju pass. The North Korean 9th Division was almost gone, they had gone down to about 3000-4000 men. But the North Korean Army drafted South Koreans from Andong. ====First Naktong Bulge==== In the First Naktong Bulge, the 1st PMB had to help stop a stalemate between the 24th Infantry Division and the North Korean 4th Infantry Division because the Americans kept shooting. They started on midnight of August 6th. The North Korean 4th Division had started to move across the Naktong River at the Ohang ferry site. They used their heads and rafts to carry their weapons. At 2 AM on August 6th, the 4th Division started fighting the 3rd Battalion of the 34th Infantry Regiment. The 3rd Battalion had to retreat, and the North Koreans moved forward and tried to take down Yongsan. They took a lot of weapons from the Americans because they surprised them. The Americans thought that they would attack from the far north. A lot of American attacks caused stalemates. On the morning of August 7th, the North Koreans were able to take over Cloverleaf Hill and Oblong-ni Ridge. The place had bad terrain and it made a Bulge. At 4 PM, the 9th Infantry Regiment of the 2nd Infantry Division were sent there. The 24th Infantry Division, commanded by Major General John H. Church, ordered the attack of the Naktong Bulge. On the morning of August 7th, the North Koreans took over Cloverleaf Hill and Oblong-ni Ridge. The 4th Division of North Korea was making underwater bridges made of sandbags, trees and rocks. It was strong enough to handle tanks and heavy things like artillery. By August 10th, two entire regiments went over the river and took positions. The attack showed that the North Koreans could attack Yongsan, which forced the United States to send reinforcements. There were lots of deaths there, then General Walker sent the 1st Provisional Marine Brigade to the Naktong, They prepared to attack Cloverleaf Hill and Obong-ni, at 8 AM on August 17th. The 1st PMB sent all their men to attack; they used M26 tanks, airstrikes and mortars to help them. At first, the North Koreans stopped a lot of the attack, but then they were overwhelmed by the heavy fire that was targeting them. The 1st PMB started to take one hill at a time. The Marines took Obong-ni first, then they destroyed a lot of enemies there with airstrikes. They destroyed all of the 18th Regiment. The North Korean 4th Divisions tactics and strategies didn't work very well so they couldn't use them. By August 18th, the Americans took Obong-ni and Cloverleaf Hill. The North Korean 4th Division only had about 300 or 400 men left, after starting with 700 men. The rest either surrendered or ran away because they didn't want to get captured. ====Second Naktong Bulge==== In the Second Naktong Bulge, the 1st PMB only had 4,290 men, because about 500 men were killed in a month of war. They were getting ready to go to Pusan to escape to Japan, but they joined other Marines in the 1st Marine Division that would attack Ichon. They could not come because they were about to fight in Naktong. General Walker called them to help the 2nd Infantry Division in Naktong, but McArhut didn't like it because it would anger the East Command. They still fought. The attack was a threat to the supply line. The 2nd Division took the river line in Naktong, and the 1st PMB rushed the river with everything they had. They planned their attack very well and won. After they helped the 2nd Infantry Division, they destroyed the North Korean army at the Naktong River then left as soon as the battle ended. ====Battle of Yongsan==== During a meeting between the 2nd Division, Eighth Army and 1st Provisional Marine Brigade, they all agreed to launch an attack at 8 AM on September 3rd at the Yongsan–Naktong River road. The Marines were going to attack the south, while the Army would attack the north. Their goal was to get in contact with the 23rd Infantry Regiment, 2nd Engineer Combat Battalion, 1st Battalion, 9th Infantry, 25th Infantry Division, and 72nd Tank Battalion. The 2nd Battalion, 5th Marines and 1st Battalion, 5th Marines came to Yongsan while the 1st PMB was moved to the front of Yongsan. The 1st PMB was under control of the 2nd Division. At night, the A Company of the 2nd Engineers fought a lot with the Korean People's Army. At dawn on September 3rd, the A Company gained high ground and fought the entrenched Koreans. The Marines started an attack across some rice farms. The 1st Battalion, 5th Marines attacked the southern east-west and took an objective after the North Koreans were attacked by airstrikes and crossed to where the 2nd Battalion was. Airstrikes, machine gun fire, artillery and the 1st Battalion started to shoot the North Korean reinforcements. The 1st Battalion moved to another hill. In the north, the 2nd Battalion took longer. They started to get a lot of fire when they went up about 3.2 km. The D Company, 2nd Battalion was isolated and some tanks were taking down North Korean T-34s. The North Korean crewmen abandoned 1/5th of all their armored vehicles. By the end of the day, the 2nd Battalion entrenched and lost 95 men. Most of them were from the D Company. The 3rd Battalion, 5th Marines was allowed to pass the 2nd Battalion and continue fighting in the morning. When the morning came, the North Koreans retreated and the 1st Battalion occupied some tents that looked like a command post. They quickly saw T-34 tanks that were abandoned and in good condition. At night, the North Koreans attacked the place and hit G Company hard. When it started to rain they slowed down. The North Koreans surrounded the G Company and some started hand to hand combat. The 9th Infantry came in and helped the Marines. On September 5th, after 10-minute-long artillery preparations, the Americans started to move out in the rain. They moved to Obong-ni Ridge and the 9th Infantry came close to Cloverleaf Hill that was captured in the First Battle of Naktong Bulge. They saw some North Koreans going up. The marines split and took the pass between both hills. About 300 North Koreans came in from the village of Tugok and started to fight the B Company. Some T-34s attacked by surprise and took out 2 M-26 Pershing Tanks. The B Company had to retreat, but the A and C Companies fought the North Koreans with mortars. By the end of the day, there were 1,245 casualties and 106 of them were marines. The number of North Korean deaths is unknown. By September 4th, the 1st Provisional Marine Brigade was released from the 2nd Division by General Walker. He thought that he had enough men to continue on with his mission. ===Disbanding=== After the Battle of Yongsan, General Walker released the 1st Provisional Marine Brigade from control of the 2nd Division. On September 5th, the 1st PMB started to leave Yongsan, then they joined the 7th Marine Regiment and 1st Marine Regiment, 1st Marine Division since the 1st Marine Division was being reformed. MacArthur said that he could not fight in Inchon if there were no Marines, so he sent some to the Army's 65th Infantry Regiment and 17th Infantry Regiment. ==Structure & Organization== The Brigade had different sizes every time it was reactivated, but usually there was a Headquarters and Service Company. They also had companies much smaller than normal, and they would have a military police, and support companies. There were also signal companies and platoons. During the Negro Rebellion, the 1st Provisional Marine Brigade had about 1,200 men that was in two separate regiments. When the 1st PMB went to Iceland they had more men, these were 1st, 2nd, and 3rd battalions from the 6th Marine Regiment, the 2nd battalion the 10th Marine Regiment, the A company from the 2nd Tank Battalion, the A company from the 2nd Service Battalion, and the entire 5th Marine Defense Battalion. When they went to Guam they had a very big brigade of 9,886 men. It had the 4th Marine Regiment, the 22nd Marine Regiment, a military police company, a signals platoon and an Artillery Battalion consisting of 4 batteries. The 53rd Naval Construction Battalion was also assigned to the Brigade. In the Korean War, they had about 4,725 men: the 5th Marine Regiment's 1st, 2nd and 3rd battalions, the 1st Combat Engineer Battalion, the 1st Medical Battalion, the 1st Motor Transport Battalion, the 1st Ordnance Battalion, the 1st Service Battalion, the 1st Shore Party Battalion, the 1st Signal Battalion, the 1st Tank Battalion, the 1st Amphibian Tractor Company, and the 1st Combat Service Group. They also had support from the Marine Aircraft Group 33. ==Awards== Even though the 1st Provisional Marine Brigade wasn't permanent, it still got streamers for its service and actions in Cuba, Iceland, Guam, Pusan, Yongsan and Naktong. These \"streamers\" or awards include: Streamer Name Year Presidential Unit Citation Streamer 1950 Republic of Korea Presidential Unit Citation Streamer 1950 Navy Unit Commendation 1944 Asiatic-Pacific Campaign Streamer 1944 World War II Victory Streamer 1945 National Defense Service Streamer 1950 Korean Service Medal|Korean Service Streamer 1950 ==Related pages== * Korean War * Guam * World War II * Iceland ==References== Category:United States Marine Corps Category:1912 establishments Category:1951 disestablishments",
 "title": "1st Provisional Marine Brigade"
}