{
 "id": "976372",
 "text": "Ruzhany Palace (, ) is a ruined palace in Ruzhany village, Pruzhany Raion (district), Brest Voblast (province) in western Belarus. It was the main residence of the Polish-Lithuanian Sapieha noble family. The palace is currently and slowly being renovated. The palace gate and entry building are already renovated. == History == Design of the palace Back side of the palace Front side of the palace Design of the gates and buildings The first Ruzhany Palace was built by Lew Sapieha in 1602. The palace was destroyed during the civil war in the Polish–Lithuanian Commonwealth in 1700. ===18th century=== Ruzhany Palace was rebuilt in the Baroque and Neoclassical style in the 1770s, by Aleksander Michał Sapieha, employing the German architect Jan Samuel Becker of Saxony, who also designed an English-style garden around the palace. Aside from the palace, there was a theatre (1784–1788), an orangery and several other buildings. Becker also designed the local church (rebuilt in the 1850s). The last King of Poland and Grand Duke of Lithuania, Stanisław II, visited the palace in 1784. By that time work on the palace was stopped. In 1795, the Polish–Lithuanian Commonwealth was invaded and destroyed by the Russian Empire, Prussia and Austria. Then the land was divided among them. The palace, which was in the eastern part of the former Polish–Lithuanian Commonwealth, became part of Russia. ===19th century=== The Sapieha estates were nationalized after the November Uprising by the Polish against the Russian Empire in 1831. In 1834, the palace was sold to be used as a textile mill and weaving factory. ===Since the 20th century=== In 1914, the palace was accidentally set on fire by factory workers. The First World War and financial problems prevented the building's renovation until 1930. However the partially restored palace became a ruin again during the Second World War. The palace gate and the entry building were renovated in 2012. == References == == Other websites == * Ruzhany Palace at Belarusguide.com * Photos at Radzima org * Photos at Globus.tut.by Category:Buildings and structures in Belarus Category:Palaces in Europe",
 "title": "Ruzhany Palace"
}