{
 "id": "976576",
 "text": "The Colour and the Shape is the second studio album by Foo Fighters, an American rock band. It was released on May 20, 1997 by Roswell and Capitol Records. The Colour and the Shape is the first album by the Foo Fighters with a full band. This is because their first album, Foo Fighters, was only made by Dave Grohl. After the album became very popular, Grohl let Pat Smear, Nate Mendel, and William Goldsmith join the Foo Fighters. The album's singles are \"Monkey Wrench\", \"Everlong\", and \"My Hero\". They all went into the top ten on US rock radio charts. The album went to number ten on the Billboard 200, and number three in the United Kingdom. It was nominated for a Grammy Award in 1998. The album has sold more than two million copies in the United States. It is the band's best selling album. It was remastered in 2007. The Colour and the Shape was the band's last album that was released by Capitol Records. == Background == Dave Grohl was the only musician on the band's first album, Foo Fighters. He made all of the music on it, except for a guitar part made by Greg Dulli. The band got very popular because of the songs \"This Is A Call\" and \"Big Me\", so Dave Grohl did a concert tour with other musicians. The musicians were bassist Nate Mendel, drummer William Goldsmith, and guitarist Pat Smear. They joined the band during the tour. Many music magazines thought that the band would make a garage rock album, but the band wanted to make normal rock music.\"The Think Tank\". Select. 1997. Capitol Records, the band's record label, gave Foo Fighters a lot of control on how the album was going to sound.The Colour and the Shape (Bonus Tracks) (liner notes). Foo Fighters. US: Roswell/RCA/Legacy. 2007. 88697 09183 2. The songs on the album were written during sound checks before the band's concerts on the tour. Grohl would play simple riffs on his guitar, and other members jammed along to them to make songs. Producer Gil Norton helped make the album. Grohl hired him because he liked Norton's work with the Pixies, another band. Norton wanted the band to get better. He made Nate Mendel practice playing the bass guitar. Grohl said that making the album with Norton was difficult, but \"at the end of the day you listened back to what you'd done and you understood why you had to do it one million times\". == Production == In the autumn of 1996, the band started to work on the album. During this time, they rewrote some songs, and played them to see how they sounded. Norton helped the band look at the \"basics\" of each song, so they could play better music around it. In November 1996, the band went to Bear Creek Studio in Washington to start recording. The studio was on a farm, and the band lived in a house next to the studio. Grohl said recording at Bear Creek was \"bad\". He decided to get rid of most of the recordings the band made there. In December, the band took a break. Grohl wrote new songs during the break. He recorded \"Walking After You\" and an acoustic version of \"Everlong\" by himself. The rest of The Colour and the Shape was recorded at Grandmaster Recorders, a music studio in Hollywood. The band did not tell William Goldsmith, their drummer, to come with them. For four weeks, the band re-recorded music for the album. Grohl played the drums because Goldsmith was not there. By the end of recording, the only songs where Goldsmith was the drummer were \"Doll\" and \"Up in Arms\". Grohl said that Goldsmith's drumming was good, but it was not how he wanted it to sound. This is why Grohl decided to play the drums himself. Goldsmith asked if he should go to Hollywood with the band, but Grohl told him not to because he was only doing overdubs. Mendel told Goldsmith what was going on. Grohl said he still wanted Goldsmith to be in Foo Fighters, but he left the band. After going to Hollywood, recording the album cost much more money. Capitol Records wanted the band to make the album quickly, because time in the studio cost a lot of money. The band did not get stressed by Capitol asking them to make the album in less time. == Release == The Colour and the Shape started being sold on May 20, 1997. The main single from the album (\"Monkey Wrench\") was released a month before the album. Smear said that he wanted to leave the band because he was too tired to do a long concert tour. People that spoke for the band said that he was not leaving. A concert tour for the album started in May 1997. On September 4, at one of the concerts on the tour, Smear left the band. He gave his guitar to Franz Stahl so he could finish the concert.Moll, James (director) (2011). Foo Fighters: Back and Forth (documentary). RCA. In August 1997, \"Everlong\" was released as a single. It was the best selling single from the album. It was certified double platinum by the RIAA. In 1998, \"My Hero\" was also released as a single. All three singles went into the top ten on Billboard's Mainstream Rock music chart. To mark ten years of the album being sold, Foo Fighters released it again on July 10, 2007. This version of the album has six extra songs: \"Dear Lover\", \"The Colour and the Shape\", and four covers. == Track listing == == References == Category:1997 albums Category:Foo Fighters albums Category:Capitol Records albums",
 "title": "The Colour and the Shape"
}