{
 "id": "976702",
 "text": "DZEA-TV (channel 10) is a television station in North Central Luzon, Philippines, airing programming from the GMA network. Owned and operated by the network's namesake corporate parent, the station maintains studios at the GMA Complex, Claveria Road, Malued District, Dagupan City, Pangasinan, while its transmitter facilities shared with GTV outlet DWDG-TV channel 22 are located atop Mount Santo Tomas. ==Locations== Its studios are in the GMA Complex, Claveria Road, Malued District, Dagupan City, Pangasinan. Its analog and digital transmitters are located at Mt. Sto. Tomas, Tuba, Benguet. ==History== They opened in 1980. It is the first television station serving Northern and Central Luzon. ==Rebroadcasters== Station Location Channels ERP D-5-AS-TV Ilocos Norte 5 (VHF) 5 kW (75 kW ERP) DWBG-TV Peñarrubia, Abra 7 (VHF) 1 kW DWBC-TV Bantay, Ilocos Sur 48 (UHF) 5 kW DZVG-TV Mountain Province 5 (VHF) 5 kW DWAZ-TV Basco, Batanes 7 (VHF) 1 kW DZBP-TV Aparri 13 (VHF) 1 kW DWBB-TV Tuguegarao 7 (VHF) 5 kW DWLE-TV Santiago, Isabela 7 (VHF) 5 kW D-5-ZB- TV Baler, Aurora 5 (VHF) 1 kW DWNS-TV Olongapo 10 (VHF) 5 kW ==Digital television== ===Digital channels=== UHF Channel 38 (617.143 MHz) Channel Video Aspect Short name Programming Note 10.01 480i 16:9 GMA GMA Benguet/Dagupan (Main DZEA-TV programming) Commercial broadcast (15 kW) 10.02 GTV GTV 10.03 HEART OF ASIA Heart of Asia Channel 10.06 HALLYPOP Hallypop 10.07 I HEART MOVIES I Heart Movies 10.08 PINOY HITS Pinoy Hits 10.11 (UNNAMED) Unknown 10.31 240p GMA 1Seg GMA Benguet/Dagupan 1seg broadcast == Area of coverage == === Primary areas === * Baguio * Benguet * Pangasinan * Dagupan * La Union === Secondary areas === * Nueva Ecija * Tarlac * Parts of Mountain Province * Parts of Nueva Vizcaya * Southern Portion of Ilocos Sur * Parts of Bataan * Parts of Bulacan *Parts of Aurora * Parts of Pampanga (including San Fernando City) * Northern Portion of Zambales Category:Filipino television stations",
 "title": "DZEA-TV"
}