{
 "id": "976700",
 "text": "The following is a list of television stations that are either affiliated or owned-and-operated by GMA Network. == Free-to-air television stations == ===Analog Broadcast Stations=== Branding Callsign Ch. # Station type Power kW (ERP) Location (transmitter site) GMA Manila DZBB-TV 7 Originating 100 kW (1,000 kW ERP) GMA Tower of Power, Charles Conrad Street, Brgy. Culiat, Tandang Sora, Quezon City, Metro Manila GMA Ilocos Norte D-5-AS-TV 5 Relay 5 kW (75 kW ERP) Brgy. San Lorenzo, San Nicolas, Ilocos Norte (Ilocos Region) GMA Ilocos Sur DWBC-TV 48 5 kW Mt. Caniao, Bantay, Ilocos Sur under San Vicente, Ilocos Sur (Ilocos Region) GMA Abra D-7-ZG-TV 7 1 kW Brgy. Lusuac, Peñarrubia, Abra GMA Mt. Province DZVG-TV 5 5 kW (25 kW ERP) Mt. Amuyao, Barlig, Mountain Province GMA Batanes DWAZ-TV 7 1 kW Brgy. Kayvaluganan, Basco, Batanes GMA Tuguegarao DWBB-TV 5 kW (10 kW ERP) No. 91 Mabini St., Tuguegarao, Cagayan GMA Aparri DZBP-TV 13 1 kW (22.5 kW ERP) De Rivera St., Aparri, Cagayan GMA Isabela DWLE-TV 7 2 kW (25 kW ERP) Maharlika Hi-way, Brgy. Malvar, Santiago, Isabela GMA North Central Luzon DZEA-TV 10 Originating 20 kW (120 kW ERP) Mt. Sto. Tomas, Tuba, Benguet (North Central Luzon) GMA Baler D-5-ZB-TV 5 Relay 500 watts Purok 3, Brgy. Buhangin, Baler, Aurora GMA Olongapo DWNS-TV 10 1 kW Upper Mabayuan, Olongapo GMA Batangas D-12-ZB-TV 12 10 kW Mt. Banoy, Bo. Talumpok East, Batangas City (Southern Tagalog) GMA Jalajala, Rizal DWJJ-TV 44 3 kW (85 kW ERP) Mt. Landing, Jalajala, Rizal GMA Occidental Mindoro D-13-ZR-TV 13 2 kW Bonifacio St., San Jose, Occidental Mindoro GMA Puerto Princesa, Palawan DYPU-TV 12 5 kW (18.95 kW ERP) Mitra Rd., Brgy. Sta. Monica, Puerto Princesa (Mimaropa) GMA Coron, Palawan DWRF-TV 8 2.5 kW (10 kW ERP) Taplas Hill, Coron, Palawan GMA Brooke's Point, Palawan DYAA-TV 6 1 kW (17.5 kW ERP) Brgy. Poblacion, Brooke's Point GMA Romblon DWTR-TV 7 10 kW (20 kW ERP) Triple Peak, Tablas Island, Santa Maria, Romblon GMA Naga DWAI-TV 30 kW GMA Broadcast Complex, Concepcion Pequena, Naga, Camarines Sur (Bicol Region) GMA Legazpi DWLA-TV 12 10 kW (50 kW ERP) Mt. Bariw, Estanza, Legazpi, Albay GMA Masbate DYRD-TV 7 5 kW Brgy. Pinamurbuhan, Mobo, Masbate GMA Catanduanes D-13-ZC-TV 13 2 kW Brgy. Sto. Niño, Virac, Catanduanes GMA Sorsogon DWGA-TV 2 2 kW Mt. Bintacan, Brgy. Maalo, Juban, Sorsogon GMA Daet DWGC-TV 8 1 kW (20.5 kW ERP) Purok 2, Brgy. Mangcruz, Daet GMA Kalibo DYBB-TV 2 1 kW (11 kW ERP) Brgy. Bulwang, Numancia, Aklan GMA Roxas DYAM-TV 5 2 kW (5.39 kW ERP) Brgy. Milibili, Roxas, Capiz GMA Iloilo DYXX-TV 6 Originating 10 kW (75 kW ERP) GMA Transmitter Complex, Pina-Tamborong-Alaguisoc Road, Jordan, Guimaras under Iloilo City (Western Visayas) GMA Bacolod DWGM-TV 13 Semi- satellite (Iloilo) 5 kW Rizal corner Locsin Street, Bacolod (Negros) GMA Murcia, Negros Occidental DYGM-TV 30 Relay 40 kW Mt. Calandong, Murcia, Negros Occidental under Bacolod GMA Sipalay D-10-YA-TV 10 1 kW Sipalay Municipal Building, Sipalay GMA Cebu DYSS-TV 7 Originating 50 kW (259 kW ERP) GMA Tower Compound, Mt. Bonbon, Cebu City (Central and Eastern Visayas) GMA Bohol D-11-YE-TV 11 Relay 2 kW (10.39 kW ERP) Banat-I Hills, Brgy. Bool, Tagbilaran GMA Dumaguete D-5-YB-TV 5 30 kW Brgy. Palinpinon, Valencia, Negros Oriental under Dumaguete GMA Calbayog DYAS-TV 5 1 kW (15 kW ERP) Purok 2, San Mateo St., Brgy. Matobato, Calbayog GMA Borongan DYVB-TV 8 1 kW (25 kW ERP) Circumferential Road, Poblacion, Borongan GMA Tacloban DYCL-TV 10 5 kW Basper, Brgy. Tigbao, Tacloban GMA Ormoc DYIL-TV 12 1 kW Brgy. Alta Vista, Ormoc GMA Zamboanga DXLA-TV 9 5 kW GMA Compound, Brgy. Cabatangan, Zamboanga City (Western Mindanao) GMA Dipolog D-4-XT-TV 4 Relay 1 kW Rizal Avenue, Dipolog GMA Pagadian DXEJ-TV 3 1 kW (10 kW ERP) Mount Palpalan, Pagadian GMA Cagayan de Oro DXJC-TV 35 Semi- satellite (Davao) 20 kW GMA Transmitter Site, Malasag Heights, Brgy. Cugman, Cagayan de Oro (Northern Mindanao) GMA Bukidnon DXMK-TV 12 Relay 5 kW Mount Kitanglad, Bukidnon GMA Ozamiz DXGM-TV 5 1 kW Bukagan Hills, Brgy. Malaubang, Ozamiz GMA Iligan DXRV-TV 11 2 kW Circumferencial Road, Brgy. Del Carmen, Iligan GMA Davao DXMJ-TV 5 Originating 25 kW (287.5 kW ERP) GMA Complex, Broadcast Ave., Shrine Hills, Matina, Davao City (Southern Mindanao) GMA General Santos DXBG-TV 8 Semi-satellite (Davao) 10 kW (490 kW ERP) Nuñez St., Brgy. San Isidro, General Santos (South Central Mindanao) GMA Butuan DXBM-TV 26 Relay 5 kW Mayapay, Brgy. Bonbon, Butuan GMA Surigao D-10-XA-TV 10 1 kW (10.25 kW ERP) Eastern Nautical Highway, Brgy. Lipata, Surigao City GMA Tandag DXRC-TV 2 1 kW (15 kW ERP) Capitol Hill, Brgy. Telaje, Tandag GMA Cotabato DXMC-TV 12 1 kW Bangsamoro Regional Government Center, Cotabato City GMA Jolo DXLS-TV 1 kW (10.25 kW ERP) Hadji-Butu St., Jolo, Sulu ===Digital Broadcast Stations=== GMA Network's upcoming expansion of digital terrestrial television will be announced soon as possible in other bigger key cities nationwide. Branding Callsign Ch. # Frequency Station type Power kW (ERP kW) Location (transmitter site) GMA Manila DZBB-DTV 15 (Digital Test Broadcast) 479.143 MHz Originating 10 kW (100 kW) GMA Tower of Power, Charles Conrad Street, Brgy. Culiat, Tandang Sora, Quezon City, Metro Manila GMA PBCom SFN Relay 3 kW PBCom Tower, 6795 Ayala Avenue corner V.A. Rufino St., Makati City GMA Zen Towers Zen Towers, 1108 Natividad A. Lopez St., Ermita, Manila GMA Antipolo 5 kW 23 Sumulong Highway, Brgy. Sta. Cruz, Antipolo, Rizal GMA Malolos 5 kW Diversion Road, Malolos City, Bulacan GMA Angeles 5 kW Sto. Enterro St., Brgy. Pulungbulu, Angeles, Pampanga GMA Cabanatuan 5 kW Luz Street, Cabanatuan, Nueva Ecija GMA North Central Luzon DZEA-DTV 38 (Digital Test Broadcast) 617.143 MHz Originating 15 kW (90 kW) Mt. Sto. Tomas, Tuba, Benguet (North Central Luzon) GMA Cabanatuan SFN Relay 5 kW Luz Street, Cabanatuan, Nueva Ecija GMA Mountain Province DZVG-DTV 29 (Digital Test Broadcast) 563.143 MHz Relay 10 kW Mt. Amuyao, Barlig, Mountain Province (Cordillera and Cagayan Valley) GMA Ilocos Norte D-5-AS-DTV 24 (Digital Test Broadcast) 533.143 MHz 5 kW Brgy. San Lorenzo, San Nicolas, Ilocos Norte (Ilocos Region) GMA Ilocos Sur DWBC-DTV 15 (Digital Test Broadcast) 479.143 MHz Mt. Caniao, Bantay, Ilocos Sur (Ilocos Region) GMA Isabela DWLE-DTV 15 (Digital Test Broadcast) 479.143 MHz Maharlika Hi-way, Brgy. Malvar, Santiago, Isabela GMA Olongapo DWNS-DTV 38 (Digital Test Broadcast) 617.143 MHz Upper Mabayuan, Olongapo GMA Jalajala, Rizal DWJJ-DTV 27 (Digital Test Broadcast) 551.143 MHz Mount Landing, Jalajala, Rizal GMA Batangas D-12-ZB-DTV 32 (Digital Test Broadcast) 581.143 MHz 10 kW Mt. Banoy, Bo. Talumpok East, Batangas City (Southern Tagalog) GMA San Pablo SFN Relay Brgy. San Jose, San Pablo, Laguna GMA Occidental Mindoro D-13-ZR-DTV 15 (Digital Test Broadcast) 479.143 MHz Relay 5 kW Bonifacio St., San Jose, Occidental Mindoro GMA Puerto Princesa, Palawan DYPU-DTV 15 (Digital Test Broadcast) 479.143 MHz Mitra Rd., Brgy. Sta. Monica, Puerto Princesa, Palawan GMA Coron, Palawan DWRF-DTV 25 (Digital Test Broadcast) 539.143 MHz Taplas Hill, Coron, Palawan GMA Brooke's Point, Palawan DYAA-DTV 26 (Digital Test Broadcast) 545.143 MHz Brgy. Poblacion, Brooke's Point, Palawan GMA Naga DWAI-DTV 38 (Digital Test Broadcast) 617.143 MHz 10 kW GMA Broadcast Complex, Concepcion Pequeña, Naga, Camarines Sur (Bicol Region) GMA Legazpi DWLA-DTV 41 (Digital Test Broadcast) 635.143 MHz Mt. Bariw, Estanza, Legazpi, Albay GMA Catanduanes D-13-ZC-DTV 38 (Digital Test Broadcast) 617.143 MHz Brgy. Sto. Niño, Virac, Catanduanes GMA Kalibo DYBB-DTV 32 (Digital Test Broadcast) 581.143 MHz Brgy. Bulwang, Numancia, Aklan GMA Iloilo DYXX-DTV 29 (Digital Test Broadcast) 563.143 MHz Originating GMA Transmitter Complex, Piña- Tamborong-Alaguisoc Road, Jordan, Guimaras (Western Visayas) GMA Murcia DYGM- DTV 15 (Digital Test Broadcast) 479.143 MHz Relay Mt.Canlandog Murcia, Negros Occidental GMA Bacolod D-13-GM-DTV 44 (Digital Test Broadcast) 653.143 MHz Semi-satellite (Iloilo) Rizal corner Locsin Street, Bacolod (Negros) GMA Roxas DYAM-DTV 15 (Digital Test Broadcast) 479.143 MHz Relay 5 kW Brgy. Milibili, Roxas City, Capiz (Western Visayas) GMA Cebu DYSS-DTV 26 (Digital Test Broadcast) 545.143 MHz Originating 10 kW (77.7 kW) GMA Tower Compound, Mt. Bonbon, Cebu City (Central Visayas) GMA Dumaguete D-5-YB-DTV 22 (Digital Test Broadcast) 521.143 MHz Relay 5 kW Dumaguete City (Central Visayas) GMA Tacloban DYCL-DTV 34 (Digital Test Broadcast) 593.143 MHz 10 kW Basper, Brgy. Tigbao, Tacloban (Eastern Visayas) GMA Zamboanga DXLA-DTV 41 (Digital Test Broadcast) 635.143 MHz GMA Compound, Brgy. Cabatangan, Zamboanga City (Zamboanga Peninsula) GMA Dipolog D-4-XT-DTV 46 (Digital Test Broadcast) 665.143 MHz Rizal Avenue, Dipolog GMA Cagayan de Oro DXJC-DTV 47 (Digital Test Broadcast) 671.143 MHz Semi-satellite (Davao) GMA Transmitter Site, Malasag Heights, Brgy. Cugman, Cagayan de Oro (Northern Mindanao) GMA Bukidnon DXMK- DTV 44 (Digital Test Broadcast) 653.143 MHz Relay Mount Kitanglad, Bukidnon GMA Iligan DXRV-DTV 33 (Digital Test Broadcast) 587.143 MHz 5 kW Circumferencial Road, Brgy. Del Carmen, Iligan GMA Davao DXMJ-DTV 37 (Digital Test Broadcast) 611.143 MHz Originating 15 kW (72 kW) GMA Complex, Broadcast Ave., Shrine Hills, Matina, Davao City (Davao Region) GMA General Santos DXBG- DTV 34 (Digital Test Broadcast) 593.143 MHz Semi-satellite (Davao) 10 kW Nuñez St., Brgy. San Isidro, General Santos (Soccsksargen) GMA Butuan DXBM-DTV 15 (Digital Test Broadcast) 479.143 MHz Relay Mayapay, Brgy. Bonbon, Butuan (Caraga) GMA Network Main and Subchannels Channel Video Aspect Short name Programming Note 7.01 480i 16:9 GMA GMA Commercial broadcast 7.02 GTV GTV 7.03 HEART OF ASIA Heart of Asia 7.06 I HEART MOVIES I Heart Movies 7.31 240p GMA 1-Seg GMA 1seg == Related pages == * List of Philippine television networks * List of Philippine media companies Category:Television lists",
 "title": "List of GMA Network stations"
}