{
 "id": "976864",
 "text": "\"This is the Home of the Brave\" (, ) is the national anthem of the Islamic Emirate of Afghanistan (Afghanistan during Taliban rule). It was first used between 1996 and 2001, but was adopted again in 2021 after the Fall of Kabul. This is when the Taliban took over the capital city of Kabul. This song is an a cappella song, meaning that the song has no instruments, just words. Many Islamic scholars (called ulama) consider instruments to be haram (or taboo), and the use of instruments is forbidden. == Lyrics == === Pashto original === Arabic script Latin script IPA transcription === Translations === Dari translation English translation We defend thee with our blood, this is the home of martyrs ğ„† This is the home of the brave, this is the home of the brave ğ„‡ We defend thee with our blood, this is the home of martyrs ğ„† This is the home of the brave, this is the home of the brave ğ„‡ I All thy stones and bushes look like rubies to us ğ„† All thy stones and bushes look like rubies to us ğ„‡ Upon them blood is spilt, they are all red like roses ğ„† Upon them blood is spilt, they are all red like roses ğ„‡ ğ„† Dost thou think 'tis conquerable? This is the home of lions This is the home of the brave, this is the home of the brave ğ„‡ II We shall protect thy freedom, as long as our lives last ğ„† We shall protect thy freedom, as long as our lives last ğ„‡ We shall remember thy history, as long as our lives last ğ„† We shall remember thy history, as long as our lives last ğ„‡ ğ„† Eagles shall inhabit thee, this is the home of eagles This is the home of the brave, this is the home of the brave ğ„‡ III O my dear homeland, for thy sake I've offered my life ğ„† O my dear homeland, for thy sake I've offered my life ğ„‡ O my gracious field, for thy sake I've offered my life ğ„† O my gracious field, for thy sake I've offered my life ğ„‡ ğ„† Once freed from the English, a grave of Russians we've become This is the home of the brave, this is the home of the brave ğ„‡ IV Look at these many skulls, that's what was left by the Russians ğ„† Look at these many skulls, that's what was left by the Russians ğ„‡ Every foe hath failed, all their hopes shattered ğ„† Every foe hath failed, all their hopes shattered ğ„‡ ğ„† Now obvious to all, this is the home of the Afghans This is the home of the brave, this is the home of the brave ğ„‡ ğ„† ğ„‡ ğ„† This is the home of the brave... ğ„‡ ==Related pages== * National anthems of Afghanistan ==References== Afgh Category:National symbols of Afghanistan",
 "title": "This is the Home of the Brave"
}