{
 "id": "976848",
 "text": "The current national anthem of Mauritania (, ) was adopted in 2017. ==Lyrics== ===Full lyrics=== Arabic lyrics Transliteration IPA transcription English translation I Land of the proud, guided by noblemen The fortress of the Book that can't be bound O Mauritania, the spring of harmony The corner of tolerance, the haven of peace. We will protect you with our lives and paint your hills with the colour of hope When you call, \"Yes!\" is our answer. II The crescent moon in your sky will never wane and the sun on your forehead will never set Because the noble Arabs enriched you and the purest source is Africa's. III We drank the milk of dew and pride A nature that brought a good harvest and a fertile pasture, even when it's barren welcoming us as we ascend. IV We made your enemy drink a bitter downpour so he couldn't settle or rest We resist him wherever he goes Praying: \"Surely, with hardship comes ease\". (V, only sung on 57th independence day) We followed the prophet along the path of the heavens to the tree of glory above the sky occupying the Pleiades as our stairway drawing our border there. VI We took you as a vow and carried you as a promise and we happily give you up to the future generations. We will protect you with our lives and paint your hills with the colour of hope We will protect you with our lives When you call, \"yes!\" is our answer. ===Short version=== Arabic lyrics Transliteration IPA transcription English translation I Land of the proud, guided by noblemen The fortress of the Book that can't be bound O Mauritania, the spring of harmony The corner of tolerance, the haven of peace. We will protect you with our lives and paint your hills with the colour of hope. II The crescent moon in your sky will never wane and the sun on your forehead will never set Because the noble Arabs enriched you and the purest source is Africa's. VI We took you as a vow and carried you as a promise and we happily give you up to the future generations. I Land of the proud, guided by noblemen The fortress of the Book that can't be bound O Mauritania, the spring of harmony The corner of tolerance, the haven of peace. When you call, \"yes!\" is our answer. ==Related pages== * National anthem of Mauritania (1960-2017) ==References== Category:African anthems Category:National symbols of Mauritania",
 "title": "National anthem of Mauritania"
}