{
 "id": "976851",
 "text": "My Immortal is a work of Harry Potter fanfiction known for being badly received. ==Premise== A seventeen-year-old Goth Satanist vampire named Ebony Darkness Dementia Raven Way, (commonly misspelled or known as Ebony, Enoby, Eboby, and Tara) is in England as a student of Hogwarts and dating Draco Malfoy. Ebony is in a rock music band with Hermione Granger, whose name is now Bloody Mary Smith, Harry Potter who is known by the nickname Vampire and her friend Willow. While Ebony is the only Chosen One who can beat Voldemort (misspelled as Vlodemort or Volsemort) who wants Ebony to kill Vampire Potter. ==Plot== After Ebony finds out that her boyfriend Draco Malfoy used to date Vampire Potter and is angry about it she goes to a forest where Voldemort comes to her and tells her to kill Vampire Potter. He later gives Ebony a gun and tells her “Thou must kill Vampire Potter or I will kill him anyway”. Then Remus Lupin and Severus Snape watch Ebony in the bath while Lupin was masticating so Ebony threw her wound at them and then took out a gun and shot them “a gazillion times”. Then Snape wants to rape Ebony because he is a Christian and she is a Satanist and he hates her but he is stopped by Hagrid. Ebony then goes back in time to stop Tom Brombadil from becoming Voldemort though she calls him Satan as a nickname. Ebony and Tom Anderson also known as Satan then join a rock music band in the 1980s with Severus Snape, Sirius Black, and Lucius Malfoy. Then Morty McFlee comes with a time machine and Ebony and Satan steal it to go back to the future where Satan transforms into Voldemort. ==Reception== My Immortal got an extremely negative reception with a lot of people saying that they didn’t like it or that they hated it. Some people called it the worst fan fiction ever written. Even now it’s still said to be the worst fan fiction ever made more often than any other fan fiction is. Though some people think that My Immortal was written as a parody of bad Harry Potter fan fiction and was actually trying to be bad because of it. My Immortal singer Amy Lee said that she read it and laughed “because of the nonsense”. ==Authorship Controversy== The author of My Immortal uses the name Tara Gillebsie but that might be a pen name. From 2008 to 2009, there was a YouTube channel by two teenagers named Tara and Raven who liked to joke about Goth subculture but when they were interviewed in 2014 said that they didn’t write it even though a lot of people thought that they did. In 2017, a woman named Rose Christo wrote a book called “Under the Same Stars: The Search for My Brother and the True Story of My Immortal” about being a Native American who never saw her brother again after foster care and about writing My Immortal. It later turned out that she wasn’t actually Native American and was never actually in foster care. But she still said that she was the person who wrote My Immortal even though her brother didn’t believe her. ==Legacy== My Immortal is a fan fiction that has fan fiction written about it but those fan fictions are usually making fun of it. == Other websites == The Bizarre Unsolved Mystery of My Immortal, the World's Worst Fan Fiction Story The Worst Thing Ever Written The Worst \"Harry Potter\" fan fic ever written is now a hilarious webseries My Immortal-Conclusions https://www.wnycstudios.org/podcasts/otm/articles/goth-teens-internet-are- never-what-they-seem Alleged author of legendarily bad fan fic \"My Immortal\" steps forward The story of \"My Immortal\" is more wild and heartbreaking than you imagined My Immortal: Solving the mystery of the Internet's most beloved and notorious fan fic Did the mysterious fan fic author behind My Immortal just resurface? People think they have the answer to the decade long mystery of Who Wrote \"My Immortal\" https://www.vox.com/culture/2017/10/9/16428248/my- immortal-still-a-mystery-rose-christo-fake The My Immortal Mystery Grows: Five New Questions about the Memoir's cancellation The Gloriously Immortal Life of My Immortal I talked to Amy Lee of Evanescence about inspiring the world's worst fan fiction https://slate.com/culture/2015/03/my-immortal-who-is- responsible-for-the-world-s-worst-fanfiction.html https://bookstr.com/list/top-five-worst-fan-fictions-ever-written/ https://knowyourmeme.com/memes/subcultures/my-immortal-the-worst-fanfiction- ever Category:Fan fiction Category:Harry Potter",
 "title": "My Immortal (fan fiction)"
}