{
 "id": "976816",
 "text": "The Overton window is a nickname for the set of opinions and ideas that it is possible for a politician to have without losing any chance of ever winning an election again. It is a reference to the ideas about politics that is generally fine to have. ==Joseph Overton== Joseph Overton explained why libertarian think tanks exist by creating a chart of different political ideas that it’s possible to have with a straight line from “most government, least freedom” to “least government, most freedom” and said that the ideas that politicians can get away with supporting are in the middle of it but sometimes where that is changes. For example, Prohibition is something that people once supported while being in the mainstream but then society changed so that no politician could get away with supporting prohibition because society moved towards more freedom and less government. Overton also said that society could move in the direction of less freedom and more government. Overton said libertarian think tanks existed to move society to the point where more libertarian ideas were more mainstream and statism was seen as more radical. After Overton died, his think tank, the Mackinac Centre, started to call that idea, the Overton Window. ==Glenn Beck== In 2010, Glenn Beck wrote a novel called The Overton Window based on conspiracy theories. When talking about it on Fox News, Beck said that the Overton Window meant things that politicians were willing to support and that the Overton Window changed when politicians decided that some ideas should become taboo or that some taboo ideas should become mainstream. The Mackinac Centre criticized him for saying this and said that it’s not politicians who change The Overton Window (at least it usually isn’t), it’s society that changes and the politicians change with it. ==Donald Trump== After the election of Donald Trump as president of the United States, a lot of political commentators on both the Left and the Right started talking about how the Overton Window had changed or how to change it. So Lawrence Reed wrote an essay for the Foundation for Economic Education explaining the idea of the Overton Window. Category:Politics",
 "title": "Overton window"
}