{
 "id": "976808",
 "text": "The \"Chant de Ralliement\" (\"Rallying Song\"), also called \"Ô Cameroun berceau de nos ancêtres\" (\"O Cameroon, Cradle of Our Forefathers\"), is the national anthem of Cameroon. ==Lyrics== Because Cameroon is officially a bilingual country, there are official lyrics in both French and English. The song has also been unofficially translated into at least ten local indigenous languages. French version English translation of French version English version I O Cameroon, cradle of our ancestors, Go, upright and protective of your freedom. Like a sun, your proud flag must be An ardent symbol of faith and unity. May all your children, from North to South From East to West, be all love, May serving you be their only goal To fulfil their duty always. Dear Fatherland, cherished land, You are our one and true happiness. Our joy and our life To you, love and great honour. II You are the grave where our fathers sleep, The garden that our ancestors have cultivated. We work to make you prosperous One fine day we will finally get there. Be Africa's faithful child And always progress in peace Hoping that your young children Will love you without bounds forever. I O Cameroon, Thou Cradle of our Fathers, Holy Shrine where in our midst they now repose, Their tears and blood and sweat thy soil did water, On thy hills and valleys once their tillage rose. Dear Fatherland, thy worth no tongue can tell! How can we ever pay thy due? Thy welfare we will win in toil and love and peace, Will be to thy name ever true! Land of Promise, land of Glory! Thou, of life and joy, our only store! Thine be honour, thine devotion, And deep endearment, for evermore. II From Shari, from where the Mungo meanders From along the banks of lowly Boumba Stream, Muster thy sons in union close around thee, Mighty as the Buea Mountain be their team; Instil in them the love of gentle ways, Regret for errors of the past; Foster, for Mother Africa, a loyalty That true shall remain to the last. ===In local languages=== Ewondo lyricshttps://www.calameo.com/books/004011364a20fa52ea5e0 Adamawa Fulfulde lyricshttps://www.facebook.com/EN31246A27/posts/lhymne-national-en-langue- foufould%C3%A9-guimol_lisdi_menha-cameroun-feaarou- mamadjim/343957989549016/?locale=fr_FR Ghomala lyricshttps://www.calameo.com/books/002372138159211fb2976 Medumba lyricshttps://www.calameo.com/books/004011364bbbe97fa8a9b Ngiemboon lyricshttp://www.mouola.com/archives/1254 Nufi lyricshttps://www.calameo.com/books/004011364e5a741855167 Basaa lyricshttps://bassacultureetcoutumes.blogspot.com/2017/02/hymne-national-du- cameroun-en-langue.html?m=1https://m.youtube.com/watch?v=gbAb5F3CV4g Duala lyricshttps://www.scribd.com/document/653416522/Il-Etait-Une-Fois-l-Hymne- National-Du-Cameroun-en-Duala Bamum lyricshttps://www.facebook.com/share/p/WShvDsVHqYhPHeda/?mibextid=oFDknk ==References== Category:African anthems Category:Cameroonian culture",
 "title": "O Cameroon, Cradle of Our Forefathers"
}