{
 "id": "976944",
 "text": "The Snake (蛇) is the sixth of the 12-year cycle of animals that appear in the Chinese zodiac. The Year of the Snake is related with the symbol of the Earth Branch 巳. According to one legend, there is a reason for the order of the 12 animals in the 12-year cycle. The story goes that a race is held to cross a great river, and the order of animals in the cycle is based on their order at the end of the race. In this story, the Snake gives not being the best swimmer by cutting a hidden ride on the Horse's hoof, and when the Horse is about to cross the finish line, jumps, destroys the Horse, and thus replaced it with sixth place. ==Year and the Five Elements== People born within these dates can be said to be born in the \"Year of the Snake\", while carrying the following elemental signs. Start date End date Heavenly branch 10 February 1929 29 January 1930 Earth Snake 27 January 1941 14 February 1942 Metal Snake 14 February 1953 2 February 1954 Water Snake 2 February 1965 20 January 1966 Wood Snake 18 February 1977 6 February 1978 Fire Snake 6 February 1989 26 January 1990 Earth Snake 24 January 2001 11 February 2002 Metal Snake 10 February 2013 30 January 2014 Water Snake 29 January 2025 16 February 2026 Wood Snake 15 February 2037 3 February 2038 Fire Snake 2 February 2049 22 January 2050 Earth Snake 21 January 2061 8 February 2062 Metal Snake 7 February 2073 26 January 2074 Water Snake 26 January 2085 13 February 2086 Wood Snake 12 February 2097 31 January 2098 Fire Snake ==Chinese Zodiac Snake Compatibility Grid== Sign Best Match Average Match No match Snake Chicken, Ox Horse, Goat, Monkey, Dog, Rat, Rabbit, Dragon Pig, Tiger or Snake ==Basic astrological elements== Earthly Branches: Mr The Five Elements: Fire Yin Yang: Yang Lucky Month: Fourth Lucky Number: 2, 8, 9; Avoid: 1, 6, 7 Lucky Flower: orchid, cactus Lucky Color: red, light yellow, black; Avoid: white, golden, brown Season: Summer ==Other websites== Category:Chinese astrological signs zodiac",
 "title": "Snake (zodiac)"
}