{
 "id": "977376",
 "text": "Jenö Konrad (13 August 1894 – 15 July 1978) was a Hungarian footballer and manager. In the 1910s he played on the Hungarian National team with his brother, Kalman Konrad. He is best known for his career as a football manager. He managed SC Wacker Wien, Chinezul Timişoara, Wiener AC, Hakoah Vienna, 1. FC Nürnberg, Ripensia Timişoara, 1. FC Brno, FK Austria Wien, US Triestina, and Olympique Lillois. ==Career== He started playing at the age of 14 when he joined Budapesti AK. At 17 he went to MTK Budapest. Here he made his debut in the main team during the 1911–12 season. With the beginning of the First World War he became soldier, where he rose to the rank of officer. In May 1915 he also received his first call-up to the national team, where he played in the 2-1 win over Austria. This was his only game for Hungary. After around two years as a Russian prisoner of war, he returned to MTK Budapest in the 1918/19 season. As a result of the political unrest in Hungary after the end of the war a number of Hungarian players went to foreign clubs. The sporting director of Wiener Amateur SV Hugo Meisl managed to bring Konrad and his younger brother Kalman to Vienna. The Hungarian federation had a heated argument with the Austrian federation at the time, as most players from Budapest working in Vienna were working without clearance from their home clubs. At the end of 1919 these players lost their permission to play in Vienna. In the spring of 1920 the players were finally released and allowed to play. The Austrian Cup was the first title in 1921, followed in 1924 by the first championship title in club history and another cup victory. After the introduction of professional football in Austria Jenö and Kalman Konrad went to First Vienna FC. Jenö suffered a meniscus injury in 1925, which ended his active career. ==Manager career== Jenö took over the training of the Wiener Amateur SV and led them to their second double in 1926. He then worked for six months at SC Wacker Vienna, Romania's Chinezul Timişoara and two years at Wiener AC and took over SC Hakoah Vienna in 1929. He then became coach of 1. FC Nürnberg, which he led to the semi-finals of the German championship two years later, in which they lost to FC Bayern Munich. The National Socialist newspaper Der Stürmer started a campaign against the Jewish coach and Konrad left the club. He returned to Romania to Ripensia Timisoara and then to SK Židenice in Brno. For the winter break of 1934/35 he returned to Austria in Vienna and led the club from last place in the table to the ÖFB Cup victory. In 1936 he moved to Italy, coached the US Triestina in Serie A and set the club's best result with sixth place. He had to leave the club and Italy in 1938 due to the Italian racial laws. He took over the coaching post at Olympique Lillois and reached the final of the French Cup, which was lost against Racing Paris. Konrad's last station in Europe was Sporting Lisbon, which he was in charge of in the 1939/40 season. Then he and his family emigrated to the USA. There he was no longer active in football. ==References== ==Other websites== * Profile at labtof.ro * Profile at austria-archiv.at Category:1894 births Category:1978 deaths Category:Hungarian footballers Category:Hungarian football managers Category:1. FC Nuremberg managers Category:FK Austria Wien managers Category:Association football defenders Category:Austrian football champions Category:FK Austria Wien players",
 "title": "Jenő Konrád"
}