{
 "id": "977403",
 "text": "Pop Life is the title of a studio album. It is the third one released by French DJ David Guetta. It was released on Virgin Records in 2007. It was produced with Joachim Garraud. Longtime collaborator Chris Willis is the main vocalist; guest vocals are provided by JD Davis, Juliet, Tara McDonald, Cozi Costi and Thailand. The first single to be released from Pop Life was \"Love Is Gone\", which became a Top 10 hit on the UK Singles Chart, peaking at #9. A remix by Fred Riester and Joachim Garraud received play in dance clubs across the world. The second single was \"Baby When the Light\" which featured vocals by Cozi Costi. Subsequent singles include \"Delirious\" (featuring Tara McDonald on vocals), \"Tomorrow Can Wait\" and \"Everytime We Touch\". ==Track listing== # \"Baby When the Light\" (featuring Cozi) — 3:27 # \"Love Is Gone\" (featuring Chris Willis - Original Mix) — 3:06 # \"Everytime We Touch\" (with Steve Angello and Sebastian Ingrosso) — 3:40 # \"Delirious\" (featuring Tara McDonald) — 4:31 # \"Tomorrow Can Wait\" (featuring Chris Willis vs. El Tocadisco) — 3:33 # \"Winner of the Game\" (featuring JD Davis) — 3:02 # \"Do Something Love\" (featuring Juliet) — 4:10 # \"You're Not Alone\" (featuring Tara McDonald) — 3:54 # \"Never Take Away My Freedom\" (featuring Chris Willis) — 4:09 # \"This Is Not a Love Song\" (featuring JD Davis) — 3:46 # \"Always\" (featuring JD Davis) — 4:00 # \"Joan of Arc\" (featuring Thailand) — 4:00 # \"Love Is Gone\" (featuring Chris Willis - Fred Rister & Joachim Garraud Radio Edit Remix) — 3:21 *UK edition: Bonus tracks 14\\. \"Love Don't Let Me Go (Walking Away)\" (featuring Chris Willis) (credited to \"David Guetta vs. The Egg\") — 3:16 *Limited edition: Bonus tracks 14\\. \"Don't Be Afraid\" — 3:16 15\\. \"Take Me Away\" — 4:25 16\\. \"Love Don't Let Me Go (Walking Away)\" (featuring Chris Willis) (credited to \"David Guetta vs. The Egg\") — 3:16 ==Chart performance== Chart (2007) Peak position French Albums Chart 2 Swiss Albums Top 100 10 Austria Album Charts 61 ==References== Category:2007 albums Category:David Guetta albums Category:Virgin Records albums",
 "title": "Pop Life (David Guetta album)"
}