{
 "id": "977419",
 "text": "In a moral panic, a category or group of people is seen as a threat to the moral values of a society. The society believes the group shows patterns of problematic behavior. The goal of the moral panic is to stop these 'problematic' behaviors. Moral panic is different from mass hysteria. With mass hysteria, there is no social control. Moral panics often lead to an increase in social control.Kenneth Thompson: Why the Panic? – The History and Meaning of the Concept. In: Moral Panics. Routledge, New York 1998, S. 1–22. In modern times, sensationalist press coverage and privately organized actions often accompany moral panics. == Examples == === \"Devil's Music\" in the United States === Starting around the 1920s in the United States, some Americans have argued that different kinds of new music cause spiritual or otherwise moral corruption in young people. They sometimes call the music they dislike \"the devil's music\". Blues and jazz - seen as \"negro music\" - were both given this label. Some people believed a blues listener could become violent and show other poor behavior. Meanwhile, traditionalists thought jazz contributed to the breakdown of morality. Urban middle-class African Americans perceived jazz as \"devil's music\", and agreed that jazz's improvised rhythms and sounds promoted promiscuity. In the mid-1980s, several teenagers died by suicide after they had listened to music (mostly metal) for some time. Some surviving relatives sued the musicians because of the lyrics they used, but they were unsuccessful. A label stating \"Parental advisory: Explicit lyrics\" was introduced. Still, a group of parents was discontent. They thought the parental advisory sticker would not make a difference between music that was \"offensive, satanic, sexual in nature [or] otherwise objectionable.\" === Other Western Countries === In Canada, topics of moral panic included reasonable accommodation. In France, there was a moral panic among people who opposed same-sex marriage; discussion about adolescent sexuality also increased. == References == Category:Sociology",
 "title": "Moral panic"
}