{
 "id": "97765",
 "text": "The Emmanuel College: St. Paul's Campus (formerly St. Paul's College) is a Roman Catholic, secondary day school for boys. It is in Altona North, a south- western suburb of Melbourne, Victoria, Australia. It a branch of one of Emmanuel College's education facilities. == History == === Establishment === St. Paul's Campus started as 'St. Paul's College' in 1965, under the guidance of the American Order of the Society of Marianists. The order had been asked to start this Catholic Secondary Boys' College by the then Archbishop of Melbourne, Dr. Daniel Mannix. The college's colours were then Red, White and Blue and its motto was Ecce Mater Tua (Latin:\"Behold Thy Mother\"). === Building construction === In the early 1960s, the local parish priests purchased a large, eight hectare, undeveloped block in Altona North. Through the work of the parents of the school's first students, the austere block was transformed into an attractive property. The College's primary edifice, the three-storey building called the \"Jubilee Building\", was completed in 1969. Following to be completed were: * The Chaminade Library in 1971. * The generous Art/Craft/Science Lab and the senior classrooms known as the \"Winters Building\" in 1979. * The administrative complex and gymnasium in 1982. The Jubilee Building was extensively renovated in 1998. In 2004, with the assistance of a Commonwealth Government grant, work commenced on enlarging the library complex and the building of two new computer labs. These developments were completed in 2005 and the College has not undergone any significant renovations since.Emmanuel College Diary === Change to Emmanuel College === In 2006, the plans for Emmanuel College and the future of the school initiated. 2008 saw the full change from 'St. Paul's College' to 'Emmanuel College' with the acquisition of a second co-educational campus. The school eventually incorporated a new emblem and changed its motto to Life To The Full, which comes from the Gospel according to John: \"I have come that they may have life and have it to the full\" (John 10:10). == Head Master and Current Staff == Since 1997, the principal has been Mr. Christopher Stock (BSc DipEd MEd B.Theol) at the St. Paul's Campus. In 2008 when the change to Emmanuel College was complete, he became the principal of Emmanuel College, and thus being the principal of two schools; the St. Paul's Campus and the Notre Dame Campus. == House/Homeroom System == Emmanuel College House System consists of 5 houses: * McCoy (Navy) * Cassidy (Red) * McCluskey (Gold) * Winters (Green) * Chaminade (Sky Blue) These houses are named after the Marianists who first served at the school. Each house has 10 homerooms, each with about 25 students ranged from years 7-12 per homeroom. == Victorian Certificate of Education (VCE) == Emmanuel College has offered the VCE program at the St. Paul's Campus since its began in 1990. ==Notable students== * Daniel Giansiracusa (AFL player) * Rohan Smith (Former AFL player) * Gary Blackwood (Member of the Legislative Assembly, Victoria, Member for Narracan) * Jesse Venables (2007 BBJ National 93 kg Gold Medalist (Melbourne. Australia)) * Jason Duff (Hockey player) * Auskar Surbakti (Journalist for SBS; CNN correspondent) * Bill Baarini (Former Mayor of Hobsons Bay) * Michael Martyn (Former AFL player) * Angelo Capuano (Law academic and Scholar to Oxford University) * Steven Iosofidis (Soccer player, currently playing for Altona East) * Trent Mckenzie (Recruited for Gold Coast AFL team) * James Podsiadly (AFL player) * James Cini (Chemical Engineer) * Hugh Curtis (ACC Football Star) * Harvey Redpath (ACC Cricket/Football Star) ==Related pages== * Emmanuel College: Notre Dame Campus ==References== ==Other websites== * Emmanuel College Website Category:Schools in Australia Category:Organisations based in Melbourne Category:1965 establishments in Oceania Category:1960s establishments in Australia",
 "title": "Emmanuel College, Melbourne"
}