{
 "id": "977675",
 "text": "The \"State Anthem of Turkmenistan\" (), officially called the \"National Anthem of Independent, Neutral Turkmenistan\" (), is the national anthem of Turkmenistan. It was adopted in 1997 and modified in 2008. During the Soviet era, the anthem of the Turkmen SSR was used. ==Lyrics== Turkmen original (Latin) Turkmen Cyrillic IPA transcription as sung English translation I I am ready to give my life for you, my land Our brave forefathers have a spirit in their heart, That is the light of a neutral, independent land The flag flies high in front of the world. The eternally great creation built by the people My strong state, my sovereign land. You are the light and song of the soul Long live and prosper, my Turkmenistan! II The tribes of my nation are unified Our ancestors' undying blood flows. In storms and unfortunate times, we are not afraid Generations will gather to protect our glory. ===Original lyrics=== Turkmen original (current orthography) Turkmen lyrics when it was first written Cyrillic script Perso-Arabic script IPA transcription as sung English translation قايتالاما: تۆرکمن‌باشینگ قرآن بييك بيناسؽ برقارار دولتيم، جگريم–جانؽم. باشلارؽنگ تأجى سن، ديللر سناسؽ دنیا دوُرسوُن، سن دوُر، تۆرکمنيستانؽم! ١ جانؽم قربان سانگا، ارقانا يوُردوُم مرت پدرلنگ روُخؽ باردؽر کؤنگۆلده. بيتاراپ، قاراشسؽز توْپراغؽنگ نوُردوُر بايداغؽنگ بلنتدير دنیأنگ اؤنگۆنده. قايتالاما ٢ قارداشدؽر تيرلر، آماندؽر ايللر اول–آخر بيردير بيزينگ قانؽمؽز. خاراساتلاز آلماز، سؽندؽرماز سيللر نسللر دؤش گريپ قوْرار شانؽمؽز. قايتالاما ٣ آرقامدؽر بوُ داغلار، پنامدؽر دۆزلر إقبالؽم، نامؽسؽم، تغابؽم، وطن! سانکا شك يتيرسه، کور بوْلسوُن گؤزلر گچميشيم، گلجگيم، دوْوامؽم، وطن! The great creation built by Turkmenbashy My strong state, my sovereign land. You are the light and song of the soul Long live and prosper, my Turkmenistan! I I am ready to give my life for you, my land Our brave forefathers have a spirit in their heart, That is the light of a neutral, independent land The flag flies high in front of the world. II The tribes of my nation are unified Our ancestors' undying blood flows. In storms and unfortunate times, we are not afraid Generations will gather to protect our glory. III Mountains, rivers and beauty of steppes, Love and destiny, revelation of mine! Let my eyes go blind for any cruel look at you, Motherland of ancestors and heirs of mine! ==References== Turkmen Category:1992 Category:National symbols of Turkmenistan",
 "title": "State Anthem of Turkmenistan"
}