{
 "id": "977738",
 "text": "The Climate Book is a non-fiction book on the subject of climate change and climate protection written by Greta Thunberg in collaboration with many scientists and science journalists. The English original and translations in languages such as German, Dutch, Spanish, Portuguese, French, Italian, Swedish, Danish and Norwegian were published almost simultaneously in October 2022. == Content and intention == The book is an interdisciplinary collaborative effort, divided into five parts by an overarching structure. In total, more than 100 experts from numerous disciplines such as geophysics, meteorology, engineering, mathematics, history, as well as indigenous leaders contributed to the book.Greta Thunberg sees her climate book as 'a new type of activism'. In: The Sydney Morning Herald, 3 November 2022. Retrieved 12 November 2022. The individual contributions are grouped into larger sections by introductions by Thunberg.For the breakdown, see: https://unterrichten.zum.de/wiki/Das_Klima-Buch These are: * 1: How the climate works; * 2: How our planet is changing; * 3: How it affects us; * 4: What we have done about it; * 5: What we must do now. The book attempts to lay the foundations for a complex understanding of the global climate crisis and to outline responses to address it. Climate education is to be promoted in schools and the media, which is seen as a prerequisite for meaningful action. Thunberg makes an attempt to address what she sees as a false balance in reporting, exposing the manipulation of environmental statistics by \"negotiating out\" emissions and misleading labels such as \"green\" hydrogen, and making the voices of those currently most affected by the impacts of climate change from the Global South heard.Those most affected in the most affected regions are on the front lines of the climate crisis. But they are not on the front pages of our newspapers. Their voices need to be heard, and we can all help with that. Spread their stories and their names. A unique feature of the book, which could be seen as a criticism in a book of this ambition, is that it lacks a bibliography and large annotation apparatus. Authoritative expertsare listed in the table of contents with brief information about their field of work and social position.They are not quoted, their positions are not referenced, but they themselves have their say.This way, the young generation, for whom the book is not least intended, but also the older generation, is familiarised with many names for the first time, which, if you look them up on the net, will lead you to essential publications and, if necessary, to a classification of their work in the research context in Wikipedia. ==References== Category:Energy Category:Climate change Category:Air pollution Category:2022 books",
 "title": "The Climate Book"
}