{
 "id": "97777",
 "text": "This is a list of the episodes of the CBS television sitcom The Nanny. There are 146 episodes in this series. ==Season One (1993-1994)== Episode Number Title Original Airdate 01 Pilot After loud-mouthed Fran Fine is jilted by Danny, her husband-to-be and boss, she makes money by selling cosmetics door- to-door. One door happens to belong to Maxwell Sheffield, a Broadway producer who happens to need a nanny for his three children. Fran jumps at the chance. Her unconventional wisdom and methods disagree with everyone at first, but when she brings the kids to Maxwell's producer party, everyone realizes that Fran is valuable. November 3, 1993 02 Smoke Gets in Your Lies Brighton seeks popularity at school. Fran and Val tell him about a boy in their middle school who was the coolest kid around-he smoked, drank, and even had tattoos. Brighton tries smoking, but gets caught. Fran realizes that the problem is her fault, and fears Brighton will turn her in...but he goes against character and keeps the secret. It just may mean that the children are beginning to like Fran! November 10, 1993 03 My Fair Nanny Maxwell decides to throw a party to woo a rich woman to produce his play. Fran jumps at the chance to plan a High Tea for mothers and daughters, but C.C. fears that Fran's wacky ways will ruin the party. Fran is tutored to be a socialite and manages to impress the ladies. Unfortunately, Maggie reveals that none of the daughters are happy! Fran changes back into \"Nanny-mode\" and turns the boring party into a great time. November 17, 1993 04 The Nuchslep Maxwell will not let Maggie go on a date without supervision. Fran volunteers to go. Maggie is fine with this arrangement...but her boyfriend seems to like Fran better! November 24, 1993 05 Here Comes the Brood C.C. takes the kids on a trip to the zoo to prove that she is just as motherly as Fran. While there, everyone has a miserable time. When Grace points out that Fran is always fun to be with, C.C. nastily tells her that Fran only likes the children because she is paid to do so. Grace runs away from home-to Fran's mother's apartment. They then go off to a family wedding, where Fran promises Grace that she \"doesn't get paid extra for loving her.\" She then threatens to beat C.C. up if she \"ever hurts her kids again.\" December 1, 1993 06 The Butler, the Husband, the Wife and Her Mother Fran's rich and obnoxious cousin comes to town, bragging about her great life. When she appears, Fran pretends that she owns the Sheffield's home. To do that, Niles pretends to be Mr. Sheffield...which means that Maxwell must pretend to be Niles! Things only get more complicated when the Butler's Association comes to evaluate \"Niles.\" In the end, all is revealed, and Fran's cousin is impressed by the family. December 8, 1993 07 Imaginary Friend Fran eats Gracie's Imaginary Friend December 15, 1993 08 Christmas Episode It's Christmas and Fran has bought everyone great presents, counting on a bonus to pay for it all, sadly for her, she does not get one December 22, 1993 09 Personal Business Brock Storm is going to star in Mr Sheffield's show, but only Mr Sheffield sets him up with The Nanny. December 29, 1993 10 The Nanny- in-Law Mr Sheffield's nanny comes into town and is not happy with Fran's way of dealing with the kids. January 12, 1994 11 A Plot for Nanny Fran starts dating a Funeral Director who decides to take a new career path. January 19, 1994 12 The Show Must Go On The Nanny is hired to direct Gracie's play. January 26, 1994 13 Maggie the Model When Maggie becomes a model, things do not turn out quite as she'd planned February 2, 1994 14 The Family Plumbing The Plumbing is not working and Fran convinces Mr Sheffield to hire her cousin. Meanwhile, Brighton is caught kissing and The Nanny walks in on Mr Sheffield in the shower! February 9, 1994 15 Deep Throat Fran must go to hospital to under-go an operation. March 2, 1994 16 Schlepped Away After everyone decides to go on a holiday, they make a quick stop at Sylvia's, only to find they must stay there due to a strong blizzard. March 9, 1994 17 Stop the Wedding, I Want to Get Off Maxwell's sister is going to marry a duke, but Fran's instinct tells her his sister loves her driver. March 16, 1994 18 Sunday in the Park with Fran Mr Sheffield's play will only be a hit if a certain reviewer says it will be a hit, but after taking Frank Bradley's son to the park, Fran makes a mess when she hits Frank's son with a baguette. March 23, 1994 19 The Gym Teacher Maggie is desperate to get out of gym, with help from 'The Nanny'. It will all be fine...will it not? April 6, 1994 20 Ode to Barbara Joan CC father's in town and he seems to be more warm with Fran then CC when he asks her to attend a Barbara concert. April 13, 1994 21 Frannie's Choice Fran is proposed to by her ex-fiancée Danny. Will she go, or will she stay where she belongs? April 27, 1994 22 I Don't Remember Mama It's Mothers' Day and Mr Sheffield is doing everything he can to keep the kids' minds off their mother, with a heart-warming surprise. May 16, 1994 ==Season Two (1994-1995)== Episode Number Title Original Airdate 23 Fran-Lite The children are heading back to school, but Brighton refuses to go back because he feels small in middle school. Also, things get weird when Maxwell starts dating a woman who's exactly like Fran! September 12, 1994 24 The Playwright In order to teach Brighton a lesson about rejecting girls, Fran goes on a date with a man she used to torment in high school. September 19, 1994 25 Everybody Needs a Bubby While the retirement home gets fumigated, Grandma Yetta comes to stay at the Sheffield Mansion, but when she starts passing some of her \"wisdom\" among the children, Fran and Maxwell are concerned. September 26, 1994 26 Material Fran One of Fran's old high school friends sets her up with her husband's business partner to see how she likes someone who's loaded. The idea would sound mighty fine if Fran's date was not so old! October 3, 1994 27 Curse of the Grandmas It is the first anniversary since Fran started working for the Sheffields, but Maxwell does not seem to recall this very important occasion. Also, Fran leads Gracie's girl scout troop to \"adopt\" their very own grandmas at Yetta's retirement home, but each of Gracie's grandmas drop dead! October 10, 1994 28 The Nanny Napper During a mishap in the subway, Fran unknowingly \"kidnaps\" a Russian woman's baby. October 17, 1994 29 A Star is Unborn Fran is hired by an amateur director to play Juliet in a reproduction of Romeo and Juliet. However, Maxwell protests this for reasons even he is unaware of. October 24, 1994 30 Pishke Business Sylvia and her canasta club want to invest their pishke in Maxwell's next play, but theRE may not be a play when C.C. assaults Maxwell's other investor! October 31, 1994 31 Stock Tip Fran picks up a stock broker at the grocery store, and when she introduces him to Max, the two hit it off! November 7, 1994 32 The Whine Cellar It is Sylvia's 50th birthday, and Fran is the hostess. However, when she and C.C. accidentally lock themselves inside the wine cellar, the two must learn to tolerate each other. November 14, 1994 33 When You Pish Upon a Star When Maxwell casts a major child star named Jack Walker into his reproduction of Oliver, Fran is charged with taking care of this obnoxious kid. Things start to heat up when Fran convinces Jack to quit show business! November 21, 1994 34 Take Back Your Mink Fran's great-aunt dies and leaves Fran her coveted mink coat. Unfortunately, Maggie's obsessive belief in animal rights prompts Fran to reject the coat, pitting her against her mother. November 21, 1994 35 The Strike Maxwell and Fran attract unwanted press attention due to an incident on the opening night of Maxwell's latest play. November 28, 1994 36 I've Got a Secret When Maxwell invites a high-profile actress to recover at his house from plastic surgery, Fran goes to great lengths to find out who she is. December 12, 1994 37 Kindervelt Days Fran wants to go to her Kindervelt Camp reunion, but becomes desperate when she cannot find a handsome man to whoo one of her camp rivals. January 2, 1995 38 Canasta Masta Brighton joins Sylvia's and Yetta's canasta team in a search for an invigorating sport, but Maxwell does not approve. January 9, 1995 39 The Will Fran fears for Maxwell's life when she finds a letter addressing a heart problem that's supposedly his. January 16, 1995 40 The Nanny Behind the Man Fran and Maxwell want to hire a major playwright to write a new play for them, so Fran tries to impress him by setting him up with another woman. Who could this be? January 23, 1995 41 A Fine Friendship Fran starts dating a man, but thinks that he is homosexual. February 6, 1995 42 Lamb Chop's On the Menu Max and C.C. hire Shari Lewis and Lamb Chop to create their first film. Meanwhile, Fran cares for C.C.'s dog, Chester. February 13, 1995 43 Close Shave Fran earns Maggie a job as a hospital candy striper. Meanwhile, Maxwell learns why he should not accept food from C.C. February 20, 1995 44 What the Butler Sang Impressed by Niles' recently discovered ability to sing, Fran convinces Max to hire him for a new play. Meanwhile, Fran's recently broken-up sister Nadine comes to visit. February 27, 1995 45 A Kiss Is Just a Kiss Fran and Maggie compete in a kissing contest. May 3, 1995 46 Strange Bedfellows Fran attends the nanny retirement party for one of her friends, but the unfortunate parallels of their lives lead Fran to fear for her future. May 8, 1995 47 The Chatterbox Fran helps a down-on-her-luck actress to get a job at a local hair salon. May 15, 1995 48 Fran Gets Mugged Fran gets robbed of her purse in the park. It could not get much worse, right? Wrong! May 22, 1995 ==Season Three (1995-1996)== Episode Number Title Original Airdate 49 Pen Pal September 11, 1995 50 Franny and the Professor September 18, 1995 51 Dope Diamond September 25, 1995 52 A Fine Family Feud October 2, 1995 53 Val's Apartment October 9, 1995 54 Shopaholic October 16, 1995 55 Oy Vey, You're Gay October 23, 1995 56 The Party's Over November 6, 1995 57 The Two Mrs. Sheffields November 13, 1995 58 Having His Baby November 20, 1995 59 The Unkindest Gift November 27, 1995 60 The Kibbutz December 4, 1995 61 An Offer She Can't Refuse December 11, 1995 62 Oy to the World - Fully animated episode December 18, 1995 63 Fashion Show January 8, 1996 64 Where's Fran? January 15, 1996 65 The Grandmas January 22, 1996 66 Val's Boyfriend February 5, 1996 67 Love is a Many Blundered Thing February 12, 1996 68 Your Feets Too Big February 19, 1996 69 Where's the Pearls? February 26, 1996 70 The Hockey Show March 4, 1996 71 That's Midlife March 11, 1996 72 The Cantor Show April 29, 1996 73 Green Card May 6, 1996 74 Ship of Fran's May 13, 1996 75 A Pup in Paris May 20, 1996 ==Season Four (1996-1997)== Episode Number Title Original Airdate 76 The Tart with Heart September 18, 1996 77 The Cradle Robbers September 25, 1996 78 The Bird's Nest September 25, 1996 79 The Rosie Show October 9, 1996 80 Freida Needa Man October 16, 1996 81 Me and Mrs. Joan October 30, 1996 82 The Taxman Cometh November 6, 1996 83 An Affair to Dismember November 13, 1996 84 Tattoo November 20, 1996 85 The Car Show December 11, 1996 86 Hurricane Fran December 18, 1996 87 Danny's Dead and Who's Got the Will? January 8, 1997 88 Kissing Cousins January 15, 1997 89 The Fifth Wheel January 29, 1997 90 The Nose Knows February 5, 1997 91 The Bank Robbery February 12, 1997 92 Samson, He Denied Her February 19, 1997 93 The Facts of Lice March 5, 1997 94 Fran's Roots March 12, 1997 95 The Nanny and the Hunk Producer April 2, 1997 96 The Passed-Over Story April 9, 1997 97 No Muse is Good Muse April 23, 1997 98 You Bette Your Life April 30, 1997 99 The Heather Biblow Story May 7, 1997 100 The Boca Story May 14, 1997 101 Fran's Gotta Have It May 21, 1997 ==Season Five (1997-1998)== Episode Number Title Original Airdate 102 The Morning After October 1, 1997 103 First Date October 8, 1997 104 The Bobbie Fleckman Story October 15, 1997 105 Fransom October 22, 1997 106 The Ex-Niles October 29, 1997 107 A Decent Proposal November 5, 1997 108 Mommy and Mai November 12, 1997 109 Fair Weather Fran November 19, 1997 110 Educating Fran December 10, 1997 111 From Flushing with Love December 17, 1997 112 Rash to Judgement January 7, 1998 113 One False Mole and You're Dead January 14, 1998 114 Call Me Fran January 21, 1998 115 Not Without My Nanny January 28, 1998 116 The Engagement March 4, 1998 117 The Dinner Party March 11, 1998 118 Homie-Work March 18, 1998 119 The Reunion Show March 25, 1998 120 Immaculate Concepcion April 1, 1998 121 The Pre-nup April 29, 1998 122 The Best Man May 6, 1998 123 The Wedding, Part I May 13, 1998 124 The Wedding, Part II May 13, 1998 ==Season Six (1998-1999)== Episode Number Title Original Airdate 125 The Honeymoon's Overboard September 30, 1998 126 Fran Gets Shushed October 7, 1998 127 Once a Secretary, Always a Secretary October 14, 1998 128 Sara's Parents October 21, 1998 129 Maggie's Boyfriend October 28, 1998 130 I'm Pregnant November 4, 1998 131 Mom's the Word November 11, 1998 132 Making Whoopi November 18, 1998 133 Oh, Say, Can You Ski? November 25, 1998 134 The Hanukkah Story December 16, 1998 135 The In-Law Who Came Forever January 6, 1999 136 The Fran in the Mirror January 20, 1999 137 The Yummy Mummy February 3, 1999 138 California Here We Come March 31, 1999 139 Ma'ternal Affairs June 2, 1999 140 The Producers June 9, 1999 141 The Dummy Twins June 16, 1999 142 Yetta's Letters June 16, 1999 143 Maggie's Wedding June 23, 1999 144 The Baby Shower June 23, 1999 145 The Finale, Part I May 12, 1999 146 The Finale, Part II May 12, 1999 ==Reunion Special: 2004== *The Nanny Reunion: A Nosh to Remember Nanny",
 "title": "List of The Nanny episodes"
}