{
 "id": "97773",
 "text": "The Nanny was an American sitcom starring Fran Drescher. It first showed in 1993 and ended in 1999. == Starring == * Fran Drescher * Charles Shaughnessy * Daniel Davis * Lauren Lane * Nicholle Tom * Benjamin Salisbury * Madeline Zima * Renée Taylor * Rachel Chagall * Ann Morgan Guilbert === Characters === * Fran Fine * Maxwell Sheffield * Niles * C. C. Babcock * Maggie Sheffield * Brighton Sheffield * Grace Sheffield * Sylvia Fine * Yetta Rosenberg * Val Toriello == Story == Fran Fine is a bridal consultant at Danny's Parisian Brides for Less. Thinking her boyfriend of three years will propose at any minute, she stays with him. But in the series premier, he dumps her for Heather Biblow. He fires her so Heather Biblow can take her job. Fran is forced to take a job as a door-to-door cosmetics saleswoman for Shades of the Orient cosmetics. When she knocks on the door of the Sheffield residence, the man at the door, who turns out to be the butler, mistakes her for an applicant for the nanny position. After meeting the man of the house, Maxwell Sheffield, he is none to thrilled with her unorthodox manners and lack of experience. Out of desperation, he takes her on as nanny on a trial basis. The girls, Maggie, the oldest, and Gracie the youngest quickly warm up to her, but not Maxwell's son, the middle boy Brighton. He was the hardest to win over, and eventually she becomes an integral part of the Sheffield home, and she becomes best friends with the butler Niles. Maxwell's business partner C.C. Babcock, who wants Maxwell for herself, becomes jealous of Fran and sees her as a competitor. The series showed many hints of the growing attraction between Miss Fine and Mr Sheffield, even so far as Mr Sheffield saying he loved her....then taking it back. Eventually they do get married after a lot of ups and downs. Near the end of the series, Fran gives birth to twins, a boy and a girl. The Sheffields (Maxwell, Fran, Grace, Jonah, Eve) move to California. Maggie and Brighton take a trip to Europe. The last scene of the show is of Fran finding her Shades of the Orient case from the series premiere, looking at the case and the house with loving memories and walking out the door for the last time. ==Impact== ===Reception=== The show performed poorly in its first year. When it was almost canceled, Sagansky stepped in. According to Jacobson: \"At all those affiliate meetings, he used to say, 'Stick by The Nanny!' He knew it was something special.\" The sitcom was the first new show delivered to CBS for the 1993 season. It was the highest-tested pilot at the network in years. The series was also very successful internationally. In Australia, it was one of the highest-rated programs during the mid-to-late 1990s. ===Ratings=== Season Season № of episodes Original airdates Original airdates Notes Nielsen ratings Nielsen ratings Season Season № of episodes Premiere date End date Notes Ranking (in millions) 1 22 November 3, 1993 May 16, 1994 #60 14.7 2 26 May 22, 1995 #24 22.5 3 27 September 11, 1995 May 20, 1996 Included \"Oy to the World\" animated episode. #16 23.4 4 26 September 18, 1996 May 21, 1997 #45 14.9 5 23 October 1, 1997 May 13, 1998 #50 11.5 6 22 September 30, 1998 Six unaired episodes (\"Ma'ternal Affairs\", \"The Producers\", \"The Dummy Twins\", \"Yetta's Letters\", \"Maggie's Wedding\" and \"The Baby Shower\") were shown after series finale. #84https://web.archive.org/web/20091029011819/http://geocities.com/Hollywood/4616/ew0604.html 1998–1999 TV Season Ratings 9.3 ==Related pages== * List of The Nanny episodes ==References== Category:American sitcoms Category:English-language television programs Category:1993 American television series debuts Category:1999 American television series endings",
 "title": "The Nanny"
}