{
 "id": "977872",
 "text": "Argentina was settled by many different indigenous tribes. In 1480, the Incan Empire invaded and established the first major empire in Argentinian history. Some of present-day Argentina became part of the Incan Empire, but in other areas, people resisted. In 1516 Juan Diaz de Solias, a Spanish explorer and navigator, was the first European to set foot in present-day Argentina. == Timeline == 1908 - Argentina has seventh highest per capita income in the world. 1912 - Argentina passes the Sáenz Peña Law, a major reform. Its goals are to make elections more fair and ensure that more people participate in the democratic process. It gives the right to vote to all adult men in the country. In fact, the law requires them to vote. 1916 - Hipolito Yrigoyen of the Radical Party is elected president. He introduces a minimum wage to counter the effects of inflation. 1928 - Yrigoyen is re-elected. 1930 - President Yrigoyen is removed from power by a military coup. The Great Depression has caused an economic depression in the country. 1932 - Non- military rule is restored, but economic decline continues. 1942 - Argentina, along with Chile, refuses to break diplomatic relations with Japan and Germany after the Japanese attack on the United States Pacific fleet at Pearl Harbor. 1943 - Nationalist army officers take control of the country in protest of electoral fraud. One leading figure is Colonel Juan Peron. 1945 - Argentina declares war on Japan and Germany. === The Peron era === 1946 - Juan Peron is elected president after promising higher wages and social security. His wife, Eva 'Evita' Peron, is put in charge of labour relations. 1949 - A new constitution gives more power to the president. People who do not agree with him are put into prison. Independent newspapers are shut down. 1951 - Peron is re-elected with a huge majority, but his support begins to decline after Evita dies the next year. 1955 (August-September) - Violent military uprisings cause President Peron to resign and leave the country. 1966 - General Juan Carlos Ongania takes control of the country after years of unstable civilian government. 1973 - The Peronist party wins elections in March, and Peron becomes president in September. 1974 - Peron dies in July. His third wife, Isabel, becomes the first woman president in Argentinian history. Left-wing and right-wing terrorism increases. Hundreds of people die during strikes and protests, and as a result of severe economic inflation. 1976 - Armed forces seize power and launch the 'Dirty War,' in which thousands of Argentinians suspected of left-wing sympathies are killed. === The Falklands War === 1982 (April) - Argentine forces occupy the British Falkland Islands. For many years, Argentina has claimed to own these islands. 1982 (June) - A British task force regains control of the Falkland Islands. 1983 - A junta, reeling from the Falklands War, restores democracy. Raul Alfonsin becomes president. 1989 - Carlos Menem of the Peronist party is elected president. He imposes an economic austerity programme. 1990 - Full diplomatic relations with the United Kingdom are restored. Argentina still claims to own the Falkland Islands. 1992 - Argentina introduces a new currency, the peso, which is tied to the US dollar. 1994 - A Jewish community center in Buenos Aires is bombed. 86 people are killed and more than 200 injured in Argentina's worst terrorist attack in history. Iran and its Lebanese Hezbollah allies are accused of being responsible. === Recession === 1999 - Fernando de la Rua of the centre-left Alianza opposition coalition wins the presidency. He inherits 114 billion dollars of public debt after a year of recession. 2001 (July) - Workers held a general strike in protest of proposed government spending cuts. Much of the country is brought to a standstill. Argentina's credit ratings slip. === Return of the Peronists === 2001 (October) - The Peronists opposition party take control of both houses of Parliament in congressional elections. 2001 (December) - The International Monetary Fund (IMF) stops $1.3 billion in aid. Banks shut down. President De la Rua resigns after at least 25 people die in riots. 2002 (January) - Congress elects Peronist Senator Eduardo Duhalde as caretaker president. Within days the government lowers the value of the peso. This ended a decade where the peso was worth the same as the US dollar. 2002 (November) - Argentina defaults on an $800 million debt repayment to the World Bank. This means the country fails to meet the requirements of the loan agreement. === Kirchner sworn in === 2003 - Congress agrees to repeal (cancel) an amnesty law that has protected former military officers suspected of human rights abuses during military rule in 1976-1983. 2003 (May) - Mainstream Peronist candidate Nestor Kirchner is elected president. 2003 (September) - After weeks of negotiations, Argentina and the IMF agree on a debt-refinancing deal under which Buenos Aires will only pay interest on its loans. 2005 (June) - The Supreme Court agrees with Congress's 2003 decision to repeal the amnesty law. 2006 (January) - Argentina repays its multi-billion-dollar debt to the IMF. === Fernandez elected === 2007 (December) - Cristina Fernandez de Kirchner is elected president, succeeding her husband Nestor Kirchner. 2009 (July) - After legislative elections, the Peronist party loses its absolute majorities in both houses of parliament. Before this, more than half of the legislators in each house were Peronists. This made it possible for the Peronists to overrule the other legislators in votes. In the election, several Peronist candidates lose, so the Peronists no longer have their absolute majority in either house. === Row with Britain === 2009 (December) - Parliament passes a law claiming ownership of the Falkland Islands and several other British overseas territories in the area. 2010 (February) - Argentina imposes new controls on ships passing through its waters to the Falkland Islands. This is a response to a British company's plans to drill for oil near the islands. 2011 (October) - Benefiting from strong economic growth, President Cristina Fernandez de Kirchner wins a second term in a landslide, winning 54% of the vote. 2012 (November) - Congress approves a law to lower the voting age to 16. 2013 (February) - Argentina becomes the first country to be censured by the International Monetary Fund for not providing accurate data on inflation and economic growth. 2013 (March) - Falkland Islanders vote overwhelmingly to remain a British overseas territory. Additionally, Cardinal Jorge Mario Bergoglio of Buenos Aires becomes the first Latin American to be elected pope. He takes the name of Francis. 2014 (July) - Argentina defaults on its international debt for the second time in 13 years. This occurs after the country failed to resolve its differences with American hedge funds that hold bonds worth $1.3 billion. The hedge funds bought these bonds at a discount after Argentina defaulted on its international debt for the first time. 2015 (January) - Well-known prosecutor Alberto Nisman is found dead in mysterious circumstances. He had recently accused the government of a cover-up over the country's worst terrorist attack, the 1994 bombing of a Jewish community centre in Buenos Aires that left 85 people dead. 2015 (November) - Conservative Buenos Aires Mayor Mauricio Macri beats Peronist candidate Daniel Scioli in a run-off presidential election and takes office in December. 2016 (February) - Argentina agrees to settle its multi-billion-dollar dispute with the US hedge funds over bond repayments. This dispute had restricted the country's access to international credit markets. 2016 (December) - Britain and Argentina sign an agreement to identify the remains of 123 Argentine soldiers who died in the Falklands War. 2017 (October) - Mr Macri's coalition wins decisively in a parliamentary election seen as a referendum on his market reform policies. 2018 (May) - The government raises interest rates dramatically. The value of the peso is decreasing rapidly, and by raising interest rates, the government is attempting to stop this decrease in value. 2019 (October) - Peronist candidate Alberto Fernández wins the presidential election, becoming the first challenger to defeat an existing Argentinian president. == References ==",
 "title": "History of Argentina"
}