{
 "id": "977908",
 "text": "Noonbory and the Super Seven is a 2009 Korean children's animated educational television series. It was created by Cookie Jar Group. Developed in association with Knowledge and Access, it was distributed by BBC Kids. == Characters == === Noonbory === Color: Green Noonbory is a 10-year-old white bory and also the main protagonist of the series. He is the friendly, studious and thoughtful leader who often uses a helicopter device to fly across vast distances along with a green shield that can stop things in its track. He has two catchphrases, depending on the situation. As such, he has a habit of saying \"Let's make super sense of this!\" before they sensitize, or sometimes after they sensitize. His other catchphrase is \"Hurry scurry\", which he often says whenever anyone's not catching up, they are about to spring into action or occasionally when the situation calls for it. Noonbory wears headgear in the shape of Mamby and green fingerless gloves. He's voiced by Brent Hirose. === Lunabory === Color: Yellow Lunabory is an 8-year-old yellow bory, also so Is best protagonist popular one of the Super 7, her super sense is the ability of sight she can see far distances with her super senses usually when the situation calls for it like when they need to find the gury that is usually causing trouble for the episode. Her catchphrase is \"Seeing is believing\" and has a habit of saying it when she uses her powers. One time, she used her powers to help win a game, but in the end she learned her lesson of cheating. She's voiced by Jacqui Fox. === Mamby === Color: Gold Mamby is Noonbory's small yellow and orange sidekick who is the smallest of the Borys. Unlike other borys, Mamby cannot speak, instead he whistles. Where as most bory's arms can't disappear, Mamby's arms can appear and disappear into his body at any time. Mamby can transform into anything, like a parachute or a mattress. === Cozybory === Color: Violet Cozybory is a 9-year-old purple bory usually painting pictures or doing other feminine things while not out with the \"Super Bory\" team. She wears a light pink dress and likes to touch things. She's voiced by Jade Repeta === Jetybory === Color: Magenta Jetybory is a 9-year-old magenta bory and she is a member of the super seven and has the supersense of hearing and can hear from great distances. She's voiced by Margaux Miller. === Totobory === Color: Orange Totobory is an 8-year-old brown bory. His supersense taste he can taste things without actually eating the food, he also has these leaf like petals on his head that act like tentacles that can allow him pick these that either far away or too high. He's voiced by Markian Tarasiuk. === Pongdybory === Color: Blue Pongdybory is a 7-year-old blue bory. He has the supersense of smell and is able to smell things from far away. When he uses that, two light pink snout-like markings on his face glow, although it is occasionally followed by a powerful sneeze. He's voiced by Trevor Toffan. === Lukybory === Color: Indigo Lukybory is the seventh unofficial member of the Super 7. He is an 8-year-old yellow and orange bory and he represents nonsense he tends to make the situation unintentionally worse as he is the only other member who doesn't have a supersense other than Noonbory. Sometimes he provides the answer to the situation. Lukybory doesn't have any powers, unlike his little sister Kikibory, who has the ability to emit super sound. He's voiced by Reegan T.D. McCheyne. === Kikibory === Color: Pink Kikibory is the little sister of Lukybory. She is a 6-year-old pink and light pink bory and she has the ability to emit supersound waves from her mouth. === Hanubi === Noonbory's grandfather Hanubi can perform all sorts of magical acts from disappearing to teleportation to switching peoples minds in different bodies. Sometimes, though he can be distracted. In one episode, he used a spell that made everything smaller and multiplied by six. He accidentally made six little Wangurys because he said \"Too tired and too late to look, need a magical fix, make this smaller and do it times six.\" Hanubi is very old and wise. He carries a magic stick (staff) from a very old tree and looks like an older version of Noonbory with a mustache. === Builderborys === The Builderborys are a group a borys who build things for other borys throughout village. Their craftmanship ranges around carpentry such as building swings and toys. They always were there hard hats when on the job to be safe when they are building. Usually they are frequently in distressed some episodes. === Babysitterbory === Babysitterbory looks after the town's small Kidborys. She has occasionally enlisted help from others to watch them, such as Cozybory. === Doctorbory === Doctorbory has been known not only to treat Borys but Gurys as well. She is the only Bory to be treated with respect by Wangury. For illnesses like Singeritis, Doctorbory always gives out a sweet treat. === Coldygury === Coldygury can only live in Winter where it is always cold. He speaks in sentences using the style of an illeist and is often the first to help a Bory. Always targeted by Wangury, Coldygury has a defense mechanism of throwing snowballs at anyone when he gets angry. If taken too close to Spring (where the Borys live), Coldygury starts to melt and become smaller until he vanishes completely. === Ghostygurys === Living in the haunted forest, all the Ghostygurys want to have some peace and quiet with anybody to disturb their rest. They have been known to scare Wangury in addition to Noonbory's gang. === Wangury === Wangury is the evil pirate mastermind who wants to take over Toobalooba and spread general havoc. Hated among even the other Gurys, Wangury is the most chaotic evil in Noonbory's world – spreading mischief and \"super silly villainy\" without respect for common sense. Wangury lives in a pirate ship but is never seen sailing it. He is the most commonly seen \"silly villain\" in the series. === Rosygury === Rosygury is a young female Gury that lives near the Bory Village. She likes her roses and attacks any Bory who threatens her rose garden with vines. Unlike Coldygury, Rosygury uses complete sentences and have been known to get Borys to betray their kind by stealing valuable objects for her. === Dozegury === Dozegury is a dragon gury that is also evil. He is able to turn invisible, can transform things into other things, and, like other dragons, breath smoke out of his nose. It is unknown if he breathes fire. He also can be seen carrying his trademark umbrella. === Evil Noonbory === Evil Noonbory is Noonbory's evil clone who first and only appeared in season 1 episode \"Double Trouble\". He was created by Dozegury. He tries to steal things in ToobaLooba. He's voiced by Brent Hirose. Category:2009 Canadian television series endings Category:Canadian animated television series",
 "title": "Noonbory and the Super Seven"
}