{
 "id": "977949",
 "text": "The \"Paraguayan National Anthem\" (, ) is the national anthem of Paraguay. ==Lyrics== Spanish original English translation Guarani lyrics I The peoples of the Americas, unfortunately, Were oppressed for three centuries by a scepter But one magnificent day surging forth, \"Enough!\", it said, and the scepter was broken. Our fathers, grandiose in battle, Showed their martial glory; ğ„† And after smashing the august diadem, The triumphal cap was raised. ğ„‡ Paraguayans: Republic or Death! Our spirit gave us liberty ğ„† Neither oppressors nor slaves exist Where union and equality reign, ğ„‡ ğ„† union and equality. ğ„‡ II A new Rome, the Fatherland shall proudly display Two leaders of name and valor Who, rivals, like Romulus and Remus Divided government and power. These long years when, during which Phoebus in the clouds Saw darken the pearl of the South, Today a grand hero appears Raising up again her glory and virtue... III Europe and the entire world to her Gives salutes and also acclaimations To that invincible bastion of heroism, The magnificent Eden of riches. (But) when discord rumbled all around Which fatally devoured other Peoples, Paraguayans, the sacred ground Was covered by an angel with its wings. IV Oh, how pure, of laurel girded Sweet Fatherland, in this manner you show yourself. In your ensign one sees the colors Of sapphire, diamond, and ruby. In your coat of arms, which the Sun illuminates, Under the cap, one sees the lion. Double image of the strong and the free, And of glories, the memory and crest. V From the tomb of vile feudalism The national Deity rises free; Oppressors, bend your knees! Compatriots, entone the hymn! Sound the cry, \"Republic or death\"! Our breasts exhale it with faith, And the mountains repeat its echoes Like giants arising in the land. VI Our Fatherland defends liberty and justice; So tyrants: listen! The laws in its sacred charter Will sustain its heroism in the fight. Against the world, if the world opposes it, If the world dares to insult her security, Battling to avenge we shall know her Or die embracing her. VII Arise, oh People, your splendid sword That strikes with sparkles of God, There is no middle ground between free or slave And an abyss divides the two. In the gentle breezes the Hymn resounds, Repeating with triumphal echo: For the free, renowned glory! For the Fatherland, immortal laurel! ==References== Category:Paraguayan culture Category:South American anthems",
 "title": "Paraguayan National Anthem"
}