{
 "id": "977945",
 "text": "\"Salve, Oh Patria\" (; \"Hail, Oh Fatherland\") is the national anthem of Ecuador. ==Lyrics== ===Official lyrics=== Spanish original IPA transcription English translation [틛salbe 틛o 틛pat쬵a los 틛ixos del 틛swelo] [틛토lo쬵a a 틛ti 틛토lo쬵a a 틛ti] [틛퉇a tu 틛pet포툮o tu 틛pet포툮o re틛bosa] [틛토oso i 틛pas 틛퉇a tu 틛pet포툮o re틛bosa] 洧 [i tu 틛f쬰nte i tu 틛f쬰nte ra틛djosa] [틛mas ke el 틛sol kontem틛plamos lu틛si쬫 洧 [los p쬴틛me쬺s 틛ixos del 틛swelo] [ke so틛be쬭jo el pi틛t포툮int포툮a de틛ko쬬] [te akla틛ma쬺n po 틟sjemp쬰 se틟쑖쬬] [i be쮊깞je쬺n su 틟san토쬰 po ti틟] [틟djos mi틟쬺 i aseb틟to el olo틟kausto] [i 틟esa 틟san토쬰 틟fwe 틟xe쬸en fe틟kundo] [de 틟ot쬺s 틟e쬺es ke a틟tonito el 틟mundo] [틟bjo en tu 틟to쬹o a mi틟퉇a쬰s su쭂i쮊] 洧 [a mi틟퉇a쬰s su쭂i쮊] 洧 Hail, oh Fatherland, a thousand times! Oh Fatherland, Glory be to you! Glory be to you! Now your chest, your chest, overflows, Now your chest overflows with joy and peace; 洧 And your forehead, your radiant forehead we contemplate shining more than the Sun. 洧 The firsts, the sons of the soil Which Pichincha superbly adorns, Declared you as their sovereign lady forever, And shed their blood for you. God observed and accepted the holocaust, And that blood was the fertile germ Of other heroes whom the world in astonishment Saw rise up around you by the thousands. 洧 Rise up by the thousands! 洧 ===In local languages=== Quechua translationhttps://m.youtube.com/watch?si=r5ulQmekc3kBrjJq&v;=6ZpZJcERIkw&feature;=youtu.be Shuar translationhttps://m.youtube.com/watch?si=IfyaIj_9buCzr-15&v;=id5iCEyIcXo&feature;=youtu.be ===Full lyrics=== Spanish original English translation We greet you, Oh Fatherland, a thousand times! Oh Fatherland, glory to you! Your breast overflows with joy and peace, and your radiant face is brighter than the shining sun we see. I Your children were outraged by the yoke That Iberian audacity imposed on you, By the unjust and horrendous disgrace Fatally weighing upon you. They cried out a holy voice to the heavens, that noble voice of a unbreakable pledge, to defeat that monster of blood, that this servile yoke would disappear. II The first sons of the soil Which Pichincha proudly adorns, Declared you as their sovereign lady forever, And shed their blood for you. God observed and accepted the holocaust, And that blood was the prolific seed Of other heroes whom the world in astonishment Saw rise up around you by the thousands. III Of those heroes of iron arm No land was invincible, And from the valley to the highest sierra You could hear the roar of the fray. After the fray, Victory would fly, Freedom after the triumph would come, And the Lion was heard broken With a roar of helplessness and despair. IV At last Spanish ferocity yielded, And now, oh Fatherland, your free existence Is the noble and magnificent heritage Which the felicitous heroism gave us.: It was given to us from our Fathers' hands, Let no one take it from us now, Nor any daring fool wish to excite Our vengeful anger against himself. V May no one, oh Fatherland, try it. The shadows of Your glorious heroes watch us, And the valor and pride that they inspire Are omens of victories for you. Come lead and the striking iron, That the idea of war and revenge Wakes the heroic strength That made the fierce Spanish succumb. VI And if new chains are prepared by The barbaric injustice of fate, Great Pichincha! May you prevent the death Of the Fatherland and her children in the end; Sink to the deep point in your gut All that exists on your soil. Let the tyrant Tread only ashes and in vain Look for any trace of being beside you. ==References== Category:Ecuador Category:South American anthems",
 "title": "Salve, Oh Patria"
}