{
 "id": "978152",
 "text": "The \"Himno Nacional de Uruguay\" is the national anthem of Uruguay. In its full form, it is the longest national anthem in the world. ==Lyrics== ===Full lyrics=== Spanish original English translation of original ğ„† Easterners, the Fatherland or the grave! Liberty or with glory we die! ğ„‡ ğ„† It is the vow that the soul pronounces, and which, heroically we will fulfill! ğ„‡ ğ„† It is the vow that the soul pronounces, and which, heroically we will fulfill! ğ„‡ I Freedom, Freedom, Easterners! This cry saved the fatherland. That his bravery in fierce battles Of sublime enthusiasm enflamed. This sacred gift, of glory we've deserved: tyrants tremble! Freedom in battle we'll cry, And in dying, freedom we'll shout! II Iberia worlds dominated He wore his haughty power, And their captive plants lay The East nameless be But suddenly his irons chopping Given the dogma that May inspired Among free despots fierce A bridge saw pit. III His billet chain guns, On his chest shield in battle, In his superb courage trembled The feudal champions of the Cid In the valleys, mountains and jungles Are undertaken with silent pride, With fierce rumbling roar The caves and the sky at once. IV The roar that echoes around Atahualpa the tomb was opened, And vicious beating palms Her skeleton, revenge! shouted Patriots to the echo It electrified in martial fire, And in his teaching more lively shines Of the Incas the immortal God. V Long, with various fortunes, The freedman battled, and Lord, Disputing the bloody earth Inch by inch with blind fury. Justice finally overcomes Tamed the wrath of a king; And to the world the indomitable Homeland Inaugurates teaches law. VI Easterners, look at the flag, Glittering crucible of heroism; Our spears defend their brightness, No one insults the image of the sun! In the civil jurisdiction the enjoyment Sustain and faithful Code Immune and glorious venerate Israel as the holy ark. VII For your glory to be higher, And Shine your price and power, Three crowns, oh Fatherland, were Your domain enjoy, and lose. Freedom, freedom adored Much treasure unparalleled slopes! But they are worth your joys divine That blood that irrigates your altar VIII If a barbarian people agitated, Removing his late fury Avoid fratricidal strife, Ten thousand tombs recall the horror! Heaven thunders storms, curses upon him, And the triumphant worship free the law to rich jewel. IX Shining adorned with laurels The pride of the South Amazon, In his bronze shield reflect Fortaleza, justice and virtue. Enemies will not humiliate the front Neither foot oppressors imposed That sealed his record troubles And baptism of blood in their faith. X Celebrating the glory and the day Of the sun of this new republic With glimpses of purple and gold, Decks your beautiful glow. The August dome of Olympus Shines, and a divine being With stars in the heavens writes, Sweet Fatherland, your name immortal. XI The law to swear to Numen Equality, patriotism and unity, Sacrificing their divine order Blind hatred, and black ambition. And find that insulting fierce The greatness of the Eastern People, For the enemies, the spear of Mars, For the tyrants the dagger of Brutus! ğ„† Easterners, the Fatherland or the grave, Liberty or with glory, we die! ğ„‡ ğ„† Is the vote that the soul pronounces, And which, heroically we will fulfill! ğ„‡ We will fulfill! Is the vote that the soul pronounces, And which, heroically we will fulfill! ===Short version=== Spanish as performed English translation of performed version ğ„† Easterners, the Fatherland or the grave! Liberty or with glory we die! ğ„‡ It is the vow that the soul pronounces, and which, heroically we will fulfill! ğ„† It is the vow that the soul pronounces, and which, heroically we will fulfill! ğ„‡ Which we will fulfill! ğ„† We will fulfill! ğ„‡ We will fulfill! I ğ„† Liberty, Liberty, Easterners! This cry saved the fatherland. Which her brave warriors, in fierce battles With sublime enthusiasm fillÂ´d. ğ„‡ From this sacred gift the glory we deserved Tyrants: Tremble! ğ„† Tyrants: Tremble! ğ„‡ Liberty in combat we shall cry out! And dying, Freedom too! Liberty in combat we shall cry out! ğ„† And dying, Freedom too! ğ„‡ ğ„† Freedom too! ğ„‡ ==References== Uru Category:National symbols of Uruguay",
 "title": "National Anthem of Uruguay"
}