{
 "id": "978443",
 "text": "Renée Mortier (born 1886) was a French competitive swimmer, diver and sport administrator from the 12th arrondissement of Paris. She was a member and of Ondine de Paris. ==Swimming career== Mortier became a member of swimming club Ondine de Paris after it was founded in 1906. Other sports she does are cycling (she obtained the cycling Audax) and ice skating. On 1 June 1907 she finished second in the 60 metre event at the Gare swimming pool behind Alice Sadoux. The next day she finished second in the 100 metres event at the \"Fête du Devoir\" in Rouen, again behind Alice Sadoux. On 28 July 1907 she participated in the international 200 metre event and the international 60 metre handicap event in Joinville-le-Pont. At this event also some national events were held and she finished fourth in the national 100 metre event and she competed in the diving event. On 9 August she competed in the , an open water race over 5 kilometres in Toulouse. She finished fourth in a time of 1 hour 32:15 minutes. She was expected to take part in the Six Hours race on 25 August, but she did not take part because she had no intention to become a professional swimmer. In 1908 she participated at the , an open water race in Lyon and she finished fifth in the 100 metre event during the international swimming competition in Joinville-le-Pont. After competing in 1909 at the national championships in Amiens (11 July) and at the swimming competitions in Calais (14 July), she competed at a main international competition on 15 July. In this competition she finished third in the 100 metre event. On 25 December 1912 she was the only women who competes at the . She finished in last place in the 150 metres in a time of 2:29. The same day she was ill and from the doctor she had to stop temporarily all her sporting activities. In January 1913 she was on the cover of sport magazine Le Plein Air. Later in in 1913 she obtained her swimming Audax. ==Sport administration== Morrier was club secretary of Ondine de Paris for six years. She was the first elected of the Union des Sociétés Françaises de Sports Athlétiques USFSA. In 1928, she headed the swimming section of the Société des Cadettes de Gascogne, which she founded in 1921. She was elected to a committee of the FFNS (school board) and the Fédération féminine française de gymnastique et d'éducation physique (FFSF). In 1931, she chaired the swimming section of the Association sportive des postes, télégraphes et téléphones (ASPTT). ==Personal life== Mortier was born in 1888. She lived in the 12th arrondissement of Paris (56, Rue de Wattignies). She was candidate in the 1910 legislative elections of Paris. Morter worked at the French Post. She earned 2200 francs per year (1910). Later she worked as a guard at Élysée in the 1920s. She maried to a municipal employee who was also a fencer, swimmer and gymnast. Her daughter was Olympic swimmer Gilberte Mortier. ==References== ==Other websites== *Image of Mortier (1912) *Mortier at the cover of Le Plein Air (1913) Category:Swimmers from Paris Category:French divers Category:Sportswomen Category:1886 births Category:Year of death missing Category:French sport administrators",
 "title": "Renée Mortier"
}