{
 "id": "978467",
 "text": "John Bouvier Kennedy Schlossberg (born January 19, 1993) is an American writer and political correspondent. Since 2024, he has been a political correspondent for Vogue. He is the only grandson of John F. Kennedy, the 35th U.S. president and First Lady Jacqueline Kennedy Onassis. Schlossberg is also the third child and only son of former U.S. ambassador Caroline Kennedy and Edwin Schlossberg. == Biography == === Early life and education === John Bouvier Kennedy Schlossberg was born in New York City on January 19, 1993. Heis the youngest of three children of designer Edwin Schlossberg and diplomat Caroline Kennedy. He is named after his maternal grandfather, the 35th U.S. president John F. Kennedy, and maternal great-grandfather, the Wall Street stockbroker John Vernou Bouvier III. He has two older sisters, Rose and Tatiana, who were primarily raised in Manhattan's Upper East Side. At times, they have spent significant time at the Martha's Vineyard estate of their maternal grandmother, Jackie, while growing up. During the summers, he worked on a charter fishing boat. He also played in baseball and basketball leagues in Manhattan. Schlossberg attended Collegiate School. In eighth grade, he co- founded ReLight New York, a nonprofit organization that installed energy- efficient fluorescent lights in low-income housing developments. A member of the Young Democrats club in high school, he organized a trip to canvass for Barack Obama's campaign in Pennsylvania. In 2010, Schlossberg worked in Washington, D.C. as a senate intern. He then attended Yale University graduating in 2015 with a degree in history, with a focus on Japanese history. While at Yale, Schlossberg was known to perform stand-up comedy, was a member of the Sigma Phi Epsilon fraternity, and wrote for the Yale Daily News, and the Yale Herald where he was an editor-in-chief. He also trained and worked as a volunteer EMT in New Haven, Connecticut, and as environmental technician, cleaning out oil tanks and cleaning up spills around Boston. Schlossberg lived and worked in Japan before enrolling at Harvard University where he graduated from the joint JDJuris–MBA program at Harvard Law School and Harvard Business School in 2022 and he passed the New York State bar exam. === Career === Since 2011, Schlossberg has written for many publications and news outlets, including Time, The Washington Post, New York Magazine, Politico, and CNN. He has also written op-eds for The New York Times, USA Today, and HuffPost. He began working for Vogue as a political correspondent in 2024 after graduating from Harvard Law School and passing the bar exam. He served as chair of the selection committee of the John F. Kennedy Presidential Library and Museum for the New Frontier Award until its last and 20th ceremony in 2023. Schlossberg has also served as event host, presenter and member of the annual Profile in Courage Award selection committee. === Politics === In August 2020, Schlossberg gave a virtual address on the second night of the 2020 Democratic National Convention with his mother, Caroline, and endorsed then-former vice president Joe Biden. Schlossberg gave his first in-person speech on the second night of the 2024 Democratic National Convention where he endorsed Kamala Harris. == References == Category:1993 births Category:Kennedy family Category:Living people Category:Lawyers from New York City Category:Writers from New York City Category:Democrats (United States)",
 "title": "Jack Schlossberg"
}