{
 "id": "978671",
 "text": "Experimental rock (or avant-rock) is a subgenre of rock music. ==Overview== Experimental rock pushes the boundaries of common composition and performance technique or which experiments with the basic elements of the genre. Artists aim to liberate and innovate, with some of the genre's distinguishing characteristics being improvisational performances, avant-garde influences, odd instrumentation, opaque lyrics (or instrumentals), unorthodox structures and rhythms, and an underlying rejection of commercial aspirations. ==History== There was always experimentation in rock music, but it was not until the late 1960s that new openings were created from the aesthetic intersecting with the social. In 1966, the boundaries between pop music and the avant-garde began to blur, and rock albums began to be conceived and executed as distinct, extended statements. Rock musicians (mostly unschooled) in the middle and late 1960s drew from the work of composers like John Cage, Karlheinz Stockhausen, and Luciano Berio. Academic Bill Martin acknowledges: \"in the case of imitative painters, what came out was almost always merely derivative, whereas in the case of rock music, the result could be quite original, because assimilation, synthesis, and imitation are integral parts of the language of rock.\" Martin argued that the advancing technology of multitrack recording and mixing boards were more influential to experimental rock than electronic instruments such as the synthesizer. He allowed the Beatles and the Beach Boys to become the first crop of non-classically trained musicians to create extended and complex compositions. Drawing from the influence of the Beach Boys' Brian Wilson and the Beatles' George Martin, music producers after the mid 1960s began to view the recording studio as a musical instrument used to aid the process of composition. When the Beach Boys' Pet Sounds (1966) was released to a four-month chart stay in the British Top 10, many British groups responded to the album by making more experimental use of recording studio techniques. In the late 1960s, groups such as the Mothers of Invention, the Velvet Underground, the Fugs, the Beatles, and the Jimi Hendrix Experience began incorporating elements such as avant-garde music, sound collage, and poetry in their work. Author Doyle Greene identifies the Beatles, Frank Zappa, the Velvet Underground, Plastic Ono Band, Captain Beefheart, and Nico as \"pioneers of avant-rock\", though also noted \"proto- prog\" bands such as Pink Floyd and the Soft Machine as an influence. In addition, The Quietus Ben Graham described duos the Silver Apples and Suicide as antecedents of avant-rock. ==Related pages== * Pop rock * Soft rock * Indie rock * Alternative rock ==Notes== ==References== Category:Rock music",
 "title": "Experimental rock"
}