{
 "id": "978670",
 "text": "Industrial music is a music genre. It describes a wide range of bands generally mixing rock with samplers and electronic instruments. Taking its name from a record label, Industrial records, which was formed by the London band Throbbing Gristle and Monte Cazazza. The roots of industrial music are firmly placed in punk rock, although the choice of instrumentation differs from the guitar/bass/drum combo of bands like the Sex Pistols. The first wave of this music appeared in the late 1970s in the United Kingdom with bands. These are like the afore mentioned Throbbing Gristle, Cabaret Voltaire and SPK. Blending electronic synthesisers, guitars and early samplers, these bands created an aggressive and abrasive music fusing elements of rock with experimental electronic music. Like their punk cousins, they enjoyed the use of shock-tactics including explicit lyrical content, graphic art and Fascist imagery. The label Industrial Records controversially used an image of a gas chamber. That was in its logo. Across the Atlantic, similar experiments were taking place. Boyd Rice (aka NON) released several albums of noise music. That was with guitar drones and tape loops creating a cacophony of repetitive sounds. In San Francisco, performance artist Monte Cazazza began releasing albums of atonal rock. In Germany Einstürzende Neubauten were performing acts daring, mixing metal percussion, guitars and even jackhammers in elaborate stage performances. They often damaged the venues they were playing. In the early 1980s advances in sampling technology, and the popularity of synthesised new wave music bought some industrial musicians greater exposure. As much as some new wave bands were informed by the experiments of the industrial bands, the original industrial groups also began to refine their sound. Cabaret Voltaire and Throbbing Gristle experimented with dance beats, and the Cab's (as they were known by fans) album The Crackdown (1983) was released on Virgin Records to some success. Into the 1980s the more experimental side of industrial music became subsumed into dance and rock music. Psychic TV, formed from the remnants of Throbbing Gristle released early albums of acid house music, like Jack The Tab (1988). In America, bands such as Skinny Puppy and Ministry, mixed shock-rock performances with electronic samples and heavy metal guitars and created a genre. It was often referred to as \"industrial rock\". Other notable artists in this genre enjoyed widespread mainstream success in the 1990s. These included but were not limited to Nine Inch Nails, Marilyn Manson and Fear Factory. == Related pages == * Experimental music * Steampunk == References ==",
 "title": "Industrial music"
}