{
 "id": "978641",
 "text": "Marianne Muszerak-Jouvenel also written as Marie Anne Jouvenel and Mayanne Jouvenel (21 December 1924 — 7 February 2012) was a French swimmer. She was specialized in the freestyle. She was a member of Mouettes de Paris. She was French national champion in the 100 metre freestyle in 1941, 1942 and 1943. She was also national champion in the 400 metre freestyle in 1941, 1942, 1943 and 1944. She was awarded the gold medal of the French Swimming Federation in 1976. ==Biography== She started swimming in 1927 after her mother found out about the collective lessons of Mouettes de Paris. In July 1929 she obtained her school swimming certificate. When she was thirteen years old she swam every day in the summer and three times per week in the winter in the Lutetia swimming pool. In addition to swimming she also did stretching exercises, cycling and skiing. She had classical opera dance classes by professor Paul Raymond. In 1939 she won the 4 x 100 metres relay with her team. She finished third in the 400 metre freestyle. In early 1941, she had measles. On 1 June at Pentecost, she fell off her bicycle and seriously injured her knee. At the 1941 national swimming championships in September she became for the first time national champion. She won the 100 metre freestyle in a time of 1:14 and also the 400 metre freestyle in a time of 5:55.4. On 6 October she broke the French 200m freestyle record with a time of 2:39.5 she swam in Marseille. In August 1942 she became for the second time French national champion in both the 100 metre freestyle (in 1:13.7) and 400 metre freestyle (in 6:07.4) On 2 September she broke the French 400 metre freestyle record with a time of 5:44.6 she swam in Marseille. In August 1943 she became for the third time national champion in the 400 metre freestyle in a time of 6.02 and in August 1944 she became for the fourth time national champion in the 400 metre freestyle in 6:02. She became that year also for the third time national champion in the 100 metre freestyle in 6:00.2. ==Personal life== Jouvenel was born on 21 December 1924 Beaumont-sur-Oise. She was the daughter of a physical teacher at professional and technical schools in Paris. They had a large wolf- dog named Dick. He was secretary of the Mouettes de Paris club in 1944. He married to M. Billy after World War II. Jouvenel lived in the 15th arrondissement of Paris (94, rue Baland) until the 1940s. In the summer she went during holidays to Méziard, a hamlet in the department of Eure. During the Christmas holidays she went to Saint Gervais or Les Houches in Chamonix. ==References== Category:French swimmers Category:Sportswomen Category:1924 births Category:2012 deaths Category:People from Val-d'Oise Category:Sportspeople from Île-de-France",
 "title": "Marianne Jouvenel"
}