{
 "id": "978702",
 "text": "679 games were released for the TurboGrafx-16 from October 10, 1987 to June 3, 1999. It is a home video game console made by NEC, released in Japan on October 10, 1987 as the PC Engine and North America on August 29, 1989 as the TurboGrafx-16. 121 games were released in both regions, 18 games only in North America and the other 540 games only in Japan. Games came on HuCards (also known as TurboChips) and CD-ROM (CD-ROM², Super CD-ROM², and Arcade CD-ROM²). 5 HuCards only work on the PC Engine SuperGrafx. 389 games came on CD-ROM, of which 54 were released in North America. Some games have improvements on newer hardware, such as shorter loading times. 213 games support multiplayer using the Turbotap, of which 51 were released in North America. PC Engine format guide Format Description HuCard Works on all systems. SuperGrafx Only works on the PC Engine SuperGrafx. CD-ROM² Works on all CD-ROM² Systems. Super CD-ROM² Works on the Super CD-ROM² System or CD-ROM² System with Super System Card. Arcade CD-ROM² Works on the Super CD-ROM² System with Arcade Card Duo or CD- ROM² System with Arcade Card Pro. ==List of games== Main title Distributor Release Date Format Japan North America 1552: Tenka Tairan ASK Kodansha Super CD-ROM² 1941: Counter Attack Hudson Soft HuCard (SuperGrafx) 1943 Kai Naxat Soft HuCard 21 Emon: Mezase! Hotel Ō NEC Home Electronics HuCard Sazan Eyes: Sanjiyan Henjō NEC Home Electronics Arcade CD-ROM² A-Densha de Ikō III Artdink Super CD-ROM² Addams Family, The NEC Electronic Gaming Monthly #28, pg. 33 CD- ROM² Advanced V.G. TTI (US) TGL (JP) Super CD-ROM² Adventure Quiz: Capcom World / Hatena no Daibōken Hudson Soft Super CD-ROM² Aero Blasters NEC (US) Hudson Soft (JP) Electronic Gaming Monthly #18, pg. 26 HuCard After Burner II NEC Avenue HuCard Ai Cho Aniki Masaya Super CD-ROM² Air Zonk •PC DenjinJP TTI (US) Hudson Soft (JP) Electronic Gaming Monthly #39, pg. 41 HuCard Akiyama Jin no Sūgaku Mystery NHK Super CD-ROM² Aldynes Hudson Soft HuCard (SuperGrafx) Alien Crush NEC (US) Naxat Soft (JP) HuCard Alshark Victor Entertainment Super CD-ROM² Alzadick Naxat Soft CD-ROM² Ane-san NEC Avenue Super CD-ROM² Aoi Blink Hudson Soft HuCard Aoki Ōkami to Shiroki Mejika: Genchō Hishi Koei Super CD-ROM² Appare! Gateball Hudson Soft HuCard Astralius IGS CD-ROM² Asuka 120% Maxima NEC Avenue Super CD-ROM² The Atlas Artdink Super CD-ROM² Atomic Robo-Kid Special UPL HuCard Aurora Quest: Otaku no Seiza in Another World Pack-In-Video Super CD- ROM² Auto Crusher Palladium Pack-In-Video Super CD-ROM² Avenger Telenet Japan CD-ROM² Andre Panza Kick Boxing NEC Electronic Gaming Monthly #29, pg. 29 HuCardUS Super CD-ROM²JP Babel Telenet Japan Super CD-ROM² Baby Jo the Superhero Micro World Super CD-ROM² Bakuchō Yoshimoto Shinkigeki Hudson Soft Super CD-ROM² Bakuden: Unbalanced Zone Sony Music Entertainment Super CD-ROM² Ballistix NEC (US) Coconuts Japan (JP) Electronic Gaming Monthly #34, pg. 35 HuCard Bari Bari Densetsu Taito HuCard Barunba Namco HuCard Basted NEC Avenue Super CD-ROM² Batman Sunsoft HuCard Battle Ace Hudson Soft HuCard (SuperGrafx) Battle Field '94 in Tokyo Dome Fujicom Arcade CD-ROM² Battle Lode Runner Hudson Soft HuCard Battle Royale NEC HuCard Bazar dé Gozarre no Game de Gozāru NEC Home Electronics Super CD-ROM² Benkei Gaiden Sunsoft HuCard Beyond Shadowgate TTI Super CD-ROM² Bikkuriman Daijikai Hudson Soft CD-ROM² Bikkuriman World Hudson Soft HuCard Bishōjo Senshi Sailor Moon Banpresto Super CD-ROM² Bishōjo Senshi Sailor Moon Collection Banpresto Super CD-ROM² Black Hole Assault Micronet Super CD-ROM² Blazing Lazers •GunhedJP NEC (US) Hudson Soft (JP) Computer Entertainer, Vol.8 Num. 10, January 1990, pgs. 8-9, 23 HuCard Blood Gear Hudson Soft Super CD-ROM² Bloody Wolf •Narazumono Sentō Butai Bloody WolfJP NEC (US) Data East (JP) HuCard Bomberman NEC (US) Hudson Soft (JP) Electronic Gaming Monthly #21, pg. 29 HuCard Bomberman '93 TTI (US) Hudson Soft (JP) 1993 HuCard Bomberman '94 Hudson Soft HuCard Bomberman Users Battle Hudson Soft HuCard Bonanza Bros. NEC Avenue Super CD-ROM² Bonk's Adventure •PC GenjinJP NEC (US) Hudson Soft (JP) HuCard Bonk's Revenge •PC Genjin 2JP NEC (US) Hudson Soft (JP) HuCard Bonk 3: Bonk's Big Adventure •PC Genjin 3JP TTI (US) Hudson Soft (JP) HuCard Bonk 3: Bonk's Big Adventure CD TTI Super CD-ROM² Bouken Danshaku Don Sun=Heart-hen I'Max HuCard Boxyboy •Sōkoban WorldJP NEC (US) Media Rings (JP) 1990 HuCard Brandish NEC Home Electronics Arcade CD-ROM² Bravoman •Chōzetsurin-jin BerabōmanJP NEC (US) Namco (JP) HuCard Break In Naxat Soft HuCard Browning Telenet Japan Super CD- ROM² Bubblegum Crash Naxat Soft HuCard Builder Land Micro World Super CD-ROM² Bullfight Ring no Hasha Cream HuCard Burai Riverhillsoft CD-ROM² Burai II Riverhillsoft Super CD-ROM² Burning Angels Naxat Soft HuCard Buster Bros. •Pomping WorldJP TTI (US) Hudson Soft (JP) Electronic Gaming Monthly #42, pg. 43 CD-ROM² Cadash Working Designs (US) Taito (JP) HuCard CAL II NEC Avenue Super CD-ROM² Cal III NEC Avenue Super CD-ROM² Camp California TTI Super CD-ROM² Card Angels Fujicom Super CD-ROM² Akumajō Dracula X: Chi no Rondo Konami Super CD-ROM² CD Battle: Hikari no Yūshatachi King Records Super CD-ROM² Champion Wrestler Taito HuCard Champions Forever NEC Electronic Gaming Monthly #27, pg. 27 HuCard Championship Rally TTI (US) Intec (JP) Super CD-ROM² Chase H.Q. •Taito Chase HQJP TTI (US) Taito (JP) Electronic Gaming Monthly #40, pg. 37 HuCard Chew Man Fu •Be BallJP NEC (US) Hudson Soft (JP) 1990 HuCard Chibi Maruko-chan: Quiz de Piihira Namco HuCard Chiki Chiki Boys NEC Avenue Super CD-ROM² Chikuden-ya Toubei Naxat Soft HuCard China Warrior •The Kung FuJP NEC (US) Hudson Soft (JP) HuCard Cho Aniki Masaya Super CD-ROM² Chō Jikū Yōsai Macross: Eien no Love Song Masaya Super CD-ROM² Chō Jikū Yōsai Macross 2036 Masaya CD-ROM² Circus Lido Uni Post Company Ltd HuCard City Hunter Sunsoft HuCard Cobra: Kokuryū-Ō no Densetsu Hudson Soft CD-ROM² Cobra II: Densetsu no Otoko Hudson Soft CD-ROM² Color Wars Coconuts Japan CD-ROM² Columns Telenet Japan HuCard Coryoon Naxat Soft HuCard Cosmic Fantasy 2 •Cosmic Fantasy 2: Bōken Shōnen VanJP Working Designs (US) Telenet Japan (JP) Electronic Gaming Monthly #35, pg. 41 CD-ROM² Cosmic Fantasy 3: Bōken Shōnen Rei Telenet Japan Super CD-ROM² Cosmic Fantasy 4: Ginga Shōnen Densetsu: Gekitouhen Telenet Japan Super CD-ROM² Cosmic Fantasy 4: Ginga Shōnen Densetsu: Totsunyūhen Telenet Japan Super CD-ROM² Cosmic Fantasy: Bōken Shōnen Yū Telenet Japan CD-ROM² Cotton: Fantastic Night Dreams •CottonJP TTI (US) Hudson Soft (JP) Super CD-ROM² Cratermaze •Doraemon: Meikyū DaisakusenJP NEC (US) Hudson Soft (JP) HuCard Cross Wiber: Cyber Combat Police Face HuCard Cyber City Oedo: Kemono no Alignment Masaya CD-ROM² Cyber Core NEC (US) IGS (JP) HuCard Cyber Cross Face HuCard Cyber Dodge Tonkin House HuCard Cyber Knight Tonkin House HuCard Dai Makaimura NEC Avenue HuCard (SuperGrafx) Daichikun Crisis Salio HuCard Daisenpū Custom NEC Avenue CD-ROM² Daisenpuu NEC Avenue HuCard Daisenryaku II: Campaign Version Micro Cabin Super CD-ROM² Darius Alpha NEC Avenue HuCard (PC-SG) Darius Plus NEC Avenue HuCard (PC-SG) Darkwing Duck TTI Electronic Gaming Monthly #30, pg. 33 HuCard Davis Cup Tennis NEC HuCard Davis Cup Tennis, The (CD) Micro World CD-ROM² Dead Moon TTI (US) T.T.S (JP) HuCard Dead of the Brain 1 & 2 NEC Home Electronics Super CD-ROM² Death Bringer Telenet Japan CD-ROM² Deep Blue •Deep Blue: Kaitei ShinwaJP NEC (US) Pack-In-Video (JP) HuCard Deko Boko Densetsu Telenet Japan CD-ROM² Dennō Tenshi: Digital Angel Tokuma Shoten Intermedia Super CD-ROM² Detana!! TwinBee Konami HuCard Devil's Crush •Devil CrashJP NEC (US) Naxat Soft (JP) HuCard DE.JA NEC Interchannel Super CD-ROM² Die Hard Pack-In- Video (distribution) Nihon Bussan HuCard Digital Champ: Battle Boxing Naxat Soft HuCard Digital Comic Patlabor: Chapter of Griffon Riverhillsoft Super CD-ROM² Dōkyūsei NEC Avenue Super CD-ROM² Don Doko Don Taito HuCard Doraemon: Nobita no Dorabian Night Hudson Soft HuCard Doraemon: Nobita no Dorabian Night (CD) Hudson Soft Super CD-ROM² Double Dragon II: The Revenge NEC (US) Naxat Soft (JP) Super CD-ROM² Double Dungeons NEC (US) Masaya (JP) HuCard Double Ring •W-Ring: The Double RingsJP Naxat Soft HuCard Download NEC Avenue HuCard Download 2 NEC Avenue CD-ROM² Downtown Nekketsu Kōshinkyoku Naxat Soft Super CD-ROM² Downtown Nekketsu Monogatari Naxat Soft Super CD-ROM² Dragon Ball Z: Idainaru Son Goku Densetsu Bandai Super CD-ROM² Dragon EGG! Masaya HuCard Dragon Half Micro Cabin Super CD-ROM² Dragon Knight & Graffiti NEC Avenue Super CD-ROM² Dragon Knight II NEC Avenue Super CD-ROM² Dragon Knight III NEC Avenue Super CD-ROM² Dragon Saber Namco HuCard Dragon Slayer: The Legend of Heroes •Dragon Slayer: Eiyū DensetsuJP TTI (US) Hudson Soft (JP) Super CD-ROM² Dragon Slayer: The Legend of Heroes II Hudson Soft Super CD-ROM² Dragon Spirit NEC (US) Namco (JP) HuCard Dragon's Curse •Adventure IslandJP NEC (US) Hudson Soft (JP) HuCard Drop Off •Drop Rock Hora HoraJP NEC (US) Data East (JP) 1990 HuCard Dungeons & Dragons: Order of the Griffon TTI HuCard Dungeon Explorer NEC (US) Hudson Soft (JP) HuCard Dungeon Explorer II TTI (US) Hudson Soft (JP) Super CD-ROM² Dungeon Master •Dungeon Master: Theron's QuestJP TTI (US) Hudson Soft (JP) 1993 Super CD-ROM² Dynastic Hero, The •Chō Eiyū Densetsu Dynastic HeroJP TTI (US) Hudson Soft (JP) Super CD-ROM² Efera and Jiliora: The Emblem from Darkness Brain Grey CD-ROM² Eikan wa Kimi ni Artdink Arcade CD-ROM² Eiyū Saigokushi Irem Super CD-ROM² Emerald Dragon NEC Home Electronics Super CD-ROM² Energy Masaya HuCard Exile Working Designs (US) Telenet Japan (JP) CD-ROM² Exile: Wicked Phenomenon •Exile IIJP Working Designs (US) Telenet Japan (JP) Super CD-ROM² F-1 Dream NEC Avenue HuCard F-1 Pilot Pack- In-Video HuCard F1 Circus Nihon Bussan HuCard F1 Circus '91 Nihon Bussan HuCard F-1 CIRCUS'92 Nihon Bussan HuCard F1 Circus Special Nihon Bussan Super CD-ROM² F1 Team Simulation Project F Telenet Japan Super CD-ROM² F1 Triple Battle Human HuCard Faceball Riverhillsoft Super CD-ROM² Falcon TTI 1992 HuCard Fang of Alnam Right Stuff Super CD-ROM² Fantasy Zone NEC (US) NEC Avenue (JP) HuCard Farjius no Jakōtei Human Entertainment Super CD-ROM² Faussete Amour Naxat Soft Super CD-ROM² Fiend Hunter Right Stuff Super CD-ROM² Fighting Run Nihon Bussan HuCard Fighting Street NEC (US) Hudson Soft (JP) CD-ROM² Final Blaster Namco HuCard Final Lap Twin NEC (US) Namco (JP) HuCard Final Match Tennis Human HuCard Final Soldier Hudson Soft HuCard Final Zone II NEC (US) Telenet Japan (JP) CD-ROM² Fire Pro Joshi: Shōmu Chōjo Taisen: Zenjo vs. JWP Human Entertainment Arcade CD-ROM² Fire Pro Wrestling 2nd Bout Human HuCard Fire Pro Wrestling 3 Legend Bout Human Entertainment HuCard Fire Pro Wrestling Combination Tag Human HuCard Flash Hiders TTI (US) Right Stuff (JP) Super CD-ROM² Forgotten Worlds TTI (US) NEC Avenue (JP) Super CD-ROM² Formation Armed F Pack-In-Video HuCard Formation Soccer Human HuCard Formation Soccer '95 della Seria A Human Entertainment Arcade CD-ROM² Formation Soccer on J-League Human Entertainment HuCard World Circuit Namco HuCard Fray CD: Xak Gaiden Micro Cabin Super CD- ROM² Fushigi no Yume no Alice Face HuCard Gaia no Monshou Masaya HuCard Gaiflame Masaya HuCard Gain Ground SX NEC Avenue Super CD-ROM² Galaga '90 •Galaga '88JP NEC (US) Namco (JP) HuCard Galaxy Deka Gayvan Intec Super CD-ROM² Galaxy Fräulein Yuna Hudson Soft Super CD-ROM² Galaxy Fräulein Yuna 2 Hudson Soft Super CD-ROM² Ganbare! Golf Boys Masaya HuCard Garō Densetsu 2 Hudson Soft Arcade CD-ROM² Garō Densetsu Special Hudson Soft Arcade CD-ROM² Gate of Thunder TTI (US) Hudson Soft (JP) Super CD-ROM² Gekisha Boy Irem HuCard Genji Tsūshin Agedama NEC Home Electronics HuCard Genocide Brain Gray Super CD-ROM² Genpei Tōma Den Namco HuCard Gensō Tairiku Auleria Taito CD-ROM² Ghost Manor TTI HuCard Ghost Sweeper Mikami Banpresto Super CD-ROM² Ginga Fukei Densetsu Sapphire Hudson Soft Arcade CD-ROM² Go! Go! Birdie Chance NEC Home Electronics Super CD-ROM² God Panic: Shijō Saikyō Gundan Teichiku Super CD-ROM² Godzilla •Gojira: Bakutō RetsudenJP TTI (US) Toho (JP) 1993 Super CD-ROM² Gokuraku! Chuuka Daisen Taito HuCard Golden Axe Telenet Japan CD-ROM² Gomola Speed UPL HuCard Götzendiener NEC Home Electronics Super CD-ROM² Gradius Konami HuCard Gradius II Konami Super CD- ROM² Sotsugyō II Riverhillsoft Super CD-ROM² Gulclight TDF-2 Pack-In-Video CD- ROM² Gulliver Boy Hudson Soft Super CD-ROM² Gunboat NEC HuCard Gyuwanburā Jiko Chūshin Ha: Gekitō Sanjūroku Janshi Hudson Soft CD-ROM² Gyuwanburā Jiko Chūshin Ha: Mahjong Puzzle Collection Taito CD-ROM² Hanataa ka daka!? Taito HuCard Hataraku Shōjo: Tekipaki Working Love NEC Home Electronics Super CD- ROM² Hatris Micro Cabin HuCard Hatsukoi Monogatari Tokuma Shoten Intermedia Super CD-ROM² Hawk F-123 Pack-In-Video Super CD-ROM² Heavy Unit Taito HuCard Hellfire S NEC Avenue CD-ROM² High Grenadier Telenet Japan CD-ROM² Hihō Densetsu: Chris no Bōken Pack-In-Video CD-ROM² Himitsu no Hanazono Tokuma Shoten Intermedia Super CD-ROM² Hisou Kihei Kai-Serd Masaya HuCard Hit the Ice TTI (US) Taito (JP) HuCard Honey in the Sky Face HuCard Honey on the Road Face HuCard Honō no Dōkyūji: Dodge Danpei Hudson Soft HuCard Horror Story NEC Avenue Super CD-ROM² Human Sports Festival Human Super CD-ROM² Hyakumonogatari: Honto ni Atta Kowai Hanashi Hudson Soft Super CD-ROM² Hyper Wars Hudson Soft Super CD- ROM² I.Q. Panic IGS CD-ROM² Iga Ninden Gaiō Nihon Bussan Super CD-ROM² Image Fight Irem HuCard Image Fight II Irem Super CD-ROM² Impossamole NEC HuCard It Came From The Desert NEC CD-ROM² J-League Greatest Eleven Nihon Bussan HuCard Jack Nicklaus' Turbo Golf •Jack Nicklaus Championship GolfJP Accolade (US) Victor Musical Industries (JP) 1990 HuCard Jack Nicklaus' Turbo Golf •Jack Nicklaus' World Golf TourJP Accolade (US) Victor Musical Industries (JP) CD-ROM² Jackie Chan's Action Kung Fu •Jackie ChanJP TTI (US) Hudson Soft (JP) Electronic Gaming Monthly #37, pg. 31 HuCard Janshin Densetsu: Quest of Jongmaster NEC Home Electronics Arcade CD-ROM² Jantei Monogatari Telenet Japan CD-ROM² Jantei Monogatari 2: Uchū Tantei Diban: Kanketsu Hen Atlus CD-ROM² Jantei Monogatari 2: Uchū Tantei Diban: Shutsudō Hen Atlus CD-ROM² Jantei Monogatari 3: Saver Angels Atlus Super CD-ROM² Jaseiken Necromancer Hudson Soft HuCard Jigoku Meguri Taito HuCard Jim Power Micro World Super CD-ROM² Jinmu Denshō Yaksa Big Club HuCard John Madden Duo CD-ROM² Football TTI 1993 Super CD-ROM² Jūōki NEC Avenue CD-ROM² Jūōki NEC Avenue HuCard J. League Tremendous Soccer '94 NEC Home Electronics Arcade CD- ROM² J.B. Harold Murder Club NEC (US) Hudson Soft (JP) CD-ROM² J.J. & Jeff •Kato-chan Ken-chanJP NEC (US) Hudson Soft (JP) HuCard Kabuki Ittō Ryōdan Hudson Soft Arcade CD-ROM² Kagami no Kuni no Legend Victor Musical Industries CD-ROM² Kaizō Chōjin Shubibinman Masaya HuCard Kaizō Chōjin Shubibinman 3: Ikai no Princess Masaya CD-ROM² Kakuto Haō Densetsu Algunos Intec Super CD-ROM² Kattobi! Takuhai-Kun Tonkin House HuCard Kawa no Nushizuri: Shizenha Pack-In-Video CD-ROM² Kaze Kiri Naxat Soft Super CD-ROM² Keith Courage in Alpha Zones •Mashin Eiyuuden WataruJP NEC (US) Hudson Soft (JP) HuCard Kiaidan 00 Telenet Japan Super CD-ROM² Kick Boxing, The Micro World Super CD-ROM²JP Kickball Masaya HuCard KiKi KaiKai Taito HuCard King Of Casino NEC (US) Victor Musical Industries (JP) 1990 HuCard Kisō Louga Kogado Studio Super CD- ROM² Klax Tengen 1990 HuCard Knight Rider Special Pack-In-Video HuCard Kore ga Pro Yakyū '89 Intec HuCard Kore ga Pro Yakyuu '90 Intec HuCard Kyūkyoku Tiger Taito HuCard K.O. Seiki Beast Sanjūshi Pack-In-Video Super CD-ROM² L-Dis Masaya CD-ROM² La Valeur Kogado Studio CD-ROM² Lady Phantom Telenet Japan Super CD-ROM² Langrisser: Hikari no Matsuei Masaya Super CD-ROM² Laplace no Ma Human Entertainment Super CD-ROM² Last Alert •Red AlertJP NEC (US) Telenet Japan (JP) CD-ROM² Last Armageddon Brain Grey CD-ROM² Legend of Hero Tonma TTI (US) Irem (JP) 1993 HuCard Legend of Xanadu, The NEC Home Electronics Super CD-ROM² Legend of Xanadu II, The Nihon Falcom Super CD-ROM² Legendary Axe, The •Makyō DensetsuJP NEC (US) Victor Musical Industries (JP) HuCard Legendary Axe II, The •Ankoku DensetsuJP NEC (US) Victor Musical Industries (JP) HuCard Legion Telenet Japan CD-ROM² Lemmings Sunsoft Super CD-ROM² Linda³ NEC Home Electronics Arcade CD-ROM² Lode Runner: Ushina Wareta Meikyū Pack-In-Video HuCard Loom TTI (US) Victor Musical Industries (JP) Super CD-ROM² Lord of Wars SystemSoft CD-ROM² Lords of the Rising Sun •Rising SunJP NEC (US) Victor Musical Industries (JP) Electronic Gaming Monthly #36, pg. 29 CD-ROM² Lords of Thunder •Winds of ThunderJP TTI (US) Hudson Soft (JP) 1993 Super CD-ROM² Louga II: The Ends of Shangrila NEC Home Electronics Super CD-ROM² Mad Stalker: Full Metal Force NEC Home Electronics Arcade CD-ROM² Madō King Granzort Hudson Soft HuCard (SuperGrafx) Madō Monogatari I NEC Avenue Arcade CD-ROM² Magical Chase TTI (US) Palsoft (JP) 1993 HuCard Magical Dinosaur Tour •Magical Saurus TourJP NEC (US) Victor Musical Industries (JP) CD-ROM² Magicoal NEC Home Electronics Super CD- ROM² Mahjong Clinic Special Naxat Soft Super CD-ROM² Mahjong Gakuen - Tōma Sōhirō Tōjō Face HuCard Mahjong Gakuen Mild Face HuCard Mahjong Gokū Special Sunsoft HuCard Mahjong Haōden: Kaiser's Quest UPL HuCard Mahjong Lemon Angel Naxat Soft Super CD-ROM² Mahjong on the Beach NEC Avenue Super CD-ROM² Mahjong Shikaku Retsuden: Mahjong Wars Nihon Bussan HuCard Mahjong Sword Princess Quest Gaiden Naxat Soft Arcade CD-ROM² Maison Ikkoku Micro Cabin HuCard Makai Hakkenden Shada Data East HuCard Makai Prince Dorabocchan Naxat Soft HuCard Inoue Mami: Kono Hoshi ni Tatta Hitori no Kimi Hudson Soft Super CD-ROM² Mamono Hunter Yōko: Makai Kara no Tenkōsai Masaya Super CD-ROM² Mamono Hunter Yōko: Tooki Yobikoe Masaya Super CD-ROM² The Manhole Sunsoft CD-ROM² Maniac Pro Wrestling Hudson Soft HuCard Märchen Maze Namco HuCard Martial Champion Konami Super CD-ROM² Master of Monsters Micro Cabin CD-ROM² Megami Paradise NEC Home Electronics Super CD-ROM² Meikyū no Elfine Telenet Japan CD-ROM² Metal Angel Pack-In-Video Super CD-ROM² Metal Angel 2 Pack-In-Video Super CD- ROM² Metal Stoker Face HuCard MetamorJupiter NEC Home Electronics Super CD- ROM² Might & Magic NEC Avenue CD-ROM² Might and Magic III: Isles of Terra TTI (US) Hudson Soft (JP) 1993 Super CD-ROM² Military Madness •NectarisJP NEC (US) Hudson Soft (JP) HuCard Minesweeper Pack-In-Video CD-ROM² Mirai Shōnen Conan Telenet Japan Super CD-ROM² Mitsubachi Gakuen Hudson Soft CD-ROM² Mizubaku Daibouken Taito HuCard Momotaro Densetsu Gaiden Dai Ichi Shu Hudson Soft HuCard Momotarou Densetsu Turbo Hudson Soft HuCard Momotarou Densetsu II Hudson Soft HuCard Momotarō Katsugeki Hudson Soft HuCard Monster Lair •Wonder Boy III: Monster LairJP NEC (US) Hudson Soft (JP) CD-ROM² Monster Maker: Yami no Ryūkishi NEC Avenue Super CD- ROM² Monster Pro Wrestling ASK Kodansha HuCard Moonlight Lady NEC Home Electronics Super CD-ROM² Morita Shogi PC NEC Avenue HuCard Motteke Tamago Naxat Soft Super CD-ROM² Moto Roader NEC (US) Masaya (JP) HuCard Moto Roader II Masaya HuCard Moto Roader MC Masaya Super CD-ROM² Mr Heli no Daibouken Irem HuCard Mystic Formula Micro Cabin Super CD- ROM² Fushigi no Umi no Nadia Hudson Soft Super CD-ROM² Naritore: The Sugoroku '92 Telenet Japan CD-ROM² Naxat Open Naxat Soft HuCard Naxat Stadium Naxat Soft HuCard Nazo no Masquerade Masaya HuCard Necros no Yōsai ASK Kodansha HuCard Nekketsu Kōkō Dodgeball Bu: CD Soccer Hen Naxat Soft Super CD-ROM² Nekketsu Kōkō Dodgeball Bu: PC Soccer Hen Naxat Soft HuCard Nekketsu Kōkō Dodgeball Bu: PC Bangai Hen Naxat Soft HuCard Nekketsu Legend Baseballer Pack- In-Video Super CD-ROM² Nemurenu Yoru Chiisaina Ohanashi NEC Home Electronics Super CD-ROM² Neo Nectaris Hudson Soft Super CD-ROM² Neutopia NEC (US) Hudson Soft (JP) HuCard Neutopia II TTI (US) Hudson Soft (JP) HuCard New Adventure Island •Takahashi Meijin no Shin Bōken JimaJP TTI (US) Hudson Soft (JP) Electronic Gaming Monthly #38, pg. 35 HuCard The NewZealand Story Taito HuCard Nexzr TTI (US) Naxat Soft (JP) Super CD-ROM² Nexzr Special Naxat Soft Super CD-ROM² NHK Taiga Drama Taiheki NHK Vook HuCard Night Creatures NEC HuCard Niko Niko Pun NHK Vook HuCard Ninja Ryūkenden Hudson Soft HuCard Ninja Spirit •Saigo no Nindō: Ninja SpiritJP NEC (US) Irem (JP) HuCard Ninja Warriors Taito HuCard Nishimura Kyōtaro Mystery: Hokutosei no Onna Naxat Soft CD-ROM² No-Ri-Ko Hudson Soft CD-ROM² Nobunaga no Yabō: Bushō Fūunroku Koei Super CD-ROM² Nobunaga no Yabō: Zenkokuban Koei Super CD-ROM² Obocchamakun Namco HuCard Operation Wolf NEC Avenue HuCard Ordyne NEC (US) Namco (JP) HuCard Out Live Sunsoft HuCard Out Run NEC Avenue HuCard OverRide Data East HuCard P-47: The Freedom Fighter Aicom HuCard Pac-Land NEC (US) Namco (JP) HuCard Pachio-kun: Jūban Shōbu Coconuts Japan HuCard Pachio-kun: Maboroshi no Densetsu Coconuts Japan CD-ROM² Pachio-kun: Warau Uchū Coconuts Japan Super CD-ROM² Pachio-kun 3: Pachislot & Pachinko Coconuts Japan Super CD-ROM² Panic Bomber Hudson Soft Super CD-ROM² Parasol Stars: The Story of Bubble Bobble III Working Designs (US) Taito (JP) HuCard Parodius Da! Konami HuCard Pastel Lime Naxat Soft Super CD- ROM² Police Connection Telenet Japan Super CD-ROM² Pop'n Magic Telenet Japan Super CD-ROM² Popful Mail NEC Home Electronics Arcade CD-ROM² Populous Hudson Soft HuCard Populous: The Promised Lands Hudson Soft Super CD-ROM² Power Drift Asmik HuCard Power Eleven Hudson Soft HuCard Power Gate Pack-In-Video HuCard Power Golf NEC (US) Hudson Soft (JP) HuCard Power Golf 2 Hudson Soft Super CD-ROM² Power League II Hudson Soft HuCard Power League III Hudson Soft HuCard Power League 4 Hudson Soft HuCard Power League V Hudson Soft HuCard Power League '93 Hudson Soft HuCard Power Tennis Hudson Soft HuCard Prince of Persia TTI (US) Riverhillsoft (JP) Super CD-ROM² Princess Maker 1 NEC Home Electronics Super CD-ROM² Princess Maker 2 NEC Home Electronics Arcade CD-ROM² Princess Minerva Riverhillsoft Super CD-ROM² Private Eyedol NEC Home Electronics Arcade CD-ROM² The Pro Yakyū Intec CD-ROM² data-sort-value=\"pro yakyū super '94\"The Pro Yakyū Super '94 Intec Super CD-ROM² Pro Yakyuu World Stadium Namco HuCard Pro Yakyuu World Stadium '91 Namco HuCard data-sort-value=\"pro yakyū super\"The Pro Yakyū Super Intec Super CD-ROM² Psychic Detective Series Vol. 3: Aýa Data West Super CD-ROM² Psychic Detective Vol. 4: Orgel Data West Super CD-ROM² Psychic Storm Telenet Japan Super CD-ROM² Psycho Chaser Naxat Soft HuCard Psychosis •ParanoiaJP NEC (US) Naxat Soft (JP) HuCard Puyo Puyo CD NEC Avenue Super CD-ROM² Puyo Puyo CD Tsū NEC Interchannel Super CD-ROM² Puzzle Boy Telenet Japan HuCard Puzznic Taito HuCard Quiz Avenue NEC Avenue CD-ROM² Quiz Avenue II NEC Avenue CD-ROM² Quiz Avenue 3 NEC Avenue Super CD-ROM² Quiz Caravan Cult Q Hudson Soft Super CD- ROM² Quiz de Gakuensai Naxat Soft Super CD-ROM² Quiz Marugoto The World Atlus CD-ROM² Quiz Marugoto The World: Time Machine ni Onegai! Atlus CD-ROM² Quiz no Hoshi Sunsoft Super CD-ROM² Quiz Nobunaga no Yabō Hudson Soft CD-ROM² R-Type NEC HuCard R-Type I Hudson Soft HuCard R-Type II Hudson Soft HuCard R-Type: Complete CD Irem Super CD-ROM² Rabio Lepus Special Video System HuCard Racing Damashii Irem HuCard Raiden NEC (US) Hudson Soft (JP) HuCard Rainbow Islands NEC Avenue CD-ROM² Ranma ½ Masaya CD- ROM² Ranma ½: Datō, Ganso Musabetsu Kakuto Ryū Masaya CD-ROM² Ranma ½: Toraware no Hayanome Masaya CD-ROM² Rastan Saga II Taito HuCard Rayxanber II Data West CD-ROM² Rayxanber III Data West Super CD-ROM² Record of Lodoss War Hudson Soft CD-ROM² Records of Lodoss War II Hudson Soft Super CD-ROM² Renny Blaster NEC Avenue Super CD-ROM² Riot Zone •Crest of WolfJP TTI (US) Hudson Soft (JP) Super CD-ROM² Road Spirits NEC (US) Pack-In-Video (JP) CD-ROM² Rock-On Big Club HuCard ROM ROM Stadium Masaya CD- ROM² Ruin: Kami no Isan Victor Entertainment Super CD-ROM² Ryūkō no Ken Hudson Soft Arcade CD-ROM² Ryūkyū Face HuCard S.C.I. Taito HuCard Sadakichi Sebun: Hideyoshi no Ougon Hudson Soft HuCard Saint Dragon Aicom HuCard Salamander Konami HuCard Samurai Ghost •Genpei Toumaden: KannoniJP TTI (US) Namco (JP) Electronic Gaming Monthly #41, pg. 45 HuCard Sangokushi: Eiketsu Tenka ni Nozomu Naxat Soft CD-ROM² Sangokushi III Koei Super CD-ROM² Seirei Senshi Spriggan Naxat Soft CD-ROM² Seiryū Densetsu Monbit Hudson Soft CD-ROM² Seisenshi Denshō Nihon Bussan Super CD-ROM² Seiya Monogatari Hudson Soft Super CD-ROM² Sekigahara Tonkin House HuCard Sengoku Kantō Sangokushi Intec CD-ROM² Sengoku Mahjong Hudson Soft HuCard Sexy Idol Mahjong Nihon Bussan Super CD- ROM² Sexy Idol Mahjong: Mahjong Fashion Monogatari Nihon Bussan Arcade CD-ROM² Sexy Idol Mahjong 2: Yakyūken no Uta Nihon Bussan Super CD-ROM² Shadow of the Beast TTI (US) Victor Musical Industries (JP) 1992 Super CD-ROM² Shanghai Hudson Soft HuCard Shanghai II Hudson Soft CD-ROM² Shanghai III: Dragon's Eye ASK Kodansha Super CD-ROM² Shape Shifter •Shapeshift: Makai Eiyū DenJP TTI (US) Victor Musical Industries (JP) Super CD-ROM² Sherlock Holmes Consulting Detective NEC (US) Victor Musical Industries (JP) Electronic Gaming Monthly #23, pg. 20 CD-ROM² Sherlock Holmes: Consulting Detective Vol. II TTI (US) Victor Musical Industries (JP) 1992 Super CD-ROM² Shin Megami Tensei Atlus Super CD-ROM² Shin Onryō Senki Fujicom Super CD-ROM² Shin Sangokushi: Tenka wa Waga ni Naxat Soft CD-ROM² Shinobi Asmik HuCard Shiryō Sensen Victor Musical Industries HuCard Shockman •Kaizō Chōjin Shubibinman 2: Aratanaru TekiJP TTI (US) Masaya (JP) HuCard Shōgi Database Kiyū Seta Super CD-ROM² Shogi Shodan Icchokusen Home Data HuCard Shogi Shoshinsha Muyou Home Data HuCard Side Arms Hyper Dyne •Hyper Dyne Side ArmsJP Radiance Software (US) NEC Avenue (JP) HuCard Side Arms Special NEC Avenue CD-ROM² Silent Debuggers NEC (US) Data East (JP) HuCard SimEarth TTI (US) Hudson Soft (JP) 1993 Super CD-ROM² Sindibad: Chitei No Dai Makyu IGS HuCard Sinistron •Violent SoldierJP IGS HuCard Skweek Victor Musical Industries HuCard Slime World Micro World Super CD-ROM² Slot Gambler Nihon Bussan Super CD-ROM² Snatcher CD-ROMantic Konami Super CD-ROM² Sol Bianca Masaya CD-ROM² Sol Moonarge Irem Super CD-ROM² Soldier Blade TTI (US) Hudson Soft (JP) HuCard Solid Force NEC Home Electronics Super CD-ROM² Somer Assault •MesopotamiaJP TTI (US) Atlus (JP) HuCard Sonic Spike •World Beach VolleyJP IGS 1990 HuCard Son Son II NEC Avenue HuCard Sorcerian Victor Musical Industries Super CD-ROM² Sotsugyō: Graduation NEC Avenue Super CD-ROM² Sotsugyō Shashin: Miki Coconuts Japan Super CD-ROM² Space Harrier NEC (US) NEC Avenue (JP) HuCard Space Invaders: Fukkatsu no Hi Taito HuCard Space Invaders: The Original Game NEC Avenue Super CD-ROM² Spin Pair Media Rings HuCard Spiral Wave Media Rings HuCard Splash Lake TTI (US) NEC Avenue (JP) CD-ROM² Splatterhouse NEC (US) Namco (JP) HuCard Spriggan Mk. II Naxat Soft Super CD-ROM² Star Breaker Ray Force Super CD-ROM² Star Mobile Naxat Soft Super CD-ROM² Star Parodier Hudson Soft Super CD-ROM² Startling Odyssey Ray Force Super CD-ROM² Startling Odyssey II Ray Force Super CD-ROM² Steam-Heart's TGL Super CD-ROM² Stratego Victor Musical Industries HuCard Street Fighter II: Champion Edition NEC Home Electronics HuCard Strider Hiryū NEC Avenue Arcade CD-ROM² Super Air Zonk •CD-ROM² DenjinJP TTI (US) Hudson Soft (JP) 1993 Super CD-ROM² Super Albatross Telenet Japan CD-ROM² Super Daisenryaku Micro Cabin CD-ROM² Super Darius NEC Avenue CD-ROM² Super Darius II NEC Avenue Super CD-ROM² Super Mahjong Taikai Koei Super CD-ROM² Super Metal Crusher Pack-In-Video HuCard Super Momotaro Dentetsu Hudson Soft HuCard Super Momotarou Dentetsu II Hudson Soft HuCard Super Raiden Hudson Soft Super CD-ROM² Super Real Mahjong P II/III Custom Naxat Soft Arcade CD-ROM² Super Real Mahjong PIV Naxat Soft Super CD-ROM² Super Real Mahjong P.V Custom Naxat Soft Arcade CD-ROM² Super Real Mahjong Special Naxat Soft Super CD-ROM² Super Schwarzchild Kogado Studio CD-ROM² Super Schwarzschild 2 Kogado Studio Super CD-ROM² Super Star Soldier NEC (US) Hudson Soft (JP) Electronic Gaming Monthly #20, pg. 20 HuCard Super Volleyball NEC (US) Video System (JP) 1990 HuCard Susano-ou Densetsu Hudson Soft HuCard Sword Master Right Stuff Super CD-ROM² Syd Mead's Terraforming •TerraformingJP TTI (US) Naxat Soft (JP) 1993 Super CD-ROM² Sylphia Tonkin House Super CD-ROM² Taidaima Yūsha Boshūchū Human Entertainment Super CD-ROM² Taiheiki Intec CD-ROM² Takeda Shingen Aicom HuCard Takin' it to the Hoop •USA Pro BasketballJP NEC (US) Aicom (JP) HuCard TaleSpin NEC Electronic Gaming Monthly #24, pg. 29 HuCard Tanjō: Debut NEC Avenue Arcade CD-ROM² Tatsu no Ko Fighter Tonkin House HuCard TATSUJIN Taito HuCard Tecmo World Cup: Super Soccer Media Rings Super CD-ROM² Tenchi Muyō! Ryōōki NEC Avenue Super CD-ROM² Tenchi wo Kurau NEC Avenue Super CD-ROM² Tengai Makyō: Deden no Den Hudson Soft Super CD-ROM² Tengai Makyō: Fū- un Kabuki Den Hudson Soft Super CD-ROM² Tengai Makyō: ZIRIA Hudson Soft CD- ROM² Tengai Makyō II: Manjimaru Hudson Soft Super CD-ROM² Tenshi no Uta Telenet Japan Super CD-ROM² Tenshi no Uta II Telenet Japan Super CD-ROM² Terra Cresta II Nihon Bussan HuCard Thunder Blade NEC Avenue HuCard Tiger Road •Tora he no MichiJP NEC (US) Victor Musical Industries (JP) HuCard Time Cruise •Time Cruise IIJP TTI (US) Face (JP) HuCard Timeball •BlodiaJP NEC (US) Hudson Soft (JP) 1990 HuCard Titan Naxat Soft HuCard Toilet Kids Media Rings HuCard Tokimeki Memorial Konami Super CD-ROM² Top o Nerae! GunBuster Vol. 1 Riverhillsoft Super CD-ROM² Top o Nerae! GunBuster Vol. 2 Riverhillsoft Super CD-ROM² Toshi Tensō Keikaku Eternal City Naxat Soft HuCard The Tower of Druaga Namco HuCard Toy Shop Boys Victor Musical Industries HuCard Travelers!: Densetsu o Buttobase Victor Entertainment Super CD-ROM² Travel Epuru Telenet Japan Super CD-ROM² Tricky Kick •TrickyJP IGS 1990 HuCard Tsuppari Oozumou Heisei Ban Naxat Soft HuCard Tsuru Teruto no Jissen Kabushiki Bi-Game Intec HuCard Turrican Accolade HuCard The TV Show Right Stuff Super CD-ROM² TV Sports Basketball NEC (US) Victor Musical Industries (JP) HuCard TV Sports: Football NEC (US) Victor Musical Industries (JP) Electronic Gaming Monthly #19, pg. 24 HuCard TV Sports Hockey •TV Sports Ice HockeyJP NEC (US) Victor Musical Industries (JP) HuCard Uchū Senkan Yamato Human Entertainment Super CD-ROM² Ultra Box No. 2 Victor Musical Industries CD-ROM² Ultra Box No. 3 Victor Musical Industries CD-ROM² Ultra Box No. 4 Victor Musical Industries CD-ROM² Ultra Box No. 5 Victor Musical Industries CD-ROM² Ultra Box No. 6 Victor Musical Industries CD-ROM² Ultra Box Premiere Issue Victor Musical Industries CD-ROM² Urusei Yatsura: Stay With You Hudson Soft CD-ROM² Valis II NEC (US) Telenet Japan (JP) CD-ROM² Valis III NEC (US) Telenet Japan (JP) Electronic Gaming Monthly #32, pg. 35 CD-ROM² Valis IV Telenet Japan CD-ROM² Valis: The Fantasm Soldier Telenet Japan Super CD-ROM² Valkyrie no Densetsu Namco HuCard Vanilla Syndrome Nihon Bussan CD-ROM² Vasteel Working Designs (US) Human Entertainment (JP) 1993 CD-ROM² Vasteel 2 Human Entertainment Arcade CD- ROM² Veigues Tactical Gladiator •VeiguesJP NEC (US) Victor Musical Industries (JP) HuCard Victory Run NEC (US) Hudson Soft (JP) HuCard Vigilante NEC (US) Irem (JP) HuCard Virgin Dream Tokuma Shoten Intermedia Super CD-ROM² Volfied Taito HuCard Wai Wai Mahjong Video System HuCard Wallaby!! Masaya HuCard Where in the World is Carmen Sandiego? Pack-In-Video CD-ROM² Winning Shot Data East HuCard Wizardry I & II Naxat Soft Super CD-ROM² Wizardry III & IV Naxat Soft Super CD-ROM² Wizardry V Naxat Soft Super CD-ROM² Wonder Momo Namco HuCard World Class Baseball •Power LeagueJP NEC (US) Hudson Soft (JP) HuCard World Court Tennis •Pro Tennis: World CourtJP NEC (US) Namco (JP) HuCard World Heroes 2 Hudson Soft Arcade CD-ROM² World Jockey Namco HuCard World Sports Competition •Power SportsJP NEC (US) Hudson Soft (JP) 1992 HuCard Wrestle Angels: Double Impact NEC Home Electronics Super CD-ROM² Xak I & II Telenet Japan Super CD-ROM² Xak III: The Eternal Recurrence NEC Home Electronics Super CD-ROM² Xevious: Fardraut Saga Namco HuCard Yamamura Misa Suspense: Kizenka Kyō Ezara Satsujin Jiken Naxat Soft Super CD-ROM² Yami no Ketsuzoku Naxat Soft Super CD-ROM² Yawara! Sofix Super CD-ROM² Yawara! 2 Sofix Super CD-ROM² Yo, Bro NEC HuCard Yokai Dochuki Namco HuCard Yūyū Jinsei Hudson Soft HuCard Yū Yū Hakusho: Yami Shōbu!! Ankoku Bujutsu Kai Banpresto Super CD-ROM² Ys: Book I & II •Ys I & IIJP NEC (US) Hudson Soft (JP) CD-ROM² Ys III: Wanderers from Ys NEC (US) Hudson Soft (JP) Electronic Gaming Monthly #28, pg. 26 CD-ROM² Ys IV: The Dawn of Ys Hudson Soft Super CD-ROM² Zan: Kagerō no Toki Taito CD-ROM² Zero4 Champ Media Rings HuCard Zero4 Champ II Media Rings Super CD-ROM² Zero Wing Naxat Soft CD-ROM² Zipang Pack-In-Video HuCard ==Other== ===Non-games and demo discs=== Main title Distributor Release Date Format Japan North America 4 in 1 Super CD Hudson Soft CD-ROM² Artist Tool NEC Home Electronics HuCard Cosmic Fantasy: Visual Collection Telenet Japan CD-ROM² Hudson CD-ROM² Ongaku Zenshū Hudson Soft CD-ROM² ROM² Karaoke Vol. 1 NEC Avenue CD-ROM² ROM² Karaoke Vol. 1: Sutekini Standard Victor Musical Industries CD-ROM² ROM² Karaoke Vol. 2 NEC Avenue CD-ROM² ROM² Karaoke Vol. 2: Nattoku Idol Victor Musical Industries CD- ROM² ROM² Karaoke Vol. 3 NEC Avenue CD-ROM² ROM² Karaoke Vol. 3: Yatsubashi Band Victor Musical Industries CD-ROM² ROM² Karaoke Vol. 4 NEC Avenue CD-ROM² ROM² Karaoke Vol. 4: Choito Otona!? Victor Musical Industries CD-ROM² ROM² Karaoke Vol. 5 NEC Avenue CD-ROM² ROM² Karaoke Vol. 5: Karaoke Makunouchi Victor Musical Industries CD-ROM² Snatcher CD-ROMantic: Pilot Disk Konami Super CD-ROM² Super CD-ROM² Taiken Soft-shuu Hudson Soft CD-ROM² Valis: Visual Collection Telenet Japan CD-ROM² ===Unlicensed=== Main title Distributor Release Date Format Atlantean Aetherbyte Studios HuCard AV Poker: World Gambler Hacker International 1992 HuCard AV Tanjō Hacker International Game Express CD Bikini Girls Excite Software Corp. 1993 CD-ROM² Bishōjo Jyanshi Idol Pai Hacker International Game Express CD Body Conquest II Hacker International 1993 HuCard CD Bishōjo Pachinko 4 Sisters Hacker International Game Express CD CD Hanafuda Bishōjo Gambler Hacker International Game Express CD CD Mahjong Bishōjo Tyuushinha Hacker International Game Express CD CD Pachisuro Bishōjo Gambler Hacker International Game Express CD Crazy Hospital: Fushigi No Kuni No Tenshi Asia Soft Lab Super CD-ROM² FX Unit Yuki: The Henshin Engine SaruPro Super CD-ROM² Hawaiian Island Girls Excite Software Corp. 1993 CD-ROM² Hi-Leg Fantasy Hacker International Game Express CD Hypernova Blast MindRec Super CD-ROM² Idol Hanafuda Fan Club Hacker International 1991 HuCard Implode MindRec Super CD-ROM² Insanity Aetherbyte Studios 2009 Super CD-ROM² J Thunder Unknown 1990 Super CD-ROM² Jessie Jaeger in Cleopatra's Curse Bold Game Studio Super CD-ROM² Kyūkyoku Mah-jong: Idol Graphic Hacker International 1992 HuCard Kyūkyoku Mah-jong II: Super Idol Graphic Hacker International 1992 HuCard Lady Sword Hacker International 1992 HuCard Local Girls of Hawaii Excite Software Corp. 1993 CD-ROM² Meteor Blaster DX MindRec Super CD-ROM² Mysterious Song Frozen Utopia Super CD-ROM² PC Pachi- Slot: Idol Gambler Hacker International 1992 HuCard Pyramid Plunder Aetherbyte Studios Super CD-ROM² Quiz Tōkō Shashin Hacker International HuCard Revival Chase Revival Games Super CD-ROM² Strip Fighter II Hacker International 1993 HuCard ==Notes== ==References== ==Other websites== *PC Engine Software Bible – catalog of PC Engine games *PCECP – PC Engine Catalog Project – complete catalog of PC Engine games Category:Lists of video games by platform",
 "title": "List of TurboGrafx-16 games"
}