{
 "id": "978795",
 "text": "Konstantin Mikhailovich Pakhomov (, born January 13, 1972), is a Russian singer, songwriter, musician. Former soloist of the first composition of the group Laskovyi Mai. == Biography == Konstantin was born on January 13, 1972 in Orenburg, in a wealthy family. At the age of eight, Konstantin was sent to a music school, where he mastered the violin for several years. The young man received his secondary education in one of the Orenburg secondary schools. Having received a musical education and having a good voice, Konstantin was one of the main contenders for the role of the group's soloist. After listening, the head of the ensemble, Sergei Kuznetsov, took the young man to him without much thought. In 1991, he starred in the comedy film Mannequin by Vitaly Makarov, having tried himself as an actor. In the 2000s, the musician received a diploma from the Moscow State Institute of Culture. == Filmography == * Enamored dummy (Vlyublennyy maneken), (Zhenya Petrov - the main role), (1991) == Nominations and awards == The results of 1989 according to a survey of readers of the newspaper \"Moskovsky Komsomolets\" (in the heading \"Sound track\") Best Singer Victory == Awards == Positions in the army were accepted on a contract basis. In 1995-1996, he commanded a special forces unit on the territory of Chechnya, for which he later received medals. * Medal \"For military valor\" * Medal \"of Honor\" == Discography == Nelaskovyy may (in a group) * Ballad of love (1991) * I want to hope (1992) == Literature == * Влюблённый манекен // Домашняя синематека: отечественное кино 1918—1996. — М.: Дубль-Д, 1996. — 520 с. — стр. 68 * К. Пахомов — Влюблён в… Снегурочку! // Уральский следопыт, № 1, 1992 * Уральский следопыт No01/1992. — Litres, 2017-07-23. — 88 с. — . * Вадим Нестеров. Жизнь примечательных людей. Книга вторая. — Litres, 2020-02-03. — 343 с. — . * Сергей Сычев. Хит-парады в СССР. «Звуковая дорожка», «Хит-парад ТАСС» и др.. — Litres, 2019-02-02. — 306 с. — . == Sources == * * * * * ==References== Category:Living people Category:People from Orenburg Oblast Category:1972 births Category:Russian singer-songwriters Category:21st-century Russian singers Category:21st-century Russian songwriters",
 "title": "Konstantin Pakhomov"
}