{
 "id": "97885",
 "text": "Émilie Chauchoin Translation of this quotation : \"[…] Birth certificate of Chauchoin Émilie, female, born on September 13 running at 8 o'clock in the morning at her father and mother’s home, rue Armand-Carrel . Daughter of Georges Claude [Chauchoin], aged 36, pastry chef, and Loew Jeanne Marie, his wife, aged 25 [this age here stated and transcribed appears erroneous because it is actually 26 since her mother was born on 27 October 1876], without profession. […]\" (; September 13, 1903July 30, 1996), professionally known as Claudette Colbert ( , ) was an American actress. Colbert was famous for her comedy and drama. She became one of the biggest box-office stars of her time. In 1999, she was ranked as the 12th greatest female star of all time by the American Film Institute in their list AFI's 100 Years... 100 Stars. Colbert once said to an interviewer, \"Audiences always sound like they're glad to see me, and I'm damned glad to see them.\"Eric Pace, \"Claudette Colbert, Unflappable Heroine of Screwball Comedies, is Dead at 92\", The New York Times, July 31, 1996, page D21 == Early life == Claudette Colbert was born Emilie Chauchoin on September 13, 1903 in Saint-Mandé, France.COLBERT, Claudette, British Film Institute. BFI.org.uk. Her parents were Georges Chauchoin and his wife, the former Jeanne Loew. Quirk, \"Claudette Colbert\", p. 5.Her family emigrated to the United States and settled in New York City. She had one brother, Charles, who used the surname Wendling and went on to become his sister's agent. After her formal education ended, she enrolled in the Art Students League, where she paid for her dramatic training by working in a dress shop. She made her Broadway debut in 1923 in the stage production of \"The Wild Wescotts\". It was during this event that she adopted the name Claudette Colbert. One of the brightest film stars to grace the screen was born Emilie Claudette Chauchoin on September 13, 1903, in Saint Mandé, France where her father owned a bakery at 57, rue de la République (now Avenue Général de Gaulle). The family moved to the United States when she was three years old. She began acting in high school. == Career == In 1923, she was on Broadway for a small part. She loved the role and gave up on her plans to be a fashion designer to instead have a career in acting. She made her first movie appearance in 1927, in For the Love of Mike. This was a silent movie. It was shot in Paramount Studios in New York, New York facilities. However, sound movies (also called \"talkies\") were becoming popular. 2 years later, Colbert was in her first talking movie, The Hole in the Wall This movie co-starred another newer actor, Edward G. Robinson. In 1930 Colbert signed a contract with Paramount Pictures. At the time, they were looking for stage actors who could do dialog in the new \"talkies\". Colbert had a very elegant and musical voice. Therefore, she was very important to companies like Paramount. Some of her early hit movies were Manslaughter (1930) and Honor Among Lovers (1931), both with Fredric March, The Smiling Lieutenant (1931), with Maurice Chevalier and Miriam Hopkins, and Torch Singer (1933), with Ricardo Cortez and David Manners. Colbert's career got a huge boost when Cecil B. DeMille cast her as the Roman empress Poppaea in his historical epic The Sign of the Cross (1932), opposite Fredric March and Charles Laughton (as Nero). In one of the most memorable scenes in movie history, Claudette bathes nude in a marble pool filled with asses' milk. She worked again for DeMille and was dazzling as his Cleopatra (1934), opposite Warren William and Henry Wilcoxon. In 1934 she won an Academy Award for Best Actress for her role opposite Clark Gable in the Frank Capra classic screwball comedy It Happened One Night, a movie she initially described as the \"worst picture in the world\". Her performance, however, proved to Hollywood that she was an expert comedienne. She initially balked at pulling up her skirt to entice a passing car to give her and Gable a ride in one famous scene, complaining that it was unladylike. However, upon seeing the chorus girl who was brought in as her body double, an outraged Colbert told the director, \"Get her out of here. I'll do it. That's not my leg!\" Colbert then starred in the original Imitation of Life (1934), opposite Warren William and Louise Beavers. Claudette spent the rest of the 1930s deftly alternating between romantic comedies and dramas, and found success in both: Private Worlds (1935), with Charles Boyer; She Married Her Boss (1935), with Melvyn Douglas; The Gilded Lily (1935) and The Bride Comes Home (1935), both with Fred MacMurray; Under Two Flags (1936), with Ronald Colman; Tovarich (1937), again with Boyer; Bluebeard's Eighth Wife (1938), with Gary Cooper; Zaza (1939), with Herbert Marshall; Midnight (1939), with Don Ameche; It's a Wonderful World (1939), with James Stewart; and Drums Along the Mohawk (1939), with Henry Fonda. In addition to Capra and DeMille, Colbert was working with the top directors in the industry: Dorothy Arzner, Ernst Lubitsch, Preston Sturges, Frank Lloyd, John M. Stahl, Wesley Ruggles, Gregory La Cava, Anatole Litvak, George Cukor, Mitchell Leisen, and John Ford. Colbert believed that her face was difficult to light and photograph, and was obsessed with not showing her \"bad\" side, the right, to the camera, because of a small bump that resulted from a childhood broken nose.Helen Dudar, \"Claudette Colbert Revels in a Happy, Starry Past\", The New York Times, October 27, 1991, page A-1 From 1936 to 1944, she starred in numerous programs of Cecil B. DeMille's Lux Radio Theater, which was one of the most popular dramatic radio shows at the time. In 1952, she returned to work in her native France where she stayed until 1955. Apart from making two more Hollywood movies, she went back to Broadway in 1958 doing \"The Marriage Go-Round\" with Charles Boyer, earning a 1959 Tony Award nomination for her work. Also for her Chicago theatre work, in 1980 she won the Sarah Siddons Award. In 1984 she appeared with Rex Harrison in Frederick Lonsdale's \"Aren't We All\" at the Haymarket Theatre, London, and also the Brooks Atkinson Theatre on Broadway, presented by Douglas Urbanski. Ms. Colbert's last movie was Parrish in 1961. She acted in numerous Broadway plays for the next twenty years. Her final appearance before the cameras was in 1987. She did a television mini-series titled The Two Mrs. Grenvilles. She was nominated for an Emmy Award for Outstanding Supporting Actress in a Mini-series or a Special. In 1988, she won the Golden Globe Award for Best Performance by an Actress in a Supporting Role in a Series, Mini-Series or Motion Picture made for TV. In 1989 she received the Kennedy Center Honors. During her career, Claudette Colbert played in sixty-five movies. For her contribution to the motion picture industry, she was honoured with a star on the Hollywood Walk of Fame. She did, however, remain on the stage where she had returned in 1956, her first love. After a series of strokes, Claudette divided her time between New York and Barbados. On July 30, 1996, Claudette Colbert died in Speightstown, Barbados. She was 92 years old. == Personal life and Death == Colbert married twice. Her first husband was Norman Foster, an actor and later a director, whom she married in 1928 and divorced in Mexico in 1935. According to the account of the divorce in the New York Times, published on August 31, 1935, \"Some secrecy surrounded the proceedings, for while Mr. Feldman [Colbert's agent] apparently was at liberty to tell of the divorce being granted, he said he could not tell where in Mexico it was obtained.\" The report further stated that \"The Fosters created something of a sensation when they disclosed that they were trying to remain happily married while living in separate homes. But even this experiment apparently failed.\" Four months after her divorce, on December 24, 1935, Colbert married Dr. Joel J. Pressman, a throat specialist, who died in 1968; her former husband went on to marry the actress Sally Blane, a sister of Loretta Young. When she retired from motion pictures, Colbert and her husband moved to Palm Springs where she operated a store for a time before moving to Barbados. The idea of moving to Barbados came to her following a visit to Noël Coward's house in Jamaica. At her home there, called Bellerive, she spent her later years as a hostess to the world's powerful and famous. Ronald Reagan was one of her guests during his presidency, as were Lillian Helman, Kirk Douglas, Jack Benny, Rex Harrison, and Slim Keith. She had a small guest house built on the property for the honeymoon of Frank Sinatra and Mia Farrow. Colbert died at her home in Barbados, following series of small strokes during the last two years of her life at the age of 92, and she was interred there in the Parish of St. Peter Cemetery along with her mother and husband. A requiem mass was held at St. Vincent Ferrer church in New York City later. According to an article published in August 10, 1996 issue of the Cincinnati Post, the childless Colbert left most of her estate, estimated at $3.5 million and including her Manhattan apartment and her home in Barbados, to a friend, Helen O'Hagan, a retired director of corporate relations at Saks Fifth Avenue, whom Colbert had met in 1961 on the set of Parrish, the actress's last movie.Stephanie Harvin, \"O'Hagan, a Legend at Saks\", Post and Courier, August 23, 1996\"Colbert's Will Provides for Longtime Friends\", Austin American-Statesman, August 10, 1996, page B12 Bellerive was later bought by David Geffen. After Colbert's death, rumors about the actress's purported lesbian relationships, including supposed affairs with Marlene Dietrich and Greta Garbo, began to circulate in the international media. In response, Colbert's friend Helen O'Hagan told the New York Daily News that the actress barely knew Dietrich or Garbo and that Colbert was \"a man's lady\".George Rush and Joanna Molloy, \"It Happened One Night -- Or Did It?\", The New York Daily News, August 5, 1996, page 14 The purported Colbert-Dietrich relationship also was explored in the 2001 book Behind the Screen: How Gays and Lesbians Shaped Hollywood, 1910-1969 by William J. Mann, a movie historian. ==Awards and honours== Year Award Category Film Result 1935 Academy Award Best Actress It Happened One Night 1936 Private Worlds 1945 Since You Went Away 1959 Tony Award Best Actress The Marriage-Go-Round 1960 Hollywood Walk of Fame Star at 6812 Hollywood Blvd. — 1980 Sarah Siddons Award The Kingfisher 1984 Film Society of Lincoln Center Lifetime Achievement Award — 1985 Drama Desk Drama Desk Special Award Aren't We All Drama Desk Award winners 1987 Primetime Emmy Award Outstanding Supporting Actress The Two Mrs. Grenvilles 1988 Golden Globe Award Best Supporting Actress in a Series 1989 Kennedy Center Honors Lifetime Achievement Award — 1990 San Sebastián International Film Festival Donostia Award — 1999 American Film Institute Greatest Female Stars — == Filmography == * For the Love of Mike (1927) * The Hole in the Wall (1929) * The Lady Lies (1929) * Young Man of Manhattan (1930) * The Big Pond (1930) (a French version was also filmed with the same cast) * Manslaughter (1930) * Mysterious Mr. Parkes (1930) (French version of the 1930 movie Slightly Scarlet) * Honor Among Lovers (1931) * The Smiling Lieutenant (1931) * Secrets of a Secretary (1931) * His Woman (1931) * Hollywood on Parade (1932) (short subject) * The Wiser Sex (1932) * Misleading Lady (193) * The Man from Yesterday (1932) * Make Me a Star (1932) (Cameo) * The Phantom President (1932) * The Sign of the Cross (1932) * Tonight Is Ours (1933) * Hollywood on Parade No. 9 (1933) (short subject) * I Cover the Waterfront (1933) * Three-Cornered Moon (1933) * Torch Singer (1933) * The Hollywood You Never See (1934) (short subject) * Four Frightened People (1934) * It Happened One Night (1934) * Cleopatra (1934) * Imitation of Life (1934) * The Fashion Side of Hollywood (1935) (short subject) * The Gilded Lily (1935) * Private Worlds (1935) * She Married Her Boss (1935) * The Bride Comes Home (1935) * Under Two Flags (1936) * Maid of Salem (1937) * I Met Him in Paris (1937) * Tovarich (1937) * Breakdowns of 1938 (1938) (short subject) * Bluebeard's Eighth Wife (1938) * Hollywood Goes to Town (1938) (short subject) * Zaza (1939) * Midnight (1939) * It's a Wonderful World (1939) * Drums Along the Mohawk (1939) * Boom Town (1940) * Arise, My Love (1940) * Skylark (1941) * Remember the Day (1941) * Hedda Hopper's Hollywood No. 6 (1942) (short subject) * The Palm Beach Story (1942) * No Time for Love (1943) * So Proudly We Hail! (1943) * Since You Went Away (1944) * Practically Yours (1944) * Guest Wife (1945) * Tomorrow Is Forever (1946) * Without Reservations (1946) * The Secret Heart (1946) * The Egg and I (1947) * Sleep, My Love (1948) * Family Honeymoon (1949) * Bride for Sale (1949) * Three Came Home (1950) * The Secret Fury (1950) * Thunder on the Hill (1951) * Let's Make It Legal (1951) * The Planter's Wife (1952) * Daughters of Destiny (1954) * Royal Affairs in Versailles (1954) * Texas Lady (1955) * Parrish (1961) == Radio == * Burns and Allen (04-13-1943 Guest) == Television == * The Jack Benny Program (1951, 1 episode) * General Electric Theater (1954-1955, 2 episodes) * The Best of Broadway (1954, 1 episode) * Climax! (1954-1955, 3 episodes ) * The Ford Television Theatre (1955, 2 episodes) * Letter to Loretta (1955, 1 episode) * Ford Star Jubilee (1956, 1 episode) * Robert Montgomery Presents (1956, 1 episode) * The Steve Allen Show (3 episodes, 1956-1958) * What's My Line? (2 episodes, 1956-1959) * Playhouse 90 (1957, 1 episode) * Zane Grey Theater (1957-1960, 2 episodes) * General Motors 50th Anniversary Show (1957) * Telephone Time (1957, 1 episode) * Suspicion (1958, 1 episode) * Colgate Theatre (1958, 1 episode) * The Bells of St. Mary's (1959) * The Two Mrs. Grenvilles (1987) == Broadway == * The Wild Westcotts (1923-1924) * A Kiss in a Taxi (1925) * The Ghost Train (1926) * The Pearl of Great Price (1926) * The Barker (1927) * The Mulberry Bush (1927) * La Gringa (1928) * Within the Law (1928) * Fast Life (1928) * Tin Pan Alley (1928) * Dynamo (1929) * See Naples and Die (1929) * Janus (1956) * The Marriage-Go-Round (1958-1960) * Julia, Jake and Uncle Joe (1961) * The Irregular Verb to Love (1963) * The Kingfisher (1978-1979) * A Talent for Murder (1981) * Aren't We All? (1985) == References == * \"Colbert Wealth Left to Neighbor\", The Cincinnati Post, August 10, 1996 == Bibliography == * Claudette Colbert (1976), William K. Everson * Claudette Colbert : An Illustrated Biography (1985), Lawrence J. Quirk == Other websites == * * * * Category:American Academy Award winning actors Category:Actors from New York City Category:Actors from Paris Category:American movie actors Category:American stage actors Category:American television actors Category:Deaths from stroke Category:Golden Globe Award winners Category:1903 births Category:1996 deaths",
 "title": "Claudette Colbert"
}