{
 "id": "978827",
 "text": "Dersim (; ; ) is a mountainous historical region in the Armenian Highlands, which is in Eastern Turkey today. The region included all parts of Tunceli Province (Çemişgezek, Hozat, Pertek, Tunceli, Ovacık, Pülümür, Nazımiye, Pertek) Tercan, Erzincan, Kemah and Kemaliye in Erzincan Province, Keban in Elâzığ Province, Kiğı in Bingöl Province and Arapkir in Malatya Province). == History == This region was known as Ishuwa in the 2000s BC. As a result of the struggle of the Ishuva Kingdom, which was established by the Hurrians in the region, it came under the rule of the Hittites towards the 1600s BC. Then it came under the domination of the Urartians and formed the westernmost part of the country of Urartu. After that, it was ruled by Medes and the Persian Achaemenid Empire. Next it passed into the hands of the Alexander the Great, the king of Macedonia. During the reign of Tigranes the Great, the king of Armenia of the Artaxiad dynasty, Dersim was annexed to the kingdom of Armenia. Even after the fall of the Artaxiad dynasty, Dersim remained loyal to them and did not submit to the Romans. === Medieval Era === After Christianity was made Armenia's official religion, the people of Dersim resisted the influence of the new religion and kept their old religious traditions. This was not unique to Dersim. After the Byzantine Empire occupied the western parts of Armenia, they deported as many of the Dersimites as they could capture to Thrace. There, they made these refugees serve as soldiers against the Bulgarian invasion. Despite all Byzantine \"tricks\", the people of Dersim were able to prevent Byzantine influence from being established in their region. In 1093 the Seljuks defeated the Byzantine Empire, but the people of Dersim did not submit to the them. By the time the Safavid Empire was established in 1501, its official religious sect, Shi'ism, had spread to Dersim. The Kurds of Dersim showed favour towards Shāh Ismā'īl I. They agreed to give up control of the fortress of Kemah so Ismā'īl could use it as a military base. They did so on condition that Ismā'īl would respect their sovereignty and independence. === Ottoman Empire rule === See also: Ottoman Empire The Ottomans began to establish themselves in the Dersim region after Sultan Mehmed II the Conqueror defeated the Aq Qoyunlu dynasty in 1473. However, Dersim was not brought under Ottoman control until the Battle of Chaldiran in 1514, during the reign of Selim the Grim. However, Dersim was difficult to control because of its harsh and rugged geography. At times, it was under the control of local administrators. The people of Dersim rebelled during times when central government administrations were weaker. The southwestern parts of Dersim were ruled by the Emirate of Çemişgezek, a hereditary and self-governing Kurdish emirate that existed from the 13th century until 1663. It centred on Çemişgezek, which included Mazgirt, Pertek and Sağman. The emirate was inhabited by both Muslims and non-Muslims, and also had a significant Kurdish Alevi population, which flourished and expanded thanks to the self-government secured under Ottoman rule despite Ottoman hostility towards the minority. In 1848, the Dersim Sanjak was formed within the Erzurum Vilayet. In 1880, the Dersim or Hozat vilayet was formed with Hozat as its center, although by 1888 it was made a sanjak/mutasarrifate of the Mamuret-ul-Aziz vilayet (now Elazığ). Even in 1895 between 1897, many Armenian fedayis took refuge in Dersim and benefited from the baht (of asylum) of the Dersimites and were able to protect themselves against the Ottoman administration. Various rebellions took place in the region in the 1877, 1885, 1892, 1907, 1911, 1914 and 1916. === In Turkey === With the abolition of the Ottoman Empire, Turkey became the owner of the region. In 1937, an Alevi Kurdish broke out in the region and was suppressed with the deaths of 30,000 Kurds. Following the Tunceli Law 1935, which demanded a more powerful government in the region, the Fourth Inspectorate-General (Umumi Müfettişlik, UM) was created in January 1936. The fourth UM span over the provinces of Elazığ, Erzincan, Bingöl and Tunceli, and was governed by a Governor Commander. Most of the employees in the municipality were to be filled with military personnel and the Governor- Commander had the authority to evacuate whole villages and resettle them in other parts. The juridical guarantees did not comply with the law in the other parts in Turkey. The trials were at most 15 days long and sentences could not be appealed. For a release, the Governor Commander had to give his consent. The application of the death penalty was under the authority of the Governor- Commander, while normally it would be the authority of the Grand National Assembly of Turkey to approve such a punishment. In 1946 the Tunceli Law was abolished and the state of emergency removed, but the authority of the fourth UM was transferred to the military. The Inspectorates-General was dissolved in 1952 during the Government of the Democrat Party. == People == In 1927, according to Savaş Sertel, 69.5% of Dersim's people spoke Kurdish and Zazaki; 28.8% spoke Turkish; and 0.74% spoke Armenian. At the time, the Zaza people constituted the majority in the area, and were more common than Kurds. However, Ahmet Kerim Gültekin defined the province as predominantly Kurdish Alevi. Kurmanji Kurdish is the main dialect around Pertek, while Zazaki is spoken in Hozat, Pülümür, Ovacık and Nazımiye. Both Kurmanji and Zaza is spoken in Tunceli town and Mazgirt. The Dimli (or Zaza) people of Dersim are the descendants of the Deylamites, who migrated from the highlands of the Gilan region of Iran in the 10th–12th centuries. During the Ottoman period, the districts of Mazgirt, Nazımiye and Çemişgezek had a large Armenian population. Following a deportation order in 1915, a large part of this population was deported out of Anatolia. It is likely that the remaining population migrated to Western Anatolia. The town and district of Çemişgezek is populated by both Turks and Kurds. The Kurdish and Zaza people of the region are divided into tribes: * Of the 20 tribes in Hozat (which includes the present-day central district), 17 are Zazaki and 3 are Kurmanji; * Of the 8 tribes in Çemişgezek, 6 are Zazaki and 2 are Kurmanji; * Of the 17 tribes in Ovacık, 15 are Zazaki and 2 are Kurmanji; * Of the 13 tribes in Pülümür, 12 are Zazaki and 1 is Kurmanji; * Of the 14 tribes in Nazımiye 11 are Zazaki and 3 are Kurmanji; * 16 of the 30 tribes in Mazgirt speak Kurmanji and 14 speak Zazaki; * All 8 tribes in Pertek speak Kurmanji. == Etymology == According to Nuri Dersimi, six centuries before Jesus, Greek historians and geographers called the Dersim region Daranis. The Bisltun inscriptions of Darius the Great call this region Zuza. This term is similar to the word Zaza, which is the \"Kurdish dialect\" spoken in Dersim and its region. Another thesis suggests that the region got its name from the phrase der-sîm, which means \"silver gate\" in Persian). \"Gate\" might refer to how frequently Dersim changed between Sasanid and Byzantine control during the Byzantine period. == Notable people == * John I Tzimiskes (925–976; Çemişgezek\"Çemişgezek\" in The Concise Dictionary of World Place-Names, 2005, by John Everett-Heath, Oxford University Press.) - Byzantine emperor * Seyid Riza (1863–1937; Ovacık) - tribal leader and organizer of Dersim rebellion * Vazken Andréassian (1903–1995; Çemişgezek) - engineer, author, survivor of the Armenian genocide * Andranik Andréassian (1909–1996; Çemişgezek) - author, editor, survivor of the Armenian genocide * Nuri Dersimi (1893–1973; Hozat) - Kurdish nationalist writer, revolutionary and intellectual * Aram Achekbashian (1867–1915; Arapkir) - politician from Hunchak * Abdullah Cevdet (1869–1932; Arapkir) - intellectual, writer and physician * Nicol Galanderia (1881–1944; Kemaliye) - musician * Hasan Hayri (1881–1925; Hozat) - politician * Soghomon Tehlirian (1897–1960; Tercan) - Armenian who assassinated Talaat Pasha * Aurora Mardiganian (1901–1994; Çemişgezek) - author, actress, and a survivor of the Armenian genocide * Vahagn Davtyan (1922–1996; Arapkir) - poet, translator, publicist and public activist * Sait Kırmızıtoprak (1935–1971; Nazımiye) - Kurdish nationalist writer, revolutionary and intellectual * Hasan Saltık (1964) - record producer * Kemal Kılıçdaroğlu (1948; Nazımiye) - economist, retired civil servant, social democratic politician and leader of the Republican People's Party * Kamer Genç (1940–2016; Nazımiye) - politician * Alican Önlü (1967; Nazımiye) - politician * Volga Sorgu (1981; Ovacık) - movie and serial actor * Edibe Şahin (1960; Nazımiye) - politician, former mayor of the municipality of Tunceli. * Hozan Diyar (1966; Mazgirt) - singer * Hüseyin Aygün (1970; Nazımiye) - lawyer and politician * Ali Haydar Kaytan (1952–2019; Nazımiye) - miliant, co-founder of the Kurdistan Workers' Party (PKK) * Aynur Doğan (1975; Çemişgezek) - singer and songwriter * Fatih Mehmet Maçoğlu (1968; Ovacık) - communist politician, current mayor of Tunceli * Ferhat Tunç (1964; Ovacık) - singer * Mikail Aslan (1972; Hozat) - musician * Nilüfer Gündoğan (1977; Nazımiye) - Dutch politician === Originating from Dersim === * Turgut Özal (1927–1993; Çemişgezek\"Çemişgezek'e bir gelen geri dönmek istemiyor\". Sabah. (in Turkish). Retrieved 9 February 2023. \"8. Cumhurbaşkanı Turgut Özal'ın annesi Hafize Özal, Çemişgezek Mezire Köyü doğumlu.\"\"Turgut Özal'ı rahmetle anıyoruz\". Yeni Akit. (in Turkish). Retrieved 9 February 2023. \"Babası Malatya/Çırmıktı'lı Ünlüoğulları'ndan banka memuru Mehmet Sıddık Özal, annesi ise Tunceli Çemişgezekli, ilkokul öğretmeni Hafize Hanım (d. 1906 - ö. 1988) olan Turgut Özal kısmen Kürt kökenlidir.\") - former president and prime minister of Turkey * Gültan Kışanak (1961)\"Gültan Kışanak Kimdir?\". Bianet. (in Turkish). 9 February 2023. \"Ailesi zamanında Dersim'den göçerek Elazığ'ın merkez köylerinden Sünköy'e yerleşmiş bulunan Ağuce aşiretine mensuptur.\" \\- journalist, author and politician * Dilan Yeşilgöz-Zegerius (1977) - politician, current Minister of Justice and Security in Netherlands * Zuhal Demir (1980)\"Belçika’nın Kürt asıllı bakanı Zuhal Demir tehdit edildi\". Ahval. (in Turkish). Retrieved 9 February 2023. \"Tunceli ve Elazığ kökenli, maden işçisi bir babanın üçüncü çocuğu olan Zuhal Demir, 12 Mart 1980'de Belçika'nın Genk kentinde dünyaya geldi.\" \\- lawyer, politician, current Flemish Minister of Environment, Justice, Tourism and Energy in Belgium * Yıldız Tilbe (1966)\"Star'daki Yıldız Tilbe'nin Programında Türk-Kürt Gerginliği...\". Haber Vitrini. (in Turkish). Retrieved 9 February 2023. \"Programın ilerki bölümlerinde Yıldız Tilbe, “Ulaştırma Bakanından uyarı gelmiş. Benim anam Tuncelili, hem Zaza hem Kürt, babam Ağrılı Kürt. Ben bu topraklarda doğdum, büyüdüm. Kürt neyse benim için Türk de odur, Laz da odur, Çerkez de odur. Hiç bir farkı yoktur birbirinden asla” dedi.\" \\- prominent singer == Related pages == * Tunceli Province == References == == Sources == * * * * * * * * * * * * * * * * Category:Regions of Asia",
 "title": "Dersim"
}