{
 "id": "978838",
 "text": "Krautrock is rock and electronic music. It was born in Germany in the late 1960s. The term was popularized in the English-speaking press. Later, German media began to use it as a term for all German rock bands from the late 1960s and 1970s. That was while abroad the term specifically referred to more experimental artists who often but not always used synthesizers and other electronic instruments. Largely divorced from the traditional blues and rock and roll influences of British and American rock music until that time, the period contributed to the evolution of electronic music and ambient music as well as the birth of post-punk, alternative rock and New Age music. ==Artists== Key artists associated with the tag include Can, Amon Düül II, Ash Ra Tempel, Faust, Popol Vuh, Cluster, Tangerine Dream, Klaus Schulze, Neu!, and Kraftwerk. ==Etymology== The word \"krautrock\" was applied to the experimental German rock movement of the late 1960s and early 1970s by the British music press, and was retained by its practitioners.'Krautrock - Cosmic Rock and its Legacy' by David Stubbs, Erik Davis, Michel Faber and various contributing authors. Published 2009 by Black Dog Publishing Limited, London ISBN 978-1-906155-66-7 The term krautrock was originally a humorous one coined by the UK music press (such as New Musical Express and Melody Maker), where \"krautrock\" found an early and enthusiastic underground following. The term comes from the ethnic slur \"kraut\". Its use by the music press was inspired by a track from Amon Düül's Psychedelic Underground titled \"Mama Düül und Ihre Sauerkrautband Spielt Auf\" ('Mama Düül and her Sauerkrautband Strike Up'). As is often the case with musical genre labels, not many of the bands wanted to see themselves pigeon-holed. They tended to eschew the term. The term is also a problematic category because of the differences, from one artist to another so labelled. Musicologist Julian Cope, in his book Krautrocksampler, expressed in words that \"Krautrock is a subjective British phenomenon,\" based on the way the music was received in the United Kingdom instead of on the actual West German music scene out of which it became bigger. For example, while one of the main groups originally tagged as krautrock, Faust, recorded a seminal 12-minute track they titled \"Krautrock\". They later distanced themselves from the term, expressing in words that: \"When the English people started talking about Krautrock, we thought they were just taking the piss... and when you hear the so-called 'Krautrock renaissance,' it makes me think everything we did was for nothing.\" ==References== Category:Rock music",
 "title": "Krautrock"
}