{
 "id": "978909",
 "text": "Thirty-six Views of Mount Fuji is a group of woodblock prints by Hokusai, a Japanese artist. The prints show Mount Fuji as seen from many different places. The prints were very successful, and Hokusai made ten more after the first thirty-six. The prints were made in the 1830s. The Great Wave off Kanagawa, one of Hokusai's most popular prints, is a part of the series. Thirty-six Views of Mount Fuji has been called Hokusai's \"colour-print masterpiece\". == Process == Hokusai started making each print by drawing it on paper. It was glued onto a wood block, to help carve the drawing into the wood. The block was then covered with colored ink, and put onto paper to make the print. For each color on a print, Hokusai had to make a different block.The Prints of Japan. Frank A. Turk, October House Inc, 1966, Lib Congress catalog Card no. 66-25524 The first prints in the series were made with shades of blue ink. After the series was popular, versions of each print with many colors were made. Over one hundred prints were planned, but only forty-six were made. Hokusai later made a book named One-Hundred Views of Mount Fuji. It was published around 1835. It had drawings of one-hundred different views of Mount Fuji in it. == Prints == === First thirty-six prints === No. Image English title Japanese title 1 The Great Wave off Kanagawa Kanagawa oki nami-ura 2 Fine Wind, Clear Morning, also known as South Wind, Clear Sky or Red Fuji Gaifū kaisei 3 Thunderstorm Beneath the Summit Sanka hakuu 4 Under Mannen Bridge at Fukagawa Fukagawa Mannen-bashi shita 5 Sundai, Edo Tōto sundai 6 Cushion Pine at Aoyama Aoyama enza-no-matsu 7 Senju, Musashi But Bushū Senju 8 Inume Pass, Kōshū Kōshū inume-tōge 9 Fuji View Field in Owari Province Bishū Fujimigahara 10 Ejiri in Suruga Province Sunshū Ejiri 11 A sketch of the Mitsui shop in Suruga in Edo (a city that is now called Tokyo) Kōto Suruga-cho Mitsui Miseryakuzu 12 Sunset across the Ryōgoku bridge from the bank of the Sumida River at Onmayagashi Ommayagashi yori ryōgoku-bashi yūhi mi 13 Sazai hall – Temple of Five Hundred Rakan Gohyaku-rakanji Sazaidō 14 Tea house at Koishikawa. The morning after a snowfall Koishikawa yuki no ashita 15 Shimomeguro Shimomeguro 16 Watermill at Onden Onden no suisha 17 Enoshima in Sagami Province Soshū Enoshima 18 Shore of Tago Bay, Ejiri at Tōkaidō Tōkaidō Ejiri tago-no-uraryakuzu 19 Yoshida at Tōkaidō Tōkaidō Yoshida 20 The Kazusa Province sea route Kazusa no kairo 21 Nihonbashi bridge in Edo Edo Nihon-bashi 22 Barrier Town on the Sumida River Sumidagawa Sekiya no sato 23 Bay of Noboto Noboto-ura 24 The lake of Hakone in Sagami Province Sōshū Hakone kosui 25 Mount Fuji reflects in Lake Kawaguchi, seen from the Misaka Pass in Kai Province Kōshū Misaka suimen 26 Hodogaya on the Tōkaidō Tōkaidō Hodogaya 27 Tama River in Musashi Province Bushū Tamagawa 28 Asakusa Hongan-ji temple in the Eastern capital [Edo] Tōto Asakusa honganji 29 Tsukuda Island in Musashi Province Buyō Tsukuda-jima 30 Shichiri Beach in Sagami Province Soshū Shichiri-ga-hama 31 Umezawa in Sagami Province Soshū umezawanoshō 32 Kajikazawa in Kai Province Kōshū Kajikazawa 33 Mishima Pass in Kai Province Kōshū Mishima-goe 34 Mount Fuji from the mountains of Tōtōmi Tōtōumi sanchū 35 A View of Mount Fuji Across Lake Suwa (Lake Suwa in Shinano Province) Shinshū Suwa-ko 36 Ushibori in Hitachi Province Jōshū Ushibori === Ten prints made later === No. Image English title Japanese title 1 Goten-yama-hill, Shinagawa on the Tōkaidō Tōkaidō Shinagawa Goten'yama no Fuji 2 Honjo Tatekawa, the timberyard at Honjo, Sumida Honjo Tatekawa 3 Pleasure District at Senju Senju Hana-machi Yori Chōbō no Fuji 4 Nakahara in Sagami Province Sōshū Nakahara 5 Ōno Shinden in Suruga Province Sunshū Ōno-shinden 6 Climbing on Fuji Shojin tozan 7 The Tea plantation of Katakura in Suruga Province Sunshū Katakura chaen no Fuji 8 The Fuji from Kanaya on the Tōkaidō Tōkaidō Kanaya no Fuji 9 Dawn at Isawa in Kai Province Kōshū Isawa no Akatsuki 10 The back of Fuji from the Minobu river Minobu-gawa ura Fuji == Related pages == * The Great Wave off Kanagawa * Fine Wind, Clear Morning == References == Category:Japanese art",
 "title": "Thirty-six Views of Mount Fuji"
}