{
 "id": "97916",
 "text": "George Mifflin Dallas (July 10, 1792 – December 31, 1864) was an American politician and diplomat. He was the 11th vice president of the United States from 1845 to 1849, under James K. Polk. Before becoming vice president, he was a senator from Pennsylvania and the mayor of Philadelphia. Dallas was born in Philadelphia and graduated from the College of New Jersey (now the Princeton University) in 1810. ==Early life== Dallas was born in Philadelphia on July 10, 1792. His parents were Alexander James Dallas and Arabella Maria Smith Dallas. His father was the Secretary of the Treasury under United States President James Madison, and was also briefly the Secretary of War. George Dallas was given his middle name after Thomas Mifflin. Mifflin was another politician who was good friends with his father.Belohlavek. \"George Mifflin Dallas\", p. 109. Dallas was the second of six children. One of his brothers, Alexander, would become the commander of Pensacola Navy Yard. He was taught privately at Quaker-run preparatory schools, before studying at the College of New Jersey (now Princeton University). He graduated with highest honors in 1810. While at College, he did several activities, including the American Whig–Cliosophic Society. He studied law in his father's office, and he was admitted to the bar in 1813. ==Pre-political career== As a new graduate, Dallas did not want to become a lawyer; he wanted to fight in the War of 1812. He gave up on that plan after his father said no. Just after this, Dallas became the private secretary of Albert Gallatin. He went to Russia with Gallatin, who was sent there to try to get it to help with peace negotiations between Great Britain and the United States. Dallas liked the opportunities he got by being in Russia, but after six months there he was told to go to London to find out whether the War of 1812 could be ended by talking. In August 1814, he arrived in Washington, D.C. and delivered a draft of Britain's peace terms. There, James Madison made him the remitter of the treasury. Since the job did not have a big workload, Dallas found time to work on understanding politics. He later became the counsel to the Second Bank of the United States. In 1817, Dallas's father died, ending Dallas's plan for a family law practice. He then stopped working for the Second Bank of the United States and became the deputy attorney general of Philadelphia, which lasted until 1820. ==Political career== After the War of 1812, Pennsylvania's political climate was chaotic. There were two factions in that state's Democratic party vying for control. Dallas led the Philadelphia-based \"Family party\". The other faction was called the \"Amalgamators\", and it was led by future President James Buchanan. Voters elected Dallas mayor of Philadelphia as the candidate of the Family party, after the party gained control of the city councils. However, he quickly got bored of being the mayor. He became the United States attorney for the eastern district of Pennsylvania in 1829, and continued in that role until 1831. In December of that year, he won a contest in the state legislature, that enabled him to become the Senator from Pennsylvania in order to complete the unexpired term of the previous senator who had resigned. Dallas served from 13 December 1831 to 3 March 1833. He was chairman of the Committee on Naval Affairs. Dallas did not try to get re-elected, due to both a fight over the Second Bank of the United States, and because his wife did not want to leave Philadelphia to move to Washington. Dallas went back to his law career, and was attorney general of Pennsylvania from 1833 to 1835. He was initiated to the Scottish Rite Freemasonry at the Franklin Lodge #134, Pennsylvania, and served as the Grand Master of Freemasons in Pennsylvania in 1835. Dallas was offered the role of Attorney General, but did not take it, and went back to being a lawyer. In the lead-up to the 1844 presidential election, Dallas helped Van Buren get the Democratic nomination instead of Dallas's fellow Pennsylvanian, James Buchanan. ==Vice presidency== At the 1844 Democratic National Convention in Baltimore, James K. Polk and Silas Wright were nominated. However, Wright did not want to be vice president, and Dallas was picked as his replacement. Dallas was not at the convention. He was woken up at his home by people from the convention who went to Philadelphia to tell him the news. Dallas accepted the nomination. The Democrats won the election with an electoral vote of 170 out of 275. Dallas decided to use his position to lower tariffs and make the country bigger. Dallas used to support the tariff policy that his state's coal and iron companies wanted. But as vice president, he agreed to do anything necessary to realize that goal. Dallas thought that the vice president's power to break tied votes in the Senate was similar to the president's power to veto acts of Congress. At the end of his term, Dallas said that he had cast thirty tie-breaking votes during his four years in office. Dallas talked about this achievement in his farewell address to the Senate. However, Dallas wanted to avoid having to break a tied vote on the tariff issue, and lobbied senators during the debate over Treasury Secretary Walker's tariff bill in the summer of 1846. Despite Dallas's efforts to avoid taking a stand, the Senate completed its voting on the Walker Tariff with a 27-to-27 tie. (A twenty- eighth vote in favor was held in reserve by a senator who opposed the measure but agreed to follow the instructions of his state legislature to support it.) When he voted for the tariff on July 28, 1846, Dallas said that he had studied the Senate support and concluded that all regions of the country had people who liked the bill. Additionally, the measure had overwhelmingly passed the House of Representatives. While the vote earned Dallas the respect of the president and certain party leaders from the southern and western states that supported low tariffs, it destroyed his home state political base. While Dallas's tariff vote destroyed him in Pennsylvania, his aggressive views on Oregon and the Mexican War ruined his campaign efforts elsewhere in the nation. He shifted his attention to the aggressive, expansionist foreign policy program embodied in the concept of \"Manifest Destiny\" to get more votes. He actively supported efforts to gain control of Texas, the Southwest, Cuba, and disputed portions of the Oregon territory. Dallas was important in the Senate, where he worked to support Polk and cast several tie-breaking votes. Dallas called for the annexation of all of the Oregon Territory and all of Mexico during the Mexican–American War, but accepted compromises that gave the United States parts of both areas. Though Dallas could not stop Polk from appointing Buchanan as Secretary of State, he helped convince Polk to appoint Robert J. Walker as Secretary of the Treasury. As vice president, Dallas tried to make himself a potential candidate for president in the 1848 election. However, his tie-breaking vote to lower a tariff destroyed much of his base in Pennsylvania, and his advocacy of popular sovereignty for slavery made more opposition against him. ==Later life== In 1856, Franklin Pierce appointed Dallas minister to Great Britain, and he served as the minister until Abraham Lincoln appointed Charles F. Adams. When he started his service in England, he was called to work on the Central American question and the request made by the United States that Sir John Crampton, the British minister to the United States, should be recalled. At the end of his diplomatic career, Dallas returned to private life. He stopped getting involved in public affairs, except to condemn the Confederacy. ===Death=== Dallas returned to Philadelphia, where he lived until his death from a heart attack on Saturday, December 31, 1864. He was 72 when he died.Belohlavek, \"George Mifflin Dallas\", p. 118. ==References== Category:1792 births Category:1864 deaths Category:United States senators from Pennsylvania Category:Politicians from Philadelphia Category:19th-century American politicians Category:Mayors of Philadelphia Category:Vice presidents of the United States Category:Pennsylvania attorneys general Category:Lawyers from Philadelphia",
 "title": "George M. Dallas"
}