{
 "id": "97932",
 "text": "The Doctor is the central character in the long-running BBC science fiction television series Doctor Who. They are an alien, a Time Lord from the planet Gallifrey. The Doctor travels in their space-time-ship, the TARDIS, (Time And Relative Dimensions In Space) with which they can go anywhere in time and space. Because the TARDIS's chameleon circuit is broken, it looks like an old British police-call box permanently. The Doctor often takes other people with them, who are usually called \"companions\" or \"assistants\". The companions are always 21st century humans in the modern series, however the classic series often had human-looking aliens or people from the past or future. The most recent companion is Ruby Sunday. ==Biography== The Doctor did not want to stay on Gallifrey any longer, so he \"borrowed\" an old Type 40 TARDIS. In the TARDIS he and his granddaughter Susan Foreman left their home planet Gallifrey. They stayed for a time on Earth in the 1960s, where Susan also went to school. Her teachers, Barbara Wright and Ian Chesterton, discovered the TARDIS. They traveled for a while with the Doctor, and returned to Earth two years later. After them the Doctor often took other people with him on his travels. ==Anatomy and regeneration== As a Gallifreyan the Doctor looks like a human on the surface, but there are differences. One well-known difference is that The doctor has two hearts. As a Time Lord the Doctor can also regenerate, if doctor whos body is badly hurt and the doctor dies. During the regeneration, the body is healed and renewed, which includes a different appearance and personality. The regenerated person is the same person, with the same memories and basic personality traits; but the person also looks different and a changed personality. Because of this the Doctor could be played by different actors. This made it possible for the series to be filmed over a time of nearly fifty years without having to actually \"change\" the character. ==Incarnations and actors of the Doctor== Up until now, the Doctor has regenerated Fifteen times, Regeneration can be controlled, but is usually decided without the doctor knowing his or her next face. #First Doctor – William Hartnell (1963–1966) #Second Doctor – Patrick Troughton (1966–1969) #Third Doctor – Jon Pertwee (1970–1974) #Fourth Doctor – Tom Baker (1974–1981) #Fifth Doctor – Peter Davison (1981–1984) #Sixth Doctor – Colin Baker (1984–1986) #Seventh Doctor – Sylvester McCoy (1987–1989, 1996) #Eighth Doctor – Paul McGann (1996) #Ninth Doctor – Christopher Eccleston (2005) #Tenth Doctor – David Tennant (2005–2010) #Eleventh Doctor – Matt Smith (2010–2013) #Twelfth Doctor – Peter Capaldi (2013–2017) #Thirteenth Doctor – Jodie Whittaker (2017–2022) #Fourteenth Doctor - David Tennant (2022–2023) #Fifteenth Doctor - Ncuti Gatwa (2023–) The Doctor has been played by other actors in other media, in theatre plays, parodies, etc. But these are not officially part of the Doctor Who storyline. Notable among them are: * Dr. Who and the Daleks and Daleks - Invasion Earth 2150 AD – Peter Cushing (1965/1966) * Scream of the Shalka and The Feast of the Stone – Richard E. Grant (2003) ==References== == Other websites == * The Doctor on the TARDIS Index File Category:Doctor Who characters",
 "title": "Doctor (Doctor Who)"
}