{
 "id": "979300",
 "text": "ZOE Broadcasting Network, Inc. (ZOE TV) is a Philippine broadcast media arm of the Jesus Is Lord Church. Based in Ortigas Center, Pasig, it operates a network of television and radio stations each in the key areas of Mega Manila and some provinces of Baguio, Bacolod, Cebu, Cagayan de Oro, Davao, Iloilo and Puerto Princesa in Palawan. The company also owns its first television station in Metro Manila, VHF 11 and UHF 20 which is currently airing A2Z, a joint- venture partnership between ZOE TV and ABS-CBN Corporation through its agreement. ==Stations== ===TV Stations=== ====Digital terrestrial==== Branding Callsign Ch. # Frequency Station type Power kW (ERP kW) Location (transmitter site) ZOE TV Manila DZOE-TV 20 509.143 MHz Originating 10 kW (Max: 30 kW) Crestview Heights Subdivision, Brgy. San Roque, Antipolo, Rizal (Mega Manila) Light TV Manila DZOZ-DTV 33 587.143 MHz 3 kW (Max: 5 kW) ZOE TV Baguio DWOZ-DTV 32 581.143 MHz Relay 10 kW (Max: 30 kW) Mt. Sto. Tomas, Tuba, Benguet (North and Central Luzon) ZOE TV Iloilo DYZA-DTV 20 509.143 MHz 5.5 kW (Max: 10.5 kW) Brgy. Alaguisoc, Jordan, Guimaras (Western Visayas) ZOE TV Bacolod DYOO-DTV 25 539.143 MHz Automatic Climate Control, Bacolod (Western Visayas)) ZOE TV Cebu DYNZ-DTV 20 509.143 MHz Mount Busay, Brgy. Babag 1, Cebu City (Central Visayas) ZOE TV Zamboanga DXZM-DTV San Jose Road, Zamboanga City (Zamboanga Peninsula) ZOE TV Cagayan de Oro DXEV-DTV Macapagal Drive, Brgy. Bulua, Cagayan de Oro (Northern Mindanao) ZOE TV Davao DXEX-DTV Shrine Hills, Matina, Davao City (Davao Region) ====Planned/Upcoming Stations==== Branding Callsign Ch. # Frequency Station type Power kW (ERP kW) Location (transmitter site) ZOE TV Ilocos Sur 20 509.143 MHz Relay 5.5 kW (Max: 10.5 kW) Bantay, Ilocos Sur ZOE TV Ilocos Norte Relay San Nicolas, Ilocos Norte ZOE TV Batanes Relay Basco, Batanes ZOE TV Tuguegarao Relay Tuguegarao ZOE TV Isabela Relay Santiago, Isabela ZOE TV Olongapo Relay Olongapo ZOE TV Batangas Relay Lipa, Batangas ZOE TV Occidental Mindoro Relay San Jose, Occidental Mindoro ZOE TV Palawan DWDZ-TV Relay Puerto Princesa, Palawan ZOE TV Naga Relay Naga, Camarines Sur ZOE TV Legazpi Relay Legazpi, Albay ZOE TV Sorsogon Relay Sorsogon ZOE TV Catanduanes Relay Virac, Catanduanes ZOE TV Masbate Relay Masbate ZOE TV Aklan Relay Kalibo, Aklan ZOE TV Bohol Relay Tagbilaran, Bohol ZOE TV Dumaguete Relay Valencia, Negros Orietnal (under Dumaguete) ZOE TV Tacloban Relay Tacloban ZOE TV Bukidnon Relay Mt. Kitanglad, Bukidnon ZOE TV General Santos Relay General Santos City ZOE TV Butuan Relay Butuan ====Analog Stations==== Branding Callsign Ch. # Station type Power kW (ERP kW) Location (transmitter site) ZOE TV Manila DZOE-TV 11 Originating 100 kW Crestview Heights Subdivision, Brgy. San Roque, Antipolo, Rizal Light TV Palawan DWDZ-TV 33 Originating 5 kW Puerto Princesa, Palawan ===Radio stations=== Branding Callsign Frequency Power (Watts) Location (transmitter site) Radyo Calabarzon DZJV 1458 kHz 10,000 watts #140 Brgy. Parian, Calamba, Laguna Light FM DWZB 91.1 MHz 5,000 watts Palawan ==Related pages== *People's Television Network *Intercontinental Broadcasting Corporation *DWET-TV *DWNB-TV *DWVN-DTV ==References== Category:Philippine television networks",
 "title": "ZOE Broadcasting Network"
}