{
 "id": "97945",
 "text": "Arthur is an animated television series aimed at 4-to-8-years-old children, developed by Kathy Waugh for PBS and produced by WGBH Boston. The television series is based on the Arthur book series that is written and illustrated by Marc Brown. The series concluded during its 25-season run, the series broadcast 253 half-hour episodes (including specials) ran from October 7, 1996 to February 21, 2022 on PBS Kids (formerly PBS Kids Go!) in the US and January 6, 1997 to May 19, 2022 on TVOKids in Canada. It was the fifth longest-running animated series in the United States, behind The Simpsons, South Park, Family Guy, and SpongeBob SquarePants. ==Characters== ===Children=== Arthur Timothy Read is the main character and protagonist of the series, who focuses the immediate family with most episodes involving Arthur, his youngest sister Dora Winifred and Kate, their parents David and Jane, and their dog Pal. His closest friends include Alan \"The Brain\" Powers, Binky Barnes, Buster Baxter, Francine Frensky, Mary Alice Crosswire, and Sue Ellen Armstrong, along with others as Fern Walters, George Lundgren, Jenna Morgan, and Prunella Deegan as frequent supporting characters. * Fern Walters is one of Arthur's classmates. She is often shy and quiet. She enjoys reading mystery novels. Fern's mother, Doria, tries to get Fern to become more outgoing. * George Lundgren is one of Arthur's classmates. He is well known in his class for being a ventriloquist, performing with his dummy, Wally. He has dyslexia. Initially, he appeared as a minor character, but starting from Season 9, he was joined with Arthur's gang.Arthur #0607a \"The Boy with His Head in the Clouds\" * Jenna Morgan is a minor character in Arthur's grade. She plays badminton. She helps coach soccer. She received an Athlete of the Year award from Michelle Kwan.Arthur #0609a \"The Good Sport\" Jenna has nocturnal enuresis, otherwise known as bedwetting.Arthur #0706b \"Jenna's Bedtime Blues\" * Marina Datillo is Prunella's best friend. She does not appear very often. She is blind. She is obsessed with Henry Skreever, the show's parody of Harry Potter. She and Prunella met when Prunella unwillingly received a Braille edition of the latest Henry Skreever novel and let Marina borrow it. Since then, they have become best friends. Marina is good at yoga. * Maria Pappas is a rabbit in Mr. Ratburn's class. Her clothing usually consists of a striped shirt with blue dress. Her hair is brown, She is mostly seen with Alex, much like him, Maria is very shy and her family is also rarely shown in the series. * Molly MacDonald is close friends with Binky and a bigger bully than him at times. She is known to be good at giving advice.Arthur #0703b \"Don't Ask Muffy\" * Timmy Tibble He is one brother in a group of evil twins who routinely annoy Arthur, D.W. and mostly everyone else with their mischievous behavior, bullying and crime. Timmy wears a blue scarf and is the more mischievous of the twins. * Tommy Tibble He is the other brother in the group of evil twins. Tommy wears a red scarf. ===The adults=== * Mr. Armstrong: Sue Ellen's father, a diplomat. * Mrs. Armstrong: Sue Ellen's mother, is a homemaker with a penchant for exotic clothes. * Bailey: Muffy's chauffeur, and the Crosswire family's butler. He also has a notable talent in creating kinetic art,Arthur #0808a \"Muffy's Art Attack\" and follows Muffy's orders without question. He is 37 years old.Arthur #1709a \"Caught in the Crosswires\" * Bitzi Baxter: Buster's mom, the editor-in-chief of the Elwood City Times. She's overprotective of Buster and a frantic character. * Bo Baxter: Buster's father, who is divorced. He is a pilot. Buster flies with him around the United States in the spin-off series, Postcards from Buster. In Postcards from Buster, he is shown with short brown hair and glasses. However, during his few appearances in earlier seasons of Arthur, his face is noticeably hidden from view, for instance behind a newspaper. He looks almost exactly like Harry, Bitzi Baxter's former boyfriend. His physical appearance has changed several times. * Cisely Compson: Ladonna and Bud's mother. * David L. Read: is a father. * Doria Walters: Fern's mother. She works for a real estate company and is very confident and encouraging in her daughter. * Ed Crosswire: Muffy's father, the owner of a car dealership called \"Crosswire Motors.\" It was revealed that he never attended college;Arthur #1103b \"Prunella Packs It In\" rather he received an honorary degree after his donation of a library. He is also the coach of the soccer team. * Francis Haney: Mr. Haney is the lovable yet absentminded principal of Arthur's school. He, like George, suffers from dyslexia. He also seems to have bad luck: something goes wrong almost everywhere he goes. In the episode \"The Hallway Minotaur\" from Season 20, it was revealed that he had moved away to build a school in Tanzania. Miss Tingley has since replaced him as the principal. * Jane Read: is a mother. * Laverne Frensky: Francine's mother. * Mr. Marco: Arthur's second grade teacher. He appears in some episodes in Season 1. * Marie-Helene: Emily's French nanny. * Millicent Crosswire: Muffy's mother. She likes opera. * Ramon Molina: Arthur's new neighbor. Moved into Mr. Sipple's house when he moved out in Season 6. * Mrs. Molina: Arthur's new neighbor; Ramon's wife. Moved into Mr. Sipple's house when he moved out in Season 6. * Mrs. Morgan: Jenna's mother. * Ms. Morgan: D.W.'s preschool teacher. * Mr. Morris: The Lakewood Elementary School cleaner. In the double-length episode \"April 9,\" he moved to Roswell, New Mexico to live with his daughter after breaking his leg during a fire at the school. * Mr. Sipple: Arthur's odd next-door neighbor from Season 1 to 6, who enjoys barbecuing fish late at night and comes from a place where making faces on a bike means to bring the biker a cabbage. He moves out in Season 6, and the Molinas move in to his home. * Nigel Charles Ratburn: Mr. Ratburn is Arthur and his friends' teacher. His passions are homework and puppetry; he also enjoys magic tricks and spent a summer working at Jack's Joke Shop.Arthur #0209b \"The Short, Quick Summer\" He is also knowledgeable about nearly everything, but is noticeably incompetent with computers. * Oliver Frensky: Francine's dad, who works as an sanitation engineer for the local city dump. He states he was formerly a volunteer firefighter. He is somewhat childish but optimistic in nature. He coaches the baseball team. * Paige Turner: Ms. Turner is the friendly librarian at the Elwood City Library. * Mr. Powers: Brain's father. * Mrs. Powers: Brain's mother, who owns and runs the ice cream shop. Mrs. Powers originally had brown hair for the first season, but Season 8 shows Mrs. Powers with yellow hair, and starting from Season 16, her hair was brown again. * Rufus Compson: Ladonna and Bud's father. He works for the Army Corps of Engineers.Arthur #1810 \"Shelter from the Storm\" * Leah MacGrady: Mrs. MacGrady is the lunch lady at Lakewood Elementary school, where Arthur and his friends study. She is full of unconventional wisdom, and is Grandma Thora's bingo buddy. She commonly wears a pink shirt and white pants. * Miss Sweetwater: She is also a third grade teacher in another Lakewood Elementary School class. She mostly does fun things to her students like singing songs (such as \"I Like Fudge\") on her guitar. * Mrs. Tibble: The grandmother of Tommy and Timmy Tibble. (In early Arthur books, Mrs. Tibble is a human, however many newer books and the show have her as a bear.) * Miss Cecilia Tingley: The current principal of Lakewood Elementary. She has been shown to be very strict, and enforces rules quite often. * Mr. Walters, a dog, Fern's father. He was first seen in Season 11, in the episode Phony Fern. * Wanda Deegan, a poodle. Prunella and Rubella's mother. She enjoys yoga. ==Films== Arthur's Missing Pal released on August 22, 2006 in DVD by Lionsgate Home Entertainment. ==Notes== ==References== ==Other websites== * * Category:1990s American animated television series Category:1990s American children's television series Category:1990s American television series Category:1990s American television series debuts Category:1990s animated television series Category:1990s Canadian animated television series Category:1990s Canadian children's television series Category:1990s Canadian television series Category:1990s Canadian television series debuts Category:1990s children's television series Category:1996 American television series debuts Category:1996 television series debuts Category:1997 Canadian television series debuts Category:2000s American animated television series Category:2000s American children's television series Category:2000s American television series Category:2000s animated television series Category:2000s Canadian animated television series Category:2000s Canadian children's television series Category:2000s Canadian television series Category:2000s children's television series Category:2010s American animated television series Category:2010s American children's television series Category:2010s American television series Category:2010s animated television series Category:2010s Canadian animated television series Category:2010s Canadian children's television series Category:2010s Canadian television series Category:2010s children's television series Category:2020s American animated television series Category:2020s American children's television series Category:2020s American television series Category:2020s American television series endings Category:2020s animated television series Category:2020s Canadian animated television series Category:2020s Canadian children's television series Category:2020s Canadian television series Category:2020s Canadian television series endings Category:2020s children's television series Category:2022 American television series endings Category:2022 Canadian television series endings Category:2022 television series endings Category:American animated television series Category:American children's television series Category:American sitcoms Category:American television series Category:Animated television series Category:Animated television series about cats Category:Animated television series about children Category:Animated television series about dogs Category:Animated television series about monsters Category:Arthur (TV series) Category:Canadian animated television series Category:Canadian children's television series Category:Canadian television series Category:CBBC shows Category:CBeebies Category:Children's animated television series Category:Children's television series Category:Children's television series about talking animals Category:Emmy Award winning programs Category:English-language television programs Category:Flash animation Category:PBS Kids shows Category:Peabody Award winners Category:Television series about animals Category:Television series about families Category:Television series about friendship Category:Television series by Cookie Jar Entertainment Category:TVOKids shows",
 "title": "Arthur (TV series)"
}