{
 "id": "97951",
 "text": "WWE Raw, also known as Monday Night Raw, is a professional wrestling television program made by WWE. It is broadcast every Monday since January 11, 1993. Currently it is the only television broadcast for the Raw brand. Raw is usually seen as WWE's flagship program over its sister programs, WWE SmackDown, WWE NXT and WWE Main Event, because of its longer history and the way it is promoted. == History == === Original format === Starting as WWF Monday Night Raw, the program first started on January 11, 1993 on the USA Network for one hour. The original Raw broke new ground in televised professional wrestling. Traditionally, wrestling shows were taped on sound stages with small viewers or at big arena shows. The Raw formula was very different than that of its predecessor, Prime Time Wrestling. Instead of taped matches, with studio voice overs and taped chat, Raw was a show shot to a live viewers, with angles as they happened. The first episode had Yokozuna winning against Koko B. Ware,winning against The Executioners, WWF Intercontinental Champion Shawn Michaels winning against Max Moon and The Undertaker winning against Damien Demento. The show also featured an interview with Razor Ramon. Raw came from the Grand Ballroom at Manhattan Center Studios, a small New York City theater and played live each week. The combination of an intimate venue and live action proved highly successful. However, the weekly live schedule proved to be a financial drain on the WWF, and taped shows began airing every other week. From early 1994 to September 1999, Raw was shown live on one Monday and then the next day (Tuesday) next Monday's Raw was taped. This meant that Raw was live one week and taped the next. The storylines and characters during the early years of Raw still had a healthy dose of the old Federation \"gimmick-heavy\" style. For example, there were moments such as Irwin R. Schyster tearing up Tatanka's headdress, the different \"Undertaker sightings\" (during the Undertaker vs. Undertaker storyline, leading up to SummerSlam 1994); and characters like Duke \"The Dumpster\" Droese, Doink the Clown, or Thurman \"Sparky\" Plugg. Raw was also one of a kind, in which they covered the unexpected, exciting moments, a prelude to the \"Attitude Era\", in which it coined Raw as \"Uncut, Uncensored, Uncooked.\" Some of those moments are Razor Ramon losing a match unexpectedly to Sean \"The 1-2-3 Kid\" Waltman, who was later known as X-Pac, Marty Jannetty beating Shawn Michaels to win the WWF Intercontinental Championship, and Raw was the first WWF television program of any kind to show footage of Lex Luger bodyslamming Yokozuna at the USS Intrepid. The first hosts of Raw were Vince McMahon, Rob Bartlett and \"Macho Man\" Randy Savage. Sean Mooney conducted the interviews and Bobby \"The Brain\" Heenan also helped contribute. In March 1993, Rob Bartlett was dropped from the broadcasting team and was replaced by Bobby Heenan. Then on December 6, 1993, Gorilla Monsoon kicked Bobby Heenan out of the WWF forever. In reality, this was a storyline between Monsoon and his close friend Heenan, who decided to leave the World Wrestling Federation in order to lighten his travel schedule and because he did not want to take a 50-percent paycut. After about a year, Raw moved out of the Manhattan Center and traveled to various regular Federation venues in the United States. === The Monday Night Wars === In 1995, World Championship Wrestling (WCW) began showing its new wrestling show, Monday Nitro, live each week on TNT (American TV network) . Raw and Nitro went head-to-head for the first time on September 11, 1995. Due to Raw's taping schedule on several occasions, WCW Vice President Eric Bischoff, who was also an on-air personality, would often give away the results of WWF's taped Raw shows on the live WCW show. Some fans also looked at Raw taping results on the steadily-growing Internet; as a result, this caused the ratings of the taped Raw episodes to be lower. WWF Raw had a live broadcast every other week to save costs, until September 1999, when ratings and pay-per-view buy rates had grow, allowing them to justify doing a weekly live show. At the start of the ratings war in 1995 through to mid-1996, Raw and Nitro exchanged victories over each over in a closely contested rivalry. Beginning in mid-1996, however, thanks primarily to the nWo angle, Monday Nitro started a ratings win-streak that lasted for eighty-three continuous weeks, ending on April 13, 1998. ==== Raw is War ==== On February 3, 1997, Monday Night Raw went to a two hour format, as the Attitude Era was starting to come in full stream in the WWF. In an attempt to break the momentum of what had turned into ratings domination by WCW's competing Monday Nitro, Extreme Championship Wrestling (ECW) was brought in as Jerry Lawler \"challenged\" ECW on February 17, 1997. In an episode where Raw returned to the Manhattan Center, the \"challenge\" answered on the following week's show with Taz, Mikey Whipwreck, Sabu, Tommy Dreamer, D-Von Dudley, and the Sandman. ECW owner Paul Heyman did a call-in interview on Raw the week after that. During 1997, there were more and more controversial elements in Raw and WWF programming such as the Nation of Domination, and the D-Generation X \"racial graffiti\" storyline designed to \"implicate Bret Hart's 'the Hart Foundation'\", and the \"XXX Files\" series. On March 10, 1997, Monday Night Raw officially became Raw is War. The March 17, 1997 episode featured a heated Bret Hart/Vince McMahon ringside altercation (that unknowingly foreshadowed events in November) with profanity normally unheard on TV. Brian Pillman did a series of \"XXX Files\" segments with Terri Runnels, which further \"pushed the envelope\". These segments ended prematurely with the September 29, 1997 episode of Raw, after the death of Pillman on October 5, 1997 due to hereditary heart problems. After WrestleMania XIV in March 1998, the WWF regained the lead in the Monday Night Wars with its new \"WWF Attitude\" brand, led in particular by rising stars Steve Austin, The Rock and Mankind. The classic feud between the villainous WWF Chairman Vince McMahon (who was re- imagined and re-branded from the color commentator into the evil company chairman character Mr. McMahon after the real-life Montreal Screwjob incident) and fan favorite Steve Austin (who had been released by Bischoff in the summer of 1995 for not being marketable) caught the imaginations of fans. The April 13, 1998 episode of Raw, headlined by a match between Austin and McMahon, marked the first time that WCW had lost the head-to-head Monday night ratings battle in the 84 weeks since 1996. While Raw was taking a new approach to programming, Nitro would start making lackluster shows with the same storylines. Older stars such as Hogan and Nash frequented the main events, while younger talent such as Chris Jericho, Chris Benoit and Eddie Guerrero were not given opportunities to advance, and the only newcomer elevated to main-event status at this time was Bill Goldberg. Meanwhile, on Raw, fans were immersed in the feud between WWF owner Mr. McMahon and \"Stone Cold\" Steve Austin. New talent such as Triple H and his D-Generation X faction, Mankind and The Rock were elevated to main event status on the WWF's program. Superstars such as Kane, Val Venis, Goldust, etc. were coming through the ranks and exposing the WWF as the place where new talent comes through unlike the WCW counterpart. Things were so heated between the two programs that, when both shows were in the same area on the same night (Raw in Hampton, Virginia, Nitro in Norfolk), D-X was sent to film a \"war\" segment at the Norfolk Scope where they berated WCW and interviewed fans on camera who stated that they received their Nitro tickets for free (presumably in an attempt by WCW to pack the arena as full as possible due to low ticket sales). On January 4, 1999. Mick Foley, who had wrestled for WCW in the early 1990s as Cactus Jack, won the WWF Title as Mankind on Raw. On orders from Bischoff, Nitro announcer Tony Schiavone gave away this previously taped result on the live Nitro, and then sarcastically added \"that'll sure put some butts in the seats\"; over 600,000 viewers changed channels to watch Raw. This was also the night that Nitro aired a WCW World Championship match in which Kevin Nash blatantly laid down for Hulk Hogan after Hogan poked him in the chest. The next week, and for months after, many fans in the Raw audience brought signs which read, \"Mick Foley put my ass in this seat!\" ==== The end of the Wars ==== A new television contract with Viacom led to a WWF change in the broadcast. On September 25, 2000, Raw moved from the USA Network to TNN (which later became Spike TV). WCW's sharp decrease in revenue and ratings led to Time Warner's sale of the company to the WWF in 2001. The last version of Nitro was shown on March 26, 2001. The show began with Vince McMahon making a short statement about his recent purchase of WCW and ended with a simulcast on Raw on TNN with an appearance by Vince's son Shane McMahon on Nitro. Shane interrupted his father's gloating over the WCW purchase to explain that Shane was the one who actually owned WCW, setting up what become the WWF's \"Invasion\" storyline. The Raw is War logo and name were retired in September 2001, following the September 11, 2001 attacks and sensitivity over the word war. It also symbolized that professional wrestling's \"Monday Night Wars\" were over. === Brand Extension === In early to mid-2002, WWE had a process they called the \"Brand Extension\". WWE divided itself into two \"de facto\" wrestling promotions with separate rosters, storylines and authority figures. Raw and SmackDown! would host each division, give its name to the division and essentially compete against each other. The split was a result of WWF purchasing their two biggest competitors, WCW and ECW. The brand extension was publicly announced during a telecast of WWF Raw on March 25, 2002, and became official the next day. Wrestlers now would become show-exclusive, wrestling for their specific show only. At the time this excluded the WWE Undisputed Championship and the WWE Women's Championship, as those WWE titles would be defended on both shows. In August 2002, WWE Undisputed Champion Brock Lesnar did not want to defend the title on Raw, in effect causing his title to become exclusive to SmackDown! The following week on Raw, General Manager Eric Bischoff awarded a newly instated World Heavyweight Championship to Raw's designated #1 contender, Triple H. Due to the fact that since the WWE Undisputed Championship was now SmackDown! exclusive it was no longer seen as \"undisputed\". Following this, the WWE Women's Championship soon became Raw- exclusive as well. As a result of the Brand Extension, an annual \"draft lottery\" was instituted to exchange members of each roster and generally refresh the lineups. WWE Raw said they have earned the distinction of having the most original episodes of any fictional weekly program on August 2, 2005 when it broadcast the 636th episode. It was said to have took the place of Gunsmoke, which held that distinction. However, under the criteria WWE used to make this claim, the actual record would be held by the show Georgia Championship Wrestling, which ran continuously on Saturday evenings on TBS between 1972 and 1984. === Return to USA Network === On March 10, 2005, Viacom and WWE decided not to go on with the agreement with Spike TV, making it so Raw and other WWE programs on the network would cease when their deal expired in September 2005. On April 4, 2005, WWE announced a 3-year deal with NBCUniversal to bring Raw back to its old home, the USA Network, with 2 yearly specials on NBC and a Spanish Raw on Telemundo.msnbc.msn.com On the same week as Raw's restart on USA, Spike TV scheduled Ultimate Fighting Championship's live Ultimate Fight Night in Raw's old timeslot in a try to go head-to-head with Raw. The show's first night back on USA was billed as the \"WWE Homecoming\" and featured the return of former WWE Champions such as Hulk Hogan, Steve Austin, Mick Foley, Triple H and Mr. McMahon along with cameos from legends such as Roddy Piper, Jimmy Hart, Jimmy Snuka and Harley Race. WWE Homecoming was three hours long — the longest an episode of Raw has ever run in its 12-year history. USA also showed Raw Exposed, an hour of the best moments of Raw during its previous run on USA. WWE announced that Raw got its highest ratings in three years, gaining close to six million viewers. The following week, Mr. McMahon fired Jim Ross for not helping after Steve Austin gave him and his entire family the Stone Cold Stunner. Jonathan Coachman, the second analyst at the table, took over Ross's duties as play-by-play for two weeks until former ECW announcer Joey Styles was hired. ==== 2006 ==== On the May 1 episode of Raw, Styles said he was quitting (kayfabe). His vacating of the announcer position set the stage for Jim Ross to return to Raw's commentary booth, thus ending the storyline where Ross got fired by Linda McMahon. This freed Styles to become a commentator for the ECW brand when it launched in June. In Canada, after an 11-year run on TSN, Raw moved to rival sports broadcaster The Score after it was announced that TSN would be carrying Monday Night Football' for the 2006 season. This also meant that Canadian viewers would be watching via tape-delay, as The Score did not broadcast Raw live at first, but in 2007, started airing the show live. During the September 25 episode of Raw in Oklahoma City, Oklahoma, the opening of Raw suffered a blackout. Spotlights were the only lights running in the house. Power in the presentation was later back. Another similar moment happened back on May 26, 1996 in Florence, South Carolina for WWF In Your House 8: Beware of Dog, when a major thunderstorm hit the Florence Civic Center causing major chaos for the PPV. That Tuesday, Beware of Dog returned to North Charleston, South Carolina to finish out three matches that were not shown because of the lost power feed. On October 9, Raw held a three hour season start called the \"Raw Family Reunion\", where the Raw brand had a new logo and theme song, Papa Roach's \"...To Be Loved\". The episode also featured talent from the SmackDown! and ECW brands. Later that month, on October 23 Raw aired its 700th episode, making it the longest running weekly entertainment show, without a hiatus, in television history. ==== 2007 ==== On June 25, Raw was scheduled in Corpus Christi, Texas to be a three-hour special memorial show for the (kayfabe) death of the Mr. McMahon character after he had been presumed dead in a limo explosion. The event was canceled due to the real death of Chris Benoit and his family earlier that day, with a three-hour Chris Benoit memorial show being shown instead. This was the first time that Raw had been shown with no viewers and had Vince McMahon breaking kayfabe to address the viewers at home. The show had extracts from the DVD Hard Knocks: The Chris Benoit Story, showing some of Benoit's most memorable matches, along with comments from some of Benoit's colleagues. However, when the facts of Benoit's death came to light, WWE pulled this episode from international markets which aired Raw on a tape delay basis. Several channels announced the episode was being withheld for legal reasons. A substitute Raw, hosted by Todd Grisham from WWE Studios, was created featuring recaps of big-time championship changes of the past year. The episode started with a message from Vince McMahon which originally aired on the edition of June 26 of ECW. John Cena's 380 day championship reign was ended due to injury by Randy Orton on the October 1 episode of Raw. Orton won the title that Sunday at No Mercy. On December 10, Raw celebrated its 15th anniversary in a three-hour spectacular on the USA Network with the returns of Stone Cold Steve Austin, Rob Van Dam, The Godfather, Steve Blackman, Howard Finkel, Ted DiBiase, Eric Bischoff, Marty Jannetty, Gangrel, Trish Stratus, Lita, Sunny, Hulk Hogan and Mick Foley (as Mankind) among others. Along with several reunions of former tag teams and also included a 15-man \"15 Years of Raw\" battle royal. The RAW XV: 15th Anniversary DVD was also sold that had the best moments in Raw history. ==== 2008 ==== In April 2008 as part of the United States presidential election, candidates Barack Obama, John McCain and Hillary Clinton presented special messages on Raw. The show was watched by an estimated 4.97 million viewers, of which there were 1.45 million viewers who were men aged 18 to 34: an important group of voters the candidates were trying to talk to. ==== 2009 ==== In 2009, at No Way Out that February 15, Edge won the World Heavyweight Championship in Raw's Elimination Chamber match, thus making it a SmackDown exclusive title and giving SmackDown two top tier championships. As a result of the 2009 WWE Draft in April, WWE Champion Triple H was drafted to the Raw brand, while the World Heavyweight Championship moved to the Raw brand after Edge lost the title to John Cena at WrestleMania XXV. SmackDown would regain the World Heavyweight Championship at Backlash (2009) when Edge defeated John Cena to win the championship. In addition, SmackDown and Raw would exchange both women-exclusive championships with Raw gaining the WWE Divas Championship and SmackDown gaining the WWE Women's Championship. Also, SmackDown and Raw exchanged the WWE Intercontinental Championship which is now exclusive to SmackDown and the WWE United States Championship which is exclusive to Raw Brand, for the first time ever. On June 15, 2009, Mr. McMahon announced on a special three-hour edition of Raw that he had \"sold\" the WWE Raw franchise to Donald Trump, who appeared on-screen to confirm it and declared he would be at the following commercial- free episode in person. WWE issued a press release on the scripted sale while the USA Network later issued a statement confirming the \"sale\" as part of a storyline. The statement was issued in response to multiple news sources having mistakenly reported the event as legitimate. Due to the mistake, on the day following the announcement, WWE's stock on the New York Stock Exchange notably fell. Despite USA Network's acknowledgment that the sale was fictional, Randy Katz, a securities lawyer with Baker & Hostetler, commented on the Fox Business Network that a probe by the U.S. Securities and Exchange Commission against WWE and USA Network owner General Electric \"certainly is a possibility\". The next week, McMahon repurchased Raw from Donald Trump and announced that a \"Guest host\" initiative originally introduced by Trump in response to the position of General Manager being vacant would go in effect on June 29. Each weekly guest host was usually either a WWE Hall of Famer, a former or returning talent, or other celebrity. The guest host or hostess assumes the role of a brand General Manager, serving as Raw's authority figure for the day. The following year, it was announced that with Vickie Guerrero (and subsequently Bret Hart) becoming the new full-time GM, the guest hosts (while continuing to appear) would no longer have booking power. ==== 2010–present ==== In 2010, TNA iMPACT!, which normally airs on Thursdays, would go head to head with Raw in a three-hour live broadcast. This would be the first time since March 2001 that two major wrestling promotions would go head-to-head in a Monday night ratings competition. TNA promoted the debut of Hulk Hogan leading to the broadcast. WWE countered by announcing the return of Bret Hart, who had not appeared with the company since the Montreal Screwjob in 1997. The ratings showed that, much like the first Monday Night War, Raw came out on top, averaging 5.6 million viewers while iMPACT! averaged 2.2 million viewers. On March 8, 2010, iMPACT! permanently moved to Monday nights to compete head-to-head with Raw. After declining ratings, Spike executives announced that starting April 5, Impact! would air an hour earlier than Raw. After scoring its lowest ever rating at 0.5, it was announced May 3 that Impact! would be moving back to its original time on Thursdays starting May 13. Since then on April 19, 2010, many of the WWE Raw superstars were stranded in Belfast due to the ash cloud from Eyjafjallajökull (a volcano in Iceland) hovering over most of Europe and causing many flights to be put on hold. Former ring announcer Lilian Garcia announced that night while the SmackDown roster took part in production of the Raw episode. The following month on May 17, 2010, Raw aired its second overall commercial free episode from the Air Canada Centre in Toronto, Ontario. That summer on August 30, 2010, Raw aired its 900th episode, SmackDown superstars and NXT rookies also appeared on this milestone episode. It featured The Undertaker vs Bret Hart for the first time in almost 14 years. That November, Raw went \"Old School\" for one night with the old ring and titantron designs. This episode featured WWE legends Hacksaw Jim Duggan, Mae Young, Ted Dibiase, Ron Simmons, The Iron Sheik and many more. Mark Henry briefly returned to his \"Sexual Chocolate\" gimmick in honor of Raw going \"Old School\". On February 14, 2011, The Rock returned to WWE as he was announced as the host for WrestleMania XXVII. On the April 6 episode of Raw following WrestleMania 27, Rock and Cena agreed to a match at WrestleMania 28. On June 27, CM Punk was suspended after he cut a shoot promo on Raw mocking Vince McMahon, Hulk Hogan, The Rock and taking stabs at WWE management. At Money in the Bank, Punk left WWE with the WWE Championship and Raw held a tournament for a new champion won by John Cena. CM Punk returned on July 23. Triple H became COO of WWE and began operating day-to-day operations. At SummerSlam the titles were unified. On the August 29 episode of Raw, Triple H announced that talent from SmackDown could appear on Raw and Raw talent could appear on SmackDown, therefore ending the Brand Extension. The Miz and R-Truth were fired and chaos happened at Hell in a Cell and on Raw, resulting in Triple H no longer being able to operate Raw due to the vast majority of the roster walking out. John Laurinaitis became GM. Punk won his second WWE Championship at Survivor Series. On January 2, 2012, Chris Jericho returned to WWE and promised to win the Royal Rumble which he did not. Brock Lesnar returned to WWE on the April 2 episode. On July 23, Raw celebrated its 1000th episode, with every episode now being three hours long from that point on until October 7, 2024. Starting on September 17, Raw along with the rest of WWE programming had a pink rope in the middle of the ring to promote breast cancer until October 29. On the November 19 episode of Raw, CM Punk celebrated 365 days as WWE Champion. On the January 7, 2013 episode of Raw, The Rock came back again. On January 14, Raw celebrated 20 years. CM Punk's championship reign was ended at the Royal Rumble at 434 days. On the March 4 episode of Raw they went Old School for the second time. The following episode of Raw was a tribute to the late Paul Bearer, The Undertaker and Kane led the tribute but were twice interrupted by Undertaker's WrestleMania 29 opponent, CM Punk. On January 23, 2024, WWE's parent company TKO Group announced that Raw would air on Netflix beginning on January 6, 2025 in United States, Canada, the United Kingdom, and Latin America, therefore leaving linear television in these areas. == Production == As of 2025, Raw is shown live on Monday evenings on Netflix, though it is sometimes taped and placed on a broadcast delay depending on what circumstances dictate. The theme song for the Raw brand is \"4x4\" by Travis Scott since January 6, 2025.https://thesource.com/2024/11/19/travis-scott-to-appear-on-wwes-monday- night-raw-netflix-debut/ Before that the theme song was \"Born To Be\" by Def Rebel, which was used from November 20, 2023 to December 30, 2024. Since March 10, 1997, broadcasts of Raw were split into two hours and given hourly names for television ratings purposes, with the first hour being referred to as Raw is War and the second as War Zone by the show's on-screen graphics. However, as of October 1, 2001, the first hour has been referred to as Raw and the second as Raw Zone by the show's on-screen graphics. On January 7, 2008, WWE said that all 3 brands (Raw, SmackDown, and ECW) would be broadcast in HD, codenamed \"WWE HD\" starting with Raw on January 21. WWE invested about $20 million on new recording and broadcasting equipment to prepare for the move, as well as new pyrotechnics and lighting. The move replaced the RAW, SmackDown, and ECW sets with a new state of the art set shared by all brands. === Broadcasting notes === The show currently airs live on Netflix in the United States, as well as internationally on various TV stations. Sometimes, Raw is filmed and broadcast the same evening when WWE is on an overseas tours. === Special episodes === Episode Title Date Rating Note Episode 1 January 11, 1993 Unknown WWF Raw Bowl January 1, 1996 2.6 WWF Raw Championship Friday September 6, 1996 2.4 WWF Royal Rumble Raw February 3, 1997 2.6 WWF Raw is Owen May 24, 1999 7.2 The 2002 Draft March 25, 2002 5.4 WWE Raw X (10th) Anniversary January 13, 2003 3.9 The 2004 WWE Draft March 22, 2004 4.5 WWE Raw Homecoming October 3, 2005 4.4 Eddie Guerrero Tribute Show November 14, 2005 4.5 WWE Tribute to the Troops December 19, 2005 3.7 WWE Raw Family Reunion October 9, 2006 3.8 WWE Tribute to the Troops December 25, 2006 2.7 WWE Draft 3-Hour Special June 11, 2007 3.8 Chris Benoit 3-Hour Memorial June 25, 2007 3.8 WWE Raw 15th Anniversary Spectacular December 10, 2007 4.4 WWE Tribute to the Troops December 24, 2007 2.5 WWE WrestleMania Rewind Night March 10, 2008 3.6 WWE King of The Ring April 21, 2008 3.0 2008 WWE Draft June 23, 2008 3.4 Raw's 800th Episode November 3, 2008 3.04 WWE Slammy Special December 8, 2008 3.02 2009 WWE Draft April 13, 2009 3.73 The 3-For-All June 15, 2009 3.72 Trump Raw June 22, 2009 4.5 Raw began with a smaller set, blue ring aprons and the ropes coloured red, white and blue. In 1997, they changed the ropes to a plain red set and the titantron to feature a WWF logo and Raw Is War written everywhere including printed on the ring aprons. In 2002, they updated the logo and the ring now with a WWE.COM logo on the far sides. The ropes were sometimes black when they switched a few times per year. In 2006, they updated the Raw logo again and from October to December had the ropes black and removed the WWE.COM logo to have a Raw logo all around the ring. In December, they brought the red ropes back and in February brought back the WWE.COM logo. In January 2008, they updated the Raw set to a new HD set and the ring aprons were now red and silver instead of black. In April 2010, they changed the ring ropes to an all white scheme. In July 2012, they changed the ring aprons back to black with the new Raw logo and updated the HD set. == On-air personalities == === Champions === === General Managers === General Manager Date started Date finished Eric Bischoff July 15, 2002 December 5, 2005 Steve Austin (Co-GM) April 28, 2003 November 16, 2003 Mick Foley (Co-GM) December 1, 2003 December 11, 2003 Eric Bischoff November 6, 2006 August 5, 2007 Mr. McMahon December 12, 2005 June 11, 2007 Jonathan Coachman (Interim GM) June 18, 2007 August 6, 2007 William Regal August 6, 2007 May 19, 2008 Mike Adamle July 28, 2008 November 3, 2008 Stephanie McMahon November 8, 2008 March 30, 2009 Vickie Guerrero April 6, 2009 June 8, 2009 Guest host(s) June 29, 2009 Unknown 1 This was a reward from Mr. McMahon to Bischoff for his refereeing job at Cyber Sunday. 2 On May 29, 2006, Mr. McMahon made Jonathan Coachman his Executive Assistant. Upon doing so McMahon stated \"No one could replace me as GM\", in essence giving Coachman GM powers under a new title. Was officially named Interim GM by the McMahon family following McMahon's limo incident. 3 On August 6, 2007, Mr. McMahon announced that an over the top rope battle royal featuring other participants from the Raw roster would determine a new GM for Raw. William Regal won the battle royal. becoming the new GM, and Jonathan Coachman became his assistant. * Jonathan Coachman - Executive Assistant (May 29, 2006 – June 18, 2007; August 6, 2007 – January 4, 2008) === Commentators === Commentators Year(s) Vince McMahon, Randy Savage and Rob Bartlett January 1993-March 1993 Vince McMahon and Bobby Heenan March 1993-December 1993 Vince McMahon and Johnny Polo December 1993-March 1994 Vince McMahon and Randy Savage March 1994-May 1994, August 1994 - October 1994 Gorilla Monsoon and Randy Savage June 1994 - July 1994 Vince McMahon and Jerry Lawler October 1994-November 1994 Vince McMahon and Shawn Michaels November 1994-February 1995 Vince McMahon and Jerry Lawler February 1995-November 1997 Kevin Kelly and Jerry Lawler December 1997-March 1998 Jim Ross and Jerry Lawler September 1996–February 2001 Jim Ross and Paul Heyman February 2001-November 2001 Jim Ross and Jerry Lawler November 2001-October 2005 Jim Ross, Jonathan Coachman, and Jerry Lawler August 2005-October 2005 Joey Styles and Jerry Lawler November 2005-May 2006 Jim Ross and Jerry Lawler May 2006–June 2008 Michael Cole and Jerry Lawler June 2008-January 2015 Michael Cole, Corey Graves, and Booker T July 2016-Present === Ring announcers === Ring announcer Year(s) Howard Finkel January 1993-August 1999 Tony Chimel April 1997-August 1999 Lilian Garcia August 1999-present Justin Roberts March 2007-June 2007, September 2009-Unknown === Recurring segments === Segment Host Years active Notes Raw Girls N/A 1993 Between matches, women otherwise uninvolved in the wrestling product carried signs bearing slogans around the Raw ring. The King's Court Jerry \"The King\" Lawler 1993–1995 Inspired by Piper's Pit; also appeared on WWF Superstars The Heartbreak Hotel Shawn Michaels 1994 Inspired by Piper's Pit; also appeared on WWF Superstars The Brother Love Show Brother Love 1995 Returned for a brief stint. The Love Shack Dude Love 1997–1998 Short-lived interview segment hosted by Dude Love Highlight Reel Chris Jericho 2003–2005 2008–present Made regular appearances until Jericho's sabbatical from professional wrestling. Recurred in 2008 after Jericho returned to professional wrestling. White Boy Challenge Rodney Mack 2003 Challenge to Caucasian wrestlers to defeat Rodney Mack in under five-minute stipulation. Ended in the same year by Goldberg WWE Diva Search Jonathan Coachman (2004–2005) The Miz (2006) Todd Grisham (2007) 2004–2007 Segments were featured weekly on Raw. Masterlock Challenge Chris Masters 2005–2007 A challenge to any wrestler (local or active superstar on WWE roster) to break the Masterlock. Ended after it was broken by Bobby Lashley in March 2007, however it re-debuted on SmackDown!, when Masters was drafted to that brand. Kurt Angle Invitational Kurt Angle 2005 Introduced to Raw, when Kurt Angle was drafted from SmackDown!. Ended on Raw, when Eugene won the invitational; Angle would end the challenge after winning his gold medals back at SummerSlam 2005. Carlito's Cabana Carlito 2005–2007 Introduced to Raw after being brought from SmackDown! by Carlito Piper's Pit Roddy Piper 2005 Appeared on two separate occasions, with Piper interviewing Shawn Michaels and Mick Foley in that same year. The Cutting Edge Edge 2005–2007 Launched by Edge; used only for special occasions. Occasionally is seen on SmackDown after Edge was moved there. Matt Striker's Classroom Matt Striker 2005–2006 In this segment, Striker acts as a teacher (his former real-life profession) and insults the audience's intellectual capacity. The segment transferred to ECW when Striker was moved to that brand. Kiss Cam Maria 2005–2009 This segment involves the host trying to persuade random people in the audience to kiss when they see their faces on the titantron within a heart shaped graphic. The most frequent host of Kiss Cam is Maria, although others on the Raw brand have hosted the popular segment. V.I.P. Lounge Montel Vontavious Porter 2009-2010 ==Related pages== * WWE roster (Raw brand) * WWE Heat * WWE NXT * WWE SmackDown * ECW (WWE) == References == == Other websites == * WWE Raw at USANetwork.com Category:1993 American television series debuts Category:American television series Category:WWE Raw Category:English- language television programs",
 "title": "WWE Raw"
}