{
 "id": "979621",
 "text": "DYET-TV (channel 21) is a television station in Metro Cebu, Philippines, serving as the Visayas flagship of the TV5 network. It is owned and operated by the network's namesake corporate parent; TV5 also provides certain services to RPTV affiliate DYKC-TV (channel 9) and One Sports outlet DYAN-TV (channel 29) under an airtime lease agreement with station owners Radio Philippines Network and Nation Broadcasting Corporation, respectively. The station maintains master control at the TV5 Complex, Capitol Road, Camp Marina, Brgy. Kalunasan, Cebu City, while DYET-TV's analog transmitter is located atop of Mount Busay, Cebu City, and digital trasnsmitter is located at San Carlos Heights, Quiot Pardo, Cebu City. ==History== *September 11, 1963 – DYMT-TV Channel 11, the first broadcast in the whole Central Visayas was launched by Associated Broadcasting Corporation, becoming the second VHF television station established in Cebu City at the time until 1972 when President of the Philippines Ferdinand Marcos declared Martial Law and it was forced to shut-down. *April 1, 1992 – the station was opened as the Associated Broadcasting Company (a month after the reopening of DWET-TV channel 5 in Metro Manila) with the callsign of the provincial station, DYET-TV as well as its frequency from VHF Channel 11 to UHF Channel 21, which becoming the first ever UHF TV station in Cebu City, Philippines and started regular commercial telecast. Its studios were at the 12th floor of the Sundowner Centrepoint Hotel along Plaridel St. cor. Osmeña Blvd. Broadcasting with a 5,000 watts power capacity, the station covers Metro Cebu, Northeastern Cebu (including Compostela), Southeastern Cebu up to Carcar, Northern & Central Bohol and part of Western Leyte. Elmer Rivera Karaan was the experienced broadcast journalist of ABC 21 Cebu during the hourly news update. *December 9, 1994 – ABC TV stations acquired a new franchise to operate on December 9, 1994, under Republic Act 7831 signed by President Fidel V. Ramos. In the same year, the station went on nationwide satellite broadcasting. In a surge of phenomenal growth, ABC Cebu earned its reputation as \"The Fastest Growing Network\" under new network executive Tina Monzon-Palma who served as Chief Operating Officer. *1996 – ABC Cebu transferred to their new studio and transmitter complex at Brgy. Kalunasan, Cebu City. *October 2003 – ABC was acquired by a group led by businessman Antonio \"Tonyboy\" O. Cojuangco Jr. former Chairman of PLDT and owner of Dream Satellite Broadcasting and Bank of Commerce, among other assets. *March 2008 – Cojuangco announced that ABC had reached a partnership with MPB Primedia, Inc., a local company backed by Media Prima Berhad in Malaysia as part of a long-time strategy to make the network more competitive. ABC signed off for the last time at around 22:00 PHT on August 8, 2008, with its late night newscast Sentro as the last program on air, and then aired a countdown to its re-launch for much of the next day until 19:00 PHT, when the network officially re-launched under its new name of TV5. Its programming lineup aims towards \"progressive Pinoys including those young at heart\" (market classes C and D). On October 20, 2009, TV5 Cebu, along with its affiliate ABC TV stations was acquired by PLDT's broadcasting division MediaQuest Holdings, Inc. from the consortium led by the Cojuangco group and Malaysia-based broadcaster Media Prima Berhad. *April 4, 2010 - a month after the two acquisitions was completed as announced by PLDT chairman Manny V. Pangilinan, TV5 Cebu was reformatted, with a new lineup of programming and branding as the \"Kapatid\" (\"sibling\") network. *May 16, 2011 – TV5 Cebu was relaunched with the newly analog transmitter in Mt. Busay, Brgy. Babag 1, Cebu City from its old transmitter tower at ABC/TV5 Complex in Kalunasan that had been used to be transferring in 1996. Following the relaunch, the station operates on the newly-upgraded 232,800-watt stereo TV transmitter (replaced its two-decade old 5-kilowatt transmitter) for clearer and better signal reception to entire Central Visayas region.Aces overwhelm hapless Express, score second win | Sports, News, The Philippine Star | philstar.com On July 16 of the same year, the station launched its first regional newscast Aksyon Bisaya with Atty. Ruphil Fernandez Bañoc and Darlene Sino-Cruz as its first anchors. *April 13, 2013 – TV5 Cebu launching its new programs in Cebu was introduced during the network's mall show in Parkmall, Mandaue City, along with the network's other drama series such as Manok ni San Pedro, Antigo and other network's programs. *September 8, 2016 – TV5 Network decided to cancelled its production following the newscast was ended, although its 12 reporters and cameramen were remain employed from the news department as part of the cost-cutting measures by the network to sustain its day-by-day operations. In the future, TV5 Cebu is now downgraded as a relay (satellite-selling) station effective September 11. *February 17, 2018 – in line with the recent changes within the network and in celebration of its 10th anniversary, TV5 Cebu was relaunched as The 5 Network with a new logo and station ID entitled Get It on 5, whereas the TV on the northeastern quadrant of the logo has been dropped, making it more flexible for the other divisions to use it as part of their own identity. *January 13, 2019 – coinciding with the reformat of AksyonTV to 5 Plus, 5 Cebu introduced a variation of its 2018 logo. It has also since included the websites of the division producing the program airing (e.g. TV5.com.ph for entertainment and blocktimers) as part of their on-screen graphics. *August 15, 2020 – 5 Cebu reverted to its former name, TV5 (while retaining the variation of its current numerical logo that was introduced in January 2019), as the network. *Novembe4 9, 2020 - TV5 Cebu re-upgrading back to an originating station with the launching of regional newscast Frontline Central Eastern Visayas. *June 16, 2021 – TV5 Cebu commenced its ISDB-T digital test broadcast on UHF Channel 18. *December 16, 2021 - TV5 Cebu went off the air in a few days following the effects of Typhoon Odette at the evening in which damaged the electrical lines and trees after many homes in Cebu has no electricity brought about the typhoon. On December 20 of the same year, however, the station went back on the air after power was restored in Brgy. Kalunasan just in time for Christmas Day. ==TV5 Cebu programming== ===Current=== *Frontline Central Eastern Visayas *Sinulog Festival (annually, every 3rd Sunday of January) ===Former=== *Aksyon Alerto *Aksyon Bisaya (2011–2016) *Antigo (2013; blocktimer) *Si Goot da Wanderpol (original incarnation: early 90s, revival: 2014-2015- blocktimer) *Live on 21 *Manok ni San Pedro (2013; blocktimer) *The Food Show: Mangaon Ta, Bai! (2015) *Tara Na! Suroy Suroy Ta! (2015) *Julie's ChiefBaker - Student Edition (season 2) *Let's Do Business (2014-2016) *Klasmit TV I Luv U Mekaniko (2014-2016) *One Plus Shop TV (2015–2016) ==Digital television== UHF Channel 18 (497.143 MHz) Channel Video Aspect Short name Programming Notes 21.01 480i 4:3 TV5 TV5 Cebu Commercial free-to-air broadcast 21.02 480i 16:9 OnePH One PH 21.03 480i 16:9 One Sports One Sports Commercial free-to-air broadcast 21.35 240p 4:3 One Seg S1 TV5 Cebu 1seg broadcast ==Rebroadcasters== DYET-TV's programming is relayed to the following stations across the Central Visayas, and most of the Eastern Visayas. Station Transmitter Location Channels ERP DY__-TV Tacloban 40 (UHF) 5 kW == Areas of coverage == === Primary areas === * Cebu City * Cebu ==== Secondary areas ==== * Portion of Bohol * Portion of Leyte * Portion of Negros Oriental ==Related pages== * TV5 * List of television and radio stations owned by TV5 Network * Radyo5 101.9 News FM Cebu ==References== Category:1990s establishments in the Philippines Category:1992 establishments in Asia Category:Filipino television stations",
 "title": "DYET-TV"
}