{
 "id": "979784",
 "text": "The attorney general of New York is the state attorney general of the U.S. state of New York and is the head of the New York Department of Law.Executive Law § 60. \"There shall continue to be in the state government a department of law. The head of the department of law shall be the attorney-general.\" The attorney general is also the highest-paid state attorney general in the country. Letitia James is the current attorney general of New York, in office since January 2019. == Duties == The attorney general advises the executive branch of state government and defends actions and proceedings in the state. The Department of Law are divided into five major divisions such as, Appeals and Opinions, State Counsel, Criminal Justice, Economic Justice and Social Justice. ==List of attorneys general of New York== ===Province of New York (1684–1776)=== Image Attorney general Tenure Notes Took office Left office Thomas Rudyard 1684 December 1685 Appointed by Gov. Thomas Dongan James Graham 10 December 1685 1688 Afterwards attorney general of Dominion of New England, 1688. Member of Dominion of New England, May 1668 – April 1689 Jacob Milborne 1690 1691 Hanged for treason, 1691 Thomas Newton 1691 April 1691 Removed from office by governor George Farewell 1691 1692 (Acting) Removed from office by governor James Graham June 1692 21 January 1701 Died 27 January 1701 Sampson Shelton Broughton 5 April 1701 Died February 1705 John Rayner 12 July 1708 Absent in England. Died 1719. May Bickley 1708 1712 Acting AG in Rayner's absence. Removed from office by governor, 1712 David Jamison 10 June 1712 1721 Acting AG in Rayner's absence, 1712–20 James Alexander 1721 1723 Richard Bradley 1723 28 August 1752 William Smith the elder August 1752 William Kempe November 1752 19 July 1759 John Tabor Kempe 1759 James Duane 1767 Acting AG in Kempe's absence. ===New York State (1777–present)=== Image Attorney general Tenure Party Notes Egbert Benson May 8, 1777 – May 14, 1788 Richard Varick May 14, 1788 – September 29, 1789 Federalist Aaron Burr September 29, 1789 – November 8, 1791 Dem.-Rep. Third vice president of the United States Morgan Lewis November 8, 1791 – December 24, 1792 Dem.-Rep. Nathaniel Lawrence December 24, 1792 – November 13, 1795 Dem.-Rep. Josiah Ogden Hoffman November 13, 1795 – February 3, 1802 Federalist Ambrose Spencer February 3, 1802 – February 3, 1804 Dem.-Rep. John Woodworth February 3, 1804 – March 18, 1808 Dem.-Rep. Matthias B. Hildreth March 18, 1808 – February 2, 1810 Dem.-Rep. Abraham Van Vechten February 2, 1810 – February 1, 1811 Federalist Matthias B. Hildreth February 1, 1811 – July 11, 1812 Dem.-Rep. Died in office Thomas Addis Emmet August 12, 1812 – February 13, 1813 Dem.-Rep. Abraham Van Vechten February 13, 1813 – February 17, 1815 Federalist Martin Van Buren February 17, 1815 – July 8, 1819 Dem.-Rep. Eighth president of the United States Thomas Jackson Oakley July 8, 1819 – February 12, 1821 Federalist Samuel A. Talcott February 12, 1821 – January 27, 1829 Dem.-Rep. First appointed, in 1823 elected by State Legislature, resigned shortly before the end of his second term Greene C. Bronson January 27, 1829 – January 12, 1836 Democratic Elected a justice of the State Supreme Court during his third term Samuel Beardsley January 12, 1836 – February 4, 1839 Democratic Willis Hall February 4, 1839 – February 7, 1842 Whig George P. Barker February 7, 1842 – February 3, 1845 Democratic John Van Buren February 3, 1845 – January 1, 1848 Democratic Legislated out of office by the Constitution of 1846 Ambrose L. Jordan January 1, 1848 – December 31, 1849 Whig First attorney general elected by general ballot Levi S. Chatfield January 1, 1850 – November 23, 1853 Democratic Resigned shortly before the end of his second term Gardner Stow December 8, 1853 – December 31, 1853 Democratic Appointed to fill the unexpired term Ogden Hoffman January 1, 1854 – December 31, 1855 Whig Stephen B. Cushing January 1, 1856 – December 31, 1857 American Lyman Tremain January 1, 1858 – December 31, 1859 Democratic Charles G. Myers January 1, 1860 – December 31, 1861 Republican Daniel S. Dickinson January 1, 1862 – December 31, 1863 Union John Cochrane January 1, 1864 – December 31, 1865 Union John H. Martindale January 1, 1866 – December 31, 1867 Republican Marshall B. Champlain January 1, 1868 – December 31, 1871 Democratic Two terms Francis C. Barlow January 1, 1872 – December 31, 1873 Republican Daniel Pratt January 1, 1874 – December 31, 1875 Democratic Charles S. Fairchild January 1, 1876 – December 31, 1877 Democratic Augustus Schoonmaker Jr. January 1, 1878 – December 31, 1879 Democratic Hamilton Ward Sr. January 1, 1880 – December 31, 1881 Republican Leslie W. Russell January 1, 1882 – December 31, 1883 Republican Denis O'Brien January 1, 1884 – December 31, 1887 Democratic Two terms Charles F. Tabor January 1, 1888 – December 31, 1891 Democratic Two terms Simon W. Rosendale January 1, 1892 – December 31, 1893 Democratic Theodore E. Hancock January 1, 1894 – December 31, 1898 Republican Two terms (1894–1895; 1896–1898) John C. Davies January 1, 1899 – December 31, 1902 Republican Two terms John Cunneen January 1, 1903 – December 31, 1904 Democratic Julius M. Mayer January 1, 1905 – December 31, 1906 Republican William S. Jackson January 1, 1907 – December 31, 1908 Democratic Edward R. O'Malley January 1, 1909 – December 31, 1910 Republican Thomas Carmody January 1, 1911 – September 2, 1914 Democratic Resigned shortly before the end of his second term James A. Parsons September 2, 1914 – December 31, 1914 Democratic Appointed to fill the unexpired term Egburt E. Woodbury January 1, 1915 – April 19, 1917 Republican Resigned during his second term Merton E. Lewis April 19, 1917 – December 31, 1918 Republican As first deputy AG acted until being elected by the State Legislature on April 25 to fill unexpired first half of term, then re-elected in special election (Nov. 1917) for the other half (1918) Charles D. Newton January 1, 1919 – December 31, 1922 Republican Two terms Carl Sherman January 1, 1923 – December 31, 1924 Democratic Defeated for reelection in 1924 Albert Ottinger January 1, 1925 – December 31, 1928 Republican Two terms; unsuccessful Republican nominee for governor in 1928 Hamilton Ward Jr. January 1, 1929 – December 31, 1930 Republican Son of Hamilton Ward Sr. (AG from 1880 to 1881) John J. Bennett Jr. January 1, 1931 – December 31, 1942 Democratic Five terms Nathaniel L. Goldstein January 1, 1943 – December 31, 1954 Republican Three terms Jacob K. Javits January 1, 1955 – January 9, 1957 Republican Resigned having been elected U.S. senator Louis J. Lefkowitz January 9, 1957 – December 31, 1978 Republican Re-elected by the State Legislature to fill the unexpired term, then re-elected to five more terms, longest-serving attorney general (8 days short of 22 years) Robert Abrams January 1, 1979 – December 31, 1993 Democratic Elected to four terms, resigning a year before the end of his fourth term G. Oliver Koppell January 1, 1994 – December 31, 1994 Democratic Elected by the State Legislature to fill unexpired term Dennis Vacco January 1, 1995 – December 31, 1998 Republican Defeated for reelection in 1998. Joined Waste Management, Inc. as vice president for New York government affairs. Became a partner in Buffalo law firm, Lippes Mathias Wexler Friedman. Eliot Spitzer January 1, 1999 – December 31, 2006 Democratic Two terms, then elected governor Andrew Cuomo January 1, 2007 – December 31, 2010 Democratic One term, then elected governor Eric Schneiderman January 1, 2011 – May 8, 2018 Democratic Resigned during his second term Barbara D. Underwood May 8, 2018 – December 31, 2018 Democratic Served as acting attorney general from May 8 to May 22, when she was confirmed by the New York State Legislature. Letitia \"Tish\" James January 1, 2019 – present Democratic == References == *",
 "title": "Attorney General of New York"
}