{
 "id": "979883",
 "text": "Rabbi Meir Zvi Bergman (born in 1929) is the head of the Rashbi Yeshiva and a member of the Torah Elders Council of Degel HaTorah. == Biography == Born in Jerusalem between the walls to Rabbi Moshe Bergman and Alta Liva Raizil, daughter of Rabbi Yona Ze'ev Hershler. He is seventh generation in Jerusalem, descendant of Rabbi Eliezer Bergman. He was orphaned by his mother who contracted typhus when he was seven years old. In the 1950s, his father settled in Miron, and was among the founders of the Bnei Akiva Yeshiva there. In the year 5575 his father moved to Bnei Brak and founded the Rashbi yeshiva there. In 1971, he studied for a year at a small yeshiva in the Mekor Haim neighborhood led by Rabbi Moshe Tikocinski, later the overseer of the Slabodka Yeshiva. At the age of 11, he began studying at Yeshiva Tefarat Zion with Rabbi Michal Yehuda Lipkowitz. During his studies he stayed for about two years in the house of the \"Chazon Ish\" with whom he studied. After that, he studied at Yeshiva Lomza in Petach Tikva with Rabbi Reuven Katz, the overseer Rabbi Eliyahu Doshnitzer and Rabbi Elazar Menachem Man Shach - who later became his father-in-law. At Yeshiva Lomza he studied in company with his friend Rabbi Chaim Kanievsky, who later said that he studied with 'Rabbi Meir' (as he called Rabbi Bergman) more than twenty tractates in study! In 8th of Sivan 5771 he married Deborah, the daughter of Rabbi Shach. The Kiddoshin was arranged by a relative of the family, Rabbi Isser Zalman Meltzer. The matchmaker was the Chazon Ish. After his marriage, he studied in Kollel Chazon Ish, in fellowship with Rabbi Ya'akov Israel Kanievsky, with his friend from the Lomeja Yeshiva Rabbi Gedaliah Nadel and with Rabbi Haim Kanievsky. Rabbi Bergman served as a public emissary during the terrible days at the Chazon Ish, and after his death at the temple including the Chazon Ish. Later, Rabbi Ya'akov Israel Kanievsky asked to serve in this position at the Beit Meir yeshiva. He taught at the Kalatsak-Rehovot Yeshiva (the South Yeshiva) where his father-in-law, Rabbi Shach, served earlier. After that, at the behest of his father-in-law, he founded the Rashbi's Kollel in the Zichron Meir neighborhood in Bnei Brak, in which he gives lessons and talks to the abrachs. With the establishment of the kollel, Rabbi Shach financed the salaries of the abrachs, and later Rabbi Shach ordered him to travel abroad for the sake of holding the kollel. In the second decade of the 21st century, he stopped traveling abroad, and his son Rabbi Ben Zion assists in the management and holding of the kollel. Over the years, he avoided engaging in public affairs , with the exception of exceptional cases, such as in the year of the establishment of the Degal HaTorah movement, when he served as the emissary of his father-in-law, the movement's founder , Rabbi Shach, in all matters related to the establishment and success of the new movement. Also, before the special elections for the Prime Minister - 2001, the newspaper Yad Naman published his decision to vote for Ariel Sharon, even though going to the polls is not for the purpose of choosing an ultra-Orthodox party. On the eve of Pesach in the year 5773, he was appointed to serve as a member of the Council of Torah Elders of Degel HaTorah together with Rabbi Shmuel Auerbach and Rabbi Gershon Edelstein. Since then he began to engage and express his opinion in public matters. During the controversy in the Lithuanian public, he refrained from taking an active position, but continued to support the Torah Banner Party and the newspaper Yated Naman. In his conversations, he usually refers to issues of opinion that are on the agenda of ultra-Orthodox Judaism, in which he echoes the conservative teachings of his father-in-law, Rabbi Shach, such as the issue of Jewish immigration to the Temple Mount, the return of territories, and the recruitment of Yeshiva members. It is considered an authority by many Torah scholars as representing the opinion of Rabbi Shach who is accepted in the yeshiva world as the father of the ultra-orthodox view in the modern generation, and from time to time we consult him and use his testimonies about Rabbi Shach's instructions and positions. In the 2020 elections in the United State, he publicly supported President Donald Trump because he is \"good for the Jews\". After the attack in the city of Bnei Brak on March 29, 2022, he attacked the calls directed to the ultra-orthodox sector to obtain a license to possess weapons. After the disaster at Hilult, Rabbi Shimon bar Yochai called for a poignant soul-searching in the ultra-orthodox public, in view of the many differences that exist between each other, saying that the disaster is measure against measure because \"we push each other\". == Family == Married to Deborah, daughter of Rabbi Shach. The couple has nine children, eight sons and a daughter. * His eldest son, Rabbi Ben Zion Bergman, is the son-in-law of Rabbi David Zingerevich who was an overseer at the Ponibezh yeshiva. He was crowned by him as his replacement in the leadership of the Rashbi yeshiva. * Rabbi Isser Zalman, presides over the 'Mishnat Rabino' collective on Sokolov Street in Bnei Brak. * Shoshana is married to Rabbi Haim Fass, one of Rabbi Shmuel Auerbach 's old students, and he serves as a lawyer and a consultant in Lakewood, New Jersey. * Rabbi Yishchar, is the founder and director of the Ish Ways for Bnei Avrach Sephardim in Bnei Brak, and previously served as Elad's appointed council member. In 1990, it was published in the press that he is close to Likud Police Minister Roni Milo, and that his grandfather , Rabbi Shach , forbade him to accept a government appointment in the Ministry of Social Affairs, in order to remove his lips from saying that he caused Rabbi Shach's support for the stinking exercise tarfod and the establishment of Yitzhak Shamir's government. * Rabbi Asher became famous for publishing the books \"Letters and Articles\" of his grandfather, Rabbi Shach, and for composing dozens of other books. His brothers-in-law are Rabbi Yisrael Zvi Yair Danziger the Rebbe of Alexander , and Rabbi Yaakov Goldman Rabbi of Zweihel Chassidism in Bnei Brak, father of Rabbi Eliezer Goldman the Rebbe of Zweihel in the United States. == His writings and books == * 'Gates of Ora' about Maimonides * 'Shaari Ora' on the Torah, two volumes. * 'Shaari Ora - Essays', two additional volumes of views and moral articles on the order of the Parshiyots compiled by his students. * The 'Beit Midrash' books, in which a selection of his lessons were compiled over the years in Talmud tractates and were published by the Bnei Brak Yeshiva. * 'Introduction to Shearim', a bibliographic book on oral Torah, Bnei Brak 5644. Since then it has been published in many editions, including the first dotted edition in Hashon 5655. The book is considered a bestseller throughout the Jewish world, was first translated into English and published by Masura Publishing (ArtScroll), Brooklyn in 1985. The first edition in French was published in Paris in 1997. * Annotations regarding \"Prohibited Slaughter\" ~ Bnei Brak 2005. * 'Gates of Ora' ~ an edited series containing Torah perspectives, in the English language (Hebrew phrases with English translation), edited by Yaakov Levon, and published by Feldheim Books Jerusalem 1997, including bibliographic references. * 'Emma Shel Malchut' ~ on the scroll of Ruth, in English, edited by Menachem Greenberg, and published in Lakewood New Jersey 2014. * The 'illuminator' on a tractate of kikat (published at his choice) . == References == == Other websites == * Idan Yosef, the white dove that stirred up Bnei Brak, a first class news site * The genealogy of Rabbi Meir Zvi Bergman * Rabbi Bergman on his residence at the Chazon Ish * The Geniza burial ceremony was held in Ashdod, with the participation of the General Clerk Bergman * Introduction to Shearim, on the Otsar Hekhama website Category:Israeli rabbis Category:1929 births Category:Living people",
 "title": "Meir Zvi Bergman"
}