{
 "id": "980032",
 "text": "Lee Michael Zeldin (born January 30, 1980) is an American attorney, Republican politician, and officer in the United States Army Reserve who has been the 17th and current Administrator of the Environmental Protection Agency since 2025 under the second Donald Trump administration. Zeldin represented New York's 1st congressional district in the United States House of Representatives from 2015 to 2023. From 2011 to 2014, Zeldin served as a member of the New York State Senate from the 3rd Senate district. In 2022, he unsuccessfully ran for Governor of New York against the incumbent Kathy Hochul. He was seen as a possible candidate for Chair of the Republican National Committee in 2023, however decided against running. In November 2024, President-elect Donald Trump announced that he would nominate Zeldin as the Administrator of the Environmental Protection Agency. ==Early life== Zeldin was born in East Meadow, New York. He was raised in Suffolk County, New York. He is Jewish. Zeldin studied at SUNY University at Albany. He received a Juris Doctor from Albany Law School in May 2003. ==New York State Senate== In 2010, Zeldin ran in the New York State Senate's 3rd District, running against Democratic incumbent Brian X. Foley. Zeldin defeated Foley with 57% of the vote. Zeldin was reelected in 2012 with 56% of the vote. In June 2011, Zeldin voted against the Marriage Equality Act. Zeldin said that \"It is my belief that marriage should be defined as between a man and a woman.\" In December 2011, Zeldin supported a $250 million cut to the MTA payroll tax. Zeldin did not vote on the NY SAFE Act, a gun control bill. In February 2014, Zeldin created a bill that wanted to stop Common Core for three years. ==U.S. House of Representatives== In 2008, Zeldin ran against incumbent representative Tim Bishop in New York's 1st congressional district. Bishop defeated Zeldin 58%–42%. In October 2013, Zeldin said he would again for the Republican nomination to run against Bishop. He beat Bishop with 54% of the vote. He would successfully run for re-election in 2016, 2018 and 2020. When he was in congress, Zeldin was one of two Jewish Republicans in Congress. During the 2022 Russian invasion of Ukraine, Zeldin was one of 963 Americans the Russian Foreign Ministry banned from entering Russia. ==2022 gubernatorial campaign== In April 2021, Zeldin announced he would run for governor of New York in 2022. Zeldin's campaign reportedly raised $4 million during the first half of 2021 and $4.3 million in the second half. Zeldin visited every county in New York State twice during his campaign. Zeldin ran against Rob Astorino, Andrew Giuliani, and Harry Wilson for the Republican nomination. He won the nomination in June 2022. He ran against incumbent governor Kathy Hochul in the November general election. On July 21, 2022, Zeldin was attacked at a campaign event in Perinton, New York. A man got on the stage while Zeldin was giving a speech and attacked him with a pointed plastic key chain. It was later revealed that the attacker was drunk and did not know who Zeldin was. During most polling numbers of the election, it was seen that the election was closer than most gubernatorial elections since 2002. However, Zeldin lost to Hochul, 53.2% to 46.8% in November 2022. ==Environmental Protection Agency== In November 2024, President-elect Donald Trump nominated Zeldin to serve as the Administrator of the Environmental Protection Agency in his second cabinet. His confirmation hearing was held on January 16, 2025. The committee advanced his nomination in a 11-8 vote on January 23. He was confirmed by the U.S. Senate on January 29, in a 56-42 vote. He was sworn-in by U.S. Supreme Court Justice Brett Kavanaugh a few hours later. ==Personal life== Zeldin was raised Conservative Judaism and Reform Judaism. His wife Diana Zeldin is Mormon. The couple have identical twin daughters. They live in Shirley, New York. In September 2021, Zeldin announced that he had been diagnosed with leukemia in November 2020 and was in remission. ==References== ==Other websites== * Category:1980 births Category:Living people Category:United States representatives from New York (state) Category:Republican Party (United States) politicians Category:Lawyers from New York (state) Category:Jewish American politicians Category:Administrators of the United States Environmental Protection Agency",
 "title": "Lee Zeldin"
}