{
 "id": "980053",
 "text": "Guardians of the Galaxy Vol. 3 (stylized as Guardians of the Galaxy Volume 3) is a 2023 American superhero movie based on the Marvel Comics superhero team Guardians of the Galaxy. It is produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. The movie is the sequel to Guardians of the Galaxy (2014) and Guardians of the Galaxy Vol. 2 (2017) and the 32nd movie in the Marvel Cinematic Universe (MCU). The movie was written and directed by James Gunn. It stars an ensemble cast featuring Chris Pratt, Zoe Saldaña, Dave Bautista, Karen Gillan, Pom Klementieff, Vin Diesel, Bradley Cooper, Will Poulter, Sean Gunn, Chukwudi Iwuji, Linda Cardellini, Nathan Fillion, and Sylvester Stallone. In the movie, the Guardians embark on a mission to protect Rocket (Cooper) from the High Evolutionary (Iwuji). == Schedule == James Gunn said in November 2014 that he had initial ideas for a third movie in the series, and announced his return to write and direct in April 2017. Disney fired him from the movie in July 2018 following the resurfacing of controversial posts on Twitter. However, the studio rehired him by that October and reinstated Gunn as director. Gunn's return was publicly revealed in March 2019, with production resuming after Gunn completed work on his movie The Suicide Squad (2021) and the first season of its spin-off series Peacemaker (2022). Filming began in November 2021 at Trilith Studios in Atlanta, Georgia, and lasted until early May 2022. Guardians of the Galaxy Vol. 3 premiered at Disneyland Paris on April 22, 2023, and was released in the United States on May 5, 2023, as part of Phase Five of the MCU. == Cast == * Chris Pratt as Peter Quill / Star-Lord: The half-human, half-Celestial leader of the Guardians of the Galaxy who was abducted from Earth as a child and raised by a group of alien thieves and smugglers called the Ravagers. In the movie, Quill is in a \"state of depression\" following the appearance of a variant of his dead lover Gamora. This version does not share the same affection for Quill as her older version had for him, which affects his leadership of the Guardians. * Zoe Saldaña as Gamora: An orphan who seeks redemption for her past crimes, and was adopted and trained by Thanos to be his personal assassin. The original version of Gamora, a member of the Guardians, was killed by Thanos in Avengers: Infinity War (2018). However, she returned as a younger version of the character who travels to the present in Avengers: Endgame (2019); Saldaña reprises the latter role in this movie, now serving as a member of the Ravagers. * Dave Bautista as Drax the Destroyer: A member of the Guardians and a highly skilled warrior whose family was slaughtered by Ronan, under the instructions of Thanos. * Karen Gillan as Nebula: A member of the Guardians, a former Avenger, and Gamora's adoptive sister. Similar to Gamora, she was trained by their adoptive father Thanos to be his personal assassin. * Pom Klementieff as Mantis: A member of the Guardians with empathic powers, and Quill's half-sister. * Vin Diesel as Groot: A member of the Guardians who is a tree-like humanoid and the accomplice of Rocket. * Bradley Cooper as Rocket: A member of the Guardians and a former Avenger who is a genetically modified raccoon bounty hunter and a master of weapons and military tactics. The movie completes a character arc that was established in Guardians of the Galaxy (2014) and Guardians of the Galaxy Vol. 2 (2017), and continued in Infinity War and Endgame. * Sean Gunn as Kraglin Obfonteri: A member of the Guardians and Yondu Udonta's former second-in-command in the Ravagers. * Chukwudi Iwuji as the High Evolutionary: A scientist specializing in evolution who seeks to forcibly enhance all living beings into a \"special race\". * Will Poulter as Adam Warlock: A powerful artificial being created by the Sovereign to destroy the Guardians. * Linda Cardellini as Lylla: An anthropomorphic otter who is an associate and friend of Rocket. Cardellini provided both the voice and motion capture for Lylla. She had previously portrayed Laura Barton in past MCU media. * Nathan Fillion as Master Karja: An orgosentry at Orgocorp. * Sylvester Stallone as Stakar Ogord: A high-ranking Ravager. Elizabeth Debicki reprises her role as Ayesha, the golden High Priestess and the leader of the Sovereign people. In that role, she had Adam Warlock created to destroy the Guardians. Others who return in their roles from the Guardians movies and/or The Guardians of the Galaxy Holiday Special (2022) are Michael Rosenbaum as Martinex, Seth Green as the voice of Howard the Duck; Christopher Fairbank as the Broker; Stephen Blackehart and Rhett Miller as Steemie and Bzermikitokolok, two denizens of Knowhere; Gregg Henry as Quill's grandfather Jason; and Michael Rooker as Yondu Udonta, the former head of the Ravagers and Peter's deceased mentor. Maria Bakalova reprises her role as Cosmo the Spacedog, a member of the Guardians who is a sentient dog that developed psionic abilities after being sent into space by the Soviet Union. Gunn changed Cosmo's gender from male, as depicted in the comics, to female for the movie. This was made as a tribute to the character's original inspiration Laika, a Soviet space dog who became one of the first animals in space. In addition to voice acting, Bakalova provided motion capture for the character. Cosmo was physically portrayed by dog actor Slate, after doing so for the Holiday Special. The character was previously portrayed by dog actor Fred in the first two Guardians movies. Asim Chaudhry voices Teefs, an anthropomorphic walrus; Mikaela Hoover (who played Nova Prime's assistant in the first movie) voices Floor, an anthropomorphic rabbit; Daniela Melchior appears as Ura, the receptionist at Orgocorp; Miriam Shor and Nico Santos appear as Recorder Vim and Recorder Theel respectively, the scientifically-minded henchmen of the High Evolutionary; Jennifer Holland appears as Administrator Kwol, a security employee of Orgocorp; Kai Zen appears as Phyla, one of the High Evolutionary's Star Child prisoners; Judy Greer (who played Maggie Lang in the first two Ant- Man movies) voices War Pig, a cyborg pig and member of the Hell Spawns working for the High Evolutionary; Reinaldo Faberlle voices Behemoth, a cyborg bird and member of the Hell Spawns who also works for the High Evolutionary; Dee Bradley Baker voices Blurp, a furry F'saki that is an unnamed Ravager's pet; and Dane DiLiegro appears as an Humanimal octopus drug dealer on Counter-Earth (credited as \"Unsavory Octopus\"). Cameos in the movie include Lloyd Kaufman as Gridlemop, a Krylorian on Knowhere who partakes in a card game with Kraglin; Pete Davidson as Phlektik, a guard at Arête Laboratories; and writer and director James Gunn as the voice of Lambshank, a deformed experiment of the High Evolutionary that is among those freed by the Guardians of the Galaxy. == Release == Guardians of the Galaxy Vol. 3 had its world premiere at Disneyland Paris on April 22, 2023, and its North America premiere at Dolby Theatre in Hollywood, California on April 27. It was released in the United States on May 5. The movie was previously set for release on May 1, 2020, before it was dropped from that date. It is part of Phase Five of the MCU. == Reception == === Box office === As of October 10, 2023, Guardians of the Galaxy Vol. 3 has grossed $359 million in the United States and Canada and $486.6 million in other countries, for a worldwide total of $845.5 million. === Critical reception === On Rotten Tomatoes, 82% of 398 reviews are positive. The average rating is 7.2/10. The site's critical consensus reads: \"A galactic group hug that might squeeze a little too tight on the heartstrings, the final Guardians of the Galaxy is a loving last hurrah for the MCU's most ragtag family.\" On Metacritic, the movie has a score of 64 out of 100 based on 63 critic reviews, indicating \"generally favorable\" reviews. == References == == Other websites == * * Category:Marvel Cinematic Universe movies Category:2023 superhero movies Category:Movies directed by James Gunn Category:Movies composed by John Murphy",
 "title": "Guardians of the Galaxy Vol. 3"
}