{
 "id": "980091",
 "text": "Suzanne Berlioux née Pointcarré (14 Fevbruary 1898 - 21 June 1984) was a French swimming coach. She trained among others swimming champions Christine Caron and Françoise Letellier.Suzanne BERLIOUX ==Swimming coach== Berlioux learned swimming herself in 1917. In the 1930s she trained the school sections of swimming clubs. Working as a teacher, she included in 1935 swimming lessons in her school program and took care of bringing her students to the swimming pool. The initiative was however stopped by her superiors. Between 1941 and 1969 she trained all the French 100 metre backstroke champions. She was a trainer at four Summer Olympics. At the 1948 Summer Olympics with Monique Berlioux; at the 1960 Summer Olympics with Rosy Piacentini and Nadine Delache; at the 1964 Summer Olympics with silver medal winner Christine Caron and at the 1968 Summer Olympics with Sylvie Canet. She was also the trainer at the 1965 Aquatics Championships of Christine Caron who became champion in the 100 metre backstroke. ==Personal life== Her father Georges Poincarré was an industrialist. She married to Eugène Berlioux who was trainer at CNP and Morocco in 1950. Her daughters were swimming champions Monique Berlioux and Lucette Berlioux. She was a teacher between 1926 and 1953. In 1966 she appeared in the short film , by Dominique Delouche. The film received the Grand Prize at the Cortina d'Ampezzo Festival. Born in Nogent, Haute-Marne, she later lived in Nancy, Marseille and Metz. In 1926 she moved to Paris. During World War II, she fled Paris with her family to Normandy in 1943. After World War II they moved back to Paris where she lived until 1969. She survived her daughter Lucette Berlioux who died in 1966. She died on 14 February 1898 in Nogent, Haute-Marne at the age of 86. ==Honors== * Knight of the Legion of Honour * Commander of the Order of Sports Merit *Physical Education gold medal *Gloire du sport medal ==Legacy== The Suzanne-Berlioux sports center in Paris is named after her. The sports center consists of the Suzanne-Berlioux gymnasium and the , an underground center located in the Forum des Halles, in the Halles district of the 1st arrondissement of Paris. ==References== Category:Coaches Category:French swimmers Category:Sportswomen Category:French teachers Category:1898 births Category:1984 deaths Category:People from Haute- Marne Category:Sportspeople from Grand Est",
 "title": "Suzanne Berlioux"
}