{
 "id": "980098",
 "text": "Frances Emma Footman (20 July 1888 - June 1982) was a British swimmer and diver in the early 20th-century from London. She was one of the earliest British female international swimmers. Footman was a member of the Battersea Swimming Club and was trained by professor Barrows. ==Biography== Footman won in 1902-1903 the Battersea School Campionship and in 1903-1904 the Battersea Ladies Championship. In 1906 she finished second at the Southern Countries Ladies Championship. In 1907 she competed at the 1907 international Ondine de Paris swimming competitions in Paris, France. She won the international 120 metre event in a time of 5:39 and the diving event. She also competed in the international 60 metre event with handicap. On 19 October 1907 she competed in a Franco-English match against Alice Sadoux at an aquatics gala organized by Hanover House in Westminster Baths in London. Between 1909 and 1911 she became swimming champion of London. In 1911 she competed at the 1911 international Ondine de Paris swimming competitions. She finished third in the international 120 metre event. As of 1907 she had won 24 major events. In 1910 Footman was awarded two lifesaving awards for diving into the Thames from Chelsea Bridge to save a woman from drowning on 12th September 1910. The Royal Humane Society Bronze Medal and Carnegie Hero Fund medal and life-time pension. ==Personal life== Footman was born on 20 July 1888 in London in Stepney. Her parents were Mary Ann Shepherd and Michael Francis Footman. Her younger sister Mary Footman (born 1897) was also an international swimmer. Together with John Shelmerdine she had four children, including Violet Margaret Shelmerdine (1920-2009) and a son John Shelmerdine (1922-2002). She died in June 1982 in Haywards Heath. ==References== Category:British swimmers Category:British divers Category:Sportswomen Category:Year of birth missing Category:Year of death missing Category:Sportspeople from London",
 "title": "Frances Footman"
}