{
 "id": "980156",
 "text": "Cash Money Records is an American record label. It was founded by brothers Bryan \"Birdman\" Williams and Ronald \"Slim\" Williams. They currently act as CEOs. Today, it operates as a subsidiary of Universal Music Group. It is also distributed by Republic Records, formerly Universal Republic. The label currently includes artists like Lil Wayne, Drake, Tyga, Nicki Minaj, Ace Hood, DJ Khaled, Kevin Rudolf and Limp Bizkit, and more. ==History== Cash Money Records was created in 1991. From 1991 to 1994, Cash Money played host to local releases by artists. It sold just one album with never releasing a music video or having a Billboard hit. Some of the label's releases garnered some regional fame in New Orleans, Louisiana, but the label was little known to the national rap spotlight. Artists on the label in this period included the band U.N.L.V. (Uptown Niggas Living Violently), Kilo G, Lil Slim, and PxMxWx. In 1995, the label signed young rappers B.G., Young Buck and Lil Wayne. The signees marked what would be the second wave of Cash Money artists. In 1997, B.G. and Lil Wayne formed the band Hot Boys together with Juvenile (who had already been regionally popular before Cash Money). Although initially they did not make lots of impact outside of the region, they started to be the label's best known artists. Cash Money's big break came in 1998. That was when the Hot Boys, B.G. and Juvenile in particular, caught the attention of Universal Records executives. In 1998, Cash Money signed a $30 million pressing and distribution with $3 million advance contract with Universal, entitling the label to 85% of its royalties, 50% of its publishing revenues and ownership of all masters. Dino Delvaille, who orchestrated the deal, later told HitQuarters: \"I made certain they retained 100% ownership of their work. They deserve it.\" ==References== ==Other websites== * Category:American record labels Category:1991 establishments in the United States",
 "title": "Cash Money Records"
}