{
 "id": "980152",
 "text": "María Soledad Salgado (7 July 1914 — 13 January 1987) was a Colombian-born French swimmer and military. She was specialized in the freestyle and backstroke. She was a member of Mouettes de Paris ==Personal life== Salgado was born in Colombia in 1914. She was the daughter of a Colombian businessman who maried a French woman from the Jura. She moved to Paris in 1915, but lived between 1918 and 1923 for five years in Colombia after which she returned again to Paris. She got the French citizenship in 1928. ==Swimming career== Salgado learned swimming in 1923 at the Cuisance river. She went to the pool every Thursdag and had lessons of professor Sampa. Salgado participated on 21 August 21 1927 at the , an open water race in Paris over 8 kilometres. She became in 1929 and 1932 French national champion in the 100 meter backstroke and in 1929 and 1934 French national champion in the 400 meter freestyle. On 14 February 1930, she broke the 500 metre freestyle European record of the Dutch woman Marie Braun in Paris with a time of 7:50.6. In August 1930, she won the 100 metre freestyle and 100m backstroke at the World University Championships in Darmstad. During her career she also broke many French national records. She finished fourth at the 1931 European Aquatics Championships with the French team in the 4x100 metre freestyle relay. At the 1934 European Aquatics Championships she finished fourth in the 400 metre freestyle and fifth in the 4x100 metre freestyle relay. She won the Academy of Sports prize for the best sportswoman in 1929. She was awarded the gold medal of Physical Education in 1938. ==Militairy career== She started helping wounded soldiers during World War II. She joined the French Forces of the Interior in 1944. She became a specialist French Air Force. She ended her militay career in 1969 with the rank of commandant. She earned the Croix de Guerre 1939–1945. ==References== Category:Swimmers from Paris Category:Sportswomen Category:1914 births Category:1987 deaths Category:People from Bogotá Category:French military people Category:French people of World War II Category:Military personnel of World War II",
 "title": "Solita Salgado"
}