{
 "id": "980294",
 "text": "GMA Network, Inc., commonly known as GMA, is a Philippine media company based in Diliman, Quezon City, Philippines. It is primarily involved in radio and television broadcasting, with subsidiaries dealing in various media related businesses. The majority of its profits are derived from publicity and marketing incomes associated to television distribution. GMA is the largest media company in the Philippines in terms of market capitalization, net income, revenue, reach, audience share and number of stations. Founded on June 14, 1950, it currently owns and operates two national television networks (GMA Network and GTV), four digital television channels (Heart of Asia, Hallypop, I Heart Movies and Pinoy Hits), two national radio stations (Super Radyo DZBB 594 kHz and Barangay LS 97.1), two regional radio networks (Super Radyo and Barangay FM), and one regional tv network, It also operates three international channels (GMA Pinoy TV, GMA Life TV and GMA News TV International), along with subsidiaries dealing in film production and distribution (GMA Pictures), music production and publishing (GMA Music), talent development and management (Sparkle GMA Artist Center), digital terrestrial television providers (GMA Affordabox and GMA Now) and a number of Internet and digital converging technology (GMA New Media) in the Philippines. The company is a publicly traded company on the Philippine Stock Exchange. ==Television== ===GMA Network=== GMA Network, commonly known as GMA, is a major Philippine commercial television network. Launched on October 29, 1961, GMA Network is also referred to as the “Kapuso Network” in reference to the company's logo. Its headquarters can be found at the GMA Network Center in Quezon City. ===GTV=== GTV is a Philippine general entertainment channel that aired on its flagship station, UHF channel 27 and was launched on February 22, 2021 replacing GMA News TV. The channel carries news, entertainment and sports programs and it is available in most satellite and cable TV systems. ===Heart of Asia=== Heart of Asia is a digital television channel owned by GMA Network. The channel was initially launched on June 12, 2020, and officially launched on June 29, 2020. ===Hallypop=== Hallypop is an Asian pop culture digital channel and the Philippine version of its U.S.-based counterpart with branding under licensed from Jungo TV, after both parties signed a joint venture in 2019. The channel was initially launched on September 6, 2020, and was officially launched on September 20, 2020. ===I Heart Movies=== I Heart Movies is a movie television channel owned by GMA Network. The channel was initially launched on March 25, 2021, and officially launched on April 5, 2021. ===Pinoy Hits=== Pinoy Hits is a general entertainment channel owned by GMA Network. The channel was initially launched on January 2, 2023, and officially launched on January 16, 2023. ==References== ==Other websites== * *Media Ownership Monitor Philippines – Media Companies: A Duopoly Rules by VERA Files and Reporters Without Borders Category:Philippine television networks Category:Companies of the Philippines Category:Entertainment companies Category:1950 establishments in Asia Category:1972 disestablishments Category:1970s disestablishments in Asia",
 "title": "GMA Network (company)"
}