{
 "id": "980210",
 "text": "Evolutionary medicine or Darwinian medicine is a way to think about how and why evolution changed human bodies over time to make people sick or healthy. People use Darwinian medicine to study biomolecules. It is used understand how these small molecules work together through something called physiological mechanisms. Physiological mechanisms are things that bodies do that make people feel either sick or healthy. People who study Darwinian medicine use these ideas to learn how those mechanisms have changed over time. Understanding these changes can be important to know why some people are more likely to be sick than others. ==History== Darwinian medicine comes from ideas that came from Charles Darwin. Charles Darwin had many ideas. The ideas that helped form Darwinian medicine came from his work on germ theory of disease. Many biologists learned of these ideas and quickly saw how they could help people think about how pathogens evolve and how people change to protect themselves from these pathogens. Scientific papers that have been written about the field of Darwinian medicine. They include a paper by Paul Ewald, in 1980, named “Evolutionary Biology and the Treatment of Signs and Symptoms of Infectious Disease”. Another paper written by Williams and Nesse, “The Dawn of Darwinian Medicine” (1991), was also important to the growth of the field. These papers made people think more about Darwinian medicine. A book called “Why We Get Sick” and an online journal, “Evolution and Medicine Review\" (2008), have also had large effects on the subject. ==Core principles== Experts who practice Darwinian medicine use 5 main ideas when thinking about health. These main ideas help experts to decide what things might affect the ability to be sick or healthy. Below is a list of these ideas and their meanings for Darwinian medicine. # Question Framing: The questions that experts in Darwinian medicine ask usually focus on 2 ideas. They ask questions about the molecules working together in the body and how evolution has changed the way these molecules work together. They ask questions with these 2 ideas in mind when looking at traits of a person. This is done to understand how those traits might make one person more likely to get sick than another. # Evolution: Experts think about actions in evolution such as natural selection, genetic drift, mutation and non-random mating. They also think about why some traits that would make people healthy are not always passed on. #Evolutionary Trade-offs: Experts think about how changes in one trait that make people healthy might lead to changes in other traits that make people sick. They also think about the life cycle of people, such as having children and getting older and less healthy with age. #Reasons for Vulnerability: Experts think about how bodies fight sickness and what the signs of sickness are. They also think about the place where a person lives might make that person more likely to get sick. #Culture: Experts think about different cultural practices. Cultural practices show how people from one place might do things differently than people from another place. Differences in types of medicine, types of birthing practices or types of food could mean that some people from different cultures could be more likely to get sick than others. ==Human adaptation== There are some adaptations that have changed traits over time. Some of these adaptations have made people more healthy. There are constraints that keep some traits from changing. The presence of constraints means that adaptations that could make people more likely to be healthy are not able to happen. These adaptations can happen but with trade-offs. This could mean changes in one trait that make people healthy might lead to changes in other traits that make people sick. ===Constraint examples=== * DNA is split and copied almost 2 trillion times a day. Because DNA is copied so many times, mutations can occur. This means that diseases like cancer are not able to be removed from the human population. * Humans are not able to create our own vitamins naturally. This means they must get these vitamins from the food they eat. This can lead to problems for people who are not able to get foods with vitamins in it. People or communities that are not able to get food with vitamins could be more likely to get sick than people who are able to get foods with vitamins. ===Trade-offs examples=== * One adaptation that has shown a trade-off is that as humans have evolved to become bipedal, the pelvis has changed to make childbirth harder. * Another adaptation that has shown trade- offs is that darker skin pigmentation helps protect people from UV rays, but can also mean problems breaking down vitamin D. ==Disease of civilizations== A long time ago, humans used to hunt and gather food and live in small tribes. The way humans have evolved shows this. There are communities today that still live a hunter-gatherer lifestyle. There are also people who have a very different way of living than their ancestors did. Evolution takes a long time to happen. It has not caught up with how many people are living today. Some experts in Darwinian medicine believe that people who do not practice a hunter-gatherer lifestyle are more likely to have problems being healthy. This idea of our evolution not matching the way many humans live today and it causing health problems is called “diseases of civilization” or “diseases of affluence”. ===Diet=== Many people eat types of food that are much different than what people ate a long time ago. A long time ago people ate things that grew from the ground. They also ate animals from the land or sea. Today, there are more options of what to eat. Some options we have are foods that are made in factories. These foods often have large amounts of sugar, salt and fat. These things are not good for people to eat in large amounts. They can lead to sickness. Some examples of sickness that can come from these things are dental caries, obesity and diabetes. ===Life expectancy=== How long a person lives can be affected by the way they live. There are many sicknesses that are more common now than they were a long time ago. Some of these include cardiovascular disease, cancer, arthritis, cataracts, hypertension and Alzheimer’s disease. All of these sicknesses are more likely to happen the older a person gets. ===Exercise=== A long time ago, more people used to exercise more than people do now. They lived lives that needed more physical activity. When a person would rest, mechanisms in the body would change. This would lead to inflammation. Some people believe that people who do not exercise have more inflammation in their bodies. This can cause more sicknesses. ===Cleanliness=== People a long time ago were less clean than people are now. Being clean has helped people be more healthy. There are trade-offs to being clean. There are some microorganisms that humans need to have strong immune systems. Some microorganisms that grow strong immune systems can come from dirt and animals. Without these microorganisms, people may have weak immune systems. This means they could be more likely to get sick. ==Related pages== * Paleolithic diet * Darwinism ==References== Category:Medicine",
 "title": "Evolutionary medicine"
}