{
 "id": "98037",
 "text": "Cave paintings are paintings on cave walls and ceilings. Usually these paintings were made in prehistoric times. It is not known why these paintings were made. They may have been used in rituals. Some were surely giving information. Many paintings in caves are difficult to get at. Today, there are about 350 caves known which have paintings in them. Many are in France and Spain. The best known are probably the caves of Altamira (in Spain), Lascaux (in France), or Creswell Crags in England. Sometimes, paintings were also done on cliff faces. Fewer of those have survived though, because of erosion. One such example are the rock paintings of Astuvansalmi (in Finland). Most often, animals or hunting scenes were painted. Sometimes hands are there too. Rarely, there are also more abstract patterns. The paintings were drawn with red and yellow ochre, hematite, manganese oxide and charcoal. Sometimes the silhouette of the animal was put into the rock first. == Styles == André Leroi-Gourhan (19111986) classified the paintings into different styles:André Leroi-Gourhan: Treasures of Prehistoric Art. Abrams, New York 1967.André Leroi-Gourhan: Le Symbolisme des Grandes Signes dans l’art Parietal Paléolithiques. In: Bulletin de la Société Préhistorique Française. 55 (3), 1958, pp 307–321.Leroi-Gourhan 1971,pp 245ff. Style Time period Examples Explanation I Chatelperronien Aurignacien Vulvas in La Ferassie Herbivore in Belcayre Schematic paintings of animals, such as horses and mammoths. Very often only the head or back of the animal is shown. Lines and dots often used in addition. Sometimes, schematic vulvas are shown. Exact dating is difficult. II Gavettien, Perigoriden, Soultréen Pair-non-Pair cave Venus of Laussel During this time, the paintings may have first been used for rituals / religious purposes. Paintings on plates, in the entrance part of the cave, or in rock shelters. They can be found inside the cave only rarely. Paintings become more schematic, and the neck/back of the animal is often included in the painting. Venus figurines appear, and are all schematic: the legs/feet are lacking, the face and arms are only hinted at. Hips, belly and breasts are very pronounced. Impressions of hands are found for the first time III Soultréen, early Magdalenien Lascaux Pech Merle Roc de Sers El Castillo Rocamdour Peak of development of rock art. Lines are finer, and people tried to show animals in motion. Very short legs, and body, which appear too large when they are compared to the head. The marked lines of the back, which are very pronounced in style II are less pronounced. Horns and antlers of animals are often shown in a perspective view. Very often, bison and horses are painted. They are commonly shown in the same drawing. Other animals are often shown as extras. There are signs that almost always appear next to the animals. Humans are shown in relation to the animals, for the first time. Positive and negative imprints of hands are present. IV Magdalenien III and IV, Magdalenien V and VI Trois Frères Les Combarelles Most caves are in this style. Mobile objects appear, and allow a further classification of this style. Animals are shown in a very realistic manner. Horns and antlers are also shown realistically, and no longer in perspective view. Horses have a marked belly, and two lines on their shoulders. Bisons have a triangle on their loins. There are different symbols next to the animals. == Theories == There are different theories about why people created cave paintings. These are the most common explanations: * Painting in caves could be a form of hunting magic, meant to make a hunt more successful. A similar theory is based on studies of modern hunter-gatherer societies. This theory says that shamans made cave paintings. The shaman would retreat into the darkness of the caves, enter into a trance state, and then paint images of their visions, perhaps with some notion of drawing power out of the cave walls themselves. * Cave paintings could be some form of graffiti, mostly done by teenage boys of the time. Figurines have been found that show Venus at roughly the same age. According to this theory, there were many adolescents in the society of the time. Most of the adolescents who painted were male, but some were female. * The paintings may have been made for practical reasons: There is some hidden symbolism which may show the techniques of hunting, or the routes the animals took. * People may have painted what they wished for or what they had dreamt of. *The paintings could have been seen as \"art\" at the time. There are several societies today who do not have a word for art, but who practice the same type of painting. == Oldest known == In general, the dates of these artefacts are not known with any accuracy. Our own dating system was invented long after the artefacts. A painting on the wall of an Indonesian cave is about 44,000 years old. It shows a buffalo being hunted.Sulawesi art: Animal painting found in cave is 44,000 years old. BBC News. Last year another painting was found in Borneo. == Gallery == File:La Pasiega-Galeria A-Ciervas (panel 22).png|from La Pasiega, Spain File:Bisonte de Altamira.jpg|from Altamira, Spain File:Lions painting, Chauvet Cave (museum replica).jpg|from Chauvet, France File:Chauvethorses.jpg|from Chauvet File:Lascaux, horse.JPG|from Lascaux, France File:Niaux,_bisons.JPG|from Niaux cave, France File:Gravure_rupestre_(mammouth).jpg|A mammuth etching, from Pair-Non-Pair, France File:Manos_de_Gargas_(Francia).png|Hands in Gargas cave, France == Related pages == *Rock art *Upper Palaeolithic ==References== Category:Painting Category:Caves Category:Ancient history Category:Stone Age",
 "title": "Cave painting"
}