{
 "id": "980308",
 "text": "Colleges in Bangladesh are Higher Secondary schools for last two years of 12 academic year long school education. After finishing Secondary education (10th Grade/SSC/Equivalent) students get admitted to these colleges to study for 11th and 12th Grade. Students graduate from the colleges or higher secondary schools after passing in the HSC/Equivalent Examination. This is a list of Colleges in Bangladesh. The syllabus most common in usage is the National Curriculum and Textbooks, which has two versions, a Bengali version and an English version. Edexcel and Cambridge syllabus are also used for most of the English-medium schools. ==Colleges== Name Established Location A Abdul Kadir Mollah City College Adamjee Cantonment College Dhaka Adhyapak Abdul Majid College Comilla Aeronautical College of Bangladesh Aeronautical Institute of Bangladesh Agricultural University College, Mymensingh Mymensingh Agriculture Training Institute Ahammad Uddin Shah Shishu Niketon School & College Amrita Lal Dey College Barishal Alekanda Govt College Barishal Ananda Mohan College Mymensingh Atomic Energy Research Establishment School and College Azam Khan Govt. Commerce College B Bangla College Dhaka Bangladesh Air Force Shaheen College Bangladesh Air Force Shaheen College, Dhaka Dhaka Bangladesh Institute of Glass and Ceramics Bangladesh Institute of Marine Technology Bangladesh Marine Academy Bangladesh Navy College Dhaka Dhaka Bangladesh Sweden Polytechnic Institute Dhaka Barishal Barisal Engineering College Barisal Barisal Government Women's College Barisal Barisal Polytechnic Institute Barishal BCIC College Bhandaria Government College Bijoy Smarani University College BPATC School and College Brahmanbaria Government College Brahmanbaria Brajalal College Brindaban Government College Brojomohun College C Cambrian School and College Dhaka Cantonment Public School and College, Momenshahi Mymensingh Cantonment Public School and College, Rangpur Rangpur Carmichael College Chandpur Polytechnic Institute Chandpur Charfasson Govt. College Chittagong College Chittagong Chittagong Ideal School & College Chittagong Chittagong Model School and College Chittagong Chittagong Pali College Chittagong Chowmuhani Government S.A College College of Aviation & Technology College of Development Alternative Comilla Government College Comilla Comilla Government Women's College Comilla Comilla Victoria Government College Comilla D Dania College Dhaka City College Dhaka Dhaka College Dhaka Dhaka Commerce College Dhaka Dhaka Imperial College Dhaka Dhaka Polytechnic Institute Dhaka Dhaka Residential Model College Dhaka Dinajpur Government College Dinajpur Dinajpur Polytechnique Institute Dinajpur E Eden Mohila College Dhaka Engineering University School & College Dhaka F Faridpur Engineering College Faridpur Faridpur Polytechnic Institute Faridpur Feni Government College Feni Feni Polytechnic Institute Feni G Government Saadat College 1926 Karatia, Tangail Gazipur Cantonment College Gazipur Gohira Degree College Gole Afroz College Gopaldi Nazrul Islam Babu College Government Akbar Ali College Government Azizul Haque College Government Barisal College Barisal Government City College, Chittagong Chittagong Government College of Commerce, Chittagong Chittagong Government Debendra College Government Hazi Mohammad Mohshin College Government K. M. H. College Government K.C. College Jhenaidah Jhenaidah Government P.C. College, Bagerhat Bagerhat Government Physical Education College, Dhaka Dhaka Government Rajendra College Government Shaheed Suhrawardy College Dhaka Government Science College, Dhaka Dhaka Government Syed Hatem Ali College Government Tolaram College Narayanganj Government Titumir College Dhaka Govt. Sheikh Fazilatunnesa Mujib Mohila College Gurudayal Government College Kishoreganj Gunabati College H Haji Abul Hossain Institute of Technology Hathazari Government University College Hazera Taju University College Heyako Banani University College Holy Cross College, Dhaka Dhaka Hamdard Public College 2010 Dhaka Ibne Taimiya School and College Comilla Ideal School and College Dhaka Ideal College Dhaka Institute of Leather Engineering and Technology, University of Dhaka Dhaka Ishwarganj Degree College Islamia Government College Ispahani Public School & College, Comilla Comilla J Jahangirpur Govt. College Jamalpur Government College Jamalpur Jatir Janak Bangabandhu Sheikh Mujibur Rahman Govt. College Joypurhat Government College K Kabi Nazrul Government College Khulna Govt. Girls College Khulna Khulna Public College Khulna Kurigram Government College Kurigram M M. E. H. Arif College Madan Mohan College Madhupur College Madhupur Shahid Smrity Higher Secondary School Maulana Mohammad Ali College Mohammadpur Government College Dhaka Mirpur Bangla High School and College Dhaka Mohammadpur Model School & College Dhaka Mohammadpur Preparatory School & College Dhaka Muminunnesa Women's College Murari Chand College Mymensingh Polytechnic Institute Mymensingh N Notre Dame College Dhaka 1949 Motijheel, Dhaka Naogaon Government College Narail Victoria College Narail Narayanganj Government Mohila College Narayanganj Nawab Faizunnesa Government College 1943 Laksam, Cumilla Nazipur Government College Nazirhat College New Government Degree College, Rajshahi Rajshahi Noakhali Government College Noakhali Noakhali Government Women's College Noakhali Noakhali Science and Commerce School and College Noakhali Notre Dame College, Mymensingh P Pakundia Adarsha Mohila College Kishoreganj Patuakhali Government College 1957 Patuakhali Perdana College of Malaysia Police Lines School and College Polli Sree College R Rahmat Iqbal College Rajshahi College Rajshahi RAJUK Uttara Model College Dhaka Rangpur Government College Rangpur Rangpur Engineering College Rangpur Rangpur Public School And College Rangpur Rangunia College Rangpur Raozan Government University College Royal Media College S Safiuddin Sarker Academy and College Saidpur College Sapahar Government College Shyamoli Textile Engineering College Dhaka Shaheed Abdur Rab Serniabat Textile Engineering College Shahidul Chowdhury Engineering College Shahid A.H.M. Kamaruzzaman Govt. Degree College Shahid Syed Nazrul Islam College Shaikh Burhanuddin Post Graduate College Sherpur Government College Sonapur Degree College SOS Hermann Gmeiner College Sylhet Cadet College Sylhet Sylhet Engineering College Sylhet Sylhet Government Women's College Sylhet Sylhet Science And Technology College Sylhet T Tangail Polytechnic Institute Tangail Tejgaon College Dhaka Tejgaon Mohila College Dhaka Tetulia B. M. C. College Textile Engineering College, Chittagong Chittagong Thakurgaon Government College U Ullapara Science College United College of Aviation, Science & Management University Laboratory School and College Uttar Kattoli Alhaz Mostafa Hakim University College Uttara Town College Dhaka Civil Aviation School and College Tejgaon 1963 Dhaka ==Related pages== * Education in Bangladesh * List of universities in Bangladesh * List of schools in Bangladesh ==References== ==Other websites== * List of Colleges of Bangladesh Category:Bangladesh-related lists",
 "title": "List of colleges in Bangladesh"
}