{
 "id": "980334",
 "text": "Gionna Daddio (born June 8, 1994), better known by her ring name Liv Morgan, is an American professional wrestler. She is currently signed to WWE, where she performs on the Raw brand and is a member of The Judgment Day. She is a two-time SmackDown Women's/Women's World Champion and a four-time WWE Women's Tag Team Champion with Raquel Rodriguez. The two hold the record for the most reigns of the latter title as a team. She also was a part of The Riott Squad with Ruby Riott and Sarah Logan and won the women's Money in the Bank ladder match on July 2, 2022. On the same night she cashed in her contact and defeated Ronda Rousey to win the SmackDown Women's Championship. == Filmography == Film Film Film Film Year Title Role Notes 2023 The Kill Room Emma Television Television Television Television Year Title Role Notes 2015, 2019 Total Divas Herself Guest: Season 4, episode 9: \"Clash of the Divas\" Recurring (Season 9): 10 episodes 2021 Attack of the Show! Herself 2022 Chucky Herself Season 2, episode 4: \"Death on Denial\" 2022 Miz & Mrs. Herself Episode: \"The Royal Return\" 2023 Jersey Shore: Family Vacation Herself Episode: \"Get Your Sack in the Hole\" 2023 Celebrity Family Feud Herself Episode: \"WWE Women vs. WWE Men and Marcus Lemonis vs. Bert Kreischer\" == Championships and accomplishments == * ESPN ** Ranked No. 9 of the 30 best Pro Wrestlers Under 30 in 2023 * New York Post ** Female Breakout Wrestler of the Year (2022) * Pro Wrestling Illustrated ** Ranked No. 17 of the top 150 female wrestlers in the PWI Women's 150 in 2022 ** Ranked No. 48 of the top 50 Tag Teams in the PWI Tag Team 50 in 2021 - with Ruby Riott * Slam Wrestling Awards ** Worst Feud - Female (2022) - with Ronda Rousey *Women's Wrestling Fan Awards ** Best Face of the Year (2021, 2022) ** Breakout Star of the Year (2022) ** Most Improved of the Year (2020) * WWE ** Women's World Championship (2 times) ** WWE Women's Tag Team Championship (4 times, current) – with Raquel Rodriguez ** Women's Money in the Bank (2022) == Footnotes == == References == == Other websites == * * * Category:1994 births Category:Living people Category:American professional wrestlers Category:Female professional wrestlers Category:People from Morristown, New Jersey Category:Professional wrestling managers and valets Category:Sportspeople from New Jersey Category:WWE wrestlers",
 "title": "Liv Morgan"
}