{
 "id": "980457",
 "text": "\"I Found a Way\" (also known as \"Found a Way\") is a song by American actor and singer Drake Bell, from the Nickelodeon show Drake & Joshs soundtrack album of the same name (2005), and Bell's first album Telegraph (2005). The song was written by Bell and Michael Corcoran, one of Bell's friends and band members. \"I Found a Way\" is a pop and alternative rock song that refers to the relationship between the two main characters of the show. Dan Schneider, the producer of the TV show Drake and Josh, loved \"I Found a Way\" and decided to use it as the show's theme song. Bell has sung \"I Found a Way\" at many of his concerts over the years. ==Background== In September 2018, American singer and actor Drake Bell talked to American animator Butch Hartman about the theme song for the TV show Drake & Josh. He said that it was going to be a song by American Lenny Kravitz. The show's American producer, Dan Schneider, asked Bell how much of his own music he wanted to use for the show. Bell wanted to be a \"rock star\" and was happy to write music for the show. He told his friend and bandmate Michael Corcoran that they should write a theme song for Drake & Josh that could be connected to the show since everyone was listening to Kravitz at the time. Bell and Corcoran tried to create a theme song for Drake & Josh, but they couldn't come up with anything good. So they decided to write a regular song instead, which was inspired by English singer Elvis Costello. The song was about helping your brother when they're feeling sad. They made a short recording of the song in 2003. Later on, Bell played the recording for Schneider. Schneider was worried about hurting Bell's feelings if he didn't like the song, but Bell told him to listen. Schneider loved the song and used it as the show's theme song. ==Release and music== \"I Found a Way\" was released on February 22, 2005, as the first song on the soundtrack album for the Nickelodeon show Drake & Josh. Later on, August 23, 2005, the song was released again under the title \"Found a Way\" as the second song on Bell's first album, Telegraph. \"I Found a Way\" is a pop and alternative rock, according to Chloe Barns of the magazine Collider. Barns also said that the song is about the relationship between the two main characters of the show. Bell explained that his fans would often sing the chorus with the incorrect lyrics: \"If you open up your mind/See what's inside/It's gonna take some time to realize.\" However, Bell said that the correct lyrics are \"It's gonna take some time to re-align.\" ==Critical reception== Many critics liked the song. Taylor Ferber, who writes for Bustle magazine, said it was really catchy and perfect for getting people in a good mood. Lauren Hazlewood from Fashion magazine also said it was catchy. The people who work for the magazine Iowa City Press-Citizen said it was a very important song for Bell. Ashley Amber from Collider said the song made people feel nostalgic, while Maria Serra of Alternative Press liked the track, called it a \"banger\". Critics have said that \"I Found a Way\" is one of the best theme songs from the 2000s. Crystal Bell from MTV put the song as the fourth best Nickelodeon theme song, saying it was a really catchy tune. Tobi Gbile from Bustle also put it at number four on his list of childhood theme songs that give people feelings, saying that it was one of his favorite songs and became really popular in the mid-2000s. Both Nick Caruso and Matt Webb Mitovich from TVLine also put the song to their list of the top TV theme songs from 2000-2009. ==Live performances and other usages== At a meet and greet at Heroes Comics in Fresno, California in 2018, Bell sang \"I Found a Way\" with one of his fans before his concert. During one of his concerts in 2020, the actor sang \"I Found a Way\". When the audience sang \"It's gonna take some time to realize\", he stopped them and said that the correct word was \"realign\" instead of \"realize\". After correcting them, he played the song again. During another one of his 2020 concerts, Bell also performed the song for Jonathan Goldstein, the actor who played Walter Nichols, the father in Drake & Josh. In March 2021, Bell performed \"I Found a Way\" live at a drive-in concert in Tucson, Arizona. In August 2016, Bell's former co-star, Josh Peck, also an American actor, shared a video on Instagram of John Stamos, another American actor, singing his own version of \"I Found a Way\". In the video, Stamos sang, \"Drake and Josh. Everybody loves Drake and Josh.\"\"I Found a Way\" is played in two different episodes of the TV show iCarly. In one episode called \"iGo Nuclear,\" it's played at a smoothie restaurant. In another episode called \"iGot A Hot Room,\" actors Jennette McCurdy and Nathan Kress sing it during the closing credits while Miranda Cosgrove sings the theme song to iCarly. The song is also has been featured in the television series used as the background for one of the scenes in episode 1 of the first season of the American comedy television series Qawa'ed Al Talaq Al 45. ==Credits and personnel== Credits adapted from Tidal. *Drake Bell vocals, writer *Michael Corcoran writer ==References== Category:2005 songs Category:Nickelodeon",
 "title": "I Found a Way"
}