{
 "id": "980409",
 "text": "Philips Records is a record label. It was founded by the Dutch electronics company Philips. It was started by \"Philips Phonographische Industrie\" (PPI) in 1950. Recordings were made with popular artists of various nationalities and also with classical artists from Germany, France and the Netherlands. Philips also distributed recordings made by the American Columbia Records on the European continent. After the split of English Columbia and American Columbia in late 1954, Philips also began distributing original Columbia recordings on the Philips label in the UK. ==History== In 1958, Philips created a subsidiary label, Fontana Records, which meant that American- Columbia recordings were released on the Philips and Fontana labels. Under the direction of US President of Columbia Records, Goddard Lieberson, in late 1964 CBS Records formed its own international operations, adopting the name of its then parent CBS. CBS established their UK operation on Theobalds Road in Holborn. Products issued by Philips and Fontana Columbia were later withdrawn. Philips Records and Deutsche Grammophon were linked into the Gramophon-Philips Group (GPG) joint venture, which later became PolyGram in 1972. UK pressings were manufactured at the company's large factory based at Walthamstow, North East London. In 1964, after Philips lost its North American distribution deal with Columbia Records, it signed a sawp deal with Mercury Records. A year later, Philips' US subsidiary \"Consolidated Electronics Industries Corp.\" (also known as \"Conelco\"), bought Mercury and its subsidiary labels, like Smash. Philips classical, jazz and pop records were marketed by Mercury in the US under the Philips label. The Mercury Living Presence team also made classical recordings for Philips, in July 1961. These records, made in Walthamstow Town Hall near London, included: Liszt piano concertos by Sviatoslav Richter and the London Symphony Orchestra conducted by Kiril Kondrashin; two albums of symphonic \"bon-bons\" by the London Symphony Orchestra and Charles Mackerras released as \"Kaleidoscope\"; \"Russian Song Recital\" by Galina Vishnevskaya and Mstislav Rostropovich; and Beethoven sonata op. 69 for cello and piano by Richter and Rostropovich. The Richter Liszt album was recorded on 3-track 35mm magnetic film and was reissued on CD from a remaster made from the film by original producer Wilma Cozart Fine, (wife of the late recording pioneer Bob) as part of the Philips Solo series. Classical groups that Philips heavily recorded included the Royal Concertgebouw Orchestra, the Beaux Arts Trio, and the Quartetto Italiano. The violinist Arthur Grumiaux and the pianist Claudio Arrau were under contract with Philips. Symphony orchestras under contract, including the LSO, were led by prestigious young conductors such as Colin Davis and Bernard Haitink. ==References== Category:1950 establishments Category:Dutch record labels",
 "title": "Philips Records"
}