{
 "id": "980480",
 "text": "Wednesday is a comedy horror TV show about the character Wednesday Addams from The Addams Family. The series is created by Alfred Gough and Miles Millar and stars Jenna Ortega as the main character. Catherine Zeta-Jones, Luis Guzmán, Isaac Ordonez, Gwendoline Christie, Riki Lindhome, Jamie McShane, Fred Armisen, and Christina Ricci appears in supporting roles. Tim Burton directed four out of the six episodes. He also serves as executive producer of the series. == Cast == *Jenna Ortega as Wednesday Addams, a girl who has psychic powers. She is sent to Nevermore Academy for causing mischief at other schools. Ortega also plays Goody Addams, Wednesday's deceased ancestor who Wednesday sees in visions of the past. **Karina Varadi as young Wednesday *Gwendoline Christie as Larissa Weems, the principal of Nevermore Academy. She is a former student who was roommates with Morticia Addams. **Oliver Wickham as young Larissa Weems * Riki Lindhome as Dr. Valerie Kinbott, Wednesday's therapist * Jamie McShane as Donovan Galpin, Jericho's sheriff and former deputy. He is suspicious of Nevermore Academy and Wednesday specifically. ** Ben Wilson as young Donovan Galpin * Hunter Doohan as Tyler Galpin, a barista at a local coffee shop and Sheriff Galpin's son who has a romantic interest in Wednesday * Percy Hynes White as Xavier Thorpe, a student of Nevermore Academy who has the ability to make his art come to life * Emma Myers as Enid Sinclair, Wednesday's colorful werewolf roommate who attempts to become her friend despite Wednesday's lack of interest * Joy Sunday as Bianca Barclay, a successful student at Nevermore Academy who is a siren and Xavier's ex- girlfriend * Georgie Farmer as Ajax Petropolus, a gorgon student at Nevermore Academy who is Enid's crush * Naomi J. Ogawa as Yoko Tanaka, a vampire and student at Nevermore Academy * Christina Ricci as Marilyn Thornhill/Laurel Gates, a botany teacher at Nevermore Academy and dorm mom of Wednesday and Enid * Moosa Mostafa as Eugene Otinger, a student at Nevermore Academy who has the power to control bees == Other websites == * * == References == Category:2022 American television series debuts Category:American fantasy television series Category:English-language television programs Category:Television series about families",
 "title": "Wednesday (TV series)"
}