{
 "id": "980562",
 "text": "The Diary of Alicia Keys is the second studio album from American R&B;/soul pianist and singer Alicia Keys. It was released in late 2003, and went on to win the 2004 Grammy Award for Best R&B; Album. It includes the hit singles \"You Don't Know My Name\" (produced by Kanye West, \"If I Ain't Got You\", and \"Diary\" (featuring Tony! Toni! Tone!). ==Background== Due to the extreme popularity of her debut album, Songs in A Minor, there was a lot of pressure on the album to match or exceed that success.Norment, Lynn. \"Alicia Keys: sounds off on men, love & fame.\" Ebony 59.3 (Jan 2004): 134(4). Expanded Academic ASAP. Gale. Hampton University Library. 26 Nov. 2007 . ==Critical reception== The album received positive reviews from critics. Of The Diary of Alicia Keys, Josh Tyrangiel of Time said that Keys \"made half a great record. The first six songs are models of how to make nostalgic music that is not anti-present... The second half of Diary sags.\" However, he added that it was \"obvious\" that subsequent albums would \"be worth hearing.\"Tyrangiel, Josh (2003-12-08), \"The Princess of Queens\". Time. 162 (23):89 Giving the album four stars, People magazine said that \"Keys honors R&B;'s golden age with an old soul far beyond her 23 years.\"Arnold, Chuck (2003-12-08), \"The Diary Of Alicia Keys\". People. 60 (23):47 Billboard magazine felt that \"the songstress handily tops Songs in A Minor\" and \"channels spirits of '60s and '70s soul for Diary.\"Paoletta, Michael (2003-12-13). \"The Diary of Alicia Keys\". Billboard. 115 (50):44 Rolling Stone called the album \"an assured, adult statement, steeped in the complicated love life and musical dreams of an ambitious young woman\", comparing Keys to Nina Simone and Aretha Franklin.Sheffield, Rob (2003-12-25-2004-01-08), \"Alicia Keys\". Rolling Stone(938/939):124 ABC News said \"If I Ain't Got You\" is \"a stunner of a ballad on which Keys' sound and vocal inflection recalled another one of Davis' famous proteges: Whitney Houston.\"ABC News: What's Alicia Keys' Secret Weapon? ==Awards== At the 2005 Grammy Awards, The Diary of Alicia Keys won Best R&B; Album and also earned Keys two other awards: Best Female R&B; Vocal Performance for \"If I Ain't Got You\" and Best R&B; Song for \"You Don't Know My Name\". ==References== Category:2003 albums Category:Alicia Keys",
 "title": "The Diary of Alicia Keys"
}