{
 "id": "980561",
 "text": "\"A Woman's Worth\" is a single from R&B;/soul musician Alicia Keys's debut album, Songs in A Minor. Released in late 2001, the track peaked at number 7 on the Billboard Hot 100, also reaching number 18 in the UK and number 16 in Australia. ==Release== \"A Woman's Worth\" was released in 2002 and reached number seven on the Billboard Hot 100. At the 2002 Grammy Awards ceremony, Keys performed both \"Fallin'\" and a tango-influenced version of \"A Woman's Worth\". Keys took five Grammy Awards that night. ==Music video== The music video for the single, directed by Chris Robinson, was a BET and MTV2 staple in 2002. Unlike many other contemporary R&B; videos, the video for \"A Woman's Worth\"'s video was a low-key clip with no dance. It was nominated for Best R&B; Video and Best Cinematography at the 2002 MTV Video Music Awards. ===Plot=== The plot of the video continues from Keys' previous video, \"Fallin'.\" When Keys' boyfriend is released from jail, he is frustrated by his failed attempt to find a job. Meanwhile, Keys realizes that she's not paying much attention to him, so she worries that her boyfriend is putting her job frustration before her girlfriend, to which Keys explains, \"You'll lose if you decide to refuse to do it.\" put her first.\" The video begins with Keys walking down the street and singing \"Fallin'\" as she listens to it on her headphones. A street kid sees her and joins her in saying, \"Hey yo shorty, what's up? You looking good today. So you gon' give me some time or what?\" Keys replies, \"What you talking about, shorty? What you know about a woman's worth?\" The song starts right after that, showing Keys in her apartment, playing the piano and singing. In the next shot, her boyfriend is frustrated that he couldn't find a job and runs into her friends on the street, who make fun of her formal wear. He comes home angry, he doesn't see Keys by the door and walks past her. The scene then cuts to an old woman walking down the street, struggling with her grocery bags. A young man approaches her from behind her and helps her. Back at Keys' apartment, both Keys and her boyfriend are sitting on the couch while she fixes it. In this particular scene, Keys sings the line \"I'll hold you when the going gets tough\" (the original line, as heard on her album, is \"I'll hold you when the going gets tough\"). The next scene shows the street kid from the beginning of the video having dinner with his parents. She sees that her parents are in conflict and begin to argue in front of the boy. The father then smashes his plate of food on the floor and walks out of the house, leaving his wife in tears and the boy in shock. Later, he goes into her mother's bedroom to comfort her. Intercut shots show Keys outside an apartment building in a courtyard alone with her piano as she sings. The boy is then walking down the street in the pouring rain at night when he sees Keys talking on a pay phone. He shares her umbrella with her and the two start walking together. The video ends with Keys singing the final chorus of the song. Category:2002 songs Category:Alicia Keys songs Category:Songs with feminist themes",
 "title": "A Woman's Worth"
}