{
 "id": "980576",
 "text": "Lucas Hedges, (born on December 12, 1996 in Brooklyn Heigths, New York) is a American actor. He studied theater at the University of North Carolina School of the Arts. He played a teenager in a gay conversion therapy program in the 2018 movie Boy Erase. ==Filmography== ===Films=== Year Title Role Director Notes 2007 Dan in Real Life Lilly's Dance Partner Peter Hedges 2012 Moonrise Kingdom Redford Wes Anderson Arthur Newman Kevin Avery Dante Ariola 2013 Labor Day Richard Jason Reitman The Zero Theorem Bob Terry Gilliam 2014 The Grand Budapest Hotel Pump Attendant Wes Anderson Kill the Messenger Ian Webb Michael Cuesta 2015 Anesthesia Greg Tim Blake Nelson 2016 Manchester by the Sea Patrick Chandler Kenneth Lonergan 2017 Pigeonhearts Eli Grant Conversano Short film Lady Bird Danny O'Neill Greta Gerwig Three Billboards Outside Ebbing, Missouri Robbie Hayes Martin McDonagh 2018 Boy Erased Jared Eamons Joel Edgerton Ben Is Back Ben Burns Peter Hedges Mid90s Ian Jonah Hill 2019 Honey Boy Otis Lort Alma Har'el Waves Luke Trey Edward Shults 2020 French Exit Malcolm Price Azazel Jacobs Let Them All Talk Tyler Hughes Steven Soderbergh TBA Shirley TBA John Ridley ===Television=== Year Title Role Notes 2012 The Corrections Young Chip Lambert Unaired pilot 2015 The Slap Ritchie Joanou (né Collins) 5 episodes 2020 Home Movie: The Princess Bride Westley Episode: \"Chapter Six: The Fire Swamp\" 2021 The Premise Jesse Wheeler Episode: \"The Ballad of Jesse Wheeler\" ===Theatre=== Year Title Role Theater Notes 2017 Yen Hench Lucille Lortel Theatre 2018 The Waverly Gallery Daniel Reed John Golden Theatre 2020 This Is Our Youth Warren Straub — Virtual play ===Music videos=== Year Title Artist Role Notes 2019 Never Said Samia Ivo 2020 Sue Me (feat. Kelly Price) Wale, Kelly Price 2022 Kill Her Freak Out Samia === Audiobooks === Year Title Role Author Notes 2020 Love, Kurt: The Vonnegut Love Letters, 1941-1945 Narrator Edith Vonnegut An Audible Original ==Other websites== * Category:1996 births Category:Living people Category:Actors from New York (state)",
 "title": "Lucas Hedges"
}