{
 "id": "980579",
 "text": "Irving Lorenzo (June 26, 1970 - February 5, 2025), better known by his stage name Irv Gotti, was an American hip hop producer and was the head of the successful record label, Murda Inc.. Various popular hip hoppers, such as Ja Rule, Ashanti, Vita, Caddillac Tah, Charli Baltimore, and Bobby Brown are currently part of his label. He has made cameo appearances in Ashanti's \"Foolish\" and Ja Rule's \"Down 4 U\" music videos. He was born in New York City. ==Career== He signed and/or produced such notable acts like Ja Rule, Ashanti, Vita, Caddillac Tah, Black Child, Charli Baltimore, Bobby Brown, The Game, Purple Entertainment, and Lloyd. He has been featured in videos for Ashanti's \"Foolish\", Lloyd's \"Hey Young Girl\", Ja Rule's \"Down 4 U\" and possibly more. He also produced several tracks on DMX's first two albums. In 2004, The Inc was investigated for allegedly laundering money through the label of New York City drug lord Kenneth \"Supreme\" McGriff. On January 25, 2005, Lorenzo and his brother Chris turned themselves in, pleading their innocence. They were released on $1 million bail and will not be tried along with McGriff for the charges against them.http://www.bet.com/Music/MusicNews/Irv+Gotti+Proclaims+Innocence.htm?wbc_purpose=Basic&WBCMODE;=PresentationUnpublished On November 16, 2005, US Attorney Sean Haran said in his opening statement in U.S. District Court that Irving Lorenzo and his brother Christopher \"used their corporate bank accounts to clean drug money\". According to Haran, convicted drug dealer Kenneth \"Supreme\" McGriff, sent shopping bags filled with cash and boxes of shoes to the brand's Manhattan office in 2000. The company then handled McGriff $280,000 in checks. Authorities alleged that McGriff was allowed to funnel more than $1 million in drug money through Murder Inc. in exchange for serving as the label's protector and enforcer. Prosecutors also claim the Lorenzos knew about an assassination plot against platinum-selling rapper 50 Cent. On December 2, 2005, Irving Lorenzo and his brother Christopher were acquitted of all money laundering charges. The courtroom erupted in applause and some jurors congratulated them. The brothers could have faced up to 20 years in prison. The defence countered all along that the brothers were victims of coilability by association with Kenneth \"Supreme\" McGriff. http://www.msnbc.msn.com/id/10300761/ Gotti co-produced Vanessa Carlton's third album, Heroes and Thieves, with Channel 7, Rick Rubin and Stephan Jenkins, which was released on October 9, 2007.\"Irv Gotti Maps Out Inc. Comeback With Vanessa Carlton, Lloyd, Ja Rule\" MTV News. November 28 2006. Retrieved November 30 2006. ==Death== Gotti died on February 5, 2025 from problems caused by multiple strokes and diabetes in New York City, aged 54. ==References== ==Other websites== * Category:1970 births Category:2025 deaths Category:American record producers Category:African-American musicians Category:American Grammy Award winners Category:Participants in American reality television series Gotti, Irv Category:Deaths from stroke Category:Deaths from diabetes Category:Musicians from New York City Category:Businesspeople from New York City Category:Television personalities from New York City",
 "title": "Irv Gotti"
}