{
 "id": "980529",
 "text": "GOOD (Getting Out Our Dreams) Music is an American record label founded by hip hop artist and record producer Kanye West in 2004. The label includes West, Big Sean, Pusha T, Teyana Taylor, Mos Def, D'banj and John Legend. The label is also home to a roster of producers, including Hudson Mohawke, Q-Tip, Travi$ Scott, No I.D., Jeff Bhasker and S1. The label has released seven albums certified gold or higher by the Recording Industry Association of America (RIAA). ==History== ===2004–07=== West founded GOOD Music in 2004, in conjunction with Sony BMG, shortly after releasing his debut album, The College Dropout. John Legend, Common, and West were the label's inaugural artists. Legend's Get Lifted (2004) was the label's first album release - this received eight nominations and three wins at the 2006 Grammy Awards, including Best New Artist and Best R&B; Album. In October 2006, Legend released his second album, Once Again, which won a Grammy for the song \"Heaven\". Common's Be (2005), the label's second release, was the recipient of four Grammy Award nominations. The label later added GLC, Really Doe, Malik Yusef, Tony Williams and Consequence to its artists. West's second studio album, Late Registration, included featured guest appearances by every artist signed to GOOD Music's roster at the time of its release in August 2005. In May 2007, Detroit rapper Big Sean signed to the label. ===2008–2011=== In 2008, West signed British singer-songwriter Mr Hudson, after hearing A Tale of Two Cities. He also signed then up-and-coming rapper Kid Cudi, after hearing his respective work from producer and manager Plain Pat. Kid Cudi's debut album, Man on the Moon: The End of Day was released under GOOD Music on September 15, 2009. The album earned three Grammy nominations and was certified Gold by the RIAA. A month later Mr Hudson's solo debut, Straight No Chaser, was released. The label held a cypher for the 2010 BET Hip Hop Awards in June, that featured West, Common, Big Sean and new signee Cyhi the Prynce. In late 2010, West released several tracks featuring himself, and others members of the GOOD Music roster, in a free weekly giveaway known as, G.O.O.D. Fridays. In September 2010, West signed Brooklyn rapper Mos Def to GOOD Music. and shortly afterwards Consequence released a diss track and left the label. The following month Pusha T announced his signing. Late in 2010, Kid Cudi released his second studio album Man on the Moon II: The Legend of Mr. Rager, followed by West's fifth album My Beautiful Dark Twisted Fantasy. In April 2011, West signed Q-Tip of A Tribe Called Quest as a producer. and signed producer Hit-Boy to Very G.O.O.D. Beats. In 2011, West signed Nigerian artists D'banj and Don Jazzy. In June 2011, GOOD Music signed their first distribution agreement, with Def Jam Recordings. Big Sean's debut Finally Famous was the first album released by GOOD Music with distribution by Def Jam. ===2012–present=== In late 2011, plans were announced for a 2012 release of a GOOD Music compilation album, later revealed to be titled Cruel Summer. The album's lead single \"Mercy\", was released on April 6, 2012 and features verses from Kanye West, Pusha T and Big Sean, as well as GOOD Music affiliate 2 Chainz. The album was also preceded by the singles \"New God Flow\" and \"Clique\", the latter of which peaked at number 12 on the US Billboard Hot 100 and features West and Big Sean rapping alongside Jay-Z. Cruel Summer was released on September 18, 2012. It was accompanied by the eponymous short film Cruel Summer, which was shot in Qatar; the film premiered at Cannes Film Festival. The album debuted at number one on the Billboard 200. In January 2013, Scottish record producer and DJ Hudson Mohawke, announced that he had signed to the production arm of G.O.O.D. Music - Very G.O.O.D. Beats. On April 2, 2013, Kid Cudi announced on Power 106 that he was no longer with the label, leaving once finding out an old vocal of his was released on Kanye's new album \"Yeezus.\" Cudi felt he was \"underused\" and would have preferred to record something particular. They left on seemingly amicable terms. On June 29, 2013 producer Hit-Boy of Very G.O.O.D. Beats announced that his contract expired and that he was no longer signed to GOOD Music. American Apparel model Kacy Hill was signed to the label December 2014, after appearing as a backup dancer on West's Yeezus Tour. ==References== Category:2004 establishments in the United States Category:American record labels Category:Kanye West",
 "title": "GOOD Music"
}