{
 "id": "980806",
 "text": "Alexander Anatolievich Kandaurov (, born July 23 1990, Voronezh, Voronezh Oblast, Russia), better known by his stage name Alexander Dei-Russ is a Russian singer, musician, movie actor, theater actor, model, music producer. Member of the Union of Russian Writers, Member of the Union for Animated Sounding Pictures, Scriptwriter, Director and Host of the Author's Program on Music Box Gold TV Channel, Nominee for the National Literary Award \"Poet of the Year\" 2018, Member from the all-Russian public organization \"Officers of Russia\". == Biography == === Childhood === Alexander was born on July 23, 1990 in a small rural area a hundred kilometers from the city of Voronezh. From a very young age, Alexander was fond of singing and dancing, performing on stage was Alexander's childhood dream. Acting on stage was Alexander's childhood dream. From a very early age, she sang and danced all the time. With age, the desire to express himself through creativity grew stronger, and Alexander found a path that led him to great places that he shared in concerts with pop stars in venues such as: Crocus City Hall, the Kremlin State Palace, the Central House of Music. First there was karaoke. The most desired birthday gift for little Sasha turned out to be the karaoke that her mother gave her on her birthday. === Start of career === The boy's joy knew no bounds. If other kids were ready to tirelessly chase a soccer ball, then Sasha could sing for hours to the soundtrack. Mom encouraged her son's studies, but was a strict connoisseur. If you heard that your child was fake, did not reach the grades, you pointed this out to him, but you did not believe that creativity could become your child's profession in the future. She directed the boy towards a more mundane profession. And after graduating from school, Sasha entered a technical school to study economics. However, even there she did not abandon her passion and enroll in a vocal and choreographic circle. I wasn't there to study. I plunged headlong into the atmosphere of creativity. He devoted all his spare time to singing and dancing. In 2009, he joined the army, and there he found time to sing and dance, and Alexander served in the city of Perm in the Internal Troops of the Russian Ministry of Internal Affairs. == Creation == === Musical career === No matter how Alexander was drawn to creativity, he had to think about life, the vital. Finding a job in the village is not easy, and in 2011 he went to Moscow, got a job as a security guard in one of the companies, so that he could at least earn extra money for the first time. Having settled in the city, he again began to think about doing what he loved. Since July 2011, Alexander has worked as a fitness trainer, got a job at the Family Education Center, where he danced with young children 1.5 years and older. He worked part-time as a school teacher. == Books == === Artworks === * 2017 — «Веселое живём» * 2018 — «Горе Горькое в Крыму…Горе!» * 2020 — «Господа, простите музыканта» * 2022 — «Масленица-зазывалочка» === Poetry === Year Name 2019 «Муха и Мороз» 2022 «Колыбельная» «Признание щенка» «Мысли в голове» «Про котят» «Санки» «Замарашка» «Чепуха» «Зарядка» «Гармошка» «В курятнике» «Наказ мамы» «Велосипед» «Варенье» «Про школу» «Уборка» == Discography == === Albums === Name Information «Танцуй со мной (альбом)» * Release: June 9, 2020 * Leibl: Figuru Audio * Format: digital distribution === EP === Name Information «Танцуй со мной» * Release: December 20, 2020 * Label: WMA * Format: digital distribution === Singles === * 2019 — «Сосед» == References == Category:Russian stage actors Category:Living people Category:Russian singers Category:21st-century Russian singers Category:1990 births Category:People from Voronezh Oblast",
 "title": "Alexander Dei-Russ"
}