{
 "id": "980872",
 "text": "\"Hometown Glory\" is Adele's debut single. It is from her album 19. The song was also re-released as her fourth single. \"Hometown Glory\" was firstly released in 2007 as Adele debut single on singer Jamie T's Pacemaker Recordings label as a limited edition 7\" vinyl single, of which only 500 copies were made.Pacemaker Recordings web site The song failed to chart mainly due to high downloads of the song during her 19 album release week, the song managed to chart within the top 40 of the UK Singles Chart for the first time. The song was later released in 2008 as Adele's debut single for the US market. In the UK, due to the popularity of the song, which resulted in the song charting twice within the UK top 40 on download sales, the song was released as the third single (the fourth including the release of the original single) from the album on 21 July 2008. As of 27 July 2008, the track has become Adele's third consecutive UK Top 20 hit single. ==Music video== The music video for \"Hometown Glory\" was a live performance video, recorded for the re- release of the single. The initial limited edition vinyl release of \"Hometown Glory\" does not have a promotional video. ==Features== The song has featured on various television shows. On April 7, 2008, \"Hometown Glory\" was featured in the teen drama Skins, resulting in the song again charting in the UK Singles Charts top 40 at number 32. Later that month, on April 24, 2008, it was featured on One Tree Hill episode 5.15, and on May 22, 2008, the song was featured on the season four finale of Grey's Anatomy. On June 10, 2008, the song was used on popular British soap opera Hollyoaks and was used again in the soap opera on October 13, 2008. On July 2, 2008, it was featured in season 4 of So You Think You Can Dance in a Mia Michaels' contemporary dance by Katee Shean and eventual winner, Joshua Allen. It also featured in a Season 2 episode of Secret Diary of A Call Girl. The track has recently been used in advertisements and promotional scenes for the British soap opera Coronation Street. ==References== Category:Adele songs Category:2007 songs Category:Debut singles",
 "title": "Hometown Glory"
}