{
 "id": "980882",
 "text": "The 2022 Florida gubernatorial election was held on November 8, 2022, to elect the governor of Florida. Incumbent republican governor Ron DeSantis and incumbent republican lieutenant governor Jeanette Nuñez defeated former Florida governor Charlie Crist and Karla Hernandez-Mats on the Republican Party ticket. == Eligibility & requirements == Section 5 of the state's constitution states for a person to serve as governor must: * be at least thirty years old. * be a permanent resident in Florida for at least seven years. == Debate topics == === Abortion === The Dobbs v. Jackson Women's Health Organization decision in June 2022, which overturned the 1973 Roe v. Wade decision and permitted U.S. states to fully ban abortion for the first time in nearly 50 years, has made abortion a more possible issue. In the 2022 election, the topic of abortion was to play a major topic within the Republican Party. === Crime === Due to mass shootings increasingly surging in the United States, the Democratic Party has advocated for an assault weapons ban. This was a major debate topic to play out in within both parties. === Covid-19 Pandemic === The Covid-19 pandemic left a major effect in Florida, leaving over more than 70,000 deaths and over 5 million confirmed cases. This was a major issue and debate topic within the Republican Party. == Republican Party == In late 2021, incumbent Governor Ron DeSantis announced his reelection campaign to a second term. 2022 Florida Republican Party ticket Ron DeSantis Jeanette Nuñez for Governor for Lieutenant Governor 46th Governor of Florida since 2019 20th Lieutenant Governor of Florida since 2019 == Democratic Party == In April 2021, former Florida governor Charlie Crist announced his candidacy for governor to a non-consecutive term after he only served one term from 2007 to 2011. 2022 Florida Democratic Party ticket Charlie Crist Karla Hernández for Governor for Lieutenant Governor United States Representative(2017–2022)44th Governor of Florida (2007–2011) President of the United Teachers of Dade == Election results == On November 8, 2022, incumbent governor Ron DeSantis defeated Charlie Crist in a landslide victory margin along with incumbent lieutenant governor, Jeanette Nuñez as his running mate. == References == Category:2022 elections in the United States Category:November 2022 events Category:2022 in Florida",
 "title": "2022 Florida gubernatorial election"
}