{
 "id": "980825",
 "text": "Mërgim Berisha (born 11 May 1998) is a German professional footballer who plays as a Forward for club FC Augsburg, on loan from Fenerbahçe. He was born in Berchtesgaden, Germany, to Kosovan parents. ==Club career== ===Liefering=== On 7 November 2014 Berisha made his debut as a professional footballer against Mattersburg. He came in as a substitute at 73rd minute in place of Daniel Ripić. 50 seconds after his substitution he scored the third goal during a 3–1 home win. ===Red Bull Salzburg=== On 28 December 2016 Berisha signed his first professional contract with Austrian Bundesliga side Red Bull Salzburg. On 3 April 2017 he made his debut in a 0–5 away win against SC Rheindorf Altach after coming on as a substitute at 77th minute in place of Wanderson. Berisha helped his team winning the 2016–17 UEFA Youth League. He was one of the top scorers in the tournament, scoring seven goals in total. ====Loan at LASK==== On 21 August 2017 Berisha joined Austrian Bundesliga side LASK on a season- long loan. Five days later he made his debut in a 1–0 away defeat against Rapid Wien. ====Loan at 1. FC Magdeburg==== On 19 June 2018 Berisha joined 2. Bundesliga side 1. FC Magdeburg on a season-long loan. Two months later he made his debut with 1. FC Magdeburg in the 2018–19 DFB-Pokal first round against Darmstadt 98 . ====Loan at SC Rheindorf Altach==== On 10 January 2019Berisha joined Austrian Bundesliga side SC Rheindorf Altach on a season loan. On 23 February 2019, he made his debut in a 0–0 away draw against Wolfsberger AC. ====Return to Red Bull Salzburg==== =====2019–20 season===== On 6 January 2020 Berisha returned to Austrian Bundesliga side Red Bull Salzburg. On 14 February 2020 he played the first game after the return in a 2–3 home defeat against former club LASK after coming on as a substitute in the 59th minute in place of Patrick Farkas. =====2020–21 season===== On 13 September 2020 Berisha started his season with the club by winning in the opening match of 2020–21 season against Wolfsberger AC after being named in the starting line-up. On 3 November Berisha scored his first UEFA Champions League goal in a 2–6 defeat against German side Bayern Munich in the 2020–21 season, he also scored in the away tie in Munich as Salzburg lost 3–1. On 1 December Berisha scored two goals against Russian side Lokomotiv Moscow, which allowed Red Bull Salzburg win the match 3–1. This secured third place in the group and the 2020–21 UEFA Europa League knockout phase. On 1 May 2021 Berisha scored Salzburg's opening goal in the final of the Austrian Cup. ===Fenerbahçe=== On 2 September 2021 Berisha signed a four-year contract with Fenerbahçe and received squad number 11. ====Loan at Augsburg==== On 31 August 2022 Berisha joined Augsburg on loan with an option to buy. ==International career== On 7 October 2019, he was called-up from Germany U21 for the friendly match against Spain U21 and 021 UEFA European Under-21 Championship qualificationmatch against Bosnia and Herzegovina U21. Three days later, he made his debut with Germany U21 in a friendly match against Spain U21 after coming on as a substitute at 46th minute in place of Janni Serra. At the European Under-21 Championship 2021 he became European Champion. ==Personal life== Berisha was born in Berchtesgaden, Germany, to Kosovan parents from Suva Reka. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National cup Continental Total Division Apps Goals Apps Goals Apps Goals Apps Goals Liefering 2014–15 Austrian First League 3 1 0 0 — 3 1 2015–16 Austrian First League 8 2 0 0 — 8 2 2016–17 Austrian First League 30 14 0 0 — 30 14 Total 41 17 0 0 — 41 17 Red Bull Salzburg 2016–17 Austrian Bundesliga 1 0 1 0 0 0 2 0 2017–18 Austrian Bundesliga 0 0 1 0 0 0 1 0 2019–20 Austrian Bundesliga 8 1 1 0 1 0 10 1 2020–21 Austrian Bundesliga 28 14 4 3 10 5 42 22 2021–22 Austrian Bundesliga 2 1 0 0 1 0 3 1 Total 39 16 7 3 12 5 58 24 LASK (loan) 2017–18 Austrian Bundesliga 18 5 2 1 — 20 6 1\\. FC Magdeburg (loan) 2018–19 2. Bundesliga 4 0 1 0 — 5 0 Rheindorf Altach (loan) 2018–19 Austrian Bundesliga 14 7 0 0 — 14 7 2019–20 Austrian Bundesliga 17 7 3 2 — 20 9 Total 31 14 3 2 — 34 16 Fenerbahçe 2021–22 Süper Lig 22 4 1 0 8 3 31 7 2022–23 Süper Lig 1 1 0 0 0 0 1 1 Total 23 5 1 0 8 3 32 8 FC Augsburg (loan) 2022–23 Bundesliga 23 9 0 0 — 23 9 FC Augsburg 2023–24 Bundesliga 2 0 1 0 — 3 0 Total 25 9 1 0 — 26 9 TSG Hoffenheim 2023–24 Bundesliga 1 0 0 0 — 1 0 Career total 182 66 15 6 20 8 217 80 ===International=== Appearances and goals by national team and year National team Year Apps Goals Germany 2023 2 0 Total 2 0 ==Honours== Red Bull Salzburg Youth *UEFA Youth League: 2016–17 Red Bull Salzburg *Austrian Bundesliga: 2016–17, 2019–20, 2020–21 *Austrian Cup: 2016–17, 2019–20, 2020–21 ==References== ==Other websites== Category:1998 births Category:Living people Category:German footballers Category:Association football forwards Category:FC Liefering players Category:FC Red Bull Salzburg players Category:FC Augsburg players Category:Austrian football champions",
 "title": "Mërgim Berisha"
}