{
 "id": "980883",
 "text": "Asylum Records is an American record label, owned by Warner Music Group. After several incarnations, today it is primarily oriented towards hip-hop, alternative metal and rock. ==Company history== ===Formation=== Asylum was founded in 1971 by David Geffen and his partner Elliot Roberts, who had previously worked an agent at the William Morris Agency and operated a folk/rock label. They founded their own management company, and when Geffen was unable to secure a recording contract for Jackson Browne, one of his clients at the time, Geffen and Roberts founded Asylum specifically to sign Browne. Asylum's first releases were distributed by Atlantic Records. The same year, Asylum signed John David Souther, Judee Sill, Linda Ronstadt, Joni Mitchell and Glenn Frey (who Geffen encouraged to form The Eagles, with Don Henley, Bernie Leadon, and Randy Meisner.) In 1972, then-folk singer- songwriter Tom Waits signed with the label and released his debut, Closing Time, in 1973. His fifth and final album for the label, Heartattack and Vine, was released in 1980. Asylum's crowning achievement was to sign Bob Dylan, who had been with Columbia Records since the early 1960s but, after a falling out with the company, was looking for a new label. Dylan recorded two albums, Planet Waves and the live Before the Flood for Asylum before returning to Columbia. Columbia reissued Dylan's two Asylum albums in 1981. ===Warner takeover and Elektra merger=== In 1972 Asylum was taken over by the then- Warner Communications (now Warner Music Group) and Asylum merged with Elektra Records to become Elektra/Asylum Records. David Geffen received $2 million in cash and $5 million in Warner Communications stock, making it one of the company's largest shareholders. In 1973, Geffen opened the now famous Roxy nightclub on the Sunset Strip in Los Angeles, which became a showcase for many up-and-coming artists. Geffen served as chairman and president of Elektra/Asylum Records until 1975, when he moved into motion pictures and was named vice president of Warner Brothers Pictures. One of Asylum's most notable signings after Geffen's departure was Warren Zevon, who released a string of critically acclaimed and successful LPs for the label; his self-titled 1976 label debut has been called the best California rock album of the decade. Geffen withdrew from his business affairs for several years after a cancer scare in 1976, which later turned out to be a misdiagnosis.http://www.hollywood.com/celebrity/David_Geffen/190723#fullBio David Geffen bio at Hollywood.com He returned to the business in 1980, founding the Geffen Records label and signing John Lennon, whose comeback album Double Fantasy was released just days before Lennon's assassination in December 1980. In the early 1980s, while still technically billing itself as \"Elektra/Asylum Records or Elektra/Asylum/Nonesuch Records\", Elektra and Asylum began to break up, with the former becoming more dominant and the latter acting more as an extension. By the middle of the decade, the company was unofficially calling itself Elektra Records, and in 1989 it was renamed Elektra Entertainment. Meanwhile, Asylum splintered into a subsidiary label and subsequently became less active in its own right. ===Country format=== Asylum was reformatted into a country music label, still operated by Elektra, in 1992. Under the new format, Asylum garnered hit recordings from acts like Brother Phelps, Thrasher Shiver, Emmylou Harris, Kevin Sharp, Bryan White, and Lila McCann. They also produced many critically acclaimed albums by artists including Mandy Barnett, Guy Clark, The Cox Family, Bob Woodruff, J.D. Myers and Jamie Hartford. However, by the end of the decade, mismanagement and a lack of money for promotion led to the dissolution of the country label Asylum. In 2003, Mike Curb, head of Curb Records, revived Asylum's Nashville division, forming a new label known as Asylum-Curb. LeAnn Rimes, Clay Walker, Lee Brice, Rio Grand, Hank Williams, Jr. and Wynonna are among the artists in the Asylum-Curb division. ===Relaunch=== After being dormant for several years, Asylum Records was revived as an urban music-based label in 2004, independently managed through Warner Music Group. Some of its releases are distributed in conjunction with Warner Bros. Records and others through Atlantic Records. In 2006, WMG switched to Asylum to operate under its newly created Independent Label Group, which also comprises Cordless Recordings and East West Records. ===Sevendust signing=== On December 6, 2006, Asylum Records announced the signing of Atlanta-based metal band Sevendust, the first non- hip-hop artist to sign with the newly reconfigured label. Sevendust's Asylum debut (their sixth full-length album overall), titled Alpha was released on March 6, 2007, selling around 42,000 albums in its first week. Although Asylum has signed them, they have not given any notice of it anywhere. Sevendust's second album Chapter VII: Hope & Sorrow, on the Asylum label was released in 2008. ==References== Category:1971 establishments Category:American record labels",
 "title": "Asylum Records"
}