{
 "id": "980800",
 "text": "Asaf Ali (11 May 1888G. N. S. Raghavan and Asaf Ali (1994) M. Asaf Ali's Memoirs: The Emergence of Modern India. Ajanta. . p. 36. – 2 April 1953) was an Indian independence fighter and lawyer. He was the Indian Ambassador to the United States and Switzerland. He previously became the Governor of Odisha. He was the head of Railways and Transport in the Interim Government of India from 2 September 1946 until 15 October 1946. ==Education== Asaf Ali was educated at St. Stephen's College, Delhi. He was called to bar from Lincoln's Inn in England. ==Indian National Movement== In 1914, Ali opposed on the British attack on the Ottoman Empire. He resigned from the Privy Council. He returned to India in December 1914 and became heavily involved in the nationalist movement. He was elected to the Central Legislative Assembly in 1935 as a member of the Muslim Nationalist Party. He later joined the Indian National Congress as a member and was appointed as deputy leader.M. Asaf Ali Making Britain. Open.ac.uk. Retrieved on 7 December 2018. Ali was imprisoned during the freedom movement in the rise of the 'Quit India' resolution, which was adopted by the All India Congress Committee in August 1942. He was detained at Ahmednagar Fort jail along with Jawaharlal Nehru and other members of the Congress Working Committee.Asaf Ali. Indianpost.com (2 April 1953). Retrieved on 2018-12-07. ==Post 1946== He was in charge of the Railways and Transport in the Interim Government of India headed by Jawaharlal Nehru from 2 September 1946. He served as the first Indian Ambassador to the United States from February 1947 to mid-April 1947. == Post independence == Asaf Ali was first Indian Ambassador to United States. He was appointed governor of Odisha for two terms and later, Indian Ambassador to Switzerland. ==Legal career== Asaf Ali rose to become one of the most respected lawyers in the country. He defended Batukeshwar Dutt as a lawyer. Bhagat Singh was charged with attempt to murder under section 307 of the Indian Penal Code. Ali was his lawyer then. ==Death and legacy== Ali died in office in Bern on 2 April 1953. In 1989, India Post brought out a stamp in his honor. ==References== Category:1888 births Category:1953 deaths Category:Governors of Odisha Category:Ambassadors of India to the United States",
 "title": "Asaf Ali"
}