{
 "id": "980970",
 "text": "Hannes Wolf (born 16 April 1999) is an Austrian professional footballer. He plays as a midfielder for Borussia Mönchengladbach. ==Club career== Wolf began his career at SC Seiersberg. In February 2012 he went to USV Vasoldsberg. In the summer of 2012 he went back to JAZ GU-Süd, which has been an independent, registered football club since June of the same year. In 2014 he went to the Red Bull Salzburg Academy. ===FC Red Bull Salzburg=== In February 2016 he made his debut for the farmteam FC Liefering in the second division. He made his debut for FC Red Bull Salzburg in December 2016 when he came on as a substitute for Valentino Lazaro in the 75th minute against FC Schalke 04 on match day six of the 2016/17 Europa League. His debut in the Bundesliga was in the same month versus Wolfsberger AC. He came in for Takumi Minamino in the 85th minute. He scored his first Bundesliga goal on 5 August 2017 against FC Admira Wacker Mödling. He won the UEFA Youth League with the FC Salzburg U19 team in the 2016/17 season. With seven goals and four assists, he placed 3rd in the competition's goalscorer rankings. ===RB Leipzig=== On 23 January 2019, Red Bull Salzburg announced that they had sold Wolf to RB Leipzig from the upcoming 2019/20 season.Hannes Wolf to join RB Leipzig in the summer, redbullsalzburg.at, 23 January 2019 Short after his arrival to RB Leipzig, Wolf suffered a horrendous leg break for Austria U21 at the European Under-21 Championships in June 2019, after giving his side the lead in the 2–0 victory.RB Leipzig signing Hannes Wolf suffers horrific leg break in Austria win over Serbia at European U21 Championship, independent.co.uk, 18 June 2019 === Borussia Mönchengladbach === On 21 July 2020, Borussia Mönchengladbach announced the signing of Wolf on a loan deal from RB Leipzig until June 2021, with an option to buy at the end of the season. In February 2021, the director of sports Max Eberl confirmed that the move was made permanent. ====Swansea City (loan)==== On 20 January 2022, Wolf joined EFL Championship club Swansea City on loan until the end of the season. He scored his first goal for the club in a 0-4 win as Swansea City completed the first ever League double in the South Wales derby over rivals Cardiff City. ==International career== He was called up to the senior Austria squad for the UEFA Nations League matches against Croatia, Denmark, France and Denmark on 3, 6, 10 and 13 June 2022. ==Career statistics== Appearances and goals by club, season and competition Club Season League National cup Europe Total Division Apps Goals Apps Goals Apps Goals Apps Goals Liefering 2015–16 Austrian First League 10 1 — — 10 1 2016–17 Austrian First League 25 6 — — 25 6 Total 35 7 — — 35 7 Red Bull Salzburg 2016–17 Austrian Bundesliga 3 0 0 0 1 0 4 0 2017–18 Austrian Bundesliga 27 8 5 3 13 1 45 12 2018–19 Austrian Bundesliga 22 8 4 2 14 1 40 11 Total 52 16 9 5 28 2 89 23 RB Leipzig 2019–20 Bundesliga 5 0 0 0 0 0 5 0 Borussia Mönchengladbach (loan) 2020–21 Bundesliga 32 3 4 1 7 0 43 4 Swansea City (loan) 2021–22 Championship 19 2 — — 19 2 Borussia Mönchengladbach 2021–22 Bundesliga 7 0 1 0 — 8 0 2022–23 Bundesliga 18 1 — — 18 1 Total 25 1 1 0 — 26 1 Career total 153 27 14 6 35 2 202 35 == Honours == Red Bull Salzburg Youth *UEFA Youth League: 2016–17 Red Bull Salzburg *Austrian Bundesliga: 2017–18, 2018–19 *Austrian Cup: 2018–19 ==References== ==Other websites== * * Profile at ÖFB Category:1999 births Category:Living people Category:Association football midfielders Category:Austrian footballers Category:Bundesliga players Category:FC Liefering players Category:FC Red Bull Salzburg players Category:RB Leipzig players Category:Borussia Mönchengladbach players Category:Austrian football champions Category:Austrian football midfielders",
 "title": "Hannes Wolf (footballer)"
}