{
 "id": "980967",
 "text": "Reinhold Yabo (born 10 February 1992) is a German former professional footballer. He played as a midfielder. ==Career== Yabo began his career with Teutonia Niedermerz. 2001 he went to the youth of 1. FC Köln. For the 2009–10 season he was promoted in the U19 team. He played his first game for 1. FC Köln II on 8 August 2009 against Fortuna Düsseldorf II in the Regionalliga West. After four games more for the second team of 1. FC Köln he played his first Bundesliga match against VfL Bochum on 16 April 2010. On 24 April 2011 he was in the starting team for the first time. 20211/12 he was loaned to Alemannia Aachen. After he came back to Köln he had to play again in the second team. 2013/14 he went to Karlsruher SC. After two years with Karlsruhe he joined Austrian champions FC Red Bull Salzburg for the 2015/16 season. Yabo made his debut on September 21, 2016 in the ÖFB Cup game against SC Mannsdorf. He came on as a substitute in the 59th minute and scored the goal to make it 7-1. 2017 he was loaned to Arminia Bielefeld. The next season he came back to Salzburg. 2019 he returned to Bielefeld. Yabo announced his retirement from playing aged 29 in May 2021 at the end of the 2020–21 season, due to knee problems. ==International career== Yabo went through several youth selections of the DFB and was the captain of the German national under-17 football team at the 2009 UEFA European Under-17 Football Championship in Germany and won the European Championship with the team. Later tat year he played at the 2009 FIFA U-17 World Cup. earning four caps in the tournament in Nigeria. ==Personal life== Yabo was born in Aldenhovento Congolese parents.Tweet Yabos vom 30. Juli 2014 On 25 May 2014, he was elected as a member of the city council of Karlsruhe.http://web1.karlsruhe.de/Stadtentwicklung/afsta/Wahlen/Wahlabend- Netmodul-ab2014/2014-komm/gr/gemeinderat-2014-kandi.php (in German) retrieved on 26 May 2014 ==Career statistics== Appearances and goals by club, season and competition Club Season League Cup Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals 1\\. FC Köln 2009–10 Bundesliga 1 0 0 0 — 1 0 2010–11 4 0 0 0 — 4 0 Total 5 0 0 0 0 0 5 0 1\\. FC Köln II 2009–10 Regionalliga West 5 2 — 5 2 2010–11 24 9 — 24 9 2012–13 29 6 — 29 6 Total 58 17 0 0 0 0 58 17 Alemannia Aachen (loan) 2011–12 2. Bundesliga 17 0 1 0 — 18 0 Karlsruher SC 2013–14 2. Bundesliga 31 1 1 0 — 32 1 2014–15 31 5 1 0 2 1 34 6 Total 62 6 2 0 2 1 66 7 Red Bull Salzburg 2016–17 Austrian Football Bundesliga 2 0 2 2 1 0 5 2 2017–18 24 2 2 1 12 0 38 3 2018–19 9 1 2 2 6 0 17 3 Total 35 3 6 5 19 0 60 8 Arminia Bielefeld (loan) 2016–17 2. Bundesliga 14 4 0 0 — 14 4 Arminia Bielefeld 2018–19 2. Bundesliga 15 2 0 0 — 15 2 2019–20 24 4 1 0 — 25 4 2020–21 Bundesliga 13 1 0 0 — 13 1 Total 52 7 1 0 0 0 53 7 Career total 243 37 10 5 21 1 274 43 ==Honours== * 2009: UEFA European Under-17 Football Championship * 2009: Fritz-Walter-Medaille * 2009: Honorary Citizen of Aldenhoven ==References== ==Other websites== * Reinhold Yabo at DFB.de * Category:1992 births Category:Living people Category:German footballers Category:Association football midfielders Category:Bundesliga players Category:FC Red Bull Salzburg players Category:Arminia Bielefeld players",
 "title": "Reinhold Yabo"
}