{
 "id": "980929",
 "text": "The Grammy Award for Album of the Year is an award category at the Grammy Awards. ==History== The Grammy has been awarded since 1959. It was originally awarded only to the artist. It is not given to the artist, the producer, the engineer and/or mixer and mastering engineer. In 1962, the name of the award was expanded to Album of the Year (other than classical) but it returned to the shorter name in 1965. It was not until 1968, 1999, and 2002 that the award was won by a rock album, a hip hop album, or a country album, respectively. ==Winners== Taylor Swift is the biggest winner in this category with 4 wins. Frank Sinatra, Stevie Wonder, and Paul Simon are the second biggest winners in this category with 3 wins each. Paul McCartney leads all artists with 9 nominations: 5 as a member of The Beatles, 3 for solo albums, and 1 as a member of Wings. Frank Sinatra leads solo artists with 8 nominations, 7 for solo albums and 1 for a duet album. Paul McCartney and Paul Simon are the artists with the most nominations in most decades, 5 - the 1960's, the 1970's, the 1980's the 1990's and the 2000's, if counting 1960's nominations as part of their respective groups, The Beatles, and Simon & Garfunkel. Years reflect the year the Grammy Awards were awarded, for music released the previous year. ==Differences== Many wonder what the difference is between Record of the Year and Album of the Year. Record of the Year is awarded for either a single or an album track. This award goes to the performer, producer, recording engineer, and/or mixer for that song. Album of the Year is awarded for an entire album, with the award being given to the artist, producer, recording engineer, and mastering engineer for that album. So, in this context, \"record\" means one song and \"album\" means the entire collection of songs on a CD or LP. Unlike Record of the Year, which goes to the artist and production team of a single song, Song of the Year goes to the songwriter(s) of the song. Therefore, Record of the Year is awarded to the best recording. ==References== Category:Grammy Awards",
 "title": "Grammy Award for Album of the Year"
}