{
 "id": "98147",
 "text": "Human trafficking (or Trafficking in human beings) is a way to exploit people. People are sold, bought, traded much like slaves , and are even sold to couples who don't have children. It is estimated to be a $5 to $9 billion-a- year industry. Trafficking victims typically are recruited by using force or because they are deceived, or fraud is used, power is abused, or they are simply abducted. Threats, violence, and economic problems can often make a victim consent to exploitation. Human trafficking should not be confused with human smuggling. ==General== Exploitation includes forcing people into prostitution or other forms of sexual exploitation, forced labour or services, slavery or practices similar to slavery, servitude or the removal of organs. For children exploitation may also include forced prostitution, illegal international adoption, trafficking for early marriage, or recruitment as child soldiers, beggars, for sports, such as child camel jockeys or football players, or for cults. The norms based on international human rights law, such as Vienna DeclarationVienna Declaration, Part I para 18 and the Yogyakarta PrinciplesYogyakarta Principles, Article 11 prohibit human trafficking and Council of Europe and Charter of Fundamental Rights of European Union also prohibit them and do effort to save the victims. ==Sex trafficking== Sex trafficking is human trafficking, where the main idea is to trick or force people so they can be used for sexual needs. This is fundamentally different from sex work or prostitution. Prostitution and sex work is legal in many countries. Human trafficking is almost always illegal. ===Victims=== Many are women, but it is not rare for men to also be trafficked. Their ages, ethnic and their socioeconomic background all vary. Still there are groups of people that are more high-risk. * Homeless and runaway young people * People that move from other countries and have low resources * People who have gone through physical, emotional, or sexual abuse * People who have been mistreated in their life and have low social skills ===Perpetrators=== In 2017, researchers analyzed 1,416 child sex traffickers that were arrested in the United States in the past 10 years and it was found that 75.4% of traffickers are male and 24.4% are female. In average they were younger than 30 years. ===Methods=== * Trafficking controlled by pimps: A person is controlled by one trafficker called a pimp. They sometimes use promises of marriage or possible modeling chances to attract victims. Other times they simply use intimidation, brainwashing and kidnapping. * Trafficking done by gangs: It is a lot like pimp-controlled trafficking, but a person is controlled by a large group of people. They can also attract people by making them trust them. Gangs now have been using sex trafficking because it is safer and leaves more money than drug trafficking. * Trafficking done by a person's family: The person is controlled by members of their own families. They let them be exploited and ask for something in return, usually drugs or money. * Trafficking done by cybersex: Cybersex trafficking means the live streaming of forced sexual acts and/or rape on camera of trafficked victims. * Forced marriage: When a person is sent to another country, forced into a marriage and then is forced to participate in sexual conduct with their new partner, then the experience is considered sex trafficking. ==Child trafficking== Child trafficking is defined as the \"recruitment, transportation, transfer, harboring, and/or receipt\" of a child for the purpose of exploitation. The commercial sexual exploitation of children can take many forms. This includes forcing a child into Child prostitution or it can be other forms of sexual activity like child pornography. Exploitation may also involve forced labour or services like slavery. It can mean practices similar to slavery such as servitude or the removal of organs, illegal adoption, or recruitment as child soldiers., UEFA, 29 September 2006. (archived from the original on 2009-04-30) ==Related pages== * Child marriage * Forced marriage * Political corruption * Hague Adoption Convention * Gaslighting - A form of psychological abuse that can make human trafficking easier ==References== Category:Organized crime Category:Modern-day slavery",
 "title": "Human trafficking"
}