{
 "id": "981515",
 "text": "Street performance or busking is a type of performance done in public places for money or other gifts. Street performance is done all over the world, and it has been done since ancient times. People who do street performance can be called street performers or buskers. Street performances can be any type of performance. Some examples of street performances are making music, singing, juggling, dancing, and drawing caricatures. Some street performances can also be weird things, such as sword swallowing and being a living statue. == Types == There are many types of street performances. \"Circle shows\" are performances that get people to crowd around them. Most of them have a start and an end, such as street theatre. \"Walk-by acts\" are performances where a busker performs in a way that people can easily walk past them. These are mostly musicians and living statues. They do not usually have a start and an end, because the busker will keep performing for as long as they want. Some walk-by acts get people to crowd around them, because the people think the act is good. \"Stoplight performances\" are performances where buskers perform when cars are stopped on a road. Because cars do not stop for very long on the road, these buskers have fast performances. These are more common in South America. == Gallery == File:Hornsby busker 002.jpg|A street performer playing the guitar for people. His guitar case is open so people can put money in it. File:Street performer-Milan-2.jpg|Two street performers doing acrobatics in Milan, Italy. File:Sam Malcolm poses for a crowd while holding fire torches during the 2019 Michigan Busker Festival.jpg|A street performer with sticks that are on fire. The sticks are used for juggling. File:Royal Street busking band, French Quarter New Orleans, 1 December 2016 - 27.jpg|A band in New Orleans playing music on the street. File:The Copper Cowboy living statue.jpg|A living statue performer. Living statue performers act as if they are statues. == References == Category:Performing arts",
 "title": "Street performance"
}