{
 "id": "981516",
 "text": "Ernst Ocwirk (7 March 1926 – 23 January 1980) was an Austrian football player and coach. He played as midfielder mainly for FK Austria Wien in Austria and U.C. Sampdoria Genua in Italy. He was also a player of the Austrian national football team. He is regarded as one of the greatest Austrian footballers of all time. Nicknamed Clockwork by the British for his midfield consistency, as well as the nickname being suggested by his surname, he is often cited as the last of the old-fashioned attacking centre-halves; he was known for his aesthetic and technical style of playing, his heading ability, excellent timing (both in offensive and defensive tasks) and his passing range; particularly his long passing ability. The fans loved him for his modest and fair personality. The international media of the era saw Ocwirk as \"the best centerhalf in the world\". He is considered one of the greatest central midfielders of all time. ==Club career== Ocwirk began his career as a striker. He joined his first club, the local FC Stadlau, in 1938. He then played for Floridsdorfer AC, where he was spotted by former Austrian international Josef Smistik, who moved Ocwirk to centre midfield. Smistik tried to bring him to his former team, Rapid Wien, but it was FK Austria who won the race and signed him in 1947. With Austria he won five Austrian League championships and three domestic cups. 1956 he went to Sampdoriaand was the second Austrian footballer ever to play in Seria A after Engelbert König. Ocwirk played five seasons at the Genova club. He also became the captain. In 1961 he returned to FK Austria and played there his last season. He was winning in 1961–62. Ocwirk was chosen in Austria's Team of the Century in 2001. ==International career== Ocwirk played 62 caps matches and scored six goals for Austria.Appearances for Austrian National Team – RSSSF He made his debut in 1945 and played at the 1948 Olympic Games in London. At the 1954 World Cup he was captain of Austria and played in all five of his team matches. He scored two goals during the tournament: one in the memorable quarter-final against hosts Switzerland, and the 3–1 in the third-place match against reigning champions Uruguay.Record at FIFA Tournaments – FIFA ==Coaching career== After retiring from playing, Ocwirk became a manager. Sampdoria was the first team he coached from 1962 to 1965. He also managed 1. FC Köln one year whre he reached final of the DFB Cup. Before the time in Germany he managed his former club FK Austria Wien. After his year in Germany he trained VfB Admira Wacker Mödling. ==Death== He died in January 1980 of multiple sclerosis in Klein-Pöchlarn, Lower Austria. ==Honours== Austria Wien * Austrian Football Bundesliga: 1949, 1950, 1953, 1962, 1963 * Austrian Cup: 1948, 1949, 1962 Austria * FIFA World Cup third place: 1954 Individual * FIFA World Cup All-Star Team: 1954 ==References== ==Other websites== * FIFA * Profile – FK Austria * Player profile – Austria Archive * UEFA * Category:1926 births Category:1980 deaths Category:Association football midfielders Category:Austrian footballers Category:Players of the Austrian national football team Category:1954 FIFA World Cup players Category:Austrian football managers Category:FK Austria Wien managers Category:1. FC Köln managers Category:FC Admira Wacker Mödling managers Category:Deaths from multiple sclerosis Category:FK Austria Wien players Category:Austrian football champions Category:Austrian football midfielders",
 "title": "Ernst Ocwirk"
}