{
 "id": "981530",
 "text": "D-12-ZB-TV, channel 12 (analog) & channel 32 (digital) (also known as GMA TV-12 Batangas or GMA Southern Tagalog), is a commercial television station. It is owned by GMA Network Inc. ==Locations== Its studio complex is located at PNG Bldg., P. Burgos St. cor. Rizal Ave., Batangas City, Batangas Province; its transmitter is located at Mt. Banoy, Bo. Talumpok East, Batangas City, Batangas Province. ==GMA TV-12 Batangas programs== *Balitang Southern Tagalog ==Digital television== D-12-ZB-TV's digital signal operates on UHF channel 32 (581.143 MHz) and broadcasts on the following subchannels: Channel Video Aspect Short name Programming Note 12.01 480i 4:3 GMA GMA Southern Tagalog Commercial broadcast (10 kW) 12.02 GTV GTV 12.03 HEART OF ASIA Heart of Asia 12.06 HALLYPOP Hallypop 12.07 I HEART MOVIES I Heart Movies 12.08 (UNNAMED) Test feed Black screen 12.11 12.21 240p GMA 1Seg GMA Batangas 1seg broadcast ==Rebroadcasters== D-12-ZB-TV's programming is relayed to the following stations across the Southern Tagalog. Station Location Channels ERP DWJJ-TV Jalajala, Rizal 44 (VHF) 3 kW (85 kW ERP) D-13-ZR-TV Occidental Mindoro 13 (VHF) 2 kW DWTR-TV Tablas Island, Santa Maria, Romblon 7 (UHF) 10 kW == Personalities == === Current === *Ivy Saunar-Gasang as Anchor and Desk Editor of Balitang Southern Tagalog and National Anchor of GMA Regional TV News *Ace Medrano as Co-Anchor and Senior Desk Manager of Balitang Southern Tagalog *Andrew Bernardo - correspondent and news producer *Paul Hernandez - correspondent and news producer *Denisse Abante - correspondent and news producer *Marjorie Padua – Senior Program Manager-in-Charge of Production of Balitang Southern Tagalog *Mark Lavarro - Senior Desk Editor and Manager and Part-time Correspondent of Balitang Southern Tagalog === Former === * Ilonah Riego-Manalo * Lorenzo Ilagan *Russel Simorio ==Area of coverage == * Batangas * Laguna * Cavite * Rizal * Portion of Quezon * Portion of Oriental Mindoro * Portion of Marinduque *Portion of Romblon ==Related pages== *List of GMA Network stations ==References== Category:Filipino television stations Category:Television channels in Asia",
 "title": "D-12-ZB-TV"
}