{
 "id": "981782",
 "text": "Johan de Jong (26 March 1941 – 7 December 2022) was a Dutch biologist, barn owl expert and writer. De Jong dedicated his life to the barn owl. Without his efforts, the barn owl would almost certainly be extinct in the Netherlands. De Jong had a nature section at the Omrop Fryslân radio for over 36 years. He received several awards including the and was inducted into the international \"World Owl Hall of Fame\". ==Biography== De Jong was born on a farm in near Drachten. He was the eldest of three children. His father had multiple sclerose, so at young age he helped on the farm. He became a biology teacher at the Drachtster Lyceum. He was a popular teacher and often took the students outside. Next of being a teacher, he did research on barn owls. During the night he observed born owl nests. Later he used a camera with a special lens that he borrowed of Prince Bernhard of Lippe-Biesterfeld. During the 1970s the barn owl was threatened with extinction. There were only about a hundred breeding pairs the Netherlands, and eight in the province of Friesland. De Jong started a rescue plan and founded in 1973 the \"Tsjerkûlen Fryslân\" working group. Nest boxes were placed in hundreds of barns. The number of volunteers increased and also the number of barn owl increased. In 1985 De Jong became for many years national coordinator. Without the efforts of Johan de Jong, the barn owl would almost certainly be extinct in the Netherlands. De Jong kept a few barn owls. First in the attic of the Drachtster Lyceum and later at home. The owls had laid eggs in captivity and that had never happened anywhere before. He first talked about it on the radio in 1984. It was the start of a weekly nature section. In addition to radio work and his work for the barn owls, he was also actively involved in the bird shelter \"De Fûgelhelling\" in Ureterp. His last nature section was in 2021. On his retirement Omrop Fryslân founded a prize the \"Johan de Jong tree\". The prize is an annual prize for the best nature initiative in Friesland. The winner places the three on a location he can chose. De Jong wrote four books. His last book was published in the summer of 2017, a reference work about the barn owl. De Jong received several award. He became knight in the Order of Orange- Nassau, he received the \"Gouden Lepelaar\" (translated: Golden Spoonbill) and the 1999 . In 2008, he was inducted into the \"World Owl Hall of Fame\", an international award for his commitment to the barn owl. After having problems with his health for several years, he was admitted to hospital in December 2022. De Jong died two days later on 7 December 2022, at the age of 81. ==References== Category:Dutch biologists Category:Dutch writers Category:Dutch educators Category:1941 births Category:2022 deaths Category:Place of death missing",
 "title": "Johan de Jong"
}