{
 "id": "981893",
 "text": "Franciscus Mattheus Christiaan \"Frans\" de Haan (18 September 1938 – 2 December 2022) was a Dutch basketball player and golfer. As a basketball player he played with The Wolves Amsterdam and the Netherlands men's national basketball team. At a lower level he also played football, field hockey and cricket. ==Biography== ===Personal life=== De Haan was born in 1938 in Amsterdam. His father was AFC Ajax footballer (1897-1974). He moved to Rotterdam when he was 21 years old. He studied business sociology in Rotterdam. Later he was a research assistant at the Interfaculty of Business Administration. In 1972 he became director of Manritta bv, a firm that financially supports and guides young companies. At the time he lived in Noord-Wijkerhout, was married and had three children. ===Sports career=== He played basketball with The Wolves Amsterdam most of his career. He played one year with The Arrows, and didn't play basketball for one year due to because of his social career. Later he played with Punch Delft where he ended his career. He played in total 16 years in the Dutch Basketball League. With basketball club The Wolves Amsterdam he played in the Dutch Basketball League and became three times national champion. In 1960 and 1961 with coach Henk van de Broek and in 1964 with Ruud Welter. De Haan played with the Netherlands men's national basketball team between 1958 and 1970. He represented the Netherlands at the EuroBasket 1961 in Belgrado, EuroBasket 1963 in Wrocław and EuroBasket 1967 in Helsinki. In 1970, during a match against Flamingo's Haarlem, De Haan had a fight with Wim Franke. During his career, De Haan liked unusual things and psychological warfare and is because of that described as a maverick. As a golfer De Haan became national champion in 1972 and 1973. In 1982, he won together with R.J.J. Tans Tans the Army Tankard. In 1981, De Haan co-founded an association of former golf internationals named Orange All Stars. He was chairman for many years (at least until 2008). De Haan died in Wassenaar on 2 December 2022, at the age of 84. ==References== ==Other websites== * Category:Dutch basketball players Category:Golfers Category:1938 births Category:2022 deaths Category:Sportspeople from Amsterdam",
 "title": "Frans de Haan"
}