{
 "id": "981863",
 "text": "Karl Stotz (27 March 1927 – 4 April 2017) was an Austrian football player and manager. He played as defender mainly for FK Austria Wien and the Austrian national football team. Stotz played in the 1954 and 1958 FIFA World cup. ==Club career== Stotz was soldier in the Second world war. After his return to Austria he played three years for FC Wien before joining Austria Wien in 1951. With Austria Wien he became champion in 1953, 1961, 1962 and 1963 and won the Austrian Cup in 1960, 1962 and 1963. He played 299 matches and scored 22 goals for Austria Wien. In 2001, he was chosen in Austria's Team of the Century. ==International career== He made his debut for Austria in March 1950 friendly match against Switzerland . He played at the 1954 FIFA World Cup and 1958 FIFA World Cup.Record at FIFA Tournaments - FIFA He played 42 matches and scored one goal.Appearances for Austrian National Team - RSSSF His final international was a September 1962 friendly match against Czechoslovakia. ==Managing career== After his active time, Karl Stotz worked for the Viennese office machine company \"Tonko\" .1970 he returned to Austria Wien. 1976/77 he was head coach of the first team team and won the championship and one season later the ÖFB Cup. 1978 he became manager of the Austria national team . He led to the 1982 FIFA World Cup but was sacked just before the tournament. Stotz died on 4 April 2017 in Seefeld in Tirol, Austria, aged 90. ==Honours== *Austrian Football Bundesliga (4): ** 1953, 1961, 1962, 1963 *Austrian Cup (2): ** 1960,1962 ==References== ==Other websites == *Player profile - Austria Wien archive * * Category:1927 births Category:2017 deaths Category:Austrian footballers Category:Players of the Austrian national football team Category:1954 FIFA World Cup players Category:1958 FIFA World Cup players Category:Austrian football managers Category:FK Austria Wien managers Category:Austria national football team managers Category:German military personnel of World War II Category:Association football defenders Category:FK Austria Wien players Category:Austrian football defenders Category:Austria at the 1954 FIFA World Cup Category:Austria at the 1958 FIFA World Cup Category:Austrian football champions",
 "title": "Karl Stotz"
}