{
 "id": "981982",
 "text": "Camel wrestling () is a sport that is common in the Aegean Sea region of Turkey. In the sport, two male Tülü camels wrestle each other. This is normally caused by a female camel in heat being put where they can see her. The sport is also held in other parts of the Middle East and South Asia. A Tülü is a hybrid of Bactrian camel and dromedary.https://www.researchgate.net/figure/A-Turkish-F1-hybrid-tuelue- showing-the-typically-elongated-hump-named-almond-hump-in_fig4_340244750 Camel wrestling in Turkey is hold by the Yörüks. ==History== Camel fighting was started by ancient Turkic tribes over 1000 years ago. Camels also wrestle in the wild. This has been happening since before nomads began doing it. In the 1920s, the Turkish National Aviation league had held camel fights to get money to buy airplanes for the Turkish government. The government tried to stop them from doing this in the 1920s. They said that it as too backwards of a practice. In the 1980s, the new government of Turkey began supporting it as part of the historic culture of Turkey. ==Event details== Because of the need of a nearby female camel, the events are normally held during mating season. The camels use their necks to try to make the other camel fall down. A camel wins if the other camel falls to the ground or runs from the fight. Most fighting camels are bred in either Iran or Afghanistan. A good fighting camel can be sold for over $20,000. The events can be dangerous to the people watching them if the camels try to run away through the crowd. There are about thirty festivals in Aegean Turkey each year. They take place from November to March. Events always take place on Sundays in football stadiums. At the end of the season, a tournament is held in which the best camels compete. Many tourists go to the events. They are a large part of tourist industry in Western Anatolia. Several animal rights organizations say that camel wresting is cruelty to animals. == References == == Other websites == *Camel wrestling photos at Shutterstock Category:Turkish culture",
 "title": "Camel wrestling"
}