{
 "id": "982470",
 "text": "Italian literature is written in the Italian language, especially in Italy. It may also refer to literature written by Italians or in other languages spoken in Italy, often languages that are very similar to modern Italian, including regional varieties and dialects. Italian literature begins in the 12th century, when in different areas of the peninsula the Italian vernacular started to be used to write books. The Ritmo laurenziano is the first text of Italian literature. ==History== One of the first examples of Italian literature is the tradition of lyric poetry sung in Occitan. This tradition arrived in Italy by the end of the 12th century. In 1230, the Sicilian School became famous for being the first style in standard Italian. Dante Alighieri, one of the greatest of Italian poets, is important and famous for being the author of La Divina Commedia (The Divine Comedy, c. 1308–1320). Renaissance humanism developed during the 14th and the beginning of the 15th centuries. Early Italian humanists, such as the lyric poet Francesco Petrarca and the Neoplatonist philosopher Marsilio Ficino, were highly educated Classical scholars and great collectors of old manuscripts. The development of the drama in the 15th century was very great. In the 16th century, the main feature of the time following the end of the Renaissance is that it perfected the Italian character of its language. Niccolò Machiavelli and Francesco Guicciardini were the chief originators of the science of history. Pietro Bembo was an famous and important figure in the development of the Italian language and an influence on the 16th-century renewed interest in the works of Petrarca. In 1690, the Academy of Arcadia was created with the goal of \"restoring\" literature by copying the simplicity of the old shepherds. In the 18th century, the political condition of the Italian states began to improve, and philosophers spread their writings and ideas throughout Europe during the Age of Enlightenment. Apostolo Zeno and Metastasio are two of the important figures of the age. Carlo Goldoni, a Venetian playwright and librettist, created the comedy of character. The leading figure of the 18th-century Italian literary revival was Giuseppe Parini. The ideas behind the French Revolution of 1789 gave a special direction to Italian literature in the second half of the 18th century. It began with the publication of the book Dei delitti e delle pene (On Crimes and Punishments, 1764) by Cesare Beccaria. Patriotism and classicism were the two ways of thinking that motivated the literature that began with the Italian playwright and poet Vittorio Alfieri. Others include the poets Vincenzo Monti and Ugo Foscolo. The Romantic movement had as its organ the Conciliatore, established in 1818 at Milan. The main initiator of the reform was the Italian poet and author Alessandro Manzoni, known for his historical novel I promessi sposi (The Betrothed, 1827–1842). The great Italian poet of the age was Giacomo Leopardi. The bookish movement that happened before and at the same time as the political revolutions of 1848 was represented by four writers: Giuseppe Giusti, Francesco Domenico Guerrazzi, Vincenzo Gioberti, and Cesare Balbo. After the Risorgimento, political literature became less important. During the first part of this period, two different tendencies of literature against Romanticism appeared: the Scapigliatura and Verismo. The most well-known figure of Verismo was the Sicilian writer Giovanni Verga, author of I Malavoglia (The House by the Medlar-Tree, 1881). Important early 20th-century Italian writers include Giovanni Pascoli, Italo Svevo, Gabriele D'Annunzio, Umberto Saba, Giuseppe Ungaretti, Eugenio Montale, and Luigi Pirandello (winner of the 1934 Nobel Prize in Literature). Neorealism was developed by Alberto Moravia. Umberto Eco became successful with the detective story Il nome della rosa (The Name of the Rose, 1980). ==Novel Prize winners== Six Italian authors have received the Nobel Prize in Literature. These are Giosuè Carducci, Grazia Deledda, Luigi Pirandello, Salvatore Quasimodo, Eugenio Montale, and Dario Fo. == Some of the most important books and works of the Italian literature == * by Dante Alighieri * by Alessandro Manzoni * by Giovanni Boccaccio * by Ludovico Ariosto * by Luigi Pirandello * by Ugo Foscolo * by Primo Levi * by Italo Calvino * by Giacomo Leopardi * by Niccolò Machiavelli * by Torquato Tasso * by Edmondo De Amicis * by Dino Buzzati * by Italo Svevo * by Carlo Collodi * by Gabriele D'Annunzio * by Giovanni Pascoli * by Luigi Pirandello * by Umberto Eco * by Cesare Pavese * by Giuseppe Tomasi di Lampedusa * by Federico De Roberto * by Giovanni Verga * by Giovanni Verga == Writings on the subject == * De Sanctis, F., Storia della letteratura italiana. Napoli, Morano, 1870 * Momigliano, A., Storia della letteratura italiana. Messina-Milano, Principato, 1936 * Sapegno, N., Compendio di storia della letteratura italiana. La Nuova Italia, 1936–47 * Croce, B., La letteratura italiana per saggi storicamente disposti. Laterza, 1956–60 * Russo, L., Compendio storico della letteratura italiana. Messina-Firenze, D'Anna, 1961 * Petronio, G., Compendio di storia della letteratura italiana. Palermo, Palumbo, 1968 * Asor Rosa, A., Sintesi di storia della letteratura italiana. Firenze, La Nuova Italia, 1986 * De Rienzo, Giorgio, Breve storia della letteratura italiana. Milano, Tascabili Bompiani, 2006 [1997], * Ferroni, G, Storia della letteratura italiana, Milano, Mondadori, 2006 Category:Italian literature",
 "title": "Italian literature"
}