{
 "id": "982422",
 "text": "Magnus Douglas \"Mark\" Nicholson (6 March 1871 - 3 July 1941 in Oswestry, Shropshire, England) was an English football player and coach of the late 19th century and one of the most important pioneers of football in Austria at the beginning of the 20th century. He played as defender. == Career == Mark Nicholson began his career in April 1889 at the age of 18 as a player for Oswestry Town. In May 1891 he signed a professional contract with West Bromwich Albion. He played his first league game against Everton in September 1891 . He made 67 appearances for the club. The highpoint as player was the win of the FA Cup on 19 March 1892 with a 3-0 win over Aston Villa. He left to take a job as deputy headmaster at a school in Bedford and continued his career at nearby Luton Town. 1897 he came to Vienna and played for First Vienna FC. Not only was he by far the best footballer in Vienna at the time and, as an absolute star, his club's box office magnet. He soon took over agendas as an organizer and functionary at the club. In the following years that followed, he not only reformed the training and game design of Vienna, he also campaigned for the organization of the entire football game in Austria. In 1898, Nicholson organized the Comité zur Veranstaltung von Fußball- Wettspielen ( Soccer Competitions Committee). One of the first activities of this committee was organizing two matches of the Oxford University football team in 1899. On 4 January 1900, this committee formed the Austrian Football Union. Nicholson was the first president. The Union dissolved in 1904 due to its powerlessness compared to the clubs, especially First Vienna and the Vienna Cricketers. These clubs founded the Österreichischen Fußballverband (Austrian Football Association) thepredecessor of today's ÖFB. In the last game for Vienna, a friendly against FC Zurich, Nicholson even kept the goal. When Nicholson left Vienna he retired as an Austrian football pioneer and the first honorary captain of the Vienna for life. Nicholson was no longer active as a football player after his time in Vienna, but he did as a referee in Hamburg and later as a cricketer in Paris. In 1914 a Viennese football club was founded in the club colors blue and yellow with the name SC Nicholson which became FC Wien in 1933. == Honours == West Bromwich Albion * FA Cup: 1891–92 Vienna (player-coach) * Challenge Cup: 1898–99, 1899–1900 ==References== Category:1871 births Category:1941 deaths Category:English footballers Category:English football managers Category:People from Shropshire Category:Association football defenders Category:First Vienna FC managers Category:Luton Town F.C. players Category:West Bromwich Albion F.C. players",
 "title": "Mark Nicholson"
}