{
 "id": "982582",
 "text": "Kentrell DeSean Gaulden (born October 20, 1999), known professionally as YoungBoy Never Broke Again or simply NBA YoungBoy, is an American rapper, singer and songwriter. He is from Baton Rouge, Louisiana. NBA Youngboy has a couple signed artists 0. Li Wavo 1.Lil Dump . 2.whogangdee 3.Quando Rondo 4.Herm the black sheep 5.Meechy Baby ==Career== After releasing six independent mixtapes between 2015 and 2017, Gaulden was signed to Atlantic Records. His January 2018 single \"Outside Today\" went to number 31 on the Billboard Hot 100 chart. His first studio album Until Death Call My Name (2018) went to number 7 on the US Billboard 200. In October 2019, Gaulden released the single \"Bandit\" with Juice Wrld. It became his first top-ten single. His 2019 mixtape AI YoungBoy 2 entered the Billboard 200 at number one. His April 2020 mixtape 38 Baby 2 became his second chart-topping project to top the Billboard 200. Gaulden's second studio album Top (2020) followed as his third chart-topping project in less than a year. In September 2021, Sincerely, Kentrell was released during his incarceration. It topped the charts again. It made him the third artist to have an album at the top of the charts while incarcerated (after rappers 2Pac and Lil Wayne). In August 2022, he released his fourth studio album, The Last Slimeto. It marked Gaulden's final studio album with Atlantic Records. == Awards and nominations == Award Year Recipient(s) and nominee(s) Category Result ASCAP Rhythm & Soul Music Awards 2021 \"Bandit\" (with Juice WRLD) (only on behalf of Gaulden himself) Winning Rap Songs BET Hip Hop Awards 2019 \"I Am Who They Say I Am\" (with Kevin Gates and Quando Rondo) Best Impact Track BMI R&B;/Hip-Hop Awards 2021 \"Bandit\" (with Juice WRLD) (only on behalf of Juice WRLD (posthumously) and Nick Mira) Most Performed R&B;/Hip-Hop Songs Grammy Awards 2022 \"WusYaName\" (with Tyler, the Creator and Ty Dolla Sign) Best Melodic Rap Performance BET Hip Hop Awards 2022 Birdman & YoungBoy Never Broke Again Best Duo/Group rowspan=\"2\" DaBaby & YoungBoy Never Broke Again ==References== Category:1999 births Category:Living people Category:21st-century American rappers Category:African-American rappers Category:Atlantic Records artists Category:Gangsta rappers Category:Singers from Baton Rouge, Louisiana Category:Rappers from Louisiana Category:American trap musicians",
 "title": "YoungBoy Never Broke Again"
}