{
 "id": "982567",
 "text": "Minions & More is a computer-animated short-movie compilation series centering on the Minions, characters from the Despicable Me movies, and other characters from Illumination's franchises. It is produced by Illumination and distributed by its parent company Universal Pictures. 21 shorts starting from The Lorax to The Secret Life of Pets 2 in total were released in the compilation series. There are two compilations, \"Minions & More 1\", was released in September 2022 and \"Minions & More 2\", was released in November 2022, both internationally on Netflix. These shorts originally were released on home media on Illumination's movies. == Minions & More 1 (2022) == === Puppy (2013) === First released on the Despicable Me 2 Blu-ray. A Minion watches neighbors walking their dogs on the street, which leads him to search for a puppy of his own. After several failed attempts, he comes across a UFO that takes the role of a puppy for him. === The Dog Days of Winter (2018) === First shown on NBC on November 23, 2018, after How the Grinch Stole Christmas! (1966) and before Trolls Holiday. Re- released in The Grinch DVD and Blu-ray. Max goes on a quest to fetch the Grinch some coffee. === Minion Scouts (2019) === First released in The Secret Life of Pets 2 DVD and Blu-ray. After being dazzled by the girls, a group of Minions become scouts in an attempt to earn badges. === Norman Television (2016) === First released in The Secret Life of Pets DVD and Blu-ray. Norman wanders the vents of Max's apartment and watches various scenarios of the residents. === Training Wheels (2013) === First released in Despicable Me 2 Blu-ray. Agnes is unsatisfied with her toy bike after falling off it while attempting to catch up to an ice cream truck with Margo, Edith, and their friends. Three Minions then volunteer to modify the bike and help Agnes improve her skills. === Love at First Sight (2017) === First released in Sing DVD and Blu-ray. Miss Crawly is set up on an online dating website by Johnny in which she attempts to find love. === The Secret Life of Kyle (2017) === First released in Despicable Me 3 DVD and Blu-ray. After the events of Despicable Me 3, we follow Kyle and his secret life when Gru and his family are gone. === Weenie (2016) === First released in The Secret Life of Pets DVD and Blu-ray. Set in a world of anthropomorphic sausages in which the Mayor shows a little sausage named Timmy how great it is to be a weenie. === Forces of Nature (2012) === First released in The Lorax Blu-ray. The Lorax makes a little Barbaloot an \"Honorary Lorax\" and they team up to try to scare the Once-ler. === Santa's Little Helpers (2019) === First released in The Grinch DVD and Blu-ray. Kevin, Stuart, and Bob having been accidentally dropped off at the North Pole, make the most of the situation by trying to become elves. == Minions & More 2 (2022) == === Mower Minions (2016) === First released theatrically with The Secret Life of Pets (2016). Later released on its home media (DVD & Blu-Ray). A group of Minions tries to earn some money by mowing a lawn at a local old people's home. But their work results turn out to be chaotic. === Super Gidget (2019) === First released in The Secret Life of Pets 2 DVD and Blu-ray. Gidget imagines herself as a superhero and saving Max from an army of squirrels. === Yellow is the New Black (2018) === First released theatrically with The Grinch (2018). Later released on its home media (DVD & Blu-Ray). Before they all make their big escape from prison in Despicable Me 3, two lucky minions tried to escape prison with their human inmates. They went around various locations, including the circus but ended up in prison again. === Eddie's Life Coach (2017) === First released in Sing DVD and Blu- ray. Eddie Noodleman partakes in a digital life-training seminar on behalf of his mother or else he will be kicked out. === Competition (2015) === First released in Minions Blu-ray Two Minions challenge themselves to numerous attacks, ending up on the lab's conveyor belt in the process. === Serenade (2012) === First released in The Lorax Blu-ray. The Big Barbaloot wants to impress a girl Barbaloot, but he has some competition with another one. === Cro Minion (2015) === First released in Minions Blu-ray. Two Minions look after a cave baby while their caveman boss goes to find a bull to eat for lunch. But it is harder than the Minions think. === Wagon Ho! (2012) === First released in The Lorax Blu-ray. Two Barbaloots take the Once-ler's wagon without his permission for a joyride. === Binky Nelson Unpacified (2015) === First released in Minions Blu-ray. The Nelsons' youngest son Binky, having lost his pacifier after a successful robbery at a museum, sets out on a mission to retrieve it. === Panic in the Mailroom (2013) === First released in Despicable Me 2 Blu-ray. Two Minions work sending parcels through the lab. When a package containing expired PX-41 (the serum that El Macho used to transform the Minions and himself in Despicable Me 2), gets jammed in the pneumatic delivery system, it transforms Mike into an evil Minion. === Gunter Babysits (2017) === First released in Sing DVD and Blu-ray. Gunter offers to watch over Rosita and Norman's piglets while they are away but quickly finds himself way in over his head. Category:Despicable Me Minions & more is a short-movie series",
 "title": "Minions & More"
}