{
 "id": "982646",
 "text": "The kithara or cithara ( ) was an ancient Greek musical instrument. It was a kind of lyre with seven strings. The lyre was used for teaching music to beginners, but the cithara was used by expert musicians called kitharodes. The word \"guitar\" comes from the Greek word kithara. ==History== The cithara's origins are from Minoan-Mycenaean lyres shaped like swan-necks. Some scholars have connected the cithara with string instruments from ancient Anatolia.. The lyre was used as a teaching tool in schools, but the cithara was an instrument needing a great amount of skill.: Aristotle calls the cithara an organon technikon. The cithara was played mainly with dances, epic recitations, rhapsodies, odes, and lyric songs. It was also played solo at receptions, banquets, national games, and trials of skill. Aristotle said that these stringed instruments were not for educational purposes but for pleasure only. It was played by strumming the strings with a stiff plectrum made of dried leather, held in the right hand with the elbow outstretched and handpalm bent inwards. Most paintings on vases show citharas with seven strings but sometimes a very skillful kitharode is shown playing a kithara with more than the traditional seven strings. ==Construction== The cithara had a deep, wooden box made of two resonating tables, either flat or slightly arched, connected by ribs or sides of equal width. At the top, its strings were knotted around the crossbar or yoke (zugon) or to rings threaded over the bar, or wound around pegs. The other ends of the strings were secured to a tail-piece after passing over a flat bridge, or the tail-piece and bridge were combined. ==Greek mythology== The cithara is said to have been invented by Apollo, the god of music. Apollo is often depicted playing a cithara instead of a lyre, often dressed in a kitharode’s formal robes. Kitharoidos, or Citharoedus, is an epithet given to Apollo, which means \"lyre-singer\" or \"one who sings to the lyre\". An Apollo Citharoedus or Apollo Citharede, is the word for a kind of statue or other image of Apollo with a cithara. Among the best-known examples is the Apollo Citharoedus, a large 2nd-century CE marble statue made by an unknown Roman sculptor that is now located in the museums of the Vatican. Sappho is closely connected to music including string instruments like the cithara and the barbitos. She was an important woman in Greek society and made popular songs that focused on emotions. A story from Greek myth goes that she went up the slopes of Mount Parnassus where she was welcomed by the Muses. She wandered through the laurel grove and came upon the cave of Apollo. There, she bathed in the Castalian Spring and took Phoebus' (Apollo's) plectrum to play skillful music. The sacred nymphs danced while she stroked the strings with much talent to bring forth sweet melodies from the cithara. ==Famous players== According to the Suda, Phrynis () of Lesbos was the first to play the cithara in Athens and won at the Panathenaea.Suda, phi.761 ==Related pages== *Guitar *Harp *Lyre ==Gallery== File:LYCIAN LEAGUE, Cragus, Hemidrachm, reverse.jpg|Cithara on the reverse of a hemidrachm from Cragus (Lycian League). File:P. Fannius Synistor anagoria links.JPG|A Roman representation of a woman playing the cithara (Villa Boscoreale, ca. 40-30 BCE). File:Fresco of women listening to a private musical performance.jpg|Woman with cithara (right) and sambuca (left). Roman fresco from Pompeii, 1st century CE (National Archaeological Museum, Naples). File:Muse lyre Louvre CA482.jpg|Muse tuning two phorminges. The phorminx was an intermediate stage, as the cithara developed from the lyre. Detail of the interior from an Attic white-ground cup from Eretria, . Image:Britannica Cithara Phorminx.jpg|Greek vase drawing depicting a man playing a cithara with eight strings. Note the plectrum in his lowered right hand. File:Wall painting - Apollon seated with cithara - Rome (Palatine - house of Augustus) - Roma AdP 379982.jpg|Apollo Kitharoidos. Painted plaster, Roman artwork from the Augustan period. Image:Sir Lawrence Alma-Tadema, RA, OM - Sappho and Alcaeus - Walters 37159.jpg|Alcaeus of Mytilene playing a cithara while Sappho listens in Sappho and Alcaeus by Lawrence Alma-Tadema (1881; The Walters Art Museum). ==References== ===Citations=== ===Sources=== * * * * * * ==Further reading== * * * * ==Other websites== *Peter Pringle demonstrates how a kithara worked * Category:Ancient Greek culture Category:Plucked string instruments",
 "title": "Kithara"
}