{
 "id": "982638",
 "text": "Fighting in the Russo-Ukrainian War has been going on in Eastern Ukraine since 2014. The war between Russia and Ukraine became bigger in February 2022, when Russia invaded Ukraine. Warfare is still going on in eastern Ukraine, as of 2024's first quarter. The 2023 Ukrainian counteroffensive started in June. The 2024 Kharkiv offensive, started on May 10. ==Battles and taking control of land == * Battle of Vuhledar is ongoing (as of 2024's second quarter). The city of Vuhledar is in Donetsk oblast. On January 26, 2023, Russian soldiers cut the Pokrovske-Vuhledar highway that runs from Pokrovske (75 km north-west of Vuhledar) to Vuhledar. On January 27, 2023, Ukrainian soldiers (pushed back or) repelled a Russian attack on the western part of Vuhledar. * Battle of the Svatove-Kreminna front line; The battle is ongoing (as of 2023's third quarter); part of the Battle of Donbas. Svatove and Kreminna are in Lukhansk oblast. * Battle of Donbas; That series of battles in Donbas - is going on (as of 2023's third quarter). *Battle of Bilohorivka, ongoing [as of 2024's second quarter]; By September 19, 2022, Ukrainian soldiers took back control of that urban-type settlement; Bilohorivka is in Luhansk Oblast. The fighting after September 20, 2022 is sometimes calledThe Second Battle of Bilohorivka. * Battle of Avdiivka, [ended in 2024's first quarter];https://www.nettavisen.no/norsk-debatt/putin-kan-ikke-gjore-noe-med- det/o/5-95-1486508. Retrieved 2023-11-29 Avdiivka is in Donetsk Oblast. ===Ended in 2023=== * Battle of Marinka, ended in December. The city is in Donetsk Oblast. * Battle of Bakhmut,wounded volunteer from Norway, runs for his life VG.no. Retrieved 2023-02-04 ended in 2023; The city is in Donetsk oblast; part of the Battle of Donbas * Battle of Soledar, ended by January 16, 2023;https://www.nrk.no/nyheter/ukrainsk-forsvarskilde_-russland-kontrollerer- soledar-1.16258108. NRK.no. Retrieved 2023-01-16 Soledar is in Donetsk Oblast; part of Battle of Donbas ===Ended in 2022=== * Battle of Pavlivka, ended November 14, 2022; Russian victory; part of Battle of Donbas. Fought in Pavlivka, Donetsk Oblast. * October 2, 2022: end of second part of 2022 Ukrainian eastern counteroffensive; part of the event is sometimes called the 2022 Kharkiv counteroffensive. ** Second Battle of Lyman, ended. Fought in Lyman, Donetsk Oblast. * Battles of Bohorodychne and Krasnopillia, ended September 20; Ukrainian victory; part of Battle of Donbas * Battle of Kupiansk, ended September 16; part of Ukrainian eastern counteroffensive * Svatove; On 14 September it was reported that Russian soldiers had taken control. (Related pages: Battle of the Svatove-Kreminna line, Battle of Svatove.) The city is in, Luhansk oblast. * September 12, 2022: end of first part of Ukrainian eastern counteroffensive * Izium, the city came back under the control of Ukrainian soldiers on September 10. (5 months earlier, Russian soldiers won the Battle of Izium.) * Battle of Siversk, ended September 9; part of Battle of Donbas * Battle of Balakliia, ended September 8; part of Ukrainian eastern counteroffensive * Battle of Shevchenkove, ended September 8; Ukrainian eastern counteroffensive * Battle of Pisky, ended August 24; Russian military and DPR forces got the win; part of Battle of Donbas * Battle of Lysychansk, ended July 3; part of Battle of Donbas * Battle of Sievierodonetsk, ended June 25; part of Battle of Donbas * Battle of Toshkivka, ended June 21; part of Battle of Donbas * Battle of Dovhenke, ended June 11; part of Battle of Donbas * Battle of Sviatohirsk, ended June 8; part of Battle of Donbas * First Battle of Lyman, ended May 27 * Battle of the Siverskyi Donets, ended May 13; part of Battle of Donbas * Battle of Rubizhne, ended May 12,2022; Russian win; part of Battle of Donbas * Battle of Popasna, ended May 7; part of Battle of Donbas; Popasna is a ruined city in Lukhansk oblast. * Battle of Kreminna (April 2022) ended April 19, 2022; The battle is often looked at, as the first battle of the Battle of Donbas; First Battle of Kreminna, is another name. * Battle of Izium, ended April 1 * Battle of Volnovakha, ended March 12, 2022; Volnovakha is in Donetsk oblast; Russian soldiers did win * Battle of Starobilsk, ended March 2, 2022 ==Other fighting== Ukrainian soldiers attacked (during the counteroffensive) *Novodonetske, Staromlynivka (\"municipality\") *eastwards, toward Kermenchyk (map), Staromlynivka (\"municipality\"), Volnovakha, Donetsk *and captured a fortification at Zverinets on the Avdiivka-Donetsk City line (related page: Donetsk (city)), near Marinka (map) *in the direction of Novodanylivka-Shyroka Balka (map) *Berkhivka (map), Bahkmut (\"municipality\"), Bakhmut, Donetsk *the Mala Tomachka-Ocheretuvate (map) line *\"the lines in the Pryvillia- Zaliznianske direction North of Bakhmut *the Kupyansk-Svatove-Kreminna line (related page: Battle of the Svatove–Kreminna line) and \"around Kreminna\" *Krasnohorivka (map), Marinka (\"municipality\"), Pokrovsk, Donetsk *Staromlinivka (map), Staromlynivka (\"municipality\"), Volnovakha, Donetsk; Ukrainian soldiers have arrived at the village, media said. *west of Novopokrovka (map), Mala Tokmachka (\"municipality\") (map without English), Polohy, Zaporizhia ==Related pages== *Military campaign ==References== Category:2022 Russian invasion of Ukraine",
 "title": "Warfare in eastern Ukraine during the Russo-Ukrainian War"
}