{
 "id": "982701",
 "text": "The Miracles of Our Lady (Spanish: Milagros de Nuestra Señora) is the main book written by Gonzalo de Berceo.Gonzalo de Berceo by John Esten Keller Twayne Publishers (1972) pages 44 and 63 It is a collection of exempla about twenty-five reported miracles of Mary, mother of Jesus. It was written around 1260 in a sort of Spanish dialect called Riojan. ==Context and influence== The sources used by Gonzalo de Berceo were different stories about the miracles written in Latin. The book helped to promote Marian devotions among the people by making the subject easier to understand for them. However, it contains many unusual elements that give Mary powers of returning people from the dead or the ability to save sinners from God's Judgement.Saugnieux, Joël. Berceo Y Las Culturas Del Siglo XIII. Logroño: Servicio de Cultura de la Excma. Diputación Provincial, 1982. == Structure == The work's introduction is symbolic. It is set in an perfect natural scene, which shows the good qualities of the Virgin. It is followed by twenty-five miracles done by the Virgin. At the end of each story there is a moraleja (moral) or teaching to make the advantages of devotion to Mary clear to the listener or reader. These miracles can be categorised into three different types: * Miracles in which Mary rewards or punishes men, e.g. La casulla de San Idelfonso. * Miracles in which the Mary forgives and promises the salvation of her devotees, e.g. El sacristán impúdico, El Judezno, Milagro de Teófilo. * Miracles in which the characters suffer a spiritual crisis which Mary helps them to solve, e.g. La abadesa encinta. == References == == Sources == * Miracles of Our Lady by Gonzalo de Berceo, edited by Richard Terry Mount 1998 == Other websites == * Milagros de Nuestra Señora and Lais by Mary de France. Similarities and differences. Written by Pamela Bastante. Biblioteca Gonzalo de Berceo. Category:13th- century books Category:Spanish literature",
 "title": "The Miracles of Our Lady"
}