{
 "id": "98280",
 "text": "The Manchu peopleManchu: Manju; , Mongolian: Манж are a Tungusic people who came from Manchuria (today's Northeastern China). In ancient times they were called \"Juchen\". During their rise in the seventeenth century they conquered the Ming Dynasty and founded the Qing Dynasty, which ruled China until the Xinhai Revolution in 1911, which established a republican government in its place. The Qing Dynasty required by law that all males must wear a hairstyle called the Manchu queue, in which men had to shave the front of their heads and wear a long braid on the back of their heads. the Jurchens (Manchus) were former Ming subjects but were rejecting their previous status and revolting when Nurhaci declared the Later Jin dynasty in 1616 and his Seven Grievances in 1618 calling for revenge against the Ming killing his father and grandfather. Local Han civilian militias were used by the Qing government during the White Lotus rebellion instead of using extra Manchu bannermen.https://web.archive.org/web/20190802222345/http://www2.ihp.sinica.edu.tw/file/1405qWXADQr.pdf https://ur.booksc.me/book/26745377/9d8cd5 Manchu bannermen and Mongol Bannermen in the banner garrison of Zhenjiang, including the Manchu banner commander Hailong, committed suicide after slaughtering their own wives and children after the British defeated them in the Battle of Chinkiang in 1842. The Manchu bannermen of the banner garrison in Zhapu killed their own wives and children before committing suicide after the British defeated them in the Battle of Chapu in 1842 while the non-banner Han Chinese soldiers did not commit suicide and stayed alive. Han Green Standard Army soldiers abandoned the Manchu bannermen to die.https://books.google.com/books?id=tq1viJQK1AsC&dq;=%22not+their+fight%22+manchu+british&pg;=PT189 https://rationalityofaith.wordpress.com/2016/05/18/notes-and-comments-on- julia-lovells-the-opium-war/ https://lukeford.net/blog/?p=70956 https://chinglican.synology.me/2016/05/18/notes-and-comments-on-julia-lovells- the-opium-war/ https://chinglican.synology.me/?p=9311 British witnesses said that the Manchu population of the Zhenjiang garrison was effectively extinct as the corpses of Manchu men, women and children littered the garrison. \"Dead bodies of Tartars in every house we entered, principally women and children thrown into wells or otherwise murdered by their own people. A great number of those who escaped our fire committed suicide after destroying their families; the loss of life has been appalling, and it may be said that the Manchu race in this city is extinct.\" In Zhenjiang, As the Manchu garrison had been in the habit of calling the Chinese .6 disloyalists , ” the Fu Kien braves sided with the enemy and set fire to the town . The foreigners then got over the wall and burnt the Manchu quarter, the Assistant Tartar-General and the Acting Sub- Prefect losing their lives, and the taotai escaping to Kashing, which place, as also Hangchow, was now threatened too.As the Manchu garrison had been in the habit of calling the Chinese*\" disloyalists,\" the Fu Kien braves sided with the enemy and set fire to the town.... British: 'As the Manchu garrison had been in the habit of calling the Chinese disloyal, the Fujian braves sided with the enemy and set fire to the town. Han Chinese civilians gathered to watch the British kill the Manchus in the battle of Zhenjiang, even brining bowls of rice while spectating : \"... and their fellow - countrymen , and in danger themselves , from their position , of being shot , were coolly employed eating their bowls of rice .\"... foreigners and their fellow-countrymen, and in danger themselves, from their position, of being shot, were coolly employed eating their bowls of rice.The Closing Events of the Campaign in China: The Operations ...The Closing Events of the Campaign in China: The Operations ...Far from escaping the theatre of war, its inhabitants were standing, spectating, in the streets, 'coolly employed eating their bowls of rice ... although ... The British observed the Manchus killing their own children and wives and committing suicide as they lost : “As we marched along the walls, I saw, what as a novice in this description of warfare shocked me much, old men, women and children, cutting each other's throats, and drowning themselves by the dozen; and no one either attempting or apparently showing any inclination to save the poor wretches, nor in fact regarding them with more notice than they would a dead horse carried through the streets of London to the kennel.\" “ After we had forced our way over piles of furniture, placed to barricade the door, we entered an open court strewed with rich stuffs and covered with clotted blood; and upon the steps leading to the hall of ancestors,' there were two bodies of youthful Tartars cold and stiff, much alike, apparently brothers. Having gained the threshold of their abode, they had died where they had fallen, from the loss of blood. Stepping over these bodies, we entered the hall, and met, face to face, three women seated, a mother and two daughters; and at their feet lay to bodies of elderly men, with their throats cut from ear to ear, their senseless heads resting upon the feet of their relations. To the right were two yonng girls, beautiful and delicate, crouching over, and endeavoring to conceal a living soldier.\" Southern Han Chinese coolies helped the British and French destroy Qing Manchu Eight Banner armies at the Battle of Taku Forts (1860). 25,000 Manchus were slaughtered by Taiping forces in Nanjing. At the Temple of Heaven all seven daughters of the Manchu official Yulu were gang raped on August 11 by Eight Nation Alliance soldiers after Yulu committed suicide. Women's chastity was guarded by keeping them in the inner quarters of the house in Han culture and Manchus adopted this practice from Han after the Qing was founded. The Manchu are still a separate ethnicity from the Han Chinese and are categorized as a separate ethnic minority by the government of China but the majority of Manchus no longer speak their own language much as the majority of the Irish people remain separate from English but speak English as their first language. == Other websites == * http://www.china.org.cn/english/features/EthnicGroups/136932.htm * Qiren.cn (Simplified Chinese) == References == Category:Ethnic groups in China",
 "title": "Manchu people"
}