{
 "id": "982972",
 "text": "Cirkus is a 2022 Indian Hindi-language period comedy drama film. It is directed and produced by Rohit Shetty. The movie is also jointly produced by Rohit Shetty Productionz and T-Series. Cirkus is a remake of the 1982 Hindi film Angoor which itself was based on William Shakespeare's play The Comedy of Errors. Principal photography for the film began in November 2020 at Mumbai and also took place in Ooty. The film was theatrically released on 23 December 2022. Panned by critics, the film underperformed at the box office and went on to become one of the biggest commercial failures of 2022. ==Plot== In 1944, Dr. Roy Jamnadas (Murali Sharma), who is working on the theory of nature vs nurture, separates two sets of identical twins he finds at the doorstep of the orphanage he runs and gives them up for adoption to two different families, based in two different cities. One pair is given to a couple in Ooty and the other pair to a couple in Bangalore, and both the couples name them Roy and Joy. Roy 1 (Ranveer Singh) and Joy 1 (Varun Sharma)'s father runs a circus and after his death, they both take up the responsibility of running the circus. Roy 2 and Joy 2's father is a wealthy industrialist. Roy 1 has a strange connection with electricity and electric currents do not affect him. He uses this ability to show tricks at the circus and becomes famously known as 'Electric Man'. Elsewhere, Roy 2 receives electric shocks whenever Roy 1 comes into contact with electricity. The story then moves forward 30 years. Roy 1's wife, Mala (Pooja Hegde), cannot conceive and wishes to adopt a child from the Jamnadas Orphanage, but Roy 1 is against the idea. Roy 2 is in love with Bindu but her father Rai Bahadur is skeptical about him as he had seen Roy 1 with Mala in Ooty and had mistaken him for Roy 2, thinking that he is cheating on Bindu. Roy 2 and Joy 2 come to Ooty to buy a tea estate and there is a lot of confusion and misunderstanding as people mistake them for the other pair of twins. Three robbers - Momo, Mango, and Chikki are after them to rob their money. They back off when Roy 2 gives them electric shocks and their boss, Polson Dada later comes to take revenge. They also come across Nagmani, the shady cab driver, and Bagheera, the dacoit turned hotel owner. Roy 2 thinks they are all part of a huge criminal gang that wants to rob them, and when they come across Mala, they think that she is the gang's leader. Roy 1 decides to gift a diamond necklace to Mala but the jeweler mistakenly gives it to Roy 2, creating further confusion. Moreover, Bindu's father is now convinced that Roy 2 is married to Mala. On hearing this, Bindu threatens to end her relationship with him, not knowing that Mala is actually Roy 1's wife. All the confusion is cleared when both the pairs of twins come face to face at the circus and Dr. Jamnadas reveals the truth to them and his real intention behind separating them. They all reconcile and Roy 1 and Mala finally adopt a child from the orphanage and Roy 2 and Bindu plan to get married soon. Later, five orphan boys - Gopal, Laxman 1, Madhav, Laxman 2, and Lucky come to stay at the orphanage, hinting at the events before Golmaal Again. ==Cast== * Ranveer Singh as Roy aka Electric Man / Roy 2 (dual role) * Varun Sharma as Joy / Joy 2 (dual role) * Pooja Hegde as Mala, Roy's wife * Jacqueline Fernandez as Bindu, Roy 2's girlfriend * Johnny Lever as Polson Dada * Sanjay Mishra as Rai Bahadur, Bindu's father * Siddhartha Jadhav as Momo * Mukesh Tiwari as Daaku Bagheera * Radhika Bangia as Lily * Vrajesh Hirjee as Naag mani, a taxi driver * Ashwini Kalsekar as Shakuntala Devi, Roy's mother * Murali Sharma as Dr. Roy Jamnadas * Tiku Talsania as Veljibhai, a jeweller * Nikitin Dheer as Roy & Joy's father * Vijay Patkar as Shankar * Brijendra Kala as Yusuf * Anil Charanjeett as Prem * Uday Tikekar as Joy Jamnadas, Joy 2's father * Sulabha Arya as Chachi * Umakant Patil as Chikki * Ashish Warang as Mango * Deepika Padukone as Meenakshi (special appearance in song \"Current Laga Re\") ==References== Category:2022 comedy movies Category:2020s Indian movies Category:Hindi-language movies",
 "title": "Cirkus"
}