{
 "id": "983180",
 "text": "The Respect for Marriage Act is a federal law in the United States. It requires all states and territories of the United States to accept marriage between people of the same sex or different races. It was passed by Congress on December 8, 2022, and became law on December 13, 2022. == Background == Until 1967, each U.S. state could choose if they wanted to allow people of different races to marry, or not. That year, the Supreme Court heard a case called Loving v. Virginia. They decided that the U.S. Constitution requires people to be free to marry someone of any race. Laws against interracial marriage could not be enforced any more. === Same-sex marriage === Until 2015, each U.S. state could choose if they wanted to allow same-sex marriage or not. That year, the Supreme Court heard a case called Obergefell v. Hodges. They ruled that same-sex marriage was a fundamental or basic right under the Constitution, so it must be legal everywhere in the United States. Of the nine judges on the Supreme Court, five agreed, and four did not. === Abortion === On June 24, 2022, the Supreme Court heard a case called Dobbs v. Jackson Women's Health Organization. They ruled that abortion was not a fundamental right under the Constitution. This allowed states to ban abortion. It reversed another court case from 1973, Roe v. Wade which said that abortion was a fundamental right. Six judges agreed with the decision in Dobbs, and three did not. Clarence Thomas was one of the judges who agreed. He wrote that, just as abortion was not protected, same-sex marriage may not be protected. Some people thought the same argument could be used against interracial marriage. == The law == The first version of the law was introduced to the House of Representatives in 2009, but this bill did not pass.https://www.congress.gov/bill/111th-congress/house-bill/3567 It was introduced to Congress again in July 2022. On July 19, it was approved by the House (267–157). All Democrats, and 47 Republicans voted to pass the bill. On November 29, the bill was approved by the Senate (61–36) but with some changes. All Democrats and 12 Republicans voted to pass it. On December 8, 2022, the House approved the new version of the bill (258–169–1). All Democrats and 39 Republicans voted for it. On December 13, President Joe Biden signed the bill, making it law. The law officially repealed, or canceled, the Defense of Marriage Act. It says that if people are married anywhere in the United States, no state can refuse to accept their marriage based on race, ethnic group, or sex. It does not require religious groups, such as churches, to be involved in any marriage ceremony. == Opinions == In September 2022, a poll showed that 74% of Americans thought same-sex marriage should be protected, 13% did not, and 13% were uncertain. A poll from 2021 showed that 94% of American supported interracial marriage. The Church of Jesus Christ of Latter-Day Saints (or Mormon church) supported the law, although they think same-sex relationships are wrong. The Southern Baptist Convention and U.S. Conference of Catholic Bishops opposed it. The Episcopal Church, Evangelical Lutheran Church in America, Union for Reform Judaism, United Church of Christ, and Presbyterian Church (USA) supported it. == Related pages == *Same-sex marriage in the United States == References == Category:American LGBT rights law Category:Same-sex marriage Category:LGBT rights in the United States Category:United States federal legislation Category:United States Supreme Court cases",
 "title": "Respect for Marriage Act"
}