{
 "id": "983256",
 "text": "The Abhiras ( also known as Ahira) is an agricultural and pastoral community of Indian subcontinent who claimed themselves to be different from the Yadavas. The Abhiras are often mentioned in ancient Indian literature in connection with the worship of Hindu God Krishna. According to a few scholars they were an ancient tribe and probably semi-nomadic people as they are associated with various peoples and provinces. A historical people of the same name are mentioned in the Periplus of the Erythraean Sea. According to few scholars, Krishna belonged to a tribe known as the Sāttvatas who inhabited the country mainly near the Mathura region. These Sāttvatas of whom they were a branch were mentioned by Panini, a poet. ==Etymology== The term Abhira means cow-herd or a Gopa. Anthropologists came up with the view that Haryana was known by this name because in the post-Mahabharata period, the Abhiras live here, who developed special skills in the art of agriculture. According to Pran Nath Chopra, Haryana evolved as a word from Abhirayana (from Abhira and ayana \"path, way\") to Ahirayana to Hariyana (Haryana). It has also been suggested that the country or city of the Abhiras is the Ophir of the Bible. ===Connection with Arabs=== Arab a metathetical form of Abir is nomad. This identification is supported by the meaning which the plural a'rab-nomad often has in the Quran and in the inscriptions found in South Arabia which mention Bedouin. Though the Arabists could find no convincing explanation for the name Arab, its various pronouncements as given by Guillaume himself as well as that of Ophir, occurring in the Bible, seem to link them to the Abhiras in India. Here it would not be out of place to mention that while Abhira gave rise to such words as Apir, Abira and Arab as well as Habiru, the latter was transformed in India to Habura just in the same manner as Uzbeka to 'ujabak' in Hindi . In Ancient Indian literature they are said to have once lived on Indus. ==Origin and History== The Abhiras have been described in the history of Ancient India as a tribe, which migrated from one place to another, and finally settled in various regions. They are said to have developed a complexity in their culture due to fusion of their tribal with the regional cultures and traditions, which are still living. The problem of migration is one of the most important features of the history of India, which itself based on literary and historical material, is one of the expansion of the vista of the country, which was colonized, physically and culturally by higher communities displacing the established tribals to the hilly regions and forests. The Abhiras or Ahiras are conspicuous example of this rule. When political condition settled down and a full-fledged state system came into existence, this expansionist urge resulted in the emergence of larger and the smaller states, culminating in the empires of Indian history. The Abhiras after undergoing the process of migration from South India established kingdoms in northern and western India. It is presumed that this exciting movement of the Abhiras took place at about the beginning of the Christian era which is not very correct. At that time, their settlements are supposed to confine to Sind, Panjab, Haryana and Rajasthan—parts adjoining to Gujarat, as recorded by the Mahabharata. In the next few centuries, they consolidated themselves in Saurastra, Gujarat, Malava and khandesha, south India, Uttar Pradesh, Bihar, Bengal, Orissa and even in Assam and Nepal. The earliest authentic reference on the Abhiras can be seen in the Mahabhasya of Patanjali (1.2.3) wherein they have been mentioned as a separate caste and have been associated with the Sudras. Other sources of our information, among others, are— Mahabharata, Ramayana, Markandeya Purana, Padma-Purdana, Mricchakatika, Prabodhacandrodaya, Pratijnayaugandharayana, and a lot of other literary works. According to some authors, the origin of the Abhiras i is steeped in obscurity. Though there are many references about the Abhiras in Ancient India literature, hardly any of them throw any light on their origin. In support of their argument they quote Mahabhasya of Patanjali who mentions them as a tribe distinct from the Sudras, but no information about their origin is available from it. The Mahabharata depicts them living with the predatory forest tribes. According to the Bhuvanakosa chapters of the Mahabharata and the Puranas these forest tribes were organised in the form of ganas of the mercenaries and freebooters, hostile to Aryans. But in later references they have also been connected with the fourfold order of the society. According to an interpolation in the Manusmrti the Abhiras were born of an Ambastha woman and a Brahmana father. Enthoven, an administrator of the British Raj and gentleman-scholar, believed that Abhiras might have entered India from Afghanistan. The pastoral setting of the stories about Krishna's childhood may have originated in legends of a god worshipped by the Abhira tribe. However Hugh Nevill says that it is probable the Abhiras on being removed from Mesopotamia, across the river, may have called themselves Abhira, as we know they did so in Scinde; while the branch in Afghanistan are spoked of in the Assyrian inscription as of \"the land of Abhiruz\". Ramaprasad Chanda author of \"The Indo-Aryan races\" says that the Abhiras from whom the Gujaratis of our day have evidently sprung, were Aryan in speech and belonged to the Indo- Afghan stock. The Puranic Abhiras, have occupied the territories of Herat, which is probably a survival of their name, as they are invariably juxtaposed with the Kalatoyakas and Haritas — the peoples of Afghanistan. Journal of the Department of Pali believes that the Abhiras came to India from some part of eastern Iran. Skanda Purāṇa also puts Abhiras as one of the tribes of Afghanistan. Bhagwan Singh Suryavanshi says archaeological research in Deccan has revealed the presence of pastoral people of the Neolithic era who shares many attributes of the Abhira. Hence, they might have been present much earlier than has been previously postulated so. He concludes that they spread from Indus to Mathura, and migrated southward and eastward.Bhagwan singh Suryavanshi, Abhira their history & culture (MS University Archaeology, & Ancient History Series, No.6) xvi, Maharaja Siyajirao, university of Baroda, 1962 He also says that similarity of culture and a common belief that they are descendants of Krishna is proof that they sprang from a common source. According to a theory advanced by A. P. Karmakar, Abhiras were a Proto- Dravidian tribe, derived from Dravidian Ayir, which means cowherd. He concludes from the Padma Purana, where Vishnu informed Abhiras, \"I shall be born among you, O Abhiras, at Mathura in my eighth birth\". D. R. Bhandarkar supports the non-Aryan origin theory, directly relating Krishna to Rig Veda's \"Krishna Drapsah\", where he fights the Aryan god Indra. Abhiras were the people of Yadava community. Yadu was the eldest son of Yayati and Devyani, who was the daughter of Shukracharya. All the territory of Mathura belonged to Abhiras. Further, Mahabharata describes Abhira as forming one of the seven republics, Samsaptak Gunas, and as a friend of Matsyas, a pre-vedic tribe. Others believe that Abhiras were originally nomadic pastoral tribes fom the lower Indus valley in modern Pakistan, who migrated eastwards and southwards across Avanti which includes districts of western Madhya Pradesh and parts of south-eastern Rajasthan. They were warriors, and after serving in the armies of various states, especially of the Sakas, some of their leaders set up an independent princes at mountainous strongholds in Southern India.Indian Kāvya Literature: The early medieval period: Śūdraka to Viśākhadatta Page3 Commenting on this Bhandarkar says, Krishna is the Hinduised form of Jesus Christ, whose teachings Abhira have brought from outside, at the beginning of Christian Era, because Krishna is called Christo near Weastern Coast, and Dalliance element in Krishna's life is inspired from traditions of Abhira tribe. Ghurye, contradicts this by saying Abhira as a tribe is mentioned in the works of Patanjali, dated 150 BC, by most conservative sources, so they definitely haven't entered at the beginning of the Christian era and possibly their presence goes very far into antiquity. Also, proofs of Extra Marital relationships exists within genealogy of Yadus so it is wrong to say Abhira are the source of Dlliance element, and he fails to see the difference between Abhira and the tribe of Krishna. However, Smith has raised two questions on this synthesis by above scholars. First, If Abhira are Yadavs then why Mahabharata mentions them having abducted wives and children of Krishna and second, why Abhira kings names are after Shiva and not Vishnu till as late as 800AD, who is a rival god. Dr. J.N. Singh Yadav and MSA Rao has contradicted Smith by saying, Those Abhira who abducted Krishna's Wives and Children might be Yadavs who were supporters of Duryodhna, and they also shows there is no rivalry between Shiva and Krishna.Mahabharta says that those Abhiras who looted Arjuna were the supporters of the Kauravas, and in the Mahabharata, Abhira, Gopa, Gopal and Yadavas are all synonyms. The Yadavs, mentioned in the Mahabharata, were pastoral kshatriyas among whom Krishna was brought up. The Gopas, whom Krishna had offered to Duryodhana to fight in his support when he himself joined Arjuna's side, were no other than the Yadavs themselves, who were also the Abhiras. In the Mahabharata it is mentioned that when the Yadavas (belonging to the Abhira group) abandoned Dwaraka and Gujarat after the death of Krishna and retreated northwards under Arjuna's leadership, they were attacked and broken up. ==Religion== The Bhāgavata religion was considered primarily as the religion of the Abhiras and Krishna himself came to be known as an Abhira. In the Mediaeval literature, Krishna is called an Abhira. ==Legendary Character in Hinduism== ===Goddess Gayatri=== Gayatri is the personified form of popular Gayatri Mantra, a hymn from Vedic texts. She is also known as Savitri and Vedamata (mother of vedas).Constance Jones, James D. Ryan (2005), Encyclopedia of Hinduism, Infobase Publishing, p.167, entry \"Gayatri Mantra\"Roshen Dalal (2010), The Religions of India: A Concise Guide to Nine Major Faiths, Penguin Books India, p.328, entry \"Savitr, god\" According to Padma Purana, lord Indra brought Gayatri, an Abhira girl, to help Brahma in a Yajna in Pushkar. She was married to Brahma during Yajna. Brahma's first wife is Savitri and Gayatri is the second. The story says that Savitri became angry knowing the wedding of Gayatri with Brahma and cursed all the gods and goddesses engaged in the event. However, in Padma Purana, after Savitri was appeased by Brahma, Vishnu and Lakshmi, she accepts Gayatri Abhira as her sister happily. In some puranas, Gayatri is said to be the other names of Sarasvati, the wife of Brahma. According to Matsya Purana, Brahma's left half emerged as a female, who is celebrated under the names of Sarasvati, Savitri and Gayatri. In Kurma Purana, Gautama rishi was blessed by Goddess Gayatri and able to eliminate the obstacles he faced in his life. Skanda Purana tells that Gayatri is the wife of Brahma making her a form of Saraswati. Gayatri further developed into a fierce goddess who could even slay a demon. According to Varaha Purana and Mahabharata, Goddess Gayatri slayed the demon Vetrasura, the son of Vritra and river Vetravati, on a Navami day. Urvashi Apsara Urvashi, the highest amongst the apsaras, was an Abhira girl who through penance, i.e., observation of bhim dwadashi vrat ascended to heavens achieving this position. Her story appears in Rigveda, where she is wife of legendary Chandravanshi king Pururavas. She is the mother of all Chandravanshi dynasties. She is also legendary mother of sages Vashishtha and Agastya, whom she bore from Mitra-Varuna. ==Rule of the Junagadh== The Chudasama dynasty, originally of Abhira clan from Sind wielded great influence around Junagadh from the 875 A.D. onwards when they consolidated themselves at Vanthali (ancient Vamanasthali) close to Girnar under their - King Ra Chuda. A Chudasama prince styled Graharipu ruling at Vanthali near Junagadh is described in the Dyashraya-Kavya of Hemachandra as an Abhira and a Yadava. ==Rule of the Nepal== An Ahir dynasty ruled pre-12th century areas in present- day Nepal. According to Gopalarājvamshāvali, the genealogy of ancient Gopala dynasty compiled circa 1380s, Nepal is named after Nepa the cowherd, the founder of the Nepali scion of the Abhiras. In it's account, the cow that issued milk to the spot, at which Nepa discovered the Jyotirlinga of Pashupatināth upon investigation, was also named Ne. ==Related pages== *Abhira Dynasty *Yadav ==References== Category:Yadav Category:Mahabharata",
 "title": "Abhira"
}