{
 "id": "983473",
 "text": "Hakeem Seriki (born November 28, 1979), better known by his stage name Chamillionaire (pronounced Ka-MIL-yin-air; a portmanteau of \"chameleon\" and \"millionaire\") is an American rapper and entrepreneur from Houston, Texas and the CEO of Chamillitary Entertainment. He stated that his goal is to show that the South can produce quality lyricists. He is also a hook writer and generally sings and harmonizes with himself (using vocals from various tracks) on his own hooks. Chamillionaire is a founder and original member of The Color Changin' Click. In 2007, he won a Grammy Award for Best Rap Performance by a Duo or Group for his number-one single \"Ridin'\", a number-one hit in the United States for two weeks in 2006. He is a former artist on Michael 5000 Watts' Swishahouse label. ==Early life== Hakeem Seriki was born November 28, 1979 in Washington, D.C. to a Nigerian immigrant father and an Nigerian- American mother. He moved to Houston, Texas at the age of four. Before becoming a rapper, he worked numerous jobs, including stocking trucks and transporting blood and urine for a medical lab. Chamillionaire said he originally lived in a section of Houston zoned for Eisenhower High School and his parents moved to the Jersey Village High School attendance zone, so he could play in a more advanced basketball program; he attended Jersey Village.\"Ain't Nobody Real but Me.\" The Austin Chronicle. == Awards and nominations == == Discography == Studio albums * The Sound of Revenge (2005) * Ultimate Victory (2007) Collaborative albums * Get Ya Mind Correct (with Paul Wall) (2002) * Controversy Sells (with Paul Wall) (2005) Extended plays * Ammunition (2012) * Elevate (2013) * Reignfall (2013) ==References== ==Other websites== *Official website (Archive copy) Category:1979 births Category:American Grammy Award winners Category:American hip hop singers Category:Living people Category:Singers from Texas Category:Rappers from Texas",
 "title": "Chamillionaire"
}