{
 "id": "983401",
 "text": "Slow Food is an idea that is opposed to fast food. Many restaraunts see it as sitting down, ordering, and eating the meal within the restaraunt, as opposed to on the go. Slow food focuses on local ingredients. These ingredients are used to prepare a meal. This is in contrast to fast food, using processed ingredients. Carlo Petrini founded the movement in 1986. Even though the movement started in Italy, it soon spread to other countries. == Aims == Slow food has the following aims: * Eating works with pleasure, which everyone deserves. * Quality needs time. * Quallity should respect ecology. Locally- produced fresh ingredients are preferable. The presentation of the meal should be aesthetically pleasing. * Everyone has a different taste; discussions about taste are natural In 2006, Petrini gave the following definition: Buono, pulito e giusto (good, clean, and fair) - If one of the three is missing, we are no longer talking about Slow Food. == Criticism == Slow Food's aims have been compared to the Arts and Crafts movement's response to 19th-century industrialisation. Without changing the working day of the masses, the preparation of slow food can be hard to whoever prepares food. People with more money can afford the time and expense of developing \"taste\", \"knowledge\", and \"discernment\". Slow Food's stated aim of preserving itself from the \"contagion of the multitude\" can be seen as elitist by those that consume fast food or are not part of the movement. In 1989, Petrini visited Venezuela and began to recognize the socioeconomic barriers that many faced with regard to the slow food movement. To address this, he adjusted the slow food agenda to include an alternative food approach that favored healthy, local, community- based food consumption and production. While this made the slow food movement more accessible for many, it did not eliminate all of the socioeconomic barriers faced by the movement. == References == Category:Foods",
 "title": "Slow Food"
}