{
 "id": "983526",
 "text": "Anti-Zionism is the opposition to Zionism, an ideology for the creation and development of a Jewish homeland in the Jewish ancestral Land of Israel. * * * * * * Those opposed to Zionism are known as anti-Zionists. Anti-Zionism emerged at the same time as Zionism, when diaspora Jews began migrating to Palestine and changing the local demographics. Many anti-Zionists have accused Zionism of being \"settler colonialism\". * * * * * * * * ==Reception== ===Public endorsement=== Many anti-Zionists oppose the existence of Israel under various pretexts, including concerns about Jewish nationalism and Palestinian displacement. Anti-Zionism has been the strongest in the predominantly Muslim Arab world since early 20th century. Some anti-Zionists refer to Israel as \"the bastard child of an evil ideology born in sin\" as a \"racist, settler-colonial state.\" They accuse the Zionists of \"pursuing ethnic cleansing, expulsions, theft and apartheid.\" Some Middle Eastern media denigrate Israel as a \"Zionist entity.\" Anti-Zionists also justify themselves by phrasing their arguments as mere criticism of Israel's policies, including the occupation of the West Bank, Golan Heights and the blockade of the Hamas- ruled Gaza Strip. ===Academic criticism=== Academic critics of anti-Zionism said that many antisemites passed off their prejudice as anti-Zionism, often in the form of biased criticism or rejection of the right of Israel to exist as a haven for Jews facing mistreatment elsewhere. * * * * Under the Working Definition of Antisemitism IHRA Working Definition of Antisemitism : * Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion. * Making mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions. * Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews. * Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust). * Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust. * Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations. * Denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor. * Applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation. * Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterize Israel or Israelis. * Drawing comparisons of contemporary Israeli policy to that of the Nazis. * Holding Jews collectively responsible for actions of the state of Israel. of the International Holocaust Remembrance Alliance (IHRA), an intergovernmental organization on antisemitism and the Holocaust, anti-Zionism in the form of opposing the Jewish right to self- determination is a form of antisemitism. * * * David Hirsh, a British historian, criticized the dishonesty of many anti-Zionists: Walter Laqueur, a German-American historian, also pointed out a similar issue with the anti- Zionists: ==Related pages== * Antisemitism * The Holocaust * Holocaust denial * Holocaust inversion * Holocaust trivialization * The Protocols of the Elders of Zion ==References== Category:Zionism",
 "title": "Anti-Zionism"
}