{
 "id": "983795",
 "text": "Two Fires is the fourth studio album by the Australian rock singer Jimmy Barnes, and his first United States release for Atlantic Records. It was released in Australia by Mushroom Records and was his fifth consecutive No. 1 album, debuting in September 1990 and remaining at the position for four weeks. On 16 June 1991, Two Fires again reached No. 1, making it the only Barnes album to achieve such a feat. The title track, \"Between Two Fires\", was co-written with the hit songwriter, Holly Knight. It notably added \"Stick to Your Guns\" which was later used in the 2022 movie \"Jimmy's Great Adventure\". == Track listing == # \"Lay Down Your Guns\" (Jimmy Barnes, Rick Nowels) # \"Let's Make It Last All Night\" (Barnes, Diane Warren, Desmond Child) # \"Little Darling\" (Barnes) # \"Love Is Enough\" (Barnes, Marvin Etzioni, Sandford, Thomas, Froggatt) # \"Hardline\" (Barnes, Tony Brock, Jay Williams, Savigar) # \"One of a Kind\" (Barnes, Brock, Williams, Savigar) # \"Sister Mercy\" (Barnes, Ross Wilson, Neill) # \"When Your Love is Gone\" (Barnes, Brock, Savigar) # \"Between Two Fires\" (Barnes, Holly Knight) # \"Fade to Black\" (Barnes, Bailey) # \"Hold On\" (Barnes, Brock, Williams) # \"Stick to Your Guns\" (Brock) == Singles == 3 certain tracks from the Two Fires sessions did not make it to the final album, but they appeared as B-sides of the album's singles, and they were later included on the 2007 album, Rarities. These include: # \"Broken Hearts\" (B-side of \"Lay Down Your Guns\") # \"Bad News\" (B-side of \"Let's Make It Last All Night\") # \"No Frills\" (B-side of \"Little Darling\") ==Outtakes== A demo recording session in July 1989 produced 12 several tracks which were not included on the final album and which remain unreleased. These include: # \"Jealousy\" # \"Testify\" # \"Love is For Nothing\" # \"Ain't That Just Like Love\" # \"Don't Make Me Wait\" # \"All Is Forgiven\" # \"Give and Take\" # \"Crazy World\" # \"Glory Bound\" # \"Body and Soul\" # \"Killer Love\" # \"Rock Me Over\" ==Personnel== * Jimmy Barnes – vocals * Jeff Neill, Mark Lizotte, Brian Setzer, Todd Sharp, Wally Stocker – guitar * Jimmy Haslip – bass * Tony Brock – drums * Kevin Savigar – keyboards * Eliza-Jane 'E.J.' Barnes, Jackie Barnes, Jane Barnes, Jimmy Barnes, Mahalia Barnes, Spencer Brock, Taylor Brock, Tony Brock, Leanne D'Hudson, Wendy Fraser, Grace Gehman, Portia Griffin, Marcy Levy, Jeff Neill, Brian Setzer, Todd Sharp, Jade Thacker, Nicholas Thacker, Sue Thacker, Tyler Thacker, Debbie Harwood – backing vocals Technical * Rick O'Neil – mastering engineer ==References== Category:1990 albums Category:Jimmy Barnes albums",
 "title": "Two Fires"
}