{
 "id": "98376",
 "text": "Gibbons belong to the group of lesser apes. They are known for their ability to swing from one tree to another with great agility and swiftness. There are four genera of gibbons. Gibbons live in dense tropical forests, for example, in Sumatra, Thailand, and Malaysia. Groves C.P. 2005; Wilson D.E. & Reeder D.M. (eds) Mammal Species of the World: A taxonomic and geographic reference. 3rd ed. Baltimore: Johns Hopkins University Press. pp. 178–181. ISBN 0-801-88221-4 ==Extraordinary abilities== Gibbons are the best tree travelers in the animal kingdom. They almost seem to be flying as they swing themselves hand over hand through the trees. Like great apes, gibbons can also walk upright on the ground. When they walk on the ground, gibbons hold their long arms in the air to keep them from dragging.Pous, Dinora Blue Planet Level 5. 67/8 Gibbons are \"singers\" too. Their powerful voices travel for kilometers through the forests of Southeast Asia. At times, a male, a female, and their young get together and \"sing\" in a chorus. These sounds help groups of gibbons stay in contact. They also tell unwelcome visitors to stay away. Gibbons stay busy for most of the day. They swing through the trees, looking for leaves, flowers, fruit, and insects to eat. When night falls, small groups settle down in familiar trees for the night. ==Male and female== Unlike most other primates, male and female gibbons are not very different in size and shape, although they may differ in color. The males are usually black, while the females tend to be ash blond. Female gibbons have one offspring per gestation period and live about 25 years. == Taxonomy == The family is divided into four genera based on their diploid chromosome number: Hylobates (44), Hoolock (38), Nomascus (52), and Symphalangus (50). * Family Hylobatidae: gibbons ** Genus Hylobates *** Lar gibbon or White-handed gibbon, Hylobates lar *** Agile gibbon or Black-handed gibbon, Hylobates agilis *** Müller's Bornean gibbon, Hylobates muelleri *** Silvery gibbon, Hylobates moloch *** Pileated gibbon or Capped gibbon, Hylobates pileatus *** Kloss's gibbon or Mentawai gibbon or Bilou, Hylobates klossii ** Genus Hoolock *** Western Hoolock gibbon, Hoolock hoolock *** Eastern Hoolock gibbon, Hoolock leuconedys ** Genus Symphalangus *** Siamang, Symphalangus syndactylus ** Genus Nomascus == References == == Other websites == *Gibbon Conservation Center *Gibbon Network and Research Lab Category:Apes Category:Mammals of Asia",
 "title": "Gibbon"
}