{
 "id": "983951",
 "text": "Francis La Flesche (1857-1932) was one of the first early indigenous anthropologists and the first professional Native American ethnologist. He was a member of the Omaha Tribe. He was an informant for the ethnographer and linguist James Owen Dorsey, who was getting information on the Omaha. He also worked closely with Alice Fletcher as her interpreter and fellow researcher of Omaha culture. After working with Fletcher, he published his works on the Omaha and Osage Tribes with the Smithsonian. == Background == Francis was the child of the Chief Principle Joseph La Flesche and an Omaha woman named Tainne. His father was of Ponca Indian and French descent; his mother was full Omaha. His father pushed white culture onto him, but he was pulled towards the Omaha culture and knew how to read, write, and speak the language. == Education == La Flesche attended the Presbyterian Mission school on the reservation until it closed in 1869. After the school closed, he continued his English language education by reading the bible out loud to his father. Later in life, while working at the Smithsonian Institution, he got two degrees, a bachelor’s degree in law from National University in 1892 and a master’s degree in 1893. == Anthropological Career == La Flesche's first job in the field was as an interpreter and informant for James Owen Dorsey of the Bureau of American Ethnography. For that year, Dorsey was there in 1878; La Flesche helped Dorsey record Omaha's culture and caused him to become interested in recording Omaha's songs and instruments. In 1879, Francis traveled east with his sister Susette, the Ponca chief Standing Bear, and the Omaha journalist Thomas H. Tibbles for Indian Land Reform. After this trip, he took a job as a clerk at the Bureau of Indian Affairs in Washington, D.C. During his time there; he met Alice Fletcher. La Flesche started working as her interpreter. Later he turned into a partner in ethnography. She adopted him as her son. Together they recorded, sorted, and put together over 30 years of work on the Omaha Tribe into a complete publication known as The Omaha Tribe. After this work together, he was sent to work at the Bureau of American Ethnology. They sent him to Oklahoma to study with the Osage Tribe. He recorded the songs, chants, and music of the Osage people and wrote reports on them during his time at the bureau. Those recordings are still available to listen to today. La Flesche worked at the bureau until 1928 when he retired and moved back to Nebraska to live with his family. == Legacy and Honors == La Flesche was a member of the Washington Academy of Sciences. He also got an honorary doctorate from the University of Nebraska. He died in 1932 on the Omaha Reservation in Nebraska. La Flesche helped record and document important parts of the Osage and Omaha Tribes culture for other anthropologists and community members to look back on for research and good memories. == Publications == Francis produced many famous works. Two with Alice Fletcher, known as A Study of Omaha Music (1893) and The Omaha Tribe (1911). Some of his own works known as The Middle Five: Indian Boys at School (1900), an autobiography about his time at the mission boarding school, a play called Da-o-ma (1912), that was never truly published, Who was the Medicine Man? (1904), A Dictionary of the Osage Language, and his most famous work The Osage Tribe(1922-1930) published in four separate volumes of the Bureau of American Ethnology annual reports. == References == *“Biographies of Plains Indians: Francis La Flesche - 1857-1932.” Biographies of Plains Indians: Francis La Flesche - 1857-1932 - American Indian Relief Council Is Now Northern Plains Reservation Aid, Northern Plains Reservation Aid, http://www.nativepartnership.org/site/PageServer?pagename=airc_bio_francislaflesche. *“Francis La Flesche (1857-1932).” The Library of Congress, 1985, https://www.loc.gov/item/ihas.200196221/. *Mark, Joan. \"Francis La Flesche: The American Indian as Anthropologist.\" Isis 73.4 (1982): 497-510. Category:American anthropologists Category:1857 births Category:1932 deaths",
 "title": "Francis La Flesche"
}