{
 "id": "983923",
 "text": "The 1800 United States presidential election was the fourth American presidential election between Thomas Jefferson and John Adams. Adams and Jefferson had awkwardly worked as president and vice president together for the previous four years, and it was a rematch of the 1796 election. In the end, Jefferson beat Adams and the long streak of Democratic-Republican presidents began. This election is referred to as the \"Revolution of 1800\" because it changed American politics a lot. ==Background== Before the Twelfth Amendment to the United States Constitution, the second place winner was the vice president. Because of this, Thomas Jefferson became John Adams' vice president even though they hated each other. This caused it to be an awkward time as the enemies had to work together. When the 1800 election rolled around, everyone was divided and furious. Adams had passed many unpopular laws like the Alien and Sedition Acts. John Adams was also called out for being too friendly with Britain, and his supporters responded by calling Jefferson supporters \"Radical Atheists\". This was the last election in America before the twelfth amendment was passed. There were technically two other people running, but they were more like vice presidential candidates. If electors supported one candidate, they were told to put their other vote to that candidate's unofficial vice president nominee, expecting that if they won, the other person would be in second place. John Adams' unofficial vice president candidate was Charles Cotesworth Pinckney, and Jefferson's was Aaron Burr. ==Results== Thomas Jefferson and Aaron Burr both got 73 electoral votes. However, since they got the same, the Senate had to vote on which one would become president and which one would be vice president. Jefferson ended up being president. However, it was hard because the Senate was still controlled by people who didn't like Jefferson and Burr. Adams got 65 electoral votes. His vice president candidate, Pinckney, got 64, with the one other vote going to John Jay. If Adams was reelected, he wouldn't have had to deal with the Senate vote. == References == Category:1800 in the United States Category:United States presidential elections",
 "title": "1800 United States presidential election"
}