{
 "id": "984052",
 "text": "Otto \"Schloime\" Fischer (1 January 1901 – 1 July 1941) was an Austrian football player. He played as forward for different teams in Vienna and in the Austrian national football team. ==Career== He started at ASV Hertha Wien, where he also made his first appearances in the top league. In 1921 he accepted an offer from German Bohemia and played for Karlsbader FK for two years. He then returned to First Vienna FC. In his three years at the club, they were runners-up twice and also reached the ÖFB Cup final twice. After losing their entire forward line to New York clubs as a result of their first tour of North America, SC Hakoah Wien were forced to find other forwards and one of the newcomers was Fischer. At the beginning of 1928 he went to SC Wacker Wien. Then he went back to Hakoah, but had to end his career early due to a knee injury. Transfermarkt.at Spielerprofil Otto Fischer ==International career== He made his international debut in September 1923 in a 2-0 loss to Hungary in Budapest. He made his seventh and last game in national dress in October 1928 against Switzerland. ==Managing career== After the end of his playing career he became manager of the Serbian club FK Mačva Šabac. Then he coached FC Salzburg. In 1932 he took over training at DSV Saaz, where he stayed for two years. 1934 he went back to Yugoslavia to HŠK Concordia Zagreb. From 1936 on he worked in Latvia, where he was a coach of Olympia Libau. He was in 1936, 1938 and 1939 Latvian football champion with the club. Transfermarkt.at Trainerprofil Otto Fischer ==Death== Fischer and his wife were killed in the Liepāja massacres in 1941. The majority of Fischer's family living in Vienna were also murdered by the National Socialists. His mother Netty Fischer was killed in the Theresienstadt ghetto in 1943. His brother Hugo Fischer, his wife Ilona and their daughter Gerda did not survive the 1942 deportation to the Auschwitz concentration camp. Only his sister Ernestine and her two children Paul and Alice survived the Nazi terror. Alexander Juraske: Der Fußball-Nationalspieler Otto Fischer ==References== Category:1901 births Category:1941 deaths Category:Austrian footballers Category:Association football forwards Category:Players of the Austrian national football team Category:Austrian football forwards",
 "title": "Otto Fischer"
}