{
 "id": "98406",
 "text": "Same-sex marriage (also known as gay marriage) is a relationship in which two people of the same sex (same gender) live together as a family in a governmentally, socially, or religiously recognized marriage. Access to same- sex marriage is sometimes called marriage equality, especially by supporters.2010, Tracy Baim, Obama and the Gays: A Political Marriage, page 139: said that he would vote for a federal marriage amendment if laws already banning marriage equality were to be struck down by federal courtsAustralian gay politician travels to Spain in order to marry partner retrieved 6 January 2012 == Current status == Marriage under civil law is presently available to same-sex couples in the following countries: Andorra Argentina, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Denmark (including Greenland and Faroe Islands), Ecuador, Finland, France, Germany, Iceland, Ireland, Luxembourg, Malta, Mexico, Netherlands (Netherlands proper; pending in Aruba and Curaçao), New Zealand, Norway, Portugal, Slovenia, South Africa, Spain, Sweden, Switzerland, Taiwan, United Kingdom, United States and Uruguay. In Ecuador, Taiwan and some states in Mexico, same-sex married couples are not allowed to adopt children the way other married couples are. The Netherlands was the first country in modern times to allow marriages of two people of the same sex, in 2001.Norwegian Matrimony law Same-sex marriage became legal everywhere in the United States in 2015. The Supreme Court ruled that not allowing same-sex couples to marry was unconstitutional. There are various faiths that practise same-sex marriages, including Eckankar, Wicca, Unitarian Universalism, Raelism, and Native American religions with a two- spirit tradition. Legalization of same-sex marriage: summary table State Dates Dates State First jurisdiction legalized National ruling or final jurisdiction * * * 2023 Estonia 2024 Greece 2024 * This state controls one or more territories where same-sex marriage is not legal. ===Netherlands=== In the Netherlands, a same-sex marriage law does not actually exist. Back in 2001, the existing (normal) marriage law was 'only' changed, so that it now includes marriage of same-sex partners. This means that same-sex marriage in the Netherlands is not different from a normal marriage; it's exactly the same. The Dutch law says the following: —Dutch civil law, book 1, article 30Burgerlijk wetboek Artikel 30 That is consistent with the first article of the Dutch civil law, and with the Dutch constitution: Dutch civil law, book 1, article 1Burgerlijk wetboek Artikel 1 Dutch constitution, article 1Nederlandse grondwet, artikel 1 === Civil unions === The first same-sex union in modern history was recognized by the government in Denmark in 1989. It provided many of the right of marriage, but not all. Civil unions, civil partnership, domestic partnership, unregistered partnership/unregistered co-habitation or registered partnerships that offer some of the benefits of marriage are available in the following countries and territories that do not provide same-sex marriage: Andorra, Croatia, Cyprus, Czech Republic, Hungary (unregistered co-habitation since 1996; registered partnership from 2009), Israel, Italy, Veracruz in Mexico, Monaco, Montenegro, San Marino, and the UK possession of the Cayman Islands. === Adoption === Same-sex marriage does not always mean marriage equality. In many countries, adoption law and reproductive rights are independent of marriage law. For example, same-sex couples may be allowed to marry, and \"married\" couples may be allowed to adopt children, but same-sex married couples may not be allowed to adopt. This was the situation in Portugal for several years. Currently (2023), same-sex married couples are prevented from adopting children in Ecuador, Taiwan, and several states of Mexico. On the other hand, a few countries have allowed same-sex couples to adopt children, even while they do not allow them to marry. Usually these countries have civil unions. An example in 2022 is Croatia. == Controversy == The controversy over recognition of same-sex unions as marriages is a very important part of a larger debate about the definition of a family. Same-sex marriage is not considered as valid by many religions. Many others, however, see same-sex marriage as important for all people to be equal. They sometimes say that religions and law (Defense of Marriage Act, for example) who do not support same-sex marriage are intolerant (they do not show respect to other peoples' beliefs). Additionally, people married in civil unions usually do not enjoy all the benefits (lower taxes, health insurance etc.). ==Organizations involved in same sex marriage== Various organizations exist in part to support the rights of homosexual or gay men and women to marry people of the same sex. One organization is the Human Rights Campaign or HRC. ==Related pages== *Same-sex couple *Same-sex marriage in the United Kingdom *Same-sex marriage in the United States == Notes == === References === * == Other websites == *LA Weekly feature, \"California Supreme Court Set to Consider Gay Marriage\", Feb. 2008 by Matthew Fleischer *Today is Freedom to Marry Day - Just Don't Say \"Gay Marriage\"!, Evan Wolfson, Huffington Post, February 12, 2008.",
 "title": "Same-sex marriage"
}