{
 "id": "984189",
 "text": "The diseases COVID-19 (or coronavirus) and Influenza (or flu), are two types of viruses that cause outbreaks, epidemics and pandemics that cause serious cases in the human body. There are similarities in the symptoms of \"COVID-19\" and Influenza, having: fever, cough, cold , tonsillitis, headache, body ache, fatigue, hives, vomiting and diarrhea, except for signs of loss of taste/smell and difficulty, shortness of breath. Influenza appears within 1-3 days and lasts for 2-8 days. First, the patient affected by Influenza (flu) will feel the common cold, cough, runny nose and dizziness. For COVID-19, after exposure or contact tracing for 5-7 days, a patient positive for \"COVID-19\" would be quarantined for 14 days. In August 2021, the number of cases of COVID-19 reached 200,000,000+ million who tested positive for the disease. ==Differences== ===Influenzavirus=== The seasonal flu (influenza) appears within 1-2 days after it infects an exposed person within a place, region and so on. Influenza is usually a disease that appears due to changing climate or the others come from animals that are easily contagious (nature made), There are different types of \"flu\" these are the genera: Influenza A virus (Alpha), Influenza B virus (Beta) and Influenza C virus (Gammavirus) and Influenza D virus (Delta). Influenza is more contagious especially when families are close together. Influenza is also transmitted from diseases that come from Bird flu/Avian influenza and Swine Flu. ; Signs and symptoms * Fever/shivers * cough * Tonsils affected * Runny nose/stuffy nose * Body pain * Headache * Fatigue * Vomiting and diarrhea - commonly experienced by children, middle- aged and elderly ===Coronavirus=== The Coronavirus \"COVID-19\" or \"2019-nCoV\", is a pneumonia-like flu that causes the collapse of the body caused by the RNA virus of SARS-CoV-2 recorded in the country China in 2003 and 2019, Coronavirus including SARS-CoV-2 variants are highly contagious, Like the flu, there are different types or types of COVID-19, it the Alpha, Beta, Gamma, Delta, Eta, Epsilon, Iota, Lambda, Theta and others, Its common symptoms are lack of taste, smell and difficulty breathing (shortness of breath), The infection of \"COVID-19\" when a positive person coughs and sneezes which is transmitted in small droplets (droplets) and will be transmitted or carried in the air. It is often transmitted by touching or by contaminated objects that are often touched, hand touching mouth, nose and eyes. ; Common symptoms * Fever * Dry cough * Fatigue ; Other symptoms * Pain and tingling * Tonsils affected * Diarrhea * Eye redness (conjunctivitis) * Headache * Absence of smell/taste * Skin rash/Discoloration of fingernails ; Serious symptoms * Difficulty and shortness of breath * Chest pain/pressure * Absence of speech/difficulty in movement ==Related pages== * Pneumonia * Differences between COVID-19 and pneumonia ==References== Category:COVID-19 pandemic",
 "title": "Differences between COVID-19 and influenza"
}