{
 "id": "984153",
 "text": "Triggerfish are about 40 species of often brightly colored fish of the family Balistidae. Triggerfish are native to tropical waters. A prehistoric pufferfish called Zignoichthys bore a resemblance to them. Most are found in shallow, coastal habitats, especially at coral reefs, but a few, such as the ocean triggerfish are pelagic. Triggerfish are very popular in the marine aquarium trade. However, they are often grumpy. There are reports that triggerfish have attacked humans due to them being territorial, but these attacks are extremely rare. == Description == Triggerfish have an oblong- shaped, laterally compressed body. The head is large, having a small but strong mouth with teeth adapted for crushing shells. They have small eyes set far back from the mouth and at the top of the head. To protect themselves from predators, triggerfish can erect the first two dorsal spines: The first (anterior) spine is locked in place by erection of the short second spine, and can be unlocked only by depressing the second, \"trigger\" spine, hence the name triggerfish. === Triggerfish sizes === The stone triggerfish (Pseudobalistes naufragium) reaches 1 m (3.3 ft) and is the largest of them all. The titan triggerfish (Balistoides viridescens) is also relatively large, but it is not the largest ever. == Behavior == === Male territoriality === Some male species (i.e. Balistes carolinensis and Pseudobalistes flavimarginatus) build hollow nests within their territories. They often like to guard their territories as having a territory is essential for reproduction. === Mating systems === The species Xanthichthys mento and yellowmargin triggerfish have eggs spawned in the morning. They hatch after the sunset (more specifically, night), which is unusual. === Life history === A triggerfish lays its demersal eggs in a small hole that has been dug into the seabed. Off Florida, juveniles of some triggerfish are found in floating sargassums, where they often feed on small shrimp, crabs, and mollusks. == Classification == * Genus Abalistes ** Abalistes filamentosus ** Abalistes stellaris ** Abalistes stellatus * Genus Balistapus ** Balistapus undulatus * Genus Balistes ** Balistes capriscus ** Balistes polylepis ** Balistes punctatus ** Balistes vetula * Genus Balistoides ** Balistoides conspicillum ** Balistoides viridescens * Genus Canthidermis ** Canthidermis macrolepis ** Canthidermis maculata ** Canthidermis sufflamen * Genus Melichthys ** Melichthys indicus ** Melichthys niger ** Melichthys vidua * Genus Odonus ** Odonus niger * Genus Pseudobalistes ** Pseudobalistes flavimarginatus ** Pseudobalistes fuscus ** Pseudobalistes naufragium * Genus Rhinecanthus ** Rhinecanthus abyssus ** Rhinecanthus aculeatus ** Rhinecanthus assasi ** Rhinecanthus cinereus ** Rhinecanthus lunula ** Rhinecanthus rectangulus ** Rhinecanthus verrucosus * Genus Sufflamen ** Sufflamen albicaudatum ** Sufflamen bursa ** Sufflamen chrysopterum ** Sufflamen fraenatum ** Sufflamen verres * Genus Xanthichthys ** Xanthichthys auromarginatus ** Xanthichthys caeruleolineatus ** Xanthichthys lima ** Xanthichthys lineopunctatus ** Xanthichthys mento ** Xanthichthys ringens * Genus Xenobalistes ** Xenobalistes tumidipectoris There is also an extinct genus: * Genus Balistomorphus ** Balistomorphus ovalis == What they eat == They'll feed on benthic invertebrates, such as crabs, sea urchins, shrimp, sand dollars, lobsters, and mollusks. == Human uses == Some species of triggerfish, such as the titan triggerfish, may be ciguatoxic and cannot be eaten. Others, however, such as the grey triggerfish (Balistes capriscus), are edible, meaning you can eat them. == Triggerfish attacks == Triggerfish can bite and suck blood from its attacker to weaken them. == Related pages == * Pleuropholidae == References == # Matsuura, Keiichi (2014). \"Taxonomy and systematics of tetraodontiform fishes: a review focusing primarily on progress in the period from 1980 to 2014\" (PDF). Ichthyological Research. 62 (1): 72–113. doi:10.1007/s10228-014-0444-5. S2CID 15223867. # Lieske, Ewald; Myers, Robert (1999). Coral Reef Fishes: Caribbean, Indian Ocean, and Pacific Ocean including the Red Sea. Princeton University Press. . # McDavid, Jim (July 2007). \"Aquarium Fish: Triggerfish\". Advanced Aquarist. Vol. VI, no. VII. Archived from the original on 6 June 2017. # Froese, Rainer; Pauly, Daniel (eds.) (2015). \"Pseudobalistes naufragium\" in FishBase. February 2015 version. # Debelius, Helmut (1993). Indian Ocean Tropical Fish Guide. Aquaprint Verlags GmbH. . # Randall, J.E.; Millington, J.T. (1990). \"Triggerfish bite – a little-known Marine hazard\". Journal of Wilderness Medicine. 1 (2): 79–85. doi:10.1580/0953-9859-1.2.79. # Lobel, Philip S.; Johannes, Robert E. (September 1980). \"Nesting, egg and larvae of triggerfish (Balistidae)\". Environmental Biology of Fishes. 5 (3): 251–252. doi:10.1007/bf00005359. S2CID 3213367. # Kawase, Hiroshi (March 2003). \"Spawning behavior and biparental egg care of the crosshatch triggerfish, Xanthichthys mento (Balistidae)\". Environmental Biology of Fishes. 66 (3): 211–219. doi:10.1023/a:1023978722744. S2CID 35997227. # Gladstone, William (March 1994). \"Lek-like spawning, parental care and mating periodicity of the triggerfish Pseudobalistes flavimarginatus (Balistidae)\". Environmental Biology of Fishes. 39 (3): 249–257. doi:10.1007/bf00005127. S2CID 36747250. # Kawase, Hiroshi (2003). \"Maternal egg care in the bridled triggerfish, Sufflamen fraenatus (Balistidae) at Hachijojima island, Japan\". Natural History Research. 7: 193–197. # Reebs, Stéphan G. (2011–2015). \"Are fishes good parents?\" (PDF). Université de Moncton. Archived (PDF) from the original on 4 March 2016 – via howfishbehave.ca. # Matsuura, K.; Tyler, J.C. (1998). Paxton, John R.; Eschmeyer, William N. (eds.). Encyclopedia of Fishes: A Comprehensive Guide by International Experts. San Diego: Academic Press. pp. 228–229. . # Evans, Jade. \"How To Cook Triggerfish In The Most Delicious Way\". MarvelousChef.com. Archived from the original on 29 July 2017. Retrieved 4 July 2017. # \"Triggerfish\". A-Z Animals. # \"16 Facts About Triggerfish\". Facts.net. # \"Gray Triggerfish\". NOAA Fisheries. # \"Triggerfish\". Animal World. == Other websites == * Media related to Balistidae at Wikimedia Commons * Data related to Balistidae at Wikispecies Category:Tetraodontiformes Category:Ray-finned fish",
 "title": "Triggerfish"
}