{
 "id": "98411",
 "text": "Dual monarchy is a union of two monarchies where the thrones of each monarchy are combined. A typical case is a personal union in which the crowns of the separate kingdoms are held by one person. The following are examples of dual monarchies, listed alphabetically with the dominant or co-dominant nation first: *Austria-Hungary, a dual monarchy that existed from 1867 to 1918. *Babylon and Nippur during the second half of the rule of the Kassite government in Babylonia, the 13th and 12th centuries BC; the governor of Nippur, the guennakku, ruled as a secondary administrative monarch. *Brandenburg-Prussia from 1618 until 1701, when King Frederick III became King in Prussia *Castile and Aragón from the union of 1469 resulting from the marriage of Ferdinand II of Aragon and Isabella of Castile until the abolition of the Crown of Aragón by the Nueva Planta decrees in 1707. The Kingdom of Spain technically existed as a dual monarchy for 238 years and, for this reason, American history lessons about Spain at the time of the voyages of Christopher Columbus teach not simply about \"King Ferdinand,\" but about \"Ferdinand and Isabella.\" *Denmark and England from the conquest of England by Sweyn I of Denmark in 1013 until the death of Harthacanute in 1042 and the dissolution of the union. *Denmark-Norway, a dual monarchy that existed from 1536 to 1814. *Sweden-Norway, a dual monarchy that existed from 1814 to 1905 *Various periods of personal unions between the monarchies on the British Isles: **England and Ireland from 1541 to 1707. (Including Scotland between 1603 and 1707, although parts of Scotland held out until 1652.) **Great Britain and Ireland from 1707 to 1800. **United Kingdom and the Irish Free State from 1927 to 1936/1949. (See Monarchy in the Irish Free State.) *Kush and Egypt during the Twenty-fifth dynasty of Egypt, with Kushite kings on a dual throne from circa 780 BC to 672 BC. *The Netherlands and Great Britain from 1689 to 1702 as a result of the British Glorious Revolution replacing James II of England with the stadtholder William III of Orange-Nassau and his co-ruler and wife Mary II of England *Oman and Zanzibar as a dual sultanate from the death of Said bin Sultan in 1856 until the British conquest of Zanzibar in 1896. *Poland-Lithuania from the Union of Krewo in 1385 to its liquidation by the third and final of the Partitions of Poland in 1795. This was the personal union known as the Polish-Lithuanian Union from 1385 to 1569, when the Polish-Lithuanian Commonwealth was founded. In 1401, Lithuania was granted vast internal autonomy by the Union of Vilnius and Radom. *Portugal and Brazil from the relocation of the Portuguese monarchy from Napoleonic- occupied Lisbon to Rio de Janeiro in 1808 until the independence of the Brazilian Empire in 1825. *Spain and Portugal during the Iberian Union from 1580 to 1640. This was technically a triple monarchy of Castile, Aragón, and Portugal (see above). The Kalmar Union between Denmark, Norway and Sweden was also a triple monarchy. ==Related pages== *Personal union Category:Monarchy",
 "title": "Dual monarchy"
}