{
 "id": "984272",
 "text": "Balakovo () is a city in Saratov Oblast, Russia. It is on the east bank of the Volga River. It is about northeast of Saratov. Population: == History == Balakovo was founded in 1762 by the Old Believers who returned from Poland. It was granted town status in 1913. For a long time people thought that the city of Balakovo was founded in 1762, but later a document from 1738 was found in the archives of St. Petersburg. It mentions the Cossack meadow possession of Balakov Yurt. In 1762, Empress of Russia Catherine II wanted the Old Believers to return from Poland to Russia and settle on the lands between the Bolshoy and Maly Irgiz rivers. The Old Believers founded many new settlements, including Balakovo. In 1861, there were 2,700 people living in the village of Balakovo. The village grew quickly because of the wheat trade that went through it. Up to 10 million poods of grain were sent from Balakovo in one season. There were over 300 big barns near Balakovo to store the grain. The village also had a large forest nearby that helped its economy. In 1897, the population of the village reached 18,388 people. Balakovo grew in size and in industry at the start of the 20th century. In May 1911, Balakovo was given city status. Ivan Mamin became the first city head. In 1917, there were 6 churches, 7 schools, the grain market, the ironworks of Fyodor Blinov and the mechanical plant of oil engines of the Mamin brothers, ship repair and furniture workshops, sawmills, mills, a commercial college opened in 1910, the Zemsky hospital and the city factory ambulance (polyclinic), a library, and a power plant, which was organized by the \"Light\" partnership. Inventors Fyodor Abramovich Blinov and Yakov Mamin made Balakovo the birthplace of the world's first caterpillar tractor, wheel self-propelled gun and Russian diesel engine. == Economy == The Saratov Hydroelectric Station on the Volga River and the Balakovo Nuclear Power Plant are in Balakovo. It is served by the Balakovo Airport which currently does not work. Balakovo has a rail connection to Moscow, and is an end destination for some train routes. == Climate == Balakovo has a humid continental climate (Köppen: Dfa) with long cold winters and warm, often hot summers. == Notable people == * Yulia Alipova (born 1990), beauty pageant titleholder * Artem Vodyakov (born 1991), speedway rider * Yevgeni Khlebodarov (born 1980), former footballer * Andrei Kovalenko (born 1970), professional ice hockey forward * Dmitri Kugryshev (born 1990), professional ice hockey forward * Andrey Kudryashov (born 1991), speedway rider * Ivan Maximkin (born 1988), professional ice hockey defenceman * Anastasia Karpova (born 1984), pop singer == Twin towns – sister cities == Balakovo is twinned with: * Trnava, Slovakia * Cherepovets, Russia == References == == Other websites == * Official website of Balakovo * Directory of organizations in Balakovo Category:Cities and towns in Saratov Oblast",
 "title": "Balakovo"
}