{
 "id": "984323",
 "text": "The Indo-Pacific is a biogeographic region of Earth. It is also known as the Indo-West Pacific or Indo-Pacific Asia. It includes the waters of the Indian Ocean, the western and central Pacific Ocean, and the seas connecting the two in the general area of Indonesia. It does not include the temperate and polar regions of the Indian and Pacific oceans, nor the Tropical Eastern Pacific, along the Pacific coast of the Americas, which is also a distinct marine realm. The term is used in marine biology, ichthyology, and similar fields. This is because many marine habitats are connected from Madagascar to Japan and Oceania, and a number of species occur over that range, but are not found in the Atlantic Ocean. == Subdivisions == The WWF and Nature Conservancy divide the Indo-Pacific into 3 realms. === Central Indo-Pacific === The Central Indo-Pacific is a part of the larger Indo-Pacific. === Eastern Indo- Pacific === The Eastern Indo-Pacific is another part of the Indo-Pacific. === Western Indo-Pacific === The Western Indo-Pacific is a part of the Indo- Pacific. == Criticism == Former Prime Minister of Australia Paul Keating, in a televised address at the National Press Club, criticized the notion of the Indo-Pacific as a construct of the United States in its diplomatic war with China: > The United States says, well, that's all very interesting. But look, if you > behave yourself, you Chinese. You can be a stakeholder in our system. And > look, you wouldn't have to be Xi Jinping or anybody, to take the view of > your Chinese Nationalist say, \"Well, hang on, let me get this right. We are > already one and a quarter times bigger than you, will soon be twice as big > as you, and we may be two and a half times as big as you. But we can be a > stakeholder in your system, is that it?\" I mean, it’d make a cat laugh. == Related pages == * Lechon kawali * Pacific Ocean * Atlantic Ocean * Southern Ocean == References == # Roberts, Callum M.; McClean, Colin J.; Veron, John E. N.; Hawkins, Julie P.; Allen, Gerald R.; McAllister, Don E.; Mittermeier, Cristina G.; Schueler, Frederick W.; Spalding, Mark; Wells, Fred; Vynne, Carly (15 February 2002). \"Marine Biodiversity Hotspots and Conservation Priorities for Tropical Reefs\". Science. 295 (5558):1280–1284. Bibcode:2002Sci...295.1280R. doi:10.1126/science.1067728. ISSN 0036-8075. PMID 11847338. S2CID 25927433. Category:Pacific Ocean",
 "title": "Indo-Pacific"
}