{
 "id": "984598",
 "text": "The 1925-26 Austrian Cup was the cup competition in Austrian football. == Fourth round == First round with teams from the Second league Phoenicia waived the drawn home advantage. Baumgarten waived the drawn home advantage. International was eliminated from the cup competition by association decision. According to the federation, International came to this game as a suspended Club, which was not entirely true given the reasons for the suspension (missing payments to the association) were previously eliminated, but due to the slowness in the ssociation, the suspension itself is not. ==Fifth round== First round with teams from the highest league Brigittenauer AC waived the drawn home advantage. Change of place to Admiraplatz contrary to the draw, as the game had to take place in a first-class stadium. Change of place contrary to the draw, as the game had to take place in a first-class stadium. When the game started, only 6 Hakoah players were present (after a banquet the night before were missing 5 players). The game was played as a friendly and verified 3-0 for Lyon. SC Baumgarten waived the drawn home advantage. WAF waived the drawn home advantage. ==Round of 16== After three cancellations because Lyonplatz was unusable, Lyon did not play on March 11, 1926 and did not accept another weekday appointment. The reason given was that the team was not able, as an amateur team, to find the players during the week. ==Quarter finals== Cancellation in the 114th minute due to darkness. *Replay match: ==Semi- finals== ==Final== *First Vienna FC: Wilhelm Maresch - Karl Rainer - Josef Blum - Otto Kaller - Leopold Hofmann - Ignaz Ludwig - Florian Pribila - Antonin Bulla - Friedrich Gschweidl - Antal Sziklossy - Otto Fischer coaches: Schikola/Ferdinand Fridthum *Wiener Amateur SV: Theodor Lohrmann - Viktor Blizenec - Johann Tandler - Friedrich Briza - Karl Schneider - Karl Geyer - Wilhelm Morokutti - Kalman Konrad - Viktor Hierländer - Gustav Wieser - Matthias Sindelar coaches: Willy Ehrlich/Jenö Konrad/Gustav Lanzer ==References== Category:Austrian Cup Category:1926 in sports Category:1920s in Austria Category:1925 in sports Category:1926 in Europe",
 "title": "1925–26 Austrian Cup"
}