{
 "id": "984723",
 "text": "Herman Plugge (1939 — 22 December 2022) was a Dutch mountaineer. He was named pioneer and the Father of the House of Dutch mountain climbing. As alpinist, he was expedition leader of many climbing expeditions, including to the Soviet Union and Afghanistan and was expedition leader of the known Mount Everest expeditions in 1982 and 1984. To honor remarkable achievements of Dutch climbers, he founded the “Herman Plugge Irish Coffee Award”. The award is continued after his death by the Dutch climbing federation. ==Expeditions== He was expedition leader of the expedition to the Caucasus Mountains in 1967 with four friends. It was in the Soviet Union during the Cold War and they were even followed by the police. It was a successful expedition, in which not only the mountain top of Elbrus was reached, but also the technically much more challenging north peak of Ushba (4698 meters) via the northern side. He did an expedition to the Annapurna in 1977. Plugge was expedition leader of the expedition to the Himalayas to climb the Mount Everest in 1982. The mountain top was never reached by a Dutch person. The expedition was a failure. They didn’t reached the top. Besides of that, television cameras recorded that they had many arguments. An argument over who had robbed a can of nuts became known. A second expedition to the Mount Everest was organized and led by Herman Plugge in 1984. they climbed this time the mountain from the side of Nepal. Bart Vos claimed to be the first Dutchman who reached the top. However, this ascent is no longer internationally being recognized. ==Dutch climbing federation== Herman was an honorary member of the Dutch royal climbing federation (NKBV) and was awarded the NKBV Lifetime Achievement Award. He received the award for everything he did for the NKBV. Next to leading expeditions, he was a board member of the KNAV, organized training courses and led the Commission for Expeditions and Alpine Top Sport. ==Further reading== A long interview with Plugge was published in “Hoogtelijn” in 2010. A two story podcast of Plugge named “Sisyphus” was made in 2021 (part 1) and 2022 (part 2). ==References== Category:1939 births Category:2022 deaths Category:Dutch sportspeople Category:Mountain climbers",
 "title": "Herman Plugge"
}