{
 "id": "984887",
 "text": "Inhalant is the name for the type of chemicals that cause intoxication and a number of adverse effects when used. When a chemical or solvent is inhaled for abuse or fun it is a type of drug called an inhalant. Using drugs this way might be called \"sniffing\", \"huffing\" or \"bagging\" in some places. The drugs, which are not made to be safe or used in this way, include household or industrial chemicals. Effects can vary but usually include: euphoria, depression, hallucinations, fainting, spasms, nerve damage, organ damage, or death when used. While a person is high on inhalants, they are at risk of hurting themselves because of their altered state of mind. Because they are cheap and offer a potential high, and a from lack of other options such as illegal drugs, adolescents or adults may often use them recreationally. Many solvents contain substances. Usually, solvents that are used in the household are easy to get. In many cases, the effects come quickly but last only a few minutes and have to be used repeatedly to stay high. When taking inhalants, fumes are inhaled at room temperature, or from compressed canisters of the chemical. These include glue, nail polish remover, paint thinner, jenkem, lighter fluid, or pressurized aerosol can fumes (like canned air horns). It does not include drugs that are sniffed after burning or heating such as tobacco, cannabis, or crack cocaine, even though these drugs are inhaled as smoke or vapor. Products which are used as inhalants are often legal, but their sale to people under the age of 18 is restricted or banned, and sellers are expected to look for the signs of a product being purchased to be abused. In some countries, certain inhalants are banned. Even though inhalant drugs are often used outside of hospitals to get high, they still have legitimate applications in medical applications such as in a surgery room with different forms of nitrous (like NO). In the past, chemicals like chloroform were used in surgery for pain relief and anaesthesia. These have been replaced by other (safer) inhalants, and the use of nitrous has come a long way in medicine since it was first used. == References == Category:Drugs",
 "title": "Inhalant"
}