{
 "id": "984981",
 "text": "Mazyr or Mozyr (, ; Mozyr , , Yiddish: מאזיר) is a city in the Gomel Region of Belarus on the Pripyat River. It is about east of Pinsk and northwest of Chernobyl. It is located at around . The population is 111,770 (2004 estimate). The total urban area, including the town of Kalinkavichy across the river, has a population of 150,000. Mazyr is known as a center of oil refining, salt extraction, machine building, and food processing in Belarus. It is home to one of the largest oil refineries in Belarus. This refinery pumps out 18 million metric tons per year, and is served by a tram line. The Druzhba pipeline carries crude oil from Russia, splitting in two at Mazyr. One pipeline branch is directed into Poland and the other one to Ukraine. == Population == Year Total Population Jewish population % Jewish Notes 1897 8076 5631 69.73% Russian Census of 1897 1927 14300 ~6000 42% Soviet Census of 1927Belarys.by site about Mozyr 1939 17500 6307 36.04% Jewish population just before World War IIJewishgen.org Ghettos of Gomel district 1970 48000 4300 8.96% Soviet Census of 1970. The Jewish population fell due to Holocaust and migration to bigger cities as Minsk, Moscow and Leningrad after World War II Jewish Heritage Research Group in Belarus. 1979 105882 3600 3.40% Soviet Census of 1979. The Jewish population fell due to the emigration of Soviet Jews to Israel and the United States 1989 128000 3200 2.50% Soviet Census of 1989. The Jewish population fell due to the emigration of Soviet Jews to Israel and the United States 1999 114000 565 0.50% The Jewish population fell due to the emigration of Soviet Jews to Israel and United States 2004 111500 <500 0.45% == Twin towns – sister cities == Mazyr is twinned with: * Chojnice, Poland * Severodvinsk, Russia == Notable people == * Siarhiej Dubaviec (b. 1959) – Belarusian journalist and writerДубавец Сяргей Іванавіч * George de Mohrenschildt⁣ – geologist and friend of Lee Harvey Oswald * Isaac Don Levine was born there * Zbigniew Morsztyn⁣ – Polish nobleman of Leliwa coat of arms, poet of the Baroque era, soldier, member of the Polish Brethren, Miecznik of Mazyr. Cousin and co-worker of Jan Andrzej Morsztyn. * Ksenia Sitnik⁣ – singer and winner of the Junior Eurovision Song Contest 2005 * Dzyanis Laptsew⁣ – footballer * Hesya Helfman⁣ – member of Narodnaya Volya, who was implicated in the assassination of Tsar Alexander II == References == == Other websites == * Satellite photo of Mazyr (from Google Maps). Ravines can be seen very clearly. * Mazyr town at Radzima.org * FC Slavia-Mozyr Official Site - www.slaviya.info * FC Slavia - www.slavia-mozyr.com * Сайт горада Мазыр * Cities of Belarus:Mozyr * International Festival 'Hey, Rocknem!' * The murder of the Jews of Mazyr during World War II, at Yad Vashem website Category:Cities in Belarus Category:Gomel Region",
 "title": "Mazyr"
}