{
 "id": "984951",
 "text": "Yuzhno-Sakhalinsk (, literally \"South Sakhalin City\") is a city on Sakhalin island. It is also the administrative center of Sakhalin Oblast, Russia. It is in the Far East part of Russia. It is north of Japan. Gas and oil extraction and processing are the main industries of the island. It was named Vladimirovka () from 1882 to 1905, then when Imperial Japan controlled it from 1905 to 1946. As of the 2010 Census, its population was 181,728. == History == Yuzhno-Sakhalinsk started as a small Russian settlement called Vladimirovka. It was founded by convicts in 1882. In the Treaty of Portsmouth in 1905, the southern part of Sakhalin was given to Japan. This treaty ended the Russo- Japanese War of 1904–1905. Because Vladimirovka was in southern Sakhalin, it was given to Japan. Vladimirovka was renamed Toyohara (meaning \"bountiful plain\" in Japanese). During the Soviet–Japanese War within World War II, the city was taken by Soviet soldiers. After the war, it was given to the Soviet Union. It was renamed Yuzhno-Sakhalinsk and given town status in 1946. File:Vladimirovka.gif|Early days of Vladimirovka File:Japanese SL D51-22.jpg|This Japanese D51 steam locomotive stands outside the Yuzhno- Sakhalinsk Railway Station File:Католическая церковь в Южно-Сахалинске. (1).JPG|Catholic church in Yuzhno-Sakhalinsk == Demographics == === Population === Year Population 1959 85,510 1970 105,840 1979 139,861Всесоюзная перепись населения 1979 г. Национальный состав населения по регионам России [All Union Population Census of 1979. Ethnic composition of the population by regions of Russia] (XLS). Всесоюзная перепись населения 1979 года [All-Union Population Census of 1979] (in Russian). 1979 – via Demoscope Weekly (website of the Institute of Demographics of the State University—Higher School of Economics. 1989 159,299 2002 175,085 2010 181,728 Most citizens are ethnic Russians, but there is also many Korean Russians. There are also smaller numbers of indigenous minorities, such as Ainu, Nivkhs and Oroks. == Geography == The city is on the Susuya River. It is the largest city on Sakhalin. It is the only one with more than 100,000 inhabitants on the island. == Twin towns and sister cities == Yuzhno-Sakhalinsk is twinned with: * Asahikawa, Japan * Hakodate, Japan * Wakkanai, Japan * Yanji, China * Ansan, South Korea == References == == Other websites == * Official website of Yuzhno-Sakhalinsk * Yuzhno-Sakhalinsk: City's History in Architecture * Yuzhno-Sakhalinsk Blizzard Photos Category:Capitals of oblasts of Russia Category:Sakhalin Oblast",
 "title": "Yuzhno-Sakhalinsk"
}