{
 "id": "984915",
 "text": "Antinous (; ; – ) was a young Greek man from Bithynia and a favourite and likely lover of the Roman emperor Hadrian. Following his death aged eighteen, Antinous was deified (made into a deity) on Hadrian's orders, being worshipped in both the Greek East and Latin West, sometimes as a god () and sometimes as a hero ().Renberg, Gil H.: Hadrian and the Oracles of Antinous (SHA, Hadr. 14.7); with an appendix on the so-called Antinoeion at Hadrian's Villa and Rome's Monte Pincio Obelisk, Memoirs of the American Academy in Rome, Vol. 55 (2010) [2011], 159–198; Jones, Christopher P., New Heroes in Antiquity: From Achilles to Antinoos (Cambridge, Massachusetts & London, 2010), 75–83; Bendlin, Andreas: Associations, Funerals, Sociality, and Roman Law: The collegium of Diana and Antinous in Lanuvium (CIL 14.2112) Reconsidered, in M. Öhler (ed.), Aposteldekret und antikes Vereinswesen: Gemeinschaft und ihre Ordnung (WUNT 280; Tübingen, 2011), 207–296. Little is known of Antinous's life, although it is known that he was born in Claudiopolis (present day Bolu, Turkey), in the Roman province of Bithynia. He was probably introduced to Hadrian in 123, before being taken to Italy for a higher education. He had become the favourite of Hadrian by 128, when he was taken on a tour of the Roman Empire as part a group of people accompanying Hadrian. Antinous accompanied Hadrian when he attended the yearly Eleusinian Mysteries religious rites in Athens, and was with him when he killed the Marousian lion in Libya, an event highly publicised by the Emperor. In October 130, as they were part of a flotilla (group of small warships) going along the Nile, Antinous died amid mysterious circumstances. A number of suggestions have been put forward for how he died, ranging from an accidental drowning to an intentional human sacrifice or suicide. After his death, Hadrian deified Antinous and founded an organised cult devoted to his worship that spread throughout the Roman Empire. Hadrian founded the city of Antinoöpolis close to Antinous's place of death, which became a cultic centre for the worship of Osiris-Antinous. Hadrian also founded games in commemoration of Antinous to take place in both Antinoöpolis and Athens, with Antinous becoming a symbol of Hadrian's dreams of pan- Hellenism. The worship of Antinous proved to be one of the most enduring and popular of cults of deified humans in the Roman Empire, and events continued to be founded in his honour long after Hadrian's death. Antinous became a symbol of male homosexuality in Western culture, appearing in the work of Oscar Wilde and Fernando Pessoa.. ==Notes== ==References== === Bibliography === * * * * * * * Category:Roman people Category:110s Category:130s deaths",
 "title": "Antinous"
}