{
 "id": "984948",
 "text": "Primus are an American rock band. It was made in El Sobrante, California in 1984. The people that made Primus were bassist and singer Les Claypool and guitarist Todd Huth. The band's first drummer was Vince Parker. Jay Lane replaced Parker. Lane and Huth left the band in 1989. Guitarist Larry LaLonde and drummer Tim Alexander replaced them. As of 2022, Primus has made nine studio albums. The band's most popular albums are Sailing the Seas of Cheese (1991), Pork Soda (1993), and Tales from the Punchbowl (1995). The band has had two albums certified platinum by the RIAA. Pork Soda and Tales from the Punchbowl went into the top ten on the Billboard 200, an American music chart. Sailing the Seas of Cheese was their first popular album. It had a popular single named \"Jerry Was a Race Car Driver\". Primus has made other popular songs, such as \"My Name Is Mud\", \"Wynona's Big Brown Beaver\", and \"John the Fisherman\". The band took a break in 2000. They started making music again in 2003. They did not make another album until Green Naugahyde in 2011. Since then, Primus has made two more albums. == History == === The band starts, Frizzle Fry (1984–1990) === The band started in El Sobrante, California in 1984, under the name Primate. It was made by Les Claypool and Todd Huth. They used a drum machine, as the band didn't have a drummer at the time. They used the machine until Vince Parker, Claypool's friend, joined the band. Parker played the drums for the band. The three of them made a demo. After making the demo, they changed the band's name to Primus. This was because a band named the Primates said they would sue them for using a similar name. After making the demo, Primus had many different drummers. None of them stayed in the band for a long time. In 1988, Jay Lane started playing the drums for the band. The band made a demo named Sausage. Later, Lane and Huth left the band. Huth wanted to be with his family more, and Lane was making other music. Primus stopped making music. Claypool joined Blind Illusion. This was a band he had already been in. The guitarist for Blind Illusion was Larry LaLonde. Claypool asked LaLonde if he wanted to join Primus. LaLonde joined Primus, and the band started again. Tim Alexander joined the band to play the drums. After a month, they made their first album. It was named Suck on This. It was a live album with music from the band's concerts.Illustrated Discography, Animals Should Not Try to Act Like People DVD, 2003. In 1990, the band made Frizzle Fry. It was their first studio album. The band became more popular because of the album. They also became more popular because they went on a concert tour with Jane's Addiction. Large record labels noticed that the band was getting popular. Primus joined Interscope Records in 1990. === Popular albums (1991–1996) === The band released their second album in 1991. It was named Sailing the Seas of Cheese. Two singles from the album had music videos that were shown on MTV. These were \"Jerry Was a Race Car Driver\" and \"Tommy the Cat\". The album was certified gold by the RIAA. Primus went on tour with many bands, such as Rush, U2, Fishbone, Public Enemy, and Anthrax. Primus was in the movie Bill & Ted's Bogus Journey. They played music in it. They also made a song for a Beavis and Butt-Head album. In 1992, Primus made an extended play (EP) of cover songs. It was named Miscellaneous Debris. A song from the EP named \"Making Plans for Nigel\" was played on the radio many times. It went onto the Billboard charts. In 1993, Primus released their third album. It was named Pork Soda. It went into the top 10 on the Billboard 200 music chart. It had a popular single named \"My Name Is Mud\". The band played music to Lollapalooza in the same year. They were the main band at Lollapalooza. They also played music at Woodstock '94.Primus' Les Claypool Talks Woodstock '94, 20 Years Later billboard.com When they started playing \"My Name Is Mud\" at Woodstock, people threw mud at the band. The band stopped playing music, and Claypool said \"the song is called 'My Name Is Mud', but keep the mud to yourselves you son-of-a-bitch\". Claypool, Todd Huth, and Jay Lane made a band in 1994. It was named Sausage. Its name came from Primus' first demo. They made an album named Riddles Are Abound Tonight. Primus released their fourth album in 1994. It was named Tales From the Punchbowl. The album has Primus' most successful single. It is named \"Wynona's Big Brown Beaver\". The single was nominated for a Grammy Award. The song's music video shows the band dressed in cowboy clothes. The band played music on the Late Show with David Letterman and Late Night with Conan O'Brien. Later, Claypool made an album by himself. It was named Highball with the Devil. Many other musicians helped him make the music for it. === Brown Album and Antipop (1997–2000) === Tim Alexander left the band. Bryan Mantia replaced him.Interview with Primus taken from BAM magazine, July 11, 1997. Retrieved October 22, 2012. Mantia was the new drummer. In 1996, Primus made the theme song for South Park. They also made other music for the show. Brown Album was released in 1997. It had two singles. After the album was released, Primus went on the first SnoCore concert tour. They went with bands such as Blink-182 and the Aquabats. The band released an extended play named Rhinoplasty. It had cover songs and live songs on it. A video version of Rhinoplasty was also made. It was named Videoplasty. The band released their sixth album in 1999. It was named Antipop. Many popular musicians helped make the music on the album. Some of these musicians were Tom Waits, Fred Durst, Tom Morello, and James Hetfield. Some critics said the album sounded similar to nu metal. Nu metal was popular at the time. The band went to Ozzfest (a music festival) after the album was released. They made a music video for \"Lacquer Head\". This was a song from the album. It was not shown on MTV. This was because it showed illegal drugs. The song did not support using illegal drugs. In 2000, Primus made a cover version of \"N.I.B\". This was a song made by Black Sabbath. It was put on a tribute album for Black Sabbath. === The band takes a break (2000–2009) === The band did not make any music from 2000 to 2003. Claypool said that making music in Primus \"wasn't fun anymore\". Tim Alexander played with many bands during the break. He played music with bands such as A Perfect Circle and the Blue Man Group. Claypool made his own band named Oysterhead. The other members of the band were Stewart Copeland and Trey Anastasio. He also made Colonel Claypool's Bucket of Bernie Brains. This was a band with Mantia, Buckethead and Bernie Worrell. In 2003, Primus started making music again. Mantia did not play the drums for the band. Alexander joined the band again to play the drums. They made an EP with five songs on it. They also made a DVD with videos from concerts and music videos on it. The band sold the EP and DVD together. The release was named Animals Should Not Try to Act Like People. The band played at concerts for two months. In 2004, they kept going to concerts. They recorded their concert in Chicago. The video was released as Hallucino- Genetics: Live 2004. The band played at Lollapalooza in 2005. Claypool made a new music group named Les Claypool's Fancy Band. This band played music at some concerts. The song \"John the Fisherman\" was put on Guitar Hero II. === Green Naugahyde (2010–2013) === Jay Lane joined the band again in 2010. The band went on a concert tour with bands such as Wolfmother. They said they went on the tour to get ready to make another album. When they said this, the Primus website was changed. It showed an elevator with a sign that said \"Primus will be with you shortly\". In 2011, Primus released an extended play. It was named June 2010 Rehearsal. It had four songs on it. It was released for free on the band's website. The songs are new versions of music the band already made. The music has Lane playing the drums. Rock Band 3 was released in 2010. \"Jerry Was a Race Car Driver\" is a song on the game. The band went on a concert tour in the same year. The band went on the television show Jimmy Kimmel Live! to talk about the concert tour. In March 2011, Claypool said the band's next album was going to be released around May 2011. He also said the music on it was similar to Frizzle Fry.Primus Interview - The Knave interviews for BEAT TV at The Melbourne Soundwave 2011 . March 7, 2011. Retrieved May 1, 2011. In May, the band said the album was finished. It was named Green Naugahyde. It was released in September. === The Chocolate Factory and The Desaturating Seven (2013–now) === In 2013, Lane left Primus. Lane wanted to play music as a member of RatDog. Tim Alexander joined Primus to play the drums. Claypool also said the band was talking about making an album in November. In December, Alexander said the band was working on new music. The first Primus concert with Alexander was on New Year's Eve in 2013. The band played two sets at the concert. In the first, they played Primus music. In the second, they played with the \"Frog Brigade\". They played the soundtrack of the movie Willy Wonka & the Chocolate Factory (1971). The band made a studio album after the concert. It was a studio version of the soundtrack. It was named Primus & the Chocolate Factory with the Fungi Ensemble. It was released in October 2014. In 2015, the band made a music video for \"Candyman\". This is a song on the album. On July 31, 2017, Primus said they were making a new album. It was named The Desaturating Seven. The album's first single was released on that day. It is named \"The Seven\". The album was released on September 29, 2017. The band also went on many concert tours. The band played the whole album during a concert in 2018. Primus went on tour with Slayer in 2019. It was Slayer's last tour. == Studio albums == * Frizzle Fry (1990) * Sailing the Seas of Cheese (1991) * Pork Soda (1993) * Tales from the Punchbowl (1995) * Brown Album (1997) * Antipop (1999) * Green Naugahyde (2011) * Primus & the Chocolate Factory with the Fungi Ensemble (2014) * The Desaturating Seven (2017) == References == Category:American heavy metal bands Category:Musical groups established in 1984 Category:Musical trios",
 "title": "Primus"
}