{
 "id": "984963",
 "text": "The Battle of Svatove is a current battle between Russia and Ukraine over the eastern Ukrainian city of Svatove. It is part of the Russo-Ukrainian War and the 2022 Russian invasion of Ukraine and part of the Battle of the Svatove- Kreminna line. The battle began on October 3, 2022, a day after the Ukrainian army recaptured the town of Lyman in Donetsk Oblast. == Background == During the 2022 Russian invasion of Ukraine, Svatove was occupied by Russian and Luhansk People's Republic forces on 6 March 2022. In early September 2022, it was reported that Russian forces were leaving the city. This was because of a Ukrainian counteroffensive in Kharkiv Oblast. However, Russian troops had came back by 14 September. After Putin announced partial mobilization on 21 September, some of the newly recruited conscripts were sent to Svatove to the front line after only 2 days of training at most to counter Ukrainian advances. Russian forces mined all roads leading to Svatove and Kreminna to defeat Ukrainian advances. == Battle == After the Ukrainian recapture of Lyman on October 2, Ukrainian forces went towards the Kharkiv-Luhansk oblast borders. On October 3, they took back Borova and the nearby town of Shyikivka. To the south, Ukraine took back the villages of Izyumske and Druzhelyubivka on the border of Kharkiv and Luhansk oblasts. To the north of Borova, Ukrainian forces took back Bohuslavka and Borivska Andriivka. To the east, Ukrainian forces also took Hrekivka and Makiivka. On October 9, Ukrainian forces took back Kruhlyakivka. Between October 9 and 13, Ukrainian forces made small advances into Luhansk Oblast. They took back the villages of Novolyubivka, Nevske, Novoiehorivka, Nadiia, and Andriivka, all southwest of Svatove. In the north, Ukrainian forces took back Krokhmalne. By October 24, Ukrainian forces had taken back Kamazynivka, Myasozharivka, and Nevske in Luhansk Oblast, and Novosadove in Donetsk Oblast. On the night of 2 November, Ukrainian sources claimed to have destroyed an entire Russian battalion near the town of Makiivka, in Svatove Raion. The offensive and battle slowed down during November, but it still continues. == References == Svatove Category:October 2022 events Category:November 2022 events Category:Luhansk Oblast",
 "title": "Battle of Svatove"
}