{
 "id": "985048",
 "text": "Polow-Freache Jamal Fincher JonesShepherd, Julianne (March/April 2008). Polow Da Don: Back for the First Time . Scratch magazine. Accessed June 4, 2008.Hope, Clover (June 2007). \"I'm Fresh\". XXL magazine, p. 70. (born October 15, 1977 or 1978), known by his professional name Polow da Don, is an American record producer and rapper. He rose to fame in late 2005 and early 2006 through hit singles by musicians such as Ludacris, Will Smith, Jamie Foxx, Ciara, Kelly Rowland, Fergie, Rich Boy, Kelis, Nas, Usher, Nelly, G-Unit and Mario. ==Early life== Polow was born and raised in Atlanta, Georgia. His mother was born in Japan.Renee, Fawn (August 29, 2007). Features / DJs Producers : Polow Da Don: Talks To Black Women. AllHipHop. Accessed June 4, 2008. As a teenager in the mid-1990s, Polow listened to groups such as UGK, the Geto Boys, and 8Ball & MJG. His younger sister, Karesha, helped him learn to play the keyboards and use MPC equipment. Polow played football and basketball for the Mount Vernon Christian Academy prep school. After earning good grades, he enrolled in Morehouse College. While in the middle through a bachelor's degree in accounting, he left college to pursue a rap career with his rap group Jim Crow. ==Career== The group signed to Sony Records in 1999, where they released two albums, Crow's Nest (1999) and Right Quick (2001), before being dropped. Though disappointed, Polow formed a Southern hip hop group with Bubba Sparxxx, Sean P, Pastor Troy, G Rock, and Timbaland. However, they also parted ways without any releases. Polow started making beats around 2001. His first beat tape of his came to Interscope Records president Jimmy Iovine. The beats were eventually used for the tracks \"Runaway Love\" by Ludacris, \"Buttons\" by the Pussycat Dolls, and \"This Is the Life\" by Tru-Life. ==References== Category:1978 births Category:Living people Category:21st- century American rappers Category:American hip hop musicians Category:American record producers Category:Rappers from Atlanta",
 "title": "Polow da Don"
}