{
 "id": "985136",
 "text": "Aaron Elliott (born September 20, 1968), better known as Aaron Cometbus, is an American drummer, lyricist, self-described \"punk anthropologist\" and author of punk rock zine Cometbus. Born in Berkeley, California, Aaron Cometbus began writing zines in 1981 with Jesse Michaels of Operation Ivy, and started his own after Jesse moved to Pennsylvania in October 1981. Aaron became an active participant in the Gilman Street Project and was a founding member of Crimpshrine, a highly influential punk rock band from the East Bay, which also featured Jeff Ott. After Crimpshrine's demise, Aaron formed Pinhead Gunpowder with a handful of people from the East Bay punk scene, including Mike Kirsch, Jason White and Billie Joe Armstrong of Green Day. Aaron has also played in a multitude of short-lived bands that usually only release a seven inch or two before breaking up, some of which include Astrid Oto, Cleveland Bound Death Sentence, Scooby Don't, Shotwell Coho, The Blank Fight, which includes Rymodee of This Bike Is A Pipe Bomb, EFS, Redmond Shooting Stars, Mundt and The Retard Beaters, T. Zatana, Colbom, and Harbinger, which also includes Robert Eggplant, formerly of Blatz, and John Geek of Fleshies. He briefly played drums in SF's anarcho-syndicalist group, Strawman. He has been known to sit behind the This Bike Is A Pipe Bomb kite from time to time. ==Band history== *S.A.G. (East Bay CA; 1982-1984) *Crimpshrine (East Bay CA; 1984-1989) *Sweet Baby (AKA Sweet Baby Jesus) (East Bay/Northern CA; 1989-1990) *Pinhead Gunpowder (East Bay CA; 1991-2001; 2008) *Mundt (Northern CA; 1992) *Shotwell (San Francisco CA; AKA Shotwell Coho) (1994) *EFS (Berkeley CA; 1995) *Cosmetic Puffs (Eureka, Ca; 1995) *Redmond Shooting Stars (Seattle WA; 1995-1996) *Cleveland Bound Death Sentence (Minneapolis MN; 1997-1998; 2004) *The Retard Beaters (Chattanooga, TN; 1997-1998) *Harbinger (East Bay CA; 1998-1999) *The Blank Fight (Pensacola FL; 1999-2000) *Astrid Oto (Asheville NC; 1999-2001) *Colbom (San Francisco CA; 2001) *End of the World News (New York; 2002-2003) *Crybaby MacArthur (Brooklyn NY; 2004-2006) *The Thorns of Life (Brooklyn NY; 2008-2009) *Sub Rosa (Brooklyn NY; 2020-2022) Category:Living people Category:American rock drummers Category:American short story writers Category:Musicians from Berkeley, California Category:Jewish American writers",
 "title": "Aaron Cometbus"
}