{
 "id": "985212",
 "text": "\"Radioactive\" is a song by American pop rock band Imagine Dragons. It is from their major-label debut EP Continued Silence and later on their album, Night Visions (2012). It was first sent to modern rock radio on October 29, 2012. \"Radioactive\" is an electronic rock and pop rock song with parts of dubstep. In a 2021 podcast interview called The Turning Point, Dan Reynolds said that he had seen that the lyrics were actually about him not giving up hope after losing faith in Mormonism. The song got positive reviews from critics. They praised the production, lyrics, and vocals. Because of high usage on many commercials and trailers, the song became a sleeper hit. It got to number three on the US Billboard Hot 100 chart and became the band's first top 10 single. It was also the third best selling song in the United States in 2013. It also held the record for most weeks spent on the Billboard Hot 100 at 87 weeks, a record for 7 years. The song has also reached number one in Sweden and in the top 20 in many countries including Australia, Canada, New Zealand and the United Kingdom. It became Imagine Dragons' most successful single to date. It has since been certified Diamond by the RIAA. It is one of the best selling singles of all time. \"Radioactive\" got two Grammy Awards nominations for Record of the Year and Best Rock Performance. It won the award for Best Rock Performance. This was Imagine Dragons' first time being nominated. It has a music video that came out on December 10, 2012. As of December 2021, the music video has over 1.4 billion views on YouTube. It is the group's third most viewed video. It also has over 9 million likes. == Composition == \"Radioactive\" was written by Imagine Dragons and producer Alex Da Kid. It is one of the more electronic tracks on Night Visions. It is also one of the darkest on the album. The song is an electronic rock and alternative rock song with parts of dubstep. The song's lyrics have apocalyptic and revolutionist themes. Examples for these themes from the lyrics are: 'I'm waking up to ash and dust' and 'This is it, the apocalypse'. Though the band has publicly kept its secularity, NPR music critic Ann Powers has said that the song has strong \"religious or spiritual imagery\". This imagery has, however, been common throughout the history of rock music. Speaking on the song, lead singer Dan Reynolds said: == Critical reception == \"Radioactive\" was released to positive reviews. AbsolutePunk gave it a positive review, saying that the acoustic part of the song was \"haunting\". They also said the chorus was \"hypnotizing\". Dara Hickey of Unreality Shout also reviewed it positively. She said the song was the \"darkest moment\" on the album. She also said that, like all the other songs on the album, \"Radioactive\" was successful in creating a sound that \"never fails to take off and send fists skyward\". IGN said that the song was \"strangely intense and abrasive\". They said that \"Radioactive\" was \"perhaps the greatest calling card of Imagine Dragons\". Crave Online said the song was an \"opening throb\", saying that the song \"sexes up the dub-flirtation with a verse hingeing on the line 'this is it, the apocalypse' and a triumphant chorus, with more than a few shades of Hip-Hop in the production\", and that the song was as \"radio-ready as they come\". Our Vinyl said that the \"power of this song is outstanding with heavy drums and more of an electronic feel than the rest of the album and strong, impressive vocals from front-man Dan Reynolds which are reciprocated throughout the LP.\" Jon Dolan of Rolling Stone was critical of the song, saying it was \"a dour moaner that sound[s] like Chris Martin trying to write an Eminem ballad about the end of the world.\" In 2018, Billboard ranked the song number two and Louder Sound number one on their lists of the 10 greatest Imagine Dragons songs. It is also on the soundtrack for NBA 2K14, the first NBA 2K game on PlayStation 4 and Xbox One. == Credits == From Night Visions liner notes. Imagine Dragons *Dan Reynolds – lead and backing vocals *Wayne Sermon – guitars, backing vocals *Ben McKee – synthesizers, bass guitar, backing vocals *Daniel Platzman – drums, drum machine Additional musicians *J Browz – guitar Additional personnel *Alexander Grant – co-writer, producer *Josh Mosser – co-writer *Manny Marroquin – mixing *Joe LaPorta – mastering == Remixes and covers == \"Weird Al\" Yankovic recorded a parody of the song named \"Inactive\" for his 2014 album Mandatory Fun. \"Radioactive\" was covered by American violinist Lindsey Stirling with Texan a cappella group Pentatonix and uploaded to Stirling's YouTube channel, becoming very successful and as of December 2018 has over 170 million views. The recording earned a 2013 YouTube Award. Jason Derulo covered the song live on BBC. Daughtry covered the song live on SiriusXM. Lady Antebellum covered the song live backstage on their Take Me Downtown Tour and put the video on their YouTube channel. Jake Bugg covered the song live on BBC Radio 1. Radioactive (The Dirty Tees Remix) featured on the film The Host's soundtrack. American production duo Synchronice released a melodic dubstep remix of the song which accumulated over 20,000,000 plays on YouTube and over 15,000,000 plays on their own SoundCloud page. Dutch symphonic metal band Within Temptation recorded a version on their cover album The Q-Music Sessions released in April 2013 and released again on their album Hydra. American post-hardcore band Our Last Night covered the song. Masha covered \"Radioactive\" on her popular YouTube channel on May 25, 2013. The video has received 130,000 views as of December 2018. The Radioactive Chicken Heads recorded a punk rock cover of \"Radioactive\" and released a music video for their version on YouTube. Ed Kowalczyk (of Live) covered the song for an Australian radio station. Country music artist Dallas Smith covered the song on his Tippin' Point tour. Independent American singer Madilyn Bailey recorded an acoustic cover that reached number 36 on SNEP, the official French singles chart, in June 2015. Kelly Clarkson covered the song as part of her \"Fan Requests\" on July 12, 2015, during her Piece by Piece Tour. Welsh Metalcore band Bullet for My Valentine recorded a cover in 2018 on their sixth studio album Gravity. In 2022, Just Dance 2023 Edition was released with Radioactive as one of its playable tracks. == Charts == ===Weekly charts=== Weekly chart performance for \"Radioactive\" Chart (2012–15) Peak position Lebanon (Lebanese Top 20) 13 Slovenia (SloTop50) 33 ===Year-end charts=== 2012 year-end chart performance for \"Radioactive\" Chart (2012) Position Sweden (Sverigetopplistan) 72 2013 year-end chart performance for \"Radioactive\" Chart (2013) Position Australia (ARIA) 20 Austria (Ö3 Austria Top 40) 14 Canada (Canadian Hot 100) 9 France (SNEP) 96 Germany (Media Control AG) 9 New Zealand (Recorded Music NZ) 7 Sweden (Sverigetopplistan) 15 Switzerland (Schweizer Hitparade) 24 UK Singles (Official Charts Company 30 US Billboard Hot 100 3 US Adult Alternative Songs (Billboard) 22 US Adult Pop Songs (Billboard) 10 US Alternative Songs (Billboard) 1 US Mainstream Top 40 (Billboard) 7 US Rock Airplay (Billboard) 1 US Hot Rock Songs (Billboard) 1 2014 year-end chart performance for \"Radioactive\" Chart (2014) Position Belgium (Ultratop 50 Wallonia) 31 Canada (Canadian Hot 100) 77 France (SNEP) 65 Italy (FIMI) 60 Sweden (Sverigetopplistan) 65 US Billboard Hot 100 57 US Hot Rock Songs (Billboard) 9 2015 year-end chart performance for \"Radioactive\" Chart (2015) Position France (SNEP) 174 ===Decade-end charts=== Decade-end chart performance for \"Radioactive\" Chart (2010–19) Position Australia (ARIA) 55 Germany (Official German Charts) 47 UK Singles (Official Charts Company) 71 US Billboard Hot 100 36 US Hot Rock Songs (Billboard) 3 ===All-time charts=== All-time chart performance for \"Radioactive\" Chart (1958–2018) Position US Billboard Hot 100 142 == Certifications == == Related pages == * Imagine Dragons discography * List of songs recorded by Imagine Dragons == References == == Other websites == * * Kendrick Lamar & Imagine Dragon’s 2014 Grammy Performance * Category:2012 songs Category:Imagine Dragons songs",
 "title": "Radioactive (Imagine Dragons song)"
}