{
 "id": "985257",
 "text": "Anne Savisa Boonchuy ( ; Thai: แอนน์ สาวิสา บุญช่วย) is the main character of the late Disney Channel animated series Amphibia. The character was created by Matt Braly. She is voiced by Brenda Song. The character was first seen in the pilot, \"Anne or Beast?\" She made her final appearance in the series finale, \"The Hardest Thing\". Anne is a Thai-American teenage girl. On her 13th birthday, she is transported magically to Amphibia. Her friends Sasha and Marcy are also transported with here. They are transported by a music box known as the Calamity Box. When she gets to Amphibia, the Plantars (an anthropomorphic family of frogs) find her. Over time, they form a bond. She is also discovered by the town of Wartwood. The frogs of the town let her stay with them. Anne has been well-received. They like her character and Song's performance. They loved her coming of age evolution through the series. == Thai representation == Anne is best known for being the first Thai American lead in an animated series. Matt Braly is also Thai American. He chose to make her Thai American because he wanted more Thai characters in television. According to Braly, Anne was based on his grandmother when she was young. He said that Anne being Thai American was \"a number one priority\", because he wanted Thai American kids to see characters on television that were like themselves. In the third season of the series, Anne returns to Earth. The stories in that season deal more with Anne's Thai heritage. This includes an episode set at a Thai temple in Los Angeles. Braly said that the temple in the episode as \"pretty accurate\". This was because it was important for him to show Thai culture accurately. Anne's last name, Boonchuy (Thai: บุญช่วย), translates to \"one who encourages or performs good deeds\" in the Thai language. This fits her character as she always tries to help the frogs of Wartwood. == References == Category:Disney characters Category:Television characters Category:Animated characters",
 "title": "Anne Boonchuy"
}