{
 "id": "985289",
 "text": "James Samuel \"Jimmy Jam\" Harris III (born June 6, 1959 in Minneapolis, Minnesota) and Terry Steven Lewis (born November 24, 1956, in Omaha, Nebraska) are an American music composing and record producing team in R&B; and pop music. The two have been together for years. They have enjoyed great success since the 1980s with various artists, most notably Janet Jackson. The two met in high school in Minneapolis and formed a band called Flyte Tyme, which became The Time. In 1981, Morris Day joined them and toured with Prince as his opening act. As members of the Time, they recorded three of the group's four albums (The Time, What Time Is It? and Pandemonium. The first two albums are said to have shaped early 1980s R&B; music (featuring \"Cool,\" \"Get it Up,\" \"The Walk,\" \"777-9311,\" and \"Gigolos Get Lonely Too\"). The pair were dropped from the tour because a snowstorm prevented them from reuniting after a short break for produce music for The S.O.S. Band. However, one of the tracks they were producing, \"Just Be Good To Me\", became a huge hit and sealed the duo's reputation, as well that of The S.O.S. Band. The duo re-joined the Time for one album only, 1990's Pandemonium. The duo was noted for their early use of the Roland TR-808 drum machine in English-language popular music, which was used in most of its productions. After working with other artists including Cherrelle, the Human League and Alexander O'Neal, Jam and Lewis met Janet Jackson and produced her breakthrough album Control in 1986, for which the duo won a Grammy Award. Their collaboration on her next album, 1989's Rhythm Nation 1814, was even more successful. The have since founded a record label, Perspective Records (a label distributed A&M;/PolyGram Records that has since closed its doors) and have worked with artists such as Jordan Knight, Michael Jackson, Boyz II Men, Usher, Mary J. Blige and Mariah Carey. In 2000, the two were guest performers for J-pop singer-songwriter Hikaru Utada's Bohemian Summer concert tour in Japan. Terry Lewis married R&B; singer Karyn White, with whom he had a daughter, Ashley Nicole. The couple has since divorced. Jimmy Jam is the president of the National Academy of Recording Arts and Sciences. Category:1981 establishments in the United States Category:American R&B; bands Category:African-American musicians Category:American songwriters Category:American record producers Category:American pop music groups Category:Living people Category:People from Omaha, Nebraska Category:American Grammy Award winners",
 "title": "Jimmy Jam and Terry Lewis"
}