{
 "id": "985291",
 "text": "Miguel Jontel Pimentel (born 23 October 1985), who performs under the mononym Miguel, is an American alternative R&B; artist and producer. Signed to Jive Records in 2007, his debut album All I Want Is You was released in February 2011. The album was preceded by the release of the single \"All I Want Is You\", featuring rapper J. Cole. ==Life and career== ===Early life=== Miguel Jontel Pimentel was born in the San Pedro neighbourhood of Los Angeles, California. He is one of two children born to a Mexican father and a black mother. Miguel's parents divorced when was eight years old. At a young age, Miguel listened to classic rock, hip hop, funk and rhythm and blues. At the age of 13, he began to pursue a career in music. ===Career beginnings and All I Want Is You=== Miguel was first signed to a local record label Drop Squad in 2000, then signed to independent record label Black Ice in 2004. During this period, Miguel had been asked to make music similar to music group B2K. For nearly a year, Miguel's manager at the time submitted various songs to music mogul Mark Pitts; After receiving a song titled \"Sure Thing\", which Miguel described as a \"highly personal...record that no one was ever supposed to hear\", Pitts scheduled a meeting with Miguel in October 2007. The following month, Miguel signed a recording contract with Jive Records. Miguel recalled that his contract signing took place in a \"very small room in a very small office in a small corner of the building at Jive\". Since then, he has contributed to Usher's Here I Stand and Raymond v. Raymond, as well as Asher Roth's Asleep in the Bread Aisle and Musiq Soulchild's \"IfULeave\". Miguel released his debut single titled \"All I Want Is You\", which features J. Cole and was produced by Salaam Remi. Miguel's debut album, All I Want Is You, was released in February 2011. ==References== Category:American funk singers Category:American guitarists Category:American hip hop singers Category:American record producers Category:American R&B; singers Category:Living people Category:Musicians from Los Angeles Category:Singer-songwriters from California Category:1985 births",
 "title": "Miguel (singer)"
}