{
 "id": "985315",
 "text": "King Gizzard & the Lizard Wizard are an Australian rock band. They were made in Melbourne, Victoria in 2010. The band's members are Stu Mackenzie, Ambrose Kenny-Smith, Cook Craig, Joey Walker, Lucas Harwood and Michael Cavanagh. They are known for making many different types of music. They are also known for the large amount of music they have made. As of August 2024, the band has made 26 studio albums and three extended plays (EPs). When the band started, they made music that sounded similar to garage rock. Later, they started making music that sounded more similar to psychedelic rock. Some of their first psychedelic rock albums are Float Along – Fill Your Lungs, Oddments and I'm in Your Mind Fuzz. Other music the band has made has been jazz, progressive rock, thrash metal, folk rock, and funk. The band's first popular album was Nonagon Infinity (2016). The album was made so that when it ended, it looped back to the start. It won an award at the ARIA Music Awards. It was also their first album to go into the top 20 on the Australian albums chart. The album made King Gizzard more popular. In 2017, the band made and released five albums. One of these albums (Polygondwanaland) was put in the public domain. Since then, they have released many more albums. Many of these albums have been released independently. == Music == * Anglesea (EP, 2011) * Willoughby's Beach (EP, 2011) * 12 Bar Bruise (2012) * Eyes Like the Sky (with Broderick Smith, 2013) * Float Along – Fill Your Lungs (2013) * Oddments (2014) * I'm in Your Mind Fuzz (2014) * Quarters! (2015) * Paper Mâché Dream Balloon (2015) * Nonagon Infinity (2016) * Flying Microtonal Banana (2017) * Murder of the Universe (with Leah Senior, 2017) * Sketches of Brunswick East (with Mild High Club, 2017) * Polygondwanaland (2017) * Gumboot Soup (2017) * Fishing for Fishies (2019) * Infest the Rats' Nest (2019) * K.G. (2020) * L.W. (2021) * Butterfly 3000 (2021) * Butterfly 3001 (remix album, 2022) * Satanic Slumber Party (EP, with Tropical Fuck Storm, 2022) * Made in Timeland (2022) * Omnium Gatherum (2022) * Ice, Death, Planets, Lungs, Mushrooms and Lava (2022) * Laminated Denim (2022) * Changes (2022) * PetroDragonic Apocalypse; or, Dawn of Eternal Night: An Annihilation of Planet Earth and the Beginning of Merciless Damnation (2023) * The Silver Cord (2023) * Flight b741 (2024) == References == Category:Australian musical groups Category:Musical groups established in 2010 Category:2010s Australian music groups",
 "title": "King Gizzard & the Lizard Wizard"
}