{
 "id": "985491",
 "text": "83 is a 2021 Indian Hindi language biographical sports movie. It was written and directed by Kabir Khan and produced by Deepika Padukone, Kabir Khan, Vishnu Vardhan Induri, Sajid Nadiadwala, Reliance Entertainment. It was based on the 1983 Cricket World Cup, where the Indian national cricket team won the match. The movie starred Ranveer Singh, Deepika Padukone, Jiiva, Pankaj Tripathi, Tahir Raj Bhasin, Saqib Saleem, Jatin Sarna, Chirag Patil, Dinker Sharma, Nishant Dahiya, Harrdy Sandhu, Sahil Khattar, Ammy Virk, Adinath Kothare, Dhairya Karwa and R. Badree. It premiered at the Red Sea International Film Festival on 15 December and released around the world on 24 December 2021 (Christmas Eve) in conventional 2D and 3D formats. It was distributed by Reliance Entertainment and PVR Pictures in Tamil, Telugu, Kannada and Malayalam languages, apart from the original version. == Cast == * Ranveer Singh as Kapil \"Kuku\" Dev Nikhanj a.k.a. \"Kaps\": The captain of the Indian Cricket Team at the 1983 Cricket World Cup * Jiiva as Krishnamachari Srikkanth aka \"Cheeka\" * Pankaj Tripathi as PR Man Singh: Manager of the Indian Cricket Team at the 1983 World Cup * Tahir Raj Bhasin as Sunil \"Sunny\" Gavaskar a.k.a. \"Little Master\" * Saqib Saleem as Mohinder \"Jimmy\" Amarnath aka \"Jimpa\" * Jatin Sarna as Yashpal \"Yash\" Sharma * Chirag Patil as Sandeep \"Sandy\" Patil aka \"Patla\" * Dinker Sharma as Kirti Azad * Nishant Dahiya as Roger Binny *Harrdy Sandhu as Madan Lal aka \"Madipa\", Annu's Husband * Sahil Khattar as Syed Kirmani aka \"Kiri\" * Ammy Virk as Balwinder Singh Sandhu aka \"Ballu\" * Adinath Kothare as Dilip Vengsarkar a.k.a. \"Colonel\" * Dhairya Karwa as Ravi Shastri * R Badree as Sunil Valson alias \"Vally\" * Deepika Padukone as Romi Dev, Kapil's wife * Neena Gupta as Rajkumari Nikhanj, Kapil's mother * Boman Irani as Farokh Engineer * Rajeev Gupta as Journalist Mishra * Aditi Arya as Inderjit Bhardwaj, Jimmy's wife *Kapil Dev in Special appearance * Samreen Kaur as Simran Singh, Ballu's fiancée * Satish Alekar as Seshrao Krishnarao Wankhede * Wamiqa Gabbi as Annu Lal, Madan's wife * Parvati Nair as Marshneil Gavaskar, Sunil's wife * Mohinder Amarnath as Lala Amarnath, Jimmy's father * Avantika Akerkar as Indira Gandhi * Rukhsar Rehman as Salma Sultan * Ashok Banthia as Rajiv Khanna * Chandramouli Kalyanachakravarthy as Mr. Natarajan * Rajie Sarathy as Mrs. Natarajan * Swetha Vinod as Kalyani Natarajan * Anjum Batra as Kulwant Singh Toor * Happy Sharma as Gill * Jacques Taylor as Sir Vivian \"Viv\" Richards * Carl Greenidge as Gordon Greenidge * Tagenarine Chanderpaul as Larry Gomes * Jason Clive Lloyd as Joel Garner a.k.a. \"Big Bird\" * Baharul Islam as the Major of Indian Army * Orson Nurse as Clive Lloyd * Foozi Artan as Wayne Daniel * Sebastian Burchell as Dave Richardson * Mali Marshall as Malcolm Marshall * Sheryl Bennet as Vidya Srikkanth, Chika's wife * Neil Durand as Kevin Curran *Duncan Fletcher the spectator with a beer glass in his hand when Kapil Dev takes a running catch of Amarnath’s bowling in India vs Zimbabwe match == References == == Other websites == * * 83 on Bollywood Hungama * 83 Review Category:2020s Hindi- language movies Category:2020s Indian movies Category:2020s sports movies Category:2021 movies",
 "title": "83 (movie)"
}