{
 "id": "98545",
 "text": "This is a list of rivers in Assam, India: == A == *Aagrong *Aie Nadi - Starts in Bhutan and flows south. Crosses the NH 31 few Kilometers west of Bijni town and drains into the Brahmaputra. *Akashi Ganga (Akaxi Gonga) - A small river which crosses NH 36 Near Parakhuwa and Haldiati in Karbi Anglong. *Amlong *Amreng == B == *Balijaan *Balisera *Barapani *Bar Dikharu - Starts near Parkup pahar in Karbi Anglong district and flows south. Crosses the NH 36 near parokhuwa town. *Barak (borak) - Starts in the Hills of Manipur and flows through the Barak valley in South Assam.The Barak River is a river of Surma- Meghna River System. From source in Manipur it enters Mizoram then into Assam and thereafter Bangladesh where the Surma and Kushiyara rivers begin after splitting. The river gets a water from small streams like Gumti, Howrah, Kagni, Senai Buri, Hari Mangal, Kakrai, Kurulia, Balujhuri, Shonaichhari and Durduria and Madhura River. The important tributaries of the Barak are Jiri, the Dhaleshwari (Tlawng), the Singla, the Longai, the Madhura, the Sonai (Tuirial), the Rukni and the Katakhal. *Bashistha (Boxistho) *Belsiri - A north bank tributary of the Brahmaputra river. Flows in a North-South direction from source to mouth. It runs parallel to the Gabhoru in the east and Pachnoi in the west *Beki - The river Manas is known as the Beki in its lower reaches. *Bihali - A small river flows near the Bihali Township in sonitpur District (Now Under Bishwanath District). *Boginadi - A north bank river which flows through the Boginadi town and finally drains into the Brahmaputra. *Bornoi - A north bank river, Starts in the Bhutan and drains into the Brahmaputra. The river crosses NH 15 at Dumunichoki. *Bordikorai *Borgang - A north bank river which flows through the Borgang town before reaching the Brahmaputra. *Borlangpher - Starts from the hills of Karbi Anglong and flows in a northerly direction and crosses the railway track between Lumding - Diphu section. *Borola - A small riverlet in the Udalguri district of Assam joins the Bihkhaiti river to form the Nuwa Noi. *Borolia - A north bank river which flows through the Rangia town before reaching the Brahmaputra. *Bhogdoi - A meandering south bank river which flows through the Jorhat town before meeting the Brahmaputra. *Bhorolu--River that goes through Guwahati city and finally drains into the Brahmaputra at Bhorolumukh. *Brahmaputra River--The largest amongst all the rivers flowing through or flowing in Assam. Near Sadiya, rivers Siang (Dihang), Sikang (Dibong) and Lohit meets to form the River Brahmaputra. In Assam, the Brahmaputra is also known as Luit. *Bikhaiti *Burhadiya *Burhi Dihing - A large south bank tributary of the Brahmaputra and about 380 kilometers long. It is formed by the confluence of the Namphuk and the Namchik, which rises from the Patkai ranges and the Maganton river which is the southern branch of the Noadehing. The Namphuk is considered as the principal source of the Buridehing. The river drains into the Brahmaputra at Dihingmukh in Dibrugarh district of Assam. River Disam is a tributary of the Burhi Dihing. *Burhigang *Burhi Ganga - A small riverlet which crosses NH 36 near Doboka and drains into the Jamuna. This river is the western border of Doboka Reserve Forest. *Buri Suti - A westerly-bifurcated branch of Dihang is formed by small river-lets like Debing, Yagalong, Rayang, Je as known in Arunachal joins to form the Buri Suti. *Buroi - A north bank river which flows through the Buroighat before reaching the Brahmaputra. It Runs parallel to the borgang river. *Brahmajan - *Bhur noi == C == *Charikaria - This river flows through Dhakuakhana and Machkhowa in Dhemaji district of Assam. It is also known as Laipulia River. This river receives water from small river-lets, tributaries and dis- tributaries like Harhi River (right bank), Enduria (left bank), Marasuti, Dhakuakhana Jan, Hapotia Jan (tributary of Dhakuakhana Jan) , Singia Jan (tributary of Hapotia Jan), Kharjan, Jogijan, Juria Jan (tributary of Jogijan) and thereafter meets Korha. *Chompaboti - Starts from the Bhutan hills and enters Assam in the Kokrajhar district. It crosses the NH 31 west of Basugaon before meeting the Brahmaputra. == D == *Dangori *Dangdhora *Dehangi - Starts from north of the Borail range and flows through Dima Hasao. *Dekapam - *Deopani - An east flowing river in Karbi Anglong district and drains into the Dhansiri. Famous Temple \"Deopani\" is near the banks of this river. *Deopani - Near Burhapahar *Deoxila *Dhaleshwari - Starts from the hills of Mizoram and enters Assam via Hailakandi district before draining into the Barak from the south. *Dhansiri (dhonxiri) - Starts from Nagaland forming the border between Assam and Nagaland. A very highly meandering river flows through Dimapur town of Nagaland bordering Assam. Joins the Brahmaputra on its south bank after flowing through Golaghat town. *Dhola *Dholaani - goes through Bijni town in lower Assam and drains into the Brahmaputra. *Dhol noi *Dhunaxuti *Dibong - Starts near Keya pass on the Indo-Chinese border in the Dibang Valley district of Arunachal Pradesh. After travelling for approximately 200 kilometers the river finally enters the Lohit near Sadiya from the north. It is one of the Chief contributors to the Brahmaputra. *Dibru - A south bank tributary of the Brahmaputra. Both the river form the boundary of Dibru-saikhowa national park. *Digaru *Diju - Starts in the Hills of Karbi Anglong and flows northward and crosses NH 37 near Amoni and drains into the Kolong from the south. Presently Diju is the main source of water to the kolong. *Dikari - Sidha Korong as known in Arunachal flows in Assam as Dikari. Dikari receives water from small streams like Chipkai, Doge, Pere Korong, Tepong, Yungpi and Pote. After that Dikari joins the Dekapam River, it is then known as Jamjing River. This river splits into two channels: the eastern channel joins the Buri suti and the western channel is known as Narod. *Dikijal Pani *Dikharu *Dikhow - Starts from the hills of Nagaland as Dikhu river. Enters Assam through Sibsagar where ii is known as Dikhow river. It flows through Amguri, Nazira and Sibsagar towns and drains into the Brahmaputra at Dikhowmukh. *Dikorai - *Dikring noi *Dikrong - Starts from Dafla hills near the borders of Lower Subansiri District and East Kameng District of Arunachal Pradesh. Par, Nirochi and Pachin are its main tributaries. *Dikrut - A small hilly river which crosses the National Highway near Dokmoka town in Karbi Anglong District. It drains into the jamuna near Kamrupia Gaon in Karbi Anglong. *Dorika *Dimoru *Dimow - A tributary of the Disang river in the south bank of the Brahmaputra. Drains into the Disang few kilometers short of Disangmukh. *Dipholu *Dipila *Diroi *Diyung - Starts from north of the Borail range and flows through Dima Hasao and Karbi Anglong districts and finally drains into the Kopili at Diyungmukh. *Doigurung *Doyang - A tributary of the Dhansiri and Starts on the southern border of Nagaland. Longest river of Nagaland. Its tributaries and sub tributaries are Chubi, Nzhu,Tsui, Tishi and Tullo. It joins the Dhansiri from its eastern side. *Diphalu (Dipholu) - A rivulet that Starts from the Karbi Anglong hills, Assam and goes through the Kaziranga National Park and joins the River Brahmaputra on its south bank *Diphu - River that goes through Diphu town, the District Head Quarter of Karbi Anglong District. *Dipota - River that goes through Rangapara town and few kilometers west of Tezpur town and drains into the Brahmaputra. *Disam *Disang *Dorika *Dudhhnoi == G == *Gabhoru *Gai *Gelabill *Godadhar *Gorango *Ghiladhari *Ghiladhari *Ghuna suti == H == *Harhariajan *Hel *Horgati (Horina) - A small river Starts near Parkup Pahar and goes through Dengaon town of Karbi Anglong District.The river drains into the Dikrut river from the north. *Horulangpher (Xorulangpher) == J == *Jalkati *Jamuna - The river Jamuna is one of the longest rivers of Karbi Anglong district. Diphu river and Dillai (Manja river) joins near Manja town and flows westward and meets the Longnit river (Siloni river) and Megongdisa river. These combine waters then flow west northwestward and come to known as Jamuna in the plains. Famous picnic spot Sylveta is over this river in the hills on the side of NH 36 near Disobai. *Jatinga *Jenam *Jia Bhoroli - Starts in the Hills of Arunachal Pradesh as Kameng river and enters Assam near bhalukpong (Assam-Arunachal border) and flows the Bhoroli river. It falls into the Brahmaputra east of the Koliabhumura bridge (near Tezpur). *Jia Dhansiri (Jia dhonxiri)- This river Starts from the hills of Bhutan and Arunachal bordering Assam. Famous picnic spot Bhairabkunda is located on the banks of this river. *Jia dhol/kumotia *Jinari *Jinjiram *Jiri *Jhanji *Jonai Korong - Initially this river is known as the Rukshing in Arunachal and near Jonai town the river gets is name as the Jonai Korong. This river also drains into the Dihang. == K == *Kakodonga *Kaldia *Kanibil *Kanmakora *Karbi Langpi - The diverted channel of barapani flows in the karbi Anglong district and is known as the Karbi Langpi river. *Katakhal *Khabolu xuti *Kherkotia *Kharoi *Killing *Kolioni - Starts from the Hills of Karbi Anglong and flows near Numaligarh refinery and drains into the Dhansiri. *Kolong - A pure tributary of the Brahmaputra. Starts from the Brahmaputra near Jakhalabandha and flows through Koliabor and Nogaon towns. It meets the river Kopili and falls into the Brahmaputra at kajolimukh. *Kopili - It starts in the Saipong Reserve Forest in south east of Meghalaya. It has many hydel project over it and the famous being the Khangdong Hydel project at Umrangso. *Korha/Sila *Korkangti - A small river that crosses Langhin town in Karbi Anglong. Korkangthi together with Dikrut and Horina falls into the Jamuna. *Krishnai *Kumotiya *Kulsi *Kundil - A north bank tributary of the Lohit river. It is in the Sadiya sub-division of Tinisukia district. *Kushiyara - A branch of the Barak River, when the Barak splits into the Kushiyara and Surma. Originate in the state of Nagaland in India and pick up tributaries from Manipur, Mizoram and Assam. It forms one of the boundaries between Assam, India, and the Sylhet District of Bangladesh == L == *Lahorijan - A riverlet which borders Assam and Nagaland at Dimapur. *Langpher *Langai *Langting *Leku river - River Leku flows in Arunachal as the chileng river and drains into Dihang in Assam approximately 7 Km downstream from the confluence of Silley and Dihang river. *Letekujaan *Lohit *Lokhaitora *Longring *Luit - Another name for the Mighty Brahmaputra in Assamese language. Present day the world famous majuli island is surrounded by the Luit towards north and by the main channel of Brahmaputra in the south. However, historically the Luit xuti {(northern channel) (much larger than present day Luit which can be seen in Majuli)) and Burhi xuti {(southern channel) (present day Burhi dihing river)} were the two main bifurcated rivers to form the Majuli Island. *Lumding == M == *Mahur *Manas (manox) - In Bhutan Mangde Chu meets Dangme Chu and finally joins the Kirung River to form the Manas river in Assam. Famous Manas National Park is on the banks of the Manas river. At Mathanguri, this river bifurcates into two branches, the eastern branch is known as Beki and western branch is known as Manas. *Mangaldoi *Missa *Mitong *Modhura *Mora Dhansiri *Mora Manah *Mora pagladia *Mori dhol == N == *Nambor --It flows through the Nambor habi (Nambor forest) in Karbi Anglong and Golaghat districts. *Namdang - In Sibsagar. Famous single stone bridge is over this river. *Nanadi- In Dhemaji District of Assam *Noa Dihing - Starts in the hills of Arunachal and flows through Namdhapa, Miao and Namsi and finally drains into the Lohit from the south. *Nokhuwa *Nonoi - In Nogaon *Nonoi - In Udalguri *Nuna noi *Nuwa noi == P == *Pach noi *Pagladia *Palla noi *Pokoria *Pohumara *Puthimari == R == *Ranganadi - It Starts in the hills of Arunachal Pradesh and flows through Yazhali Village, Kimin village and finally drains into the Brahmaputra in Lakhimpur District of Assam. A hydel project over the river by NEEPCO is located at Yazhali. *Rengma *Rowta Noi *Rukoni *Rupai == S == *Saktola river *Sampara Xuti *Sapmora noi *Saphrai *Saralbhaga (xorolbhaga) *saulkhuwa *Sessa *Sibia *Silley - Small river-lets Remi along with its tributary Penang and Miku Korong in Arunachal Pradesh joins to form the Silley river. Silley river forms the eastern most boundary of Dhemaji district of Assam. The Silley river drains into the Dihang. *Siloni--One of hill rivers in the district of Karbi Anglong. It is famous for its picnic spots Siloni and Sylbheta. It falls into the Jamuna river (not to confused with Yamuna of North India or Jamuna of Bangladesh). *Silonijan *Simen *Singla *Singra noi (Xingra) *Sissi *Somkhong *Sonkosh *Soroldanga (Xorol dong'aa) *Subansiri (xuwonxiri) *Sungajaan noi *Suklai (xukulai) *Sunai (xunai) *Sunai == T == *Talap *Taukak *Teok *Tihu *Tiphuk *Tingrai *Tirap *Tuni *Torang *Tengapani *Tongani Assam * Rivers of Assam",
 "title": "List of rivers of Assam"
}