{
 "id": "985448",
 "text": "James Wilkinson (March 24, 1757 – December 28, 1825) was an American soldier, politician, and double agent who was connected with several scandals and controversies. He served in the Continental Army during the American Revolutionary War, but he was forced twice to quit. He was twice the Senior Officer of the U.S. Army, selected to be the first Governor of the Louisiana Territory in 1805, and commanded two unsuccessful campaigns in the St. Lawrence River theater during the War of 1812. He died while posted as a peacekeeper in Mexico City. In 1854, following long archival research in the Spanish archives in Madrid, Louisiana historian Charles Gayarré exposed Wilkinson as having been a highly paid spy in the service of the Spanish Empire. In the years since Gayarré's research became public, Wilkinson has been terribly strongly criticized by American historians and politicians. According to President Theodore Roosevelt, \"In all our history, there is no more despicable character.\" However, he has been defended, especially in breaking up the Burr conspiracy.John Thornton Posey, \"Rascality Revisited: In Defense of General James Wilkinson.\" Filson Club Historical Quarterly 74 (2000): 309-52. ==Early life== James Wilkinson was born on March 24, 1757, the son of Joseph Wilkinson and Alethea (Heighe) Wilkinson. Wilkinson's birthplace was about three miles (5 km) northeast of Benedict, Charles County, Maryland, on a farm south of Hunting Creek in Calvert County. Wilkinson's grandfather had been good enough rich to buy a large property known as Stoakley Manor in Calvert County. Even though James Wilkinson's family lived on a smaller estate than those of Maryland's elite, they still saw themselves as members of the higher social class. According to historian Andro Linklater, Wilkinson grew up with the idea that \"the image of respectability excused the reality of betrayal\". His father received Stoakley Manor but by then the family was in debt. Joseph Wilkinson died in 1763, and in 1764 Stoakley Manor was broken up and sold. Wilkinson's older brother Joseph received what was left of the manor property after his father died. As the second son, James Wilkinson received no land. Wilkinson's father had left him with the last words of \"My son, if you ever put up with an insult, I will disinherit you.\" Biographer Andro Linklater argued that this upbringing led to Wilkinson's aggressive reaction toward perceived insults. Wilkinson's early education by a private teacher was given money by his mother-based grandmother. His study of medicine at the University of Pennsylvania, also was given money by his grandmother, was interrupted by the American Revolutionary War. ==Marriages== Wilkinson married Ann Biddle (1742–1807) of the well-known Biddle family of Philadelphia on November 12, 1778, in Philadelphia. She was a first cousin of Charles Biddle, an business partner of Aaron Burr,Wheelan, p. 117 and Wilkinson's marriage to the energetic Biddle helped his career as a politician and general.Hay, p. 34 She died on February 23, 1807.Hay, p. 36 The couple had four sons: John (1780–1796), James Biddle (c. 1783–1813),Hay, p. 35 Joseph Biddle (1789–1865), and Walter (born 1791). James and Walter both served as Captains in the US Army. On March 5, 1810, Wilkinson married Celestine Laveau Trudeau, widow of Thomas Urquhart and daughter of Charles Laveau Trudeau. They were the parents of twin girls Marie Isabel and Elizabeth Stephanie. Celestine's father, known in Louisiana as Don Carlos Trudeau, had served in the Spanish government of New Orleans. When the United States gained control of the city, he remained in New Orleans and made english-sounding his name. Marie Isabel Wilkinson died in infancy. Elizabeth Stephanie Wilkinson (1816-1871) married Professor Toussaint Francois Bigot (1794-1869) in 1833. == Revolutionary War service == Wilkinson first served in Thompson's Pennsylvania rifle military unit, 1775 to 1776, and was put into use as a captain in September 1775. He served as an assistant to Nathanael Greene during the Siege (attack) of Boston, participated in the placing of guns on the Dorchester Heights in March 1776, and following the British abandonment of Boston, went with the rest of the Continental Army to New York where he left Greene's staff and was given command of an infantry company. Sent to Canada as part of the reinforcements for Benedict Arnold's army attacking Quebec, he arrived just in time to see the arrival of 8,000 British reinforcements under General John Burgoyne – which caused the collapse of the American effort in Canada. He became assitant to Arnold just before to the final retreat and left Canada with Arnold on the very last boat out. Shortly after that, he left Arnold's service and became an assitant to General Horatio Gates in August 1776. When Gates sent him to Congress with official messages about the victory at the Battle of Saratoga in 1777, Wilkinson kept the Continental Congress waiting while he attended to personal affairs. When he finally showed up, he added to his own role in the victory, and was brevetted as a brigadier general (despite being only 20 years old at the time) on November 6, 1777, and selected to the newly created Board of War. The promotion over more senior colonels caused a bunch of angry people yelling among Continental officers, especially because Wilkinson's gossiping seemed to show that he was a participant in the Conway Cabal, a conspiracy to replace George Washington with Horatio Gates as commander-in-chief of the Continental Army. Gates soon had enough of Wilkinson, and the young officer was forced to quit in March 1778. On July 29, 1779, Congress selected him as the clothier- general of the Army, but he quit on March 27, 1781, due to his \"lack of ability for the job\". == References == Category:1757 births Category:1825 deaths Category:American military people Category:American revolutionaries",
 "title": "James Wilkinson"
}