{
 "id": "985573",
 "text": "Eloise Greenfield (May 17, 1929 – August 5, 2021) was an American writer of children's books and poetry. She was well-known for her sense of rhythm and description of the African-American experience, including efforts to end racism in the United States.Maughan, Shannon. \"Obituary: Eloise Greenfield\", Publishers Weekly, August 10, 2021 == Selected works == ;Fiction *Bubbles (1972, illustrated by Eric Marlow, later reprinted as Good News) *She Comes Bringing Me that Little Baby Girl (1974, illustrated by John Steptoe; winner of the Irma Simonton Black Award, Bank Street College of Education) *Sister (1974, illustrated by Moneta Barnett; winner of The New York Times Outstanding Book of the Year citation) *Me and Neesie (1975, illustrated by Moneta Barnett) *First Pink Light (1976, illustrated by Barnett) *Africa Dream (1976, illustrated by Carole Byard; Coretta Scott King Award winner) *I Can Do It by Myself (1978, with her mother, Lessie Jones Little, illustrated by Byard) *Talk About a Family (1978, illustrated by James Calvin) *Darlene (1980, illustrated by George Ford) *Grandmama's Joy (1980, illustrated by Byard) *Grandpa's Face (1988, illustrated by Floyd Cooper) *Big Friend, Little Friend (1991, illustrated by Jan Spivey Gilchrist) *I Make Music (1991, illustrated by Gilchrist) *Lisa's Daddy and Daughter Day (1991, illustrated by Gilchrist) *My Doll, Keshia (1991, illustrated by Gilchrist) *My Daddy and I (1991, illustrated by Gilchrist) *Koya DeLaney and the Good Girl Blues (1992) *Aaron and Gayla's Alphabet Book (1993, illustrated by Gilchrist) *William and the Good Old Days (1993, illustrated by Gilchrist) *Sweet Baby Coming (1994, illustrated by Gilchrist) *Honey, I Love (1995 picture book, illustrated by Gilchrist) *On My Horse (1995, illustrated by Gilchrist) *Easter Parade (1998, illustrated by Gilchrist) *Water, Water (1999) *MJ and Me (1999) *Grandma's Joy (1999) *The Friendly Four (2006, illustrated by Gilchrist) *Thinker: my puppy poet and me\" (2019, illustrated by Ehsan Abdollahi) *Alaina and the Great Play (2021, illustrated by Colin Bootman) ;Biographies and non-fiction *Rosa Parks (1973, illustrated by Eric Marlow; winner of the 1974 Carter G. Woodson Book Award from the National Council for the Social Studies) *Paul Robeson (1975, illustrated by Ford; winner of the 1976 Jane Addams Children's Book Award; Coretta Scott King Honor) *Mary McLeod Bethune (1977, illustrated by Pinkney; Coretta Scott King Honor) *Childtimes: A Three-Generation Memoir (1979, with her mother, L. J. Little, illustrated by Jerry Pinkney; Coretta Scott King Honor; Boston Globe-Horn Book Award) *Alesia (1981, with Alesia Revis, illustrated by Ford, with photographs by Sandra Turner Bond) *For the Love of the Game: Michael Jordan and Me (1997, illustrated by Gilchrist) *How They Got Over: African Americans and the Call of the Sea (2003, illustrated by Gilchrist) *The Women Who Caught the Babies: A Story of African American Midwives (2019, illustrated by Daniel Minter) ;Poetry *Honey, I Love and Other Poems (1978, illustrated by Leo and Diane Dillon; winner of the Recognition of Merit Award) *Daydreamers (1981, illustrated by Tom Feeling) *Nathaniel Talking (1988, illustrated by Gilchrist; Coretta Scott King Honor) *Under the Sunday Tree (1988, illustrated by Amos Ferguson) *Night on Neighborhood Street (1991, illustrated by Gilchrist; Coretta Scott King Honor) *Angels (1998, illustrated by Gilchrist) *I Can Draw a Weeposaur and Other Dinosaurs (2001, illustrated by Gilchrist) *In the Land of Words (2004, illustrated by Gilchrist) *When the horses ride by: Children in the times of war (2006, illustrated by Gilchrist) *Brothers & Sisters (2008, illustrated by Gilchrist) *The Great Migration: Journey to the North (2011, illustrated by Gilchrist; Coretta Scott King Honor) == Related pages == *List of poets from North America == References == Category:1929 births Category:2021 deaths Category:American poets",
 "title": "Eloise Greenfield"
}