{
 "id": "98579",
 "text": "776 Berbericia Name Name Berbericia Designation 1914 TY Discovery Discoverer A. Massinger Discovery date January 24, 1914 Discovery site Heidelberg Orbital elements Epoch May 12, 1998 (JDCT 2450945.5) Eccentricity (e) 0.163 Semimajor axis (a) 2.932 AU Perihelion (q) 2.456 AU Aphelion (Q) 3.409 AU Orbital period (P) 5.022 a Inclination (i) 18.206° Longitude of the ascending node (Ω) 80.132° Argument of Perihelion (ω) 304.840° Mean anomaly (M) 12.648° 776 Berbericia is a minor planet orbiting the Sun in the asteroid belt. This main-belt asteroid was found by A. Massinger at Heidelberg January 24, 1914. It was named in honor of Adolf Berberich (1861-1920), a German astronomer.http://ssd.jpl.nasa.gov/sbdb.cgi#topSchmadel Lutz D. Dictionary of minor planet Names (fifth edition), Springer, 2003. . In the late 1990s, a network of astronomers worldwide gathered lightcurve data that was mostly used to conclude the spin states and shape models of 10 new asteroids, including (776) Berbericia.Durech., J.; Kaasalainen, M., Marciniak, A.; et al., “Physical models of ten asteroids from an observers' collaboration network,” Astronomy and Astrophysics , Volume 465, Issue 1, April I 2007, pp. 331-337Durech, J.; Kaasalainen, M.; Marciniak, A.; Allen, W. H. et al. “Asteroid brightness and geometry,” Astronomy and Astrophysics, Volume 465, Issue 1, April I 2007, pp. 331-337. Richard P. Binzel and Schelte Bus added more to the knowledge about this asteroid in a lightwave survey published in 2003. This project was known as Small Main-belt Asteroid Spectroscopic Survey, Phase II or SMASSII, which built on a previous survey of the main-belt asteroids. The visible-wavelength (0.435-0.925 micron) spectra data was gathered between August 1993 and March 1999.Bus, S., Binzel, R. P. Small Main- belt Asteroid Spectroscopic Survey, Phase II. EAR- A-I0028-4-SBN0001/SMASSII-V1.0. NASA Planetary Data System, 2003. == References == == Other websites == * Discovery Circumstances: Numbered Minor Planets Category:Asteroids",
 "title": "776 Berbericia"
}