{
 "id": "98583",
 "text": "Christopher Michael Benoit (May 21, 1967 - June 24, 2007) was a Canadian professional wrestler. He was first noticed in the United States when he started wrestling for Extreme Championship Wrestling (ECW) in 1994. He would later go to World Championship Wrestling (WCW) the next year. Within a year, he became a member of the Four Horsemen (with Ric Flair, Arn Anderson, and Brian Pillman). He joined the World Wrestling Federation (WWF, later renamed WWE) in January 2000. In January 2004, Benoit won the 30 man Royal Rumble match which allowed him to main event WrestleMania. He would go on to win the World Heavyweight Championship at WrestleMania XX on March 14, 2004. On June 24, 2007, Chris Benoit committed suicide by hanging after murdering his wife and son (murder–suicide). Their dead bodies were found on June 25. Benoit's father, Michael Benoit, says that Benoit had brain damage. Benoit was also believed to have been on several different medications to aid his in ring performance, sleep, and pain. According to ESPN, \"Benoit's body contained 10 times the normal level of testosterone, as well as amounts of the anti-anxiety drug Xanax and the painkiller hydrocodone, authorities said. The testosterone, a synthetic version of the primary male sex hormone, is considered an anabolic steroid. The state's top medical examiner said it appeared to have been injected shortly before Benoit died.\" It is a speculation which Benoit may have dealt with Roid-Rage, and this could have set him off the rails along with other trauma issues to the brain as well. A study of Benoit's brain by the Sports Legacy Institute showed that he had depression and severe chronic traumatic encephalopathy (CTE). Another test also revealed that Benoit's brain was so badly damaged that it \"resembled the brain of an 85-year-old Alzheimer's patient\". This is what caused Benoit to kill his family. Because brain damage can be caused by concussions, WWE no longer allows wrestlers to hit each other in the head with steel chairs. Mentions of his name were also banned thereafter (although his name is still listed in title histories on WWE's website, and he is still shown in their video library on Peacock/WWE Network). ==In wrestling== * Finishing moves ** Bridging dragon suplex – 1992–1998; he used it as a regular move from 1998 to 2007 ** Crippler Crossface (Arm trap crossface) ** Diving headbutt – adopted from Dynamite Kid ** Kneeling reverse piledriver, he sometimes did it from the second rope – 1989–1994; he used it as a regular move afterwards ** Sharpshooter – 1998–2007 ** Wild Bomb (High speed release powerbomb), he sometimes did it from the top rope – 1994–2002; rarely used as a regular move thereafter * Signature moves ** Back body drop ** Backhand chop ** Dragon screw ** Forearm smash ** Headbutt ** Lariat ** Multiple suplex variations *** Belly to back *** Bridging Northern Lights *** Bridging / Release / Rolling German *** Slingshot *** Snap *** Super *** Three Amigos (Triple rolling verticals) – used as a tribute to Eddie Guerrero ** Pendulum backbreaker ** Shoulderbreaker – 2001–2003 ** Springboard clothesline to opponent on ring apron – 1994–1998 ** Suicide dive * With Chris Jericho ** Double submission (the Walls of Jericho with the Crippler Crossface) - 2001 * Managers ** Arn Anderson ** Ted DiBiase (During his WWF tryout matches in 1995) ** Shane Douglas ** Miss Elizabeth ** Shane McMahon ** Terri Runnels ** Woman * Nicknames ** \"The Rabid Wolverine\" ** \"The Crippler\" ** \"The Broom\" ** \"The Canadian Crippler\" * Entrance themes ** New Japan Pro Wrestling *** \"Jump (DJ Power Mix)\" by Eskimo ** Extreme Championship Wrestling *** \"Back in the Saddle\" by Aerosmith *** \"Perfect Strangers\" by Deep Purple ** World Championship Wrestling *** \"Scattered\" *** \"Coast\" *** \"Replica B\" *** \"Too Much Information\" ** World Wrestling Federation/Entertainment *** \"Shooter\" by Jim Johnston (April 2, 2000 – May 27, 2002) *** \"Whatever\" by Our Lady Peace (June 17, 2002 – June 19, 2007) == Championships == * Cauliflower Alley Club ** Future Legend Award (2002) * Catch Wrestling Association ** CWA World Tag Team Championship (one time) (with Dave Taylor) * Extreme Championship Wrestling ** ECW World Tag Team Championship (one time) (with Dean Malenko) * New Japan Pro Wrestling ** IWGP Junior Heavyweight Championship (one time) ** Super J Cup (1994) ** Top/Best of the Super Juniors (1993, 1995) ** Super Grade Junior Heavyweight Tag League (1994) (with Shinjiro Otani) * Pro Wrestling Illustrated ** PWI Feud of the Year (2004) (vs. Triple H) ** PWI Match of the Year (2004) (vs. Shawn Michaels and Triple H at WrestleMania XX) ** PWI Wrestler of the Year (2004) ** He was ranked #1 of the 500 best singles wrestlers in the PWI 500 in 2004. ** He was ranked #69 of the top 500 singles wrestlers of the \"PWI Years\" in 2003. * Stampede Wrestling ** Stampede British Commonwealth Mid-Heavyweight Championship (four times) ** Stampede Wrestling International Tag Team Championship (four times) (with Ben Bassarab (one), Keith Hart (one), Lance Idol (one), and Biff Wellington (one)) ** Stampede Wrestling Hall of Fame * Universal Wrestling Association ** WWF Light Heavyweight Championship (one time)1 * World Championship Wrestling ** WCW United States Heavyweight Championship (two times) ** WCW World Heavyweight Championship (one time) ** WCW World Tag Team Championship (two times) (with Dean Malenko (one) and Perry Saturn (one)) ** WCW World Television Championship (three times) ** Seventh WCW Triple Crown Champion * World Wrestling Federation / World Wrestling Entertainment ** World Heavyweight Championship (one time) ** WWE Tag Team Championship (one time) (with Kurt Angle) ** WWE United States Championship (three times) ** WWF/E Intercontinental Championship (four times) ** WWF/E World Tag Team Championship (three times) (with Chris Jericho (one) and Edge (two)) ** Royal Rumble (2004) ** Twelfth Triple Crown Champion * Wrestling Observer Newsletter awards ** 5-Star Match (1994) (vs. Great Sasuke at Super J Cup) ** Best Brawler (2004) ** Feud of the Year (2004) (vs. Triple H and Shawn Michaels) ** Best Technical Wrestler (1994, 1995, 2000, 2003, 2004) ** Most Underrated (1998) ** Most Outstanding Wrestler (2000, 2004) ** Match of the Year (2002) (with Kurt Angle vs. Edge and Rey Mysterio) ** Readers' Favorite Wrestler (1997, 2000) ** Wrestling Observer Newsletter Hall of Fame (Class of 2003)2 1His reign with the championship is not officially listed by the WWE. Reigns before December 1997 are not listed by the promotion. 2The hall of fame held a special recall election in 2008 because of the double murder–suicide of his wife and son. 53.6% supported the decision but it was under the 60% threshold needed to remove him. ==References== == Other websites == Category:1967 births Category:2007 deaths Category:Canadian criminals Category:Canadian murderers Category:Canadian professional wrestlers Category:Former WWE wrestlers Category:Murderers who committed suicide Category:Murder-suicides in the United States Category:Sportspeople from Edmonton Category:Sportspeople from Montreal Category:Sportspeople who committed suicide Category:Suicides by hanging in the United States",
 "title": "Chris Benoit"
}