{
 "id": "985950",
 "text": "Eiger north face the north face of the mountain called Eiger. It has a height of more than over the sourrounding area. The summit of Eiger is at f above sea level. Some climbing routes using the north face have length of over . They are among the most diffiult, and most tiring climbing routes in the world. Also, the north face is very exposed. There's a constant danger of rockfall and avalanches. It became known because many people tried to climb it (and failed). == First attempt: 1935 == The first people to try climbing it were were Max Sedlmayr and Karl Mehringer, in 1935. People with telesocpes watched them. When they started, the weather was good. On the second day, they climbed what is called First Band; it was rated at the maximum difficulty level of that time. (VI). They reached the First Band of Ice, in the evening. They had climbed about , about were left (in height). Nearly the whole of the second day they spent traversing the second ice field. The weather turned, and the sight was lost. Three days later, the weather improved, and the sight was restored. Sedlmayer and Mehringer were spotted climbing somewhat higher up. The weather turned again, and the sight was lost again. Six days after they had started, a military plane was used to search for them, but it did not find the climbers. A team of eight climbers started a rescue mission, about four days later. They didn't find anyone. Other climbers found one corpse, at a place that is now called Todesbiwak (Biwak of death). It is unclear,if this was Sedlmayr or Mehringer. In 1976, four Czech climbers found a packet of cigarettes, with a notice, Mehringer had written. It read \"Biwack\" and one of the names of the climbers. Was dated August 21, 1935. (The climbers had started on August 16) == Second attempt: 1936 == In the 1930s, the north faces of Eiger, Matterhorn, and Grandes Jorasses were seen as the \"last problems of the Alps\". Among climbers, there was a race, who would first climb these north faces. Matterhon north face was climbed in 1931, Grandes Jorasses in 1935. At about Eiger north face was also the tallest of the three. In this attempt, two teams of wo people died. It is one of the best known climbings, and many movies have been made from it. Getting the corpses took more than a month. After the tragedy, climbing the north face was forbidden for a time. When it was again allowed, it was ruled thatthere would be no duty to rescue people who climed it. == First succesful attempt: 1938 == Anderl Heckmair, Heinrich Harrer, Ludwig Vörg and Fritz Kasparek were the first who were successful. At the time, they were criticized, because their style was new. Also the Nazi parti did not like some of their opinions. Today, there are more than thiry routes to climb the north face. With good weather, it is possible to climb the mountain in a few hours (using the route Heckmair had taken). The original expedition needed more than three days. Category:Mountains of Switzerland",
 "title": "Eiger north face"
}