{
 "id": "985914",
 "text": "\"Made You Look\" is a song sung by Meghan Trainor. She is an American singer- songwriter. Trainor and Sean Douglas wrote it with its producer, Federico Vindver. Epic Records released it as a single on October 31, 2022. The song is from her fifth album, Takin' It Back (2022). It is in the doo-wop genre and is similar to older styles of famous music. Trainor was not sure about her body and wrote the song to make listeners believe in their natural beauty and get more confidence. Reviewers thought \"Made You Look\" was flirty. They compared it to other songs by Trainor. The song was also used in a dance that became famous on TikTok in 2022. Billboard magazine listed it at number 11 on their Hot 100 music chart. It was her first song to go above number 20 since 2016. The song was also listed at number 10 or higher on the charts in Australia, Belgium, Canada, Ireland, New Zealand, Norway, Singapore, the United Kingdom, and Vietnam. The music video for it was first released in the game Candy Crush Saga in October 2022. It is colorful and many people who are famous on social media are in it. Trainor sang the song on television shows such as The Today Show, The Tonight Show Starring Jimmy Fallon, and The Drew Barrymore Show. ==Background and release== Meghan Trainor's first album, Title (2015), was successful. Three songs from it were listed higher than number 10 on the Billboard Hot 100 music chart. She faced problems while making her third album, Treat Myself (2020). She rewrote it four times to make it successful. She decided to go back to the doo-wop genre on her fifth album after her song \"Title\" became famous on TikTok in 2021. She had more feelings and became stronger after getting pregnant. This helped her write better songs. Trainor wrote songs for the album which she thought people on TikTok would like. She got attention on it after making videos with Chris Olsen. Trainor released the song \"Bad for Me\" in June 2022. Trainor and Sean Douglas wrote \"Made You Look\" with its producer, Federico Vindver. Her therapist asked her to look at herself with no clothes on for five minutes. This and Trainor's low confidence about her body gave her the idea for the song. Trainor wrote the words \"I'll make you double take / Soon as I walk away / Call up your chiropractor just in case your neck break\". These are about how her husband, Daryl Sabara, turns to look at her when she goes out of a room. Other words are about the things he does for her. Trainor wrote more songs about self-confidence like she did on her older albums like her song \"All About That Bass\" (2014). \"Made You Look\" is the second single from Takin' It Back (2022). It was given to radio in the United States on October 31, 2022. The song was sent to radio in Italy on November 18, 2022. On December 9, 2022, its a cappella version, on which Trainor sang with Olsen, Scott Hoying, Elyse Myers, and Sri, was released with a music video. Joel Corry's remix of it came out on December 31, 2022, and its instrumental and faster versions in January 2023. On January 27, the song was released with the singer Kim Petras. Petras recorded high notes in the studio of Trainor's home. She liked the experience. She had been listening to the song for many months. ==Song and words== \"Made You Look\" is two minutes and 14 seconds long. Vindver produced, programmed, and engineered the song. He plays the keyboards and percussion, Jesse McGinty plays the baritone saxophone and trombone, and Mike Cordone plays the trumpet. Jeremie Inhaber mixed the song, and Randy Merrill mastered it at Sterling Sound in New York City. \"Made You Look\" is in the doo-wop genre and is similar to older styles of famous music. Vindver put the horn into the song to make this happen. It has many harmonies, and bass and brass instruments. Piper Westrom wrote that these are like the album Title in Riff magazine. \"Made You Look\" uses call and response; on the website PopMatters, Peter Piatkowski thought it was like \"All About That Bass\" due to a similar delivery and the girl group arrangement. The words of \"Made You Look\" are about loving yourself. Trainor makes the girls listening to it believe in their natural beauty and get more confidence. She says that while she could wear clothes from famous fashion companies like Gucci and Louis Vuitton, she looks better in a hoodie and with her hair in the morning. Trainor says that people would like the way she walks and think about her a lot. ==Reviews== In reviews, \"Made You Look\" was said to be similar to Trainor's other songs. In Far Out magazine, Tyler Golsen said that it was like Trainor's older music but also older pop music in general. He said \"Made You Look\" may not be a good song and he would not listen to it again, but he thought it made sense for Trainor. AllMusic's Stephen Thomas Erlewine said that the line about fashion companies in \"Made You Look\" showed that Trainor wanted to go back to the sound of Title. But he thought this was not fully natural. Rolling Stone put it at number 69 in a list of the best songs of 2022. Tomás Mier gave it a good review. In the review, he said it was like Trainor's old songs and said good things about the words and production. Some thought the song's words were flirty. Martina Inchingolo wrote in the Associated Press that Trainor sang \"loud[er] and sexier\" on the song. Writing for Renowned for Sound, Max Akass believed she was fun and flirty on it. This made it an easy and effective pop song. Mier said Petras's part on her remix of \"Made You Look\" was \"sexy\". ==Chart performance== \"Made You Look\" did better than many Trainor songs. Some people thought she became successful again. The song was first put at number 95 on the Billboard Hot 100 music chart for November 5, 2022. It got 9.3 million listens next week and got to number 49 on the Streaming Songs chart. None of her other songs had done this since \"Me Too\" in 2016. It went to number 11 on the Hot 100. None of her songs after \"Me Too\" had gone above number 40. \"Made You Look\" was put in the number one position on the Adult Top 40 chart. It was Trainor's first since \"Like I'm Gonna Lose You\" in 2015. In Canada, \"Made You Look\" got to number seven on the Canadian Hot 100 music chart. It was number two on the UK Singles Chart and became her first single to be higher than number 10 since \"Marvin Gaye\" in 2015. The British Phonographic Industry gave it a Platinum certification. In Australia, \"Made You Look\" got to number three and got a 3× Platinum certification from the Australian Recording Industry Association. The song reached number two in New Zealand and was given a Platinum certification from Recorded Music NZ. It was Trainor's first song to go above number 10 on the Billboard Global 200 chart. It reached number six. \"Made You Look\" went above number 10 in other places, at number two in Singapore, number three in Belgium, Iceland, and Ireland, number five in Vietnam, number six in Latvia, number seven in Norway, and number eight in Malaysia. It also got to number 11 in Hungary, number 13 in Croatia and the Netherlands, number 15 in Paraguay, number 16 in Austria, and number 19 in Switzerland. It received a Platinum certification in Norway, Poland, and Switzerland, and Gold in Austria, Denmark, Italy, Portugal, and Sweden. ==Music video and promotion== The music video for \"Made You Look\" was first released in the game Candy Crush Saga on October 20, 2022. It was put on other places the next day. Trainor said she wanted it to be a bigger and more colorful version of the \"All About That Bass\" video. In it, she wears different clothes in a press meeting, drives a car, and dances in a room. Famous people like Hoying, JoJo Siwa, Drew Afualo, and Olsen dance in the video. Sabara is the car driver. The video was also released with some changes, including only Trainor's dance, which was called \"Made You Look (Again)\". The girls Brookie and Jessie used \"Made You Look\" in a dance that became famous on TikTok. Two million other people also did the dance. Trainor sang the song on many television shows. On October 21, 2022, she sang \"Made You Look\" for the first time on The Today Show. Three days later, Trainor sang it again on The Tonight Show Starring Jimmy Fallon. She mixed it with the song \"Here Comes Santa Claus\" during a performance at the The Wonderful World of Disney: Magical Holiday Celebration on November 27, 2022. On December 13, 2022, Trainor sang \"Made You Look\" on The Drew Barrymore Show. She again sang the song on the eighth season of Australian Idol on February 27, 2023. ==Credits== Credits are listed from the CD book of Takin' It Back. *Federico Vindver – producer, songwriter, programming, engineering, keyboards, percussion *Meghan Trainor – songwriter *Sean Douglas – songwriter *Jesse McGinty – baritone saxophone, trombone *Mike Cordone – trumpet *Randy Merrill – mastering *Jeremie Inhaber – mixing ==Charts== ===Weekly charts=== \"Made You Look\" was put on these weekly charts Chart (2022–2023) Peak position CIS (TopHit) 80 Croatia (HRT) 13 Germany Airplay (BVMI) 14 Greece International (IFPI) 35 Iceland (Plötutíðindi) 3 Italy (FIMI) 59 Japan Hot Overseas (Billboard Japan) 2 Latvia Airplay (LAIPA) 5 Latvia (EHR) 6 Lithuania (AGATA) 35 Luxembourg (Billboard) 23 Malaysia (Billboard) 8 Malaysia International (RIM) 3 Nigeria (TurnTable Top 100) 47 Paraguay (Monitor Latino) 15 Philippines (Billboard) 3 Poland (Polish Airplay Top 100) 1 Poland (Polish Streaming Top 100) 63 Singapore (RIAS) 2 South Africa (RISA) 22 South Korea (Circle) 75 Spain (PROMUSICAE) 87 Suriname (Nationale Top 40) 34 Sweden (Sverigetopplistan) 21 Vietnam (Vietnam Hot 100) 5 ===Monthly charts=== \"Made You Look\" was put on these monthly charts Chart (2023) Peak position South Korea (Circle) 76 ===Year-end charts=== \"Made You Look\" was put on these charts for the year 2022 Chart (2022) Position Belgium (Ultratop Flanders) 178 Netherlands (Dutch Top 40) 99 ==Certifications== ==Release history== These are the days on which \"Made You Look\" was released Region Date Format(s) Version Label United States October 31, 2022 Hot adult contemporary Original Epic Italy November 18, 2022 Radio airplay Sony Various December 9, 2022 A cappella Epic December 31, 2022 Joel Corry remix January 12, 2023 Instrumental Sped Up January 27, 2023 Kim Petras remix Italy Radio airplay Sony Australia February 3, 2023 CD single Original Epic ==References== Category:2022 songs Category:Meghan Trainor songs Category:Doo-wop songs Category:R&B; songs",
 "title": "Made You Look"
}