{
 "id": "985985",
 "text": "ChatGPT (short for Chat Generative Pre-trained Transformer) is a chatbot. It was launched by OpenAI in November 2022. The program was first built using a large language model that OpenAI made, called GPT-3.5. The GPT-3.5 model was first \"trained\" to predict text that comes after initial text. After the model learned to complete text, supervised and reinforcement learning techniques were used to make the model more likely to follow instructions, and other preferences. ChatGPT was launched as a prototype on November 30, 2022. The website received more than one million users after five days. By January 2023, ChatGPT reached over 100 million users. It got attention for its answers in many areas of knowledge but its lack of accuracy was said to be a problem. ChatGPT has used different 'large language models' (LLMs) to generate text. The first model that ChatGPT used was called GPT-3.5. The GPT-4 model was released in 2023, and this model often gave better answers than GPT-3.5. More recently GPT-4o, and the o1-preview models were released. The o1 models can take more time to answer questions, and can solve more complicated problems than other models. While the o1 models are working on an answer, they can show a summary of their working out. Scientists have claimed that o1 models are progress to the goal of Artificial General Intelligence (AGI). ChatGPT used to be completely free for research, but it got so popular that OpenAI started using a freemium model. OpenAI created ChatGPT Plus, a subscription service which costs $20 per month. Users can still use the free version of ChatGPT, but ChatGPT Plus users can use more features, and more capable models. == Criticism and misuse == There is a risk that ChatGPT can be used to create computer programs called malware. Malware can harm other computers, steal information, or break into networks without permission. This used to be a bigger risk, but now OpenAI checks chats for misuse. If they detect misuse, like trying to make a computer virus, they stop the text generation. ChatGPT has a policy that bans users from making illegal content like malware and virus code. OpenAI has warned people that the chatbot may give wrong information, or write biased content. ChatGPT can also make messages that look like they were written by real people that could trick people. ChatGPT can be used by students to cheat on homework or essays. ChatGPT can generate writing on many different topics, so students could use it to finish assignments without actually doing the work themselves. Early evidence indicates that excessive use of ChatGPT is linked to increased procrastination, memory loss, and poor academic performance among students. As a result, many AI detectors have been created which try to find patterns that are common in AI-generated text but uncommon in human text. == References == Category:Software Category:Generative artificial intelligence Category:OpenAI",
 "title": "ChatGPT"
}