{
 "id": "986012",
 "text": "The Dayton Literary Peace Prize is an award for authors whose works help to give readers \"a better understanding of other cultures, peoples, religions, and political points of view.\" A meeting was held at Wright-Patterson Air Force Base near Dayton, Ohio in 1995. Leaders from Bosnia, Serbia, and Croatia and other leaders from the United States and European nations met to find a way to end the war in Bosnia. Richard Holbrooke of the United States was the leader of this peace process. On 21 November 1995 an agreement was reached. It was called the Dayton Peace Agreement or the Dayton Peace Accords. Soon after this, the people of Dayton began to form connections with the people of the war-torn nations. They would share cultural and educational experiences with each other. In 1999, the city of Dayton began the Dayton Peace Prize. It was for leaders who brought peace to their troubled places. In 2006, the Peace Prize was given a new name. They named it, the Literary Peace Prize. \"Literary\" means that the prize would be given to writers, makers of literature, who helped readers learn how to think and live in ways that will bring peace to their part of the world. The literary prizes are given to the writers of adult fiction and non-fiction from anywhere in the world. The prizes are $10,000 for the winner and $5,000 for the runner-up. Writers who have won the award include Junot Diaz, Edwidge Danticat, Thomas Friedman, Dave Eggers, Bryan Stevenson, Anthony Doerr, Viet Thanh Nguyen, Ta-Nehisi Coates, Richard Powers, and Alice Hoffman. The prizes also include a Distinguished Achievement Award. It is for writers whose life work has added much to learning about peace. Since 2011, this award has been called the Richard C. Holbrooke Distinguished Achievement Award. The prize includes $10,000. Winners of the Holbrooke Award include Elie Wiesel, Barbara Kingsolver, Tim O’Brien, Wendell Berry, Louise Erdrich, John Irving, N. Scott Momaday, and Margaret Atwood. ==References== Category:Literary awards",
 "title": "Dayton Literary Peace Prize"
}