{
 "id": "986366",
 "text": "The following is a list of deaths that should be noted in January 2023. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Every entry must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==January == === 1 === *Mario Artali, 84, Italian businessman and politician, deputy (1972–1976). *Martin Davis, 94, American mathematician (Davis–Putnam algorithm). *N. C. Debbarma, 80, Indian politician, Tripura MLA (since 2018), stroke. *Gangsta Boo, 43, American rapper (Three 6 Mafia). *Guo Nanhong, 86, Taiwanese politician, minister of transportation and communications (1987–1990) and president of the National Chiao Tung University (1979–1987), COVID-19. *Hou Yimin, 92–93, Chinese artist. *Bob Jongen, 95, Dutch footballer (Roda JC, Alemannia Aachen, Fortuna 54). *Kadri Mälk, 64, Estonian artist and jewellery designer. *Jean-Marc Maniatis, 80, French hairdresser. *Frank McGarvey, 66, Scottish footballer (St Mirren, Celtic, national team), pancreatic cancer. *Art McNally, 97, American Hall of Fame football official, director of officiating for the NFL (1968–1991). *Meenakshi Narain, 58, American experimental physicist. *Lise Nørgaard, 105, Danish journalist and writer (Matador). *Edith Pearlman, 86, American short story writer. *Sir Michael Rawlins, 81, British clinical pharmacologist, chair of the Medicines and Healthcare products Regulatory Agency (2014–2020). *Fred White, 67, American Hall of Fame drummer (Earth, Wind & Fire). *Zhu Zushou, 77, Chinese diplomat, ambassador to Hungary (2003–2007) and the Netherlands (2001–2003), COVID-19. === 2 === *Ken Block, 55, American rally driver (Rally America, Global Rallycross), co-founder of DC Shoes, snowmobile rollover. *Frank Cameron, 90, New Zealand cricketer (Otago, national team) and national cricket selector (1968–1986). *Suzy McKee Charnas, 83, American novelist (The Kingdom of Kevin Malone, The Holdfast Chronicles) and short story writer (\"Boobs\"). *Viktor Fainberg, 91, Russian philologist and Soviet dissident. *François Geindre, 76, French politician, mayor of Hérouville-Saint-Clair (1971–2001). *Dumitru Radu Popescu, 87, Romanian novelist, poet and dramatist. *Abderrahim Tounsi, 86, Moroccan actor and comedian. === 3 === *James D. Brubaker, 85, American movie producer (Rocky, The Right Stuff, Gia), problems caused by strokes. *Walter Cunningham, 90, American astronaut (Apollo 7), problems caused by a fall.NASA Apollo astronaut Walt Cunningham has died at age 90 *Elena Huelva, 20, Spanish influencer and writer, Ewing sarcoma. *Ruslan Khasbulatov, 80, Russian economist and politician, chairman of the Supreme Soviet (1991–1993). *Joseph Koo, 91, Hong Kong composer (A Terra-Cotta Warrior). *Abdelsalam Majali, 97, Jordanian medical doctor and politician, prime minister (1993–1995, 1997–1998). *Notis Mavroudis, 77, Greek guitarist and composer, fall. *Pan Honghai, 80–81, Chinese oil painter. *Silvio Parnis, 57, Maltese politician, MP (1998–2022), cancer. *Robbie Pierce, 63, American off-road racing driver, scuba diving accident. *Mitică Popescu, 86, Romanian actor (The Earth's Most Beloved Son, The Moromete Family, The Moment). *Nicolás Redondo, 95, Spanish union leader and politician, secretary general of the UGT (1976–1994) and deputy (1977–1987). *Nikos Skylakakis, 99, Greek basketball player (national team). *Nate Thayer, 62, American journalist (Far Eastern Economic Review, Jane's Defence Weekly, Soldier of Fortune). *Giorgio Tombesi, 96, Italian politician, deputy (1976–1983). *Norbert Werbs, 82, German Roman Catholic prelate and theologian, auxiliary bishop of Schwerin (1981–1994) and Hamburg (1994–2015). *Zhao Qiguo, 92, Chinese soil scientist, member of the Chinese Academy of Sciences. *Zhou Lingzhao, 103, Chinese painter. === 4 === *Richard Bernal, Jamaican diplomat and economist. *Thomas Stonor, 7th Baron Camoys, 82, British banker and peer, lord chamberlain (1998–2000). *Arthur Duncan, 97, American tap dancer (The Lawrence Welk Show, The Betty White Show).Arthur Duncan, pioneering Black tap dancer, dies at 97 *Michel Ferté, 64, French racing driver. *David Gold, 86, British retailer, publisher (Gold Star Publications) and football executive, chairman of West Ham United (since 2010). *Elwood Hillis, 96, American politician, member of the U.S. House of Representatives (1971–1987). *Manfred Krikke, 90, Dutch cycling team manager (PDM cycling team). *Alan Mackay-Sim, 71, Australian biomedical scientist, Australian of the Year (2017). (death announced on this date) *Rosi Mittermaier, 72, German alpine ski racer, double Olympic champion (1976). *Géza Morcsányi, 70, Hungarian playwright and actor (On Body and Soul). *Miiko Taka, 97, American actress (Sayonara, The Art of Love, Walk, Don't Run). (death announced on this date) *Fay Weldon, 91, British author (The Life and Loves of a She-Devil, Puffball, The Cloning of Joanna May), essayist and playwright. === 5 === *Earl Boen, 81, American actor (Terminator, The Dentist, Warcraft), lung cancer. *Ernesto Castano, 83, Italian footballer (Triestina, Juventus, national team). *Nate Colbert, 76, American baseball player (San Diego Padres, Houston Astros, Detroit Tigers). *Herbert Gintis, 82, American economist and behavioral scientist. *Gordy Harmon, 79, American soul singer (The Whispers). *Russell Pearce, 75, American politician, member (2006–2011) and president (2011) of the Arizona Senate. *Michael Snow, 94, Canadian filmmaker (Wavelength, Back and Forth) and artist (Flight Stop). *Quentin Williams, 39, American politician, member of the Connecticut House of Representatives (since 2019), car crash. === 6 === *Sadiq al-Ahmar, 66, Yemeni politician and tribal leader, MP (1993–2011), cancer. *Fred Benners, 92, American football player (New York Giants). *Bill Campbell, 74, American baseball player (Minnesota Twins, Boston Red Sox, Chicago Cubs), cancer. *Marc-Kanyan Case, 80, French Olympic footballer (1968). *Slaheddine Cherif, 85, Tunisian judge and politician. *Victoria de Stefano, 82, Italian- Venezuelan novelist. *Jacques Grattarola, 92, French footballer (Cannes, Saint-Étienne). *Sir Patrick Hogan, 83, New Zealand Hall of Fame racehorse breeder. (death announced on this date) *Danny Kaleikini, 85, American Hawaiian entertainer and singer. *Stuart McCutcheon, New Zealand academic administrator, vice-chancellor of the University of Auckland (2005–2020) and Victoria University of Wellington (2000–2004). *Carlos Monín, 83, Paraguayan football player (Toulouse, Red Star, national team) and manager. *David Penington, 92, Australian medical doctor and academic, vice-chancellor of the University of Melbourne (1988–1995). *Karl Pfeifer, 94, Austrian journalist (Jungle World). *Paula Quintana, 66, Chilean sociologist and politician. *Owen Roizman, 86, American cinematographer (The Exorcist, Network, The French Connection). *Dick Savitt, 95, American Hall of Fame tennis player. *Shen Lyu- shun, 73, Taiwanese diplomat, representative to the United States (2014–2016) and the United Kingdom (2011–2014). *Gianluca Vialli, 58, Italian football player (Sampdoria, national team) and manager (Chelsea), pancreatic cancer. === 7 === *Russell Banks, 82, American novelist (Continental Drift, The Sweet Hereafter, Cloudsplitter), cancer. *Frank Geleyn, 62, Belgian children's writer, neuroendocrine tumour. *Joseph A. Hardy III, 100, American businessman, founder of 84 Lumber. *William S. W. Lim, 90, Singaporean architect (Marine Parade Community Building, People's Park Complex, Golden Mile Complex). *Yuri Manin, 85, Russian mathematician (Gauss–Manin connection). *Zinaid Memišević, 72, Bosnian-Serbian actor (Bolji život). *Modeste M'bami, 40, Cameroonian footballer (Sedan, Paris Saint-Germain, national team), Olympic champion (2000), heart attack. *Adam Rich, 54, American actor (Eight Is Enough, Dungeons & Dragons, The Devil and Max Devlin). *Ken Scotland, 86, Scottish rugby union player (Leicester Tigers, national team) and cricketer (national team), cancer. *Tehemton Erach Udwadia, 88, Indian surgeon and gastroenterologist. === 8 === *Sietse Bosgra, 87, Dutch political activist. *Charles David Allis, 71, American molecular biologist. *Gundars Bērziņš, 63, Latvian accountant and politician, minister of finance (2000–2002). *Roberto Dinamite, 68, Brazilian footballer (Vasco da Gama, national team) and politician, deputy (1995–2015), colon cancer. *Patrick Grimlund, 50, Swedish television presenter, car crash. *Bernard Kalb, 100, American journalist (Reliable Sources, The New York Times), assistant secretary of state for public affairs (1985–1986), problems caused by a fall.Bernard Kalb, journalist and commentator, dies at 100 *Slim Newton, 90, Australian country music singer-songwriter (The Redback on the Toilet Seat). *Aleksey Slapovsky, 65, Russian novelist, playwright and screenwriter, pneumonia. *Keshari Nath Tripathi, 88, Indian politician, Uttar Pradesh MLA (1977–1980, 1989–2007), governor of West Bengal (2014–2019) and twice of Bihar. *Wu Tao, 82, Chinese diplomat, ambassador to Portugal (1992–1994), Russia (1998–2001) and Australia (2001–2003), COVID-19. === 9 === *Jaap van Benthem, 85, Dutch musicologist. *David Duckham, 76, English rugby union player (Coventry, national team). *Lynnette Hardaway, 51, American conservative activist (Diamond and Silk). *Adolfo Kaminsky, 97, Argentine-born French forger and resistant. *Yoshito Kishi, 85, Japanese chemist (Nozaki–Hiyama–Kishi reaction), cerebral infarction. *Yoriaki Matsudaira, 91, Japanese composer, pneumonia. *Ferenc Mészáros, 72, Hungarian footballer (Vasas SC, Vitória de Setúbal, national team). *K. Alex Müller, 95, Swiss physicist, Nobel Prize in Physics winner (1987). *Rehman Rahi, 97, Indian poet. *Charles Simic, 84, Serbian-born American poet, problems caused by dementia. *Norma Whiteman, 95, Australian cricketer (New South Wales, national team). (death announced on this date) === 10 === *Jeff Beck, 78, British Hall of Fame guitarist (The Yardbirds, The Jeff Beck Group, Beck, Bogert & Appice), six-time Grammy winner, bacterial meningitis. *Hans Belting, 87, German art historian. *Gaudenzio Bernasconi, 90, Italian footballer (Atalanta, Sampdoria, national team). *Jorge Calvo, 61, Argentine geologist and paleontologist. *Constantine II, 82, Greek monarch and sailor, King of the Hellenes (1964–1973) and Olympic champion (1960), stroke. *István Deák, 96, Hungarian- born American historian, member of the Hungarian Academy of Sciences. *Pierre Dorsini, 88, French footballer (Toulouse, Nancy). *Kalle Eller, 82, Estonian publisher, cultural researcher and poet. *He Ping, 65, Chinese movie director (Swordsmen in Double Flag Town, Sun Valley, Warriors of Heaven and Earth), cancer and heart attack. *Traudl Hecher, 79, Austrian Olympic ski racer (1960, 1964). *Blake Hounshell, 44, American journalist (The New York Times, Politico, Foreign Policy), suicide. *Bruce Murray, 82, New Zealand cricketer (Wellington, national team). *George Pell, 81, Australian Roman Catholic cardinal, archbishop of Melbourne (1996–2001) and Sydney (2001–2014), prefect of the Secretariat for the Economy of the Roman Curia (2014–2019), problems from hip replacement surgery. === 11 === *Shimon Baadani, 94, Israeli Orthodox rabbi, pneumonia. *Hamza Berkaoui, 36, Algerian sports journalist.Sports journalist Hamza Berkaoui passes away *Peter Campbell, 62, American water polo player, twice Olympic silver medalist (1984, 1988). *Carole Cook, 98, American actress (The Lucy Show, The Incredible Mr. Limpet, Sixteen Candles), heart failure. *Harriet Hall, 77, American air force flight surgeon. *Hussein el- Husseini, 85, Lebanese politician, speaker of the parliament (1984–1992). *Doming Lam, 96, Macanese-born Hong Kong classical composer. *Antonio Muratore, 95, Italian politician, senator (1983–1994). *Pavlo Naumenko, 57, Ukrainian aerospace engineer. *Eli Ostreicher, 59, British-born American serial entrepreneur, motorcycle accident. *Tatjana Patitz, 56, German model and actress (Rising Sun), breast cancer. *Murtaza Rakhimov, 88, Russian politician, president of Bashkortostan (1993–2010). *Yukihiro Takahashi, 70, Japanese drummer and singer (Yellow Magic Orchestra, Sadistic Mika Band, METAFIVE), aspiration pneumonia. === 12 === *Robbie Bachman, 69, Canadian hard rock drummer (Bachman–Turner Overdrive). *Gerrie Coetzee, 67, South African boxer, WBA heavyweight champion (1983–1984), cancer. *Henri De Wolf, 86, Belgian racing cyclist. *Joris Duytschaever, 78, Belgian academic, professor at the University Institution Antwerp. (death announced on this date) *Frene Ginwala, 90, South African politician and academic administrator, speaker of the National Assembly (1994–2004), chancellor of the University of KwaZulu- Natal (2005–2007), complications from a stroke. *Paul Johnson, 94, British journalist and historian (Modern Times: A History of the World from the 1920s to the 1980s, A History of the American People, A History of Christianity). *Otohiko Kaga, 93, Japanese author. *Ronald de Jong, 60, Dutch drugs trafficker. *Valentyna Lutayeva, 66, Ukrainian handball player, Olympic champion (1980).Олімпійська спільнота України зазнала тяжкої втрати *Lisa Marie Presley, 54, American singer-songwriter (\"Lights Out\", \"You Ain't Seen Nothin' Yet\"), cardiac arrest. *Lee Tinsley, 53, American baseball player (Boston Red Sox, Seattle Mariners, Philadelphia Phillies). *Bobby Wood, 87, American politician, member of the Tennessee House of Representatives (1976–2004). *Sharad Yadav, 75, Indian politician, MP (1974–1980, 1986–2017), minister of consumer affairs, food and public distribution (2002–2004). === 13 === *Sir Alan Budd, 85, British economist, chairman of the Office for Budget Responsibility (2010), heart attack. *Ray Cordeiro, 98, Hong Kong disc jockey (RTHK Radio 3) and actor (Games Gamblers Play, Security Unlimited). *Robbie Knievel, 60, American daredevil and stuntman, pancreatic cancer. *Klas Lestander, 91, Swedish biathlete, Olympic champion (1960). *Piet van Putten, 81, Dutch-born Belgian actor. *Claudio Willer, 82, Brazilian poet and translator, bladder cancer. === 14 === *Alireza Akbari, 61, Iranian-British politician and convicted spy, execution by hanging. (death announced on this date) *Matthias Carras, 58, German pop singer, cancer. *Santokh Singh Chaudhary, 76, Indian politician, MP (since 2014), heart attack. *Inna Churikova, 79, Russian actress (Jack Frost, The Very Same Munchhausen, Walking the Streets of Moscow). *Bernard Delemotte, 83, French diver and cameraman (Cousteau Society). *Carl Hahn, 96, German automotive industry executive, chairman of Volkswagen Group (1982–1993). *Mukarram Jah, 89, Indian royal, titular Nizam of Hyderabad (since 1967). *Craig Lowe, 65, American politician, mayor of Gainesville, Florida (2010–2013). *David Onley, 72, Canadian journalist, writer and politician, lieutenant governor of Ontario (2007–2014).Lieutenant Governor’s Statement On The Death Of The Honourable David C. Onley *Qian Yitai, 82, Chinese chemist, member of the Chinese Academy of Sciences. *Mansa Ram, 82, Indian politician, Himachal Pradesh MLA (1967–1977, 1982–1985, 1998–2003), kidney failure. *Benjamin Ashworth Ramsbottom, 93, British pastor. *Brian Tufano, 83, English cinematographer (Trainspotting, Billy Elliot, Shallow Grave). *Lieuwe Westra, 40, Dutch racing cyclist. === 15 === *Jane Cederqvist, 77, Swedish swimmer, Olympic silver medallist (1960), amyotrophic lateral sclerosis. *C. J. Harris, 31, American singer (American Idol). *Piet van Heusden, 93, Dutch track cyclist, world champion (1952). *Vakhtang Kikabidze, 84, Georgian singer, actor (Mimino, Don't Grieve) and politician, MP (since 2020), brain cancer. *Jan Krol, 60, Dutch actor. *Gordana Kuić, 80, Serbian novelist (The Scent of Rain in the Balkans). (death announced on this date) *Albert Megens, 83, Dutch poet. *Shaye Al-Nafisah, 60, Saudi Arabian footballer (Al-Kawab, national team). *Gino Odjick, 52, Canadian ice hockey player (Vancouver Canucks, New York Islanders, Montreal Canadiens), heart attack. *Ruslan Otverchenko, 33, Ukrainian basketball player (BC Budivelnyk, SC Prometey, national team), heart disease. *Fons Panis, 90, Dutch politician, mayor of Maartensdijk (1973–1978) and Leusden (1987–1997). *Dilip Sardjoe, 73, Surinamese businessman and politician. *Ted Savage, 86, American baseball player (St. Louis Cardinals, Chicago Cubs, Los Angeles Dodgers). *Gáspár Miklós Tamás, 74, Hungarian columnist (openDemocracy) and politician, MP (1989–1994). *Yoshimitsu Yamada, 84, Japanese aikido instructor. === 16 === *John Bicourt, 77, British Olympic middle-distance runner (1972, 1976). (death announced on this date) *Mousse Boulanger, 96, Swiss writer and journalist. *Pierre Danos, 93, French rugby union player (RC Toulon, AS Béziers Hérault, national team). *Gina Lollobrigida, 95, Italian actress (Bread, Love and Dreams, The Wayward Wife, Flesh and the Woman). *Jim Molan, 72, Australian politician, senator (2017–2019, since 2019), cancer. *Arthur Ravenel Jr., 95, American politician, member of the South Carolina House of Representatives (1953–1959) and twice of the Senate, member of the U.S. House of Representatives (1987–1995). *Frank Thomas, 93, American baseball player (New York Mets, Pittsburgh Pirates, Philadelphia Phillies). === 17 === *Jay Briscoe, 38, American professional wrestler (ROH, CZW, NJPW), car accident. *Teodor Corban, 65, Romanian actor (12:08 East of Bucharest, 4 Months, 3 Weeks and 2 Days, Tales from the Golden Age). *Leon Dubinsky, 81, Canadian actor (Life Classes, Pit Pony), theatre director and composer (\"Rise Again\"). *Renée Geyer, 69, Australian singer (\"Say I Love You\", \"Heading in the Right Direction\", \"Stares and Whispers\"), complications from hip surgery. *Badara Joof, 65, Gambian politician, vice- president (since 2022). *Gino Landi, 89, Italian choreographer and television and theatre director. *Arjan Paans, 53, Dutch journalist, cancer. *Lucile Randon, 118, French supercentenarian, world's oldest living person (since 2022). *Cornelius Rogge, 90, Dutch sculptor and installation artist. *Vladimir Rusalov, 83, Russian psychologist and anthropologist. *Paul Soulikias, 96, Greek-Canadian painter, pneumonia. *Stanislav Tereba, 85, Czech photojournalist. *Nicola Zamboni, 79, Italian sculptor. === 18 === *Herman Coessens, 78, Belgian actor. (death announced on this date) *David Crosby, 81, American Hall of Fame singer (The Byrds, Crosby, Stills, Nash & Young) and songwriter (\"Almost Cut My Hair\"). *Notable Ukrainians killed in the 2023 Brovary helicopter crash: **Yurii Lubkovych, 33, diplomat. **Denys Monastyrsky, 42, politician, minister of internal affairs (since 2021) and MP (2019–2021). **Yevhen Yenin, 42, politician, deputy minister of internal affairs (since 2021). === 19 === *Ruud Englebert, 72, Dutch bass guitarist and composer. *Jos Van Riel, 79, Belgian footballer (Royal Antwerp F.C.). === 20 === *Sal Bando, 78, American Hall of Fame baseball player (Kansas City/Oakland Athletics, Milwaukee Brewers), World Series champion (1972, 1973, 1974), cancer. *Bert Bosman, 77, Dutch footballer (). *Jerry Blavat, 82, American DJ and radio presenter. *Stella Chiweshe, 76, Zimbabwean musician. *Mathy Engelen, 65, Belgian painter. *Olivia Geerolf, 72, Belgian choreographer. *Julien Goekint, 93, Belgian politician, mayor of Ostend (1980–1997). *Harunata, 69, Indonesian bureaucrat and politician. *Arno van der Heyden, 61, Dutch comedian, singer, presenter and actor. *Chris Leitch, 69, New Zealand politician, cancer. *Nano Riantiarno, 73, Indonesian playwright. === 21 === *Tim Barlow, 86–87, English actor (Doctor Who, Les Misérables, Hot Fuzz). (death announced on this date) *Ritt Bjerregaard, 81, Danish politician, lord mayor of Copenhagen (2006–2009). *Micheál MacGréil, 93, Irish Jesuit priest, sociologist and author. *Tom Nairn, 90, Scottish political theorist, fall. *Marek Plura, 52, Polish politician and psychotherapist, MEP (2014–2019), problems caused by spinal muscular atrophy. *Bill Schonely, 93, American sports broadcaster (Portland Trail Blazers). *Harjit Singh Arora, 61, Indian Air Force officer, vice chief of the air staff (2019–2021). === 22 === *Vaughan Johnson, 75, Australian politician, Queensland MLA (1989–2015). === 23 === *Joseph Agassi, 95, Israeli philosopher and author (The Continuing Revolution). === 24 === *Top Topham, 75, English guitarist (The Yardbirds). (death announced on this date) === 25 === *Titewhai Harawira, 90, New Zealand Māori activist. === 26 === *Irvine Shillingford, 78, Dominican cricketer (West Indies). (death announced on this date) *Keith Thomson, 81, New Zealand Olympic field hockey player (1968), and cricketer (Canterbury, national team). === 27 === *Sylvia Syms, 89, English actress (At Home with the Braithwaites, The Queen, Ice Cold in Alex). === 28 === *, 76, French actor (The Accuser, L'argent des autres, The Dogs) and stage director. *V.R. Das, 73, Indian film producer (Mizhikal Sakshi). *Hussain Rabi Gandhi, 74, Indian writer and political activist. *, 83, Spanish politician, philosopher and writer, deputy (1982–1986) and MEP (1986–1994). *Carlo Tavecchio, 79, Italian football executive, president of the FIGC (2014–2017), lung disease. === 29 === *Hazel McCallion, 101, Canadian politician, mayor of Mississauga (1978–2014). *Barrett Strong, 81, American singer (\"Money (That's What I Want)\") and songwriter (\"I Heard It Through the Grapevine\", \"Papa Was a Rollin' Stone\"). === 31 === *Charlie Thomas, 85, American singer (The Drifters), liver cancer. (death announced on this date) ==Months== * February * March * April * May ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *01 Category:January 2023 events",
 "title": "Deaths in January 2023"
}