{
 "id": "986371",
 "text": "The following is a list of deaths that happened in June 2023. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known), and a source. ==June== === 1 === *Margit Carstensen, 83, German actress (The Bitter Tears of Petra von Kant, Martha, Possession).Schauspielerin Margit Carstensen ist tot *Anna Shay, 62, Japanese-born American socialite, businesswoman and television personality (Bling Empire), stroke. *Cynthia Weil, 82, American Hall of Fame songwriter (\"You've Lost That Lovin' Feelin'\", \"Here You Come Again\", \"Through the Fire\").Cynthia Weil, Grammy winning lyricist who had hits with husband Barry Mann, dead at 82 === 2 === * Jacques Rozier, 96, French film director (Adieu Philippine, Du Cote D'Orouet, Maine-Ocean Express).Le cinéaste Jacques Rozier, figure de la Nouvelle Vague, est mort * Kaija Saariaho, 70, Finnish composer. === 3 === *Paul Geoffrey, 68, British-born American actor (Excalibur, Greystoke: The Legend of Tarzan, Lord of the Apes, Emily Brontë's Wuthering Heights), cancer.Paul Geoffrey Dies: Actor In ‘Excalibur’ Was 68 *John Regala, 55, Filipino actor (That's Entertainment, The Fatima Buen Story, Batas Ko Ay Bala), complications from cirrhosis.Veteran actor John Regala dies at 55 *Mario Sábato, 78, Argentine film director (Y que patatín...y que patatán, Los golpes bajos, The Power of Darkness) and screenwriter.A los 78 años, murió Mario Sabato === 4 === * Marian Aryana, 90, Uruguayian architect. === 5 === * Robert Hanssen, 79, American FBI. === 6 === * Linda Burdette, 74, American gymnastics coach. *Pat Cooper, 93, American actor (Fighting Back, Analyze This, Analyze That) and comedian.Pat Cooper, Comedian of Outrage, Is Dead at 93 *Noreen Nash, 99, American actress (The Big Fix, Phantom from Space, Giant).Noreen Whitmore === 7 === *Irma Capece Minutolo, 87, Italian operatic singer and actress (Neapolitans in Milan, Young Toscanini).Morta la cantante Irma Capece Minutolo, legata a re Faruq * Sir Ivan Menezes, 63, Idaian born American. === 8 === * Renato Longo, 85 Italian cross racer. === 9 === *Peter Belli, 79, Danish singer and actor (The Double Man, Truly Human).Peter Belli er død === 10 === *Ted Kaczynski, 81, American mathematician and domestic terrorist (Unabomber Manifesto).Unabomber Ted Kaczynski found dead in prison cell *Fakhri Khorvash, 94, Iranian actress (Mr. Naive, Chess of the Wind, A Little Kiss).فخری خوروش درگذشت *Yannis Markopoulos, 84, Greek composer (Young Aphrodites, Sin, Who Pays the Ferryman?), cancer.The great composer Yannis Markopoulos has died === 11 === * Mangal Dhillon, 64, Idaian actor. === 12 === *Silvio Berlusconi, 86, Italian politician, three-time prime minister, MP (1994–2013, since 2022) and twice MEP, leukemia.Silvio Berlusconi è morto *Treat Williams, 71, American actor (Hair, Everwood, Once Upon a Time in America), traffic collision.Treat Williams, Star of 'Everwood' and 'Hair,' Dead at 71 Following Motorcycle Accident === 13 === * David M. Bartley, 88, American politician. === 14 === *Raimondo Crociani, 77, Italian film editor (A Special Day, We All Loved Each Other So Much, Le Bal).Si è spento Raimondo Crociani, montatore cinematografico e regista romano che viveva a Santa Margherita di Belìce === 15 === *Glenda Jackson, 87, English actress (Women in Love, Sunday Bloody Sunday), Oscar winner (1970, 1973), and politician, MP (1992–2015).Glenda Jackson: Oscar-winning actress and former MP dies at 87 ===16=== * Anadi Charan Das, 88, Indian politician. ===17=== * Oleg Betin, 72, Russian politican. ===18=== * Sheldon Bergstrom, 51, Canadian actor (A.R.C.H.I.E., SuperGrid, I Downloaded a Ghost).‘To know him was to love him’: Prince Albert’s Sheldon Bergstrom passes away * Poojappura Ravi, 83, Indian actor. ===19=== * Liviu Hodorcă, 61, Romanian rugby union player (Steaua București, national team).A murit Liviu Hodorcă. Fostul campion avea 63 de ani ===20=== * Jim McCourt, 79, Irish boxer. ===21=== * Tom Roper, 70, Maltese Roman Catholic clergyman. ===22=== * Peter Allan, 87, Australian cricketer (Queensland, national team). (death announced on this date) ===23=== *Frederic Forrest, 86, American actor (The Rose, The Conversation, Apocalypse Now).Bette Midler Mourns 'The Rose' Co-Star Frederic Forrest: 'Lucky to Have Him' (death announced on this date) *Kunto Ojansivu, 63, Finnish actor (Elf Toljander, Sibelius, Rentun Ruusu).Tonttu Toljanterina tunnettu näyttelijä Kunto Ojansivu on kuollut *Bev Risman, 85, English rugby union (national team) and league (Leigh, Leeds) player and coach.Bev Risman OBE: Dual-code England & Great Britain rugby international dies, aged 85 (death announced on this date) ===24=== * Claude Barzotti, 69, Italian pronunciation. *Julian Sands, 65, British actor (A Room with a View, The Killing Fields, 24), hiking accident.Julian Sands, Star of ‘A Room With a View,’ Died in January Hiking Accident, Authorities Confirm (body discovered on this date) ===25=== * Simon Crean, 69, Belgian singer. * James Crown, 70, American businessman, racing collision.James Crown, owner of Aspen Skiing Co., dies in crash at Aspen Motorsports Park * John B. Goodenough, 100, American materials scientist, Nobel Prize laureate (2019).Goodenough, Nobel laureate who gave the world Li- ion batteries, passes away ===26 === *Nicolas Coster, 89, British-American actor (Santa Barbara, Another World, All the President's Men). *Ysabelle Lacamp, 68, French writer, singer, and actress (Je vous aime, Fire, Ice and Dynamite).Ysabelle Lacamp, actrice et romancière, est morte à 68 ans ===27 === *Carmen Sevilla, 92, Spanish actress (Vengeance, Don Juan, King of Kings), singer and dancer.Muere Carmen Sevilla a los 92 años ===28=== *Lowell Weicker, 92, American politician, former United States Senator and Governor of Connecticut (1991-95). ===29 === *Alan Arkin, 89, American actor (Little Miss Sunshine, Argo, The Russians Are Coming, the Russians Are Coming), Oscar winner (2006).Alan Arkin, Oscar-Winning 'Little Miss Sunshine' Actor, Dead at 89 *Clarence Barlow, 77, British composer, complications from a fall.Composer Clarence Barlow has Died, Aged 77 (death announced on this date) *Angel Wagenstein, 100, Bulgarian screenwriter (Stars, Goya or the Hard Way to Enlightenment, Eolomea).На 100 години си отиде Анжел Вагенщайн *Christine King Farris, 95, American civil rights leader * Angela Zilia, 88, Greek actress. ===30=== *Judi Farr, 83–84, Australian actress (My Name's McGooley, What's Yours?, Kingswood Country).Australian actor Judi Farr has died (death announced on this date) *Lord Creator, 87, Trinidad-born Jamaican singer- songwriter (\"Kingston Town\").Ska, rocksteady artiste Lord Creator has died ==Months== * January * February * March * April * May ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *06 Category:June 2023 events",
 "title": "Deaths in June 2023"
}