{
 "id": "986367",
 "text": "The following is a list of deaths that should be noted in February 2023. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Every entry must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==February == === 1 === *Leonard Pietraszak, 86, Polish actor (Vabank, Danton, Kingsajz).Nie żyje Leonard Pietraszak, Honorowy Obywatel Bydgoszczy === 2 === *John Zizioulas, 92, Greek Orthodox prelate, metropolitan of Pergamon (since 1986), COVID-19.Εκοιμήθη ο Μητροπολίτης Γέρων Περγάμου Ιωάννης === 3 === *Jemal Gaganidze, 89, Georgian actor (Don't Grieve, The Saplings, The Wishing Tree).Ушел из жизни звезда фильма «Не горюй!» Джемал Гаганидзе *Shevah Weiss, 87, Polish-born Israeli politician, member (1981–1999) and speaker (1992–1996) of the Knesset.שבח וייס, יו\"ר הכנסת ושגריר ישראל בפולין לשעבר, מת בגיל 87 === 4 === *Sherif Ismail, 67, Egyptian politician, prime minister (2015–2018).President Sisi Mourns Death of Former PM Sherif Ismail === 5 === *Pervez Musharraf, 79, Pakistani politician and Army general, president (2001–2008).Pervez Musharraf, former Pakistan President, passes away after prolonged illness in Dubai === 6 === *Abdellatif Ben Ammar, 79, Tunisian film director (A Simple Story, Aziza).Le cinéaste Abdellatif ben Ammar tire sa révérence *Lubomír Štrougal, 98, Czech politician, prime minister of Czechoslovakia (1970–1988).Zemřel expremiér Lubomír Štrougal === 7 === *Fernando Becerril, 78, Mexican actor (Zapata: el sueño del héroe, The Legend of Zorro, Get the Gringo).Fernando Becerril, actor de El Crimen del Padre Amaro, murió a los 78 años === 8 === *Burt Bacharach, 94, American Hall of Fame composer (\"Raindrops Keep Fallin' on My Head\", \"Walk On By\", \"Arthur's Theme (Best That You Can Do)\"), six-time Grammy winner.Burt Bacharach, master of pop songwriting, dies aged 94 *Branka Veselinović, 104, Serbian actress (A Child of the Community).Čuvena glumica Branka Veselinović preminula je u 105. godini života === 10 === *Hugh Hudson, 86, English film director (Chariots of Fire, Greystoke: The Legend of Tarzan, Lord of the Apes, My Life So Far).Chariots of Fire director Hugh Hudson dies aged 86 *Princess Marie Gabrielle of Luxembourg, 97, Luxembourgish royal.Décès de la Princesse Marie- Gabrielle de Luxembourg *Carlos Saura, 91, Spanish film director (Mama Turns 100, Carmen, El Amor Brujo), respiratory failure.Muere Carlos Saura a los 91 años, el último director clásico del cine español *Nancy Tichborne, 80, New Zealand watercolour artist and gardener.Nancy Tichborne obituary === 11 === *Hans Modrow, 95, German politician, Chairman of the Council of Ministers of East Germany (1989–1990), MEP (1999–2004) and MP (1957–1994).Hans Modrow ist tot === 12 === *Vadim Abdrashitov, 78, Russian film director (Fox Hunting, The Train Has Stopped, Planet Parade).Умер режиссер Вадим Абдрашитов *David Jude Jolicoeur, 54, American rapper (De La Soul) and songwriter (\"Me Myself and I\", \"Feel Good Inc.\"), Grammy winner (2006).De La Soul’s Trugoy The Dove Has Died *Billy Two Rivers, 87, Canadian professional wrestler (GPW), actor (Black Robe), and chief of the Mohawks of Kahnawà:ke (1978–1998).Billy Two Rivers dead at 87... a personal take === 13 === *Zia Mohyeddin, 91, British- Pakistani actor (Lawrence of Arabia, Khartoum, Ashanti) and television broadcaster.Zia Mohyeddin passes away at 91 === 15 === *Raquel Welch, 82, American actress (One Million Years BC, The Three Musketeers, Fantastic Voyage).Actress and model Raquel Welch dies at 82 === 16 === *Jana Andrsová, 83, Czech dancer and actress (The Strakonice Bagpiper, Jak se Franta naučil bát).Zemřela tanečnice, herečka a bývalá sólistka Laterny magiky Jana Andrsová *Michel Deville, 91, French film director (The Reader, Le Voyage en douce, Death in a French Garden).Le cinéaste Michel Deville est mort *Marilú, 95, Mexican singer and actress (El barchante Neguib).Cantante y actriz Marilú, 'La Muñequita que Canta' muere a los 95 años === 17 === *Jenny Clève, 92, French actress (F comme Fairbanks, One Deadly Summer, Welcome to the Sticks).Jenny Clève : l'actrice de l'Eté meurtrier et Bienvenue chez les Ch'tis est morte à 92 ans *Stella Stevens, 84, American actress (Girls! Girls! Girls!, The Nutty Professor, The Poseidon Adventure), complications from Alzheimer's disease.Stella Stevens Dies; ‘Poseidon Adventure’ Actress & Elvis Presley, Jerry Lewis Co-Star Was 84 *Lee Whitlock, 54, British actor (Shine on Harvey Moon, Cassandra's Dream, Grange Hill).Lee Whitlock dies aged 54 as fans pay tribute to Grange Hill and Sweeney Todd star *Tom Whitlock, 68–69, American songwriter (\"Danger Zone\", \"Take My Breath Away\", \"Winner Takes It All\"), Oscar winner (1987), complications from Alzheimer's disease.Friends mourn Tom Whitlock, Springfield writer of 'Danger Zone' and 'Take My Breath Away' === 18 === *Barbara Bosson, 83, American actress (Hill Street Blues, The Last Starfighter, Murder One).Barbara Bosson, Emmy-Nominated Actress on ‘Hill Street Blues,’ Dies at 83 *George T. Miller, 79, Scottish-born Australian film director (The Man from Snowy River, The NeverEnding Story II: The Next Chapter, Zeus and Roxanne), heart attack.Australian film director George Miller, of Man From Snowy River fame, dies === 19 === *Richard Belzer, 78, American actor (Homicide: Life on the Street, Law & Order: Special Victims Unit, The Flash), stand-up comedian, and author.Richard Belzer Dead: The Actor And Comedian Was 78 === 20 === *Bruce Barthol, 75, American bassist (Country Joe and the Fish).Bruce Barthol, Country Joe & the Fish bassist, dies at 75 === 21 === *Mimika Luca, 85, Albanian actress (Our Friend Tili, Botë e padukshme, A Tale from the Past) and dancer.Ndahet nga jeta aktorja e njohur e kinematografisë shqiptare, Mimika Luca *Nadja Tiller, 93, Austrian actress (Rosemary, The Rough and the Smooth, Wanted: Babysitter).Schauspielerin Nadja Tiller mit 93 Jahren gestorben === 22 === *Ahmed Qurei, 85, Palestinian politician, prime minister (2003–2006).Former Palestinian PM and negotiator Ahmed Qurei dies aged 85 === 23 === *Tony Earl, 86, American politician, governor of Wisconsin (1983–1987) and member of the Wisconsin State Assembly (1969–1975), stroke.Tony Earl, Wisconsin's 41st governor who championed the environment, equal rights, dies at age 86 === 24 === *James Abourezk, 92, former United States Senator. *Juraj Jakubisko, 84, Slovak film director and screenwriter (Birds, Orphans and Fools, The Millennial Bee, The Feather Fairy).Juraj Jakubisko odišiel do večnosti, zostali nám nesmrteľné filmy *Walter Mirisch, 101, American film producer (In the Heat of the Night, Midway, The Hawaiians), Oscar winner (1967).Walter Mirisch, Oscar-Winning Producer of ‘In the Heat of the Night,’ Dies at 101 *Devisingh Ransingh Shekhawat, 89, Indian politician, first gentleman (2007–2012) and Maharashtra MLA (1985–1990), complications from a fall.Devisingh Shekhawat: माजी राष्ट्रपती प्रतिभाताई पाटील यांचे पती देवीसिंह शेखावत यांचं निधन === 25 === * Gordon Pinsent, 92, Canadian actor. * Syd Fischer, 95, Australian. === 26 === *Betty Boothroyd, Baroness Boothroyd, 93, British politician, member (1973–2000) and speaker (1992–2000) of the House of Commons.Baroness Boothroyd, first female Speaker of the House of Commons, has died aged 93 *Valeria Ogășanu, 76, Romanian actress (Michael the Brave, The Yellow Rose).Actrița Valeria Ogășanu, soția actorului Virgil Ogășanu, a murit la vârsta de 76 de ani. Chiar fiul lor a făcut anunțul: „Drum lin în Lumină, iubită mamă!” *Ans Westra, 86, Dutch-born New Zealand photographer (Washday at the Pa).Pioneering photographer Ans Westra dies, aged 86 === 27 === *Chester Borrows, 65, New Zealand politician, MP (2005–2017), cancer.Former MP Chester Borrows dies after cancer battle *Paul East, 76, New Zealand politician, MP (1978–1999), attorney-general (1990–1997) and minister of defence (1996–1997).Former Rotorua MP and National Party Cabinet minister Paul East dies (death announced on this date) *Andrzej Kozak, 82, Polish actor (Westerplatte, The Deluge, Przeklęte oko proroka).Andrzej Kozak nie żyje. Aktor znany z serialu \"Klan\" miał 82 lata === 28 === *Ricou Browning, 93, American actor (Creature from the Black Lagoon, Revenge of the Creature) and television director (Flipper).Original ‘Creature from the Black Lagoon’ Performer Ricou Browning Has Passed Away (death announced on this date) *Yvonne Constant, 92, French actress (Gigot, Monkeys, Go Home!, Their Last Night), singer and ballerina.Comédienne, danseuse et chanteuse, Yvonne Constant est morte à Larmor-Plage *Grant Turner, 64, New Zealand footballer (Stop Out, national team), cancer.Former All Whites legend Grant Turner dies (death announced on this date) ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *02 Category:February 2023 events",
 "title": "Deaths in February 2023"
}