{
 "id": "986344",
 "text": "The Battle of the Svatove–Kreminna lineAFU Prepare Frontline Breakthrough Along Svatove-Kreminna LineRUSSIAN OFFENSIVE CAMPAIGN ASSESSMENT, DECEMBER 19Main battles on Monday continue on Svatove-Kreminna line, near Bakhmut – ISW is an ongoing battle (as of 2023's third quarter) between Russia and Ukraine. It is being fought in Eastern Ukraine. It is along a frontline running from the city of Svatove to the city of Kreminna. The battle started on 2 October 2022. It started a day after the Ukrainian Army took back the nearby city of Lyman. == Background == Kreminna was the first city to fall during the Donbas Offensive that was announced by Russia on April 18, 2022. Svatove fell on 6 March during Eastern Ukraine campaign. == Battle == On the night of 27–28 September, Ukrainian soldiers went across the Siverskyi Donets River in Dronivka. They took the Siverskyi Donets Forest Park and blocked the important Kreminna-Torske road. Russian soldiers retreating from Lyman after the second battle for the town went to fortify Kreminna. On 2 October, Ukrainian soldiers began bombarding the Russians in Kreminna. The Ukrainians took land up to the R-66 highway. Russian soldiers put land mines on every road between Kreminna and Svatove to defeat Ukrainian attacks. Between 2 and 13 October, Ukrainian soldiers captured 14 towns and villages along the Kharkiv-Luhansk border. The largest of the towns captured is Borova. Ukrainian soldiers also went towards Chervonopopivka on the Svatove-Kreminna highway. However, they were pushed back from there by October 5. Two more villages were taken by Ukrainian soldiers on 24 October. Neither side took much territory during November. Still, there were many battles going on every day. On the night of 2 November, Ukrainian sources claimed to have destroyed a Russian battalion near the town of Makiivka, in Svatove Raion. According to a Russian survivor of the attack, out of the 570 soldiers in his unit, 29 survived, 12 were wounded, and the other 529 men had been killed.Battalion of Russian draftees reportedly wiped out near Ukraine’s Makiivka, survivor says hundreds killed By early December, Ukraine had moved forward to the hills west of Chervonopopivka. In early December, Ukrainian soldiers broke through Russian lines near Chervonopopivka. Fighting was mostly west of the R-66 highway between Kreminna and Svatove. In December, many battles started along the line. Both Russian and Ukrainian soldiers made daily attacks. On 18 December, a video showed Ukrainian soldiers moving forward in the Serebryansky forest south of Kreminna. On 26 December, Luhansk Oblast governor Serhiy Haidai said that fighting was happening near Kreminna. The Russian command there moved to Rubizhne during the fighting. == Related pages == *Warfare in eastern Ukraine after Russia's 2022 invasion == References == Kreminna Category:October 2022 events Category:November 2022 events Category:Russo-Ukrainian War",
 "title": "Battle of the Svatove–Kreminna line"
}