{
 "id": "986377",
 "text": "The following is a list of deaths that should be noted in December 2023. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Every entry must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==December 2023== ===1=== *Burny Bos, 79, Dutch film producer (Miss Minoes, Mijn Franse tante Gazeuse), screenwriter and children's author, mesothelioma.Abeltje-producent en acteur Burny Bos op 79-jarige leeftijd overleden *Brigit Forsyth, 83, Scottish actress (Whatever Happened to the Likely Lads?, Boon, Still Open All Hours). *, 79, Turkish actor (Medcezir), screenwriter and educator. *Enzo Bai, 92, Argentine actor (La Mary, The Kids Grow Up, Los hijos de López).Falleció el actor Enzo Bai *Kiki Fatmala, 56, Indonesian actress, lung cancer. *Sandra Day O’Connor, 93, Former Associate Justice of the Supreme Court of the United States. ===2=== *Faustin Twagiramungu, 78, Rwandan politician, prime minister (1994–1995).Twagiramungu wigeze kuba Minisitiri w’Intebe w’u Rwanda yapfuye *Sufian Tayeh, Palestinian scietist. *Concha Velasco, 84, Spanish actress (The Witching Hour, Esquilache, 32 Malasana Street), singer and television presenter.Concha Velasco muere a los 84 años en Madrid ===3=== *Andrea Fay Friedman, 53, American actress (Life Goes On, Family Guy), complications from Alzheimer's disease.Andrea Fay Friedman, 'Life Goes On' Actor With Down Syndrome, Dies at 53 *Myles Goodwyn, 75, Canadian singer (April Wine) and songwriter (\"Tonite Is a Wonderful Time to Fall in Love\", \"Just Between You and Me\").Myles Goodwyn, former April Wine singer, dead at 75 *Kim Soo-yong, 94, South Korean film director (The Sea Village, Mist, The Land).‘저 하늘에도 슬픔이’ 김수용 감독 별세 *Suminda Sirisena, 75, Sri Lankan actor (Duhulu Malak, Saptha Kanya, Yakada Pihatu).Veteran actor Suminda Sirisena passes away ===4=== *Peter R. Adam, 66, German film editor (An American Werewolf in Paris, Good Bye, Lenin!, Anonymous)Die Deutsche Filmakademie nimmt Abschied von Peter R. Adam *Suren Babayan, 73, Armenian film director (The 13th Apostle) and actor.Կյանքից հեռացել է կինոռեժիսոր Սուրեն Բաբայանը *Juanita Castro, 90, Cuban political dissident.Muere en Miami Juanita Castro, hermana de Fidel Castro *Queta Lavat, 94, Mexican actress (Las tandas del principal, Cruz de amor, Clase 406).¿De qué murió Queta Lavat, el ícono del Cine de Oro que probó suerte en TikTok? ===5=== * Prince Constantin of Liechtenstein, 51, Liechtensteiner royal.Medienmitteilung aus dem Fürstenhaus * Denny Laine, 79, English Hall of Fame musician (Wings, The Moody Blues) and songwriter (\"Mull of Kintyre\"), interstitial lung disease.Denny Laine, Wings and Moody Blues musician, dies age 79 * Norman Lear, 101, American Hall of Fame screenwriter and producer (All in the Family, Maude, The Jeffersons).Norman Lear, Sitcom Genius and Citizen Activist, Dies at 101 ===6=== * Fran Bladel, 90, Australian politician. * Natalya Bogomolova, 83, Russian animator (Winnie-the-Pooh, The Blue Bird, Alice's Birthday).Умерла художник мультфильмов \"Халиф-аист\" и \"Котенок по имени Гав\" Наталья Богомолова * Vic Davalillo, 84, Venezuelan baseball player (Cleveland Indians, Pittsburgh Pirates, Los Angeles Dodgers).Fallece Vítico Davalillo, leyenda venezolana en Grandes Ligas y la LVBP * Jack Hogan, 94, American actor (Combat!). Jack Hogan, ‘Combat!’ Star, Dies at 94 * Mirosława Krajewska, 83, Polish actress (How to Be Loved, Brunet wieczorową porą).Nie żyje aktorka Mirosława Krajewska-Marczewska * John McBeth, 79, New Zealand author and journalist.John McBeth, Asia’s Longest Serving Foreign Correspondent, Dies at 79 * Marisa Pavan, 91, Italian actress (The Rose Tattoo, I Chose Love, Drum Beat).L'actrice Marisa Pavan est morte à l'âge de 91 ans ===7=== * Itziar Castro, 46, Spanish actress (Rec 3: Genesis, Skins, Champions).Muere la actriz Itziar Castro a los 46 años * Sang Guowei, Chinese pharmacologist and politician *Guy Stern, 101, German-American intelligence officer (Ritchie Boys).Holocaust-Überlebender Guy Stern mit 101 Jahren gestorben * Benjamin Zephaniah, 65, British poet, writer (Face, Refugee Boy) and actor (Peaky Blinders), brain tumour.Benjamin Zephaniah death: British writer and poet known for his work on race and racism dies, aged 65 ===8=== * Clyde Butts, 66, Guyanese cricketer (West Indies), traffic collision.Former West Indies Cricketer Clyde Butts killed in car crash * Carlos Jurado, 76, Uruguayan football player (national team) and manager (Cienciano, Tampico Madero), cardiac arrest.Luto en el fútbol hondureño: Fallece Carlos Jurado, exentrenador del Motagua y Deportes Savio * Ryan O'Neal, 82, American actor (Love Story, What's Up, Doc?, Paper Moon).Ryan O’Neal, Star of ‘Love Story,’ ‘What’s Up, Doc?’ and ‘Paper Moon,’ Dies at 82 * Joe Solomon, 93, Guyanese cricketer (West Indies).Former West Indies Test Cricket Icon Joe Solomon Passes Away At 93 * Yayu Unru, 61, Indonesian actor (Lovely Man, Night Bus, Posesif) and acting coach.Kabar Duka, Yayu Unru Meninggal Dunia Pasca 2 Kali Terkena Serangan Jantung ===9=== * Maxim Gustik, 35, Belarusian Olympic freestyle skier (2018, 2022), traffic collision. * , 98, Turkish doctor and choir conductor, State Artist (1987).Türk müziğinin ünlü isimlerinden Nevzat Atlığ yaşamını yitirdi * Mainul Hosein, 83, Bangladeshi lawyer and politician, cancer. ===10=== *Julian Carroll, 92, American politician, governor (1974–1979) and lieutenant governor (1971–1974) of Kentucky, member of the Kentucky Senate (2005–2020).Former Kentucky Governor Julian Carroll dies at 92 *David Drake, 78, American author of science fiction and fantasy literature.David Drake *Shirley Anne Field, 87, English actress (The Entertainer, The Damned, Alfie).Shirley Anne Field, The Entertainer and Alfie actor, dead at 87 ===11=== *Andre Braugher, 61, American actor (Homicide: Life on the Street, Brooklyn Nine-Nine, Glory), Emmy winner (1998, 2006).Andre Braugher Dies: Star Of ‘Homicide: Life On The Street’, ‘Brooklyn Nine-Nine’ & Other Series And Films Was 61 *Richard Kerr, 78, English singer, songwriter (\"Brandy\", \"I'll Never Love This Way Again\", \"Looks Like We Made It\") and composer.A tribute to Richard Kerr (death announced on this date) *Essra Mohawk, 75, American singer-songwriter (\"Primordial Lovers\", \"Change of Heart\").Essra Mohawk, Singer-Songwriter With Ties to Zappa, Garcia, Lauper, Tina and ‘Schoolhouse Rock,’ Dies *Paulin Obame-Nguema, 88, Gabonese politician, prime minister (1994–1999).Disparition : Paulin Obame Nguéma, ce Premier ministre tout en humilité *Renée, 94, New Zealand feminist writer and playwright (Wednesday to Come, Pass It On).Author and playwright Renée dies, aged 94 *Camden Toy, 68, American actor (The Bay) and film editor.Buffy the Vampire Slayer, Angel Actor Camden Toy Passes Away ===12=== *Shirley Barber, 88, English author. *Fusa Tatsumi, 116, Japanese supercentenarian.国内最高齢の女性 巽フサさんが亡くなる…116歳 今年9月には吉村知事からお祝い状も *Mario Valdemarin, 96, Italian actor (Hercules and the Conquest of Atlantis, Sandokan the Great, The End of the Night).E’ morto l’attore Mario Valdemarin ===13=== *Yılmaz Atadeniz, 91, Turkish film director (Killing in Istanbul, The Deathless Devil), producer (A Season in Hakkari) and screenwriter, COVID-19.Yeşilçam'ın usta yönetmeni Yılmaz Atadeniz hayatını kaybetti *Antonio Juliano, 80, Italian footballer (Napoli, Bologna, national team).Morto Antonio Juliano: addio alla bandiera del Napoli e storico dirigente di Maradona e Krol *Zofia Merle, 85, Polish actress (The Codes, Nights and Days, Chopin: Desire for Love).Nie żyje wybitna aktorka Zofia Merle *Derek Stirling, 62, New Zealand cricketer (national team), cancer.Former New Zealand fast bowler Derek Stirling dies, aged 62 *, 60, Russian writer, journalist and screenwriter. *Verica Nedeljković, 94, Serbian chess player. *Des White, 96, New Zealand Hall of Fame rugby league player (Auckland, national team) and coach (national team).Des White, Kiwis rugby league legend passes away (death announced on this date) ===14=== *Bernard Destouches, 63, French actor (Taxi, To Each, Her Own, Promise at Dawn).Mort de Bernard Destouches : le comédien de Plus belle la vie et de la saga Taxi est décédé à 63 ans *, 80, Azerbaijani actor (My Seven Sons, Birthday, Interrogation). *Lee Redmond, 82, American world record holder, longest fingernails on both hands.Lee Redmond, who once had the longest fingernails ever, dies just days before Christmas *Ra. Sankaran, 92, Indian film director (Then Sindhudhe Vaanam) and actor (Mouna Ragam, Pondatti Thevai). ===15=== *Abdulaziz Al-Babtain, 87, Kuwaiti poet and businessman.رجل الأعمال والشاعر عبدالعزيز سعود البابطين.. في ذمة الله *Steve Halliwell, 77, English actor (Coronation Street, Emmerdale) and singer (The Woolpackers).Emmerdale actor Steve Halliwell dies after 29 years as Zak Dingle *Guy Marchand, 86, French actor (Coup de Torchon, Family Business, My New Partner II), musician and singer.Guy Marchand, acteur et musicien, est mort *Samer Abu Daqqa, 46, Palestinian-Belgian video journalist, israeli airstrike. ===16=== *Sebastiano Lo Monaco, 65, Italian actor (La piovra, I Viceré, Where Are You? I'm Here).Morto Sebastiano Lo Monaco, attore e regista: una vita dedicata al teatro *Carlos Lyra, 90, Brazilian singer and composer (\"Maria Ninguém\").Carlos Lyra, cantor e compositor da bossa nova, morre aos 90 anos *Nawaf Al-Ahmad Al-Jaber Al-Sabah, 86, Kuwaiti royal, Emir (since 2020). *Kenpachiro Satsuma, 76, Japanese actor (Godzilla vs. Hedorah, The Return of Godzilla, Godzilla vs. Destoroyah) and stuntman, pneumonia.GODZILLA2代目スーツアクターの薩摩剣八郎さん死因は間質性肺炎の為死去 ===17=== *Norma Barzman, 103, American screenwriter (Finishing School, The Locket, Never Say Goodbye).Norma Barzman, Screenwriter Who Was Among the Last Survivors of the Hollywood Blacklist, Dies at 103 *Luca de Castro, 70, Brazilian actor (The Middle of the World, City of Men, Casa da Mãe Joana) and stage director.Carol Castro anuncia a morte do pai e recebe apoio de amigos *Maureen Flavin Sweeney, 100, Irish postmistress. *Otar Iosseliani, 89, Georgian film director and screenwriter (Pastorale, Favorites of the Moon, Monday Morning).Умер Отар Иоселиани *Vaggelis Serdaris, 87, Greek film director (Vasiliki).Πέθανε ο Βαγγέλης Σερντάρης *Lionel Wickrama, 77, Sri Lankan actor (Sanda Yahanata, Mathu Yam Dawasa, Sangili).Renowned Actor Lionel Wickrama Passes Away at 77 *Ronaldo Valdez, 76, Filipino actor (The Mad Doctor of Blood Island, Karma, Cedie).Veteran actor Ronaldo Valdez dies at 76 *Linda van Dyck, 75, Dutch actress (10:32, A Gangstergirl, De grens).Actrice Linda van Dyck (75) overleden, collega’s in rouw: ‘Ze gaf altijd 120 procent’ ===18=== *Abderrahim Ouakili, 53, Moroccan footballer (national team). *Bilal Abu Samaan, 31, Palestinian athlete, israeli airstrike. *Bronislovas Genzelis, 89, Lithuanian politician. *Bo Larsson, 79, Swedish footballer (Malmö, VfB Stuttgart, national team).Bo-Göran Larsson ===19=== *Cevdet Arıkan, 75, Turkish actor (Tosun Paşa, Happy Days, Banker Bilo).Oyuncu Cevdet Arıkan yaşamını yitirdi *Turan Mehrzad, 93, Iranian actress (Hamoun, Love-stricken, Leila).Veteran Iranian actress Touran Mehrzad passes away *K.M. Peyton, 94, British author.KM Peyton, doyenne of pony fiction who won the Carnegie Medal for her Flambards series – obituary *Joseph Henry Smith, 78, Ghanaian military officer and diplomat, minister for defence (2009–2013) and chief of army staff (1996–2001). ===20=== *Franco Cozzo, 87, Italian-Australian businessman. *Khadijo Mohamed Diriye, 74, Somali politician. *Tambusamy Krishnan, 79, Malaysian Olympic sprinter (1972). *Torben Ulrich, 95, Danish tennis player.Lars Ulrich’s Father Dies At 95 (death announced on this date) ===21=== *Carmen Barros, 98, Chilean actress (La Fiebre del Loco, The Guest), singer and theatre director.Fallece Carmen Barros, Histórica Actriz, a los 98 Años *Miloš Battelino, 70, Slovenian actor (Rooster's Breakfast).Umrl je igralec Miloš Battelino (death announced on this date) *Robert Solow, 99, American economist, Nobel Prize recipient (1987).Robert M. Solow, celebrated economist and Nobel laureate, dies at 99 ===22=== *, 90, Russian actor (Plasticine Crow), stage director and humorist.Умер основатель Московского еврейского театра \"Шалом\" Александр Левенбук *Ingrid Steeger, 76, German actress (Nurse Report, Three Men in the Snow, Andre Handles Them All), intestinal obstruction.Ingrid Steeger (†76) ist tot *Thomas Williams, 93, New Zealand Roman Catholic cardinal, archbishop of Wellington (1979–2005).RIP Thomas Cardinal Williams 20 March 1930 – 22 December 2023 ===23=== *Frank Cassenti, 78, French stage and film director and screenwriter (The Song of Roland).Figure du cinéma et fondateur de Jazz à Porquerolles, Frank Cassenti est mort à l'âge de 78 ans *Aleksey Chernykh, 43, Russian actor (101st Kilometer).Артистка Екатерина Соломатина сообщила о смерти актера Алексея Черных *Arantxa Gurmendi, 78, Spanish Basque actress (Goenkale).Fallece la actriz donostiarra Arantxa Gurmendi, conocida por su papel de 'Hortentsi' en Goenkale *Dejumo Lewis, 80, Nigerian actor (The Village Headmaster, A Place in the Stars, Agogo Eewo).Veteran Actor Dejumo Lewis Passes Away At 80 *Mike Nussbaum, 99, American actor (Fatal Attraction, Field of Dreams, Men in Black).Chicago actor Mike Nussbaum dies at 99, the oldest working actor in the country ===24=== *Kamar de los Reyes, 56, Puerto Rican actor (One Life to Live, Sleepy Hollow, Call of Duty: Black Ops II), cancer.Kamar de los Reyes, ‘One Life to Live’ and ‘Call of Duty’ Star, Dies at 56 *Rex Kodippili, 85, Sri Lankan actor (Kauda Bole Alice, Sonduru Dadabima, Ohoma Harida).Veteran actor Rex Kodippili passes away *David Leland, 82, British film director (Wish You Were Here, Virgin Territory) and screenwriter (Mona Lisa), BAFTA winner (1988).David Leland Dies: ‘Wish You Were Here’ Director & ‘The Borgias’ Co- Showrunner Was 82 ===25=== *Elise Fischer, 75, French journalist and novelist. *Richard Franklin, 87, English actor (Doctor Who, Crossroads, Emmerdale), writer and director.Doctor Who star Richard Franklin dies on Christmas Day aged 87 *Sayyed Razi Mousavi, Iranian brigadier general, israeli airstrike. ===26=== *David Kernan, 85, British actor (Mix Me a Person, Zulu, Carry On Abroad). *Elsa Lystad, 93, Norwegian actress (Hurra for Andersens!, Deilig er fjorden!, Smuglere).Elsa Lystad er død *Tom Smothers, 86, American comedian and musician (Smothers Brothers), cancer.Tom Smothers, Half of Smothers Brothers Comedy Duo, Dies at 86 ===27=== *Yuri Arabov, 69, Russian screenwriter (The Lonely Voice of Man, Days of Eclipse, Moloch), writer and poet.ТАСС: умер российский писатель и сценарист Юрий Арабов *Jacques Delors, 98, French economist and politician, minister of finance (1981–1984), MEP (1979–1981) and president of the European Commission (1985–1995).L'ancien ministre et président de la commission Européenne Jacques Delors est mort à 98 ans *Patricia Ferreira, 65, Spanish film and television director and screenwriter (I Know Who You Are, The Wild Ones).Muere la directora Patricia Ferreira a los 65 años *Herb Kohl, 88, American politician and businessman (Kohl's), member of the U.S. Senate (1989–2013).Herb Kohl, former U.S. senator and Milwaukee Bucks owner, dies at age 88 *Lee Sun-kyun, 48, South Korean actor (Helpless, Parasite, Paju).'Parasite' actor Lee Sun-kyun found dead amid investigation over drug allegations ===28=== *Hardi, 72, Indonesian artist. *Per Myrberg, 90, Swedish actor (A Handful of Love, The Simple-Minded Murderer, The Girl with the Dragon Tattoo).Per Myrberg är död. Blev 90 år gammal *Shaharuddin Abdullah, 75, Malaysian footballer (Penang, national team, 1972 Olympic team). *Vijayakanth, 71, Indian actor and politician.BREAKING: Actor and DMDK founder Captain Vijayakanth aka Vijayakant passes away ===29=== *Sir Michael Hardie Boys, 92, New Zealand lawyer, jurist, and vice-regal representative, judge of the High Court (1980–1989), governor- general (1996–2001), privy counsellor (since 1989).Sir Michael Hardie Boys, former Governor-General, dies *Maurice Hines, 80, American dancer, singer and actor (The Cotton Club).Maurice Hines, Tap Dancer Extraordinaire, Dies at 80 *Rossy Mendoza, 80, Mexican vedette, actress (Sweetly You'll Die Through Love), and dancer, heart attack.Muere Rossy Mendoza; ¿De qué murió la famosa vedette y actriz? *Sandra Reaves-Phillips, 79, American actress (Ma Rainey's Black Bottom, Round Midnight, Lean on Me), writer, and singer.Sandra Reaves- Phillips, Actress and Singer on Stage and Screen, Dies at 79 *Ramzi T. Salamé, 70, Lebanese writer and artist. ===30=== *Luboš Kohoutek, 88, Czech astronomer, discoverer of Comet Kohoutek.Zemřel astronom Luboš Kohoutek. Objeviteli slavné komety bylo 88 let *John Pilger, 84, Australian documentary filmmaker and journalist. *Tom Wilkinson, 75, British actor (The Full Monty, In the Bedroom, Michael Clayton).Tom Wilkinson: The Full Monty actor dies at 75 ===31=== *Shecky Greene, 97, American comedian and actor (History of the World, Part I, Splash, Tony Rome).Comic legend Shecky Greene dies at 97 *Melissa Hoskins, 32, Australian Olympic cyclist (2012), traffic collision.Rohan Dennis reportedly charged in connection with death of wife Melissa Hoskins *Eddie Bernice Johnson, 88, American politician, member of the U.S. House of Representatives (1993–2023) and Texas Senate (1987–1993).Former U.S. Rep. Eddie Bernice Johnson, Black Democratic trailblazer, dies at 88 *Maunu Kurkvaara, 97, Finnish film director (Yksityisalue, 4x4) and producer (Let Not One Devil Cross the Bridge).Palkittu elokuvaohjaaja Maunu Kurkvaara on kuollut *Ana Ofelia Murguía, 90, Mexican actress (The Queen of the Night, Nobody Will Speak of Us When We're Dead, Coco).Falleció la actriz Ana Ofelia Murguía *Oscar Quitak, 97, British actor (Yes, Prime Minister, Howards' Way, A Very British Coup).Oscar Quitak *Cale Yarborough, 84, American Hall of Fame racing driver, founder of Cale Yarborough Motorsports.3-time NASCAR Cup Series champion Cale Yarborough dies ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *12 Category:December 2023 events",
 "title": "Deaths in December 2023"
}