{
 "id": "986374",
 "text": "The following is a list of deaths that should be noted in September 2023. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Every entry must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==September 2023== ===1=== * Jimmy Buffett, 76, American singer (Coral Reefer Band) and songwriter (\"Margaritaville\", \"Cheeseburger in Paradise\").Jimmy Buffett, legendary 'Margaritaville' singer, dies at 76 ===2=== * Morteza Poursamadi, 70, Iranian cinematographer (Gilaneh, Hush! Girls Don't Scream, Intoxicated by Love).مرتضی پورصمدی درگذشت ===3=== * Heath Streak, 49, Zimbabwean cricketer (Matabeleland, Ahmedabad Rockets, national team), liver cancer. ===4=== * Steve Harwell, 56, American singer (Smash Mouth), liver failure.Steve Harwell, Smash Mouth Founding Singer, Dead at 56 * Peter Lashley, 86, Barbadian cricketer (West Indies, national team).Lashley and White play their final innings * Gary Wright, 80, American singer-songwriter (\"Dream Weaver\", \"Love Is Alive\") and musician (Spooky Tooth), Lewy body dementia. ===5=== * Joe Fagin, 83, British singer (\"Breakin' Away / That's Livin' Alright\").Auf Wiedersehen, Pet legend Joe Fagin dies as co-stars left devastated (death announced on this date) * Bruce Guthro, 62, Canadian singer-songwriter (\"Walk This Road\", \"Falling\") and musician (Runrig).Cape Breton singer-songwriter Bruce Guthro dies at 62 ===6=== * Giuliano Montaldo, 93, Italian film director (Tiro al piccione, Sacco & Vanzetti, Giordano Bruno), screenwriter and actor.Morto Giuliano Montaldo, il regista di ‘Sacco e Vanzetti’ ===7=== * John Cairney, 93, Scottish actor (A Night to Remember, Cleopatra, Jason and the Argonauts), author and painter.The Scottish actor John Cairney has died aged 93 * Wayne Greenstreet, 74, New Zealand cricketer (Wellington, Central Districts).Wayne Anthony Greenstreet ===8=== * Tunku Ampuan Najihah, 100, Malaysian royal, Raja Permaisuri Agong (1994– 1999).Tunku Ampuan Najihah Dies * Whitey Von Nieda, 101, American basketball player ===9=== * Mangosuthu Buthelezi, 95, South African politician and Zulu prince, minister of home affairs (1994–2004), MP (since 1994) and chief minister of KwaZulu (1977–1994).IFP founder Mangosuthu Buthelezi has died ===10=== * Robert S. Bennett, 84, American attorney (Clinton–Lewinsky scandal), kidney failure.Robert S. Bennett, Washington's Go-to Lawyer in a Scandal, Dies at 84 ===11=== *Martin Hámor, 80, Slovak Olympic archer (1992).Martin Hámor * Subaschandra Nemwang, 70, Nepalese politician, chairman of the constituent assembly (2008–2015).Subash Chandra Nembang, the man who chaired Nepal’s historic Constituent Assembly, passes away ===12=== * Jean Boht, 91, English actress (Bread).Actress Jean Boht best known for role in Bread dies aged 91 * Román Chalbaud, 91, Venezuelan film director (Adolescence of Cain, El Pez que Fuma, Carmen, la que contaba 16 años).Fallece el cineasta Román Chalbaud * Dominique Colonna, 95, French football player (Reims, national team) and manager (Cameroon national team). ===13=== * Sohanur Rahman Sohan, Bangladeshi film director (Keyamat Theke Keyamat, Ananta Bhalobasha, Se Amar Mon Kereche), stroke.Filmmaker Sohanur Rahman Sohan dies * Pepe Soriano, 93, Argentine actor (Rebellion in Patagonia, Grandma, Asesinato en el Senado de la Nación).Murió Pepe Soriano a los 93 años * Teng Rujun, 76, Chinese actor (Red Sorghum, Postmen in the Mountains).演员滕汝骏去世，曾出演《红高粱》《那山那人那狗》 * Roger Whittaker, 87, British folk singer (\"Durham Town (The Leavin')\", \"New World in the Morning\" and \"The Last Farewell\").Roger Whittaker dies at 87 ===14=== * Roy Roper, 100, New Zealand rugby union player (Taranaki, national team).Oldest All Black and centenarian Roy Roper dies ===15=== * Tony Kreft, 78, New Zealand rugby union player (Otago, national team).Anthony John Kreft * Paul Woseen, 56, Australian musician (The Screaming Jets) and songwriter (\"Helping Hand\").Screaming Jets Founding Member Paul Woseen Passes Away ===16=== ===17=== * Aleksandr Khvan, 65, Russian film director (Dyuba-Dyuba, It Is Easy to Die, Carmen) and actor.Умер Александр Хван ===18=== * Byun Hee-bong, 81, South Korean actor (Barking Dogs Never Bite, The Host, Okja), pancreatic cancer.Veteran actor Byun Hee Bong passes away after battling cancer ===19=== ===20=== * Katherine Anderson, 79, American singer (The Marvelettes).Marvelettes co-founder Katherine Anderson dies at age 79 ===21=== * Odilon Polleunis, 80, Belgian footballer (S.T.V.V., R.W.D. Molenbeek, national team), heart failure.Ex- Gouden Schoen Lon Polleunis (80) overleden ===22=== * Américo Lopes, 90, Portuguese footballer (Porto, Boavista, national team).Morreu Américo, antigo guarda-redes do FC Porto e da seleção nacional * Cristina Morán, 93, Uruguayan actress (Anina, Alelí), television presenter and journalist.Murió Cristina Morán: así la despidieron artistas, comunicadores y políticos uruguayos * Sir Patu Hohepa, 87, New Zealand Māori language academic.Reo Māori scholar Sir Patu Wahanga Hohepa dies aged 87 * Peter Horton, 82, Austrian guitarist, composer and singer (Eurovision Song Contest 1967).\"Schwebend hinausgehen\": Liedermacher Peter Horton ist tot (death announced on this date) * Giorgio Napolitano, 98, Italian politician, president (2006–2015), minister of the interior (1996–1998) and president of the Chamber of Deputies (1992–1994).Giorgio Napolitano è morto: se ne va il primo presidente della Repubblica eletto due volte ===23=== * Terry Kirkman, 83, American musician (The Association) and songwriter (\"Cherish\", \"Everything That Touches You\").Terry Kirkman, Co-Founder of the Association, and Composer of 'Cherish,' Dies ===24=== * Ray Reynolds, 87, Australian cricketer (Queensland).Vale Ray Reynolds ===25=== * David McCallum, 90, Scottish actor (The Man from U.N.C.L.E., The Great Escape, NCIS) and musician.David McCallum Dies: Beloved ‘NCIS’ Actor Was 90 ===26=== * Jayantha Paranathala, 72, Sri Lankan cricketer (Burgher Recreation Club, national team) and police officer.Ex-cricket Administrator Jayantha Paranathala dies * Brooks Robinson, 86, American Hall of Fame baseball player (Baltimore Orioles), World Series champion (1966, 1970).Hall of Fame 3B, Orioles legend Brooks Robinson dies at 86 ===27=== * Jim Forrest, 79, Scottish footballer (Rangers, Aberdeen, national team).Rangers legend Jim Forrest dies aged 79 * Sir Michael Gambon, 82, Irish-English actor (Harry Potter, Gosford Park, The King's Speech), pneumonia.Michael Gambon, veteran actor who played Dumbledore In 'Harry Potter' films, dies at age 82 * Catherine Lachens}, 78, French actress (Je suis timide mais je me soigne, The Medic, Bright Days Ahead).Mort de Catherine Lachens : l'actrice française s'est éteinte à l'âge de 78 ans ===28=== ===29=== * Neville Harper, 97, Australian politician, Queensland MLA (1980–1992).Harper, Hon Neville John ===30=== * Vitali Konyayev, 86, Russian actor (Silence, Clear Skies, The Last Day).Скончался В. А. Коняев ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *09 Category:September 2023 events",
 "title": "Deaths in September 2023"
}