{
 "id": "986368",
 "text": "The following is a list of deaths that should be noted in March 2023. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Every entry must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==March == === 1 === * Ted Donaldson, 89, American actor (A Tree Grows in Brooklyn, Adventures of Rusty, Father Knows Best), complications from a fall.Ted Donaldson, Young Actor in ‘Father Knows Best’ and ‘A Tree Grows in Brooklyn,’ Dies at 89 *Just Fontaine, 89, French footballer (Nice, Reims, national team).France, World Cup legend Just Fontaine dies aged 89 *Warren Saunders, 88, Australian cricketer (New South Wales).Cricket world mourns death of NSW legend Warren Saunders *Irma Serrano, 89, Mexican actress (Tiburoneros, El monasterio de los buitres, Las amantes del señor de la noche) and singer, heart attack.Murió Irma Serrano a los 89 años de edad === 2 === *Aziz Mushabber Ahmadi, 90, Indian jurist, chief justice (1994–1997), chancellor of Aligarh Muslim University (2003–2010).Former Chief Justice Of India AM Ahmadi Passes Away *Steve Mackey, 56, English bassist (Pulp) and record producer.Pulp bass player Steve Mackey has died *María Onetto, 56, Argentine actress (Montecristo, The Headless Woman, The Heavy Hand of the Law).Murió María Onetto: Relatos salvajes, Montecristo y sus otros grandes papeles en el teatro *Wayne Shorter, 89, American jazz saxophonist (The Jazz Messengers, Miles Davis Quintet, Weather Report), 12-time Grammy winner.Wayne Shorter, sage of the saxophone, dies at 89 === 3 === *Francisco J. Ayala, 88, Spanish-American evolutionary biologist and philosopher.Muere el genetista Francisco J. Ayala a los 88 años de edad *Barbara Everitt Bryant, 96, American market researcher, director of the United States Census Bureau (1989–1993).Barbara Bryant, the first woman to head the U.S. census, has died at 96 *Kenzaburō Ōe, 88, Japanese novelist (A Personal Matter, The Silent Cry), Nobel Prize laureate (1994).Novelist and Nobel Prize Laureate Kenzaburo Oe Dies *Tom Sizemore, 61, American actor (Black Hawk Down, Saving Private Ryan, Robbery Homicide Division), complications from a brain aneurysm.Tom Sizemore Dead at 61 === 4 === *Phil Batt, 96, American politician, governor of Idaho (1995–1999), member of the Idaho House of Representatives (1965–1967) and twice of the Senate.‘He was a titan in Idaho politics’: Former Idaho Gov. Phil Batt dies * Joseph Gabriel Fernandez, 97, Indian bishopBishop Emeritus of Quilon diocese Joseph G Fernandez passes away * John Nagenda, 84, Ugandan cricketer (East Africa, national team).Senior presidential advisor John Nagenda dies at 84 * Spot, 72, American record producer (Damaged, Milo Goes to College, Zen Arcade).SST Records Producer Glen “SPOT” Lockett Dies at 72 === 5 === *Frank Griswold, 85, American clergyman, presiding bishop of the Episcopal Church (1998–2006).Frank T. Griswold III, 25th presiding bishop, dies at 85 *Gary Rossington, 71, American Hall of Fame guitarist (Lynyrd Skynyrd, Rossington Collins Band).Gary Rossington, Lynyrd Skynyrd’s Last Original Member, Dead at 71 === 6 === *Masum Babul, 60, Bangladeshi film dance director and choreographer (Beder Meye Josna, Keyamat Theke Keyamat, Ekti Cinemar Golpo).Choreographer, filmmaker Masum Babul dies *Georgina Beyer, 65, New Zealand politician, mayor of Carterton (1995–2000), MP (1999–2007), world's first openly transgender member of parliament.Georgina Beyer, the world's first openly transgender MP, has died *Ivana Hloužková, 62, Czech actress (The Fortress, Boredom in Brno).Zemřela herečka Ivana Hloužková ===7=== * Ian Falconer, 63, American author.Remembering Ian Falconer, the New Yorker Artist and Author of the “Olivia” Books *Peterson Zah, 85, American politician, president of the Navajo Nation (1991–1995).Peterson Zah, the one and only Navajo chairman and president, dies at 85 ===8=== *Marcel Amont, 93, French singer.French Singer Marcel Amont Dies At 93 * Gianmarco Calleri, 81, Italian footballerÈ morto Calleri, l'ex presidente della Lazio: lutto nel calcio ] * Italo Galbiati, 85, Italian footballerLutto nel mondo del calcio: Italo Galbiati si è spento all'età di 85 anni. Una sola presenza nell'Inter *Bert I. Gordon, 100, American film director and screenwriter (Village of the Giants, Empire of the Ants, The Amazing Colossal Man).Bert I. Gordon, Auteur of Mutant Monster Movies, Dies at 100 *Chaim Topol, 87, Israeli actor (Fiddler on the Roof, Flash Gordon, For Your Eyes Only).Actor, singer and Israel Prize laureate Chaim Topol dies at 87 ===9=== * Robert Blake, 89, American actor.Robert Blake Dies: Actor In ‘Baretta’ And ‘In Cold Blood’ Was 89, Beat Real-Life Murder Rap * Hassan Ghafourifard, 79, Iranian academic and politicianحسن غفوری‌فرد درگذشت *Chikage Oogi, 89, Japanese actress (A Teapicker's Song of Goodbye) and politician, president of the House of Councillors (2004–2007) and minister of land (2001–2003), esophageal cancer.元女優・元参議院議長の扇千景さんが死去「食道胃接合部がん」のため 89歳 *Randhir Singh, 65, Indian cricketer (national team).Randhir Singh ===10=== *Skip Bafalis, 93, American politician, member of the U.S. House of Representatives (1973–1983), member of the Florida Senate (1966–1970) and House of Representatives (1964–1966).Former U.S. Rep. L.A.\"Skip\" Bafalis, of Florida, dies in Virginia *Rolland Hein, American academicDR. HEIN'S OBITUARY ===11=== *Ignacio López Tarso, 98, Mexican actor (Rosa Blanca, Esmeralda, Wild at Heart).Muere el actor Ignacio López Tarso, el Macario inmortal del cine de oro mexicano ===12=== *Susan Cunliffe-Lister, Baroness Masham of Ilton, 87, British politician, member of the House of Lords (since 1970) and Paralympic champion (1960, 1964).Baroness Masham of Ilton * Marek Kopelent, 90, Czech composer. * Antonio Pedro, 82, Brazilian actor. * Costa Titch, 27, South African rapper. ===13=== *Jim Gordon, 77, American drummer (Derek and the Dominos, Traffic), songwriter (\"Layla\") and convicted murderer. Jim Gordon, Drummer for Eric Clapton and ‘Layla’ Co-Writer Who Was Convicted of Murder, Dies at 77 *Jack McLaughlin, 93, Australian cricketer (Queensland).Queensland Cricket: Vale Jack McLaughlin *Joe Pepitone, 82, American baseball player (New York Yankees, Houston Astros, Chicago Cubs), World Series champion (1962).Flamboyant Yankees great dies at 82: ‘Playful and charismatic personality’ made him a fan favorite *Pat Schroeder, 82, American politician, member of the U.S. House of Representatives (1973–1997), complications from a stroke.Former Rep. Pat Schroeder, pioneer for women’s rights, dies ===14=== *Bobby Caldwell, 71, American singer (\"What You Won't Do for Love\") and songwriter (\"The Next Time I Fall\").Bobby Caldwell, 'What You Won't Do For Love' Singer Dead at 71 * Harvey Carignan, 95, American serial killer. *Louisette Dussault, 82, Canadian actress (Françoise Durocher, Waitress, IXE-13, Wedding Night) and writer.La comédienne Louisette Dussault s'éteint ===15=== * Don Megson, 86, English football. ===16=== *Nani Widjaja, 78, Indonesian actress (Cinta Pertama, Catatan Si Boy, Maling Kutang), respiratory failure.Nani Wijaya Meninggal Dunia di Usia 78 Tahun ===17=== *Jorge Edwards, 91, Chilean novelist and diplomat.Falleció el escritor chileno Jorge Edwards a los 91 años *Fuzzy Haskins, 81, American Hall of Fame singer (Parliament- Funkadelic).Former Parliament-Funkadelic singer Fuzzy Haskins dead at 81 *Lance Reddick, 60, American actor (The Wire, Fringe, John Wick) and musician, heart disease.Lance Reddick Dies: ‘John Wick’, ‘The Wire’, ‘Fringe’ & ‘Bosch’ Actor Was 60 *Robert W. Sennewald, 93, American army general.Robert William Sennewald *Laura Valenzuela, 92, Spanish television presenter (TVE) and actress (Spaniards in Paris, Growing Leg, Diminishing Skirt), complications from Alzheimer's disease.Muere Laura Valenzuela a los 92 años ===18=== *Gloria Dea, 100, American actress (King of the Congo, Plan 9 from Outer Space) and magician, coronary artery disease.Gloria Dea, the Strip’s first magician, dies at 100 ===19=== *Willie Cager, 80, American basketball player. *Pōhiva Tuʻiʻonetoa, 71, Tongan politician, prime minister (2019–2021), minister of finance (2018–2019) and MP (since 2014).Former Tonga PM Tu'ionetoa passes away ===20=== *Paul Grant, 56, British actor (Return of the Jedi, Labyrinth, The Dead) and stuntman.Star Wars and Harry Potter actor Paul Grant dies aged 56 *Osvaldo Héctor Cruz, 91, Argentine footballer (Independiente, Unión Española, national team).Murió Osvaldo Cruz, emblema de Independiente en los '50 *Vasily Reshetnikov, 103, Russian pilot and World War II veteran, Hero of the Soviet Union.Скончался старейший герой СССР, знаменитый летчик Василий Решетников ===21=== *Francesco Maselli, 92, Italian film director and screenwriter (Time of Indifference, A Tale of Love, Abandoned).Citto Maselli, morto il regista de 'Gli indifferenti' e 'I delfini'. La passione per il cinema e l'impegno politico *Willis Reed, 80, American Hall of Fame basketball player (New York Knicks) and coach (New Jersey Nets), NBA champion (1970, 1973), heart failure.New York Knicks legend Willis Reed dies at 80 *Peter Werner, 76, American film and television director (In the Region of Ice, Moonlighting, Grimm), Oscar winner (1976).Peter Werner Dies: Prolific TV Director & Oscar Winner Was 76 ===22=== *Jirō Dan, 74, Japanese actor (Daijōbu, My Friend, Return of Ultraman, Zero Woman), lung cancer.「帰ってきたウルトラマン」団時朗さん死去、74歳 17年に肺がん診断、昨年末悪化し力尽きる * Rebecca Jones, 65, Mexican actress (Imperio de cristal, Para volver a amar, Que te perdone Dios).La actriz mexicana Rebecca Jones muere a los 65 años *Ben Shelly, 75, American politician, president of the Navajo Nation (2011–2015).Former Navajo Nation President Ben Shelly dies at age 75 ===23=== *Marion Game, 84, Moroccan-born French actress (Scènes de ménages, Parking, Dickie-roi).Marion Game, l’interprète de Huguette dans « Scènes de ménages », est décédée à 84 ans *Dafydd Hywel, 77, Welsh actor (Coming Up Roses, Off to Philadelphia in the Morning, The Crown).Dafydd Hywel: Tributes to Stella actor who dies aged 77 ===24=== *Gordon Moore, 94, American businessman, engineer (Moore's law) and philanthropist, co-founder of Intel and Gordon and Betty Moore Foundation.Gordon Moore, Intel Co-Founder, Dies at 94 * Pradeep Sarkar, 67, Idaian film director.Parineeta filmmaker Pradeep Sarkar passes away at 67 ===25=== *Chabelo, 88, American-born Mexican actor (The Extra, Escuela para solteras) and comedian (La Carabina de Ambrosio).Murió Xavier López, 'Chabelo', actor y comediante *Nick Lloyd Webber, 43, English composer (Love, Lies and Records, Fat Friends The Musical) and songwriter, stomach cancer.Andrew Lloyd Webber Announces Son Nick’s Death *Pascoal Mocumbi, 81, Mozambican politician, prime minister (1994–2004).Morreu ex-primeiro-ministro de Moçambique Pascoal Mocumbi * Andrei Sison, 16, Filipino actor. ===26=== *Zvi Dershowitz, 94, Czech-born American rabbi.Rabbi Emeritus Zvi Dershowitz *Nikolay Dupak, 101, Russian actor (The Forty-First, Intervention, Bumbarash).В Москве умер актер Николай Дупак *Ivano Marescotti, 77, Italian actor (The Peaceful Air of the West, Johnny Stecchino, Cado dalle nubi) and theater director.Ravenna, morto Ivano Marescotti. Aveva 77 anni *Karl-Josef Rauber, 88, German Roman Catholic cardinal, apostolic pro-nuncio to Uganda (1982–1990), president of the Pontifical Ecclesiastical Academy (1990–1993) and apostolic nuncio to Hungary (1997–2003).Deutscher Kardinal Karl-Josef Rauber gestorben ===27=== * Wim de Bin, 83, Dutch comedian. *Nick Galifianakis, 94, American politician, member of the U.S. House of Representatives (1967–1973) and the North Carolina House of Representatives (1961–1967).Former congressman, Senate candidate Galifianakis dies at 94 *Ronald A. Sarasin, 88, American politician, member of the U.S. House of Representatives (1973–1979) and the Connecticut House of Representatives (1969–1973).Remembering Ronald A. Sarasin ===28=== * Virginia Nair, 73, Indian actor. *Paul O'Grady, 67, English comedian and television presenter (The Paul O'Grady Show).Paul O'Grady: TV presenter and comedian dies aged 67 *Ryuichi Sakamoto, 71, Japanese musician (Yellow Magic Orchestra), composer (The Last Emperor), and actor (Merry Christmas, Mr. Lawrence), Oscar winner (1988), rectal cancer.Ryuichi Sakamoto, Japanese pop pioneer and Oscar-winning composer, dies aged 71 ===29=== * John Kerin, 85, Australia politician, twice. *Keith Reid, 76, English lyricist and songwriter (Procul Harum, \"A Whiter Shade of Pale\", \"You're the Voice\").‘You’re The Voice’ Co-Writer Keith Reid of Procol Harum Dead At Age 76 (death announced on this date) ===30=== *Johan Leysen, 73, Belgian actor (The Abyss, Brotherhood of the Wolf, The American).Belgische acteur Johan Leysen (73) plots overleden *Elemér Ragályi, 83, Hungarian cinematographer (The Phantom of the Opera, Mesmer, An American Rhapsody), film director and actor.Meghalt Ragályi Elemér, Kossuth-díjas operatőr ===31=== * Asja Lamtiugina, 82, Polish actress. ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *03 Category:March 2023 events",
 "title": "Deaths in March 2023"
}