{
 "id": "986375",
 "text": "Deaths in October 2023 (list of). For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non- humans are noted here also if it is worth noting. Every entry must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. == October 2023== ===1=== * Theresa Kufuor, 87, Ghanaian nurse and midwife, first lady (2001–2009).Former first Lady Theresa Kufuor passes on * Richie Poulton, 61, New Zealand clinical psychologist, director of the Dunedin Study (since 2000), salivary gland cancer.Dunedin Study professor Richie Poulton dies, aged 61 * Tim Wakefield, 57, American baseball player (Boston Red Sox, Pittsburgh Pirates) and commentator (NESN), brain cancer.Selfless teammate, 'extraordinary human' Tim Wakefield passes away * John Waring, 81, English cricketer (Yorkshire, Warwickshire).John Waring, Former Yorkshire Fast Bowler - Obituary ===2=== * Francis Lee, 79, English football player (Manchester City, Bolton Wanderers, national team) and chairman, cancer.Francis Lee: Manchester City great dies aged 79 ===3=== * Joe Christopher, 87, American baseball player (Pittsburgh Pirates, New York Mets, Boston Red Sox).Joe Christopher, outfielder on expansion 1962 Mets, dies at 87 ===4=== * Jason Wynyard, 49, New Zealand woodchopper, Burkitt lymphoma.Kiwi wood chopping legend Jason Wynyard dies aged 49 ===5=== * Asad Chowdhury, 80, Bangladeshi writer. * Ibrahim Amin, Egyptian squash player. ===6=== * Mary Chronopoulou, 90, Greek actress (The Naked Brigade, Mermaids and Rascals, Voyage to Cythera), complications from a fall.Θλίψη στον καλλιτεχνικό κόσμο: Πέθανε η Μαίρη Χρονοπούλου * Atila Pesyani, 66, Iranian actor (The Redemption, Cease Fire, The Hidden Half), cancer.Veteran Iranian actor Atila Pesyani passes away at 66 * Francisco Vidal, 82, Spanish actor (El Crack, The Enchanted Forest, Pan's Labyrinth).Muere el actor Paco Vidal, mítico actor secundario de decenas de ficciones españolas ===7=== * Marouf al-Bakhit, 76, Jordanian military officer and politician, prime minister (2005–2007, 2011). * Terence Davies, 77, British screenwriter and film director (Distant Voices, Still Lives, The Long Day Closes, The House of Mirth).Terence Davies, Master English Filmmaker, Dead at 77 ===8=== * Ted Schwinden, 98, American politician, governor (1981–1989) and lieutenant governor (1977–1981) of Montana, member of the Montana House of Representatives (1959–1963).'Tough old bird': Straight-talking former Montana governor Ted Schwinden dies at 98 * Burt Young, 83, American actor (Rocky, Chinatown, The Pope of Greenwich Village).Burt Young, ‘Rocky’ Actor Who Played Complex Tough Guys, Dies at 83 ===9=== * Jackson Anthony, 65, Sri Lankan actor (Gini Avi Saha Gini Keli, Guerilla Marketing) and film director (Julietge Bhumikawa), complications from a traffic collision.Veteran actor Jackson Anthony passes away * Mikhail Golubovich, 79, Ukrainian actor (Lone Wolf, Luna Park, Brothel Lights).Актер из «Тихого Дона» Михаил Голубович ушел из жизни в возрасте 79 лет * Anthony Hickox, 64, English film director (Waxwork, Sundown: The Vampire in Retreat, Hellraiser III: Hell on Earth) and screenwriter.Buntownik z wizją i przekrzywioną muchą. Nie żyje reżyser hitów kina grozy * Mang Hoi, 65, Hong Kong actor (The Human Goddess, Bruce Lee, D-Day at Macao, He Has Nothing But Kung Fu), oesophageal cancer. 侄女《愛回家》孟希璘證實去年患食道癌 * Yulian Panich, 92, Russian actor (Road to Life, For the Power of the Soviets, Different Fortunes), television director and journalist.Во Франции умер актёр, режиссёр и диктор Радио Свобода Юлиан Панич * Henri Serre, 92, French actor (Jules and Jim, Fantômas contre Scotland Yard, Mister Frost).Mort de l'acteur Henri Serre, l'un des héros du film \"Jules et Jim\", à 92 ans * Yevgeni Sumin, 81, Russian actor (Tracker, Voroshilov Sharpshooter).В Калуге умер актер Евгений Сумин ===10=== *Mark Goddard, 87, American actor (Lost in Space)Lost in Space's Mark Goddard Dead at 87 ===11=== * Phyllis Coates, 96, American actress (Adventures of Superman, Superman and the Mole Men, Goodnight, Sweet Marilyn).Phyllis Coates, the First Lois Lane on Television, Dies at 96 * Rudolph Isley, 84, American Hall of Fame singer-songwriter (\"It's Your Thing\", \"That Lady\") (The Isley Brothers).Rudolph Isley, A Founding Member of The Isley Brothers, Is Reportedly Dead at 84 * Pauline Jani, 34, Zimbabwean netball player (national team).Former gems netball star Pauline Jani Dies aged 34 *Markku Syrjälä, 68, Finnish Olympic archer (1984).Markku Syrjälä * Cal Wilson, 53, New Zealand comedian and voice actress (Kitty Is Not a Cat).Cal Wilson dead at 53: Beloved comedian and TV personality passes away ===12=== * Lara Parker, 84, American actress (Dark Shadows, Save the Tiger, Hi, Mom!).Lara Parker, Angelique on Cult Favorite 'Dark Shadows,' Dies at 84 ===13=== * Hildegarde Neil, 84, English actress (Antony and Cleopatra, England Made Me, The Bruce), cancer and heart disease.Princess Diana's psychic claims the Royals do consult mediums (death announced on this date) ===14=== * Dariush Mehrjui, 83, Iranian filmmaker (The Cow, Mr. Naive, Hamoun), stabbing.داریوش مهرجویی و همسرش در ویلایشان به قتل رسیدند *Joaquín Pérez, 86, Cuban Olympic rower (1956).Joaquín Pérez * Piper Laurie, 91, American actress (Carrie, The Hustler, Children of a Lesser God), Emmy winner (1987).Piper Laurie, Oscar-Nominated ‘Carrie’ and ‘The Hustler’ Star, Dead at 91 * Wadea al-Fayoume, 6, American child, stabbed. ===15=== * Jean-Roger Milo, 66, French actor (A Sunday in the Country, Among Wolves, Germinal).Mort de Jean-Roger Milo à 66 ans : Cécile Bois rend un vibrant hommage à l’acteur de Germinal * Suzanne Somers, 76, American actress (Three's Company, Step by Step, She's the Sheriff), breast cancer.Suzanne Somers Dead at 76 After Breast Cancer Battle ===16=== * Martti Ahtisaari, 86, Finnish politician, president (1994–2000), Nobel Prize laureate (2008).Presidentti Martti Ahtisaari 1937–2023 * Jesús Guzmán, 97, Spanish actor (Implacable Three, The Locket, Nothing Less Than a Real Man).Muere Jesús Guzmán, uno de los rostros más entrañables del cine y televisión españoles, a los 97 años ===17=== * Sir Tim Wallis, 85, New Zealand Hall of Fame aviation entrepreneur, founder of the Alpine Fighter Collection and the Warbirds over Wanaka.Beloved Wānaka Adventurer and Pioneer Sir Tim Wallis Passes Away ===18=== * Osvaldo Desideri, 84, Italian art director (The Last Emperor, Once Upon a Time in America, Salò, or the 120 Days of Sodom), Oscar winner (1988).Osvaldo Desideri, morto lo scenografo premio Oscar per ‘L'ultimo imperatore’ * Dwight Twilley, 72, American singer-songwriter (\"I'm on Fire\").Tulsa music artist Dwight Twilley dies ===19=== * Jamila Abdallah Taha al-Shanti, 68, palestinian politician, israeli airstrike. ===20=== * Haydn Gwynne, 66, English actress (Drop the Dead Donkey, The Windsors, Billy Elliot the Musical), cancer. * Hiba Abu Nada, 32, Palestinian poet and novelist, israeli airstrike. ===21=== * Sir Bobby Charlton, 86, English Hall of Fame football player (Manchester United, national team) and manager (Preston North End), world champion (1966).Sir Bobby Charlton, Manchester United legend and World Cup winner, dies at 86 * Bill Hayden, 90, Australian politician, governor-general (1989–1996), minister for foreign affairs (1983–1988), and leader of the opposition (1977–1983).Bill Hayden dies * Amusaa Mwanamwambwa, 83, Zambian politician, minister of tourism (1996–1998).Ex Speaker Amusaa Mwanamwambwa dies * Marzia Ubaldi, 85, Italian actress (The Predators, Nazi Love Camp 27, Suburra: Blood on Rome).Marzia Ubaldi, morta l'attrice de \"I Cesaroni\" e \"Suburra\": aveva 85 anni ===22=== * Reino Börjesson, 94, Swedish footballer (IFK Göteborg, Norrby IF, national team).Reino Börjesson är död – blev 94 år gammal * Dave Courtney, 64, English gangster, writer, and actor (Triads, Yardies and Onion Bhajees, The Dead Sleep Easy, Killer Bitch), suicide by gunshot.Notorious former London gangster Dave Courtney found dead at age 64 * Don Laughlin, 92, American gambling entrepreneur.Don Laughlin, who founded the riverside resort town, dies at 92 (death announced on this date) ===23=== * Bishan Singh Bedi, 77, Indian cricketer (Northern Punjab, Delhi, national team).Legendary India spinner Bishan Singh Bedi passes away aged 77 * Angelo Bruschini, 62, English guitarist (The Blue Aeroplanes, Massive Attack), lung cancer.Massive Attack Guitarist Angelo Bruschini Dies After Lung Cancer Diagnosis * Mervin Shiner, 102, American country singer (\"Why Don't You Haul Off and Love Me\"), songwriter and guitarist.Merv Shiner ===24=== * Hans Albert, 102, German philosopher.Philosoph Hans Albert mit 102 Jahren gestorben * Niels Holst-Sørensen, 100, Danish Olympic athlete (1948) and air force officer.Tidligere dansk IOC-medlem Niels Holst-Sørensen er død * Richard Roundtree, 81, American actor (Shaft, Se7en, Speed Racer), pancreatic cancer.Richard Roundtree Dies: ‘Shaft’ Star Was 81 ===25=== * Ajith Abeyratne, 75, Sri Lankan rugby union player (Ceylonese, national team), coach (national rugby sevens team), and commentator.Rugby Legend Ajith Abeyratne Passes Away ===26=== * Guy Camberabero, 87, French rugby union player (La Voulte-Sportif, US Tyrosse, national team).Rugby : l'ancien international ardéchois Guy Cambérabéro est décédé * Richard Moll, 80, American actor (Night Court, House, Batman: The Animated Series).Richard Moll, Bull the Bailiff on ‘Night Court,’ Dies at 80 * Sir Jon Trimmer, 84, New Zealand ballet dancer, cancer.Mainstay of New Zealand ballet Sir Jon Trimmer dies aged 84 ===27=== * Hiroshi Inuzuka, 94, Japanese actor (Daigoro vs. Goliath, Eijanaika, Chameleon) and bassist.犬塚弘さんが死去、９４歳 クレージーキャッツメンバー、哀愁漂う演技も * Li Keqiang, 68, Chinese politician, premier (2013–2023), heart attackChina ex-Premier Li Keqiang, sidelined by Xi Jinping, dies at 68 ===28=== * Matthew Perry, 54, American-Canadian actor (Friends, The Whole Nine Yards, Fallout: New Vegas), drowned.Matthew Perry, ‘Friends’ actor, dies of apparent drowning at 54 ===29=== * Joey Paras, 45, Filipino actor (Bekikang: Ang Nanay Kong Beki, FlordeLiza, Sunday PinaSaya) and comedian.Actor Joey Paras dies at 45 * Tony Rohr, 84, Irish actor (The Long Good Friday, Harry's Game, The Lakes), prostate cancer.Tony Rohr obituary ===30=== * Fernando Almada, 94, Mexican actor (El valle de los miserables, Puerto maldito, La jaula de oro).Murió Fernando Almada, actor y hermano de Mario Almada, a los 94 años * Frank Howard, 87, American baseball player (Washington Senators, Texas Rangers, Los Angeles Dodgers), complications from a stroke.Legendary MLB Slugger Frank Howard Has Died ===31=== * Tyler Christopher, 50, American actor (General Hospital, Days of Our Lives, The Lying Game), cardiac arrest.General Hospital Actor Tyler Christopher Dead at 50: 'A Sweet Soul and Wonderful Friend' * Fabien Roy, 95, Canadian politician, MP (1979–1980) and Quebec MNA (1970–1979).Décès de Fabien Roy : sa fille Brigitte lui rend hommage *Mel Sembler, 93, American diplomat, ambassador to Italy (2001–2005) and Australia (1989–1993).Mel Sembler, Florida developer and top Republican fundraiser, dies at 93 * Elmar Wepper, 79, German actor (Der Kommissar, Cherry Blossoms, Lammbock) and voice actor.TV-Star Elmar Wepper (79) ist tot ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *10 Category:October 2023 events",
 "title": "Deaths in October 2023"
}