{
 "id": "986495",
 "text": "The White-Slave Traffic Act, also called the Mann Act, is a United States federal law. It was passed June 25, 1910 (ch. 395, ; codified as amended at ). It is named after Congressman James Robert Mann of Illinois. The act made it illegal to bring women or girls from one state into another for the purpose of \"prostitution or debauchery, or for any other immoral purpose,\" which means for them to have sex for money. The law was there to stop human trafficking. Most human trafficking was people taking young women from place to place for prostitution. The Mann Act was one of a group of laws about moral reform, during an era that was known as Progressive Era. It had a problem though: the language used was often ambiguous or unclear. It was even used to make agreed sex between adults a crime. This was because people thought of sex as immoral if the two people were not married.. Congress changed it twice, in 1978, and 1986, so that it would only be used for prostitution or other illegal sexual acts. == Promotion == In the 19th century, in many American cities, people could only sell sex for money in some areas of the city. These were called red light districts. During that time, cities became more urbanized; also more women started to work. This meant that there would be more cases, where courtship could take place without supervision. In this environment, a concern of \"white slavery\" started: the fear was that women would be kidnapped and forced into prostitution. In 1847, Charles Sumner had described the Barbary slave trade. The ideas originally were from this description. Communities started to set up vice commissions, to look how widespread local prostitution was. They also looked into questions, if the prostitutes were forced, and if cartel-type organizations ran local prostitution. These commissions also closed the brothels and the red light districts. The laws in the cities, which were liberal at first became more and more restrictive. Throughout the last few decades of the 19th century, there was more and more opposiition to an open prostution on the streets. The Federal Government responded to this with the Mann Act. The purpose of the act was to make it a crime to \"transport [...], or aid to assist in obtaining transportation for\" or to \"persuade, induce, entice or coerce\" a woman to travel. Many of the changes that occurred after 1900 were a result of tensions between social ideals and practical realities. Family form and functions changed in response to a complex set of circumstances that were the effects of economic class and ethnicity. According to historian Mark Thomas Connelly, a group of books and pamphlets appeared announcing a startling claim: There was a conspiracy, which trapped white girls, seduced them, and forced them into prostitution, or 'white slavery'. These stories started around 1909.. They often wrote about innocent girls \"victimized by a huge, secret and powerful conspiracy controlled by foreigners\", as they were drugged or imprisoned and forced into prostitution. This excerpt from The War on the White Slave Trade was written by the United States District Attorney in Chicago: Connelly says that these issues were real problems that had been there for a long time. The concerns simply made them bigger. These issues came from the fact that many young girls from the countryside came into the cities looking for work. Some of them became prostitutes, because they were well-paid.. A number of Vice Commission reports had drawn attention to the issue. Some people of the time questioned the idea of abduction and foreign control of prostitution through cartels. Emma Goldman was a noted radical and feminist. She asked \"What is really the cause of the trade in women? Not merely white women, but yellow and black women as well. Exploitation, of course; the merciless Moloch of capitalism that fattens on underpaid labor, thus driving thousands of women and girls into prostitution. With Mrs. Warren these girls feel, 'Why waste your life working for a few shillings a week in a scullery, eighteen hours a day?' ... Whether our reformers admit it or not, the economic and social inferiority of woman is responsible for prostitution.\"Emma Goldman, The Traffic In Women Red Emma Speaks: Selected Writings and Speeches. New York: Random House, 1972. While prostitution was widespread, contemporary studies by local vice commissions indicate that it was \"overwhelmingly locally organized without any large business structure, and willingly engaged in by the prostitutes.\"Langum, David J. (1994). Crossing Over the Line: Legislating Morality and the Mann Act. Chicago: University of Chicago Press. Suffrage activists, especially Harriet Burton Laidlaw. and Rose Livingston, took up the concerns. They worked in New York City's Chinatown and in other cities to rescue young white and Chinese girls from forced prostitution, and helped pass the Mann Act to make interstate sex trafficking a federal crime. Livingston publicly discussed her past as a prostitute and made the claim that she was abducted and developed a drug problem as a sex slave in a Chinese man's home, narrowly escaped, and experienced a Christian conversion. Although her claim was unsupported by evidence, her story exemplified the stereotypes used to pass the Mann Act—fear of foreigners, especially Chinese men; abduction and drugging in order to be raped and enslaved; a narrow escape; and salvation through Christian conversion. Other groups like the Woman's Christian Temperance Union and Hull House focused on children of prostitutes and poverty in community life while trying to pass protective legislation. The American Purity Alliance also supported the Mann Act. === Notable prosecutions under the Mann Act === Person Year Decision Notes Bella Moore 1910 Convicted In People v.Moore , an all- white jury convicted Bella Moore, a mixed race woman from New York, for the “compulsory prostitution” of two white women - Alice Milton and Belle Woods - using the Mann Act. Jack Johnson 1913 Convicted (Pardoned in 2018) In October and November 1912, boxer Jack Johnson was arrested twice under the Mann Act. It was generally acknowledged that the arrests were racially motivated. A posthumous presidential pardon was granted in 2018 by President Donald Trump. Farley Drew Caminetti 1913 Convicted He and Maury I. Diggs took their mistresses from Sacramento, California to Reno, Nevada. Their wives informed the police, and both men were arrested in Reno. Caminetti v. United States expanded Mann Act prosecutions from prostitution to non-commercial extramarital sex. William I. Thomas 1918 Acquitted Pioneering sociologist William I. Thomas's academic career at the University of Chicago was irreversibly damaged after he was arrested under the act when caught in the company of one Mrs. Granger, the wife of an army officer with the American forces in France. Thomas was acquitted at trial. Frank Lloyd Wright 1926 Charges dropped In October 1926, Wright and Olga Lazovich Hinzenburg were accused of violating the Mann Act and he was arrested in Minnetonka, Minnesota. Finis Dake 1937 Convicted In 1937, he was convicted of violating the Mann Act by willfully transporting Emma Barelli, age 16, across the Wisconsin state line \"for the purpose of debauchery and other immoral practices\". The May 27, 1936, issue of the Chicago Daily Tribune reported that Dake registered at hotels in Waukegan, Bloomington, and East St. Louis with the girl under the name \"Christian Anderson and wife\". In order to avoid a jury trial and the possibility of being sentenced to a maximum of 10 years in prison and a fine of $10,000, Dake pleaded guilty. Subsequently, he served six months in the House of Corrections in Milwaukee, Wisconsin. George Barker 1940 Charges dropped The British poet was arrested crossing a state border with his lover Canadian author Elizabeth Smart in 1940. She described the arrest in her book By Grand Central Station I Sat Down and Wept. Charlie Chaplin 1944 Acquitted Chaplin met Joan Barry, age 24, in 1941. He signed her to a $75-a-week contract for a film he was putting together, and she became his mistress. By mid-1942, Chaplin let her contract expire. To send her home, Chaplin paid her train fare to New York which led to his arrest. Chaplin was acquitted of the charges. Rex Ingram 1949 Convicted Plead guilty to the charge of taking a teenage girl to New York for immoral purposes. The actor was sentenced to eighteen months in jail. He only served ten months of his sentence. The incident affected his career for the next six years. Frank La Salle 1950 Convicted La Salle was tried, convicted, and sentenced to 30 to 35 years in prison under the Mann Act for abducting and raping Florence Sally Horner during a 21-month period while traveling from New Jersey to California. Kid Cann 1959 Convicted/ Acquitted on appeal Cann, who was an organized crime figure from Minneapolis, Minnesota, was prosecuted and convicted for transporting a prostitute from Chicago to Minnesota. His conviction was later overturned on appeal. Cann was later prosecuted and convicted of offering a bribe to a juror at his Mann Act trial.Neil Karlen (2013), Augie's Secrets: The Minneapolis Mob and the King of the Hennepin Strip, Minnesota Historical Society Press, page 161. Charles Manson 1960 Charges dropped Manson took two prostitutes from California to New Mexico to work. Chuck Berry 1962 Convicted In January 1962, Berry was sentenced to three years in prison for offenses under the Mann Act when he had transported a girl, age 14, across state lines. Tony Alamo 2008 Convicted The former American religious leader was arrested under the Mann Act in September 2008. He was subsequently convicted on 10 counts of interstate transportation of minors for illegal sexual purposes, rape, sexual assault, and contributing to the delinquency of minors. Brian David Mitchell 2010 Convicted Former street preacher and pedophile; convicted in 2010 of interstate kidnapping and unlawful transportation of a minor across state lines in connection with the 2002 abduction of Elizabeth Smart; currently serving a life sentence in federal prison. Jack Schaap 2012 Convicted Pastor at mega-church First Baptist Church (Hammond, Indiana) and Chancellor of Hyles–Anderson College, pleaded guilty to transportation of a minor, age 16, across state lines to have sex with her. He was sentenced to 12 years in prison. R. Kelly 2021 Convicted Singer/actor Ghislaine Maxwell 2021 Convicted Socialite/publishing heiress. Charged with sex trafficking of minors for Jeffrey Epstein. On December 29, 2021, a jury found her guilty on five of six counts involving sex trafficking of minors. Sentenced to 20 years. == References == == Books and articles on the subject == * * * Donovan, Brian. White Slave Crusades: Race, Gender, and Anti-vice Activism, 1887-1917. United States: University of Illinois Press, 2010. ISBN 978-0-252-09100-1. == Other websites == * Category:United States federal legislation",
 "title": "Mann Act"
}