{
 "id": "986488",
 "text": "In most Christian churches, the Holy Spirit, or Holy Ghost, is the third person of the Trinity. The Trinity is a God made up of three persons: God the Father, God the Son, and God the Holy Spirit, who share the same qualities and essence and are therefore One God. Christians who don't believe in the Trinity have a big difference in their beliefs about the Holy Spirit. In Christian theology, pneumatology is the study of the Holy Spirit. Christianity came from Judaism. People who study the Bible often identify the Holy Spirit with the the Ruach Hakodesh in Jewish scripture. They think that Jesus was expanding upon these Jewish concepts. Spirit of Truth: The origins of Johannine pneumatology by John Breck 1990 , pp. 1–5 ==The Holy Spirit and the Bible== Christians believe that the Bible is the work of the Holy Spirit. The Holy Spirit revealed truth to the human authors. John 16:13 In the Old Testament the prophets were \"carried along\" by the Holy spirit when they wrote. 2 Peter 1:21 Thus the scriptures are said to be \"God breathed\". 2 Timothy 3:16 The word for breath and spirit are the same in the Greek language. This is the language that the New Testament is written in. Christians think this means that the Holy Spirit helped the authors to write the Bible books. https://www.ligonier.org/podcasts/simply-put/the-inspiration-of-scripture ==The Holy Spirit and the World== Jesus said that the Holy Spirit would \"convince the world of sin, righteousness and judgement\". John 16:8 This means that people know right from wrong, and they know that God will punish evil. This is God's way of bringing people to call on God for salvation. It is part of Divine grace. ==The Holy Spirit and Jesus== The New Testament tells how the Holy Spirit relates to Jesus. Jesus in Trinitarian Perspective: An Introductory Christology by Scott Horrell, Donald Fairbairn, Garrett DeWeese and Bruce Ware (2007) pp. 208–213 The Gospels of Matthew and Luke and the Nicene Creed say that Jesus was \"conceived by the Holy Spirit, born of the Virgin Mary\". https://www.usccb.org/prayers/nicene-creed The Holy Spirit descended on Jesus like a dove during his baptism. After the Last Supper Jesus promised to send the Holy Spirit to his disciples after he went to Heaven. ==The Holy Spirit and Christians== The Christian Bible says that the Holy Spirit comes to live in each Christian. He produces the \"fruits of the Spirit\", which are love, joy, peace, long-suffering (patience), kindness, goodness, faithfulness, meekness, self-control. Galatians 5:22-23 The Holy Spirit also gives gifts to Christians. Millard J. Erickson (1992). Introducing Christian Doctrine. Baker Book House. pp. 265–270 These include the ability to preach the gospel, having strong faith, praying for people to be healed, speaking in other languages and understanding them. Some other gifts are teaching, being kind and helping people. Romans 12 Christians do not all agree about these gifts. Some Christians think that the supernatural gifts no longer are given. They say they were only seen in Bible times. Others think that these miracles still happen today. https://thecontentauthority.com/blog/cessationism-vs-continuation == Names == === Hebrew Bible === Source:Catechism of the Catholic Church: Expectation of the Messiah and his Spirit (nos. 711–712). * וְר֣וּחַ קָדְשׁ֑וֹ (Ruah qadesow) – His Holy Spirit (Isaiah 63:10)Interlinear Bible on Bible Hub. * וְר֣וּחַ קָ֝דְשְׁךָ֗ (Ruah qadseḵa) – Your Holy Spirit (Psalm 51:11)Interlinear Bible on Bible Hub. * וְר֣וּחַ אֱלֹהִ֔ים (Ruah Elohim) – Spirit of God (Genesis 1:2)Interlinear Bible on Bible Hub. * נִשְׁמַת־ר֨וּחַ חַיִּ֜ים (Nismat Ruah hayyim) – The Breath of the Spirit of Life (Genesis 7:22)Interlinear Bible on Bible Hub. * ר֣וּחַ יְהוָ֑ה (Ruah YHWH) – Spirit of YHWH (Isaiah 11:2)Interlinear Bible on Bible Hub. * ר֧וּחַ חָכְמָ֣ה וּבִינָ֗ה (Ruach hakmah ubinah) – Spirit of Wisdom and Understanding (Isaiah 11:2) * ר֤וּחַ עֵצָה֙ וּגְבוּרָ֔ה (Ruah esah ugeburah) – Spirit of Counsel and Might (Isaiah 11:2) * ר֥וּחַ דַּ֖עַת וְיִרְאַ֥ת יְהוָֽה (Ruah daat weyirat YHWH) – Spirit of Knowledge and Fear of YHWH (Isaiah 11:2) === New Testament === * πνεύματος ἁγίου (Pneumatos Hagiou) – Holy Spirit (Matthew 1:18) * πνεύματι θεοῦ (Pneumati Theou) – Spirit of God (Matthew 12:28) * ὁ παράκλητος (Ho Paraclētos) – The Comforter, cf. Paraclete John 14:26 (John 16:7) * πνεῦμα τῆς ἀληθείας (Pneuma tēs Alētheias) – Spirit of Truth (John 16:13) * Πνεῦμα Χριστοῦ (Pneuma Christou) – Spirit of Christ (1 Peter 1:11) Depending on context: * πνεῦμα (Pneuma) – Spirit (John 3:8) * Πνεύματος (Pneumatos) – Spirit (John 3:8) == Related pages == * Trinity * Holy Spirit == References == Category:Christian terminology",
 "title": "Holy Spirit in Christianity"
}