{
 "id": "986490",
 "text": "Adedamola Adefolahan (born 5 February 1996), known professionally as Fireboy DML, is a Nigerian singer. He has his own record label know as YBNL Nation. ==Discography== ===Studio albums=== List of albums, with selected chart positions Title Album details Peak chart positions US Laughter, Tears and Goosebumps * Released: 29 November 2019 * Label: YBNL Nation * Formats: CD, LP, digital download, streaming — Apollo * Released: 20 August 2020 * Label: YBNL Nation * Formats: CD, LP, digital download, streaming — Playboy * Released: 5 August 2022 * Label: YBNL Nation * Formats: CD, LP, digital download, streaming 123 ===Singles=== ====As lead artist==== List of singles, with selected chart positions Title Year Peak chart positions Certifications Album CAN FRA IRE SWE SWI UK UK Indie US US World WW \"Jealous\" 2018 — — — — — — — — — — Laughter, Tears and Goosebumps \"What If I Say\" 2019 — — — — — — — — — — \"King\" — — — — — — — — — — \"New York City Girl\" 2020 — — — — — — — — — — Apollo \"Eli\" — — — — — — — — — — \"Tattoo\" — — — — — — — — — — \"Champion\" — — — — — — — — — — \"Peru\" 2021 37 40 7 35 31 2 13 53 2 34 * BPI: 2× Platinum * RIAA: Gold Playboy \"Running\" — — — — — — — — — — Providence \"Beauty & the Madness\" 2022 — — — — — — — — — — \"Playboy\" — — — — — — — — — — Playboy \"—\" denotes a recording that did not chart or was not released in that territory. ====As featured artist==== List of singles, with selected chart positions Title Year Peak chart positions Album US Dance \"Frozen (Fireboy DML remix)\" 2022 12 ==Awards and nominations== Year Award ceremony Prize Recipient Result Ref 2019 The Headies Next Rated Himself Viewer's Choice Song of the Year \"Jealous\" City People Music Awards Most Promising Act of the Year Himself Best New Act of the Year Revelation of the Year 2020 Soundcity MVP Awards Festival Song of the Year \"Jealous\" Listeners' Choice Fireboy DML for \"Jealous\" Best New MVP Himself The Headies Album of the Year Apollo Best Pop Album Best R&B; Album \"Tears, Laughter and Goosebumps\" Best R&B; Single \"Tattoo\" Headies Revelation Fireboy DML 2021 African Entertainment Awards USA Song of the Year \"Peru\" All Africa Music Awards African Fan's Favourite Himself NAACP Image Awards Outstanding International Song \"Peru\" The Future Awards Africa Prize for Music (Endowed by Infinix) Himself 2022 The Headies Best Songwriter of the Year \"Peru\" Best Afrobeat Single (Nigeria) Song of the Year Viewer's Choice Himself for \"Peru\" BET Awards Best International Act Himself ==References== ==Other websites== Category:Pop singers Category:Living people Category:Nigerian singers Category:1996 births",
 "title": "Fireboy DML"
}