{
 "id": "986607",
 "text": "Douglas Arthur Wimbish (born September 22, 1956) is an American musician. He is best known for playing the bass guitar for Living Colour and Tackhead. He has also been a session musician for many musicians, such as the Rolling Stones, Mick Jagger, Depeche Mode, James Brown, and Grandmaster Flash and the Furious Five. Wimbish has also made drum and bass music. He has made two drum and bass bands: Jungle Funk and Head Fake. == Life == Wimbish was born in Hartford, Connecticut. The first instrument he played was the mandolin. He started playing the guitar when he was 12 years old. He stopped playing the guitar, and started playing the bass guitar. In 1979, he joined Sugarhill Records. He was a member of Sugarhill's rhythm section. Wimbish played music for many popular songs when he was in the rhythm section. In 1984, he went to London with Skip McDonald and Keith LeBlanc. McDonald played the guitar, and LeBlanc played the drums. The three of them made Tackhead. Tackhead was a hip- hop group. In the 1990s, the Rolling Stones needed somebody to play the bass guitar. This was because their bass player, Bill Wyman, died. Wimbish played the bass guitar for them. He did not stay in the band, because Darryl Jones started playing the bass for them instead. Wimbish played the bass for Bridges to Babylon, a Rolling Stones album. In 1992, Wimbish joined Living Colour. This was because Muzz Skillings left the band. He helped make their third album, Stain. Living Colour stopped making music in 1995. Wimbish started playing music with Skip McDonald again. Wimbish made a drum and bass group named Jungle Funk in 1999. He made it with Will Calhoun and Vinx. Calhoun was the drummer for Living Colour. Later, Wimbish and Calhoun made another drum and bass group. It was named Head Fake. Wimbish made two albums by himself. These albums were named Trippy Notes for Bass (1999) and CinemaSonic (2008). In 2009, Living Colour made an album named The Chair in the Doorway. They went on a concert tour for it. == References == Category:1956 births Category:Living people Category:American bass guitarists Category:American funk musicians Category:American heavy metal musicians",
 "title": "Doug Wimbish"
}