{
 "id": "986685",
 "text": "Eugénie Decorne (died 12 August 1912) was a French swimmer in the 1900s and 1910s from Paris. She was a member of Ondine de Paris and Mouettes de Paris. ==Career== On 22 September 1907 she competed in the first breaststroke competition over 25 metres. The next year she became French national champion in the 100 metres event in a time of 2:01. In August she also the Femina race of the 6th edition of the world championships, organized by newspaper L'Auto in a time of 1:48.4. The same year she also won the 100 metres event in Joinville-le-Pont. She finished second in La Villette (60 metres) and Port Vitry (50 metres). In 1909 she became for the second time French national champion in the 100 metres event; in a time of 1:26. At the national CNP competitions she won the 50 metres event. Other prizes she won in 1909 were a second place in Abbeville (100 metres); third place in Saint-Ouen at the Mile Championship and the second prize at the \"Fête de la Villette\" in the 200 metre handicap event. On July 12, she took 2nd place in the 100m race at the meeting in Abbeville. On 17 July 1910 she finished second in the 100 metre event in Orléans and in 1911 she won the 50 metre event at the \"fête de la Gare\". In 1912, Eugénie Decorne is still one of the most successful French swimmers. She took part in several competitions including in the where she finished eleventh overall and second in the women's classification. However in preparation of the Women's Long Distance Championship, she contracts contracted typhoid fever, an infectious disease. A few days before the competition, her condition is improving significantly, but on the night of 11 August 1912, Decorne is in bad shape. She died on 12 August 1912 in the morning as a result of her illness. On 13 August 1912, she was buried in the Saint-Ouen Cemetery. ==Personal life== Decorne was the daughter of swimmer Jeanne Decorne. She married to Joe Thomas Eales. She worked at the music hall of the Magic City amusement park under the name \"Mademoiselle Eugenia\". ==References== ==Other websites== *Image of Decorne (1908) Category:Swimmers from Paris Category:Sportswomen Category:Year of birth missing Category:1912 deaths Category:19th-century births",
 "title": "Eugénie Decorne"
}