{
 "id": "986766",
 "text": "DC Studios, formerly named DC Films, is an American film and television studio. It is a division of Warner Bros. that oversees the production of films based on intellectual property owned by DC Entertainment. That is a subsidiary of Warner Bros. that manages its DC Comics units and characters in other units. DC Studios has produced every DC Extended Universe film since Suicide Squad (2016). From June to October 2022, Michael De Luca and Pam Abdy were Interim presidents for DC Films. On October 25, 2022, James Gunn and Peter Safran were confirmed as the new bosses of DC Studios. The pair assumed office on November 1st. == History == DC Films previously existed as a production banner within Warner Bros. It was reorganized to be a formal division after Batman v Superman: Dawn of Justice underperformed at the box office and had a negative reception. This was done to compete more directly with its popular rival, the Marvel Cinematic Universe. Due to the underperformance and negative reception of Justice League, Warner Bros. announced a new strategy and organization of DC Films. In January 2018, it was announced that Warner Bros. executive Walter Hamada will be the new president of DC Films, and will oversee all future DCEU projects. In February 2018, Chantal Nong Vo was announced to be the vice president of production for DC Films. On April 5, 2022, Warner Bros. Discovery announced a reshape of DC Entertainment and its film division. Newcomer president David Zaslav announced that he was looking for a \"Kevin Feige\" type figure to lead DC Films., On August 5, 2022, after Batgirl cancellation, then president Walter Hamada was deeply upset and threatened to resign. He agreed to stay on until the release of Black Adam. On October 25, 2022, James Gunn and Peter Safran were announced as the new executives of the newly rebranded name \"DC Studios\". == Key people == === Current === * James Gunn * Peter Safran === Former === * Geoff Johns (2016-2017) * Jon Berg (2016-2017) * Walter Hamada (2018-2022) * Chantal Nong (2018-2022) == Films == === Released === * Suicide Squad (2016) first DC Films in 3D. first DC Films in IMAX. * Wonder Woman (2017) second DC Films in 3D. second DC Films in IMAX. * Justice League (2017) third DC Films in 3D. third DC Films in IMAX. * Aquaman (2018) fourth DC Films in 3D. fourth DC Films in IMAX. * Shazam! (2019) fifth DC Films in 3D. fifth DC Films in IMAX. * Joker (2019) sixth DC Films in IMAX. first DC Films’s R-Rated. * Birds of Prey (2020) seventh DC Films in IMAX. second DC Films’s R-Rated. * Wonder Woman 1984 (2020) latest DC Films in 3D. eighth DC Films in IMAX. * Zack Snyder's Justice League (2021) third DC Films’s R-Rated. * The Suicide Squad (2021) ninth DC Films in IMAX. latest DC Films’s R-Rated. * The Batman (2022) tenth DC Films in IMAX. * Black Adam (2022) latest DC Films in IMAX. * Shazam! Fury of the Gods (2023) first DC Studios in IMAX. * The Flash (2023) second DC Studios in IMAX. * Blue Beetle (2023) third DC Studios in IMAX. * Aquaman and the Lost Kingdom (2023) first-latest DC Studios in 3D. fourth DC Studios in IMAX. * Joker: Folie à Deux (2024) fifth DC Studios in IMAX. first DC Studios R-Rated. first DC Studios’s Musical. === Future === * Superman (2025) sixth DC Studios in IMAX. * The Batman – Part II (2025) seventh DC Studios in IMAX. * The Authority (TBC) * The Brave and the Bold (TBC) * Supergirl: Woman of Tomorrow (TBC) * Swamp Thing (TBC) == Television == === Released === * Peacemaker (2022–present) ** Season One (2022) ** Season Two (TBA) === Future === * Untitled The Suicide Squad spinoff series (TBA) == References == Category:Warner Bros.",
 "title": "DC Studios"
}