{
 "id": "986710",
 "text": "Ralph Hasenhüttl ( born 9 August 1967) is an Austrian professional football manager and former player. During his playing career, he played as a centre forward. ==Playing career== Born in Graz he started his career with hometown club GAK, making his first team debut in the 1985–86 season. Then he went to Austria Wien in 1989, with whom he won three successive Bundesliga titles and two Austrian Cups. His next stop was Austria Salzburg in 1994, where he won another Bundesliga title as well as an Austrian Super Cup. From 1996 on Hasenhüttl played abroad playing for Mechelen and Lierse in Belgium. Then he signed for 1. FC Köln and in 2000 moved to SpVgg Greuther Fürth. Hasenhüttl finished his career at Bayern Munich II, in the Regionalliga Süd. Hasenhüttl played eight times for the Austria national team, scoring three goals. ==Managerial career== ===SpVgg Unterhaching=== Between 2004 and 2005 Hasenhüttl was a youth-team coach at SpVgg Unterhaching. In March 2007, he became caretaker manager until the appointment of Werner Lorant, under whom he worked as assistant coach. On 4 October 2007, Hasenhüttl became the new head coach. In the 2009–10 season they were less sucessful so Hasenhüttl was sacked on 22 February 2010. His final match was a 1–1 draw against Borussia Dortmund II on 21 February 2010. ===VfR Aalen=== In January 2011, Hasenhüttl followed Rainer Scharinger as the coach of third division VfR Aalen, Aalen was in 16th place, one point above the relegation zone. Aalen's survival in the 3. Liga earned him a year's contract extension. In the 2011–12 season Aalen finished in second place, earning automatic promotion to the 2. Bundesliga. 2012-13 the e team finished the season in ninth place, the highest of the newly promoted teams. After two-and-a-half successful years at Aalen, Hasenhüttl resigned in June 2013, when Aalen lost its main sponsor and sporting director Markus Schupp choosed an austerity programme for the following season.Vgl. Beim VfR prangt Prowin auf der Brust, kicker.de, retrieved 23 December 2012. ===FC Ingolstadt 04=== In October 2013 became coach of Ingolstadt 04,. In his first season, he took them from bottom of the 2. Bundesliga to tenth place. In the 2014–15 season, Hasenhüttl took Ingolstadt to the Bundesliga for the first time, finishing the season as 2. Bundesliga champions. In the 2015–16 season Ingolstadt stayed in the Bundesliga, but he did not extend his contract. ===RB Leipzig=== In May 2016, he became the new manager of newly promoted RB Leipzig. In his and the club's debut season in the Bundesliga Hasenhüttl led Leipzig to a second-place. The following season, the club finished sixth. He asked for termination of contract and in May 2018, he left RB Leipzig. ===Southampton=== On 5 December 2018 he became the new manager of Southampton. He was the first Austrian to manage in the Premier League. At that time the club was one point from safety. On 27 April 2019, Southampton secured Premier League status after a 3–3 draw against Bournemouth at St Mary's. They finished the season in 16th place. Hasenhüttl's side suffered a 9–0 home loss to Leicester City on 25 October 2019 and the joint-worst loss in Premier League history and worst on home ground. In June 2020, he signed a new contract to extend his stay at the club until 2024. Despite being in the relegation zone in early November, Southampton ended the season on a seven-game unbeaten streak to finish in 11th place, their best finish in three seasons. Southampton ended the 2020–21 season struggling and finishing 15th. On 7 November 2022, Southampton parted company with Hasenhüttl. At the time, Southampton were in the Premier League relegation zone with 12 points after 14 games. ==Honours== ===Player=== Austria Wien *Austrian Bundesliga: 1990–91, 1991–92, 1992–93 *Austrian Cup: 1991–92, 1993–94 Austria Salzburg *Austrian Bundesliga: 1994–95 *Austrian Supercup: 1995 Lierse SK *Belgian Super Cup: 1997 ===Manager=== Aalen *3. Liga promotion:2011–12 FC Ingolstadt 04 *2. Bundesliga: 2014–15 Individual *Premier League Manager of the Month: July 2020 ==References== Category:1967 births Category:Living people Category:Austrian footballers Category:Association football forwards Category:FK Austria Wien players Category:FC Red Bull Salzburg players Category:1. FC Köln players Category:Players of the Austrian national football team Category:Austrian football managers Category:SpVgg Unterhaching managers Category:RB Leipzig managers Category:Bundesliga managers Category:Austrian football forwards Category:Austrian football champions",
 "title": "Ralph Hasenhüttl"
}