{
 "id": "986857",
 "text": "Yvonne Solange Huguette Jeanne (14 July 1910 - 22 September 1996) was a French competitive swimmer during the 1920s and 1930s. She was specialized in the breaststroke. She was national champion in the 200 metre breaststroke and was national record holder in the 500 metre breaststroke.Archives de Paris 18e, acte de naissance no 2908, 1910 ==Biography== ===Affiliations=== Jeanne started swimming with Mouettes de Paris when she was 17 years old. After permission of her parents she was trained by Domon and later by François Oppenheim. She worked as an instructor and trained among others Françoise Smith and Marguerite Martineau. Then, she moved to in 1933. She became again a member of Mouettes de Paris in 1944 where she became a board board member. In the 1950s, she was elected to the Fédération française de natation (FFNS). ===Swimming career=== Motto started swimming in 1922 and participated in school competitions between 1922 and 1928. In the early summer of 1928 she had an illness. Later in the summer of 1928 she started competing at the main competitions. In July 1928 she finished second at the championships of Paris in the 400 metre freestyle and at the national championships she finished second in the 200 metre breaststroke. Later the year in August she competed at the , a main open water race in Paris. With her team she finished in second place. In 1929 she became French national champion in the 200 metre breaststroke in a time of 3:38.4. In the following three years (1930, 1931 and 1932) she won the bronze medal in the 200 metre breaststroke at the national championships. At the national championships she became national in 1932 with her team in the medley relay event in a time of 4:29. On 17 August 1930 she she set the world record in the 500 metre breaststroke event with a time of 9:45.4 in Paris. Her last main swimming race was the on 2 September 1934. ===Personal life=== Jeanne was born in the 18th arrondissement of Paris on 14 July 1910. She was the Daughter of one of the presidents of the Association Sportive de la Seine founded in 1902. She attended the Edgar Quinet school in the 14th arrondissement of Paris. She liked hockey at a young age. Her son was fencer Jacques Dimont (1968-1945) who won the gold medal at the 1968 Summer Olympics. Her son married to Olympic swimmer Danièle Dorléans. Jeanne was secretary and later journalist in 1934 at the Petit Parisien and also at Match-L'Intran, Le Figaro, and L'Équipe. Next to swimming she also did horse riding, table tennis and modern pentathlon. She died on 22 September 1996 in Bayeux at the age of 86. ==References== Category:Swimmers from Paris Category:French journalists Category:Sportswomen Category:1910 births Category:1996 deaths Category:World record holders",
 "title": "Yvonne Jeanne"
}