{
 "id": "987026",
 "text": "Color mixing means mixing two or more colors together. For example, mixing green and cyan makes the color spring green. It is not commonly taught to children, as it does not correspond to the mixing of physical substances which would correspond to subtractive mixing. Two beams of light that are superimposed mix their colors additively. The mixing of colored physical substances corresponds to an additive color and subtractive color mixing, hence it corresponds to our intuition about mixing colors. == How to mix colors == === A closer look at mixing colors === To mix colors, you can use paint. For example, consider mixing red and yellow. Mixing the two colors makes the color orange. Orange is named after a species of citrus. When we mix blue and green, it makes the color teal. You can also mix red and purple, thus making magenta. However, if you mix red and magenta, they create the color crimson. === Guide to mixing colors === * When we mix cyan and blue, it makes azure. * When we mix red and blue, it makes purple. * When we mix red and yellow, it makes orange. * When we mix blue and black, it makes navy blue. * When we mix yellow and white, it makes cream. * When we mix blue and yellow, it makes green. * When we mix red and green, it makes brown. == Average mixing == Average mixing can be confused with subtractive mixing. For example, even though red and blue average to purple, an attempt to make a particular shade of purple by mixing red and blue paint may fail, since there is no purple spectrum between the red and blue spectra. Paint mixing can result in average wavelength. For example, mixing blue and yellow usually results in some shade of green despite them being complementary colors, because there is a green spectrum between the yellow spectrum and the blue spectrum. It's also one reason why mixing red and blue along with white can result in gray, because red and blue average to purple, but the average wavelength is green which is a complementary color of purple. mixing Category:Light __NOTOC__",
 "title": "Color mixing"
}