{
 "id": "987029",
 "text": "The National Football League Comeback Player of the Year Award is a number of awards that are given to a National Football League (NFL) player who has become better after a bad season before. The awards have been chosen by some groups, including the Associated Press (AP), Pro Football Writers Association (PFWA), Sporting News, and United Press International (UPI). As of the 2022 season, Chad Pennington has been the only player to have won the Associated Press NFL Comeback Player of the Year Award in multiple seasons. ==AP Comeback Player of the Year award (1963–1966, 1998–present)== From 1963 to 1966, the award was given to both an NFL and AFL player. No award was given between 1966 and 1998. * AP Comeback Player of the Year Year Player Position Team 1963 Jim Martin Kicker Baltimore Colts Paul Lowe Running back San Diego Chargers 1964 Lenny Moore Baltimore Colts Abner Haynes Kansas City Chiefs 1965 John Brodie Quarterback San Francisco 49ers Paul Lowe (2) Running back San Diego Chargers 1966 Dick Bass Los Angeles Rams Babe Parilli Quarterback Boston Patriots No award given between 1967 and 1997 1998 Doug Flutie Quarterback Buffalo Bills 1999 Bryant Young Defensive tackle San Francisco 49ers 2000 Joe Johnson Defensive end New Orleans Saints 2001 Garrison Hearst Running back San Francisco 49ers 2002 Tommy Maddox Quarterback Pittsburgh Steelers 2003 Jon Kitna Cincinnati Bengals 2004 Drew Brees San Diego Chargers 2005 Tedy Bruschi Linebacker New England Patriots Steve Smith Sr. Wide receiver Carolina Panthers 2006 Chad Pennington Quarterback New York Jets 2007 Greg Ellis Defensive end Dallas Cowboys 2008 Chad Pennington (2) Quarterback Miami Dolphins 2009 Tom Brady New England Patriots 2010 Michael Vick Philadelphia Eagles 2011 Matthew Stafford Detroit Lions 2012 Peyton Manning Denver Broncos 2013 Philip Rivers San Diego Chargers 2014 Rob Gronkowski Tight end New England Patriots 2015 Eric Berry Safety Kansas City Chiefs 2016 Jordy Nelson Wide receiver Green Bay Packers 2017 Keenan Allen Los Angeles Chargers 2018 Andrew Luck Quarterback Indianapolis Colts 2019 Ryan Tannehill Tennessee Titans 2020 Alex Smith Washington Football Team 2021 Joe Burrow Cincinnati Bengals 2022 Geno Smith Seattle Seahawks ==PFW/PFWA Comeback Player of the Year award (1972–present)== From 1972 to 1991, the Comeback Player of the Year award was given by Pro Football Weekly (PFW) only. PFW and the Professional Football Writers of America (PFWA) combined their awards from 1992–2012. Season Player Team Position 1972 Earl Morrall Miami Dolphins Quarterback 1973 Roman Gabriel Philadelphia Eagles 1974 Joe Namath New York Jets 1975 Dave Hampton Atlanta Falcons Running back 1976 Greg Landry Detroit Lions Quarterback 1977 Craig Morton Denver Broncos 1978 John Riggins Washington Redskins Running back 1979 Larry Csonka Miami Dolphins Fullback 1980 Jim Plunkett Oakland Raiders Quarterback 1981 Ken Anderson Cincinnati Bengals 1982 Lyle Alzado Los Angeles Raiders Defensive end 1983 Billy Johnson Atlanta Falcons Wide receiver 1984 John Stallworth Pittsburgh Steelers 1985 1986 Joe Montana San Francisco 49ers Quarterback Tommy Kramer Minnesota Vikings 1987 Charles White Los Angeles Rams Running back 1988 Greg Bell Los Angeles Rams 1989 Ottis Anderson New York Giants 1990 Barry Word Kansas City Chiefs 1991 Jim McMahon Philadelphia Eagles Quarterback 1992 Randall Cunningham 1993 Marcus Allen Kansas City Chiefs Running back 1994 Dan Marino Miami Dolphins Quarterback 1995 Jim Harbaugh Indianapolis Colts Garrison Hearst Arizona Cardinals Running back 1996 Jerome Bettis Pittsburgh Steelers 1997 Robert Brooks Green Bay Packers Wide receiver 1998 Doug Flutie Buffalo Bills Quarterback 1999 Bryant Young San Francisco 49ers Defensive tackle 2000 Joe Johnson New Orleans Saints Defensive end 2001 Garrison Hearst (2) San Francisco 49ers Running back 2002 Tommy Maddox Pittsburgh Steelers Quarterback 2003 Jon Kitna Cincinnati Bengals 2004 Willis McGahee Buffalo Bills Running back 2005 Steve Smith Carolina Panthers Wide receiver 2006 Chad Pennington New York Jets Quarterback 2007 Randy Moss New England Patriots Wide receiver 2008 Chad Pennington (2) Miami Dolphins Quarterback 2009 Tom Brady New England Patriots 2010 Michael Vick Philadelphia Eagles 2011 Matthew Stafford Detroit Lions 2012 Peyton Manning Denver Broncos 2013 Philip Rivers San Diego Chargers 2014 Rob Gronkowski New England Patriots Tight end 2015 Eric Berry Kansas City Chiefs Safety 2016 Jordy Nelson Green Bay Packers Wide receiver 2017 Keenan Allen Los Angeles Chargers 2018 Andrew Luck Indianapolis Colts Quarterback 2019 Ryan Tannehill Tennessee Titans 2020 Alex Smith Washington Football Team 2021 Joe Burrow Cincinnati Bengals 2022 Geno Smith Seattle Seahawks ==UPI Comeback Player of the Year award (1962–1969)== In 1962, United Press International (UPI) chose a comeback player for the first time. The winner, Frank Gifford, had made a comeback from a bad injury from a hit by Chuck Bednarik. The following year, the Associated Press (AP) made a similar award. UPI stopped the award after 1963. They gave it one more time in 1969. The AP did not give out the award from 1967 to 1998. *1962 Frank Gifford, WR, New York GiantsUnited Press International (1-04-1963). NFL Comeback-of-the-Year Award Voted to Frank Gifford of Giants Hartford Courant, Hartford CT. Retrieved 12-20-2009. *1963 Ed Brown, QB, Pittsburgh SteelersUnited Press International. (12-21-1963).Steelers' Brown Comeback Winner Lodi News- Sentinel. Retrieved 12-20-2009. *1964–1968 No award given *1969 Gale Sayers, RB, Chicago Bears ==Sporting News NFL Comeback Player of the Year award== * 2008 — Antonio Bryant, WR, Tampa Bay BuccaneersSporting News. (January 15, 2009). SN's Comeback Player of the Year: Antonio Bryant Sporting News Retrieved 12-20-2009. * 2009 — Vince Young, QB, Tennessee TitansSporting News. (January 14, 2010). Titans QB Vince Young voted Sporting News 2009 NFL Comeback Player of the Year Sporting News Retrieved 12-20-2009. * 2010 — Michael Vick, QB, Philadelphia Eagles * 2011 — Plaxico Burress, WR, New York Jets * 2012 — Adrian Peterson, RB, Minnesota Vikings * 2013 — Darrelle Revis, CB, Tampa Bay Buccaneers * 2014 — Rob Gronkowski, TE, New England Patriots * 2015 — Carson Palmer, QB, Arizona Cardinals * 2016 — Jordy Nelson, WR, Green Bay Packers *2017 — Keenan Allen, WR, Los Angeles Chargers *2018 — Andrew Luck, QB, Indianapolis Colts * 2019 — Jimmy Garoppolo, QB, San Francisco 49ers *2020 — Alex Smith, QB, Washington Football Team *2021 — Joe Burrow, QB, Cincinnati Bengals *2022 — Geno Smith, QB, Seattle Seahawks * == References == ;General * ;Specific Category:National Football League trophies and awards",
 "title": "National Football League Comeback Player of the Year Award"
}