{
 "id": "987171",
 "text": "The Battle of Izium was a battle between Russia and Ukraine. It was part of the Eastern Ukraine offensive of the 2022 Russian invasion of Ukraine. The battle started in March 2022 for control of the town of Izium. The town is an important transportation center. The Russian military wanted to take Izium so its soldiers in Kharkiv Oblast could connect to Russian soldiers in the Donbas region. On 10 September 2022, Ukrainian forces took back the town during the 2022 Ukrainian Kharkiv counteroffensive. They found local mass graves with 440 bodies. Izium's population went down to 10,000 because of the war. == Battle == Russian attacks on Izium started on 28 February 2022. Rocket strikes by the Russian military started on 3 March. Eight civilians were killed on 3 March. The town's main hospital took a lot of damage. The next day, Russian soldiers moved towards Izium and got its northern outskirts. By 6 March, the Russian military had taken two of Izium's neighborhoods and its railway station. On 7 March, Russians said that Izium had been taken by Russian forces. However, this was not officially confirmed. The next day, fighting started between Russian and Ukrainian forces for control of the town. Russian troops were forced to leave. Between 9 and 10 March, 2,250 civilians were evacuated from Izium. Russian forces continued to slowly move towards the town. On 12 March, Russian soldiers took the northern part of the town. The next day, the Russian military moved forward more. However, they were again forced to move back. Sometime between 15 and 16 March, Russian soldiers took the southern part of Izium. Ukrainian forces took it back soon after. On 17 March, the US Department of Defense said that Izium was once again taken by Russian forces. This was denied by the Institute for the Study of War (ISW). The Russian military went over the river Donets near the Barvinkivsky Highway. They were stopped by Ukrainian forces after being ambushed. Fighting continued the next day. Between 19 and 20 March, the Russians tried to take the center of Izium was defeated. During the fighting, Russian soldiers tried to make a pontoon bridge over the river Donets. However, they were attacked. 19 Russian soldiers were killed and 46 wounded in this ambush. Among the dead was the commander of the engineering unit, Colonel Nikolay Ovcharenko. Eventually, Russian forces made two pontoon bridges and Russian tanks went over the river to encircle the Ukrainian-controlled part of Izium. On 22 March, Ukrainian forces tried to retake the town. On 24 March, the Russian military said that it had taken Izium. Ukraine said that fighting was still going on. According to a local official, Russian forces had the northern part of the town, while Ukrainian soldiers were in the south. He also said that Izium was blockaded and that the city had been \"completely destroyed\". By 27 March, the Russian military took the nearby village of Kamyanka and two other villages southwest and southeast of Izium. Ukrainian forces said that they quickly took back all three villages. They also said they shot down a Russian Sukhoi Su-34 fighter aircraft near Izium. Two days later, it was confirmed Kamyanka was under Russian control. On 1 April, the Ukrainian military confirmed Izium was under Russian control. The following day, in an interview for Ukrinform, Izium's Deputy Mayor Volodymyr Matsokin said that 80% of the city's houses had been destroyed and that there was no power, heating, or water in the city. == Civilian casualties == Mass graves with more than 440 bodies were found after the Russians were driven out of the town. === Recording of phone call, that points to possible war crimes === In late November, a phone call from a Russian soldier in the 27th Separate Guards Motor Rifle Brigade discussing killing of Izium's citizens during the September retreat was leaked. The soldier detailed a secondhand account of where his commanding officer Colonel Sergey Igorevich Safonov and another officer had stabbed an elderly Ukrainian woman and shot her husband respectively, killing both. == References == Izium Category:March 2022 events Category:April 2022 events",
 "title": "Battle of Izium (2022)"
}