{
 "id": "987229",
 "text": "The Bert Bell Award is given by the Maxwell Football Club to the player of the year in the National Football League (NFL). The award is named in honor of Bert Bell (1895–1959), who was the commissioner of the NFL and founder of the Maxwell Club. ==Winners== Season Player Position Team Ref Quarterback Baltimore Colts Quarterback Philadelphia Eagles Running back Green Bay Packers Defensive end New York Giants Running back Cleveland Browns Quarterback Baltimore Colts Tight end Philadelphia Eagles Quarterback Dallas Cowboys Quarterback Baltimore Colts Running back Cleveland Browns Quarterback Los Angeles Rams Quarterback Oakland Raiders Quarterback Dallas Cowboys Running back Washington Redskins Running back Buffalo Bills Defensive tackle Los Angeles Rams Quarterback Minnesota Vikings Quarterback Oakland Raiders Quarterback Miami Dolphins Quarterback Pittsburgh Steelers Running back Houston Oilers Quarterback Philadelphia Eagles Quarterback Cincinnati Bengals Quarterback Washington Redskins Running back Washington Redskins Quarterback Miami Dolphins Running back Chicago Bears Linebacker New York Giants Wide receiver San Francisco 49ers Quarterback Philadelphia Eagles Quarterback San Francisco 49ers Quarterback Philadelphia Eagles Running back Detroit Lions Quarterback San Francisco 49ers Running back Dallas Cowboys Quarterback San Francisco 49ers Quarterback Green Bay Packers Quarterback Green Bay Packers Running back Detroit Lions Quarterback Minnesota Vikings Quarterback St. Louis Rams Quarterback Oakland Raiders Running back St. Louis Rams Quarterback Oakland Raiders Quarterback Indianapolis Colts Quarterback Indianapolis Colts Running back Seattle Seahawks Running back San Diego Chargers Quarterback New England Patriots Running back Minnesota Vikings Quarterback New Orleans Saints Quarterback Philadelphia Eagles Quarterback Green Bay Packers Running back Minnesota Vikings Quarterback Denver Broncos Defensive end Houston Texans Quarterback Carolina Panthers Quarterback Atlanta Falcons Quarterback Philadelphia Eagles Quarterback Kansas City Chiefs Quarterback Baltimore Ravens Running back Indianapolis Colts Quarterback Philadelphia Eagles ==Related pages== * National Football League Most Valuable Player Award * List of National Football League awards ==References== ;General * * ;Footnotes Category:National Football League trophies and awards",
 "title": "Bert Bell Award"
}