{
 "id": "987482",
 "text": "Karl Heinrich Ulrichs (28 August 1825 – 14 July 1895) was a German lawyer, jurist, journalist, and writer. He is said to be a pioneer of sexologyHans- Martin Lohmann: Geschichte der Sexualität – Vom Widerspruch her gedacht (Buchbesprechung: Volkmar Sigusch, Geschichte der Sexualwissenschaft, Campus, 2008), Frankfurter Rundschau Online. and the modern gay rights movement. == Life == Ulrichs was born in the East Frisian village of Westerfeld (today in Aurich). It was in the Kingdom of Hanover at the time. His father was a Lutheran pastor. Ulrichs said that he felt different from other boys when he was young. He said he liked the bright colors of military uniforms and women's clothing. He graduated in law and theology from Göttingen University in 1846. He studied history at Berlin University from 1846 to 1848. Ulrichs worked as a lawyer for the civil service in the Kingdom of Hannover from 1849 to 1854. He went to the court in 1853. He was an assistant judge in the court of Hildesheim. He resigned on 30 November 1854 after a blackmail attempt meant his sexuality was known by many people. In 1862, Ulrichs told his family and friends that he was gay. He started writing under the pseudonym of \"Numa Numantius\". His first five essays, named Forschungen über das Rätsel der mannmännlichen Liebe (Studies on the Riddle of Male-Male Love), said that gay love was natural and biological. He used the Latin phrase anima muliebris virili corpore inclusa (a female psyche trapped in a male body). Ulrichs made many words for different sexual orientations in his essays. These words include Urning for a man who is attracted to men (English \"Uranian\"), and Dioning for a man who is attracted women. Ulrichs also made words for the female versions (Urningin and Dioningin), and for bisexuals and intersex people. In the 1860s, Ulrichs moved around Germany. He was always writing and publishing. He was always in trouble with the law for his words. In 1864, his books were taken and banned by police in Saxony. Later the same thing happened in Berlin. His books were banned in Prussia. Some of these papers were found in the Prussian state archives. They were published in 2004. Many of Ulrichs' most important books have been published. Ulrichs was a patriotic Hanoverian. When Prussia annexed Hanover in 1866, he was put in jail for going against Prussian rule. The next year he left Hanover and moved to Munich. There he talked to the Association of German Jurists about the need to reform German laws against homosexuality. Later he lived in Würzburg and Stuttgart. In 1868, the Austrian writer Karl-Maria Kertbeny created the word \"homosexual\" in a letter to Ulrichs. From the 1870s sexual orientation began to be widely talked about. Douglas Pretsell (2020)The Correspondence of Karl Heinrich Ulrichs, 1846-1894.https://link.springer.com/book/10.1007/978-3-030-39763-0 In 1879, Ulrichs published the twelfth and final book of his Research on the Riddle of Man-Manly Love. He was in poor health and left Germany for Italy. For many years he traveled around the country before living in L'Aquila. There his health got better. He kept writing and publishing his papers. In 1895, he got an honorary diploma from the University of Naples. Shortly after this he died in L'Aquila. == References == == Works == * Forschungen über das Rätsel der mannmännlichen Liebe (Max Spohr, 1898; repr. Rosa Winkel, 1994) * The Riddle of Man-Manly Love. Trans. Michael Lombardi-Nash. 1864-1879; Prometheus Books, 1994. * == Further reading == * * * * * H. Kennedy, Ulrichs The Life and Works of Karl Heinrich Ulrichs, Pioneer of the Modern Gay Movement (1988) * M. Hirschler, \"De Carolo Henrico Ulrichs qui magis fecit quam ut revivisceret lingua Latina\", Melissa. Folia perenni Latinitati dicata, vol. 192, 2016, pp. 8–9. * * * * * == Other websites == * * * Karl Heinrich Ulrichs at findagrave.com Category:1825 births Category:1895 deaths Category:Sexologists Category:German journalists Category:Writers from Lower Saxony Category:German LGBT rights activists Category:German lawyers Category:Gay men",
 "title": "Karl Heinrich Ulrichs"
}