{
 "id": "987760",
 "text": "\"I'm Not the One\" is a song by the American rock band The Cars, from their fourth album, Shake It Up. It features Ric Ocasek on lead vocals, Benjamin Orr singing the phrase \"you know why\", with the entire group repeating \"going round and round\" as backing vocals throughout the song. ==Overview== \"I'm Not the One\" first appeared in 1981 on Shake It Up. It was not charting at the time, but was included on the band's 1985 Greatest Hits album. The song was remixed on the Greatest Hits album, emphasizing the drum track with additional reverb. It was then released as a single in 1986, following \"Tonight She Comes\", also from the Greatest Hits album. \"I'm Not the One\" debuted on the Billboard Top 40 chart on March 8, 1986 and peaked at number 32. AllMusic reviewer Donald A. Guarisco described \"I'm Not the One\" as one of Shake It Up \"strongest and most memorable tunes\", commenting that its sound still sounded fresh on its 1986 re-release, five years after its first appearance on Shake It Up. In 2005, the album Substitution Mass Confusion: A Tribute to The Cars was released on Not Lame Recordings, which featured a cover of Gigolo Aunts single \"I'm Not The One. ==Composition== The song's intro and choruses are in the key of B minor. The intro features two layered synthesizer parts, one derived from Ric Ocasek's vocal melody and the other a supporting countermelody in a softer key. The intro/chorus begins with a chord progression of B minor, F♯ minor, E minor, and A major, but is immediately followed by in inversion, F♯ minor to B minor, retaining the E minor to A major movement. After another \"reversed\" repeat, the E minor to A functions as a ii-V-I turnaround in the key's relative major of D. The D verses are not unlike The Beatles' song \"Dear Prudence\". The official sheet music folio lists the chord progression as D, to D/C, to D/B (enharmonic to a B minor seventh chord), to D/B♭ (enharmonic to a B♭ augmented major seventh chord),Ocasek, Ric. The Cars: Shake It Up (1981, 1982) Warner Bros. Publications Inc., 75 Rockefeller Plaza, New York, NY, 10019 and video exists of Ocasek performing the song, solo on acoustic guitar, according to this progression. However, other transcriptionists describe the chord progression as D to D/C, to G/B, to Gm/B♭,The Cars: Complete Greatest Hits (Guitar Recorded Versions), Universal Music Publishing Group, Distributed by Hal Leonard which is identical to the verses of \"Dear Prudence\". Either way, the last chord of the verse is a G minor sixth chord, transitioning to the chorus in B minor. Each verse is introduced with a guitar melody by Elliot Easton, who layers several clean- tone guitar parts over the synthesizer-dominated arrangement. There is also a horn-like synth solo by Greg Hawkes, played over the chorus progression. ==References== ==Other websites== * Category:The Cars songs Category:1986 songs Category:Rock ballads",
 "title": "I'm Not the One"
}