{
 "id": "987755",
 "text": "\"Hello Again\" is a song performed by the rock band The Cars. It was released on the 1984 album Heartbeat City. It was the album's fourth Top 20 hit, reaching number 20 on the Billboard Hot 100 chart; it also reached number 8 on the Dance Music/Club Play Singles chart and number 22 on the Mainstream Rock chart. ==Music video== The song's music video was directed by Andy Warhol, who also appeared in the video as did a then-unknown Gina Gershon. Keyboardist Greg Hawkes said \"I think [Warhol] mainly did some of the conceptualizing and showed up to be an extra. And he invited his various friends to be in it. It was like any video shoot, but with a more interesting cast of characters. And you could always look over on the set and go 'Hey that's Andy Warhol.'\" The music video explored the controversial issues of sex and violence (mostly the former) being featured in music and at the time. ==Reception== \"Hello Again\" was described as \"eccentric\" by AllMusic critic Greg Prato, who also cited the track as a highlight from the Heartbeat City album. Donald Guarisco, also of AllMusic, said, \"One of their strongest tracks [on Heartbeat City with experimental roots] was 'Hello Again,' a stylish new wave rocker with plenty of experimental touches.\" Guarisco also said it \"is a song that represents the Cars striking a unique balance between their gift for pop hooks and their love of experimental sounds.\" In his review of the Greatest Hits compilation album, Greg Prato felt that \"Hello Again\" should have appeared, stating \"why was the title track from Heartbeat City (an unsuccessful single) included instead of the 1984 Top 20 hit 'Hello Again'?\" ==Track listing== ===7\" single=== #\"Hello Again\" – 3:45 #\"Hello Again\" (Dub Version) – 6:02 ===12\" single=== #\"Hello Again\" (LP Version/Vocal) – 3:47 #\"Hello Again\" (Remix Version/Vocal) – 5:54 \"Hello Again\" (Dub Version) – 6:02 ==References== Category:1984 songs Category:The Cars songs",
 "title": "Hello Again (The Cars song)"
}