{
 "id": "987982",
 "text": "Antoine Carraby (born December 11, 1961), known professionally as DJ Yella, is an American DJ, record producer, and film director. He is from Compton, California. Yella was a member of the World Class Wreckin' Cru along with Dr. Dre. He later became a member of the gangsta rap group N.W.A (with Dre, Ice Cube, MC Ren, and Eazy-E). Along with Dre, he produced Eazy-E's first album, Eazy-Duz-It, and all three of N.W.A's albums. ==History== After N.W.A's disbandment in 1991, Yella and MC Ren were the only members to remain on Ruthless Records. Over the next four years, he produced albums and songs for numerous Ruthless Records acts, including Eazy, J. J. Fad, Menajahtwa, H.W.A., B.G. Knocc Out, Dresta and Bone Thugs-n-Harmony. He also filmed pornographic movies under his alias Tha Kidd during this time period. Eazy-E's sudden death from AIDS in 1995 caused chaos at the label. Yella stayed on to put together Eazy's final album, but he had difficulty tracking down all the material Eazy had recorded with various producers. Finally with Ren, he co-produced Eazy's last single \"Just Tah Let Ya Know\", released in September 1995. In 1996, Yella released the album One Mo Nigga ta Go on Street Life. The album featured various members of the old Ruthless family rapping over his productions. After this release he disappeared from the music scene, to resurface years later as a director of pornographic movies. While for the most part he did not seem interested in getting back into music, he did reunite with former N.W.A member MC Ren for a song called \"Bangin\" on the soundtrack to one of his sex movies. On October 17, 2006, at VH1's Hip Hop Honors, Yella performed with Lil' Eazy-E and Young Jeezy in a tribute to Eazy-E. ==Other websites== * Official website * * Yella speaks out on the rise and fall of hardcore * Davey D interviews Yella * DubCNN.com interview with Yella Category:1961 births Category:Living people Category:20th-century American musicians Category:21st-century American musicians Category:20th-century American rappers Category:21st-century American rappers Category:American DJs Category:American record producers Category:Musicians from Compton, California",
 "title": "DJ Yella"
}