{
 "id": "988034",
 "text": "Armond White (born ) is an American music and movie critic. He writes for National Review and Out magazine. He was the editor of CityArts from 2011 until 2014 the lead movie critic for the New York Pressfrom 1997 until 2011. He had been the arts editor and critic for The City Sun from 1984 until 1996. Other publications he has written for include Film Comment, Variety, The Nation, The New York Times, Slate, Columbia Journalism Review and First Things. White is known for his provocative and idiosyncratic reviews. He is a controversial person in movie criticism. As an African-American, gay, and conservative movie critic, he has been referred to as a \"minority three times over in his profession.\" ==Early Life== White was born in Detroit, Michigan in the early 1950s to an African-American Baptist family. He converted to pentecostalism. White became interested in movies in high school. He earned a degree in movie criticism in 1997. ==Movie Criticism== White writes a “Better Than List” each year. On the list, he says which unpopular movies from that year are better than the popular movies. White was extremely critical of Toy Story 3 and Toy Story 4 and said the Transformers movies were better. He also said that The Dark Knight Trilogy was bad but that most of the movies in the DC Extended Universe were good. White has also criticized the Marvel Cinematic Universe. White is often critical of Pixar movies, but he said that Inside Out was a good movie. White has also defended many of Adam Sandler’s movies. White has also been extremely critical of movies he accused of afrocentrism. He used to praise many of Steven Spielberg movies but has become more critical of Spielberg’s work. ==Works== White wrote a book called Make Spielberg Great Again == Personal life == White is gay and a Christian. According to the New York Times, White \"lives by himself in Chelsea with no pets or plants, amid piles of DVDs. Standing 6-foot-3, he cuts an imposing figure. Yet in conversation, he comes across as exacting, quiet and polite, far different from what his writing—and seeming bad behavior—might suggest.\" ==References== Category:1950s births Category:Living people Category:Writers from Detroit Category:American movie critics Category:American journalists Category:Gay men",
 "title": "Armond White"
}