{
 "id": "988062",
 "text": "E. Kidd Bogart (born January 23, 1978 in Los Angeles, California) is a multi- faceted American music executive and songwriter who has contributed to a long list of internationally successful artists. He is the son of Casablanca Records founder Neil Bogart and music manager Joyce Bogart-Trabulus, who managed KISS and Donna Summer. ==Music career== From a very young age he wanted to carry on the family tradition and began working at Interscope Records as an intern when he was 16 years old. Former Interscope Records president Tom Whalley took a chance on him when Bogart turned 18 and promoted him into the A&R; department. Under Whalley's supervision, Bogart helped coordinate of various projects, most notably for 2Pac as a project coordinator and hip-hop icon Eminem as an A&R.; It was also widely reported that Bogart was responsible for finding and bringing Eminem into Interscope Records. By the age of 21, Bogart had transitioned into management while working as an A&R; consultant for Warner Bros. Records. In his managerial career, he formed the now-defunct BAT Management with partners Walter \"Walt Liquor\" Taylor and Jordan Feldstein. Under BAT Management and along with other managers Joseph \"3H\" Weinberger, Justin Trugman and Todd Bird, he was responsible for and/or assisted in the careers of Grammy Award winning Maroon 5 (then known as Kara's Flowers), Planet Asia, Mystic, Styles of Beyond and various other artists. Bogart played an integral role in Maroon 5 signing with Octone Records with Feldstein, who still manages the band. In 2002, Bogart founded Casbah Artists Management with his then-wife Cheryl Costanzo (now divorced), in tribute to his late father. Under Casbah, Bogart managed former Dreamworks recording artist Vishiss. During the making of the record, Bogart met future collaborator J. R. Rotem, a producer on the record. In the summer of 2004, Bogart began working for the Agency for the Performing Arts as an Agent in the Concerts Department. In 2006, Bogart's APA roster included OneRepublic, The Outline, DJ Graham Funke, DJ Stonerokk and Planet Asia, among others. While working at the agency, Bogart, inspired by Costanzo to do so, developed an all-female R&B; trio called Raw Candy. Bogart then teamed up with Rotem and music executive Zach Katz and the three created a look and sound for the girls. Bogart was largely responsible for the artistic vision and writing the songs, Rotem for producing and composing the songs, and Katz as the business executive. After failing to garner significant interest for the group, Bogart, Rotem and Katz released the girls from their contract and made deals for Bogart/Rotem-penned compositions for other major record-label projects, most notably the number-one hit \"SOS\", performed by Rihanna. In 2006, as Bogart's song writing began to be more in demand, he left the Agency to pursue writing full-time. He has written for artists and groups such as Sean Kingston, Britney Spears, Beyoncé, Rihanna, Jennifer Lopez, Natasha Bedingfield, Blake Lewis, Paula DeAnda, Ashley Tisdale, Mýa, Paris Hilton, Jesse McCartney, Hayden Panettiere, NLT, Brandy, Wynter Gordon, Paula Deanda, Nick Lachey, Donna Summer, Jessi Malay, Jordyn Taylor, Nikki Flores, Lalaine, Kesha, The Veronicas, Corbin Bleu, Lucy Walsh, The Cheetah Girls, Keke Palmer, Hilary Duff, Varsity Fanclub, Frankie J, Heidi Montag, Steph Jones, Sophia Fresh and Christina Milian, among others. He currently resides in Los Angeles, where he creates most of his music at Rotem's Chalice Studio C and The Writing Camp's Campground Studios. In 2006, Rotem founded his own record and publishing label, Beluga Heights, along with manager Zach Katz and hired Bogart as head writer. Bogart co-wrote four songs on the debut album from Beluga Heights first artist Sean Kingston, including the Top 10 smash \"Take You There\". In 2008 it was reported that 2 of the tracks on Donna Summer's release Crayons had been co-written by Bogart. Bogart recently joined forces with songwriters David \"DQ\" Quiñones and Erika Nuri to form The Writing Camp, a writing team based in Hollywood, California. The Writing Camp, along with Victoria Horn and Rodney Jerkins, wrote Brandy's debut single \"Right Here (Departed)\" from her 2008 album Human. Chosen as the album's leading single and Brandy's first release with Epic Records, following her split from Atlantic Records in 2005, the song was released via Brandy's official website on August 13, 2008.\"Listen to Brandy's New Single\" . Foreverbrandy.com. Retrieved on 2008-08-12. ==References== Category:1978 births Category:Living people Category:American songwriters Category:Businesspeople from Los Angeles",
 "title": "E. Kidd Bogart"
}