{
 "id": "988037",
 "text": "Vanguard Records is a record label founded in 1950 by brothers Maynard and Seymour Solomon in New York. It started as a classical music label, but is perhaps best known for its catalogue of recordings by several seminal folk and blues artists from the 1960s; Bach Guild was a subsidiary label. ==History== In 1953, under the direction of John Hammond, the company began the \"Jazz Showcase\" series concentrating on the idiom of mainstream jazz, producing around two dozen recordings before it closed about 1958.Vanguard Records Listing (Jazz & Blues releases) The recordings made at the Spirituals to Swing concerts in 1938 and 1939 were finally released by Vanguard in 1959. Thereafter the company only continued to record Jazz and Blues on and off. Vanguard branched out in the mid-1950s by defying the blacklist and signing blacklisted artist Paul Robeson and The Weavers. The company continued to issue folk music with newly signed artists including Joan Baez, Hedy West, Buffy Sainte-Marie, Country Joe and the Fish, Ian and Sylvia, Mimi and Richard Fariña. In the summer of 1965, Maynard Solomon hired Samuel Charters to edit the 1964 Newport Folk Festival tapes. Following that project, the company sent Charters to Chicago to tape the wide range of blues musicians there. Those sessions resulted in the classic 1966 three-album series titled Chicago/The Blues/Today!, which introduced a new generation to the blues. The albums included sets by Junior Wells with Buddy Guy, Muddy Water's bandmates Otis Spann and James Cotton, Otis Rush, Homesick James, Johnny Shines, Big Walter Horton, and Charlie Musselwhite. Vanguard released a series of important classical recordings, both domestically produced and imported. Many of the latter came from the British label Pye Records label, with performances by the Halle Orchestra conducted by Sir John Barbirolli. The recordings were so exceptional in their stereo sound and overall quality that many classical radio stations played them. Vanguard even released some classical quadraphonic recordings in the early 1970s, including a performance of Tchaikovsky's Fourth Symphony with the American Symphony Orchestra conducted by Leopold Stokowski. The label also released many performances by the Utah Symphony Orchestra conducted by Maurice Abravanel, as well as the earlier P.D.Q. Bach recordings, from 1965 to 1983. Vanguard was the first US label to issue the complete 1944 hi-fi recordings of composer Richard Strauss conducting the Vienna Philharmonic Orchestra in most of his symphonic poems; the recordings were made on the Magnetophon tape recording equipment in the Vienna Opera House. In the early 1970s, Indian classical musician and sarod virtouso Vasant Rai was signed exclusively by Vanguard. Vanguard put out 5 hit albums of Vasant Rai. That time, Vanguard released albums by Michigan-based rock groups such as Dick Wagner and The Frost and was inspired by a novelty hit they released, Benny Bell's \"Shaving Cream\" to release albums of humorous music inspired by Dr. Demento. Tom Paxton recorded two albums, New Songs from the Briarpatch and Heroes, on Vanguard Records in the late 1970s. The label lay dormant for most of the mid-to-late 1970s, briefly resurfacing with a few disco releases in the 1980s, and was finally sold to the Welk Music Group in 1985. The Welk Group sold the classical music catalogue back to Seymour Solomon. Welk Music Group revitalized the label, reissuing much of its extensive catalogue of folk and popular music (much of which had been out of print for several years) on CD, as well as signing several new artists (such as Mindy Smith), along with established artists (such as Edwin McCain, Hootie & the Blowfish, Blues Traveler, Shawn Mullins, Chely Wright and more). ===Vanguard Classics=== Vanguard Classics was sold after Seymour Solomon's death to Artemis Records, which reactivated the company with new releases from Leon Fleisher and Gil Shaham. When Artemis closed in 2004, the Vanguard Classics catalogue was sold to Sheridan Square Entertainment, which licenses Vanguard Classics material with no apparent plans to relaunch or reactivate the label. ==References== Category:American record labels Category:1950 establishments in the United States",
 "title": "Vanguard Records"
}