{
 "id": "988116",
 "text": "Dangal is a Hindi language general entertainment channel. It is a 24 Hours free to air channel. == History == Dangal was the most watched Hindi language channel in U+R category from week 13 of 2019 to week 26 of 2020. It is owned by Enterr10 Television Pvt. Ltd. == Programmes == ===Current broadcasts=== Premiere date Show 23 August 2021 Nath – Krishna Aur Gauri Ki Kahani 18 October 2021 Mann Sundar 24 July 2023 Mann Atisundar 11 September 2023 Tose Naina Milaai Ke 19 February 2024 Mil Ke Bhi Hum Na Mile 18 March 2024 Deewani 15 April 2024 Janani – AI Ki Kahani 20 May 2024 Anokha Bandhan ===Previous broadcasts=== Acquired series Year Name 2017–2018 Angrezi Mein Kehte Hain 2019 Alif Laila 2018–2020 Bandini 2018 Beend Banoongaa Ghodi Chadhunga 2019-2020 Baba Aiso Varr Dhoondo 2015–2017 Chandragupta Maurya 2023 C.I.D 2019 Dharam Veer 2020 Do Hanson Ka Jodaa 2016–2017 Dwarkadheesh Bhagwaan Shree Krishn 2015 Ek Veer Stree Ki Kahaani... Jhansi Ki Rani 2019 Gunahon Ka Devta 2015 Haunted Nights 2020 Jasuben Jayantilaal Joshi Ki Joint Family Jyoti 2015–2017 Jai Jai Jai Bajrang Bali 2015 Jai Shri Krishna 2019 Kitani Mohabbat Hai 2020 Kitani Mohabbat Hai Season 2 2018 Kashi – Ab Na Rahe Tera Kagaz Kora 2021 Main Teri Parchhain Hoon 2015–2017 Meera 2016–2020 Mahima Shani Dev Ki 2021 Neer Bhare Tere Naina Devi 2015 Na Aana Is Des Laado Om Namah Shivay 2019 Rehna Hai Teri Palkon Ki Chhaon Mein 2018 Raajkumar Aaryyan 2020 Rakt Sambandh 2015–2021 Ramayan 2021 Raju Haazir Ho 2017 Sawaare Sabke Sapne... Preeto 2018 Sai Baba – Tere Hazaron Hath 2017–2019 Shaktimaan 2019 Sikandar VS Porus 2015 Veer Shivaji 2017 Woh Rehne Waali Mehlon Ki Zor Ka Jhatka: Total Wipeout ===Original programming=== ====Anthology series==== Year Show 2019 Achanak Uss Roz Darr Ki Dastak Yeh Ishq Nahin Aasaan ====Children/teen series==== Year Show 2021 Nikki Aur Jadui Bubble ====Comedy series==== Year Show 2022 Favvara Chowk ====Drama series==== Year Show 2020–2021 Aye Mere Humsafar 2020 Alif Laila 2023-2024 Aaina - Roop Nahin, Haqeeqat Bhi Dikhaye 2023 Baazi Ishq Ki 2022-2023 Bindiya Sarkar 2019–2020 CIF 2022 Control Room 2017-2023 Crime Alert 2023–2024 Dalchini 2020 Ek Anokhi Rakshak – Naagkanya 2023-2024 Har Bahu Ki Yahi Kahani Sasumaa Ne Meri Kadar Na Jaani 2022-2023 Ishq Ki Dastaan – Naagmani 2022-2023 Janam Janam Ka Saath 2023 Jyoti... Umeedon Se Sajee 2018 Kahani Ek Raat Ki 2023-2024 Kaisa Hai Yeh Rishta Anjaana 2023 Mast Mauli 2022-2023 Palkon Ki Chhaon Mein 2 2023 Piya Abhimani 2020–2021 Prem Bandhan 2019–2020 Pyaar Ki Luka Chuppi 2019–2020 Phir Laut Aayi Naagin 2023-2024 Purnimaa 2021–2022 Rakshabandhan... Rasal Apne Bhai Ki Dhal 2021 Ranju Ki Betiyaan 2022 Rang Jaun Tere Rang Mein 2022 Shubh Shagun 2021-2023 Sindoor Ki Keemat 2023 Sindoor Ki Keemat 2 2018 Shivarjun Ek Ichchadhari Ki Dastaan ====Mythological series==== Year Show 2022 Brij Ke Gopal 2020–2021 Dwarkadheesh Bhagwaan Shree Krishn - Sarvkala Sampann 2020–2021 Devi Adi Parashakti 2022 Jai Hanuman - Sankat Mochan Naam Tiharo 2020 Katha - Vishwas Ke Ithihaas Ki ====Reality/Non-Scripted programming==== Year Show 2018 Ab Khulega Rahasya Zayake Ka 2017 Bahurani 2023-2024 Kitchen Ki Jung Dangal Family Ke Sang == References == == Other websites == * Official website Category:Television channels in India Category:Maharashtra Category:Hindi",
 "title": "Dangal (TV channel)"
}