{
 "id": "988186",
 "text": "On 8 January 2023, after the victory of Luiz Inácio Lula da Silva in the 2022 Brazilian general election, supporters of the former president, Jair Bolsonaro, attacked the Supreme Court of Brazil, the National Congress of Brazil and the Planalto Presidential Palace in the Praça dos Três Poderes plaza in Brasília, the federal capital. The protesters had entered the Chamber of Deputies's Green Hall and tried invade the Planalto Palace. Lula was not in Brasília at the time of the attack. The event was compared to when supporters of President Donald Trump stormed and attacked the United States Capitol in Washington, D.C. ==Attack== The attack happened a week after Lula's inauguration and after many weeks of unrest from Bolsonaro's supporters. The Supreme Court, Congress, and Presidential Palace were reported as cleared later that evening. That same day, Lula announced that he had signed a decree allowing a federal state of emergency in the Federal District through the end of January. Brazilian security forces cleared all three buildings later that night. At the time of the attack, Bolsonaro was in the United States. During the attack, many works of art, like paintings, vases and historical objects were damaged, stolen or destroyed during the attack. In the Planalto, former president Juscelino Kubitschek's desk was destroyed. A copy of the original 1988 constitution book was initially taken by a protester, but was later found near the building of the Supreme Federal Court. The offices of the Workers' Party and of the Brazilian Social Democracy Party in the Congress building were also invaded and vandalized by the mob. Rioters urinated and defecated in the press areas of the Congress building. ==Response== ===Lula=== President Luiz Inácio Lula da Silva called the attackers \"fascists\" in a tweet. He said that \"there was, I would say, incompetence, bad will, bad faith, on the part of the people who take care of public security in the Federal District\". Lula returned to Brasília after the buildings were cleared and visited the Supreme Court and the presidential palace. ===Arrests=== After the attack, Justice Alexandre de Moraes of the Supreme Court ordered the removal of all anti- democratic posts by Bolsonaro supporters from Facebook, Twitter and TikTok. After the attack, 1,500 people were arrested, however almost 600 of them were released the next day. On 10 January, arrest warrants were sent for former public security secretary of Brasília Anderson Torres, and the Federal District Military Police chief, Fabio Augusto Vieira. The Justice Ministry said that the police had found a draft presidential document giving Bolsonaro power to overturn the 2022 elections by using \"state of defense\" as a reason. On 13 January, Bolsonaro was included as part of the investigation into the riots. Torres was arrested on the next day after returning to Brasília. The Superior Electoral Court blocked Bolsonaro from seeking office until 2030 for his claims of voter fraud and his role in the 2023 congressional attack. ==References== Category:2023 crimes Category:2020s in Brazil Category:Attacks on buildings and structures in the 2020s Category:Brasília Category:Crime in South America Category:January 2023 events Category:Luiz Inácio Lula da Silva Category:2023 in South America",
 "title": "8 January Brasília attacks"
}