{
 "id": "988251",
 "text": "Karl Koller (9 February 1929 – 24 January 2009) was an Austrian football player. He is considered one of the best Austrian midfielders. He played during his professional carrer only for First Vienna FC. The national player completed 86 games for the team with 5 goals and took part in two World Cups. He is regarded, behind Ernst Ocwirk and Gerhard Hanappi, as one of the best Austrian midfielders of all time and was rated as one of the best 100 European footballers of the 20th century by the IFFHS. Normally a center midfielder, Koller was capable in both in defense and attack and was well known for technique, strength and powerful shot from distance. ==Career== Karl Koller began his football career with ASK Blumau. 1949 he went to First Vienna FC where he made his championship debut in 1949. Througout his professional career he played for this club. He played 414 league matches for Vienna and scored 39 goals. Overall he played 836 matches and scored 101 goals. In 1955 he became Austrian Champion and 1961 they played in the Cup final which they lost 3-1 versus SK Rapid . ==International career== He debuted on 23 March 1953 against Belgium (2-0). ÖFB:Profile Karl KollerHe went to the World Cup as one of the regulars for the midfield. Together with the Austrian Ernst Ocwirk he formed the Austrian midfield. Karl Koller played in all matches. In the 1958 FIFA World Cup the team failed in the group stage. In the 2-2 draw versus England shot one of his five goals for the team Karl Koller's career in the team ended when they failed to qualify for the 1966 World Cup. His last international match was on 5 September 1965 versus Hungary.ÖFB:Profile Karl Koller ==Death== Koller died on 24 January 2009 as a result of his Alzheimer's disease.Standard.at:karl Koller verstorben (German) ==References== Category:1929 births Category:2009 deaths Category:Players of the Austrian national football team Category:Austrian footballers Category:1954 FIFA World Cup players Category:1958 FIFA World Cup players Category:Association football midfielders Category:Austrian football midfielders",
 "title": "Karl Koller"
}