{
 "id": "988238",
 "text": "The United Nations Convention to Combat Desertification in Those Countries Experiencing Serious Drought and/or Desertification, Particularly in Africa (UNCCD) is a plan to stop desertification and reduce the effects of lack of water in the action programs of countries. The plan uses long-term strategies supported by international cooperation and partnership arrangements. It fully launched in December 1996. It is the only international body in the world with legal power trying to stop people from destroying forests. To help make UNCCD and its strategies popular, 2006 was declared \"International Year of Deserts and Desertification\".Stringer, LC (2008) Reviewing the international year of deserts and Desertification 2006: What contribution towards combating global desertification and implementing the united nations convention to combat desertification?, j.jaridenv, 72(11), pp2065-2074. doi:10.1016/j.jaridenv.2008.06.010. Ibrahim Thiaw has been the Under Secretary General of the United Nations and UNCCD Executive Secretary since 2019. == State parties == All UN member states, the Cook Islands, Niue, and the State of Palestine. have agreed to be part of the UNCCD. On 28 March 2013, Canada left the UNCCD but joined again on 21 December 2016, and was officially part of the UNCCD again on 21 March 2017. == Conference of the Parties == The Conference of the Parties (COP) ensures that action is taken on the plans of UNCCD. The first five sessions of the COP were held annually from 1997 to 2001. From 2001 sessions were held every two years. === List of COP === COP Date City Remark COP 1 29 September to 10 October 1997 Rome (Italy) COP 2 30 November to 11 December 1998 Dakar (Senegal) COP 3 15 to 26 November 1999 Recife (Brazil) COP 4 11 to 22 December 2000 Bonn (Germany) COP 5 1 to 12 October 2001 Geneva (Switzerland) COP 6 25 August to 5 September 2003 Havana (Cuba) COP 7 17 to 28 October 2005 Nairobi (Kenya) COP 8 3 to 14 September 2007 Madrid (Spain) COP 9 21 September to 2 October 2009 Buenos Aires (Argentine) COP 10 10 to 20 October 2011 Changwon (South Korea) COP 11 16 to 27 September 2013 Windhoek (Namibia) COP 12 12 to 23 October 2015 Ankara (Turkey) COP 13 6 to 16 September 2017 Ordos City (China) COP 14 2 to 13 September 2019 New Delhi (India) Adoption of The New Delhi Declaration: Investing in Land and Unlocking Opportunities COP 15 9 to 20 May 2022 Abidjan (Côte d’Ivoire) COP 16 2 to 13 December 2024 Riyadh (Saudi Arabia) == References == Category:Treaties and Conventions",
 "title": "United Nations Convention to Combat Desertification"
}