{
 "id": "988245",
 "text": "M 3 GAN (pronounced as Megan) is a 2022 science fiction horror movie directed by Gerald Johnstone. It was written by Akela Cooper from a story by Cooper and James Wan (who also produced with Jason Blum). The movie stars Allison Williams and Violet McGraw, while Amie Donald physically portrays M3GAN with Jenna Davis voicing the character. M3GAN had its worldwide premiere at Los Angeles on December 7, 2022 with Universal Pictures releasing it in theatres in the USA on January 6, 2023. A sequel, named M3GAN 2.0, is set to be released on January 17, 2025. == Plot == A young girl named Cady and her parents are involved in a car accident in the snow, leaving Cady an orphan. Cady is sent to live with her aunt Gemma, a roboticist at the high-tech Seattle toy company Funki. Gemma is developing M3GAN (Model 3 Generative Android); a life-sized humanoid robot doll powered by artificial intelligence, designed to assist in caretaking duties and being a loyal companion to the child to whom it is assigned. After a faulty test occurs with M3GAN’s functions in their lab, Gemma’s boss David orders her to drop the project. Gemma and Cady struggle to adapt to their new living situation, as Gemma is a workaholic by nature and does not have time to bond with Cady. When Cady discovers Bruce, a motion capture robot that Gemma created, she expresses a wish for a similarly complex toy, which propels Gemma to complete the M3GAN project. The finished model is formally paired with Cady, and David becomes convinced of the project's potential for success after observing the pair. M3GAN exceeds expectations as a friend and largely takes over for parenthood duties and emotional support, to the point that Gemma's colleagues, and Cady's therapist Lydia, in particular, become concerned about Cady creating an extremely strong emotional attachment to M3GAN. In addition, being designed to self-improve and adapt, M3GAN starts operating more independently and targets anything that she deems a threat to Cady. She kills Gemma's neighbor Celia's dog Loue after it bites Cady. Later, she tears off the ear of Cady's bully Brandon and chases him before he trips and falls in the path of an oncoming car, which fatally runs him over. After Celia aggressively confronts Gemma, Cady, and M3GAN, blaming them for her missing dog, in the evening hours, M3GAN enters the shed in her backyard and after imitating the dog Loue's voice (which leads Celia to the shed) murders her by shooting her hand with a nail gun and spraying her with garden chemicals. Gemma becomes suspicious of M3GAN and attempts to check her video logs to see if she was involved in the deaths. When she finds the files corrupted or erased, Gemma turns M3GAN off and takes her to her colleagues Tess and Cole to fix her. Cady responds violently, lashing out due to her attachment to M3GAN. Gemma tries to apologize for her absence as a parent and tells Cady that M3GAN is a distraction from coping with the difficult loss of her parents, not a solution. While M3GAN wins over Funki's investors and convinces them to release a worldwide campaign in advance of her release, Gemma, Tess and Cole decide to try to terminate M3GAN due to her volatile and violent tendencies. Tess and Cole attempt to shut down M3GAN while Gemma takes Cady home, but M3GAN attacks Cole by hanging him with a chain. While Tess frees Cole, M3GAN causes an explosion in their lab and then shuts off the alarm. On her way out of the building, M3GAN kills David and his assistant Kurt with the blade of a guillotine paper cutter in an elevator, staging it as a murder–suicide. She then steals a car and drives back to Gemma's house. M3GAN confronts Gemma, adamant about taking over as Cady's sole parental figure. Gemma attempts to shut M3GAN down again, but M3GAN overpowers her and threatens to lobotomize her so she will be unable to care for Cady. Watching the fight unfold, a horrified Cady uses Bruce to tear M3GAN apart. However, M3GAN's top half remains active, and she attempts to kill Cady for the betrayal. Gemma exposes a processing chip in M3GAN's head, which Cady stabs with a screwdriver, rendering M3GAN's body lifeless. With M3GAN seemingly destroyed, Gemma and Cady go outside as the police arrive with Tess and Cole. As they leave the house, a camera turns on by itself and looks towards them. == Cast == == Reception == M3GAN has earned over $30 million in the US and $15 million in other countries, the total is $45 million in total all over the world in the box office. M3GAN in certain countries would gross up to $1 million such as Canada. === Dance === During the movie trailers and in the movie, M3GAN is known for making up her own dance routine before killing Gemma's boss and his assistant. The dance has gotten M3GAN a lot of praise on TikTok and other social medias as users try to do the dance that she does. === Sequel === The director Gerald Johnstone officially stated plans for a sequel since the movie has done very well in the box office. Universal also stated that they would be planning to do the sequel as well. == References == == Other websites == *Chat with M3GAN Category:2022 science fiction movies Category:2022 horror movies Category:Robot movies Category:2020s science fiction horror movies Category:American science fiction horror movies Category:Movies about artificial intelligence Category:Movies set in Seattle Category:Movies set in Washington (state) Category:Universal Pictures movies",
 "title": "M3GAN"
}