{
 "id": "988214",
 "text": "Manfred Krikke (23 November 1932 – 4 January 2023) was a Dutch cycling team manager. Krikke was for five years the manager of PDM cycling team. ==Biography== Krikke grew up in Eindhoven. He started as a cyclist at a young age, but was not very talented. After his studies he invested in in snack bars and later became co-owner of a construction company. In 1980, Krikke took over the wholesale and importership of cycling articles from the former professional cyclist Piet Rentmeester. The company was based in Valkenswaard and became an main market player in the Benelux. As a co-sponsor of bicycles and clothing, Krikke became involved in the PDM cycling team in 1986 and became the manager in 1987. The team became internationally verry successful, including winning the UCI Road World Cup in 1989 and 1990. Top cyclists on the team were Pedro Delgado, Sean Kelly, Greg LeMond, Raoul Alcala, Erik Breukink, Steven Rooks, Adrie van der Poel, Gert-Jan Theunisse and Rudi Dhaenens. The team was also negative in the news. On 27 February 1990 Johannes Draaijer died in his sleep of heart block; it is presumed, but not proven, that his death was caused by the use of the performance-enhancing drug erythropoietin (EPO).Teil 3: Todesfälle (nicht nur) im Radsport und Doping – gibt es einen Zusammenhang? cycling4fans.de Gert-Jan Theunisse was caught on doping; while Krikke had accused the jury in the Tour de France that their doping controls were not proper. In 1991 the PDM team had a main intralipid affair during the 1991 Tour de France. Krikke left the team at the end of 1991. In the summer of 1992 he took efforts to start his own professional cycling team. In 1993, Krikke started sponsoring the American Eagle mountain bike team. Main cyclists of the team were Bart Brentjens, Adrie van der Poel and Richard Groenendaal. Krikke died in Veere on 4 January 2023, at the age of 90. ==References== Category:Dutch cyclists Category:1932 births Category:2023 deaths",
 "title": "Manfred Krikke"
}