{
 "id": "988332",
 "text": "Bickley is a residential area and ward in the London Borough of Bromley, England. It is a suburban development situated 10.4 miles (16.7 km) south-east of Charing Cross. Bickley is a very popular residential area, known for its large and expensive houses. It lies between Bromley to the west, Chislehurst to the north-east and Petts Wood to the south-east. It is unusual that for a well-known place with its own railway station, its only shops are a handy local parade at the junction of The Fairway and Southborough Lane. Bickley station earned the dubious honour of being proclaimed the most vandalised station in England; incidents skyrocketed from three in 2001 to 87 in 2006, a rise of 2800%, according to the Daily Mail.Ray Massey: 'Commuters shunning stations in fear of thugs and vandals ==Notable residents== *David Bowie (1947-2016), musician, lived at 106 Canon Road from 1953 to 1954. *Colin Cowdrey, Baron Cowdrey of Tonbridge (1932–2000) Cricket player, lived on Hawthorne Road until about 1965. *Florence Farr (1860–1917), religious writer and playwright, was born in Bickley. * Norman Fulton (1909–1980), composer, lived in Bickley.National Library of Scotland archive *Evelyn Hellicar (1862–1929), architect. *Gertrude Hermes (1901–1983) wood engraver, print maker and sculptor, born in Bickley.James Hamilton (2004). Hermes, Gertrude Anna Bertha (1901–1983). Oxford Dictionary of National Biography. Oxford University Press. Retrieved January 2014. *Ethel Hurlbatt, principal of Bedford College, London, born in Bickley. *Pixie Lott (born 1991), singer- songwriter, spent part of her childhood in Bickley. *Ernest Newton (1856–1921), architect who designed many houses in the area. *Charles Henry Bourne Quennell (1872–1935), architect of the Bickley development and writer, lived at 9 The Avenue. *Marjorie Quennell née Courtnay (1884–1972), artist, writer and museum curator, wife of CHB Quennell. *Peter Quennell (1905–1993), biographer, literary historian, editor, essayist, poet, and critic, son of CHB Quennell. *John Wells (1761–1846), of Bickley Hall, High Sheriff of Kent. MP for Maidstone. Its railway station is Bickley railway station. ==Transport and local== ===Nearest places=== *Bromley *Chislehurst *Elmstead Woods *Petts Wood ==References== Category:Wards of London Category:London Borough of Bromley",
 "title": "Bickley"
}