{
 "id": "988451",
 "text": "Francisco de Asís, Duke of Cádiz (Francisco de Asís María Fernando de Borbón; 13 May 1822 – 17 April 1902) was King consort of Spain. He was the husband of Queen Isabella II of Spain from their marriage on 10 October 1846. Isabella was overthrown on 30 September 1868. He kept the style and title of king even after her abdication in favour of their son, Alfonso XII. His son was a king regnant, while Francisco himself was a king-father during the reign of his son. ==Family== Francis was born at Aranjuez, Spain. He was the second son (first to survive infancy) of Infante Francisco de Paula of Spain, and his wife (and niece), Princess Luisa Carlotta of the Two Sicilies. He was named after Saint Francis of Assisi. ==Marriage and children== Francis married Isabella, his double first cousin, on 10 October 1846. Isabella would rather have married his younger brother, Infante Enrique, Duke of Seville. She complained bitterly about her husband's effeminate habits after their first night together. Twelve children were born during the marriage. Only five reached adulthood: * Infanta María Isabel (1851–1931): married her mother's and father's first cousin Prince Gaetan, Count of Girgenti. * Alfonso XII of Spain (1857–1885). * Infanta María del Pilar (1861–1879). * Infanta María de la Paz (1862–1946): married her paternal first cousin Prince Louis Ferdinand of Bavaria. * Infanta María Eulalia (1864–1958): married her maternal first cousin Don Antonio de Orléans y Borbón, Infante of Spain, Duke of Galliera. ==Later life== Starting in 1864, Francisco de Asís acted as president of the Spanish Privy Council (Consejo del Reino). In 1868 he went into exile with his wife in France. He adopted the incognito title of Count of Moratalla. On 25 June 1870, Isabella abdicated in favour of their son, Alfonso XII—whom the 1874 restoration placed on the throne. By then, Francisco de Asís and Isabella had amicably separated and, with time, became good friends. In 1881 Francisco de Asís moved into the château of Épinay-sur-Seine. Today, this chateau serves as the town hall. He died there in 1902. His wife Isabella and two of his daughters, Isabel and Eulalia, were present at his deathbed.\"Don Francisco d'Assisi\", The Times (18 April 1902): 9. == References == Category:1822 births Category:1902 deaths Category:Spanish royalty",
 "title": "Francisco de Asís, Duke of Cádiz"
}