{
 "id": "988618",
 "text": "Robert Penn Warren (April 24, 1905 – September 15, 1989) was an American poet, novelist, teacher, and critic. He was named to be the first poet laureate of the United States in 1986. Warren was born in Guthrie, Kentucky, a small town on the border of Tennessee. He was a good student and graduated from high school when he was 15. He entered Vanderbilt University in Nashville, Tennessee in 1921. One of his teachers was the poet John Crowe Ransom. Another poet, Allen Tate, became his friend. With these and other poets, Warren started a literary magazine called The Fugitive. This group became known as The Fugitive Poets. They had a big influence on Southern literature and modern American poetry. He got his masters degree (M. A.) in 1927 from the University of California, Berkeley. He was also a Rhodes Scholar at Oxford University. With Cleanth Brooks, he wrote two important books about literature, Understanding Poetry (1938) and Understanding Fiction (1943). These explained a way of thinking about literature that was known as The New Criticism. In 1946 his most famous novel, All the King’s Men, told the story of a politician who becomes corrupt. This book won the Pulitzer Prize for Fiction. It was made into a movie that won the Academy Award for best motion picture in 1949. == Books == * Understanding Poetry (1938) * Night Rider (1939) * Understanding Fiction (1943) * All the King's Men (1946) * Brother to Dragons (1953) * Band of Angels (1955) * Segregation: The Inner Conflict in the South (1956) * The Legacy of the Civil War (1961) * Who Speaks for the Negro? (1965) * Audubon: A Vision (1969) * A Place to Come To (1977) * Now and Then (1978) * Being Here (1980) * Rumor Verified (1981) * Chief Joseph of the Nez Perce (1982) * Altitudes and Extensions (1985) == Related pages == *List of poets from North America == References == ==Other websites== *Robert Penn Warren at The Poetry Foundation *Robert Penn Warren, U.S. Poet Laureate: A Resource Guide *Robert Penn Warren at Poets.org Category:1905 births Category:1989 deaths Category:Writers from Kentucky Category:American novelists Category:American poets",
 "title": "Robert Penn Warren"
}