{
 "id": "988875",
 "text": "Movietone News is a newsreel that ran from 1928 to 1963 in the United States. It was also in France and in Australia and New Zealand until 1970. It was in the United Kingdom from 1929 to 1986 as British Movietone News. In Germany, it was Fox Tönende Wochenschau. ==History== Movietone News started from an earlier newsreel called Fox News. It made silent newsreels. When Fox started making movies with sound in 1928 with Mother Knows Best, the name Fox Movietone was used for Fox's sound movies. Fox Films joined with 20th Century Pictures in 1935 to become 20th Century-Fox. Fox Movietone News was shortened to Movietone News. In Australia, Movietone and Cinesound competed for newsreel coverage. Later, they joined and became the Australian Movie Magazine. ==Status and licensing== The University of South Carolina Moving Image Research Collections has some of the Fox Movietone newsreel collection. Fox News Channel has the rest. Licensing for Fox Movietone newsreels owned by the University of South Carolina is handled by the Moving Image Research Collections. Licensing for Fox Movietone News is still owned by Fox Corporation and handled by Fox News Channel. British Movietone is owned by British Movietonews Ltd. In 2016, the British Movietone archive had been acquired by Associated Press. The Movietone News Australia archive was given to the National Film and Sound Archive in 1988. ==Archive== The Academy Film Archive has the 20th Century Fox Movietone Shorts and Documentaries Series Collection. In 2015, British Movietone and Associated Press's archival footage was put on YouTube. ==References== ==Other Websites== * Fox Movietone News web site * official British Movietone YouTube channel, archival footage * Extensive index and clips from University of South Carolina * Cinesound Movietone web site * George Bernard Shaw Talks to Movietone News (1928) at IMDB * Two Movietone newsreels from archive.org * Extensive index and clips from University of South Carolina * Clips from University of South Carolina * Movietone Records information Category:News media",
 "title": "Movietone News"
}