{
 "id": "988878",
 "text": "Blåhaj (stylized BLÅHAJ, , ; also pronounced , or in English) is a plush toy of a blue shark made and sold by the Swedish company IKEA. It has been used as an official mascot in some countries. ==Properties== There are and versions. It is stuffed with recycled polyester. It can be machine-washed at 40 °C (104 °F). ==Culture== In 2018, Blåhaj became a popular internet meme when social media users posted humorous photos of it in their homes. It became popular with LGBT (particularly transgender) individuals due to its similar colors to the transgender flag. It was thought IKEA acknowledged this by using it in an series of advertisements supporting the 2021 Swiss same-sex marriage referendum. In September 2021, when customers asked about the toy, it was announced to be no longer be sold in the United Kingdom and Ireland from April 2022 due to supply issues, which did not happen. \"Blåhaj\" trended on social media for several days, as fans said it was becoming \"extinct\". A similar response happened when it was used to demonstrate vacuum bags in some stores in Hong Kong. However, it was announced it would still be sold in the United States. In early 2022, Blåhaj plushes started to be made in Indonesia. Blåhaj is popular in some countries. Blåhaj shopping bags are sold in Taiwan and Malaysia. Blåhaj has also been used in advertisements, such as for tiny apartments in Japan (as a real estate agent) and Hong Kong's Tsim Sha Tsui branch, which was nicknamed \"Tsim Shark Tsui\". Colored Blåhaj-shaped red bean and sesame filled buns were sold for a limited time in Malaysia and Taiwan respectively. In November 2022, IKEA Canada gave transgender individuals a transgender flag-colored Blåhaj with their name embroidered on its fin. It was once seen briefly in the Marvel Studios television series Hawkeye. == References == == Other websites == * IKEA Blåhaj Shark entry on Know Your Meme Category:Toys Category:Fictional fish Category:Internet memes Category:Transgender",
 "title": "Blåhaj"
}