{
 "id": "988849",
 "text": "Watch the Throne is a collaborative studio album by American rappers Kanye West and Jay-Z. It was released on August 8, 2011. The album has 7 singles. All 7 of those singles have music videos. They originally planned to make a five-single EP. But soon after that, that project evolved to a seven-single studio album. The album features guest appearances from Frank Ocean, The- Dream, Beyoncé, and Mr Hudson. It also features samples of vocals by soul musicians Otis Redding and Curtis Mayfield. Many critics and publicators named \"Watch the Throne\" to their year-end best-of lists. A few notable examples are The Rolling Stone\" and The Washington Post. The album debuted at number 1 on the Billboard 200. This is because the album sold 436,000 copies in the first week. It also broke the iTunes first week sales record at the same time. Because of this, it was the fourth top selling album on iTunes in 2011. It also reached the top 10 in a few countries. Examples are Canada and the United Kingdom. It was also certified quintuple platinum in the United States by the Recording Industry Association of America (RIAA) in November 2020. Next Kanye West album is Yeezus ==Track listing== # \"No Church in the Wild\" (featuring Frank Ocean and The-Dream) (4:32) # \"Lift Off\" (featuring Beyoncé) (4:26) # \"Niggas in Paris\" (3:39) # \"Otis\" (featuring Otis Redding) (2:58) # \"Gotta Have It\" (2:20) # \"New Day\" (4:32) # \"That's My Bitch\" (3:22) # \"Welcome to the Jungle\" (2:54) # \"Who Gon Stop Me\" (4:16) # \"Murder to Excellence\" (5:00) # \"Made in America\" (featuring Frank Ocean) (4:52) # \"Why I Love You\" (featuring Mr Hudson) (3:21) Total length:46:12 ===Deluxe edition (bonus tracks)=== 13\\. \"Illest Motherfucker Alive\" (8:23) 14\\. \"H.A.M. (4:35) 15\\. \"Primetime\" (3:19) 16\\. \"The Joy\" (featuring Curtis Mayfield) (5:17) Total length:64:37 ==References== Category:2011 albums Category:Jay-Z Category:Kanye West albums Category:Def Jam Recordings albums Category:Roc-A-Fella Records albums",
 "title": "Watch the Throne"
}