{
 "id": "989051",
 "text": "The supreme leader of the Democratic People's Republic of Korea known as the supreme leader of North Korea is the head of state and head of government of North Korea. The leader directs the executive branch of the federal government. He is the commander-in-chief of the North Korean Armed Forces. Kim Jong-un is the 3rd and current supreme leader of North Korea, in office since December 17, 2011. == Executive and Legislative Powers == The president of the state affairs commission is the head of state of North Korea. The North Korean constitution gives the president the power to lead the state and appoint important state officials. The president has the power to appoint diplomatic representatives to serve in other countries. The president can declare a state of emergency, a state of war or a mobilization order. He directs the country's national defense. The president also has absolute power and control over North Korea's nuclear weapons. The president has the power to choose the vice president, and members of the State Affairs Commission, who are elected by members of the assembly. The president can also propose for their recall by the assembly. He has the right to appoint or dismiss important state officials. The president can submit an agenda that will be discussed by the Supreme People's Assembly. The commission can also submit an agenda to the assembly. The president has the right to grant pardons. The supreme leader is the commander-in-chief of the North Korean Armed Forces. The leader may exercise supreme operational command and control over the country's military forces, and has plenary power to launch, direct and supervise military operations, order or authorize the deployment of troops, or launch nuclear weapons. == Official residences == Ryongsong Residence is the current and official residence of the supreme leader of North Korea. The supreme leader also has other official state residences. They are kept hidden away with absolutely no access to them. == Protection == The Ministry of State Security is charged with protecting the supreme leader and the first family of North Korea. As part of their protection, their duties are also to investigate any type of threats towards the Kim family or any government official. It's also tasked to conduct VIP protection duties for North Korean diplomats and employees who work in many North Korean embassies, accompany and other foreign officials abroad. == Line of succession == The North Korean leadership line of succession is the order in which one of the members of the Kim family are to assume the powers and duties as the supreme leader of North Korea upon their death. Category:Presidents of North Korea Category:North Korea-related lists",
 "title": "Supreme Leader (North Korea)"
}