{
 "id": "989076",
 "text": "Divya Nawale (born 1980s) is an Indian climate activist and ocean scientist. She has been to Antarctica in 2009 and 2018 with the 2041 ClimateForce team. She travels around the world to give talks about the importance of stopping carbon dioxide emissions melting Antarctic ice. She is a part of the Arctic Angels, a group that works to protect Polar ice. She has helped set up education bases in Pench and Ladakh to combat climate change. She graduated from BITS-Pilani university in India and is a part of the advisory board of Women in Ocean Science. == Early life == Nawale was born in the 1980s in Hyderabad, India. She loves nature, because she went to the Himalayas many times with her parents. At 16 or 17, she became a vegan. Nawale loved watching “underwater shows” when she was a kid, which led to her learning about the dangers of climate change on oceans. She grew up middle-class and went to BITS-Pilani university. == Career == Nawale works for the protection of Polar ice. She and her mentor Robert Swan have been to Antarctica twice, in 2009 and 2018. Nawale works with the 2041 Foundation. She learned in Antarctica that 86% of the freshwater in the world is in ice, and Antarctica has 91% of the ice in the world. She and the 2041 Foundation want to keep Antarctica a Global Common in 2041, when the Antarctic treaty will be up for negotiation again. Nawale is an Arctic Angel and a Clean Energy Programs Coordinator at Asian Development Bank. She gives presentations about the importance of people and companies reducing their carbon footprint. == Personal life == Divya Nawale lives in Hyderabad, India. She has been a vegan since she was a teenager. She has traveled to all seven continents giving talks about climate change. Her mentor is Robert Swan. == Awards and accomplishments == Nawale won the BITS Alumni Association 30-Under-30 award for Social Entrepreneurship and community building. She helped the 2041 Foundation set up education bases in Pench and Ladakh using solar energy. Nawale is a part of the Arctic Angels. She is also on the advisory board of Women in Ocean Science. == References == Category:Living people Category:1980s births Category:Indian activists Category:Climate activists Category:Indian environmentalists Category:People from Hyderabad, India",
 "title": "Divya Nawale"
}