{
 "id": "989084",
 "text": "Rachel Diane Morford (born March 7, 1985) is an American aerospace engineer and former president of the Society of Women Engineers. She is known for her work on national security satellites. She contributed to the production and launch of the Air Force’s Advanced Extremely High Frequency communications satellites. She was recognized with Aerospace Woman of the Year and Aerospace Commitment to Our People Diversity and Inclusion award. == Early life == Morford was born in Torrance, California to Linda and Larry Morford. In 2007, Morford graduated USC Viterbi where she graduated with Bachelor’s and a Master’s degrees in electrical engineering. As a freshman at USC, she joined the Society of Women Engineers and stayed involved in the organization for all four of her years at USC Viterbi. == Career == Morford is a principal director at The Aerospace Corporation in El Segundo and has worked on a variety of projects including launching satellites and helped the launch of one of the Air Force’s communication satellites. Morford joined The Aerospace Corporation in 2008 as an MTS in the Launch Directorate in the National Systems Group. In 2014 she transferred to the Systems Integration and Test Office in Engineering and Technology Group while often working with international clients. In January 2020, Morford was promoted to principal director at The Aerospace Corporation in El Segundo. == Personal life == Morford continues to be very active in community outreach and educating students at science fairs, classrooms, and college campuses. In her free time, she enjoys traveling, running, swimming, and refurbishing furniture. She is married to Matthew Boatman and they have a daughter. == Awards and honors == Morford has been recognized with the Aerospace Woman of the Year, Aerospace Commitment to Our People Diversity and Inclusion Award, SWE Distinguished New Engineer, and We Local ELiTE Award. == References == Category:Engineers from California Category:1985 births Category:Living people",
 "title": "Rachel Morford"
}