{
 "id": "989079",
 "text": "Melissa Cristina Márquez (born 1993) is a Puerto Rican marine biologist. She is a shark scientist. She studies Chondrichthyan animals. She researches why they choose specific habitats. She is one of Forbes Magazine's 30 Under 30. Hola Magazine also named Márquez a Top 100 Latina Powerhouse in 2021. == Early life == Melissa Cristina Márquez was born in Puerto Rico, but she grew up in Mexico. As a child, Márquez made her very first memories on the beach. She would analyze tidal waters, and gather seashells while watching groups of fish. Márquez grew up watching the Discovery Channel segments about sharks. She was four when she discovered she wanted to study them.Passionate about sharks. (2019, January 27). CE Noticias Financieras: English. Available from NewsBank: Access World News – Historical and Current. Márquez describes her family as very supportive. Her mother had a career as a biology educator and biochemical engineer. == Education == Márquez received her undergraduate degree at the New College of Florida. She got a masters degree from Victoria University of Wellington. Márquez also has a PhD from Curtin University. == Career == Márquez is an environmental activist and science communicator. Márquez is committed to making sure that all STEM workplaces are inclusive and equally diverse. Hola Magazine named Márquez a Top 100 Latina Powerhouse in 2021. She is one of Forbes Magazine's 30 Under 30. Márquez is the founder of the Fins United Initiative. She works with Divya Nawale and other members of the advisory board of Women in Ocean Science. She is a judge for Boston Museum of Science's Reach Out Science Slam.Museum of science, Boston announces winners of the 2021 reach out science slam communication challenge. (2021, May 06). Targeted News Service Retrieved from Proquiest. Márquez often appears on Discovery Channel's Shark Week.Shiffman D. (2018, July 28). Snatching science from jaws of hype - Analysis Shark Week. The Washington Post. Available from NewsBank: Access World News – Historical and Current She published a series of children's books called “Wild Survival!” She stars in the documentary movie OceanXplorers.Gutierrez, T. (2021, 11). Dream kits. Allure, 31 Retrieved from ProQuest. Márquez also writes for Forbes Science. Márquez has hosted her own Spanish language environmental podcast called ConCiencia Azul. She interviews other ocean scientists. She stars in the documentary movie OceanXplorers. Márquez has given a TEDx talk on “Sharks & Female Scientists: More Alike Than You Think”. == References == Category:1993 births Category:Living people Category:Puerto Rican scientists Category:Marine biologists",
 "title": "Melissa Cristina Márquez"
}