{
 "id": "989050",
 "text": "Elizabeth S. Greene (born December 2nd, 1970) is a North American archaeologist. In 2023, she became the president of the Archaeological Institute of America.https://www.archaeological.org/2023-council-election- results/. Retrieved 2023-01-17 She was First Vice President (2020-2023). Before that, she was the institute's Vice President for Cultural Heritage (2017-2020). Her specialty is in underwater archaeology (\"maritime archaeology\"). Her geographical and cultural special area is the Classics. Greene led a team of divers to study harbors in Turkey. She did this work with Middle East Technical University in Ankara, Turkey and Stanford University, California. She and her team also worked with Institute of Nautical Archaeology and the Bodrum Museum of Underwater Archaeology in Bodrum, Turkey. Greene got her PhD from Princeton University. Greene won the Marilyn Robinson Award for Excellence in Teaching for 2014-15 at Western University. She is a full professor of Classics and archaeology at Brock University in Canada. Greene researches seaborne mobility and interaction across the Mediterranean. Her work uses physical remains to show how trade, fishing, communities, and human migration happened over long periods of time. She has said, \"'We look for stories that are told, not just written text but through oral traditions, through art, through painting and the sources that we don't always see.'\" ==Selected publications== *Greene, E.S., J. Leidwanger, and L. Repola. 2022. “Ephemeral Heritage: Migration, Boats and Heritage in the Central Mediterranean Passage.” American Journal of Archaeology 126.1: 79-102. * Daniels, B., T.C. Fryer, G. Golden, E.S. Greene, R. Leventhal, and J. Leidwanger. 2022. “Materiality of Migration.” https://web.sas.upenn.edu/migration/ * Greene, E.S. December 2021. “Anna Marguerite McCann (1933 – 2017), First American Woman in the Field of Underwater Archaeology.” Archaeologists You Should Know, Archaeological Institute of America. *Leidwanger, J., E.S. Greene, L. Repola, and F. Sgroi. 2021. “The Marzamemi Maritime Heritage Project: From the Seabed to the Museum and Beyond.” In Trinacria: ‘An Island Outside Time.' International Archaeology in Sicily, edited by C. Prescott, A. Karavieri, P. Campbell, K. Göransson and S. Tusa, 45-53. Oxford: Oxbow. * Leidwanger, J., E.S. Greene, and A. Donnelly. 2021. “The Sixth-Century CE Shipwreck at Marzamemi, Sicily.” American Journal of Archaeology 125.2: 283-317. * Repola, L., Leidwanger, J., and Greene, E.S. 2020. “Digital Models for the Analysis and Enhancement of Hybrid Spaces: Architecture of the Mattanza.” Int. Arch. Photogramm. Remote Sens. Spatial Inf. Sci., XLIV-M: 443–450. * Wilker, S.T., J. Leidwanger and E.S. Greene. 2019. “Amphoras and the Afterlife of a Commercial Port: Hellenistic Burgaz on the Datça (Knidos) Peninsula.” HEROM: Journal on Hellenistic and Roman Material Culture 8: 57-381. * Greene, E.S. and J. Leidwanger. 2019. “Knidian ‘Anyports': A Model of Coastal Adaptation and Socioeconomic Connectivity from Southwest Turkey.” Mediterranean Historical Review 34.1: 9-25. ==References== Category:American archaeologists Category:Canadian academics Category:Presidents (organizations) Category:1970 births Category:Living people Category:Stanford University faculty",
 "title": "Elizabeth Greene (archaeologist)"
}