{
 "id": "989484",
 "text": "Paikpara is a village located in Block 1 of Basirhat in North Twenty Four Parganas district of West Bengal . It is one of the 60 villages in Basirhat 1 Block of North 24 Parganas District. There are 460 houses in the village. Paikpara Village Gram Panchayat as per PIFA 2009 statistics. Paikpara village is governed by the Sarpanch (Village Head) who is the elected representative of the village as per the Constitution of India and the Panchayati Raj Act. == Geographic Structure == Paikpara is a village near Basirhat . Paikpara village location code or village code is 323524 as per 2011 census. Paikpara village is located south of Basirhat in North Twenty-four Parganas district of West Bengal, India. Sub-district headquarters of this village is Basirhat which is Located 3 km away and the district headquarter is Barasat. The total geographical area of the village is 54.5 hectares. == Population data == The total population of Paikpara is 1,964. Among them, 992 are male and 972 are female. The population of children aged 0-6 in Paikpara village is 231 which is 11 of the total population of the village. 76%. Among them 125 boys and 106 girls. The average sex ratio of Paikpara village is 102. 057. Schedule Caste (SC) among the total population of Paikpara village 5. 86% and Schedule Tribe (ST) 0. 20%. There are 460 families in the village and each family has an average of 4 persons. Male Female Population by Caste 2011 - Paikpara total OBC SC ST child total 1,964 1,845 115 4 231 male 992 932 57 3 125 woman 972 913 58 1 106 == Education == === Literacy rate === Literacy rate in Paikpara village is 64%. Out of a total population of 1,964, 1,276 are literate. The male literacy rate is 67%, as 671 males out of 992 males are literate. However, the female literacy rate is 62%, as 605 out of a total of 972 women in this village are literate. === Illiteracy rate === Illiteracy rate of Paikpara village is 35%. Out of total 1,964 people here, 688 are illiterate. As the male illiteracy rate is 32%, 321 males out of total 992 are illiterate. The illiteracy rate among women is 37% and 367 women out of total 972 in this village are illiterate. == Educational institutions == There are two educational centers in this village which are- === 1. Paikpara Siddiquia Eatimkhana === There is an institution in this Paikpara village known as \"Paikpara Siddiquia Eatimkhana\" for educating orphan students. This institution has made the name of this village brighter. This institution was established in 1984. Around 200 students study together here. Among whom students are often orphans. This Paikpara Orphanage carries everything from their living-eating-education. Paikpara Siddiqia Eatimkhana | (ইংরেজি ভাষায়)। সংগ্রহের তারিখ ২০২০-০৩-০৩। === 2. Paikpara F. P School === This Paikpara FP School is known as \"Paikpara Primary School\". It is a government school. Classes I to IV are taught here. The total number of students here is around 211. And it was established in 1954. PAIKPARA F P SCHOOL is a Primary school with newly added class v in the year 2020. PAIKPARA F P SCHOOL is a Co-Educational institution. The total number of teachers in PAIKPARA F P SCHOOL is 4. The total number of non teaching staff in PAIKPARA F P SCHOOL is 0. The medium of instruction in PAIKPARA F P SCHOOL is Bengali. The total number of class rooms in PAIKPARA F P SCHOOL is 5. The total number of other rooms in PAIKPARA F P SCHOOL is 0. The total number of black boards in PAIKPARA F P SCHOOL is 5. The total number of books in the library of PAIKPARA F P SCHOOL is 128. The total number of computers in PAIKPARA F P SCH == Employment == Among the total population of Paikpara village, 607 are employed and 1357 are unemployed. 96\\. 21% of workers describe their work as main work (employing or earning more than a month) and 3. 79% of workers were engaged in marginal livelihood activities for less than a month. Out of 607 workers engaged in primary occupation, 18 were farmers. == Communication system == \"Basirhat-Nazat\" road passes through Paikpara Bazar. This road connects Paikpara with places like Basirhat, Nejat, Malanch, Dhamakhali and Hasnabad. There are bus services from Paikpara to Basirhat, Nazat, Malanch and Dhamakhali. Also for short distances. There are autorickshaw and tote services. The nearest railway station to this village is \"bhabla Halt\" which is at a distance of 3. 3 km. == Reference == Category:Settlements in West Bengal",
 "title": "Paikpara, North 24 Parganas"
}