{
 "id": "989579",
 "text": "Rose Nougaret (born 25 April 1902) was a French swimmer from Paris. As a member of Mouettes de Paris she competed in the 1920s and early 1930s. Nougaret was a member of Dauphins de Cette. She moved in 1923 to Mouettes de Paris where she became a member of the committee in 1924. Later she moved to Cercle des Nageurs de Paris. ==Biography== ===Swimming career=== Nougaret started with swimming in 1912. Her earliest main competitions were in the early 1920s. She finished in 1920 10th at the , a main open water race in Paris. In 1921 she finished in this race 14th. In 1922 she became champion of Languedoc in the long distance. At the national championships in 1923 in Arras she finished second in the 400 metre freestyle and third in the 100 metre freestyle. At the beginning of the 1924, was was ill and cound't train for a while. At the end of June 1924 she competed at the trials in Paris. She was selected for 1924 Summer Olympics for the the 4 x 100 metre relay team. But as the reserve swimmer, she didn't competed at the Games. At national championships in 1925 and 1926 she finished third with her team in the relay event. At an international competition in Brussels in March 1927 she finished fourth in the 100 metre freestyle. On 7 May 1927 she set a new French record in the 50 metre freestyle at the Hébert swimming pool in Paris with a time of 34.8 seconds. On May 14, she tries to beat her French record but she swam the same time. In June 1927 she became champion of Paris in the 100 metre freestyle event and also in the 400 metre freetyle event. The next month, at the Paris Grand Prix, she won the 100m freestyle event. At the national championships in 1927 she finished third in the 100 metre freestyle event. With her teammates, she finished second the relay. In 1930 she finished with her team second in the 4 x 100 metre freestyle relay. In 1931 she finished third in the 100 metre freestyle event at the national championships. She was selected to compete at the 1931 European Aquatics Championships in Paris. She competed in the 4 x 100 metre freestyle relay event and finished with the team fourth in the final. Her last achievement was in August 1932, winning with her team the 4 x 100 metre relay event. ===Personal life=== Nougaret was born on 25 April 1902. She had brothers. She lived in the southern of France in Narbonne or Sète. In 1918 she moved to Paris and lived in the 4th arrondissement of Paris. She married to M. Billeter in 1931. In January 1933 she was in Barcelona with Yvonne Godard and Suzanne Delbort. While going to the theater in a taxi, they had a traffic accident. She was not injured. ==References== Category:Swimmers from Paris Category:Sportswomen Category:1902 births Category:Year of death missing",
 "title": "Rose Nougaret"
}