{
 "id": "989524",
 "text": "Franz Weselik (20 April 1903 – 15 March 1962) was a former Austrian football player and coach. He played as forward mainly for SK Rapid Wien. He also played for the Austrian national football team. ==Career== Weselik began his career in 1919 at Blue Star Wien and joined SK Rapid Wien in 1923. In 1927 he celebrated his first major success with the team by winning the Vienna Cup. In 1929 and 1930 he won the Austrian championship title with Rapid and won the Mitropacup. The year 1930 was the most successful for the striker. He scored 24 goals in 20 championship games and was Austria's top scorer. In 1934 Weselik signed a contract as a player-coach at FC Mulhouse. Franz Weselik was the third-best league goalscorer of the 1934/35 season with 24 goals. The team finished 6th. After two years he went to Jönköping for a season as coach. In 1938 he returned to Austria. He played for SC Red Star Vienna and then ended his active career. Weselik was member of the NSDAP. He applied for membership in the NSDAP on February 10, 1940 and was admitted on January 1, 1941 (membership number 8,471,374).Jakob Rosenberger, Georg Spitaler: Grün-Weiss unterm Hakenkreuz. Der Sportklub Rapid im Nationalsozialismus. Dokumentationsarchiv des Österreichischen Widerstandes, Wien 2011, S. 299. ==International career== He made his debut for Austria on 6 May 1928 against Hungary and scored 3 goals in the away match. He earned 11 caps, scoring 13 goals.Appearances for Austrian National Team - RSSSF His final international was an April 1933 match, also against Hungary. ==Honours== *Austrian Football Bundesliga (2): ** 1929, 1930 *Austrian Cup (1): ** 1927 *Mitropa Cup (1): ** 1930 ==References== * ==Other websites== *Rapid stats - Rapid Archive * * Category:1903 births Category:1962 deaths Category:Austrian footballers Category:Players of the Austrian national football team Category:SK Rapid Wien players Category:Austrian football managers Category:Austrian football forwards Category:Austrian Football Bundesliga top scorers Category:Austrian football champions",
 "title": "Franz Weselik"
}