{
 "id": "989512",
 "text": "The To Give Welfare Foundation Dasbien is a Peruvian non-profit foundation. It was registered in the Electronic Record No. 14167810 of the Registry of Legal Entities of Peru - SUNARP, founded in 2000, but legalized in 2018. It is a non-profit legal entity that watches over the care, promotion and sustainability of natural resources. It also promotes education, culture and human development through educational activities and programs, training, research, professional updating, organizational relations in Peru. Its headquarters are located in Lima, Peru. It also promotes native languages such as Quechua, Aymara and Awajun in Latin American countries such as Peru, Bolivia, Ecuador, Argentina and Chile. == History == Since 2000, the To Give Welfare Foundation has been promoting the development of training and professionalization activities for teachers in the educational system of the Piura Region, Northern Peru; activities such as trainings, congresses, lectures, courses, publications, formation of organizations, among other regional education programs. These activities have been sponsored by the municipal and regional government, the Regional Directorate of Education of Piura, Local Educational Management Units, Educational Institutions of the locality, the Social Organizations in the area, the Trade Union Organizations such as SUTEP, by a team of professionals in education and psychology, and by the private sector, especially Derrama Magisterial. Through its courses, seminars, workshops and conferences, the Foundation has trained close to 460,000 participants in free programs, 100,000 participants with minimal costs. On the other hand, the Foundation has graduated approximately 5,000 participants in its diploma programs and specialized more than 700. Currently, the Foundation has developed technical careers on behalf of the Peruvian Ministry of Education, through its Centro de Educación Técnica Productiva T&T; CECITEL, to train qualified personnel. == References == Category:Organizations based in Peru Category:Piura Region",
 "title": "To Give Welfare Foundation Dasbien"
}