{
 "id": "98976",
 "text": "Trench warfare is a battle tactic, or way of fighting. It was commonly used on the Western Front in the First World War. It has been utilized in other wars, such as the Iran-Iraq War and the Russo-Ukrainian War. In trench warfare, the two sides fighting each other dug trenches in a battlefield. These trenches had many different parts, such as places for sleeping, for headquarters, for storage, and for artillery and machine guns. Between the front trenches, on the battlefield, was an area called \"no man's land\". This area was often covered with barbed wire and land mines. Soldiers on each side would try to cross no man's land to get to the enemy's trench and attack. Tanks were commonly used to cross this land. Armies used trench warfare because it gave soldiers cover while defending themselves against attack. It also gave soldiers bunks to sleep in, although the bunks were very unclean and uncomfortable. == In World War I (1914 - 1918) == Soldiers in World War I used trenches to protect themselves while fighting. They dug holes two meters deep, which they called trenches. Most World War I soldiers fought in the trenches. Between the trenches of each side's front line, there was an open area called No Man’s Land. In some places No Man's Land could be as narrow as thirty meters (100 feet). Behind the front line were other trenches for moving soldiers and supplies. == Life in the trenches == Death was frequent in the trenches, even when there was no fighting. For example, many soldiers fighting in trench warfare died of disease. The trenches were dirty. Some men disappeared into the mud because it was so thick. The cold, wet and unsanitary conditions made many soldiers sick. Lice spread trench fever, a fungal infection which caused severe head pain and fever. Rats invaded the trenches and spread disease everywhere. The brown rats were the more hated kind. They ate human remains. Some grew to be as big as cats. The trenches had a terrible smell. Bodies were rotting in shallow graves; men had not washed in weeks because there were no facilities; cesspits were overflowing; and creosol or chloride of lime was used to stave off the constant threat of disease and infection. There was also the lingering odour of poison gas, and the smells of cordite, rotting sandbags, stagnant mud, cigarette smoke, and cooking food. The smell was the first thing a new recruit would notice on the way to the front lines. However, new arrivals soon got used to it, and eventually added their own body odor to the smell. == The trench system == Front-line trenches were usually about seven feet deep and six feet wide. The front side of the trench was called the parapet. The rear side was called the parados. Along the top of the parapet and the parados, soldiers would build a wall of sandbags that was two to three feet tall. The sandbags helped to absorb bullets and shell fragments. It was impossible for soldiers to see over the top of a 7-foot trench. To solve this problem, armies added a two or three-foot ledge called a fire-step to the trenches. Trenches were not dug in straight lines. If the trenches were straight, and the enemy got into them, they could shoot straight along the line. Instead, soldiers dug trenches with alternate fire- bays and traverses. Duck-boards were also placed at the bottom of the trenches to protect soldiers from problems such as trench foot. Soldiers also made dugouts and funk holes in the side of the trenches to give them some protection from the weather and enemy fire. The front-line trenches were also protected by barbed-wire entanglements and machine-gun posts. Short trenches called saps were dug from the front-line trench into No-Man's Land. The sap- head, usually about 30 yards forward of the front-line, was then used as listening posts. Behind the front-line trenches were support and reserve trenches. The three rows of trenches covered between 200 and 500 yards of ground. Communication trenches were dug at an angle to the front-line trench and were used to transport men, equipment and food supplies. == Other websites == * Jackson, Patrick, In Depth: A century of mud and fire, BBC News, 27 June 2006 *Association for World War Archaeology *Photograph of soldiers digging trenches during The First World War Category:War",
 "title": "Trench warfare"
}