{
 "id": "989838",
 "text": "Women in Trucking (WIT) is a non-profit organization and foundation that tries to increase the number of women driving cargo trucks. Trucking is when goods are moved from one place to another on a truck. WIT was founded in 2007 by Ellen Voie. WIT focuses on getting women jobs in trucking, helping them fix work problems, and to celebrate all truckers. WIT was recognized by the White House in 2012 and 2013. == History == WIT was founded in 2007 by Ellen Voie. It focuses on many problems women have if they work in trucking. WIT works on endingharassment of women drivers and making work safer. It works on good lighting at places truck drivers stop to rest. WIT fights for uniforms and truck design that are comfortable for women. WIT publishes research on why it is hard to be a woman trucker. WIT became a Gold-Level partner with Frito Lay in 2010. WIT was recognized by the White House in 2012 and 2013. WIT also got a Girl Scout Patch in 2014. WIT holds different events to improve the number of women driving trucks on the road. WIT hosted its first conference called “Accelerate,” in 2015. WIT has held that event ever since 2015. WIT has continued trying to improve the number of women driving trucks on the road. WIT gives awards like the \"Distinguished Woman in Logistics Award,\" the \"Driver of the Year\" award, and the \"Top Workplace for Women in Transportation\" award. They hold many different events. WIT holds the “Accelerate” conference, which has many different speakers come and speak about trucking. WIT has different programs like the Driver Ambassador program, which helps give women a say and lets them share their adventures. WIT also has a career center where women can find jobs in trucking. WIT also finds mentors for people who would like one or need one. They publish Redefining the Road magazine. They publish the WIT Index every year to help understand the number of women working in trucking and if they are treated fairly. In 2022, the WIT Index says that 13.7% of truck drivers are women. More women are leaders in trucking companies. The most women work in human resources jobs for trucking companies. Transportation Secretary Pete Buttigieg says the United States needs more women truck drivers. In March, 2023, Jennifer Hedrick will be the new leader of WIT. == Ellen Voie == Ellen Voie is the founder and president of Women in Trucking. She founded women in trucking to get more women into trucking. She helped found Truckers Pride Day. Before starting Women in Trucking, she was the traffic manager for a place that made steel. Voie has written two books. One book is about marriage and family problems and the other is about what could happen in truck driving training. She was the first person added to the Howes Hall of Fame. Voie was also recognized by the White House in 2012 as a \"Transportation Innovator Champion of Change\" and invited back in 2013 to celebrate the anniversary of the Equal Pay Act. === Early life === Voie grew up knowing that there were no jobs just for girls. She took a shop class. She learned how to make things with wood, welding, and shop work even though those were things for boys. Her mom died in 1979. She got a diploma in Traffic and Transportation Management from the LaSelle Extension University. === Past Career === Voie was hired at a steel making plant in 1978 in the drafting department. In 1979 she was transferred to the traffic department. She would bring the items needed to make steel to the plants and was in charge of hiring, firing, and managing the truck drivers. Voie owned a fleet of trucks. She was also a traffic consultant for many years. Then she worked for Schneider Inc. Voie recruited people who were not usually truck drivers to become drivers. She tried to get women and non-white people to be truck drivers. In 2000, Voie became the executive director of Trucker Buddy International Inc. She helped truckers and students write letters to each other and learn more about each other's lives. === Current Career === Voie founded Women in Trucking when she was completing her pilot's license. She was in a group of female pilots and noticed there wasn’t a group like that for truckers. == Fun facts == WIT has a plush doll named Clare. They also have a “Mall” where you can buy different things from their website. They have an “I Heart Trucking” photo contest. == References == Category:Pages created with the Article Wizard from 2023 Category:Non-profit organizations of the United States Category:Trucks",
 "title": "Women in Trucking"
}