{
 "id": "989841",
 "text": "Pilar Agoyo is a native fashion designer. She works on costumes for movies and television shows. She has done work for The Avengers and Indiana Jones and the Kingdom of the Crystal Skull. Her design also appeared in an exhibit called \"Art of Indigenous Fashion\" at the The Museum of Contemporary Native Arts. The book Native fashion now : North American Indian style calls Agoyo a \"Provocateur,\" meaning she has new ideas people do not expect and that make them have strong feelings. == Early life == She is from Ohkay Owingeh Pueblo near Santa Fe, New Mexico. Agoyo originally wanted to be a painter. She went to the Institute of American Indian Arts. She took a class and realized she loved sewing and textiles. She loved it. == Career == Agoyo has done a lot of work for Hollywood television and movies. She is also well known among indigenous designers in the United States. === Fashion === In 2002, Agoyo opened a boutique in Santa Fe with Virgil Ortiz and Cody Sanderson.Fashioning America: Grit to Glamour. (2022). United States: University of Arkansas Press. Sanderson was her husband. Agoyo works with materials such as vinyl. May of her designs are inspired by traditional pottery designs from her pueblo. Agoyo has worked on lots of fashion shows. She also has museum exhibits, like the Art of Indigenous Fashion\" at the The Museum of Contemporary Native Arts. She has won awards for her designs, including the Masked Heroes contest from First American Art Magazine and at the Heard Indian Market 2011 by the Southwestern Association for American Indian Arts. The Poeh Pueblo Cultural Center also commissioned Agoyo to design masks that would appeal to others from her pueblo. Her work has been recognized by the Traditional Fine Arts Organization. === Hollywood === Agoyo's first work for television was Into the West in 2005. She has worked on 37 movies and shows. Sometimes the fashions she makes for movies helps her think of a new fashion to create. == References == Category:Native American people Category:Native American designers Category:Living people Category:Year of birth missing (living people)",
 "title": "Pilar Agoyo"
}