{
 "id": "989839",
 "text": "Masuma Mohammadi is an Afghan journalist, research scholar, and women’s rights activist. She founded the Equality Social and Cultural Organization, which supports female journalists. In Afghanistan, she was a radio reporter for the United Nations News and “Hello Countrymen, Countrywomen” an Afghan radio program. She was the owner and chief editor of the Equality News Agency, which trained over 200 female journalists. Mohammadi is now working with the San Jose State University and is part of their Visiting Afghan Scholar program. She worked on research about the persecution of the Hazara people. She wants to do research on the rights Afghan women and girls have under the Taliban. == Life in Afghanistan == Mohammadi was born and raised in Afghanistan. She worked as a radio reporter for the United Nations News. She was on a popular Afghan radio program called “Hello Countrymen, Countrywomen”. She founded the Equality Social and Cultural Organization (ESCO) in 2011. In 2020, she created the Equality News Agency to publish articles about women’s issues. This made her a target for the Taliban. On August 15th, 2021, the Taliban took control of Kabul, Afghanistan. When notified of the Taliban's arrival, Mohammadi had to destroy the documents of her coworkers and flee to the United States with her 2 children. == Work in the United States == In the US, Mohammadi has partnered with the San Jose State University (SJSU) and their Visiting Afghan Scholar program. She researched the injustices being directed towards the Hazara people and would like to research women's rights in Afghanistan. She has continued to advocate for the women in Afghanistan from the United States, and says “Please don’t forget the people of Afghanistan, especially Afghan women and girls, support them to access their rights. Your support and providing such opportunities has not only brought a positive change in the lives of people like me, but has also saved our lives.” == References == Category:Living people Category:Afghan writers Category:21st-century Afghan people",
 "title": "Masuma Mohammadi"
}