{
 "id": "989843",
 "text": "Daniell Washington is an American marine biologist, science communicator, television host, and activist for ocean conservation. Washington was the first African American woman to host a television series about science. She founded the nonprofit organization Big Blue and You. Washington is seen on STEM- related shows like Mission Unstoppable, Science the $#*! Out of It, and Xploration Nature Knows Best. She is featured in NOVA's “Ocean Invaders.” == Career == Washington grew up in Miami, Florida. Her family is from Jamaica. She loved the ocean since she was six years old. She graduated from the University of Miami Rosenstiel School of Marine & Atmospheric Science in 2008. She was the only woman of color in her academic department at college. When she was twenty-one she co-founded the nonprofit organization Big Blue and You with her mother. Big Blue and You is a group that inspires young people to care about ocean conservation. Washington help children learn about the ocean by helping them make art from recycled materials. Washington started the organization after she won the \"Follow Your Heart Tour\" award. She won US $10,000. She used the prize money to start the Art Sea Festival. The Art Sea Festival allows children to talk to scientists and artists who care about the ocean. She also used the prize money to make the first episode of a television show for children about science. In 2016 Washington became the host of her own show on the Fox station “Xploration Station” where she talks about how scientists are taking inspiration from nature. The show lasted two seasons. Washington co-hosted the series Science the $#*! Out of It with comedian Krystyna Hutchinson on Facebook Watch. In the series, they answered questions from the internet. Washington wants women, non-binary people, and people of color to get excited about science. She wants them to understand they can be scientists. That is why she is on many television shows. She also started the podcast 21st Century Mermaids. That podcast features women and non-binary ocean conservationists. === Awards === Washington won the \"Follow Your Heart Tour\" prize from ROXY. She also won a \"TogetherGreen\" fellowship from the National Audobon Society and Toyota. Washington used the TogetherGreen Fellowship to teach 15 students filmmaking. They will make public service announcements about conserving water. Washington was also named one of TheGrio's 100 in 2012. == References == Category:Pages created with the Article Wizard from 2023 Category:Marine biologists Category:Scientists from Florida Category:Living people",
 "title": "Danni Washington"
}