{
 "id": "989916",
 "text": "Modest fashion is a style of fashion with less-revealing and private clothing. Some Muslim, Jewish, and Christian women wear modest fashion. In 2022, the modest fashion industry earned US $295 billion. It will earn US $402 billion industry by 2024. This style is worn by many people in the Middle East and Northern Africa. The countries with the highest spendings are Turkey, Iran, and Saudi Arabia. Muslims from other areas such as Indonesia also wear modest fashion. Roughly 87% of Indonesia’s population is Muslim. == Types of Modern Fashion == Modest fashion includes wide legged pants, sheer dresses with non- transparent tops underneath, and traditional abayas. === Hijabs === Hijabs, or head scarves, are scarves or shawls that are usually a part of modest wardrobes. It can be worn to express a person’s identity. French and British colonizers encouraged women in the Middle East to remove the hijab, so many see it as a sign of protest and pride. Some people think that the hijab should be worn to avoid men’s gaze. The hijab is popular in the United States to prove religious identity, as well. Or, to deepen connections with God. Hijabs mainly represent privacy and morality, as well. In some countries, such as Iran and Aceh Province of Indonesia, wearing the hijab is mandatory. This decision has led to protests, on occasions such as on the death of Mahsa Amini. == Modest fashion companies == === Miss Ayşe by Ayşe Yıldırım === Yildirim (Yıldırım) is a Turkish modest fashion designer running the brand Miss Ayshe (Ayşe) in Istanbul, Turkey. She focuses on making beautiful clothing while keeping it appropriate for Muslim women to wear. She is passionate about exposing luxury or big brands for targeting Muslim audiences but not admitting that they are. An example is Zara. Rather than labeling clothes as modest, they work to make it easy to layer. This means they make money from Muslims but don't acknowledge it. === Dulce by Safiya by Safiya Abdallah === Abdallah makes the clothing for Dulce by Safiya. She makes fashionable shirts with hoods (called \"hoodies\") and hats called \"beanies\" that cover women's hair like hijabs. === The Frock by Simi Polonsky and Chaya Chanin === Polonsky and Chanin are Jewish designers. They are sisters. They are from Sydney, Australia. Polonsky is a widow. They started a modest fashion company called The Frock. Their clothes cover women's knees, elbows, and shoulders. Ploansky wanted modest dress but hated looking different from other people. They like to take clothes that are immodest and mix them with modest clothes. They cover their bodies but include immodest fashion. === Mimu Maxi by Mimi Hecht and Mushky Notik === Hecht and Notik are also Jewish designers. Their clothing is popular with Jewish and Muslim women. Notik grew up in Ottawa, Ontario, Canada. Hecht grew up in Seattle, Washington, USA. Modest clothes were expensive. Also they were not pretty. They make clothes that are for layering - for example, wearing a dress and pants and a jacket, or wearing two dresses. == References == Category:Fashion Category:Religious clothing Category:Hijab",
 "title": "Modest fashion"
}