{
 "id": "989909",
 "text": "Marion E. Wong (1895-1969) was an American filmmaker of Chinese descent. She is one of a few known female directors of movies. Wong created the first known Asian American-made movie.Eagan, D. (2010). America's Film Legacy: The Authoritative Guide to the Landmark Movies in the National Film Registry. United Kingdom: Bloomsbury Academic. P. 55-57. She wrote, produced, directed and acted in the Curse of Quon Gwon. Wong also made the scenery and costumes. It was one of the only movies that featured Chinese Americans in a non- stereotypical view.Randall. (2015, Aug 09). KQED: First film ever made by Asian American discovered in basement. AsAmNews Retrieved from ProQuest. After making Curse of Quon Gwon, she became bankrupt and stopped filmmaking. Her movie became lost except for 2 tins, which were recently discovered. == Early life == Wong was born in San Francisco. She moved to Oakland when she was young. She went to until she moved. Because she was the youngest of a big family, she probably got homeschooled after moving. Her family owned a cafe. As a child, she spent a lot of time at the cafe. When she was 15, she and her brothers went to China to find spouses. At that time, there was an act called the Geary Act. It made it hard for Chinese immigrants to come to the United States. Because of that, Wong and her brothers could only stay in China for one year. If they stayed longer, they could not return to the United States. In China, one of her brothers died of smallpox. The other brother found a good wife named Violet. Violet and Wong became good friends. Meanwhile, Wong found a someone to be her husband. She rejected him and went back to the United States without a husband. == Career == After returning to the United States, Wong started writing the screenplay for her first movie. Charlie Chaplin filmed part of his movie, One Night Out, near Wong’s family’s cafe. She led her to creating a movie from the screenplay. She hired one of Chaplin's people to be the cameraman for the movie. This cost a whole lot of money. She got support from her uncle who was very wealthy. She started her own movie company. This company was called Mandarin Film Company. Her movies was much better than most movies made by beginner directors.This is partly because of the good person working the camera. She directed and produced her own movie. This movie starred Violet (her sister-in-law), her mother, Violet’s daughter and a professional actor, Harvey Soo Hoo. Her movie was different from other movies of that time. Other movies did not represent Chinese-Americans well. The other movies that had Chinese-Americans in them at that time were all very stereotyped. “I had never seen any Chinese movies,” said Wong, “so I decided to introduce them to the world.” In the first screenings of her movie, people loved it. Because her movie didn’t have stereotypes that were common at that time, distributors wouldn’t buy it. Wong couldn’t pay back her uncle. Her uncle became broke. She was really sad about her failure. She decided to not be a filmmaker. She asked the family to \"never speak of her film again”. == The revival of The Curse of Quon Gwon == In 1969, Violet told her grandson Gregory Mark about a canister containing the rolls of The Curse of Quon Gwon. She told him to “do something with it.” In 2004 an Asian-American filmmaker Arthur Dong discovered the film rolls and took the to the Academy Film Archive to restore the film.Higgins, S., & Ross, S. (2005). Archival news. Cinema Journal, 44(4), 116-122. Retrieved from ProQuest.THE CLASS OF 2006. (2006). Hollywood Reporter, 397, 7-8,19. Retrieved from ProQuest. In December of 2006 the film was recognized as an important historical and cultural film by the National Film Registry.Elite list adds 'rocky': [ALL EDITIONS]. (2006, Dec 28). Newsday Retrieved from ProQuest. Out of the 8 reels of the film only 2 are saved as of now and you can see them in the Oakland Museum of California. == References == Category:1895 births Category:1969 deaths Category:Movie directors from California Category:Movie producers from California Category:People from San Francisco Category:People from Oakland, California",
 "title": "Marion E. Wong"
}