{
 "id": "989922",
 "text": "Susil Nelson-Kongoi is Papua New Guinean businessperson and is a leader in the country at helping working women get more responsibility and better work rights.Women empowered. (2016, March 9). Papua New Guinea Post-Courier (Port Moresby), p. 014. Available from NewsBank: Access World News – Historical and Current She supports human rights.Women in business boosts woman. (2013, March 19). Papua New Guinea Post-Courier (Port Moresby), p. 030. Available from NewsBank: Access World News – Historical and Current. She helps indigenous women work for better jobs. She is the Senior Media and Communications Advisor at Exxonmobil PNG Limited. She works on public policy, helping the government of Papua New Guinea make good policies. She is Vice-Chariman of the Business Council of Papua New Guinea. Nelson-Kongoi won the Overall Westpac Outstanding Women Award in 2012 for helping Papua New Guinean women to join the workforce. She is one of the only female oil executives in Papua New Guinea.PNG Women Leaders. (2022, March 31). Australian Broadcasting Corporation: Asia Pacific (Australia). Available from NewsBank: Access World News – Historical and Current. She was featured in the \"Pawa Meri\" (\"Power Women\") film project that highlighted important women in Papua New Guinea.Spark, C. (2015). The ʹPawa Meriʹ Project: Producing film biographies about women in Papua New Guinea. In J. CORBETT & B. V. LAL (Eds.), Political Life Writing in the Pacific: Reflections on Practice (pp. 47–58). ANU Press. http://www.jstor.org/stable/j.ctt1729vzb.9 == Early Life == Nelson-Kongoi comes from East Sepik Province. Her parents were educated. They were huge supporters of education. This inspired Nelson-Kongoi to sponsor and fight for Papua New Guineans education. Nelson-Kongoi has a Bachelor of Commerce from Canterbury College. She studied management and information systems. She also has a MBA from Divine Word University PNG. == Career == She works for Exxonmobil PNG Limited as their Senior Media and Communication Advisor. She has been the Manager for Corporate Governance and Special Projects at PNG Sustainable program Ltd for 14 years. Her work helps other women who want careers. Nelson-Kongoi was also asked to work on many national-level projects to make business and the economy stronger in Papua New Guinea. She is on the board of the Business Council of Papua New Guinea. She also helped the The Center for International Private Enterprise start its Papua New Guinea Business Advocacy Network. The Business Advocacy Network helps women get high- level jobs. She is the leader of that Network. She is also the Board Coordinator for the Papua New Guinea Chamber of Commerce and Industry. She is a board member for the Incentive Fund, helping girls and women work in businesses. Nelson-Kongoi also helps teach women about personal and business finance. She helps the Business Coalition For Women (BCFW) teach women about being business leaders.Women's group promotes leadership. (2015, November 6). Papua New Guinea Post-Courier (Port Moresby), p. 024. Available from NewsBank: Access World News – Historical and Current.Business Coalition for Women to hold leadership course. (2015, October 21). Papua New Guinea Post-Courier (Port Moresby), p. 019. Available from NewsBank: Access World News – Historical and Current Nelson-Kongoi is the president of the Business and Professional Women's Club of Port Moresby, too.BPW president is Susil Nelson. (2012, March 9). Papua New Guinea Post-Courier (Port Moresby), p. 004. Available from NewsBank: Access World News – Historical and Current. == Awards == Nelson-Kongoi won the Overall WOW Award (Westpac Outstanding Women Award) in 2012 for helping women in Papua New Guinea get jobs. She also earned a fellowship from the Australian Government's Fellowship program. She also fundraises for scholoarships for girls. == References == Category:Papua New Guinean people",
 "title": "Susil Nelson-Kongoi"
}