{
 "id": "989920",
 "text": "Elaine Denniston (born 1939) was a punch card operator for the Apollo program. She corrected a lot of computer code that made the rockets work better. == Early life == Denniston was brought up in Boston, Massachusetts. She went to Girls' Latin High School and graduated in 1957. Her school did not teach science. Denniston then married a man named Baron D. Denniston. She had two children. == Career == Denniston worked as a clerk after high school. At the New England Life Insurance Company she learned to be a keypunch operator. She made the holes in punched cards. In the 1950s and 1960s, those cards were how computers got information. So, computer programmers wrote computer code on paper. Keypunch operators then punched code onto the punched cards to get the code into the computers. === Apollo program === In 1966 Denniston went to work for the MIT Instrumentation Lab (now called Draper Laboratory). Her job at MIT was to keypunch data that programmers wrote for the Apollo Project. She helped make rockets to go to the Moon. She worked on guidance systems - the parts that controlled the rocket's movements. Her job was to keypunch cards but she saw many mistakes the coders made. She started editing and correcting code. She learned coding rules. She saw mistakes and learned how to correct them. Her contributions were recognized in the BBC Podcast, 13 Minutes to the Moon and the We Hack The Moon exhibit. ==== Hardships ==== Denniston faced many hardships during her work on Apollo. Denniston was told to train a person so she did. The company she worked for eventually reorganized the employee positions and the person that Denniston trained then became her boss because he had some college credits but also he was a man. She also had problems with the programmers. The programmers often made excuses as to why the code wasn’t finished so Denniston used her persistent attitude to make sure it was finished on time and able to run overnight. === Later career === Denniston could not get a better job at MIT because she was a woman and she was Black. She left MIT in 1968. Denniston went to study at Radcliffe College. She graduated in 1973. Denniston then studied at Boston University Law School. She became a lawyer. Most of her work was for the government of the state of Massachusetts. Denniston retired in 2012. == References == Category:Apollo program Category:1939 births Category:Possibly living people Category:People from Boston",
 "title": "Elaine Denniston"
}