{
 "id": "990032",
 "text": "Marie Korsaga is an astrophysicist from Burkina Faso. She is the first female Burkinabe astrophysicist. Korsaga studies dark matter. She also supports girls who are interested in science. == Early life == Korsaga became interested in science when she learned about people traveling to the Moon. She was fascinated by shooting stars. She was interested in many kinds of science. Korsaga did not see many women working in science. She saw very few African women working in science. She did see some female engineers. She planned to be a civil engineer. == Career == Korsaga attended Joseph Ki-Zerbo University in Ouagadougou, Burkina Faso. She studied mathematics and physics. She learned about new kinds of science. Astronomy was one of the sciences that she learned about. She continued studying in France after she finished college. Korsaga want to the Astrophysics Laboratory of Marseille (LAM) in France. She earned a doctorate from LAM and the University of Cape Town in South Africa. She studied galaxies. Korsaga works as a researcher at the Observatoire Astronomique de Strasbourg in France. She is also a teacher at the Université Joseph Ki-Zerbo in Burkina Faso. Korsaga has also spoken at the African Union. She was honoured by the city of Huesca, Spain in their sundial. Dr. Korsaga is a founding member, and sits on the editorial board, of “L’Astronomie Afrique”. It is the first French language online astronomy magazine in Africa. She won the African Network of Women in Astronomy award. The award is from the African Network of Women in Astronomy. === Advocacy === Korsaga works to get more girls from Burkina Faso interested in science. She also works to make Burkina Faso stronger in research about space. She wants her country to be the first African country to launch satellites into space. == References == Category:Year of birth missing (living people) Category:Living people Category:Astrophysicists Category:Burkinabé people Category:Burkinabé scientists",
 "title": "Marie Korsaga"
}