{
 "id": "990082",
 "text": "Fighting in southern Ukraine during the Russo-Ukrainian War has been going on since 2014. The war between Russia and Ukraine became bigger in February 2022, when Russia invaded Ukraine. Fighting is still going on in southern Ukraine, as of 2023's fourth quarter. The 2023 Ukrainian counteroffensive started in June. ==Battles and taking control of land == *Battle of Huliaipole, ongoing (as of 2024's first quarter). Earlier (2022's fourth quarter), more and more Ukrainian soldiers were gathered around Huliaipole; In response, more and more Russian soldiers gathered around Melitopol. During 2023's third quarter, the city (Huliaipole, Zaporizhzhia Oblast) sometimes gets hit by artillery (or canon shots). *Dnieper clashes; In 2023, Ukrainian soldiers have (again) been making incursions and taking part in skirmishes on the eastern bank of the Dnieper River. **As of May 2023, ISW said that some Ukrainian soldiers (were in control of, or) were staying on the southern part of the island Ostriv Velykyi Potomkin. **In May 2023, the ISW said that Ukrainian soldiers had taken control of Toloka Island and the Zburivsksyi Kut bay at the mouth of the river delta. Also, the ISW said that there was significant (fighting or) partisan activity in Hola Prystan and Oleshky against the Russian administrators at those places. **In January 2023, a Russian milblogger said that Ukrainian soldiers were still doing reconnaissance on Kinburn Spit. Ukrainian authorities gave support to that claim. ===Ended in 2023=== *Robotyne (map), Tokmak (hromada, similar to municipality), Polohy, Zaporizhzhia. Ukrainian soldiers won the battle (in 2023's third quarter). *Dachi, a village on the East Bank of the Dnieper River - and near the Antonivka Road Bridge, is under the control of Ukrainian soldiers (as of April 2023). Antonivsky island, which is swampy, is under Ukrainian control. ===Ended in 2022=== *Kherson counteroffensive, ended November 11, 2022; It happended in Kherson oblast. ** Ukraine took the city of Kherson back on November 11, 2022. The city is in Kherson oblast. *Ukraine took Davydiv Brid back on October 4, 2022. The place is in Kherson oblast. *Battle of Davydiv Brid, ended 16 June, 2022. *Battle of Mykolaiv, ended April 8, 2022. Ukrainian soldiers kept the city. The battle took place in Mykolaiv, Mykolaiv Oblast. *Battle of Kherson, ended 2 March, 2022. ===Ended in 2014=== During the Offensive on Mariupol, Russian and Russian-backed separatist troops supporting the Donetsk People's Republic moved towards the city of Mariupol. Fighting started in the outskirts of the city on September 6, 2014. ==Other fighting== Ukrainian soldiers attacked (during the counteroffensive) *across the Konka River, and (eastwards) towards Oleshky (map), Kherson oblast *and captured a fortification at Zverinets on the Avdiivka-Donetsk City line (related page: Donetsk (city)), near Marinka (map) ==Related pages== *Military campaign ==References== Category:2022 Russian invasion of Ukraine",
 "title": "Warfare in southern Ukraine during the Russo-Ukrainian War"
}