{
 "id": "990039",
 "text": "Naomi Faik-Simet (b. 1977) is a Papua New Guinean dance researcher at the Institute of Papua New Guinea Studies.Nicholas Rowe, Rose Martin, Ralph Buck & Eeva Anttila (2018) Researching dance education post-2016: the global implications of Brexit and Trump on dance education, Research in Dance Education, 19:1, 91-109, DOI: 10.1080/14647893.2017.1354839 She is the first PhD from Papua New Guinea to graduate from a dance studies program. She is the only dance researcher in Papau New Guinea, and the first dance researcher ever employed by her country's government. Faik-Simet works to preserve and create cultural traditions. Papua New Guinea is working to be modern, but Faik-Simet wants people to remember their culture and not just adopt other cultural traditions. She teaches about traditional and contemporary dance and music. She shows people that traditional and new arts can go together. She represents Papua New Guinea for UNESCO's Asia/Pacific Cultural Centre, the International Council for Traditional Music, World Dance Alliance, and World Alliance for Arts Education. == Early life == Faik-Simet was born in Papua New Guinea. She grew up during the period after Papua New Guinea became independent from Australia. == Career == === Education === In 2001, Faik-Simet started working for the Institute of Papua New Guinea Studies. In 2003 she returned to University of Papua New Guinea to complete her undergraduate college degree. She completed her degree in 2005. Soon, Faik-Simet realized she needed more education. First, she connected with experts who lived in New Zealand, Nicholas Rowe and Ralph Buck. In 2010 she got a scholarship from the University of Auckland to study a traditional dance called \"gunge takwaku.\" Between April 28, 2017 and December 29, 2020, Faik-Simet attended the University of Auckland. She studied the impact of colonialism on dance education in Papua New Guinea. She also studied how to use dance to pass down culture and knowledge. She graduated with a PhD in dance studies in November 2021. === Today === Faik-Simet is now the assistant director at the Institute of Papua New Guinea. She helps to organize conferences, like the 8th Symposium of the ICTM Study Group on Music and Dance of Oceania. She received the Mineral Resource Development Co (MRDC) award in 2011 for making an impact in decolonising dance in Papua New Guinea. The award is a Westpac Public Sector award. It is part of the Westpac Outstanding Women Award. == Personal life == Faik-Simet and her husband have two children. == References == Category:Papua New Guinean people Category:1977 births Category:Living people",
 "title": "Naomi Faik-Simet"
}