{
 "id": "990038",
 "text": "Amelia Goldberg (1862-1950) known as Nadage Doree (also spelled Nadege) was a Jewish American activist, actress, and writer.The Theatre. (1888). United States: Theatre Publishing Company. P. 272. She fought for justice for Jews. Goldberg wrote books called: \"Gèlta, Or, The Czar and the Songstress” and “Did Jesus Change? The Answer of the Jew to the Question of the Ages.”Browne, W. T. (1906, Feb 03). \"Gelta.\". New York Times (1857-1922) Retrieved from ProQuest. Goldberg was also a singer. She wrote patriotic songs. She is best known for being arrested while trying to speak to United States' President Theodore Roosevelt about violence against Jewish people in Russia.JEWESS SUES LOEB FOR $50,000: CHARGES HIM WITH CAUSING HER ARREST INCIDENT OCCURRED IN WASHINGTON LAST WINTER MISS DOREE WAS DISTRIBUTING CIRCULARS IN BEHALF OF RUSSIAN JEWS AND TRIED TO SEE ROOSEVELT. (1906, Aug 11). The Hartford Courant (1887-1922) Retrieved from ProQuest.The President's Private Secretary and His Many Troubles. (1906, September 9). Colorado Springs Gazette, p. 24. Available from NewsBank: Access World News – Historical and Current.ARRESTED AT CHURCH DOOR: YOUNG RUSSIAN JEWESS WAS HANDING OUT CIRCULARS AT ST. JOHN'S. HAS WRITTEN A BOOK ON THE POLITICAL AND RELIGIOUS CONDITIONS IN RUSSIA. SOUGHT TO SEE THE PRESIDENT. (1905, Oct 09). The Washington Post (1877-1922) Retrieved from ProQuest. == Career == Goldberg was an activist and author. She wrote her two books, “Gèlta, Or, The Czar and the Songstress” and “Did Jesus Change? The Answer of the Jew to the Question of the Ages.” She also wrote for The American Israelite newspaper.DOREE, N. (1894, Jul 26). ISRAEL ZANGWILL: THE AUTHOR OF \"CHILDREN OF THE GHETTO.\". The American Israelite (1874-2000) Retrieved from ProQuest.Goldberg was also an opera singer and actress. She started writing patriotic songs, and producing plays. She was a model for Duke cigarette cards. She had a race horse named after her. She was an activist who fought against anti-semitism. === Activism === In 1905 during President Roosevelt's church service, she interrupted to try to convince Roosevelt to help Russia’s Jews. She got arrested. She sued Roosevelt’s secretary (William Loeb Jr.) 50,000 for a false arrest. == References == Category:1862 births Category:1950 deaths Category:Jewish American actors Category:Jewish American writers",
 "title": "Nadege Doree"
}