{
 "id": "990042",
 "text": "Lavenia Yalovi is a Fijian sports commentator. Sports journalist Aaron Kearney recruited her to learn to be a sports commentator. He asked Yalovi to join the \"Commentary for Good\" program. That program worked with Women in news and sport. One of the goals of the program was to get more women reporting on sports. Yalovi is one of the first female Pacific Islander to be a sports commentator. She worked during the Women's World Cup and commentated in Fijian. Yalovi was also on three national sports teams. == Early life == Yalovi plays many different sports. She grew up in Kadavu Island. As a child, she was not allowed to play soccer because she was a girl. Soccer was seem as a sport for boys. As a girl, she could play softball and netball. Yalovi's family moved to Suva for secondary and tertiary education. == Career == Yalovi became a social science teacher. She was asked be a sports coach at her school. She started learning soccer so she could coach girls to play it. She became really good at soccer. In one year she was on Fiji's national football team. Yalovi was on three of Fiji's national teams. She played football. Yalovi also played hockey and rugby. She participated in the Pacific Women’s Sports Leadership Program in Papua New Guinea. Yalovi is the national coordinator for the Get into Rugby PLUS program in Fiji. She works for the Fiji Football Association. She is in Australian government videos about international cooperation using sports. Yalovi commentates with Adele Willie and Jennesa Hinge Moli of Vanuatu. Kearney recruited them together. Willie and Moli have worked in media. Yalovi knows about sports. Together they can comment on games. Their first job together was at the Oceania Nations Cup. FIFA liked their work. FIFA invited them to come to France to work at the Women's World Cup. == References == Category:Year of birth missing Category:Living people Category:Association football broadcasters Category:Fijian sportspeople Category:Female footballers Category:Field hockey players Category:Fijian rugby union players",
 "title": "Lavenia Yalovi"
}