{
 "id": "990040",
 "text": "Elsa Renee Flores is an American biologist and chemist. She is a member of the editorial board of Cancer Research, a very prestigious research journal. She is the leader of the Cancer Molecular Pathobiology study section at the United State's National Institutes of Health. Before this, she served as the co- director of the Metastasis Research Center. She was also the director of the Genes and Development Ph.D. program at The University of Texas MD Anderson Cancer Center.LESLIE, M. (2011). Brothers in Arms Against Cancer. Science, 331(6024), 1551–1552. http://www.jstor.org/stable/29783920. ==Early life== Flores grew up in Corpus Christi, Texas. Her father studied biology and chemistry which sparked her love for science. However, when she had to make a decision for college, she was stuck between science and liberal arts. In the end, she enrolled at Massachusetts Institute of Technology and majored in chemical engineering. Later, she came back as a postdoctoral fellow. As a postdoc she worked in Tyler Jacks's lab. Flores was a graduate student at the University of Wisconsin-Madison. ==Career== Flores’ maternal grandmother and aunt were both diagnosed with cancer. Her family members' health inspired Flores to study cancer. Flores was a member of the editorial board of Cancer Research. Flores discovered many ways to tackle cancer that can be used as possible cancer treatments in the future. She studied causes of breast cancer with Helmut Zarbl. At the University of Wisconsin-Madison, she worked in Paul Lambert's Lab. She dissected the life cycle of the human papillomavirus- a major cause of cervical cancer. Flores discovered cancerous tumors could regress with a protein called amylin. This discovery helped her continue her search for the cure for cancer. Flores holds several patents for inventions to help fight cancer.US Patent Issued to Elsa R. Flores on Feb. 5 for \"Generation of human induced pluripotent stem cells using nucleic acid sequences that inhibit triangle-NP63 and DGCR8\" (Texas, Florida Inventors). (2019, February 6). US Fed News (USA). Available from NewsBank: Access World News – Historical and Current.WIPO PUBLISHES PATENT OF THE UNIVERSITY OF TEXAS SYSTEM BOARD OF REGENTS FOR \"GENERATION OF INDUCED PLURIPOTENT STEM CELLS BY MODULATION OF ?NP63 OR DCGR8\" (AMERICAN INVENTORS). (2013, October 28). US Fed News (USA). Available from NewsBank: Access World News – Historical and Current. ==References== ==Other websites== *Elsa Flores Labs *Google Scholar List of Publications Category:American biologists Category:Medical researchers Category:People from Corpus Christi, Texas Category:Living people Category:Year of birth missing (living people)",
 "title": "Elsa Flores"
}