{
 "id": "990044",
 "text": "Esmeralda Soria is an American politician. She is currently serving as a California State Assembly member. She represents California District 27. Soria's district covers Fresno, Madera, and Merced counties. Soria won the election on Tuesday, November 8th, 2021. She was sworn in on Monday, December 5th, 2022. Soria is a member of the Democratic Party. == Early life and family == Soria was born and raised in Visalia, Tulare County, a county in Central California.Macías, J. L. (2019, Nov 15). Mujeres del valle central de california vencen retos importantes: Esmeralda soria, concejal de fresno aspira al congreso de EEUU; mientras que gauri sánchez quiere la sanación de su comunidad en el valle de san joaquín. La Opinión Retrieved from ProQuest. She is a first generation American. Her parents came to the United States from Michoacán, Mexico. She grew up working on a farm with her parents. Soria’s parents valued education and giving back to their community. She became interested in politics and law at a young age. Soria went to University of California, Berkeley for her undergraduate degree. She studied Political Science and Chicano/a Studies. She later attended University of California, Davis for a Juris Doctor. A Juris Doctor is a degree you need to be a lawyer. Soria was one of the sixty people accepted into Harvard University’s John F. Kennedy School of Executive Leadership Program. Soria is one of five children. One sister is on the Lindsay City Council, in Tulare County, California. Another sister is on the board of directors of the Lindsay Unified School District. Soria's youngest sister is on the board of directors of the local hospital. She also has one brother. == Career == After graduating from University of California, Berkeley, Soria began to work at the Sacramento State Capitol. She focused on women’s health, education, and public safety. She went to law school two years later. During her time in law school at University of California, Davis, she interned at the White House. Soria worked as a legal clerk for California Rural Legal Assistance. She became Policy Advisor for California Assemblyman Henry T. Perea. She was District Director for State Senator Michael Rubio. She then became an adjunct professor at Fresno City College.Vaccari, B. (2022, September 25). Esmeralda Soria wins law enforcement backing in assembly race. Merced Sun-Star, The (CA), p. 1A. Available from NewsBank: Access World News – Historical and Current. === Fresno Council === Soria was elected to the Fresno City Council in 2014. She was on the city council eight years. She was the only woman on the council.ESPARZA LOERA, J. (2014, November 19). POLITICS/POLÍTICA Soria squeaks past Catalano in District 1. Vida en el Valle (Fresno, CA), p. 5A. Available from NewsBank: Access World News – Historical and Current. Soria represented more than 72,000 people from her community. She helped homeless people and worked for affordable housing. Soria also wanted better parks.Hostetter, G. (2015, June 9). More park money sought -Council Member Esmeralda Soria wants more money for parks -She says the mayor should invest an additional $1.5 million in green space -The issue will be a hot topic at this morning's budget hearings. Fresno Bee, The (CA), p. 3A. Available from NewsBank: Access World News – Historical and Current. Soria was a member of the Fresno City Council until her win as a California State Assembly member in 2022. She was elected president of the Council in 2018. She was the first Latina council president in Fresno city history. === 2020 Election === Soria ran against US Congressperson Jim Costa for California District 16 in the United States Congress. She lost in the primary election to a Republican Party candidate, Kevin Cookingham.G. Ortiz-Briones and Juan Esparza Loera, M. (2020, November 11). Election Crocker loses runoff rematch for Tulare County District 1. Fresno Bee, The (CA), p. 1A. Available from NewsBank: Access World News – Historical and Current. === 2022 Election === Soria ran for the California State Assembly in 2022. She ran against Mark Pazin. The election was on November 4, 2022. The vote was very close: 51% for Soria, 49% for Pazin. She took office on December 5th 2022. Right now, she is working with a board of other assembly members. == References == Category:Living people Category:Year of birth missing (living people) Category:Democratic Party (United States) politicians Category:Politicians from California Category:State legislators of the United States",
 "title": "Esmeralda Soria"
}