{
 "id": "990041",
 "text": "Anna Alida Theresia Nilsson (April 27,1869 – December 11, 1947) was a Malmö drawing teacher, suffragist, peace activist, and women's rights activist. Nilsson became a drawing teacher in 1890. In 1914, Nilsson committed suffrage to be a role model for other women, and fight for women’s rights. After the First World War, Nilsson joined the women’s peace movement. Nilsson was elected to the board of the “International Women’s League for Peace and Freedom” when it was started in 1919 In 1929 Nilsson retired, and began traveling around Europe by train and bus. In 1934 Nilsson started collected history textbooks from different countries to compare. == Early life == Nilsson was born at Toarp manor house in Södra Säm, Västergötland. She was born into a Swedish family. Her dad was Hans Petter Nilsson, who was a textile cottage industry promoter. Her mother was Albertina Juliana. In 1885, Nilsson’s father died and was replaced by a guardian. Her mother then remarried to a relative. Nilsson was the fourth child out of her five siblings, and she was especially close with her older sister Ada Nilsson. == Career == Nilsson attended the Lyceum school with her sister and received her qualifications to be a drawing instructor in 1890. Nilsson worked as a junior teacher at the Stockholm Tekniska professional school for two years. During this time she also gained her penmanship qualifications. After, she moved to Malmö, where she spent eight years at “Tekniska Afternoon- and Evening-School” working as a drawing instructor. For six months in 1900 she worked as a pattern designer in Stockholm. Nisson was a peace activist. She was a delegate to the International Women’s Peace Congress, The Hague, in 1915. Nilsson was an author of books about peace. She wrote four books: * Data and Facts in the Peace Movement, (1924); * From Two Battlefields, and A Third, (1933); * Peace Movement ABC, (1934); * Ten Happy Years Traveling in Peace Work, (1945). == References == Category:1869 births Category:1947 deaths Category:Swedish educators Category:Women's rights activists",
 "title": "Anna T. Nilsson"
}