{
 "id": "990125",
 "text": "Wilhelm Morokutti also Wilhelm Morocutti (9 May 1900 in Wien, Austria-Hungary; 2 February 1962 in Oberneukirchen, Austria) was an Austrian footballer. ==Career== Morocutti grew up in Ober-St. Veit and came in 1914 at the age of 14 to the local Amateur SV. He was always called \"Cutti\" by the supporters of the club. As a result of the First World War, many of the regulars were not available. So, he made his debut in the first team at the age of 16 in the position of left winger. In 1920, the amateurs reached the final of the ÖFB Cup for the first time. In 1921, a title was won for the first time with the cup victory against the Wiener Sport-Club, but Morocutti was not used in the final game. Finally he played as right winger where he became an important assistant giver for Kálmán Konrád and later for Gustav Wieser, Viktor Hierländer and Matthias Sindelar. After differences with the club's management, he went to WAC in 1930. ==International career== In January 1922, he debuted for the national team in a 3–3 draw against Italy. He scored his first goal for the national team in April 1925. In total he played 17 international matches and scored five goals. ==Personal life== He owned a company as a dental technician since 1924. After his football career ended he worked there. After the annexation of Austria in 1938, he worked again in the managment of FK Austria Wien. Morocutti applied for admission to the NSDAP on 28 May 1938 and was admitted (membership number 6,125,710).Bernhard Hachleitner, Matthias Marschik, Rudolf Müllner, Johann Skocek: Ein Fußballverein aus Wien. Der FK Austria im Nationalsozialismus 1938–1945. Böhlau Verlag. Wien-Köln-Weimar 2019, S. 94, 270. ==References== Category:1900 births Category:1962 deaths Category:Association football forwards Category:Austrian footballers Category:Austria international footballers Category:FK Austria Wien players Category:Austrian football forwards Category:Austrian football champions",
 "title": "Wilhelm Morokutti"
}