{
 "id": "990223",
 "text": "Madonna of the Trail is a series of 12 monuments dedicated to the spirit of pioneer women in the United States. The monuments were commissioned by the National Society of Daughters of the American Revolution (NSDAR). The monuments were built in each of the 12 states on the National Old Trails Road from Cumberland, Maryland, to Upland, California. The monuments were created by sculptor August Leimbach. The Madonna of the Trail monuments were meant to be symbols of the courage of the women who aided in conquering the wilderness and creating permanent homes. The statues were dedicated in 1928 and 1929. They have became sources of local pride. All of the monuments are currently in good condition and on display. ==Locations== There is one monument in each of the 12 states along the National Old Trails Highway (much of which later became U.S. Highway 40 and U.S. Highway 66). The monuments in order of dedication are: State Image Location Notes Maryland Bethesda Wisconsin Ave. and Old Georgetown Rd. Was the only statue facing east. In December 2004, the statue was removed to fix a foundation problem. When it was put on the truck, the Madonna faced west. This us believed to be the first time all 12 statues have faced west. Pennsylvania Beallsville US Rt. 40, across from Nemacolin Country Club,12 mi. E of Washington, PA West Virginia Wheeling US Rt. 40, across from Overlook Condominium Dedicated on July 7, 1928. Contributing structure in the National Road Corridor Historic District Ohio Springfield US Rt. 40 - Snyder's Park. Placed some ten blocks from the National Old Trails Highway Ohio's Madonna was relocated in 2011 to downtown Springfield. The statue is facing south so it can be seen better from Main Street (Route 40). Indiana Richmond Glenn Miller Park, US 40 East and N 22 St. Illinois Vandalia SE corner of the Old State House Missouri Lexington Main St. and Jack's Ford Rd. Kansas Council Grove Union and Main St. Dedicated on September 7, 1928. Listed on the National Register of Historic Places. It is one of three along the Santa Fe Trail route. Colorado Lamar S Main St. and Beech St. New Mexico Albuquerque 4th and Marble NW Dedicated on September 27, 1928. Listed in the National Register of Historic Places. It was removed from McClellan Park in 1996 when the park was demolished to build the Pete V. Domenici United States Courthouse. The monument was moved to a new site at the northwest corner of the courthouse grounds. It was rededicated on September 27, 1998. Arizona Springerville US Rt. 60 (Main St.) across from Post Office California Upland Center divider on Euclid Avenue just north of Foothill Boulevard Dedicated in 1929 ==References== Category:Monuments and memorials in the United States Category:1928 establishments in the United States",
 "title": "Madonna of the Trail"
}