{
 "id": "990383",
 "text": "Chan Chun Sing (; born 9 October 1969) is a Singaporean politician and former major-general. He has been the Minister for Education since 2021. He has been the Minister-in-charge of Public Service since 2018. Chan is a member of the governing People's Action Party (PAP). He has been the Member of Parliament (MP) representing the Buona Vista division of Tanjong Pagar GRC since 2011. == Personal life == Chan grew up in a single-parent household and has a sister, Chan Siew Yin. Chan is married with a daughter and two sons. He is a fan of Everton F.C. ==Education== Chan studied at Raffles Institution, Raffles Junior College, Christ's College, Cambridge and MIT Sloan School of Management. He was awarded the President's Scholarship, Singapore Armed Forces Overseas Scholarship and the Lee Kuan Yew Scholarship before. ==Military career== Chan joined into the Singapore Army in 1987, and attained the rank Major-General. On 26 March 2010, Chan became Chief of Army. Chan stepped down from his job and left the Singapore Armed Forces on 25 March 2011 in order to contest in the 2011 general election. ==Political career== Chan joined politics in the 2011 general election as part of the five-member People's Action Party (PAP) team contesting in Tanjong Pagar GRC. He represented the Buona Vista section. The team won and he was elected as a Member of Parliament. He has served as Minister of State for Information, Communications and the Arts, Senior Minister of State for Defence, Second Minister for Defence and Minister for Social and Family Development. Other include Minister in the Prime Minister's Office, Minister for Trade and Industry. He is currently serving as Minister for Education since 2021 and Minister-in-charge of Public Service since 2018. == References == == Other websites == * Chan Chun Sing on Prime Minister's Office * Chan Chun Sing on Parliament of Singapore Category:Members of the Cabinet of Singapore Category:People's Action Party (Singapore) politicians Category:1969 births Category:Living people",
 "title": "Chan Chun Sing"
}