{
 "id": "990427",
 "text": "{{Infobox writer | name = Frank O'Hara | image = Frank O'Hara (photo portrait).jpg | image_size = | birth_date = | birth_place = Baltimore, Maryland, U.S. | death_date = | death_place = Mastic Beach, New York, U.S. | notableworks = Lunch Poems | movement = The New York School | resting_place = Green River Cemetery, Springs, New York, U.S. | occupation = Poet, art curator | alma_mater = Harvard University (AB) University of Michigan (MA) }} Francis Russell \"Frank\" O'Hara (March 27, 1926 – July 25, 1966) was an American poet, art critic, and curator. O'Hara was born in Baltimore, Maryland and grew up in Grafton, Massachusetts. He studied piano at the New England Conservatory in Boston from 1941 to 1944. During the last years of World War II, he served in the U.S. Navy in the South Pacific and Japan on a destroyer. After the war he attended Harvard University. At first, he studied music but then changed to English to become a writer. His roommate at Harvard was the artist Edward Gorey. He also became friends there with the poet John Ashbery. O'Hara lived in New York City from 1951 until his death in 1966. In time, he and his poet-friends came to be known as The New York Poets. This group included Ashbery, James Schuyler, Barbara Guest, and Kenneth Koch. He also got to know many young New York artists, such as Larry Rivers, Jane Freilicher, Fairfield Porter, Joan Mitchell, Alex Katz, Jasper Johns, and Jackson Pollock. O'Hara worked at the Museum of Modern Art. He put together exhibitions of art. He wrote catalogs and essays for those art shows. He made plans for the shows to travel to other cities. He was not well-known as a poet until some of his poems were printed in The New American Poetry in 1960. This was a collection of many younger poets who were writing in original ways. He published two important books of poetry in his lifetime, Meditations in an Emergency (1956) and Lunch Poems (1964). He wrote different kinds of poems. Some are very short and others are very long. Some use language in difficult ways. Others are very direct and sound like ordinary talking about the ordinary things he does in the city. O'Hara's early death in 1966 was caused by a motor accident on the beach at Fire Island, New York. ==Books== *A City Winter and Other Poems (1952) *Oranges: 12 pastorals (1969) *Meditations in an Emergency (1957) *Second Avenue (1960) *Odes (1960) *Lunch Poems (1964) *In Memory of My Feelings (1967) *The Collected Poems of Frank O'Hara (1971) == Related pages == *List of poets from North America ==References== Category:1926 births Category:1966 deaths Category:American poets Category:LGBT poets Category:American LGBT writers Category:Writers from Baltimore",
 "title": "Frank O'Hara"
}