{
 "id": "990664",
 "text": "Cornelius Hendrik Rogge (21 December 1932 – 17 January 2023) was a Dutch sculptor, installation artist and painter. ==Biography== From 1950 to 1952, Rogge attended the Institute for Applied Arts Education (later the Gerrit Rietveld Academie) in Amsterdam. From 1955 to 1957 he studied at the Rijksakademie van beeldende kunsten in Amsterdam. In 1971 he received the American “Cassandra Award” and in 1986 the “David Röell Prize” from the Prins Bernhard Cultuurfonds. Rogge taught at the AKV St. Joost in 's-Hertogenbosch and the Gerrit Rietveld Academy in Amsterdam. Rogge was a representative of modern art from the post-World War II period. His work is present in multiple Dutch art museums including the Kröller-Müller Museum. Sculpture of Rogge in the public area includes of in Amsterdam Nieuw-West and in Amsterdam-Zuid. In 2005, on the occasion of his 45-year of being an artist, he was appointed Officer in the Order of Orange-Nassau. Rogge died in Eerbeek on 17 January 2023, at the age of 90. == Expositions== *1955: , Arnhem *1965: Twaalf beeldhouwers uit Nederland, Paleis voor Schone Kunsten, Brussels *1970: Stedelijk Museum Amsterdam, Amsterdam *1976: Tentenproject, (KMM), Otterlo *1984: Institut Néerlandais, Paris *1996: Delphi, Contemporary Arts Center, New Orleans *1999: 40 jaar beelden, Rijksmuseum Twenthe, Enschede *2005: Krijgsgewoel, Legermuseum, Delft *2008: Zieleschepen, Beelden aan Zee, Scheveningen == Gallery == File:KMM Rogge Afdruk 01.JPG|Afdruk van het heelal (1965), Beeldenpark KMM, Otterlo File:Nordhorn Rogge02.JPG|Säule (1988), Kunstwegen, Frenswegen File:Maastricht, Oude Minderbroederskerk, vm Sterre- der-Zeekapel, sculpturen 1.jpg|Rearrangement of Star of the Sea altar (ca. 1990), Maastricht File:KMM Rogge Cicero.JPG|Cicero (2000), Beeldenpark KMM, Otterlo File:Windzuil (4).jpg|Windzuil (1966), Gerbrandypark, Amsterdam File:Piramide (Rogge) (1).jpg|Piramide (1994), Amsterdam-Zuid File:Kunstwerk Cornelius Rogge.jpg|Tiel ==References== Category:Dutch painters Category:Dutch sculptors Category:1932 births Category:2023 deaths Category:Artists from Amsterdam",
 "title": "Cornelius Rogge"
}