{
 "id": "990699",
 "text": "My Star in the Sky is a documentary created by Michael Mulroy and Eric Oehlerich. It was premiered in the summer of 2019. ==Plot== This documentary tells the story of the survival, friendship and love of two child soldiers, Anthony and Florence Opoka, who are kidnapped and forced to become soldiers of the Lord's Resistance Army (LRA). The LRA is a rebel group that opposes the government of Uganda. Anthony was seriously injured many times. The sixth time he was hit by a rocket-propelled grenade. He was thrown into a mass grave and was almost buried until someone noticed his eyes moving. He recovered with minimal medical treatment and became a celestial navigator, a skill he had learned from his father. Anthony later became a radio operator and code-talker and was eventually made Joseph Kony's radio operator. Florence also served as a soldier. After marrying Anthony in the bush, she delivered her second child during a firefight. After the birth, she \"stood up and tied the baby to her back, picked up her first child with one hand and her assault rifle with the other.\" Anthony and Florence eventually escaped, continued their family, and supported children orphaned by LRA soldiers to this day. ==Release== The documentary first premiered in the summer of 2019. It has been screened in support of charities that focus on ending the use of children in armed conflict at Yale University's Jackson Institute for Global Affairs, the Atlantic Council, a Washington, D.C.-based think tank for international affairs, the Enough Project, a non-profit group to end crimes against humanity, Georgetown University's Institute for the Study of Diplomacy, and the Truman National Security Project, a national security and leadership development organization based in Washington, D.C. ==Reception== Foreign Policy reports that the documentary came about after Mulroy and Oehlerich met the Opoka's during Operation Observant Compass (OOC). Mulroy called OOC a “model” for addressing child soldiers using influence operations instead of lethal force. They worked with Non-Government Organizations (NGOs) who found mothers of child soldiers and had them broadcast messages over the radio, begging them to come home. Mulroy said that many of these kids didn't think they would be allowed back, so to have their mother get on the radio and specifically tell them ‘we want you back’ made a big difference. He continued that other missions are driven by kinetics—this was not. Marine Corps Special Operations Command Colonel Darren Duke, who previously commanded OOC, said they did everything they could to get the child soldiers to defect so they would not have to fight them by using psychological operations to \"appeal to them to lay down their arms,\" he said during the screening. Mulroy said that he hopes that OOC serves as a model for future programs to address child soldiers, as well as other operations, as it showed how the U.S. military could use \"soft power, influence operations\" and other aspects of so-called \"irregular warfare\" to fight the problem. ==Filmmakers' comments on the documentary== Michael Mulroy describes Anthony's personal story as a \"success\" and \"extremely inspiring\". Mulroy says that Anthony was 14 years old when he did various military affairs in the Lord's Resistance Army (LRA), but then he was able to escape and integrate back into society, having also received the help he needed. Eric Oehlerich comments that through Anthony, we experience the realities of what happens to these children and how they were exploited. Oehlerich says that they know the situation these children are in and believes that they can have a strong impact on the exploited youth. ==All the Glimmering Stars== The story of Anthony and Florence Opoka was made into a book called All the Glimmering Stars based in part on the documentary. The book has received positive reviews, and a portion of the proceeds from the book goes to the nonprofit \"End Child Soldiering.\" A description of how the story came to light is told in the book \"Afterward\", written by Anthony Opoka. ==Publications== * * * * * * * * ==References== ===Notes=== ===Citations=== Category:2019 documentary movies Category:2019 movies Category:American documentary movies",
 "title": "My Star in the Sky"
}