{
 "id": "990923",
 "text": "Sony Pictures Kids Zone is the children's and family entertainment label owned by Sony Pictures Home Entertainment. ==History== Sony Music Video launched its Sony Kids' Music and Sony Kids' Video labels in February 1992 after months of planning under the banner SMV Children's Library. Artists signed to Sony Kids' Music at launch included Dan Crow, Tom Chapin, Tom Paxton, Kevin Roth, Rory, and Lois Young, who would all release product in the spring.(page 10) After Sony Music Video dissolved in October, Sony Kids' Music and Video were coordinated and marketed through Epic Records beginning in January 1993.(page 12) On May 22, 1993, Nickelodeon signed a long-term agreement with Epic Records as well.(page 10) On July 3, Sony Kids' Music and Video were merged as Sony Wonder; Sony Wonder's president Ted Green sought new strategic alliances like their one with Nickelodeon. On April 24, 1995, Children's Television Workshop entered a long-term agreement to distribute Sesame Street videos, music, and books through Sony Wonder, while Columbia Pictures began development on two Muppet films which would be released on video by Columbia TriStar Home Video. Sony Wonder also took over distribution of Random House Home Video titles, also during April. On July 29, Nickelodeon and Sony Wonder launched a Nick Jr. Channel Video with three titles based on Eureeka's Castle, Gullah Gullah Island, and Allegra's Window; an audio line launched on March 26, 1996. In 1996, two years after Viacom's acquisition of Paramount Communications, the owners of Paramount Pictures,During this period, two companies named Viacom have owned Paramount. The original Viacom owned the studio until 2006, when the new Viacom (spun off from the old one, which was renamed CBS Corporation) assumed ownership of Paramount, along with MTV Networks and BET Networks.) Sony Wonder's deal with Nickelodeon expired, leaving Nickelodeon and Nick Jr. videos and DVDs to be distributed by Paramount Home Video (and CIC Video internationally until 1999). On August 2, 1997, Sony Wonder entered a long-term worldwide joint venture with Together Again Video Productions to create and distribute new and previous Kidsongs titles, starting with 20 new episodes of The Kidsongs Television Show. On December 27, Sony Wonder and Golden Books Family Entertainment joined forces to release hit titles from Golden Books' catalog starting in spring 1998; the contract continued with Classic Media after they acquired Golden Books. The company was also the distributor (in Canada only) for series produced by Cinar, such as Wimzie's House, Madeline, A Bunch of Munsch, The Busy World of Richard Scarry and Caillou. On May 4, 1998, Sony Wonder bought Sunbow Entertainment, which had produced various shows based on Hasbro's toy lines but whose original programming had mostly under-performed. On March 1, 2000, Sony Wonder signed a first-look distribution agreement with German-based management firm TV-Loonland AG to handle the distribution of their shows in German-speaking and Eastern European territories. and eventually signed a UK home video deal with Maverick. On October 3, as an extention to the previous agreement, TV-Loonland purchased the television division of Sony Wonder, including its programming and ownership in Sunbow. As part of the deal, Sony kept the North American home video and international audio rights to its library.\"Broadcast\" 6 October 2000 TV-Loonland takes on Sony's Sunbow broadcastnow.co.uk, Retrieved on August 30, 2013 On May 14, 2008, Hasbro acquired the Sunbow programs based on its properties, which are now part of Hasbro Entertainment. In 2009, TV-Loonland filed for bankruptcy. In 2011, Loonland sold its catalogue to m4e AG. In February 2017, Studio 100 acquired a majority stake in m4e AG. Studio 100 currently holds the television rights to most of the Loonland catalogue, including Sunbow and Sony Wonder. On March 13, 2007, Sony BMG announced that it was shutting down Sony Wonder to focus on its core music business. However, on June 20, 2007, it was announced that Sony Wonder became a division of Sony Pictures Home Entertainment as its kids’- and family-entertainment label. Classic Media's, Sesame Workshop's and Random House's video deals were sold to Genius Products for an undisclosed amount, and later to Vivendi Entertainment. The home media releases to Caillou were moved to Vivendi Entertainment Canada. Since 2012, Caillou DVDs are distributed by Entertainment One and after their purchase of Phase 4 Films in 2014, are released through the KaBoom Entertainment label. Sesame Workshop's properties were moved to Warner Home Video in 2010 following the closure of Genius Products. As of 2018, Sesame Workshop’s properties are currently distributed by Shout! Factory through the Shout! Factory Kids label. In 2012, DreamWorks Animation acquired Classic Media for $155 million; the company became a unit of DreamWorks Animation and was renamed to DreamWorks Classics. Universal Pictures Home Entertainment, is the current distributor for Classic Media’s properties after NBCUniversal acquired DreamWorks Animation in 2016. In 2015, the Sony Wonder label was rebranded as Sony Pictures Family Fun, and was later folded and merged into Sony Pictures Kids Zone in 2020. The Sony Wonder label was still used for the direct-to-video The Swan Princess film series up until the same year. ==References== ==Other websites== *Official website Category:Sony",
 "title": "Sony Pictures Kids Zone"
}