{
 "id": "991098",
 "text": "Karl Adolf Verner (1846-1896) was a Danish linguist and a pioneer linguist in the study of phonetics. He was deeply interested in phonetic systems of the Indo-European languages. One of his linguistic fascinations was accentology. Verner was born in Denmark and studied at the University of Copenhagen, where he received his Ph.D. in 1867. He was a famous linguist. He never worked for any university as a professor. Some universities asked him to work as professor for them. He always refused and preferred his job in the library of Halle. In Halle, he met many young linguists from the University in Leipzig. Contacts with other linguists further directed him towards his linguistic future. Verner’s work and influence on linguistics was so important that people still study him and use his ideas for their own books and articles. His greatest contribution to linguistics is called Verner’s Law. The discovery of this law explained some issues with Grimm’s Law whose rules were not enough to explain all exceptions in the historical development of languages. == Early life == Karl Adolf Verner was born in Aarhus on 7 March 1846. He was the son of Friedrich Wilhelm Werner, a German immigrant whose occupation was a sock- weaver, and Catharina Dorothea Hansen. He had five brothers, and he was the second oldest of them. Verner obtained his secondary education at the Aarhus Cathedral School which he attended from 1857 to 1864. It was here that his interest in the field of linguistics started. It was in the city of Aarhus where he would later in his life come up with the discovery that would make him known worldwide. His interest in linguistics would form during his school years in the lessons of geography that he attended. Unlike many other geography teachers, Mr Erslev taught his students about linguistic and social aspects of life in the countries they covered. Mr Erslev treated his subject contrastively. Verner appreciated Erslev’s teaching a lot. It is possible to say that Verner’s contrastive linguistic method was born in his geography lessons. == University years == He could not continue chasing his academic dream due to economic instability and lack of capital. He sought employment as a librarian in order to gain money for his studies. He worked as a university librarian in Halle, Germany. Eventually, his hard work and determination led him to become a docent of Slavic philology at the University of Copenhagen ending with a professor title in 1888. In 1864 Karl Verner began studying Nordic languages at the University of Copenhagen under the supervision of Konráð Gíslason, Svend Grundtvig, and Ludvig Wimmer. He began mainly as a linguist and later his school activities and interests shifted toward the literary side.. Another shift in Verner’s language repertoire came with the influence of his teacher Professor Smith who motivated him to study Slavic languages. This became his specialisation. In 1872 he went to St. Petersburg as a student of Slavic studies. In Denmark he composed essays such as “An exception to the first sound shift” and “The final question”. They became the basis for his scientific glory. However, he could not continue chasing his academic dream due to economic instability and lack of capital. Therefore he sought employment as a librarian in order to gain money for his studies. He worked as a university librarian in Halle, Germany. Eventually, his hard work and determination led him to become a docent of Slavic philology at the University of Copenhagen ending with a professor title in 1888. == Verner as linguist == While attending the Aarhus Cathedral School, Verner already knew key linguistic texts such as those by Rasmus Rask or the Compendium der vergleichenden Grammatik der indogermanischen Sprachen by August Schleicher. He was given a scholarship that gave him the opportunity to study Kashubian, which is a dialect of Polish. He could go to the Dantzig area. Being truly devoted to linguistics, he spent a lot of time with the local people, listening to their accent (accentology was one of Verner’s lifelong fascinations) and then noting his observations about it. As he spoke to so many people, the local police thought he might be a foreign spy. So he had to go to the police station to testify. Since his passport was only in languages that nobody at the police station understood, Verner had to interpret for himself. When he showed the police a letter from a German professor proving he was a linguist, he was finally free to go. Verner’s best contribution to linguistics is known as Verner’s Law. This law explains certain sound changes in the Germanic languages. The Proto-Indo-European voiceless stops became voiced stops or fricatives in Proto-Germanic. In order to discover the principles of this law, Verner had to study other Indo-European languages. This principle was a major contribution to the understanding of sound change and the reconstruction of Proto-Indo-European, the hypothetical ancestor of the Indo-European languages. Verner made significant contributions to the field of phonetics, including the development of a system for noting the sounds of spoken languages. He published several books on linguistics, including Die Lautgesetze der indogermanischen Sprachen (The Sound Laws of the Indo-European Languages) and Die phonetische Lautlehre der indogermanischen Sprachen (The Phonetic Sound Doctrine of the Indo-European Languages). == References == Category:1846 births Category:1896 deaths Category:Danish scientists Category:Linguists Category:People from Aarhus",
 "title": "Karl Verner"
}