{
 "id": "99114",
 "text": "{{Infobox Settlement | official_name = Khyber Pakhtunkhwa | other_name = Afghania | native_name = صوبہ خیبر پختونخوا | nickname = | settlement_type = Province of Pakistan | motto = | image_skyline = Naran valley 1.jpg | imagesize = | image_caption = Road to Naran Valley. | image_flag = Flag of Khyber Pakhtunkhwa.svg | flag_size = | flag_link = | image_seal = Coat of arms of Khyber Pakhtunkhwa.svg | seal_size = | seal_link = | image_shield = | shield_size = | shield_link = | city_logo = | citylogo_size = | logo_link = | image_map = Khyber Pakhtunkhwa in Pakistan (claims hatched).svg | mapsize = | map_caption = Location of Khyber Pakhtunkhwa in Pakistan | image_map1 = Pakistan Khyber Pakhtunkhwa location map.svg | mapsize1 = | map_caption1 = Map of Khyber Pakhtunkhwa | image_dot_map = | dot_mapsize = | dot_map_caption = | dot_x = | dot_y = | pushpin_map = | pushpin_label_position = | pushpin_map_caption = | pushpin_mapsize = | subdivision_type = Country | subdivision_name = | subdivision_type1 = Region | subdivision_name1 = | subdivision_type3 = | subdivision_name3 = | subdivision_type4 = | subdivision_name4 = | government_footnotes = | government_type = | leader_title = Governor | leader_name = | leader_title1 = Chief Minister | leader_name1 = | leader_title2 = Legislature | leader_name2 = Unicameral (? seats) | leader_title3 = | leader_name3 = | leader_title4 = | leader_name4 = | established_title = Established | established_date = 1 July 1972 | established_title2 = | established_date2 = | established_title3 = | established_date3 = | area_magnitude = | unit_pref = | area_footnotes = | area_total_km2 = 74,521 | area_land_km2 = | area_water_km2 = | area_total_sq_mi = | area_land_sq_mi = | area_water_sq_mi = | area_water_percent = | area_urban_km2 = | area_urban_sq_mi = | area_metro_km2 = | area_metro_sq_mi = | area_blank1_title = | area_blank1_km2 = | area_blank1_sq_mi = | population_as_of = 2012 | population_footnotes = | population_note = | population_total = 20,215,000 | population_density_km2 = | population_density_sq_mi = | population_metro = | population_density_metro_km2 = | population_density_metro_sq_mi = | population_urban = | population_density_urban_km2 = | population_density_urban_sq_mi = | population_blank1_title = | population_blank1 = | population_density_blank1_km2 = | population_density_blank1_sq_mi = | population_demonym = | timezone = PST | utc_offset = +05:00 | timezone_DST = | utc_offset_DST = | coordinates = | elevation_footnotes = | elevation_m = | elevation_ft = | postal_code_type = | postal_code = | area_code = | blank_name = Official languages | blank_info = PashtoPanjabiUrdu | blank1_name = | blank1_info = | website = khyberpakhtunkhwa.gov.pk | footnotes = }} Khyber Pakhtunkhwa () is a province in northwest Pakistan. The capital is Peshawar and it has a population of 14 million people and an area of 28,773 mi² or (74,521 km²). The province was created in 1901 during British rule when it was separated from a Punjab province of the British India Empire. A referendum was held in the North West Frontier Province on 2 July 1947. The majority of voters wanted to join with Pakistan, with only a very small number voting to join with India. The province became a part of Pakistan, because of this referendum. Khyber Pakhtunkhwa is divided into 26 districts. There are 21 Settled Area Districts and 5 Provincially Administered Tribal Areas (PATA) Districts. The administration of the PATA districts is the responsibility the President of Pakistan and the Governor of Khyber Pakhtunkhwa. ==Names of Khyber Pakhtunkhwa== For over a hundred years from its founding as a province of British India in 1901, it was known as the North-West Frontier Province. Afghania is another name long considered as a replacement for North-West Frontier Province.Zeeshan Haider. \"Islamists want Pakistan province renamed 'Afghania'.\" Reuters. 1 August 2007. Retrieved 1 April 2010.\"No end in sight to ANP-PML-N row over NWFP renaming.\" One Pakistan. 28 January 2010. Retrieved 15 April 2010. It was proposed first by the founding leaders of the Muslim League in 1933 and was at least partly chosen to represent the first \"a\" in \"Pakistan. In 2010 it was renamed. Pakhtunkhwa (and the other transliteration variants) is derived from Pakhtun and khwa, the former refers to the ethnic group and the latter literally means \"heart\". == Geography == Khyber Pakhtunkhwa sits primarily on the Iranian plateau and comprises the junction where the slopes of the Hindu Kush mountains on the Eurasian plate give way to the Indus-watered hills approaching South-central Asia. This situation has led to seismic activity in the past. The famous Khyber Pass links the province to Afghanistan, while the Kohalla Bridge in Circle Bakote Abbottabad is a major crossing point over the Jhelum River in the east. The province has an area of 28,773 mi² or (74,521 km²) -- comparable in size to New England in North America. Peshawar, Mardan, Kohat, Abbottabad, Dera Ismail Khan and Hangu are the main cities. It borders on Afghanistan. The region varies in topography from dry rocky areas in the south to forests and green plains in the north. The climate can be extreme with intensely hot summers to freezing cold winters. Despite these extremes in weather, agriculture remains important and viable in the area. The hilly terrain of Kalam, Upper Dir, Swat, Naran and Kaghan is renowned for its beauty and attracts a great many tourists from neighboring regions and from around the world. Swat is popular among tourists as the \"Switzerland of South Asia\" as there are many landscape similarities between it and the mountainous terrain of Switzerland. Geographically the province could be divided into two zones: the northern one extending from the ranges of the Hindu Kush to the borders of Peshawar basin and the southern one extending from Peshawar to the Derajat basin. The northern zone is cold and snowy in winters with heavy rainfall and pleasant summers with the exception of Peshawar basin, which is hot in summer and cold in winter. It has moderate rainfall. The southern zone is arid with hot summers and relatively cold winters and scanty rainfall. The major rivers that cross through the province are the Kabul, Swat, Chitral, Kunar, Siran, Panjgora, Bara, Kurram, Dor, Haroo, Gomal and Zhob. Its snow-capped peaks and lush green valleys of unusual beauty have enormous potential for tourism. == Demographics == According to the 1998 census, the population of the province was approximately 20 million, of whom 52% are males and 48% are females. The density of population is 187 per km² and the intercensal change of population is of about 30%. ===languages=== In KPK about 70% of the people are Pashtuns and they speak Pashto as a first language. Other widely spoken languages are Kalami, Chitrali, Kohistani, and Yidgha. Panjabi is understood by majority of the people. == Government == Provincial symbols of KPK (unofficial) Provincial flag Flag of Khyber Pakhtunkhwa Provincial seal Emblem of Khyber Pakhtunkhwa Provincial animal Kabul markhor Provincial bird White-crested Kalij pheasant Provincial fish Brown trout Provincial tree Afghan pine tree Provincial flower Lady's tulip Provincial fruit Plum Provincial dish Pilau rice Provincial dance Attan dance Provincial instrument Rubab Provincial sport Pashtun Archery The President of Pakistan appoints a Governor as head of the provincial government of Khyber Pakhtunkhwa. There is a directly-elected Provincial Assembly, which has 124 elected members (including 22 seats reserved for women and 3 seats for non-Muslims). The Provincial Assembly elects a Chief Minister to act as the chief executive of the province, assisted by a cabinet of ministers. ==Related pages== * Government of Khyber Pakhtunkhwa ==References== Category:1972 establishments in Asia",
 "title": "Khyber Pakhtunkhwa"
}