{
 "id": "991279",
 "text": "Kerry Condon (born 9 January 1983) is an Irish actress. She played Octavia of the Julii in Rome (2005–2007), Stacey Ehrmantraut in Better Call Saul (2015–2022), and has voiced F.R.I.D.A.Y. for the Marvel Cinematic Universe. Her role in the 2022 movie The Banshees of Inisherin, earned her a nomination for the Academy Award for Best Supporting Actress and won her the BAFTA Award for Best Actress in a Supporting Role. == Awards and nominations == Year Award Category Work Result Boston Online Film Critics Association Best Supporting Actress The Banshees of Inisherin Boston Society of Film Critics Best Supporting Actress Chicago Film Critics Association Best Supporting Actress Dallas–Fort Worth Film Critics Association Best Supporting Actress Dublin Film Critics Circle Best Actress Florida Film Critics Circle Best Supporting Actress Greater Western New York Film Critics Association Best Supporting Actress Indiana Film Journalists Association Best Supporting Performance Las Vegas Film Critics Society Best Supporting Actress North Texas Film Critics Association Best Supporting Actress Phoenix Critics Circle Best Supporting Actress Phoenix Film Critics Society Best Supporting Actress Southeastern Film Critics Association Best Supporting Actress St. Louis Gateway Film Critics Association Best Supporting Actress UK Film Critics Association Supporting Actress of the Year Utah Film Critics Association Best Supporting Actress Washington D.C. Area Film Critics Association Best Supporting Actress AACTA International Awards Best Supporting Actress Academy Awards Best Supporting Actress Alliance of Women Film Journalists Best Supporting Actress Austin Film Critics Association Best Supporting Actress British Academy Film Awards Best Supporting Actress Chicago Indie Critics Best Supporting Actress Chlotrudis Awards Best Supporting Actress Columbus Film Critics Association Best Supporting Performance Critics' Choice Movie Awards Best Supporting Actress Denver Film Critics Society Best Supporting Actress DiscussingFilm Critic Awards Best Supporting Actress Georgia Film Critics Association Best Supporting Actress Gold Derby Film Awards Best Supporting Actress Golden Globe Awards Best Supporting Actress Hawaii Film Critics Society Best Supporting Actress Hollywood Film Critics Association Best Supporting Actress Houston Film Critics Society Best Supporting Actress International Cinephile Society Best Supporting Actress Iowa Film Critics Association Best Supporting Actress Latino Entertainment Journalists Association Best Supporting Actress London Film Critics' Circle Supporting Actress of the Year Minnesota Film Critics Alliance Best Supporting Actress Music City Film Critics Association Best Supporting Actress National Society of Film Critics Best Supporting Actress North Carolina Film Critics Association Best Supporting Actress North Dakota Film Society Best Supporting Actress Online Film Critics Society Best Supporting Actress Online Film and Television Association Best Supporting Actress San Diego Film Critics Society Best Supporting Actress San Francisco Bay Area Film Critics Circle Best Supporting Actress Satellite Awards Best Supporting Actress Screen Actors Guild Awards Best Supporting Actress Seattle Film Critics Society Best Supporting Actress Vancouver Film Critics Circle Best Supporting Actress ==References== Category:BAFTA Award winning actors Category:1983 births Category:Living people Category:Irish movie actors Category:Irish stage actors Category:Irish television actors Category:Irish voice actors",
 "title": "Kerry Condon"
}