{
 "id": "991274",
 "text": "Universal Credit is part of the United Kingdom Social Security system. It was started in 2013 to replace six benefits for working-age people with a low income: income-related Employment and Support Allowance, income-based Jobseeker's Allowance, Income Support, Child Tax Credit, Working Tax Credit and Housing Benefit. Like them it is means tested. It is paid to families once a month and is designed to help people to work as much as they can. People under 25 get less. An extra amount is paid for children, but only for 2 unless they were born before 6 April 2017, are adopted or are born as part of a multiple birth. Extra money is paid for disabled people, disabled children and carers. According to the New Economics Foundation the rates of benefit were not sufficient to meet the minimum income standard calculated by Loughborough University’s Centre for Research in Social Policy in April 2023. People who are working can claim back up to 85% of their childcare costs. People who are responsible for a child or young person or living with a disability or health condition that affects their ability to work get a ‘work allowance’. Each £1 earned (above the monthly work allowance if there is one) reduces the payment by 55p. Universal Credit is paid monthly. People who are paid 4 weekly will get 2 sets of wages in one assessment period once a year, which will reduce their Universal Credit payment. There is money for rent and some service charges. This is called the housing element. In every area there is a Local Housing Allowance for people renting private property. Help is limited to this level. It was set at the rent of one of the cheapest 30% of homes in the area in 2012. There are different levels for homes with different numbers of bedrooms. It was increased in September 2019 but since then in many places rents have risen more than the allowance. Two-thirds of lower income privately renting households have to find at least a quarter of their rent. People who are able to work must look for work or increase their earnings or their payment may be reduced. Self employed people are generally given a minimum income floor. This is treated as their income each month that their reported income is less. Claims are generally made and managed online. People can go to Jobcentre Plus offices where their claims are managed. Citizens Advice are paid by the government to help people to claim. 5.7 million people were getting Universal Credit in July 2022. 30% were not required to work. Half the households had children. The average monthly payment was £810. == References == Category:Social security in the United Kingdom",
 "title": "Universal Credit"
}