{
 "id": "991290",
 "text": "The Fabelmans is a 2022 American coming-of-age drama movie directed by Steven Spielberg, who co-wrote and co-produced it with Tony Kushner. The movie is a bit of an autobiographical story based on Spielberg's early years and first years as a filmmaker. It stars Gabriel LaBelle as Sammy, alongside Michelle Williams, Paul Dano, Seth Rogen, and Judd Hirsch. The movie is dedicated to the memories of Spielberg's real-life parents Leah Adler and Arnold Spielberg. The movie received seven nominations at the 95th Academy Awards, including Best Picture, Best Original Screenplay, Best Director for Spielberg, Best Actress for Williams, Best Supporting Actor for Hirsch. It also earned five nominations at the 80th Golden Globe Awards in 2023, winning Best Motion Picture – Drama and Best Director for Spielberg. ==Awards and nominations== Award Year Category Work Result Ref. Atlanta Film Critics Circle Best Breakthrough Performer The Fabelmans Columbus Film Critics Association Breakthrough Film Artist The Fabelmans Critics' Choice Movie Awards Best Young Actor/Actress The Fabelmans DiscussingFilm Critics Awards Best Breakthrough Performance The Fabelmans Dorian Film Awards Rising Star of the Year The Fabelmans Georgia Film Critics Association Breakthrough Award The Fabelmans Gold Derby Film Awards Best Breakthrough Performer The Fabelmans Hollywood Critics Association Star on the Rise Award The Fabelmans International Cinephile Society Best Breakthrough Performance The Fabelmans Las Vegas Film Critics Society Best Actor The Fabelmans Best Male Youth Performance The Fabelmans Minnesota Film Critics Alliance Best Actor The Fabelmans Music City Film Critics Association Best Young Actor The Fabelmans National Board of Review Breakthrough Performance The Fabelmans North Carolina Film Critics Association Best Breakthrough Performance The Fabelmans North Texas Film Critics Association Best Newcomer The Fabelmans Online Film and Television Association Best Breakthrough Performance: Male The Fabelmans Phoenix Critics Circle Best Actor The Fabelmans San Diego Film Critics Society Best Actor The Fabelmans Satellite Awards Best Actor in a Motion Picture, Drama The Fabelmans Washington D.C. Area Film Critics Association Best Youth Performance The Fabelmans == References == Category:2022 drama movies Category:American drama movies Category:Golden Globe Award winning movies Category:Movies directed by Steven Spielberg Category:Movies composed by John Williams Category:Movies set in Arizona Category:Movies set in Los Angeles Category:Movies set in New Jersey Category:Movies set in the 1950s Category:Movies set in the 1960s Category:Movies about friendship Category:Movies about siblings Category:Movies about tornadoes Category:Movies about dysfunctional families Category:Universal Pictures movies",
 "title": "The Fabelmans"
}