{
 "id": "99137",
 "text": "Lower Dir ( ，) is one of the 27 districts in the Khyber Pakhtunkhwa province of Pakistan. It is in the north-western part of the province and has an area of 1583 square kilometers. Timergara city is the district headquarters and largest city. It used to be one district named Dir but in 1996 it was divided into two, Upper Dir and Lower Dir.The population of lower dir is mainly Yousafzai pashtoon including Clans (khadagzai, Adenzai , Malizai) and partly utmankhel tribe. == History == At the time of Pakistan's independence in 1947, Dir was a princely state ruled by Nawab Shah Jehan Khan. It was merged in Pakistan in 1969 and later on declared a district in 1970. Later on in 1996 it was divided into Lower Dir and Upper Dir. == Geography == Some of Dir is mountainous with peaks rising to 5000 meters. == Demographics == The population of the Lower Dir district was 797,852 according to the 1998 census report. The population of Dir Lower was predicted to be 1.037.091 in 2005. == Administration == Lower Dir is divided into seven Tehsils which contain a total of 41 union councils. Tehsil Union councils Adenzai Asbanr, Badwan, Chakdara, Khadagzai,Tazagram, Khanpur, Kotigram, Ouch Balambat Balambat, Hayaserai, Lajbook, Munjai, Koto, Rabat Khall khall ,khall Shalfalam, Tormang-1, Tormang-ii,Sultan Khel. Lal Qila Maidan Bishgram, Lal Qilla, Gall Maidan, Kotkai (Maidan), Zaimdara, Munda Khazana, Mia Kalai, Munda, Samar Bagh Darangai, Kambat, Mayar, Maskini, Sadbar Kali, Samar Bagh Timergara Bagh Dush Khel, Bandagai, Khungai, Malak Abad Ghara, Noora Khel, Shahi Khel Ziarat Talash, Timergara (Urban) === National Assembly === This district is represented by two elected MNA's (Member of National Assembly) in Pakistan National Assembly. Its constituencies are NA-6 & 7. Member of National Assembly Party Affiliation Year Qazi Hussain Ahmad Muttahida Majlis-e-Amal 2002 Maulana Ahmad Ghafoor Ghawas Muttahida Majlis-e-Amal 2003 Malak Azmat Khan Pakistan Peoples Party 2008 Shahib Zada Muhammad Yaqub Jamaat-e-Islami Pakistan 2013 Mahboob Shah Pakistan Tehrik Insaf 2018 Bashir Khan Pakistan Tehrik Insaf 2018 Qazi Hussain Ahmad won the general elections in 2002 but he left the seat as he had also won from his native constituency. Therefore, in January 2003 another election was held. === Provincial Assembly === The district is represented by five elected MPAs in the provincial assembly. * PK-13 (Lower Dir-I) * PK-14 (Lower Dir-II) * PK-15 (Lower Dir-III) * PK-16 (Lower Dir-IV) * PK-17 (Lower Dir-V) ==Related pages== * Upper Dir District * Swat District ==References==",
 "title": "Lower Dir District"
}