{
 "id": "991429",
 "text": "Rudolphina Menzel (March 1, 1891–1973) was an Austrian-Jewish cynologist, or dog expert, and dog breeder. She created the dog breed called the Canaan dog.American Kennel Club. (2017) The New Complete Dog Book: Official Breed Standards and Profiles for Over 200 Breeds. United States: Fox Chapel Publishing. p. 769. She founded the Palestinian Kennel Club (now the Israeli Kennel Club).Ackerman-Lieberman, Phillip Isaac and Rakefet Zalashik (2013). A Jew's Best Friend? The Image of the Dog Throughout Jewish History. United Kingdom: Sussex Academic Press. == Early life == Menzel has been fascinated with dogs ever since she got bitten when she was four years old. She rescued stray dogs from the streets but her parents consider dogs dirty and would not allow them in the house. She gave her allowance to her neighbors to take care of the stray dogs she rescued. == Career == At their villa in the 1920’s the Menzels founded a dog training school. There Menzel and her husband studied dogs. Menzel trained common military breeds like German Shepards, Doberman pinschers, and Boxers. She trained dogs to offer protection. She trained dogs for the German police and the German army. She specifically used Hebrew commands. Menzel Bred her own dog called the Canaan dog. They were first found in the Israel Kennel club in 1953. Caanan dogs were bred from Pariah Dogs German Shepherds, Doberman Pinschers, and Boxers.GOLAN, P. (2018, April 4). Canaan canines: Leaving on a one-way ticket to Italy - The top authority on Israel's national dog, Myrna Shiboleth, continues her work in Italy. Jerusalem Post, The: Web Edition Articles (Israel). Available from NewsBank: Access World News – Historical and Current Menzel knew that dogs were used by police in Europe to hurt Jewish people. She was sad that Jewish people had become scared of dogs. Her goal for breeding dogs in Palestine was to bridge between the Jewish people and dogs. Menzel’s dogs can track and carry sent and messages over many kilometers. Menzel created the breed known as \"Israel's national dog.\" == References == Category:1891 births Category:1973 deaths Category:Austrian Jews Category:Austrian people",
 "title": "Rudolphina Menzel"
}