{
 "id": "991532",
 "text": "Alha was a legendary general of the Chandel king Paramardideva (also known as Parmal), who fought Prithviraj Chauhan in 1182 CE, immortalised in the Alha- Khand ballad. ==Origin== Alha and Udal were children of the Dasraj, a successful commander of the Chandel king Parmal. They belonged to the Banaphar clan. According to the Bhavishya Purana, Alha's mother, Devaki, was a member of the Ahir caste and father a Bananaphar Rajput due to which the other Rajput warriors used slangs for Alha and Udal. Purana states that Mahil, an enemy of Alha and Udal said that Alha has come to be of a different family (kule htnatvamagatah) because his mother is an Ahir thus, they’re aren’t pure blood Rajputs. The Bhavishya Purana says that when Mahpati (Mahil) states that Ahlada (Alha) has come to be of \"low family\" (kule hinatvamagatah), it is because his mother is an Aryabhiri: meaning “Aryan Ahir\" Here, however there is another frictional story foundational and told not at this point in Alhda's courtship but in connection with his mother's own marriage. The two maidens are indeed Ahiris, daughters of Gopalak (cowherd) king Dalvahana and accustomed to daily tethering of buffaloes. They seize two buffaloes not in forest but in front of many kings during great Chandika homa performed by their father, when the assembled kings themselves find the buffaloes too much to handle. Dalvahana, at the command of Durga, then gives the older daughter Devaki (Devi) to Desaraja (Dasraj) and the younger daughter Brahmi to Vatsaraja (Bachraj). The Bhavishya Purana further adds that it is not only the mothers of Alha and Udal but their paternal grandmother from Baksar were also Ahir, who entered the family with a blessing of Devi chandika that come not from wrestling buffaloes but from her nine-year vow to the nine Durgas and hence were natural relatives of the family. Some of this checks out with the Elliot's Alha, where the gopalaka King Dalvahana is called Dalpat, King of Gwalior. he is still the two girl's father, but merely gives them to Dasraj who was an Ahir and Bachraj when Parmal requested him. The Queen Malhna insists that King Parmal reward Dashraj and Bachraj with brides from within the Chandel land. King Dalpat of Gwalior volunteers his daughters Devi (Devaki, Alha's mother) and Birma Udal's mother. Queen Malhna welcomes Devi to Mahoba by placing the nine lakh chain (Naulakha Haar) around her neck and also gives Birma a necklace. King Parmal then gives new Banaphar families a village where they bear and raise their sons named Alha and Udal. == References == Category:Yadav",
 "title": "Alha"
}