{
 "id": "991593",
 "text": "Disability Living Allowance (DLA) is a Social Security benefit for disabled people in the United Kingdom. It was started in 1992, joining Mobility Allowance and Attendance Allowance into one benefit for people under 65 with two new lower rates of benefit. Since 2013 it is only for children under sixteen. After that age disabled people have to claim Personal Independence Payment. The Scottish Government started a new benefit for disabled children In November 2021, called Child Disability Payment. In February 2022 there were about 1,349,000 children getting Disability Living Allowance, including those in Scotland. There are two parts of the benefit - care and mobility. The care part has three rates. For the lowest rate, £24.45, the child must need help with their bodily functions for some of the day. Bodily functions includes things like washing and dressing, eating, using the toilet, talking and listening. For the middle rate, £61.85, they must need frequent help all through the day, or watching to avoid danger to themselves or other people. Or they must need a lot of help during the night, or need a person to be awake and watch over them at night. A child who meets both day and night conditions gets the highest rate, £92.40. The mobility (walking) part has two rates. To get the high rate, £64.50, the child must be unable to walk, or only able to walk for a very limited distance, or at a limited speed or manner. Children who are blind or have no feet qualify. A child who has intelligence and behaviour problems so that they cannot be left alone can get the high mobility rate, if they get the highest rate of care. If they get the high rate it can be used to get a car or wheelchair from Motability. To get the lower mobility rate, £24.45, they have to show that they need to be guided or watched most of the time. Rates are for 2022-3. The help the child needs must be more than a normal child of their age needs. ==References== Category:Social security in the United Kingdom Category:Disability",
 "title": "Disability Living Allowance"
}