{
 "id": "991503",
 "text": "Reza Mirkarimi (; born 27 January 1967) is an Iranian screenwriter and film director. He was also director of Fajr International Film Festival which is the most important Iranian film festival. == Career == Reza Mirkarimi graduated from Fine Arts faculty of University of Tehran in graphic arts in Tehran. His film career started in 1987 with a short film named For Him (16mm camera). He then directed a series of short films and two TV series aimed at young people. His 1999 first feature, The Child and The Soldier, has won several national and international awards, including the ”Golden Butterfly” at the 1999 Isfahan International Children and Youth Film Festival, Iran and the \"Montgolfiere d'Argent” at the Festival of 3 Continents, Nantes, France, in 2000. This film also won \"Golden Shoe\" at the \"Children and Teenagers Film Festival\" in Zelin, Croatia, in 2001. The Child and The Soldier, was released in France in 2001. In 2000 he directed his second feature, Under the Moonlight. It is about social and religious issues in modern Iran. It won the Best Feature Award at the 40th Critics' Week at the 2001 Cannes International Film Festival. The film also won the Best Director's Award as well as the Special Jury Prize at the Tokyo IFF in 2001, and the Golden Peacock Award at the International Film Festival of India. His fourth and fifth feature films, As Simple as That (2007) and Daughter (2016), won the Golden George Award for the Best Picture at the 30th and the 38th Moscow International Film Festival respectively. He also contributes to young Iranian directors by producing their films. He has produced Don't be Tired in 2012 and _Voice of Silence_ in 2013. His latest film, Castle of Dreams (2019), won three awards at Shanghai International Film Festival. These awards were the best picture, the best director, and the best actor. Mirkarimi has so far won seven Golden Simorgh awards at Fajr International Film Festival. Three of his films have been presented by Iran for the Best Foreign Language Film Oscar: So Close, So Far, A Cube of Sugar, and Today. He has also served as jury of several international film festival. These festivals include Black Nights Film Festival (Estonia), Tokyo International Film Festival (Japan), Carthage Film Festival (Tunisia), Bogota International Film Festival (Colombia), Golden Apricot – Yerevan International Film Festival (Armenia). He was jury president at the 39th Moscow International Film Festival. He has also served as managing director of Khane-ye Cinema (Iranian Alliance of Motion Picture Guilds). Reza Mirkarimi has been director of Fajr International Film Festival for four years from 2016 to 2019. == Filmography == Year Name Transliteration Award 2000 The Child And The Soldier Koodak va Sarbaz Nominated Grand Prix des Amériques Montréal World Film Festival 2000 Silver Montgolfiere Three Continents Festival 2000 Special Mention Three Continents Festival 2000 Young Audience Award Three Continents Festival 2000 Honor Diploma for Best Director Fajr International Film Festival 2000 Silver Balloon Three Continents Festival 2000 Golden Shoe Zlín Film Festival 2001 2001 Under The Moonlight Zir-e Noor-e Maah International Jury Award São Paulo International Film Festival 2001 Best Director Award tied with Gjergj Xhuvani for Slogans Tokyo International Film Festival 2001 Special Jury Prize Beirut International Film Festival 2001 Special Jury Prize Tokyo International Film Festival 2001 Special Jury Award Fajr International Film Festival 2001 Critics Week Grand Prize Cannes Film Festival 2001 Silver Peacock Special Prize of Jury Delhi International Film Festival 2002 2002 Here Is A Shining Light Inja Cheraghi Roshan Ast Best Screenplay Asia- Pacific Film Festival 2002 Crystal Simorgh Best Director Fajr International Film Festival 2003 Special Jury Prize Bali International Film Festival 2004 2005 So Close, So Far Kheili Dour, Kheili Nazdik Crystal Simorgh National Competition - Best Film Fajr International Film Festival 2005 Best Film Award House of Cinema 2005 2008 As Simple as That Be Hamin Sadegi Golden St. George 30th Moscow International Film Festival 2008 Russian Guild of Film Critics Award, International Competition Moscow International Film Festival 2008 Crystal Simorgh Competition of Asian Cinema - Best Screenplay with Shadmehr Rastin Fajr International Film Festival 2008 Crystal Simorgh Competition of Asian Cinema - Best Director Fajr International Film Festival 2008 2011 A Cube of Sugar Yek Habe Ghand Special Jury Prize Kazan International Festival of Muslim Cinema 2012 Best Film Ibn Arabi International Film Festival 2012 Best Film Kazan International Festival of Muslim Cinema 2013 2014 Today Emrooz Best Film Award Rabat International Film Festival 2014 Ecumenical Jury Prize Tallinn Black Nights Film Festival 2015 FIPRESCI Prize Tallinn Black Nights Film Festival 2015 Audience Award and Bronze Alhambra Cines del Sur 2015 Spirituality Section Award Dhaka International Film Festival 2016 2016 Daughter Dokhtar Crystal Simorgh National Competition - Best Original Score Fajr International Film Festival 2016 Golden St. George for Best Film Moscow International Film Festival 2016 Russian Film Clubs Federation Award for Best Film 2016 Nominated Crystal Simorgh for Best Film and Best Director Fajr International Film Festival 2016 Golden Peacock Award for the Best Film International Film Festival of India 2016 2019 Castle of Dreams Ghasr-e Shirin Golden Goblet Award for Best Feature Film Shanghai International Film Festival 2019 Golden Goblet Award for Best Director Shanghai International Film Festival 2019 Best Director International Antalya Film Festival 2019 2022 The Night Guardian Negahban-e Shab Crystal Simorgh National Competition - Best Director 40th Fajr Film Festival 2022 === Short Film === * Baraye Ou (For Him) - 1987 * Yek Rooze Barani (A Rainy Day) - 1987 * Khoroos (Rooster) - 1987 === Documentary === * Iranian Carpet - 2006 === Tv Series === * Majara-haye Aftaab va Aziz Khanoom (The Tales of Aftaab and Lady Aziz) - 1996 * Bache-haye Madreseye Hemmat (Hemmat School Kids) - 1997 == Accolades == In 2021 he was selected as Jury Chairman for Kim Jiseok Award in 26th Busan International Film Festival. === Awards === * 2019 - Golden Goblet Award for Best Feature Film Shanghai International Film Festival * 2019 - Golden Goblet Award for Best Director Shanghai International Film Festival 2019 * 2019 - Best Director Antalya Golden Orange Film Festival == References == == Other websites == * Official Website * * Reza Mirkarimi at Iranactor.com Category:Living people Category:1967 births Category:People from Tehran Category:Iranian movie directors Category:Articles with hCards",
 "title": "Reza Mirkarimi"
}