{
 "id": "991576",
 "text": "Carers Allowance is a Social Security benefit for people in the United Kingdom who care for disabled people but are not paid to do so. It was started as Invalid Care Allowance in 1976, and married women were not eligible then. The European Court in 1986 decided that this was unlawful sexual discrimination and the law was changed. To qualify a person must show that they care for a disabled person for at least 35 hours a week. There is no definition of caring. Only one person can claim to care for each disabled person. The disabled person must be getting one of these benefits: * middle or highest rate Disability Living Allowance care component; * Attendance Allowance * Personal Independence Payment daily living component (either rate); * Constant Attendance Allowance at or above the normal maximum rate with an Industrial Injuries Disablement Benefit, or basic (full day) rate with a War Disablement Pension; * Armed Forces Independence Payment * the middle or higher rate of Child Disability Payment (Scotland) * the daily living component of Adult Disability Payment (Scotland). The weekly payment is £69.70 per week from April 2022 to 2023. It is taxable and counts as earned income. This is less than most other benefits. People under 16, in full-time education, or or getting a State Pension cannot get it. A person cannot get it if they earn more than £132 per week (after deductions including tax, national insurance and certain expenses) They can claim Universal Credit and will get extra as a carer. There is no earnings limit for carers on Universal Credit. About 5 million people said in the 2021 census that they were unpaid carers. Only 977,506 claimed Carer's Allowance in 2022, according to Carer's UK. in a 2023 survey 41% had to give up paid work completely. 23% had reduced the hours they worked. 14% were using food banks. More of the people getting Carer’s Allowance said they were struggling to make ends meet than those who weren't. == References == Category:Social security in the United Kingdom",
 "title": "Carer's Allowance"
}