{
 "id": "991600",
 "text": "{{Infobox writer | name = James Schuyler | image = | image_size = | birth_date = | birth_place = Chicago, Illinois, U.S. | death_date = | death_place = New York, New York, U.S. | notableworks = The Morning of the Poem | movement = The New York School | resting_place = Little Portion Friary Cemetery, Mount Sinai, New York, U.S. | occupation = Poet | alma_mater = Bethany College (WV) }} James Marcus Schuyler (November 9, 1923 – April 12, 1991) was an American poet, art critic, and novelist. Schuyler was born in Chicago and grew up in East Aurora, New York. He went to college at Bethany College in West Virginia from 1941 to 1943. Then he joined the U. S. Navy. In 1947, he moved to the Isle of Ischia in Italy for two years. He lived in the rented house of poet W. H. Auden and was his secretary. He moved to New York City in 1950. He shared an apartment with his friends, the poets Frank O’Hara and John Ashbery. He wrote about art for the magazine Art News. At the Museum of Modern Art, he organized travelling art shows. He became friends with painters Fairfield Porter, Willem de Kooning, Elaine de Kooning, Jane Freilicher, and Larry Rivers. Schuyler's first important poetry book, Freely Espousing, came out in 1969 when he was 46. He won the Pulitzer Prize for Poetry in 1981 for The Morning of the Poem. He also received a Guggenheim Fellowship in 1981, and a Fellowship from the American Academy of Poets in 1983. Along with his friends O'Hara, Ashbery, Barbara Guest, and Kenneth Koch, he was part of what was called The New York School of poets. Schuyler died in New York City in 1991. He is buried in Suffolk County, Long Island, New York. ==Books== *Alfred and Guinevere (1958) novel *Salute (1960) *May 24th or So (1966) *Freely Espousing (1969) *A Nest of Ninnies (with John Ashbery) (1969) novel *The Crystal Lithium (1972) *Hymn to Life (1974) *What’s for Dinner (1978) novel *The Morning of the Poem (1980) *A Few Days (1985) == Related pages == *List of poets from North America ==Other websites== *James Schuyler at PennSound ==References== Category:1923 births Category:1991 deaths Category:American novelists Category:American poets Category:LGBT poets Category:LGBT novelists Category:American art critics",
 "title": "James Schuyler"
}