{
 "id": "991644",
 "text": "National Insurance was the beginning of the welfare state in the United Kingdom. It was started by the National Insurance Act 1911. The idea of insurance was attractive to Lloyd George because it kept individual responsibility. In Britain there were flat rate contributions and flat rate benefits. In Europe both contributions and benefits were generally relative to the workers normal pay. It has changed a great deal since then. In 1912 the workers who paid their National Insurance could visit a General practitioner and get medicine they were prescribed without paying. But this did not include their families. \\--------People are given a National Insurance number, often called a NINo, when they are 16. They must have this to get work. Workers make regular payments calculated as a fraction of their pay. The payments are collected and recorded by HM Revenue and Customs. Until 1973 people had a card for each year with stamps to show they had paid. After that it was joined to the system for collecting income tax. They can then get benefits when they cannot work. ==Contributions== People over retirement age do not pay. There are four sort of contributions (payments). Class 1 contributions are paid by employers and their workers. Nothing is paid by people who earn less than £123 a week. Between £123 and £242 a week workers get a credit but dont pay. Between £242 and £967 a week workers pay 12%. Over £175 a week employers pay 13.8% (including for people over retirement age). Class 2 contributions are £3 a week paid by self-employed people. Class 3 contributions are voluntary, People pay to improve their contribution record, usually to protect their pension. Class 4 contributions are paid by self-employed people as a portion of their profits. People who cannot work for some reason may get NI credits, usually when claiming benefits. ==Benefits== The benefits with a contribution condition: *Bereavement benefit *Employment and Support Allowance *Jobseeker's Allowance *Statutory Sick Pay *UK State Pension == References == Category:Taxation in the United Kingdom Category:Social security in the United Kingdom",
 "title": "National Insurance"
}