{
 "id": "991875",
 "text": "George Sear (born 14 November 1997) is a British television and film actor known for playing Benji in the Hulu series Love, Victor; a spin-off of the 2018 film Love, Simon. == Life and career == Sear was born in Southend-on-Sea in Essex, England on 14 November 1997 to parents Simon Sear and BBC celebrity baking expert Juliet Sear. His first television appearance was in 2009 in the ITV Series The Bill in which he played the character Noah Morris. George also played the leading role of Seb Crossley in the Disney Channel series The Evermoor Chronicles from 2014 to 2016. His most recent and well-known role so far is that of Benji in the Hulu Series Love, Victor, where he stars as the love interest of lead character Victor Salazar, played by co-star Michael Cimino. The spin-off series from the film Love, Simon focuses on Victor; a latinx teen who has to deal with adjusting to a new city and school, while struggling with his identity surrounding his sexual orientation after coming to the realization that he is developing a crush on his fellow classmate Benji. == Filmography == === Movies === Year Title Role 2019 When Fate Calls (Short film) Writer/Director 2021 Reefa Etone ===TV series=== Year Title Role Notes 2009 The Bill Noah Morris 2 episodes 2013–2014 Friday Download Self - Presenter 9 episodes 2014–2016 The Evermoor Chronicles Seb Crossley Main role (24 episodes) 2015 Up All Night/Friday Download: The Movie Self - Presenter 2017 Will Billy Cooper 7 episodes 2018 Into the Badlands Arthur 3 episodes 2020 Alex Rider Parker Roscoe 5 episodes 2020–2022 Love, Victor Benjamin \"Benji\" Campbell Main role (28 episodes) 2023 Fire Country Ride Operator Episode: A Fair to Remember Based on a True Story Jacob 1 episode Hollow's Bend: The Radio Play Andres 3 episodes (Serie Podcast) == References == == Other websites == * * * Category:Living people Category:1997 births Category:English television actors Category:English movie actors Category:People from Essex",
 "title": "George Sear"
}