{
 "id": "992109",
 "text": "Le Morte d’Arthur is a compilation of Arthurian romances put together by Sir Thomas Malory. It contains both old English legends and original work written by Malory himself. The 1450s are considered the start of Malory’s writing of the book. The first edition was published in 1485 by William Caxton. www.bartleby.com. English Prose in the Fifteenth Century II, “Style of the Morte d’Arthur.” The Cambridge History of English and American Literature in 18 Volumes, vol.2, “The End of the Middle Ages,” 1907–21. https://www.bartleby.com/212/1404.html It is the best-known English Arthurian legend. == Authorship == While the exact identity of the author of Le Morte d'Arthur has been questioned, Thomas Malory born in 1416 in Newbold Revel, Warwickshire, England to Sir John Mallory has been widely accepted by scholars as its author.Wight, Colin (2009). \"Thomas Malory's 'Le Morte Darthur'\". www.bl.uk.Whitteridge 2009, pp. 257–265 Malory had engaged in criminal activities including theft, attempted murder of Humphrey Stafford, 1st Duke of Buckingham, accusations of rape, and robbery. Malory was imprisoned in several prisons and managed to escape multiple times. In 1461, King Henry VI granted him a pardon. He was imprisoned again in 1468 because of his allegiance to the House of Lancaster and his plot to overthrow King Edward IV. He was imprisoned at Newgate Prison in London, where he most likely wrote Le Morte d'Arthur.Davidson, Roberta (2004). \"Prison and Knightly Identity in Sir Thomas Malory's \"Morte Darthur\"\". Arthuriana. 14 (2): 54–63. doi:10.1353/art.2004.0066. JSTOR 27870603. S2CID 161386973 Henry VI returned to the throne in 1470 and Malory was released from prison again. He died five months later. The other likely candidate for the authorship of Le Morte d'Arthur is Thomas Mallory of Papworth St Agnes in Huntingdonshire. This theory was put forth by T. A. Martin in the Athenaeum magazine in September 1897.Athenaeum 11 September 1897, p. 353. == Manuscript history == William Caxton’s printed edition of 1485 was thought to be the earliest surviving version of Malory’s text. In 1934 Walter Oakeshott (a librarian at Winchester College) was collecting the college’s most interesting books when he discovered a manuscript. The text had been written in years between 1471 and 1483 by two scribes working together.Thomas Malory's 'Le Morte Darthur' British Library Add. MS 59678, f.35 Clues on its pages proved this was one of the manuscripts used by William Caxton in the preparation of his Le Morte D'Arthur. Pages fresh from the press had been laid on the manuscript. The wet ink accidentally transferred reversed images of Caxton’s distinctive typefaces. So it is probable that the manuscript was in Caxton’s Westminster workshop during the early 1480s. The printer may even have borrowed the manuscript from one of Malory’s family members. There is much debate over the way in which these two versions relate to each other. Field observes that certain drastic and deliberate changes are made. Scholars continue to debate whether Caxton or Malory authorized these alterations.Sir Thomas Malory's Morte d'Arthur. Robbins Library Digital Projects- Crusade Project. University of Rochester Roland argues that the differences between the Caxton and Winchester versions suggest that Caxton \"overwrote his copy text to comply with his world view, just as Malory had overwritten his source texts before him.\" The Roman Wars accounts in both Caxton and Malory's versions are informed by \"almost four hundred years of struggles for dominion over the east and a gradual slipping away of the conquests made by the First Crusade\".Roland, Meg (Margaret Mary). \"From 'Saracens' to 'Infydeles': The Recontextualization of the East in Caxton's Edition of Le Morte Darthur.\" In Re-Viewing Le Morte Darthur. Eds. K.S. Whetter and Raluca L. Radulescu. Woodbridge, UK: D.S. Brewer, 2005.. \"Arthur and the Turks,\" Arthuriana 16:4 (2006): 29-42. According to Roland, Caxton's version of the Roman War and his possible amendments to the Morte are a direct response to contemporary fears of Turkish expansion. he discovers that Malory's Morte was \"written in the arc of an ascending fear of the Turks, an arc that reaches its zenith just as Caxton publishes Malory's work in the mid-1480s, a time when Europe was awash in uncertainty as to the repercussions of Mehmed II's death\". For these reasons, the emphasis on crusades and on fears of foreign invasion begin to take on a deeper significance. == Printed edition by William Caxton == Thomas Malory’s Le Morte D’Arthur was first printed by William Caxton. He was the first printer in England.Elliott, Geoffrey Bryce. The Establishment of Malory’s “Le Mort D’Arthur” as the Standard Text of English-Language Arthurian Legend. The University of Louisiana at Lafayette ProQuest Dissertations Publishing, 2012, pp. 13–57. 3516394. The printing of the first edition was in 1485. It has been of great significance, since Caxton’s printed version allowed for further distribution and printing by other printing houses. Further printing of Malory’s text by different English printers is what allowed the creation of the canonical text of Arthurian literature in the English language, as it became more widely distributed. In Victorian Britain, Malory’s first printed version, and the whole genre of English Arthuriana, became popular in academia, as well as the general population. What was especially praised was Malory’s treatment of the topic of violence. The occurrences of killings and rape were treated with a sense of religious significance and later act as patriotic and sacred, rather than barbaric and immoral The text became a symbol of morality and Godly ideology. It is not only Malory’s text that was praised. William Caxton and his printed edition were greatly valued by Victorian scholars, too. It was Caxton’s most influential production. If it was not for Caxton’s agreement to print Malory’s text, English literature might have moved in a very different direction. Although there are several different versions of Malory’s text, each is used for different purposes, as each was published with an altered, mostly modernized, version of the language. == Language == Le Morte D’Arthur was written in Middle English, the English language in 11th to 15th century England. In comparison to Geoffrey Chaucer’s Canterbury Tales, Malory’s language and use of English is much closer to Early Modern English. Chaucer’s writing was published 85 years before Malory’s, their work belongs to the same historical and language period. They are often compared, especially language- wise. The spelling of Malory’s text does not necessarily correspond with the spelling of Early Modern English. From a grammatical and lexical point of view, it reads similarly to early Elizabethan English. The reason for the modernization of Malory’s writing is believed to be the inspiration in French texts, which gave Thomas Malory the foundation for his story. French language heavily influenced Malory’s style of writing. It probably modernized the language.www.bartleby.com. English Prose in the Fifteenth Century II, “Style of the Morte d’Arthur.” The Cambridge History of English and American Literature in 18 Volumes, vol.2, “The End of the Middle Ages,” 1907–21. https://www.bartleby.com/212/1404.html Thomas Malory has been both criticized and praised for his rich usage of connecting words such as “so–and–then,” usually used to transition between stories,Ward, A.W, Waller, A.R. “Morte D’Arthur.” The Cambridge History of English Literature, vol. 2. Cambridge, 1933. and for his lengthy and repetitive sentences and phrases, which some scholars condemned as too simplistic.Lynch, Andrew. “A Tale of Simple Malory and the Critics.” Arthuriana, no. 16, vol. 2, pp. 10–15 Others have praised it to be of high aesthetic quality.Cslin, William. “Prose Romance.” The French Tradition and the Literature of Medieval England. University of Toronto Press, 1994, pp. 498–512. == Influence from other sources == === Book I === Malory's first book's storyline is mainly based on the Prose Merlin in the Post-Vulgate Suite du Merlin. === Book II === This book is based mainly on the first half of the Middle English heroic poem Alliterative Morte Arthure, which is mostly based on Geoffrey of Monmouth’s pseudo-chronicle Historia Regum Britanniae. === Book III === This book is based on parts of the French Prose Lancelot, mostly its 'Agravain' section, along with the chapel perilous episode taken from Perlesvaus. === Book IV === This is not directly based on any preexisting literature. Instead, it is inspired by several Arthurian romances of the Fair Unknown genre, also known as Le Bel Inconnu, or Sir Gingalain === Book V === That is the longest of his eight books, it is based primarily on the lengthy Prose Tristan in French, or the lost English translation of it, and also could be from the Middle English verse romance Sir Tristram. === Book VI === The main source is The Vulgate Queste del Saint Graal, which details the exploits of numerous knights in their mythical search for the Holy Grail. === Book VII === Malory explicitly mentions the adultery of Guinevere and Lancelot. He combined the story from both the Vulgate Cycle prose Lancelot (counting the story of the Fair Maiden of Astolat and an abridged retelling of Lancelot, the Knight of the Cart) and his own creative setups. === Book VIII === For writing his final book, he used the version of Arthur's death derived primarily from parts of the Vulgate Mort Artu, and as a secondary source, he used the English Stanzaic Morte Arthur. ==References== Category:15th-century books Category:Works based on the Arthurian legend",
 "title": "Le Morte d’Arthur"
}