{
 "id": "992227",
 "text": "Navarre Scott Momaday (born February 27, 1934) is a Kiowa novelist, short story writer, essayist, and poet. Momaday was born in Lawton, Oklahoma. He is a Native American of the Kiowa people. His early life and education happened on Navajo, Apache, and Jemez Pueblo reservations. He went to college at the University of New Mexico. He got his masters and doctoral degrees at Stanford University. In 1969 his first novel, House Made of Dawn, won the Pulitzer Prize for Fiction. He receved the National Medal of Arts in November 2007. In 2019 he was given the Richard C. Holbrooke Distinguished Achievement Award from the Dayton Literary Peace Prize. That award said, \"Momaday speaks for the Earth, [seeing] the natural world as a sacred space and [telling] us that humans are a part of, not apart from that world.\" Momaday's writing often mixes up fiction, poetry, and non-fiction. In The Way to Rainy Mountain, he uses \"Kiowa tribal and private stories, history and descriptions of the land, and drawings.\" His books have been translated into French, German, Italian, Russian, Swedish, Japanese, and Spanish. ==Books== *The Journey of Tai-me (1967), folklore *House Made of Dawn (1968), novel *The Way to Rainy Mountain (1969), folklore *The Gourd Dancer (1976), poetry *The Names: A Memoir (1976), memoir *The Ancient Child (1989), novel *In the Presence of the Sun (1992), stories and poetry *The Native Americans: Indian County (1993) *Circle of Wonder: A Native American Christmas Story (1994), children's book *The Man Made of Words: Essays, Stories, Passages (1997), stories and essays *In the Bear's House (1999), mixed media *Four Arrows & Magpie: A Kiowa Story (2006), children's book *Three Plays: The Indolent Boys, Children of the Sun, and The Moon in Two Windows (2007), plays *Again the Far Morning: New and Selected Poems (2011), poetry *The Death of Sitting Bear (2020), poetry *Earth Keeper: Reflections on the American Land (2020), poetry == Related pages == *List of poets from North America ==References== Category:1934 births Category:American essayists Category:American novelists Category:American poets Category:Writers from Oklahoma Category:Living people Category:American short story writers",
 "title": "N. Scott Momaday"
}