{
 "id": "992307",
 "text": "In the English National Health Service people between age 16 and 60 may have to pay a charge for prescribed medicine. The charge is £9.35 for each one. People can get a certificate which lasts for 3 months for £30.25, or one which lasts a year for £108.10. In April 2023 a new charge was started for Hormone Replacement Therapy. The new HRT prepayment certificate costs £19.30 a year. People do not have to pay if they are: * under 16, * 16–18 and in full-time education, * getting some means tested benefits * over 60, * women who are expecting or have had a baby in the previous 12 months. They need a maternity exemption certificate. * People who have a certificate (HC2) from the NHS Low Income Scheme. An HC3 certificate gives some help but not exemption from charges. People who do not pay when they should can be punished. They may have to pay more than £100. == Medical exemption == People with these conditions are given a medical exemption certificate. They do not have to pay for any prescriptions, * epilepsy needing continuous therapy * a permanent fistula * diabetes mellitus * hyperthyroidism (also referred to as Graves' Disease, an autoimmune disorder) * myxoedema which occurs in hypothyroidism, or hyperthyroidism * hypoparathyroidism * diabetes insipidus or hypopituitarism * Addison's disease and other forms of hypoadrenalism * myasthenia gravis * any continuing physical disability which stops them going out alone * undergoing treatment for cancer, including the effects of cancer, or the effects of current or previous cancer treatment. In 2008 only 12% of patients in England had to pay. The Prescription Charges Coalition campaigns for free prescriptions for everyone with a long term condition. The conditions which get free prescriptions had long-term life-saving medicine in 1968, and it has not been changed since then. The prescription charges rules were called a \"dog's dinner\" by the Social Market Foundation. The National Pharmacy Association says the charges mean some people do not take their medicine. They end up in hospital which costs more than the cost of a prescription. Healthwatch England asked 2000 people about costs in December 2022. 10% said the increased cost of living meant they did not get their prescription. == History == When the NHS started in 1947 all prescriptions were free. Charges were started in 1952. They stopped in 1965 and were started again in 1968. They were stopped in Wales in 2007, in Northern Ireland in 2010 and in Scotland in 2011. == References == Category:National Health Service Category:Pharmacy",
 "title": "Prescription charge"
}