{
 "id": "992335",
 "text": "\"Ray of Light\" is a 1998 song by American singer Madonna. It is the second single from her 7th studio album of the same name. It went to number 1 in Croatia, Greece and Spain, number 2 in the United Kingdom and Finland, number 3 in Canada, number 5 in Italy and the United States, number 6 in Australia and Hungary, number 9 in Iceland and New Zealand and number 16 in Ireland. It won 2 Grammy Awards in 1999 and was nominated for Song of the Year. == Track listings and formats == * US 12-inch vinyl :A. \"Ray of Light\" (Sasha's Strip Down Mix) – 5:00 :B. \"Ray of Light\" (Orbit's Ultra Violet Mix) – 6:59 * US 2× 12-inch vinyl :A1. \"Ray of Light\" (Sasha's Ultraviolet Mix) – 10:43 :A2. \"Ray of Light\" (Sasha's Strip Down Mix) – 5:00 :B1. \"Ray of Light\" (Victor Calderone Club Mix) – 9:29 :B2. \"Ray of Light\" (William Orbit Liquid Mix) – 8:06 :C1. \"Ray of Light\" (Sasha Twilo Mix) – 10:58 :C2. \"Ray of Light\" (Victor Calderone Drum Mix) – 5:26 :D1. \"Ray of Light\" (Orbit's Ultra Violet Mix) – 6:59 :D2. \"Ray of Light\" (Album Version) – 5:19 * European 12-inch vinyl :A1. \"Ray of Light\" (Sasha's Ultraviolet Mix) – 10:43 :A2. \"Ray of Light\" (William Orbit Liquid Mix) – 8:06 :B1. \"Ray of Light\" (Victor Calderone Club Mix) – 9:29 :B2. \"Ray of Light\" (Album Version) – 5:19 * European CD single # \"Ray of Light\" (Album Version) – 5:19 # \"Has to Be\" (Non-Album Track) – 5:15 # \"Ray of Light\" (Sasha's Ultraviolet Mix) – 10:43 * US 7-inch vinyl; US, Australian, and Japanese CD single; UK cassette # \"Ray of Light\" (Album Version) – 5:19 # \"Has to Be\" (Non-Album Track) – 5:15 * US, Australian, European, and Japanese maxi-CD; UK CD single 1 # \"Ray of Light\" (Album Version) – 5:19 # \"Ray of Light\" (Sasha's Ultra Violet Mix) – 10:43 # \"Ray of Light\" (William Orbit Liquid Mix) – 8:06 # \"Ray of Light\" (Victor Calderone Club Mix) – 9:29 * UK CD single 2 # \"Ray of Light\" (Sasha's Twilo Mix) – 10:58 # \"Ray of Light\" (Sasha's Strip Down Mix) – 5:00 # \"Ray of Light\" (Victor Calderone Drum Mix) – 5:26 # \"Ray of Light\" (Orbit's Ultra Violet Mix) – 6:59 ==References== Category:1998 songs Category:Pop songs Category:Madonna songs Category:Psychedelic pop songs Category:Electronic rock songs",
 "title": "Ray of Light (song)"
}