{
 "id": "992501",
 "text": "Korpiklaani (Finnish: ) is a Finnish folk metal band. The band was made in Lahti as the Shamaani Duo in 1993. It was also named Shaman. Jonne Järvelä is the only person who has stayed in the band since it was made. He is the singer and guitar player for the band. Korpiklaani started as a folk music group named the Shamaani Duo. It was made by Järvelä and singer Maaren Aikio. When Aikio left, Järvelä renamed the group to Shaman. He started making folk metal instead of folk music. They made two albums, then the band's name changed again to Korpiklaani. They joined Napalm Records (a record label) and made more music. The band's first album to go onto many national music charts was Tervaskanto. It was released in 2007. All of the band's albums since Tervaskanto have been onto many national music charts, such as charts in Finland, Germany, and Switzerland. The band's most successful album is Jylhä. It was released in 2021. The band's current members are Järvelä, guitar player Kalle Savijärvi, bass player Jarkko Aaltonen, accordion player Sami Perttula, and drummer Samuli Mikkonen. The band mixes folk music and metal music by using metal music instruments, such as the electric guitar and bass guitar, with folk music instruments, such as the lute, accordion, and torupill. The band also uses singing that sounds similar to joiking. Joiking is a type of Finnish folk singing. The band's lyrics are often about old Finnish religions. == History == === Shamaani Duo and Hunka Lunka (1993–1997) === Korpiklaani started in 1993, with the name Shamaani Duo. It was made by Jonne Järvelä. Shamaani Duo made folk music, with no heavy metal. The group was inspired by folk music made by the Sámi. They played most of their music in a restaurant in the Lapland. The restaurant was named Hullu Poro. In 1996, they released an album named Hunka Lunka. This album had folk music on it. It used a type of folk singing called joiking, which the Sámi used. After making the album, one of the members of Shamaani Duo left the band. Her name was Maaren Aikio. She was one of the singers. After she left, Järvelä changed the band's name to Shaman. === Shaman (1997–2003) === Shaman was made in 1997. It made music that was heavier than the music Shamaani Duo made. The band's music had lyrics that were spoken in the Sámi language. Many things from folk music were still used in Shaman's music, such as joiking. The band made a demo song in 1999. It was named \"Ođđa máilbmi\" (New World in Sami). The song was put on the band's first album. The album was named Idja. It was released on January 8, 1999. The band made a second album in 2002. It was named Shamániac. === Korpiklaani (2003–present) === The band changed again in 2003. The band's new name was Korpiklaani. The only members of the band that were from Shaman were Järvelä and drummer Samu Ruotsalainen. The band's music changed to sound more similar to folk metal and thrash metal. The band stopped singing in the Sami language. They also started using real folk instruments. Järvelä has said that the band started making more heavy metal music because he worked with Finntroll. Finntroll is another folk metal band. Korpiklaani joined a record label named Napalm Records. In Korpiklaani's first albums, the lyrics were mostly in English. Some of the music had lyrics in Finnish. However, their later albums have more music in Finnish than English. Members of Korpiklaani and Finntroll have worked together many times. Ruotsalainen has played the drums with both bands. Järvelä has also done joiking for some of Finntroll's music. The band's first album to go onto Finland's national music chart was Voice of Wilderness. It was the band's second album. It was released in 2005. After Voice of Wilderness, all of the band's albums have been on national music charts. In 2008, Korpiklaani joined Nuclear Blast. This was a different record label. Their first album with Nuclear Blast was named Korven Kuningas (2008). In 2011, the band released Ukon Wacka. This album went to the number 9 place on Finland's music chart. Later in 2011, the band said Jaakko Lemmetty was leaving Korpiklaani. This was because he was having health problems. Lemmetty played many folk instruments for the band. Tuomas Rounakari replaced him. == Studio albums == ; as Shamaani Duo * Hunka Lunka (1996) ; as Shaman * Idja (1999) * Shamániac (2002) ; as Korpiklaani * Spirit of the Forest (2003) * Voice of Wilderness (2005) * Tales Along This Road (2006) * Tervaskanto (2007) * Korven Kuningas (2008) * Karkelo (2009) * Ukon Wacka (2011) * Manala (2012) * Noita (2015) * Kulkija (2018) * Jylhä (2021) * Rankarumpu (2024) == References == Category:Musical groups established in 1993 Category:Finnish musical groups Category:Folk music groups Category:Folk metal bands",
 "title": "Korpiklaani"
}