{
 "id": "992682",
 "text": "The \"Elsässisches Fahnenlied\" (Hymn to the Alsatian Flag\") is the unofficial anthem of Alsace, a region of France, as well as the former anthem of Alsace- Lorraine when it was part of the German Empire. ==Lyrics== German lyrics French lyrics English First stanza Sei gegrüßt, du unsres Landes Zeichen, Elsassfahne flatternd froh im Wind, Deine Farben, lieblich ohnegleichen Leuchten stets, wo wir versammelt sind. Sois béni, symbole de notre pays, Drapeau alsacien flottant gaiement au vent, Tes couleurs chéries et sans égales Brillent toujours là où nous sommes rassemblés. Be greeted, token of our land Alsatian flag merrily flying in the wind Your hues, peerless and beloved Shall shine for ever where we are gathered. Refrain Weiß und Rot, Die Fahne seh’n wir schweben! Bis zum Tod Sind treu wir ihr ergeben! Weiß und Rot, Die Fahne seh’n wir schweben Bis zum Tod Ihr treu ergeben! Rouge et blanc, Voici le drapeau qui flotte Jusqu’à la mort, Nous lui serons fidèles et dévoués! Rouge et blanc, Voici le drapeau qui flotte Jusqu’à la mort, Nous lui serons fidèles et dévoués! White and red, We shall see the flag flying! Until death, We shall be truly wholehearted to it! White and red, We shall see the flag flying! Until death, Wholeheartedly true to it! Second stanza Echt und recht, wie unsre Väter waren, Wollen wir in Tat und Worte sein. Unsre Art, wir wollen sie bewahren Auch in Zukunft makellos und rein. Sincères et droits, comme l’étaient nos pères, Nous resterons en paroles et en actes. Nos traditions, nous les préserverons Demain aussi, immaculées et pures. Heartfelt and right, like our fathers That is how we want to be in our deeds and talks We want to keep our behaviours Also in the hereafter, unblemished and clean. Third stanza Und ob Glück, ob Leid das Zeitgetriebe Jemals bringe unserm Elsassland, Immer steh’n in unentwegter Liebe Freudig wir zu ihm mit Herz und Hand. Et quelles que soient les joies ou les peines Que le destin puisse apporter à notre pays d’Alsace, Nous lui porterons toujours un amour inébranlable Avec bonheur, par le cœur et la main. And if time brings either luck or wretched end To our Alsatian land, We shall keep love for ever To it with heart and hand. Fourth stanza Lasst uns d’rum auf unsre Fahne schwören, Brüder ihm vom Wasgau bis zum Rhein: Niemals soll uns fremder Tand betören, Treu dem Elsass wollen stets wir sein! Jurons donc sur notre drapeau, Vous mes frères, des Vosges jusqu’au Rhin: Jamais une main étrangère ne devra nous séduire, À l’Alsace toujours nous serons fidèles! Let us therefore swear on our flag, Brothers from Wasgau to the Rhine We shall never be befooled by foreign kitch We want to hold true to Alsace forever. ==References== Category:Alsace Category:French anthems Category:German anthems Category:Historical anthems",
 "title": "Elsässisches Fahnenlied"
}