{
 "id": "992645",
 "text": "{{Infobox writer | name = Dorothy Richardson | image = | caption = Bedford Square, Bloomsbury. Richardson began her writing career when she lived in Bloomsbury, London. | birth_date = | birth_place = Abingdon, England | death_date = | death_place = Beckenham, Kent, England | resting_place = Beckenham | occupation = Novelist and journalist | movement = Modernism | genre = Novel | notableworks = Pilgrimage | influences = | influenced = | spouse = Alan Odle }} Dorothy Miller Richardson (17 May 1873 – 17 June 1957) was a British novelist and journalist. Richardson was born in 1873. At first she went to a private school for girls. But in 1890 she had to leave school because her father had money trouble. After that she worked at some teaching jobs in Germany and London. She took care of her mother who suffered from depression and killed herself in 1895. Richardson became a secretary in a dentist's office and lived in Bloomsbury. She met the writer H. G. Wells and they began an affair. This led to pregnancy and a miscarriage. In 1908 she left London and moved to a farm that was owned by a Quaker friend. In 1914 she wrote two books about Quakers. From 1908 to 1912, she wrote for The Saturday Review. In 1912 she started writing Pointed Roofs. This novel was the first of thirteen books that became the group called Pilgrimage. In 1917 Richardson married a young artist, Alan Odle. In her novels Richardson found a way of writing that readers thought was something new. In a review of Pointed Roofs, May Sinclair called Richardson's writing \"stream of consciousness.\" This was the first time that well-known phrase was used about literature. In 1923 Virginia Woolf described one sentence from Revolving Lights in this way: \"It is a woman's sentence, but only in the sense that it is used to describe a woman's mind by a writer who is neither proud nor afraid of anything that she may discover in the psychology of her sex.\" Richardson died in a nursing home in Kent, England in 1957. ==Books== *The Quakers Past and Present (1914) *Gleanings from the Works of George Fox (1914) *John Austen and the Inseparables (1930) *Journey to Paradise: Short Stories and Autobiographical Sketches (1989) *Pilgrimage (collected volumes published in 1938, 1967, 1976, 1979) **Pointed Roofs 1915 ** Backwater 1916 **Honeycomb 1917 **The Tunnel 1919 **Interim 1920 **Deadlock 1921 **Revolving Lights 1923 **The Trap 1925 **Oberland 1927 **Dawn's Left Hand 1931 **Clear Horizon 1935 **Dimple Hill 1938 **March Moonlight 1967 ==Other websites== *Dorothy M. Richarson at Project Gutenberg ==References== Category:1873 births Category:1957 deaths Category:British novelists",
 "title": "Dorothy Richardson"
}