{
 "id": "992676",
 "text": "\"Płyniesz Olzo po dolinie\" (\"You Flow, Olza, Down the Valley\") is a Polish poem by Jan Kubisz. It is the unofficial anthem of Cieszyn Silesia. ==Lyrics== Polish original English translation Płyniesz, Olzo, po dolinie, Płyniesz, jak przed laty, Takie same na twym brzegu Kwitną wiosną kwiaty. A twe wody w swoim biegu, Się nie zamąciły; I tak samo lśnią się w słońcu, Jak się dawniej lśniły. Ale ludzie w życiu swojem Zmienili się bardzo; Zwyczajami, wiarą przodków Ledwie że nie gardzą. I dąb z dębem na twym brzegu, Jak szumiał tak szumi; Lecz wnuk starą mowę dziadów Ledwie że rozumie. Na twym brzegu dawnym śpiewem Słowik się odzywa; A dziś śliczne pieśni nasze Ledwie że kto śpiewa! Jordan w ziemi Chananejskiej, Święte ma znaczenie: W jego wodach Izraela Lud brał oczyszczenie. Więc z modlitwą uklęknąłem W pokorze przed Panem: Byś się stała, Olzo, takim I dla nas Jordanem! A tak kiedyś - gdy nad falą Wiosną wiatr zawieje, Wnuk usłyszy w fal twych szumie Przodków swoich dzieje, I usiędzie na twym brzegu dumać nad przeszłością - I żyć będzie dla swej ziemi Czynem i miłością! You flow, Olza, down the valley, You flow on as of old, In spring, on your shores, The same flowers bloom. And your waters, in their course, Have not grown dim; They still shine in the sun, As they shone before. But in their lives Men have greatly changed; They all but disdain The customs and faith of their fathers. And on your shores the oak trees Rustle one to another; But the grandson barely grasps The speech of his fathers. On your shores, the nightingale Sings its old songs; But hardly anyone now sings Our beautiful anthems! The Jordan is holy In the land of Canaan: In its waters the Israelites Found their cleansing. So with a prayer I knelt Humbly before the Lord: That you become, O Olza, Our Jordan! And someday, when the spring wind blows Over your waves, The grandson will hear in their murmur The story of his forebears. And he will sit down on your bank To think upon the past — And will live for his land With deed and with love! ==References== Category:Polish anthems Category:1880s songs Category:1880s poems Category:1889 works",
 "title": "Płyniesz Olzo po dolinie"
}