{
 "id": "992785",
 "text": "\"Solo\" is an EDM song by British electronic music duo Clean Bandit. It also features Demi Lovato. It was released on May 18, 2018, by Atlantic Records. Lovato, Grace Chatto, Camille Purcell, Jack Patterson, and Fred Gibson helped write the song's lyrics. Commercially, the song was a worldwide success. It topped the charts in 13 countries. \"Solo\" was the most searched song on Shazam in 2018. It had 9.1 million tags worldwide. ==Background== The song was first revealed when a dancer posted on her Instagram Stories. She said that she would be featured on the music video for \"Solo\". On May 2018, Clean Bandit teased the song on Twitter.https://www.iol.co.za/entertainment/music/international/clean-bandits- next-single-will-feature-demi-lovato-14883628 Camille Purcell also said in a tweet that she would work for the production for the song. Grace Chatto, one of the members of Clean Bandit, told that London Evening Standard that the song was based on an experience of a breakup of hers. She also said that the song was recorded over FaceTime. It is because the band was unable to schedule a session with Lovato. ==Live performances== The song was performed at the other European leg of Lovato's Tell Me You Love Me World Tour. Clean Bandit also performed the song at the Capital FM Summertime Ball. The band also had Lovato as a special guest on June 9, 2018. ==Music Videos== The music video for the song was released on May 31, 2018. It stars the members of Clean Bandit and Lovato herself. ===Synopsis=== The video starts with the Clean Bandit member Grace Chatto. She is with a \"lover\", who is the actor George Todd McLachlan, in which they argue. As the arguments become violent. Chatto grabs her longboard and skates into the town and ends at a laundromat. She is then hidden behind the washing machines in an office. She also pays an attendant (Ko Hyojoo) for an unknown medicine. Then, Hyojoo is skating with a longboard down the street. It is to retrieve the medicine that will be made by Jack and Luke Patterson. Before that happens, Luke suggests to choose to the shape of a bearded dragon or a rabbit. They decide to make the shape of a dog. In the end, thanks to the help of the medicine, Chatto's abusive boyfriend turns into a rainbow golden Retriever. The video is briefly cut with Chatto's face evaporating. Lovato makes appearances with a floral top when she sings the track's vocals.https://planetradio.co.uk/kiss/entertainment/music/clean- bandit-demi-lovato-solo-video As of November 2021, the video has over 900 million views. A black and white acoustic version of the video was released on June 15, 2018. ===Japanese edition=== A music video for the Japanese version of the video was released on August 17, 2018. It was filmed in Kyoto, Japan. It focuses on the division of trying to break away from one's feelings. It is also focuses on moving from the past with the inner confusion that comes with it. It was directed by Yutaka Obara. ==References== Category:2018 songs Category:Demi Lovato songs",
 "title": "Solo (Clean Bandit song)"
}