{
 "id": "992784",
 "text": "Angoor () is a 1982 Indian Hindi-language comedy movie. It was directed by Gulzar. The movie stars Sanjeev Kumar and Deven Verma in double roles. It is a remake of the 1968 Indian movie Do Dooni Char. That movie was a remake of the 1963 Bengali language movie Bhranti Bilas. It was based on Ishwar Chandra Vidyasagar's Bengali novel by the same name. That book was based on Shakespeare's play The Comedy of Errors. Angoor was remade by Rohit Shetty as Cirkus. All of the characters in the move are innocent. Destiny plays the main role in bringing all characters to one place. This is different from most movies that have characters who are not innocent and make false statements to fool other characters. ==Sypnopsis== The story is based on Shakespeare's The Comedy of Errors. This is a story of two pair of identical twins and mistaken identities. == Cast == *Sanjeev Kumar in a double role as twin brothers Ashok Tilak and Ashok Tilak. *Moushmi Chatterjee as Sudha Tilak, Ashok's wife *Deepti Naval as Tanu, Sudha's sister *Deven Verma in a double role as twin brothers Bahadur and Bahadur. *Aruna Irani as Prema, Bahadur's wife *Yunus Parvez as Mansoor Miyan, Chhedilal's worker *C. S. Dubey as Chhedilal, a jeweller *T. P. Jain as Ganeshilal, a diamond merchant *Padma Chavan as Alka, Ashok's friend *Rammohan Sharma as Taxi Driver *Shammi as Ashok's mother *Utpal Dutt as Raj Tilak, Ashok's father (Cameo) *Raj Kumar Kapoor as Inspector Sinha *Arjun Chakraborty as an office assistant under Ashok Tilak * Kamaldeep as 'Angoor' landlord ==Soundtrack== Song Singer \"Hothon Pe Beeti Baat\" Asha Bhosle \"Roz Roz Daali Daali\" Asha Bhosle \"Preetam Aan Milo\" Sapan Chakraborty ==Awards and nominations== Arard Category Nominee Result 30th Filmfare Awards Best Comedian Deven Verma 30th Filmfare Awards Best Actor Sanjeev Kumar == Home media== The DVD version of the movie was released by IndiaWeekly under its own label. == Notes == == References == == Other websites == * Category:Hindi-language movies Category:Movies about twins Category:1982 comedy movies Category:1980s Indian movies",
 "title": "Angoor"
}