{
 "id": "992850",
 "text": "\"Amazon Women in the Mood\" is an episode of the television show Futurama. It is the first episode of season three to be made, but it was not the first one that was on television. It was first shown on the Fox network in the United States on February 4, 2001. ==Story== Amy has a phone call. The caller makes strange sounds and then hangs up. The caller is Kif. Kif loves Amy but is afraid to talk to her. Zapp Brannigan hears that Kif loves Amy and that Amy works with Leela, so he asks Leela to come out with him and Kif and bring Amy as a double date. Leela agrees but only because Amy wants to go. The four of them go to a restaurant on a large spaceship. The date is bad, and Zapp crashes the restaurant ship into a strange planet. This planet is Amazonia. The Amazonians, a tribe of giant, muscular women, catch Kif, Zapp, Leela, and Amy. Fry and Bender go to Amazonia to save their friends but the Amazonians catch them too. Fry, Zapp, and Bender make jokes about the Amazonian's female ideas, which makes Leela and Amy think life without men would be good. The Amazonians ask what purpose men. Amy tries to answer, and the Amazonians realize she is describing \"snu-snu\" (sexual intercourse), something they have heard of but never done. The Amazonians' leader, a giant computer called Femputer (Bea Arthur), decides to punish the men. Bender says that he does not have male anatomy, so the Femputer lets him leave. Femputer says Zapp, Fry, and Kif are must die, but she says it will be \"death by snu-snu,\" meaning the Amazonians will have sex with them until they are dead. Kif does not want to die by snu-snu, but Zapp and Fry are both happy and upset. Fry says, \"I never thought I'd die like this, but I'd always really hoped.\" Kif tells Amy that he loves her. Amy resolves to save him. Zapp and Fry are snu-snued off-screen. Kif climbs to the ceiling and escapes from at least one of the Amazonians. Later, both Zapp and Fry ask for the snu-snuing to stop because they are tired, but the Amazonians continue. Leela and Amy tell Bender to find the Femputer and reprogram her to let the men live. He sees that the Femputer is a really fembot. She tells Bender that she created the Amazonian society because her home planet was ruled by mean men. Amy rescues Kif; the Amazonians chase after them, cornering them in the Femputer's chamber. By this time, however, Bender and the fembot have become romantic. They tell the Amazonians to release their captives and bring gold. The crew returns to Earth where Fry and Zapp receive treatment for broken hip bones, but they are both happy that they had snu-snu. Bender has a pile of gold bricks, and Kif and Amy are a couple. They all agree that Amazonia was their best mission ever. ==Cultural references== The episode's title comes from the movie Amazon Women on the Moon. At the space restaurant, Zapp sings \"Lola\" to Leela. This a parody of William Shatner trying to sing \"Rocket Man.\" The bar \"Le'Palm d'Orbit\" is a reference to \"Palme d'Or.\" Zapp calls himself \"the Velour Fog\" because sing Mel Torme's nickname is \"the Velvet Fog.\" ==Themes== The episode has what Science Fiction Weekly calls the \"stereotypical women's fantasy\"—a world without men. This happens much in science fiction. It says that this represents the desire \"not to be marginalized in one's own society.\" ==Broadcast and reception== This episode was nominated for an Emmy Award in 2001 for \"Outstanding Animated Program (For Programming Less Than One Hour)\" but lost to The Simpsons episode \"HOMR.\" In 2006, IGN named it the best episode of Futurama because it is both \"crude and hilarious.\" The episode was also called \"most hilarious\" episode in Futurama's third season by Curve and in the book 5000 Episodes and No Commercials: The Ultimate Guide to TV Shows on DVD. In 2013, it was ranked number 10 \"as voted on by fans\" for Comedy Central's Futurama Fanarama marathon. When it was first on television in 2001, the episode placed 79th in the Nielsen ratings for primetime shows for the week of January 29 - February 4, 2001. Many years later, there were new reviews and articles about the episode. These articles talk about how the men do not really agree to have sex and that this is bad. They also say the episode has other unhealthy ideas about what it means to be a man or woman. In 2021, Jonah Schuhart of the Looper writes \"much of the episode's humor crosses into borderline misogyny, and even makes light of sexual assault.\" In 2023, Lewis Morton of the Avocado writes \"the only people who undergo snu-snu are consenting enthusiastically, but then if you have to go out of your way to explain why something isn’t rape, you're probably already too far.\" ==References== ==Other websites== *Amazon Women in the Mood at The Infosphere. * Category:Futurama episodes Category:2001 television episodes",
 "title": "Amazon Women in the Mood"
}