{
 "id": "99283",
 "text": "An Inspector Calls is a play written in 1945 by the British playwright J. B. Priestley, but set in 1912. Its socialist views ran against the capitalist views of many theatres visitors. It was first performed in 1945 in two Moscow theatres. It was then first produced in London at the New Theatre on 1 October 1946. The play shows the way in which people are all connected, and reflects Priestley's socialist views while outlining the problems he saw with capitalism. The main themes in the play are an equitable (fair) society, responsibility and love. == Dramatic presentation == * The play is set in the town of Brumley. It is about a police inspector, Inspector Goole, who questions a family about the suicide of a young woman whom the family knew. Many events which happen after the play are contradicted by Arthur Birling, such as the Titanic being unsinkable and that war with Germany would never happen. These are examples of dramatic irony. * The play takes place in one set (the dining room of the Birlings' house), in real time. This is a dramatic device which keeps the audience's attention on the dialogue as well as the timing of the entrances and exits. Foreshadowing is used throughout the play. * Another dramatic technique or device used is how Priestley ends his acts. Each time, near the end of the act, the inspector drops a bombshell of information that we are to think about. He makes us ponder over all that happened in that act. ==Dramatic devices== J. B. Priestley uses dramatic devices and dramatic irony to signal characters and introduce the inspector. For example, the house is pink and intimate while they are celebrating the engagement, but when the sharp ring of a door bell is heard, the lighting changes to a brighter and harder colour. Some believe that it represents an interrogation room due to the bright lights that are shining on the Birlings as the inspector comes in and picks the story out of them bit by bit. Dramatic irony is used throughout the play to create prejudice between Mr. Birling and the audience. == Awards == *Olivier Award PlayRevival 1991–2000 *Tony Award PlayRevival 1994–2000 Category:English plays Category:1940s plays Category:1945 works",
 "title": "An Inspector Calls"
}