{
 "id": "992932",
 "text": "Mario Kart Arcade GP 2 is the second Mario Kart game for arcades. It was released on March 14, 2007. There are 11 total playable characters in the game. You can choose to play in Time Trial Mode or Grand Prix Mode. In Time Trial mode you can race solo or against Staff Ghosts. In Grand Prix, you can choose between 50cc, 100cc, 150cc, or 200cc, and you race against players or against computers. == About the game == === Power-ups === You can use powerups as items. Along with the other games in the Mario Kart Arcade GP series, there are about 100 items in the game, making this and the others have the most items in a Mario Kart game at the time. === Tracks === There are 32 Tracks and 8 cups to the full game. === Karts === When turning regularly, your kart loses speed. However, if you hit R before turning, you will perform a small hop and start drifting as long as you keep holding the button and steering left or right. Not only does this maintain your speed, it will also start building up boost power for a mini turbo. == Facts == Mario Kart Arcade GP 2 is the second game in the Mario Kart Arcade GP series and the seventh in the Mario Kart series overall. You can use powerups as items. There are 32 Tracks and 8 cups to the full game. Mario Kart Arcade GP is the initial installment in the series. Originally designed for the Tri-force arcade board (also used for F-Zero AX) by Namco, players can race as one of eleven characters on twenty- four tracks. There are a total of six cups, with four tracks in each, equalling twenty-four. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 50 hours to obtain 100% completion. Coins have three uses, they increase your overall speed, they give you a tiny boost, and they can unlock objects. The biggest bruiser in Mario Strikers: Battle League is still the biggest powerhouses in Mario Kart 8. Bowser has the fastest speed stat in the game along with Wario. Statistically, the Pipe Frame is the best car in the game: it has great acceleration, handling, and a great mini-turbo. It also has decent traction but like many of the other cars on this list, suffers from its weight and speed. The player can jump by pressing the Brake while holding the gas pedal. To drift, the player does the same thing as jumping, but by turning the wheel to the desired direction. In the latest update, the player can also use the Mario button to jump. The game Mario Kart Arcade GP 1 includes only four playable characters, all of which appeared from the previous games: Mario, Luigi, Princess Peach and Yoshi. Items are thrown by making hand movements, which the game registers by an attachment to the player's wrist. Mario Kart Arcade GP DX is the third Mario Kart Arcade GP game, which was released in Japanese arcades on July 25, 2013, and in North American and European arcades in 2014 (previously announced for end of 2013), but the game was available in all Dave & Buster's restaurants from February 16, 2014 until April 2014. Daisy, Lakitu, and King Boo are the Japanese Exclusive characters that can be downloaded in Japanese Mario Kart Arcade GP DX game. Category:Mario Kart games",
 "title": "Mario Kart Arcade GP 2"
}