{
 "id": "99316",
 "text": "Below is a list of the 18 states of Sudan (Arabic names are in parentheses). Before 9 July 2011, Sudan had 25 states. The ten southern states now form the independent country of South Sudan. Two more states were created in 2012 within the Darfur region, and one in 2013 in Kordofan, bringing the total to 18. Transliterations from Arabic to English may vary; in particular, the article \"al\" is sometimes transliterated as \"el\". Numbers correspond to those of the map at right. # Khartoum (ولاية خرطوم Wilāyat Kharṭūm) # North Kordofan (ولاية شمال كردفان Wilāyat Shamāl Kurdufān) # Northern (ولاية الشمالية Wilāyat ash-Shamāliyyah) # Kassala (ولاية كسّلا Wilāyat Kassalā) # Blue Nile (ولاية النيل الأزرق Wilāyat an-Nīl al-Azraq) # North Darfur (ولاية شمال دارفور Wilāyat Shamāl Dārfūr) # South Darfur (ولاية جنوب دارفور Wilāyat Janūb Dārfūr) # South Kordofan (ولاية جنوب كردفان Wilāyat Janūb Kurdufān) # Gezira (ولاية الجزيرة Wilāyat al-Jazīrah) # White Nile (ولاية النيل الأبيض Wilāyat an-Nīl al-Abyaḍ) # River Nile (ولاية نهر النيل Wilāyat Nahr an-Nīl) # Red Sea (ولاية البحر الأحمر Wilāyat al-Baḥr al-Aḥmar) # Al Qadarif (ولاية القضارف Wilāyat al- Qaḍārif) # Sennar (ولاية سنّار Wilāyat Sinnār) # West Darfur (ولاية غرب دارفور Wilāyat Gharb Dārfūr) # Central Darfur (ولاية وسط دارفور Wilāyat Wasṭ Dārfūr) # East Darfur (ولاية شرق دارفور Wilāyat Sharq Dārfūr) # West Kordofan (ولاية غرب كردفان Wilāyat Gharb Kurdufān) ==Special administrative areas== * The Abyei Area, located on the border between South Sudan and the Republic of the Sudan, currently has a special administrative status and is governed by an Abyei Area Administration. It was due to hold a referendum in 2011 on whether to be part of South Sudan or part of the Republic of Sudan. ==Regional bodies== In addition to the states, there are also regional administrative bodies established by peace agreements between the central government and rebel groups: * The three Darfur states are coordinated by the Darfur Regional Government. * The three eastern states are coordinated by the Eastern Sudan States Coordinating Council. This council was established during the peace agreement between the Sudanese Government and the rebel Eastern Front. == History == Anglo-Egyptian Sudan had eight mudiriyat, or provinces, which were ambiguous when created but became well defined by the beginning of the Second World War. The eight provinces were: Blue Nile, Darfur, Equatoria, Kassala, Khartoum, Kurdufan, Northern, and Upper Nile. In 1948 Bahr al Ghazal split from Equatoria. There were numerous new provinces created on 1 July 1973. North and South Darfur were created from Darfur, while Kurdufan divided into North and South Kurdufan. Al Jazirah and White Nile were split off from Blue Nile. River Nile split off from Northern. Red Sea was split off from Kassala. A further fracturing of provinces occurred in 1976. Lakes split from Bahr al Ghazal, and Jonglei split off from Upper Nile. Equatoria divided into East and West Equatoria. There were thus eighteen provinces. In 1991, the government reorganized the administrative regions into nine federal states, matching the nine provinces that had existed from 1948 to 1973. On 14 February 1994, the government reorganized yet again, creating twenty-six wilayat (states). The majority of the wilayat were either the old provinces or administrative subregions of a province. As part of the new government structure in South Sudan in 2005, Bahr al Jabal was renamed Central Equatoria. In 2006, West Kurdufan was split and merged with North Kurdufan and South Kurdufan. In 2011, the ten southern states became the independent Republic of South Sudan.",
 "title": "States of Sudan"
}