{
 "id": "993140",
 "text": "Edward St. John Gorey (February 22, 1925 – April 15, 2000) was an American artist and writer of little illustrated stories and experimental plays. He was known for his own illustrated books as well as cover art and illustration for books by other writers. He designed sets and costumes for Edward Gorey’s Dracula in 1977. That play won two Tony Awards in 1978. One was for Best Costumes. Gorey was born in Chicago, Illinois. From grade 9, he was a successful student at the Francis Parker School. He was drafted into the U. S. Army when he was 18. In 1946 he went to college at Harvard University. He was the roommate there of poet Frank O'Hara. They both worked in the Poets Theater in Cambridge. Gorey's first book was The Unstrung Harp in 1953. Different from comic books, it was an early kind of graphic novel. It used both words and pictures to tell the story. From the 1950s on, Gorey was well-liked as an illustrator and designer of other people's books. Many people know his work by watching the animated opening for public telelvision's Mystery series. In 2000 he died of a heart attack at Cape Cod Hospital in Hyannis, Massachusetts. ==Books== * The Unstrung Harp 1953 * The Listing Attic 1954 * The Doubtful Guest 1957 * The Object-Lesson 1958 * The Bug Book 1959 * The Fatal Lozenge: An Alphabet 1960 * The Curious Sofa: A Pornographic Tale by Ogdred Weary 1961 * The Hapless Child 1961 * The Willowdale Handcar: Or, the Return of the Black Doll 1962 * The Beastly Baby 1962 * The Vinegar Works: Three Volumes of Moral Instruction 1963 ** The Gashlycrumb Tinies ** The Insect God ** The West Wing * The Wuggly Ump1963 * The Nursery Frieze1964 * The Sinking Spell 1964 * The Remembered Visit: A Story Taken from Life 1965 * Three Books from Fantod Press (1) 1966 ** The Evil Garden ** The Inanimate Tragedy ** The Pious Infant * The Gilded Bat 1967 * The Utter Zoo 1967 * The Other Statue 1968 * The Blue Aspic 1968 * The Epiplectic Bicycle 1969 * The Iron Tonic: Or, A Winter Afternoon in Lonely Valley 1969 * Three Books from the Fantod Press (2) 1970 ** The Chinese Obelisks: Fourth Alphabet ** Donald Has a Difficulty ** The Osbick Bird * The Sopping Thursday 1970 * Three Books from the Fantod Press (3) 1971 ** The Deranged Cousins ** The Eleventh Episode ** The Untitled Book * The Awdrey- Gore Legacy 1972 * Leaves from a Mislaid Album 1972 * The Abandoned Sock 1972 * A Limerick 1973 * The Lavender Leotard 1973 * CatEgorY 1973. * The Lost Lions 1973 * The Green Beads 1978 * The Glorious Nosebleed: Fifth Alphabet 1975 * The Grand Passion: A Novel 1976 * The Broken Spoke 1976 * The Loathsome Couple 1977 * Gorey Games 1979 * Dancing Cats and Neglected Murderesses 1980 * The Water Flowers 1982 * The Dwindling Party 1982 * Gorey Cats 1982 * The Prune People 1983 * Gorey Stories 1983 * The Tunnel Calamity 1984 * The Eclectic Abecedarium 1985 * The Prune People II 1985 * The Improvable Landscape 1986 * The Raging Tide: Or, The Black Doll's Imbroglio 1987 * Q. R. V. (later retitled The Universal Solvent) 1989 * The Stupid Joke 1990 * The Fraught Settee 1990 * The Doleful Domesticity; Another Novel 1991 * La Balade Troublante 1991 * The Retrieved Locket 1994 * The Unknown Vegetable 1995 * The Just Dessert: Thoughtful Alphabet XI 1997 * Deadly Blotter: Thoughtful Alphabet XVII 1997 * The Haunted Tea-Cosy: A Dispirited and Distasteful Diversion for Christmas 1998 * The Headless Bust: A Melancholy Meditation on the False Millennium 1999 Some of Gorey's books are very hard to find. These four books collect many of them. Because his books are very short, these collections may contain 15 or more in each volume. * Amphigorey, 1972 () contains The Unstrung Harp, The Listing Attic, The Doubtful Guest, The Object- Lesson, The Bug Book, The Fatal Lozenge, The Hapless Child, The Curious Sofa, The Willowdale Handcar, The Gashlycrumb Tinies, The Insect God, The West Wing, The Wuggly Ump, The Sinking Spell, and The Remembered Visit * Amphigorey Too, 1975 () contains The Beastly Baby, The Nursery Frieze, The Pious Infant, The Evil Garden, The Inanimate Tragedy, The Gilded Bat, The Iron Tonic, The Osbick Bird, The Chinese Obelisks (bis), The Deranged Cousins, The Eleventh Episode, [The Untitled Book], The Lavender Leotard, The Disrespectful Summons, The Abandoned Sock, The Lost Lions, Story for Sara [by Alphonse Allais], The Salt Herring [by Charles Cros], Leaves from a Mislaid Album, and A Limerick * Amphigorey Also, 1983 () contains The Utter Zoo, The Blue Aspic, The Epiplectic Bicycle, The Sopping Thursday, The Grand Passion, Les Passementeries Horribles, The Eclectic Abecedarium, L'Heure bleue, The Broken Spoke, The Awdrey-Gore Legacy, The Glorious Nosebleed, The Loathsome Couple, The Green Beads, Les Urnes Utiles, The Stupid Joke, The Prune People, and The Tuning Fork * Amphigorey Again, 2006 () contains The Galoshes of Remorse, Signs of Spring, Seasonal Confusion, Random Walk, Category, The Other Statue, 10 Impossible Objects (abridged), The Universal Solvent (abridged), Scenes de Ballet, Verse Advice, The Deadly Blotter, Creativity, The Retrieved Locket, The Water Flowers, The Haunted Tea-Cosy, Christmas Wrap-Up, The Headless Bust, The Just Dessert, The Admonitory Hippopotamus, Neglected Murderesses, Tragedies Topiares, The Raging Tide, The Unknown Vegetable, Another Random Walk, Serious Life: A Cruise, Figbash Acrobate, La Malle Saignante, and The Izzard Book ==References== Category:1925 births Category:2000 deaths Category:Writers from Chicago Category:Artists from Chicago Category:Deaths from myocardial infarction",
 "title": "Edward Gorey"
}