{
 "id": "993274",
 "text": "Lawrence Wong Shyun Tsai (; born 18 December 1972) is a Singaporean politician, economist and former civil servant. He has been the Prime Minister of Singapore since May 15, 2024. He is also the Minister for Finance since 2021. A member of the governing PAP, he has been the Member of Parliament (MP) representing the Limbang division of Marsiling–Yew Tee GRC since 2015. == Early life and education == === Early life === Wong was born on 18 December 1972 at in the eastern part of Singapore. He is of Hainanese descent and was raised Methodist. Growing up, Wong and his family lived in Marine Parade. Wong's father worked as a sales executive while his mother was a teacher at his primary school. === Education === Wong attended Tanjong Katong Primary School, Tanjong Katong Secondary School and Victoria Junior College before going to college. Wong received a Bachelor of Science with a major in economics from the University of Wisconsin–Madison in 1994. He received a Master of Arts in applied economics from the University of Michigan in 1995. He received a Master in Public Administration from Harvard University in 2004.https://www.livemint.com/news/india/pm-modi-meets-singapore-pm-lawrence- wong-says-we-want-to-create-many-singapores-in-india-11725505258998.html == Civil service career == Wong began his career as an economist working in the Ministry of Trade and Industry (MTI) in August 1997. He also worked in the Ministry of Finance (MOF) and Ministry of Health (MOH) from January 2002 to May 2005. Wong served as the principal private secretary to Prime Minister Lee Hsien Loong between May 2005 and August 2008. In September 2008, Wong became deputy chief executive officer of the Energy Market Authority, becoming to chief executive officer on 1 January 2009. He gave up the role on 1 April 2011. == Political career == Wong entered politics at the 2011 general election when he contested as part of a five-member People's Action Party (PAP) team in West Coast GRC. The PAP team won with 66.66% of the vote against the Reform Party. Wong was elected as the Member of Parliament representing the Boon Lay section of West Coast GRC. Wong was the co-chair of a multi- ministerial committee set up by the government in January 2020 to manage the COVID-19 pandemic in Singapore. As Minister for Finance, he has overseen the gradual increase in Goods and Services Tax (GST) which Lee's government has advocated for – 8% in 2023 and 9% in 2024, up from 7% which had been set since 2007. In April 2022, he was chosen as the leader of the PAP's fourth generation team, placing him in line as Lee's apparent successor. Wong assumed the office of Deputy Prime Minister of Singapore on 13 June 2022, serving alongside Heng Swee Keat. On 26 November 2022, Wong was appointed to the newly created position of Deputy Secretary-General of the PAP. From the 2011 general election up to the 2015 general election, Wong served as the Minister of State for Defence and Senior Minister of State for Education, Minister for Culture, Community and Youth and Second Minister for Communications and Information. In the 2015 general election, Wong was part of a four-member PAP team contesting in the newly formed Marsiling–Yew Tee GRC. The PAP team won with 68.7% of the vote against the Singapore Democratic Party. Wong was elected as the Member of Parliament representing the Limbang ward of Marsiling–Yew Tee GRC. From the 2015 general election up to the 2020 general election, Wong served as the Minister for National Development and Second Minister for Finance. In the 2020 general election, Wong led a four-member PAP team to contest in Marsiling–Yew Tee GRC again. The PAP team won with 63.18% of the vote against the Singapore Democratic Party. Wong held on to his seat as the Member of Parliament representing Limbang section. From the 2020 general election onwards, Wong served as Minister for Education and Minister for Finance. Currently, he is serving as the Prime minister. === Selection as 4G leader === On 14 April 2022, Wong was selected as the leader of the PAP's fourth-generation (4G) team, succeeding Deputy Prime Minister Heng Swee Keat, who had stepped down as 4G leader on 8 April 2021. Prior to his appointment, a consultation process was held among the fourth-generation ministers of the Cabinet. Wong received an \"overwhelming majority\" of support in the consultation process and received 15 out of 19 of the votes in a vote. His candidature was supported by the Cabinet and later, by the PAP MPs at a party caucus on 14 April. His appointment was announced by Prime Minister Lee the same day. As the new 4G leader, Wong became the Prime Minister on 15 May 2024 === Deputy Prime Minister === On 6 June 2022, a Cabinet reshuffle was announced where Wong was promoted to Deputy Prime Minister, which further made him the next Prime Minister of Singapore. In addition to becoming Deputy Prime Minister, Wong was also named \"Acting Prime Minister\" in the PM's absence. He had also taken over responsibility of the Strategy Group in the Prime Minister's Office (PMO). === Prime Minister (2024–present)=== When Prime Minister Lee Hsein Loong announced his plans to retire, Wong appeared to be the clear choice to replace him as prime minister. On 15 April 2024, it was confirmed that Wong would be replacing Lee. Wong was officially sworn-in on 15 May 2024 at The Istana. He became the country's fourth prime minister, as well as the first to be born after Singapore's independence in 1965. Wong is currently married Loo Tze Lui, a former banker currently working in wealth management. She is also on the board of directors of the YMCA in Singapore. His elder brother is an aerospace engineer. == References == == Other websites == * Lawrence Wong on Singapore Prime Minister's Office * Lawrence Wong on Parliament of Singapore |- Category:1972 births Category:Living people Category:Political office-holders in Singapore Category:Members of the Cabinet of Singapore Category:People's Action Party (Singapore) politicians Category:Prime Ministers of Singapore Category:Current national leaders",
 "title": "Lawrence Wong"
}