{
 "id": "993238",
 "text": "Nikola Jurčević (born 14 September 1966) is a Croatian professional football manager and former player who is head coach of the Lebanon national team. ==Playing career== ===Club career=== He started his career at Dinamo Zagreb. There he played alongside with Robert Prosinečki and Zvonko Boban. After a conflict with Dinamo's youth coach Belji he went to Royal Antwerp as an 18-year-old. After one year in Belgium he returned and played for FC Zagreb. In the summer of 1991he signed with Austrian Bundesliga club SV Austria Salzburg. He was Austrian champion with Salzburg in 1994 and 1995 . In 1994 he scored 14 goals and was together with Heimo Pfeifenberger Austrian top scorer. With Salzburg he reached the UEFA Cup final in the 1993/94 season. Another success was the entry into the UEFA Champions League in the following season. FC Salzburg Wiki (German) After his successful years in Austria, he moved to SC Freiburg in the German Bundesliga for two years. There he made 45 appearances and scored 5 goals. After his stay in Germany he went back to Salzburg for a year. He played 211 matches and scored 51 goals. Most of them he played for SV Austria Salzburg (161 matches-46 goals). ===International=== He made his debut for Croatia in a December 1990 against Romania. He came as a 66th-minute substitute for Ivan Cvjetković. He played 19 matches for Craoatia (2 unofficial) and scored 2 goals. Because Croatia was still officially part of Yugoslavia at the time, his first two games were unofficial. His final match was in December 1996 against Morocco. ==Managerial career== He started his coaching career in 2003 at his home club Dinamo Zagreb. In 2005 he became coach of his former club SV Austria Salzburg . After the Red Bull take over he was replaced as coach after just two games by Manfred Linzmaier. Then he coached the Croatian first division club NK Slaven Belupo Koprivnica till 2006. From 2006 to 2017 Jurčević was an assistant to former Croatian national coach Slaven Bilić . (Croatia national team 2006–2012; Lokomotiv Moscow 2012–2013; Beşiktaş Istanbul 2013–2015 ; West Ham United 2015–2017). 2018 he was head coach at Dinamo Zagreb. 2018/19 he was coach of the Azerbaijan national football team. He was dismissed due to Azerbaijan's poor performance during the qualifiers for the 2021 European Championship.azerbaycan24.com On 2 October 2023, Jurčević was appointed head coach of the Lebanon national team ahead of the 2023 AFC Asian Cup and 2026 FIFA World Cup qualification.https://the-lfa.com.lb/news/NT_Coach_JURECEVIC.php ==Honours== ===As a player=== NK Zagreb *Yugoslav Third League (West): 1989–90 *Yugoslav Second League: 1990–91 Austria Salzburg *Austrian Bundesliga: 1993–94, 1994–95 *UEFA Cup Runner-up: 1993–94 Individual *Austrian Bundesliga top scorer: 1993–94 ===As a manager=== Dinamo Zagreb *Croatian Super Cup: 2003 *Croatian Cup: 2004 ==Other websites== * * ==References== Category:Living people Category:1966 births Category:Association football midfielders Category:Association football forwards Category:Croatian footballers Category:FC Red Bull Salzburg players Category:Bundesliga players Category:Croatian football managers Category:FC Red Bull Salzburg managers Category:Austrian football champions Category:Austrian Football Bundesliga top scorers",
 "title": "Nikola Jurčević"
}