{
 "id": "993325",
 "text": "Shaun Ricker (born November 1, 1982) is an American professional wrestler and actor. He works for WWE using the ring name LA Knight on the SmackDown brand and is a former two-time United States Champion. He is also known for his time in Impact Wrestling as Eli Drake. Ricker began his wrestling career in 2003. In 2013, he started working with WWE. He worked in NXT using the Slate Randall. He was released in 2014. He signed with Impact Wrestling in 2015. Ricker found success at Impact. He won the Impact World Champion and the TNA King of the Mountain Champion. He also won the Impact World Tag Team Champion with Scott Steiner. Ricker also won Impact's Feast or Fired briefcase two times. Ricker left Impact in 2019. He signed with NWA. He was the NWA World Tag Team Champion with James Storm. He left the NWA in 2021 to rejoin WWE. He returned to NXT and was renamed LA Knight. He was moved to the main roster in 2022. Ricker was given a manager role as a talent agent named Max Dupri. He led the Maximum Male Models group. A few months later, he left the group and changed back to his LA Knight persona and started wrestling again. He quickly got a large amount of fan support because of his promo skills. He was booked to lose most of his matches at this time. This changed because of the support he got from fans. Outside of wrestling, Ricker appeared as a cast member on Dwayne \"The Rock\" Johnson's 2013 reality seriesThe Hero. He had a small role in a 2015 episode of the comedy series Brooklyn Nine-Nine. He also provided the motion capture for other WWE wrestlers in many of the WWE 2K series of video games. Shaun was raised in Hagerstown, Maryland, graduating from North Hagerstown High School. He attended West Virginia University for 1.5 years later withdrawing due to financial issues. After college, he returned to Hagerstown before moving to Ohio. ==Career== ===Beginnings and Heartland Wrestling Association (2002–2009)=== Ricker started his career on February 15, 2002, at the National Wrestling Alliance Wildside, a Georgia-based promotion, using the name Deuce. On that day, he teamed up with Onyx, and they lost a match to Johnny Psycho and Shadow Jackson. In May 2003, he joined the Heartland Wrestling Association (HWA), an Ohio-based promotion, where he continued to use the name Deuce. On November 9, 2004, he became the HWA Television Champion after defeating JT Stahr. He held the title until January 4, 2005, when Brian Beech became the new champion. Starting in May 2005, he adopted the ring name Dick Rick. On October 31, 2006, he left the promotion after losing a match for the HWA Heavyweight Championship, with his career in the promotion at stake. == Championships == * Championship Wrestling from Hollywood ** CWFH Heritage Heavyweight Championship (1 time) ** NWA Heritage Tag Team Championship (2 times) – with Brian Cage ** Red Carpet Rumble (2013) * DDT Pro-Wrestling ** Ironman Heavymetalweight Championship (1 time) * ESPN ** Breakthrough Wrestler of the Year (2023) * Future Stars of Wrestling ** FSW Heavyweight Championship (2 time) * Empire Wrestling Federation ** EWF Heavyweight Championship (1 time) ** Great Goliath Battle Royal (2011) – with Josh Dunbar * Heartland Wrestling Association ** HWA Television Championship (1 time) * Mach One Wrestling ** M1W Tag Team Championship (1 time) – with Brian Cage ** M1W Tag Team Championship Tournament (2010) – with Brian Cage * National Wrestling Alliance ** NWA World Tag Team Championship (1 time) – with James Storm * New York Post ** Male Breakout Wrestler of the Year (2023) * Pro Wrestling Illustrated ** Ranked No. 32 of the top 500 singles wrestlers in the PWI 500 in 2018 * Pro Wrestling Revolution ** PWR Heavyweight Championship (1 time) * Total Nonstop Action Wrestling / Impact Wrestling ** Impact World Championship (1 time) ** Impact World Tag Team Championship (1 time) – with Scott Steiner ** TNA King of the Mountain Championship (1 time) ** Gauntlet for the Gold (2016, 2017 – Heavyweight) ** Race for the Case (2017 – Red Case) ** Feast or Fired (2016 – King of the Mountain Championship contract) ** Feast or Fired (2018 – World Tag Team Championship contract) * Ultimate Championship Wrestling ** UCW Heavyweight Championship (1 time) * Wrestling Observer Newsletter ** Worst Gimmick (2022) as part of Maximum Male Models ** Worst Match of the Year (2023) * WWE ** WWE United States Championship (2 times) ** Million Dollar Championship (1 time) ** SummerSlam Slim Jim Battle Royal (2023) ** Slammy Award (2 times) *** Breakout Superstar of the Year (2024) *** Fan Chant of the Year (2024) – == References == ==Other websites== * Category:1982 births Category:Living people Category:American professional wrestlers Category:Sportspeople from Maryland Category:Total Nonstop Action Wrestling alumni Category:WWE wrestlers",
 "title": "LA Knight"
}