{
 "id": "993596",
 "text": "The Provincial Assembly of Madhesh Province (Nepali/Maithili: मधेश प्रदेश सभा) is a unicameral governing and law making body of Madhesh Province, Nepal. It is at Janakpur, the province capital of Madhesh Province, with 107 members. After the NC-PSP-N alliance since 2021, the current Chief Minister of Madhesh Province and Leader of the House is Mohammad Lalbabu Raut and Ram Saroj Yadav is the deputy chief minister. The Speaker of the Assembly is Saroj Kumar Yadav. Hari Shankar Mishra is the current Governor of Madhesh Province. == List of assemblies == Election Year Assembly Start of term End of term Speaker Chief Minister Party 2017 1st Assembly 4 February 2018 Incumbent Saroj Kumar Yadav Mohammad Lalbabu Raut (Cabinet) People's Socialist Party, Nepal == Overview == Office Office Bearer Party Took office Speaker Saroj Kumar Yadav Loktantrik Samajwadi Party, Nepal 13 February 2018 Deputy Speaker Upama Kumari Dev People's Socialist Party, Nepal 16 February 2018 Leader of the House Mohammad Lalbabu Raut People's Socialist Party, Nepal 5 February 2018 Leader of Opposition Satrudhan Mahato CPN(UML) 5 January 2021 == Political parties == Party Parliamentary party leader Seats Saroj Yadav 25 Krishna Prasad Yadav 22 Saroj Kumar Yadav 16 Mahesh Prasad Yadav 13 Abhiram Sharma 9 Bharat Prasad Sah 9 CPN (US) Satrudhan Mahato 7 1 1 1 Total 107 ==Members== People's Socialist Party (36) Constituency/ group Member Portfolio & Responsibilities Officers of the Province of Assembly Bara 1(B) Saroj Kumar Yadav Speaker of the Assembly Upama Kumari Dev Deputy Speaker of the Assembly Members of Assembly Parsa 1(B) Mohammad Lalbabu Raut * Chief Minister (From 14 February 2017) Parsa 3(A) Abdul Rahim Ansari Saptari 4(B) Abhishek Yadav Anju Kumari Sarlahi 2(B) Ashok Kumar Yadav Bara 2 (B) Bachha Raut Ahir Bhima Yadav Saptari 3(B) Bidheshwar Prasad Yadav Siraha 2(A) Bijay Kumar yadav Chameli Devi Das Dhanusha 4 (B) Gyanendra Kumar Yadav Parsa 1( A) Janat Ansari Karima Begum Mahottari 4 (A) Kaushal Kumar Yadav Kiran Kumar Rae Saptari 2(B) Manish Kumar Sumamn Saptari 1(B) Nawal Kishor Sah Sudi Netra Bikram Shah Nira kumar Sah Bara 3(B) Paras Prasad Sah Rajini Devi Waranwal Rautahat 2(B) Ram Kishor Prasad Yadav Dhanusha 2(B) Ram Ashish Yadav Ram Naresh Rae Reena Yadav Sanchamaya Moktan Sarlahi 3(B) Sanjay Kumar Yadav Bara 2 (A) sarada Shankar Prasad Kalawar Mahottari 4(B) Saroj Kumar Singh Dhanusha 2(A) Shailendra Kumar Yadav Saptari 2(A) Shailendra Prasad Sah Parsa 4(B) Singhasan Sah Kalwar Sunita Devi Mochi Siraha 4(B) Suresh Kumar Mandal Nepali Congress (19) Constituency/ group Member Portfolio & Responsibilities Dhanusha 3(A) Ram Saroj Yadav Parliamentary party Leader == References == Category:Madhesh Province Category:Unicameral legislatures",
 "title": "Madhesh Provincial Assembly"
}