{
 "id": "993576",
 "text": "A monarch is the head of a monarchy, a form of government in which a state is ruled by an individual who normally rules for life or until abdication, and typically inherits the throne by birth. Monarchs may be autocrats (as in all absolute monarchies) or may be ceremonial figureheads, exercising only limited or no reserve powers at all, with actual authority vested in a legislature and/or executive cabinet (as in many constitutional monarchies). In many cases, a monarch will also be linked with a state religion. Most states only have a single monarch at any given time, although a regent may rule when the monarch is a minor, not present, or otherwise incapable of ruling. Cases in which two monarchs rule simultaneously over a single state, as is the current situation in Andorra, are known as coregencies. == List of rulers == ===Colors=== : : ===Current monarchies=== Title Monarch Foundation of monarchy Since Length Ref Flag Age of monarchy Co-Prince Joan Enric Vives i Sicília 1278 2003 19 years, 268 days Constitution of Andorra, Ch. 3. 814-815 Years Emmanuel Macron 2017 5 years, 266 days King Charles III 1707 2022 149 days Constitution of Antigua and Barbuda, Art. 68.Constitution of Australia, Art. 61.Constitution of the Bahamas, Art. 71.Constitution of Belize, Art. 36.Constitution of Canada, Art. 9.Constitution of Grenada, Art. 57.Constitution of Jamaica, Art. 68.Constitution Act 1986: Part 1.Constitution of Papua New Guinea, Art. 82.Constitution of Saint Kitts and Nevis, Art. 51.Constitution of Saint Lucia, Art. 59.Constitution of Saint Vincent and the Grenadines, Art. 50.Constitution of Solomon Islands, Art. 1.Constitution of Tuvalu, Art. 48. and more 315 Years King Hamad bin Isa Al Khalifa 1783 1999 23 years, 335 days 319 Years King Philippe 1831 2013 9 years, 198 days 221 Years Druk Gyalpo Jigme Khesar Namgyel Wangchuck 1907 2006 16 years, 51 days 115 Years Sultan Hassanal Bolkiah 1363 1967 55 years, 122 days 719 Years King Norodom Sihamoni 68 CE 2004 18 years, 113 days 1955 Years Queen Margrethe II 710 1972 51 years, 21 days 1313 Years King Mswati III 1750s 1986 36 years, 285 days 222-223 Years Emperor Naruhito 11 February 660 BC (mythical), 2681 years ago. historical origin is disputed. was Emperor Jimmu 2019 3 years, 279 days . 2681 Years : \"The two branches of the Al-Sabah family, the Jabers and the Salems, have traditionally alternated their rule, one providing the emir and the other the crown prince (also serving as prime minister) King Letsie III 1822 1996 26 years, 362 days Prince Hans-Adam II 1608 1989 33 years, 83 days Grand Duke Henri 1815 2000 22 years, 120 days Yang di-Pertuan Agong Abdullah 1957 2019 4 years, 4 days Prince Albert II 1604 2005 17 years, 304 days King Mohammed VI 788 or 1666 1999 23 years, 198 days Willem-Alexander 1815 2013 9 years, 282 days Harald V 872 1991 32 years, 20 days Sultan Haitham bin Tariq 751 2020 3 years, 26 days 1272 Years Emir Tamim bin Hamad Al Thani 1851 2013 9 years, 226 days King Salman 1832 2015 8 years, 14 days Felipe VI 1474 or 1475 Isabella I of Castile and Ferdinand II of Aragon 2014 8 years, 232 days Carl XVI Gustaf 970 1973 49 years, 144 days 1053 Years Vajiralongkorn 1238 2016 6 years, 116 days Tupou VI 1845 2012 10 years, 325 days 177 Years President Mohamed bin Zayed Al Nahyan 1971 2022 268 days . \"The Al Nahyan ... are a branch of the Al Bu Falah tribe of the Bani Yas confederation, and although they have been a small section of the tribe, the Al Nahyan have traditionally provided the paramount shaykh for the confederation.\" 51 Years Pope Pope Francis 1 AD 13 March 2013 9 years, 328 days 2021 Years ===Former monarchies=== Name Formation First monarch Abolition Flag Ref France 500s Charles the Bald France Clovis I Francia 1870 Saxony 500s Hadugato Rudolph I Electorate of Saxony 1918 Germany 843 Louis II the German Mecklenburg ? or 1167 ? and Pribislaus I \"Von der Reformation...\" England 800s Alfred the Great 1707 now UK Georgia 302 BC Pharnavaz I 1801 Commander of the Royal House of Georgia , The Royal House of Georgia.The Royal House of Georgia. ===Longest- reigning.=== List Title Image Monarch Foundation of monarchy Length Ref Flag 1 King Louis XIV 500s 72 years, 110 days 2 Queen Elizabeth II 1707 70 years, 214 days 3 King Rama IX 1238 70 years, 126 days 4 Prince Johann II 1608 70 years, 91 days 5 ? Kʼinich Janaabʼ Pakal I ? 68 years, 33 days Palenque (Mexico) 6 Austrian Empire and Austria-Hungary Franz Joseph I 1000 or 1270s 67 years, 355 days Austria-Hungary 7 ? Chan Imix Kʼawiil ? 67 years, 130 days Copán (Honduras) 8 King Ferdinand III 1800s 65 years, 90 days Sicily == Gallery == File:Charles Prince of Wales.jpg|Charles III File:Sergio Mattarella met with Hassanal Bolkiah ahead of 2021 G20 Summit (2) (cropped).jpg|Hassanal Bolkiah File:Drottning Margrethe av Danmark.jpg File:Naruhito and Masako visit Bogor Palace 48 (cropped).jpg File:Ιωάννης Αδάμ Β΄ του Λίχτενσταϊν.jpg File:Grand Duke Henri at the Enthronement of Naruhito (1).jpg File:تميم بن حمد بن خليفة آل ثاني (49759678641) (cropped).jpg File:Sheikh Mohamed bin Zayed Al Nahyan in the Oval Office of the White House, Monday, May 15, 2017.jpg File:Portrait of Pope Francis (2021).jpg ==Related pages== *List of current heads of state and government *List of current consorts of sovereigns ==Notes== == References == Category:Lists of monarchs",
 "title": "List of monarchs by time"
}