{
 "id": "993692",
 "text": "Three-strikes laws, or habitual offender laws, are laws that impact the punishment for a crime. Under a three-strikes law, if a person was convicted of three serious crimes, they will have to go to prison for life after their third crime. Three-strikes laws are used in many states of the USA. They are part of the United States Justice Department's Anti-Violence Strategy. In most states, only crimes at the felony level qualify as serious crimes. In some places, only violent felonies qualify as serious. The expression \"Three strikes and you are out\" comes from baseball. If a batter gets three strikes, they strike out. == History == The idea of giving longer prison sentences to repeat criminals is not new. Judges often consider earlier crimes when deciding the punishment. However, in most cases, laws did not require a longer prison sentence. There is a more recent history of mandatory prison sentences for repeat criminals. During Prohibition, the state of Michigan made one of the harshest laws against carrying alcohol in the nation. The law required a life sentence for those breaking alcohol laws for the fourth time. In 1928, Etta Mae Miller, a mother of four, was found guilty under this law. People were very angry at the state. The first true \"three-strikes\" law was passed in 1993, when Washington voters approved Initiative 593. California passed its own in 1994, when their voters passed Proposition 184, with 72% voting yes and 28% voting no. The initiative proposed to the voters had the title of Three Strikes and You're Out. This meant a person would go to prison for life after three violent or serious felonies. The idea quickly spread to other states, but none of them chose to adopt a law as extensive as California's. By 2004, twenty-six states and the federal government had laws that can be called \"three-strikes\" laws. Each of these laws said that a third felony conviction brings a sentence of 20 years to life in prison. The person must serve 20 years before they can qualify for parole. A 1997 study found that in California, \"the three-strikes law did not decrease serious crime or petty theft rates below the level expected on the basis of preexisting trends.\" == References == Category:Criminal justice Category:United States law",
 "title": "Three-strikes law"
}