{
 "id": "993627",
 "text": "Most healthcare in the United Kingdom comes from the National Health Service. NHS treatment is free. There are charges for prescriptions, dentistry and glasses, but not everybody has to pay. The UK spent about 20% less per person than similar countries from 2010 to 2022. In 2023 the Institute for Fiscal Studies produced a report saying that the number of people working for the NHS in England will rise from around 1.5 million in 2021-22 to between 2.3 and 2.4 million in 2036-37. That would be about one in 11 workers and half of all public sector workers. People can pay for medical treatment. Some people pay because they dont want to wait. The NHS does not do cosmetic treatment. It will not do things the National Institute for Health and Care Excellence does not consider good value. Dentists and opticians are private businesses which mostly offer private treatment as well as NHS treatment. General practitioners are mostly private businesses but very few do private work. NHS hospitals are allowed to do private work. It must not be more than 50% of their income. Only a few specialist NHS hospitals in London do a lot of private work. In 2022 about 1.7 million people in the UK had private health insurance. In 2020 there were 187 private hospitals in the United Kingdom with 7956 beds. * HCA Healthcare has over 30 facilities in London and Manchester. It is the largest private hospital group. * Spire Healthcare is the second largest private hospital group. It had 39 hospitals with 1870 beds. * Cleveland Clinic has a 184-bed hospital in London and a large clinic. 66,000 of the 200,000 non-NHS patients treated in the private hospitals between July and September 2022 paid themselves. The rest were covered by health insurance. Most of the private hospitals do work for the NHS as well as that paid for privately. As most do not have intensive care units they mostly do easier work on people who are younger and healthier so the NHS is left with the more difficult work. If things go wrong with private patients they may have to be sent by ambulance to an NHS hospital. The number of people waiting a long time for tests or operations has gone up, so more people are paying for them to be done privately. A lot more mental health care is run commercially than physical care. About 30% of mental health hospital beds are private, and 97% of \"locked ward rehabilitation\" beds. Almost all of this is paid for by the NHS. There were 238 independent NHS mental health services in England in 2022. The Care Quality Commission said 64 were not very good. Cygnet Health Care is the biggest. It runs services in 130 places in England. There have been many bad things happen in them. NHS England pays directly for some of them. They are not happy with the services. Long term care in nursing homes in England is almost all private. == Related pages == * Pharmacy in the United Kingdom * Dentistry in the United Kingdom == References ==",
 "title": "Healthcare in the United Kingdom"
}