{
 "id": "993631",
 "text": "Joshua Patrick Allen (born May 21, 1996) is an American football player. He is currently the starting quarterback for the Buffalo Bills of the National Football League (NFL). Allen played college football at Wyoming after transferring there from Reedley College, a community college in California, where he grew up. After playing well at Wyoming, he was selected by the Bills in the NFL Draft. Allen has since broken many records for the team, also leading them to the playoffs five times. He is known for his very strong arm while throwing the football and ability to run with the ball. == Early life and junior college years == Allen grew up on a farm, which he often helped his family with. He played three sports. Because he didn't go to a more famous school and was quite skinny at the time, he was overlooked by many colleges with Division I football teams, including his local Fresno State Bulldogs. He had to play one year at a community college called Reedley College. The University of Wyoming gave him a chance after looking over his high school and Reedley College film. == College career == After being rejected by Eastern Michigan and Fresno State one last time, Allen committed to Wyoming. He enrolled there before the 2015 season, after they gave him a scholarship. He had grown from 6'3\" and 180 pounds to 6'5\" and 210 pounds. In his first year, he broke his collarbone during his first game and had to sit out the rest of the year. He played through his next two years at Wyoming, helping the football team win many games. == Professional career == Allen was picked 7th overall by the Buffalo Bills in the 2018 NFL Draft. In his first year, he struggled a bit, but had a good game against the Minnesota Vikings. He not only helped Buffalo win, but jumped over Anthony Barr, a linebacker just as big as he was. Allen missed four games after hurting his right elbow, but came back and did a little better. He finished with a very good game against the Miami Dolphins in which he scored 5 total touchdowns. He ended up breaking several rookie records for the team that year, even though he was not very accurate throwing the ball. Allen improved a little more in 2019 and led the Bills to a playoff game. He did even better in 2020 after working on his technique. He passed for over 4,500 yards and 37 touchdowns. He completed nearly 70 percent of his passes, the fourth best rate that season, after two years of being one of the least accurate quarterbacks in the league. His rapid improvement surprised even some people at ESPN, who thought he would never play this well. The Bills also won 13 games that year and made it to the AFC Championship game, where they lost to Patrick Mahomes and the Kansas City Chiefs. Since then, the Bills have won two more divisional championships under Allen, who remains one of the best quarterbacks in the league. The Bills rematched with the Chiefs in the 2021 NFL playoffs, playing a tight game until the Chiefs won in overtime after tying the game with only 13 seconds left in the 4th quarter. ==References== Category:1996 births Category:Living people Category:Buffalo Bills players Category:American football quarterbacks Category:Sportspeople from California",
 "title": "Josh Allen (quarterback)"
}