{
 "id": "993775",
 "text": "The 2008 Pro Bowl was the National Football League's all-star game for the 2007 season. It was played at Aloha Stadium in Honolulu, Hawaii on February 10, 2008. The game shown in the United States on Fox and began at 11:40am local time (4:40pm EST). The NFC won, 42–30, despite a 17-point first half AFC lead. NFC running back Adrian Peterson rushed 16 times for 129 yards and was named the game's MVP. ==AFC roster== ===Offense=== Position Starter(s) Reserve(s) Alternate(s) Quarterback Tom Brady, New England Peyton Manning, Indianapolis Ben Roethlisberger, Pittsburgh Derek Anderson, Cleveland Running back LaDainian Tomlinson, San Diego Joseph Addai, Indianapolis Willie Parker, Pittsburgh Fred Taylor, Jacksonville Willis McGahee, Baltimore Fullback Lorenzo Neal, San Diego Wide receiver Randy Moss, New England Reggie Wayne, Indianapolis Braylon Edwards, Cleveland T.J. Houshmandzadeh, Cincinnati Chad Johnson, Cincinnati Tight end Antonio Gates, San Diego Tony Gonzalez, Kansas City Kellen Winslow II, Cleveland Offensive tackle Matt Light, New England Jason Peters, Buffalo Jonathan Ogden, Baltimore Joe Thomas, Cleveland Marcus McNeill, San Diego Offensive guard Alan Faneca, Pittsburgh Logan Mankins, New England Kris Dielman, San Diego Center Jeff Saturday, Indianapolis Dan Koppen, New England ===Defense=== Position Starter(s) Reserve(s) Alternate(s) Defensive end Jared Allen, Kansas City Kyle Vanden Bosch, Tennessee Jason Taylor, Miami Aaron Schobel, Buffalo Defensive tackle Albert Haynesworth, Tennessee Vince Wilfork, New England Jamal Williams, San Diego Casey Hampton, Pittsburgh Outside linebacker James Harrison, Pittsburgh Mike Vrabel, New England Shawne Merriman, San Diego Inside linebacker DeMeco Ryans, Houston Ray Lewis, Baltimore Cornerback Champ Bailey, Denver Asante Samuel, New England Antonio Cromartie, San Diego Free safety Ed Reed, Baltimore Strong safety Bob Sanders, Indianapolis Troy Polamalu, Pittsburgh John Lynch, Denver Antoine Bethea, Indianapolis ===Special teams=== Position: Player: Punter Shane Lechler, Oakland Placekicker Rob Bironas, Tennessee Kick returner Joshua Cribbs, Cleveland Special teamer Kassim Osgood, San Diego Long snapper Ryan Pontbriand, Cleveland ==NFC roster== ===Offense=== Position Starter(s) Reserve(s) Alternate(s) Quarterback Brett Favre, Green Bay Tony Romo, Dallas Matt Hasselbeck, Seattle Jeff Garcia, Tampa Bay Running back Adrian Peterson, Minnesota Marion Barber III, Dallas Brian Westbrook, Philadelphia Fullback Tony Richardson, Minnesota Wide receiver Larry Fitzgerald, Arizona Terrell Owens, Dallas Donald Driver, Green Bay Torry Holt, St. Louis Tight end Jason Witten, Dallas Chris Cooley, Washington Offensive tackle Flozell Adams, Dallas Walter Jones, Seattle Chris Samuels, Washington Chad Clifton, Green Bay Offensive guard Leonard Davis, Dallas Steve Hutchinson, Minnesota Shawn Andrews, Philadelphia Center Andre Gurode, Dallas Matt Birk, Minnesota ===Defense=== Position Starter(s) Reserve(s) Alternate(s) Defensive end Aaron Kampman, Green Bay Patrick Kerney, Seattle Osi Umenyiora, N.Y. Giants Trent Cole, Philadelphia Defensive tackle Kevin Williams, Minnesota Pat Williams, Minnesota Tommie Harris, Chicago Darnell Dockett, Arizona Outside linebacker Julian Peterson, Seattle DeMarcus Ware, Dallas Lance Briggs, Chicago Greg Ellis, Dallas Inside linebacker Lofa Tatupu, Seattle Patrick Willis, San Francisco Cornerback Al Harris, Green Bay Marcus Trufant, Seattle Terence Newman, Dallas Free safety Sean Taylor, Washington Ken Hamlin, Dallas Strong safety Darren Sharper, Minnesota Roy Williams, Dallas ===Special teams=== Position: Player: Punter Andy Lee, San Francisco Placekicker Nick Folk, Dallas Kick returner Devin Hester, Chicago Special teamer Brendon Ayanbadejo, Chicago Long snapper Ethan Albright, Washington Notes: :Replacement selection due to injury or vacancy :Injured player; selected but did not play :Replacement starter; selected as reserve :\"Need player\"; named by coach :Posthumous selection : Wore 21 in honor of Sean Taylor :Replacement for posthumous selection Sean Taylor ==References== 2008 Category:2007 National Football League season",
 "title": "2008 Pro Bowl"
}