{
 "id": "993784",
 "text": "The 2002 season was the New England Patriots' 33rd in the National Football League (NFL), their 43rd overall and their third under head coach Bill Belichick. ==Offseason== Additions Subtractions TE Cam Cleeland (Saints) QB Drew Bledsoe (Bills) TE Christian Fauria (Seahawks) WR Terry Glenn (Packers) WR Donald Hayes (Panthers) LB Bryan Cox (Saints) DE Rick Lyle (Jets) WR Charles Johnson (Bills) DT Brandon Mitchell (Seahawks) TE Rod Rutledge (Texans) CB Terrance Shaw (Raiders) ===2002 NFL Draft=== 2002 New England Patriots draft Draft order Player name Position College Notes Round Selection 1 21 Daniel Graham Tight end Colorado The Patriots traded their first-, third- and seventh-round draft picks to the Washington Redskins for the Redskins' first-round pick. Patriots.com summary. 2 65 Deion Branch Wide receiver Louisville 4 117 Rohan Davey Quarterback LSU The Patriots traded fourth- and fifth-round draft picks to the Denver Broncos for the Broncos' fourth-round pick. The Patriots received the fifth-round pick in a trade with the Jacksonville Jaguars for the Patriots' sixth-round pick in the 2001 NFL Draft. Patriots.com summary 4 126 Jarvis Green Defensive end LSU The Patriots received a fourth-round pick from the Green Bay Packers in a trade for Terry Glenn and a conditional pick in the 2003 NFL Draft. Patriots.com summary 7 237 Antwoine Womack Running back Virginia The Patriots traded a fifth-round pick to the Dallas Cowboys for the Cowboys' fifth- and seventh-round draft picks. Patriots.com summary 7 253 David Givens Wide receiver Notre Dame Compensatory pick ==Final roster== ==Regular season== ===Schedule=== Week Date Opponent Result Record Venue Recap 1 Pittsburgh Steelers W 30–14 1–0 Gillette Stadium Recap 2 September 15 at New York Jets W 44–7 2–0 Giants Stadium Recap 3 September 22 Kansas City Chiefs W 41–38 3–0 Gillette Stadium Recap 4 September 29 at San Diego Chargers L 14–21 3–1 Qualcomm Stadium Recap 5 October 6 at Miami Dolphins L 13–26 3–2 Pro Player Stadium Recap 6 October 13 Green Bay Packers L 10–28 3–3 Gillette Stadium Recap 7 Bye 8 October 27 Denver Broncos L 16–24 3–4 Gillette Stadium Recap 9 November 3 at Buffalo Bills W 38–7 4–4 Ralph Wilson Stadium Recap 10 November 10 at Chicago Bears W 33–30 5–4 Memorial Stadium Recap 11 November 17 at Oakland Raiders L 20–27 5–5 Network Associates Coliseum Recap 12 November 24 Minnesota Vikings W 24–17 6–5 Gillette Stadium Recap 13 November 28 at Detroit Lions W 20–12 7–5 Ford Field Recap 14 December 8 Buffalo Bills W 27–17 8–5 Gillette Stadium Recap 15 at Tennessee Titans L 7–24 8–6 The Coliseum Recap 16 December 22 New York Jets L 17–30 8–7 Gillette Stadium Recap 17 December 29 Miami Dolphins W 27–24 9–7 Gillette Stadium Recap ==Standings== ==Notes and references== ==Other websites== *Season page on Pro Football Reference *New England Patriots Super Bowl History Category:2002 in sports Category:New England Patriots seasons",
 "title": "2002 New England Patriots season"
}