{
 "id": "993739",
 "text": "The National Football League 2010s All-Decade Team is made up of good players in the National Football League in the ten years spanning 2010-2019\\. Only a player or coach's play in the 2010s is used for voting. ==The team== Note 1: Players are listed alphabetically within first and second teams Note 2: Only teams for which a player played in a game from 2010–2019 are listed. Teams with whom a player signed but never played or played only before or after are not listed. Note 3: Under \"Hall of Fame?\" if a year is listed like \"e-2022\", that is the year player is eligible for the Pro Football Hall of Fame. ^ In Pro Football Hall of Fame ¤ Finalist for the Hall of Fame ===Offense=== Position Player Hall of Fame Quarterback Tom Brady* (New England Patriots) e-2028 Aaron Rodgers (Green Bay Packers) Active Running back Frank Gore (San Francisco 49ers, Indianapolis Colts, Miami Dolphins, Buffalo Bills) e-2026 Marshawn Lynch (Buffalo Bills, Seattle Seahawks, Oakland Raiders) e-2025 LeSean McCoy (Philadelphia Eagles, Buffalo Bills, Kansas City Chiefs) e-2026 Adrian Peterson* (Minnesota Vikings, New Orleans Saints, Arizona Cardinals, Washington Redskins) e-2027 Wide receiver Antonio Brown (Pittsburgh Steelers, New England Patriots) e-2027 Larry Fitzgerald (Arizona Cardinals) e-2026 Calvin Johnson^ (Detroit Lions) Yes Julio Jones (Atlanta Falcons) Active Tight end Rob Gronkowski (New England Patriots) e-2027 Travis Kelce (Kansas City Chiefs) Active Flex Darren Sproles (San Diego Chargers, New Orleans Saints, Philadelphia Eagles) e-2025 Tackle Jason Peters (Philadelphia Eagles) Active Tyron Smith (Dallas Cowboys) Active Joe Staley (San Francisco 49ers) e-2025 Joe Thomas* (Cleveland Browns) 1 time finalist Guard Jahri Evans (New Orleans Saints, Green Bay Packers) No Logan Mankins (New England Patriots, Tampa Bay Buccaneers) No Zack Martin (Dallas Cowboys) Active Marshal Yanda* (Baltimore Ravens) e-2025 Center Alex Mack (Cleveland Browns, Atlanta Falcons) e-2027 Maurkice Pouncey (Pittsburgh Steelers) e-2026 ===Defense=== Position Player Hall of Fame Defensive end Calais Campbell (Arizona Cardinals, Jacksonville Jaguars) Active Cameron Jordan (New Orleans Saints) Active Julius Peppers (Chicago Bears, Green Bay Packers, Carolina Panthers) e-2024 J. J. Watt* (Houston Texans) e-2028 Defensive tackle Geno Atkins (Cincinnati Bengals) e-2026 Fletcher Cox (Philadelphia Eagles) Active Aaron Donald* (St. Louis/Los Angeles Rams) Active Ndamukong Suh (Detroit Lions, Miami Dolphins, Los Angeles Rams, Tampa Bay Buccaneers) Active Linebacker Chandler Jones (New England Patriots, Arizona Cardinals) Active Luke Kuechly (Carolina Panthers) e-2025 Khalil Mack (Oakland Raiders, Chicago Bears) Active Von Miller* (Denver Broncos) Active Bobby Wagner (Seattle Seahawks) Active Patrick Willis (San Francisco 49ers) 2 time finalist Cornerback Patrick Peterson (Arizona Cardinals) Active Darrelle Revis (New York Jets, Tampa Bay Buccaneers, New England Patriots, Kansas City Chiefs) 1 time finalist Richard Sherman (Seattle Seahawks, San Francisco 49ers) Active Defensive back Chris Harris Jr. (Denver Broncos, Los Angeles Chargers) Active Tyrann Mathieu (Arizona Cardinals, Houston Texans, Kansas City Chiefs) Active Safety Eric Berry (Kansas City Chiefs) No Earl Thomas (Seattle Seahawks, Baltimore Ravens) e-2025 Eric Weddle (San Diego Chargers, Baltimore Ravens, Los Angeles Rams) e-2027 ===Special teams=== Position Player Hall of Fame? Kicker Stephen Gostkowski ( New England Patriots) e-2026 Justin Tucker* (Baltimore Ravens) Active Punter Johnny Hekker (St. Louis/Los Angeles Rams) Active Shane Lechler (Oakland Raiders, Houston Texans) No Kick returner Devin Hester (Chicago Bears, Atlanta Falcons, Baltimore Ravens, Seattle Seahawks) 2 time finalist Cordarrelle Patterson (Minnesota Vikings, Oakland Raiders, New England Patriots, Chicago Bears) Active Punt returner Tyreek Hill (Kansas City Chiefs) Active Darren Sproles (San Diego Chargers, New Orleans Saints, Philadelphia Eagles) e-2025 ===Coach=== Position Name Hall of Fame? Coach Bill Belichick (New England Patriots) Active Pete Carroll (Seattle Seahawks) Active \\-- denotes a unanimous selection ==Other websites== *Sports Illustrated 2010s All-Decade Team *USA TODAY NFL All-Decade Team *NFL.com 2010s All-Decade Team *The Athletic NFL all-decade team *PFF 2010s All-Decade Team *Yahoo Sports' NFL all-decade team *Talk Of Fame Network 2010 NFL all-decade team *GridFe 2010s All-Decade Team Category:National Football League All-Decade Teams Category:National Football League lists Category:National Football League records and achievements",
 "title": "National Football League 2010s All-Decade Team"
}