{
 "id": "993773",
 "text": "The 2005 Pro Bowl was the NFL's all-star game for the 2004 season. The game was played February 13, 2005, at Aloha Stadium in Honolulu, Hawaii. The final score was AFC 38 – NFC 27. The most valuable player was Peyton Manning of the Colts. ==AFC roster== ===Offense=== Position Starter(s) Reserve(s) Alternate(s) Quarterback Peyton Manning, Indianapolis Tom Brady, New England Drew Brees, San Diego Running back Curtis Martin, N.Y. Jets LaDainian Tomlinson, San Diego Edgerrin James, Indianapolis Corey Dillon, New England Rudi Johnson, Cincinnati Jerome Bettis, Pittsburgh Fullback Tony Richardson, Kansas City Wide receiver Marvin Harrison, Indianapolis Chad Johnson, Cincinnati Andre Johnson, Houston Hines Ward, Pittsburgh Tight end Antonio Gates, San Diego Tony Gonzalez, Kansas City Offensive tackle Jonathan Ogden, Baltimore Willie Anderson, Cincinnati Tarik Glenn, Indianapolis Willie Roaf, Kansas City Marvel Smith, Pittsburgh Offensive guard Alan Faneca, Pittsburgh Will Shields, Kansas City Brian Waters, Kansas City Center Kevin Mawae, N.Y. Jets Jeff Hartings, Pittsburgh Source ===Defense=== Position Starter(s) Reserve(s) Alternate(s) Defensive end Dwight Freeney, Indianapolis Jason Taylor, Miami John Abraham, N.Y. Jets Aaron Smith, Pittsburgh Defensive tackle Sam Adams, Buffalo Marcus Stroud, Jacksonville Richard Seymour, New England John Henderson, Jacksonville Outside linebacker Takeo Spikes, Buffalo Terrell Suggs, Baltimore Joey Porter, Pittsburgh Inside linebacker James Farrior, Pittsburgh Ray Lewis, Baltimore Tedy Bruschi, New England Cornerback Champ Bailey, Denver Tory James, Cincinnati Chris McAlister, Baltimore Patrick Surtain, Miami Nate Clements, Buffalo Free safety John Lynch, Denver Strong safety Ed Reed, Baltimore Troy Polamalu, Pittsburgh ===Special teams=== Position: Player: Alternate: Punter Shane Lechler, Oakland Placekicker Adam Vinatieri, New England Kick returner Terrence McGee, Buffalo Special teamer Larry Izzo, New England Long snapper Kendall Gammon, Kansas City Source ==NFC roster== ===Offense=== Position Starter(s) Reserve(s) Alternate(s) Quarterback Donovan McNabb, Philadelphia Daunte Culpepper, Minnesota Michael Vick, Atlanta Running back Tiki Barber, N.Y. Giants Ahman Green, Green Bay Shaun Alexander, Seattle Brian Westbrook, Philadelphia Fullback William Henderson, Green Bay Wide receiver Muhsin Muhammad, Carolina Joe Horn, New Orleans Javon Walker, Green Bay Terrell Owens, Philadelphia Torry Holt, St. Louis Tight end Alge Crumpler, Atlanta Jason Witten, Dallas Offensive tackle Walter Jones, Seattle Orlando Pace, St. Louis Tra Thomas, Philadelphia Flozell Adams, Dallas Offensive guard Larry Allen, Dallas Marco Rivera, Green Bay Steve Hutchinson, Seattle Center Olin Kreutz, Chicago Matt Birk, Minnesota ===Defense=== Position Starter(s) Reserve(s) Alternate(s) Defensive end Bertrand Berry, Arizona Julius Peppers, Carolina Patrick Kerney, Atlanta Defensive tackle La'Roi Glover, Dallas Shaun Rogers, Detroit Kevin Williams, Minnesota Outside linebacker Keith Brooking, Atlanta Marcus Washington, Washington Derrick Brooks, Tampa Bay Mark Fields, Carolina Inside linebacker Dan Morgan, Carolina Jeremiah Trotter, Philadelphia Cornerback Ronde Barber, Tampa Bay Lito Sheppard, Philadelphia Dre' Bly, Detroit Free safety Brian Dawkins, Philadelphia Roy Williams, Dallas Strong safety Michael Lewis, Philadelphia ===Special teams=== Position: Player: Alternate: Punter Mitch Berger, New Orleans Placekicker David Akers, Philadelphia Kick returner Eddie Drummond, Detroit Allen Rossum, Atlanta Special teamer Ike Reese, Philadelphia Long snapper Brian Jennings, San Francisco Source Notes: :Replacement selection due to injury or vacancy :Injured player; selected but did not play :Replacement starter; selected as reserve :\"Need player\"; named by coach ==References== Category:Pro Bowl Pro Bowl",
 "title": "2005 Pro Bowl"
}