{
 "id": "994139",
 "text": "The 1997 NCAA Division I-A football season was play of college football by the National Collegiate Athletic Association teams at the Division I-A level. It began in the summer of 1997 and culminated with the bowl games in early January 1998. ==Conference standings== ==AP Poll progress== WEEK No. 1 No. 2 No. 3 Event PRE-1 Penn State+ Florida Florida State 2 Penn State+ Florida Tennessee 3 Penn State+ Florida Washington+ 4 Penn State+ Washington+ Florida 5-7 Florida Penn State+ Nebraska 8 Penn State+ Nebraska Florida State 9-11 Nebraska Penn State+ Florida State 12-13 Michigan+ Florida State Nebraska 14-16 Michigan+ Nebraska Tennessee +Penn State and Michigan were Big Ten teams, and Washington was a Pac-10 team. The Big Ten and Pac-10 conferences played in the Rose Bowl rather than the Bowl Alliance championship game. ==Bowl games== BOWL Location Rose Bowl No. 1 Michigan 21 No. 8 Washington State 16 Pasadena Orange Bowl No. 2 Nebraska 42 No. 3 Tennessee 17 Miami Sugar Bowl No. 4 Florida State 31 No. 9 Ohio State 14 New Orleans No. 5 UCLA 29 No. 20 Texas A&M; 23 Dallas No. 6 Florida 21 No. 11 Penn State 6 Orlando Gator Bowl No. 7 North Carolina 42 Virginia Tech 3 Jacksonville Fiesta Bowl No. 10 Kansas State 35 No. 14 Syracuse 18 Tempe, Arizona Outback Bowl No. 12 Georgia 33 Wisconsin 6 Tampa No. 13 Auburn 21 Clemson 17 Atlanta No. 15 LSU 27 Notre Dame 9 Shreveport Sun Bowl No. 16 Arizona State 17 Iowa 7 El Paso Alamo Bowl No. 17 Purdue 33 No. 24 Oklahoma State 20 San Antonio Holiday Bowl No. 18 Colorado State 35 No. 20 Missouri 24 San Diego Aloha Bowl No. 21 Washington 51 Michigan St 23 Honolulu No. 22 Southern Mississippi 41 Pittsburgh 7 Memphis No. 25 Georgia Tech 35 West Virginia 30 Miami Insight.com Bowl Arizona 20 New Mexico 14 Tucson, Arizona Las Vegas Bowl Oregon 41 Air Force 13 Las Vegas Mississippi 34 Marshall 31 Detroit Humanitarian Bowl Cincinnati 35 Utah State 19 Boise ==Final AP Poll== # Michigan # Nebraska # Florida State # Florida # UCLA # North Carolina # Tennessee # Kansas St. # Washington St. # Georgia # Auburn # Ohio St. # LSU # Arizona St. # Purdue # Penn St. # Colorado St. # Washington # So. Mississippi # Texas A&M; # Syracuse # Mississippi # Missouri # Oklahoma St. # Georgia Tech Category:National Collegiate Athletic Association Category:1997 in sports Category:1998 in sports Category:College football",
 "title": "1997 NCAA Division I-A football season"
}