{
 "id": "994246",
 "text": "Sweden Finns' Day (; ) is an anniversary celebrated in Sweden on 24 February. The anniversary was approved by the Swedish Academy in 2010. It was held for the first time in 2011.\"Sverigefinländarnas dag firas den 24 februari\" - Finland.se (in Swedish) 24 February was picked as the date of the anniversary because it was the birthday of Carl Axel Gottlund. He was a defender of speaking the Finnish language.Pressmeddelande om Sverigefinnarnas dag - Finlandsinstitutet (in Swedish) The purpose of the day is to celebrate the history, language and culture of people with Finnish heritage living in Sweden. Sverigefinnarnas dag - Swedish Academy (in Swedish) Towns that have large numbers of Finnish-speaking people raise the Sweden Finnish flag on Sweden Finns' Day.Ruotsinsuomalaisten lippu liehuu yli 50 kunnassa ruotsinsuomalaisten päivänä - Sisuradio (in Finnish) But this day is not a flag day approved by the government.Ruotsinsuomalaisten päivä kalenteriin - Sisuradio (in Finnish) The anniversary is observed in parts of Sweden, including Stockholm, Eskilstuna, Gothenburg, Västerås and Nykvarn. The day's events have included concerts, dance performances, writer visits, karaoke dances and theater plays for children. For example, in 2017, more than a thousand people attended the celebration at Stockholm City Hall.Ruotsinsuomalaisten päivä valtasi Tukholman keskustan - SVT News (in Finnish) In 2013, the celebration was large in many places.Hieno ruotsinsuomalaisten päivä, paitsi kookosleivät liian kovia - Ruotsinsuomalaisten päivä - Sisuradio (in Finnish) In 2019, the seal was selected by the listeners of Sveriges Radio's Finnish-language channel Sveriges Radio Finska as the national animal of the Sweden Finns.Ruotsinsuomalaisten kansalliseläin on hylje - Ruotsinsuomalaisten päivä - Sisuradio (in Finnish) == Related pages == * Meänkieli == References == == Other websites == * Extra festligt på Sverigefinnarnas dag i år at Minoritet.se (in Swedish) Category:Swedish culture Category:Finnish culture",
 "title": "Sweden Finns' Day"
}