{
 "id": "994323",
 "text": "Stephan Crétier (born 8 August 1963) is a Canadian businessman, entrepreneur and philanthropist. He is the founder and chief executive officer of GardaWorld,. It is one of the largest privately owned security providers in the world. Crétier founded GardaWorld in 1995 with an investment of $25,000, which he raised by placing a second mortgage on his home. The company now generates over $5 billion in annual revenues and is a global champion in the security industry, with 132 000 employees worldwide. Over the past 25 years, Crétier has pushed the expansion of his company into the security, risk management and cash services sectors, having grown the company organically and through strategic acquisitions across Canada and into the United States, Europe, Latin America, the Middle East, Asia, and Africa. In addition to being a leading best-in-class global security provider, GardaWorld today owns & operates Crisis24, the leading integrated risk management company servicing the world’s most influential people, disruptive brands and prominent organisations and Sesami, a global innovative cash ecosystem performance and technology company. Recognized as Young Entrepreneur of the Year in 1998, Growth Leader by Profit 100 magazine for 11 consecutive years, and Great Entrepreneur of the Year in 2006, Crétier was named one of Canada's Entrepreneurs of the Decade by Profit Magazine in 2009 and recipient of the Queen Elizabeth II Diamond Jubilee Medal in 2012. He took the company private in a $1.1 billion transaction with support from private equity firm Apax Partners. In July 2019, he led the largest buyout in Canadian history in a transaction worth $5.2 bn with private equity firm BC Partners where Crétier now owns with selected management 49% of GardaWorld. == Other activities == Stephan Crétier is a board member of the Hirshhorn Museum, a Smithsonian Institution in Washington, DC, and the Montreal Economic Institute, a leader free-market think tank. Stephan Crétier is the proprietor of Roy Estate winery described by wine critic Robert Parker Jr from Wine Advocate as ‘a hidden gem’ producing some of Napa Valley’s most sought after wines. == Philanthropy == In November 2019, the Montreal Museum of Fine Arts unveiled the Stephan Crétier and Stéphany Maillery Wing for the Arts of One World. The wing’s 10 fully refurbished galleries present a dialogue between works from ancient and traditional cultures and those by local and international contemporary artists, framed in a renewed intercultural and transhistorical perspective. An exceptional tool for discovering and understanding cultural diversity in Canada and around the world, past and present, this new wing displays a rich selection from the Museum’s collection, including over 10,000 archaeological objects and works by artists from many different cultures. The Museum’s encyclopedic collection is one of the oldest and most prestigious in Canada. The 1,025 m2 of the Stephan Crétier and Stéphany Maillery wing contain more than 1,500 objects and works by artists who hail from every continent. Located in the Jean-Noël Desmarais Pavilion, the largest and most visited of the Museum’s five pavilions, the wing presents treasures from Africa, Asia, the Mediterranean, the Middle East, Oceania and the Americas dating from the 4th millennium B.C.E. to today. It invites visitors to take a fresh, 360-degree look at our early heritage and contemporary creations. The presentation design goes beyond the discourse of art history to highlight the exchanges that have occurred and continue to occur between cultures, while displaying present-day disciplines and social concerns. Situated in the heart of a humanist and socially engaged museum, the wing promotes inclusive values that reflect Montreal, a metropolis made up of close to 120 cultural communities. It invites people of different cultures to come together to better understand one another at a time, in this 21st century, when togetherness has become an issue of vital importance. In November 2022, the Stephan Crétier and Stéphany Maillery Peace Circle will be inaugurated which will be situated at the heart of the Vimy Foundation Centennial Park. It will embody both core missions of the Park; creating a reflective space for remembrance of those Canadians who served and were killed at Vimy Ridge and other sites during the First World War and a symbol of Peace and Reconciliation. == References == Category:1963 births Category:Living people Category:Canadian businesspeople",
 "title": "Stephan Crétier"
}