{
 "id": "994536",
 "text": "DSV Leoben KAIF Energy is an Austrian football club from the Donawitz district of the Styrian town of Leoben. They play in the playing in the third-tier Regionalliga Mitte since the 2022/23 season. ==History== ===WSV Donawitz=== The club was founded on 1 February 1928 as Werkssportverein Donawitz. The colours were green-white. They played their first season at the top Styrian league in 1930/31. WSV reached the title in 1939 but lost the playoffs for promotion to the Gauliga Ost after losing to FC Wien, Linzer ASK and WSV BU Neunkirchen. That same year, Donawitz became part of Leoben but WSV kept its name. 1944 the club was dissolved and a quick restart after the war was out of question , especially since the sports field was used as a tank parking lot.Homepage DSV Leoben Football was reestablished in Donawitz in 1949 . In 1955 they won another title and were promoted to the second tier of Austrian football. In 1958 WSV Donawitz won promotion to the top tier, only to be relegated back after two years. ===DSV Alpine=== In 1970 the club was renamed WSV Alpine Donawitz .1971 they won promotion back to the country's top tier. On 3 May 1971, the club was renamed again to Donawitzer SV Alpine or just DSV Alpine. They came 6th in the league in 1972 and 1974. After the 1973/74 season the club was forced to the 2nd tier because the number of teams in the league was decreased from 17 to 10 clubs and only one team from Styria (Sturm Graz) was included. They only got back to the top tier in 1984 and remained there until 1986. After that they had they had another spell from 1991 until 1992. They were 10 years in the Austrian Bundesliga. ===DSV Leoben=== After relegation in 1992 DSV Alpine and 1. FC Leoben merged to DSV Leoben . The club was founded on 22 June 1992. Their first success was reaching the 1995 Austrian Cup final. They lost to SK Rapid Wien . In 2009 the club went bankrupt. The DSV now competed in the third-class Regionalliga Mitte. From the 2013/2014 season, DSV Leoben played in the Styrian league. 2021/22 they won the league and were promoted to the Regionalliga Central. In the 2022-23 season they were promoted to 2. League. ==Current squad== DSV Leoben-Kader ==Staff== Name Birth Country in Donawitz since Last team Trainer René Poms 05.07.1975 08/2023 NK Osijek Co-Trainer Dino Škvorc 02.02.1990 07/2022 Spieler Torwarttrainer Philipp Martin 01.11.88 01/2023 Grazer AK Yôuth Homepage DSV Leoben ==Coaching history (21st century)== Mitarbeiter DSV Leoben Retrieved 21 August 2023 Start End Coach 1999 2002 Milan Djuricic 2001 2003 Petar Segrt 2003 2005 Heinz Thonhofer 2005 2007 Dejan Stankovic 2007 2007 Manfred Kohlbacher 2007 2008 Walter Kogler 2008 2009 Heimo Kump 2009 2009 Dejan Stankovic 2009 2010 Richard Niederbacher 2010 2011 Andreas Kindlinger 2011 2012 Gregor Pötscher 2012 2012 Bernhard Muhr 2012 2012 Adolf Pinter 2012 2012 Manfred Unger 2012 2012 Jürgen Auffinger 2012 2013 Heinz Karner 2013 2015 Gregor Pötscher 2015 2018 Jürgen Auffinger 2018 2018 Gottfried Jantschgi 2018 2018 Helmut Kalander 2018 2018 Jürgen Kogler 2018 2019 Hannes Reinmayr 2019 2020 Ivo Gölz 2020 2023 Carsten Jancker 2023 Rene Poms ==Other websites== * Official website ==References== Graz, SK Sturm Category:Football clubs of Styria Category:1928 establishments in Europe Category:1920s establishments in Austria",
 "title": "DSV Leoben"
}