{
 "id": "994843",
 "text": "Marine Parade is a planning area and residential estate located in the Central Region of Singapore. Marine Parade is on the tip of the East Coast Park. Marine Parade is at the eastern portion of the Central Reigion. It boarders five other planning areas. It is the planning areas of Geylang to the north, Kallang to the northwest, Bedok to the northeast, Marina East to the southwest and the Singapore Straits to the south. == History == === Before World War Two === Throughout the early to mid 20th century, Marine Parade was a haven for the wealthy community of Singapore. Katong Laska was also founded in Marine Parade around this time. === After World War Two === Since World War Two affected Singapore, after the war, Marine Parade was heavily destroyed. Due to the destruction, a seawall needed repair and the area needed redevelopment. After an argument between the colonial government and the city council, S$318,000 was given to the city council. That money was used to repair the seawall and develop Marine Parade. === After independence === In 1966, the Singaporean government wanted to improve the East Coast in Singapore. It by reclaiming land and building new public housing estates. In 1966, land reclamation works were started around Marine Parade as part of the larger reclamation project planned for the East Coast. In the 1970s, the estate was mostly completed. There were new Housing Development Board (HDB) blocks and spaces for the residents. Marine Parade mainly consists of HDB flats. Today, many private condominiums are also being built in the area. == Infrastructure == === Mass Rapid Transit === Marine Parade will be soon served by a few stations on the Mass Rapid Transit network. It will be served on the Thomson- East Coast Line. It will be opened in stage four, which is in 2024. === Community Building === The Marine Parade Community Building is a three story complex. It was completed in 2000. The complex is famous for it's wall mural around the building. It is called \"Texturefulness of Life\". The building is home to the Marine Parade Community Club, the Marine Parade Public Library and a performing arts group, The Necessary Stage. === Town Centre === ==== Marine Parade Promenade ==== Marine Parade is served by a town centre. Named the Marine Parade Promenade, the centre itself consists of several neighbourhood shops, Parkway Centre and a commercial complex. The complex is named Parkway Parade and it houses offices and a shopping mall. ==== Marine Terrace Haven ==== Marine Terrace Haven consists of many shops. It houses the Marine Parade Town Council Office and Marine Parade Neighbourhood Police Centre. == Education == Marine Parade has many schools. The bottom shows the schools in Marine Parade. * Primary Schools ** CHIJ (Katong) Primary ** Ngee Ann Primary School ** Tao Nan School ** Haig Girls' School * Secondary Schools ** CHIJ Katong Convent ** St. Patrick's School ** Chung Cheng High School (Main) ** Tanjong Katong Secondary School ** Tanjong Katong Girls' School ** Victoria School * Junior College ** Victoria Junior College == References == == Other websites == * Marine Parade Town Council Category:Places in Singapore",
 "title": "Marine Parade"
}