{
 "id": "994838",
 "text": "The siege of Vienna, in 1529, was the first attempt by the Ottoman Empire to capture Vienna, the capital of Austria and of the Holy Roman Empire. Suleiman the Magnificent, the sultan of the Ottomans, attacked the city with over 100,000 men, and the defenders, led by Nicholas, Count of Salm, numbered no more than 21,000. Nevertheless, Vienna survived the siege, which ultimately lasted just over two weeks, from 27 September to 15 October, 1529. The siege came in the aftermath of the 1526 Battle of Mohács, which had resulted in the death of Louis II, King of Hungary, and the descent of the kingdom into civil war. Following Louis' death, rival factions of Hungary selected two successors: Archduke Ferdinand I of Austria, supported by the House of Habsburg, and John Zápolya, who would eventually seek aid from and become a vassal of the Ottoman Empire after Ferdinand began to take control of western Hungary, including the city of Buda. The Ottoman attack on Vienna was part of the its intervention into the Hungarian conflict and in the short term sought to secure Zápolya's position. Historians offer conflicting interpretations of the Ottoman's long-term goals, including the motivations behind the choice of Vienna as the campaign's immediate target. Some modern historians suggest that Suleiman's primary objective was to assert Ottoman control over all of Hungary, including the western part (known as Royal Hungary), which was then still under Habsburg control. Some scholars suggest Suleiman intended to use Hungary as a staging ground for further invasion of Europe.It was an \"afterthought towards the end of a season of campaigning\". Riley-Smith, p. 256; \"A last-minute decision following a quick victory in Hungary\". Shaw and Shaw, p. 94; Other historians, including Stephen Turnbull, regard the suppression of Hungary as the calculated prologue, to an invasion further into Europe: \"John Szapolya became a footnote in the next great Turkish advance against Europe in the most ambitious campaign of the great Sultan's reign.\" Turnbull, p .50. The failure of the Siege of Vienna marked the beginning of 150 years of bitter military tension between the Habsburgs and the Ottomans, punctuated by reciprocal attacks, and culminating in a second Siege of Vienna in 1683, which the Austrians again won. ==Background== In August 1526, Sultan Suleiman I decisively defeated the forces of King Louis II of Hungary at the Battle of Mohács and paved the way for the Ottomans to gain control of south- eastern Hungary; the childless King Louis died, possibly by drowning when he attempted to escape the battlefield. His brother-in-law, Archduke Ferdinand I of Austria, the brother of Holy Roman Emperor Charles V, claimed the vacant Hungarian throne. Ferdinand won recognition only in western Hungary; a noble called John Zápolya, had a power base in Transylvania, challenged him for the crown and was recognised as king by Suleiman in return for accepting vassal status within the Ottoman Empire. Thus Hungary became divided into three zones: Royal Hungary, Ottoman Hungary and the Principality of Transylvania, an arrangement that persisted until 1700. Following the Diet of Pozsony (now Bratislava) on 26 October,Turnbull, Stephen. The Ottoman Empire 1326–1699. New York: Osprey, 2003. p. 49 Ferdinand was declared King of Royal Hungary because of the agreement between his and Louis's families, which was cemented by Ferdinand's marriage to Louis's sister Anna and Louis's marriage to Ferdinand's sister Mary. Ferdinand set out to enforce his claim on Hungary and captured Buda in 1527, only to relinquish his hold on it in 1529 when an Ottoman counter-attack stripped Ferdinand of all his territorial gains.Turnbull, Stephen. The Ottoman Empire 1326–1699. New York: Osprey, 2003. pp. 49–50 ==Prelude== ===Ottoman army=== In the spring of 1529, Suleiman mustered a large army in Ottoman Bulgaria with the aim of securing control over all of Hungary at his new borders by Ferdinand I and the Holy Roman Empire. Estimates of Suleiman's army vary widely from 120,000 to more than 300,000 men, as mentioned by various chroniclers.Turnbull suggests Suleiman had \"perhaps 120,000\" troops when he reached Osijek on 6 August. Turnbull, p. 50; Very high figures appear in nineteenth-century histories, for example that of Augusta Theodosia Drane in 1858, \"more than 300,000 men\"; such estimates may derive from contemporary accounts: the Venetian diarist Marino Sanuto, on 29 October 1529, for example, recorded the Turkish army as containing 305,200 men (mentioned in Albert Howe Lyber's The Government of the Ottoman Empire in the Time of Suleiman the Magnificent, p. 107). Modern books sometimes repeat the higher figures—for example, Daniel Chirot, in The Origins of Backwardness in Eastern Europe, 1980, p. 183, says \"some 300,000 men besieged Vienna in 1529\"; an alternative figure appears in Islam at War: \"The sultan's army of 250,000 appeared before the gates of Vienna in the first siege of that great city\", Walton, et al., 2003, p. 104. As well as numerous units of Sipahi, the elite mounted force of the Ottoman cavalry, and thousands of janissaries, the Ottoman army incorporated a contingent from Moldavia and renegade Serbian warriors from Zápolya's army.E. Liptai: Magyarország hadtörténete I. Zrínyi Military Publisher 1984. p. 165. Suleiman acted as the commander-in-chief and personally led his force. In April, he appointed his grand vizier (the highest Ottoman minister), a former slave called Ibrahim Pasha, as Serasker, a commander with powers to give orders in the sultan's name.In April, the diploma by which Suleiman confirmed Ibrahim Pasha's appointment as serasker included the following: \"Whatever he says and in whatever manner he decides to regard things, you are to accept them as if they were the propitious words and respect-commanding decrees issuing from my own pearl-dispensing tongue.\" Quoted by Rhoads Murphey in Ottoman Warfare 1500–1700, p. 136. Suleiman launched his campaign on 10 May 1529 and faced numerous obstacles from the onset.Turnbull, pp. 50–51. The spring rains that are characteristic of Southeastern Europe and the Balkans were particularly heavy that year. They caused flooding in Bulgaria and made parts of the route that was used by the army barely passable. Many large-calibre cannons and artillery pieces became hopelessly mired or bogged down, and Suleiman was left with no choice but to abandon them. Camels, which had been brought from the empire's eastern provinces were not used to the difficult conditions and were lost in large numbers. Sickness and poor health became common among the janissaries and claimed many lives along the perilous journey. Suleiman arrived in Osijek on 6 August. On the 18th, he reached the Mohács Plain and was greeted by a substantial cavalry force led by Zápolya that would later accompany Suleiman to Vienna. Zápolya paid Suleiman homage and helped him recapture several fortresses that had been lost to the Austrians since the Battle of Mohács. including Buda, which fell on 8 September.Stavrianos, p. 77. The only resistance came at Pozsony (now Bratislava), where the Ottoman fleet was bombarded as it sailed up the Danube. ===Defensive measures=== As the Ottomans advanced towards Vienna, the city's population organised an improvised resistance, formed from local farmers, peasants and civilians who were determined to repel the inevitable attack. The defenders were supported by a variety of European mercenaries, namely German Landsknecht pikemen and professional Spanish harquebusiers, sent by Charles V, who was Holy Roman Emperor and King of Spain.Ferdinand I had withdrawn to the safety of Habsburg Bohemia following pleas for assistance to his brother, Emperor Charles V, who was too stretched by his war with France to spare more than a few Spanish infantry to the cause.Reston, James Jr, Defenders of the Faith: Charles V, Suleyman the Magnificent, and the Battle for Europe, 1520–1536, Marshall Cavendish, 2009, p. 288, Queen Mary of Hungary, who was the sister of Charles V, in addition to the 1,000 German Landsknechts under Nicholas, Count of Salm, sent a contingent of 700–800 Spanish hrquebuses. Only 250 Spanish survived.https://repositorio.uam.es/bitstream/handle/10486/1235/17116_C6.pdf?sequence=1 The Spanish were under the command of Marshal Luis de Ávalos with their captains: Juan de Salinas, Jaime García de Guzmán, Jorge Manrique and Cristóbal de Aranda. The elite infantry excelled in defending the northern area and in using the discretion fire that prevented the Ottomans from settling in the Danube meadows, near the ramparts, where they could have breached with enough space to work. The elite soldiers also built additional palisades and trap pits, which would be essential during the siege. The Hofmeister of Austria, Wilhelm von Roggendorf, assumed charge of the defensive garrison, with operational command entrusted to a 70-year-old German mercenary, Nicholas, Count of Salm, who had distinguished himself at the Battle of Pavia in 1525. Salm arrived in Vienna as head of the mercenary relief force and set about fortifying the 300-year-old walls surrounding St. Stephen's Cathedral near which he established his headquarters. To ensure that the city could withstand a lengthy siege, he blocked the four city gates and reinforced the walls, which in some places were no more than six feet thick; erected earthen bastions and an inner earthen rampart; and levelled buildings where necessary to clear room for defences. ==Siege== The Ottoman army, which arrived in late September, had been depleted during the long advance into Austrian territory, and Suleiman was left short of camels and heavy artillery. Many of his troops arrived at Vienna in poor health after the long march, which passed through the worst of the wet season. Of those fit to fight, a third were Sipahi, who were ill-suited for siege warfare. Three richly-dressed Austrian prisoners were dispatched as emissaries by him to negotiate the city's surrender. Salm sent three richly-dressed Muslims back without a response. As the Ottoman army settled into position, the Austrian garrison launched sorties to disrupt the digging and mining of tunnels below the city's walls by Ottoman sappers and in one case almost captured Ibrahim Pasha. The defending forces detected and successfully detonated several mines that had been intended to breach the walls. On 6 October, 8,000 men were dispatched to attack the Ottoman mining operations. They succeeded in destroying many of the tunnels, but they sustained heavy losses when the confined space hindered their return to the city. More rain fell on 11 October, and with the Ottomans failing to breach the walls, their prospect of victory began to fade. In addition, Suleiman was facing critical shortages of food, water and other supplies, and casualties, sickness and desertions began to take their toll. The janissaries began voicing their displeasure at the lack of progress and demanding a decision on whether to remain or abandon the siege. The Sultan convened an official council on 12 October to deliberate the matter. It was decided to attempt one final major assault on Vienna, an \"all-or-nothing\" gamble.Spielman, p. 22. The assault was launched on 14 October, but despite extra rewards being offered to the troops, it was beaten back, with the defenders' harquebuses and long pikes proving decisive.Stavrianos, p. 78. The following day, with supplies running low and winter approaching, Suleiman called off the siege and ordered a withdrawal to Constantinople.Early Modern Wars 1500–1775 p. 18Holmes et al p. 953 With unusually heavy snowfall, conditions deteriorated. The Ottoman retreat was hampered by muddy roads along which their horses and camels struggled to pass. Pursuing Austrian horsemen took many stragglers prisoner although there was no Austrian counter-attack. The Ottomans reached Buda on 26 October; Belgrade on 10 November; and their destination, Constantinople, on 16 December. ==Aftermath== Some historians speculate that Suleiman's final assault was not necessarily intended to take the city but to cause as much damage as possible and to weaken it for a later attack, a tactic that he had used at Buda in 1526. Suleiman would lead another campaign against Vienna in 1532, but it never truly materialised, as his force was stalled by Croatian Captain Nikola Jurišić during the Siege of Güns (Kőszeg).Turnbull, Stephen. The Ottoman Empire 1326–1699. New York: Osprey, 2003. p. 51 Jurišić, with only 700–800 Croatian soldiers, managed to delay his force until winter closed in.Wheatcroft (2009), p. 59. Charles V, now largely aware of Vienna's vulnerability and weakened state, assembled 80,000 troops to confront the Ottoman force. Instead of going ahead with a second siege attempt, the Ottoman force turned back and lay waste the south-eastern Austrian state of Styria in their retreat.Tracy, p. 140. The two Viennese campaigns in essence marked the extreme limit of Ottoman logistical capability to field large armies deep in Central Europe at the time.Riley-Smith, p. 256. The 1529 campaign produced mixed results. Buda was brought back under the control of the Ottoman vassal Zápolya, which strengthened the Ottoman position in Hungary. The campaign left behind a trail of collateral damage in neighbouring Habsburg Hungary and Austria, which impaired Ferdinand's capacity to mount a sustained counter-attack. However, Suleiman failed to force Ferdinand to engage him in open battle and was thus unable to enforce his ideological claim to superiority over the Habsburgs. The attack on Vienna led to Charles V and Pope Clement VII improving relations and contributed to the Pope's coronation of Charles V as Holy Roman Emperor on February 24, 1530. The outcome of the campaign was presented as a success by the Ottomans, who used the opportunity to show off their imperial grandeur by staging elaborate ceremonies for the circumcision of Princes Mustafa, Mehmed and Selim. Ferdinand I erected a funeral monument for the German commander, Nicholas, Count of Salm, the head of the mercenary relief force that was dispatched to Vienna, as a token of appreciation of his efforts. Nicholas survived the initial siege attempt but was injured during the last Ottoman assault and died on May 4, 1530.Entry on Salm. Dupuy, et al., p. 653. The Renaissance sarcophagus is now on display in the baptistery of Votivkirche Cathedral in Vienna. Ferdinand's son, Maximilian II, later built the Castle of Neugebaeude on the spot that Suleiman is said to have pitched his tent during the siege.Louthan, p. 43. ==References== Category:1529 Category:Vienna Category:History of Austria Category:Ottoman Empire Category:Holy Roman Empire",
 "title": "Siege of Vienna"
}