{
 "id": "994874",
 "text": "Cartoon Network (often abbreviated as CN) is an Indian cable and satellite television channel operated by Warner Bros. Discovery under its international division. The channel is the Indian equivalent to the original American network and was launched on 1 May 1995 as the first television network in India dedicated to children. The channel primarily airs animated programming. == Related channels and units == === Cartoon Network HD+ === Cartoon Network HD+ (CN HD+) launched on 15 April 2018 and is an ad free channel. The channel was initially launched in India, but was eventually launched on popular operators in neighbouring countries. CN HD+ is available in four languages. Programs like We Bare Bears, The Powerpuff Girls, etc., are also available in Hindi, Tamil and Telugu. === Pogo TV === Pogo TV was launched on 1 January 2004. As a companion channel of Cartoon Network, it also aired animated and live-action shows. From 2021, it only aired original Indian animation shows which became it WarnerMedia's only for Indian kids channel. But from 2022, the channel again started international shows like Mr. Bean: The Animated Series, Yo-kai Watch, Grizzy and the Lemmings etc. === Toonami === On 26 February 2015, Turner India launched a new channel based on the mature animation/anime block Toonami. The channel revamped itself in July 2017 as a classic animation channel before ceasing operations completely at the end of 15 May 2018. ===Cartoon Network Block=== Zee TV launched a Cartoon Network programming block on 14 August 2002, replacing Nickelodeon's programming block. The block featured programs like Scooby-Doo, The Mask: Animated Series, The Powerpuff Girls, Dexter's Laboratory, Pinky and the Brain, Samurai Jack, The Real Adventures of Jonny Quest, The Flintstones, The Jetsons, Tom and Jerry Kids, Superman: The Animated Series, Captain Planet, Ed, Edd N Eddy, The Road Runner Show, Courage the Cowardly Dog, Sheep in the Big City, Mike, Lu & Og, Sylvester and Tweety Mysteries, and Batman: The Animated Series. It aired programs twice in a day. On 8 July 2006, DD National introduced a Cartoon Network block named \"Cartoon Network ki Duniya\" which aired programs like Codename: Kids Next Door, M.A.D. (from sister channel Pogo), and Galli Galli Sim Sim. ===Digital and OTT deals=== On 24 June 2016, Turner India signed a distribution deal with Viacom 18's OTT app Voot. Through this strategic tie-up Voot can stream Turner's properties from Cartoon Network and Pogo TV like The Powerpuff Girls, Ben 10, Dexter's Laboratory, Roll No. 21, Samurai Jack, Johnny Bravo, and M.A.D in their Kids section. On 29 August 2017, Turner International India signed a deal with Amazon Prime Video India. Through this deal Amazon can stream Cartoon Network shows like Ben 10 (2005 TV series), Ben 10: Alien Force, Ben 10: Ultimate Alien, Ben 10: Omniverse, Johnny Bravo, The Powerpuff Girls, Kumbh Karan, Roll No 21, and Dexter's Laboratory in their Kids and Family section. === CN+ === In 2014, Cartoon Network partnered with Tata Sky to launch an active service called CN+. The service is available every day for about one to two hours. It airs select episodes from hit programmes such as Ben 10 (and related series), Beyblade: Metal Fusion (and related series), Cartoon Network Original Shows like The Amazing World of Gumball, League of Super Evil, Tom and Jerry (and related series), Ed, Edd 'n' Eddy, and movies from Ben 10, Pokémon among others. ==References== ==Other websites== * Category:Cartoon Network Category:Television channels in India Category:1995 establishments",
 "title": "Cartoon Network (India)"
}