{
 "id": "994814",
 "text": "A Jongmyo () or Taimiao () is a temple in China. They are very old temples where people honored their ancestors who were important and powerful. Nobles and rulers are honored in these temples. The word \"Jong\" (宗) means \"ancestral\" and \"Myo\" means \"temple.\" (庙) The first Jongmyo found was at the Yinxu Palace and Temple Site in Anyang, China. As of 2023, it has not been excavated. In the past, only important people were allowed to have these temples for their ancestors. People who did not have much power were not allowed to make these temples. This is according to a writing called \"The Xunzi-Liturgy.\" In old China, temples were seen as important symbols of the country. They were often linked to the idea of \"land and food\". Damaging a temple was seen as a serious crime. For example, in the laws of the Tang dynasty, destroying a temple was act of \"treason.\" == Etymology == The word \"Jongmyo\" in Korean or \"Zongmiao\" in Chinese comes from two characters. These are \"宗\" (Zong), which means \"ancestors\", and \"庙\" (Miao), which means \"temple.\" There is another similar word called \"Taimiao.\" In this word, \"太\" (Tai) replaces \"宗\" (Zong) and \"太\" means \"highest.\" == China == === Yinxu Palace and Temple Site === The Yinxu Palace and Temple is an old temple. It was build over 3,300 years ago for the emperor of the Yin dynasty in China. The palace and temple were found in the city of Anyang in Henan Province. Many things from the same time period, like the Simu Xin Ding, have also been found there. In 2006, it was chosen as a World Heritage Site. === Taimiao, Beijing === The Imperial Ancestral Temple is on the east side of Tiananmen Square in Beijing. It was a temple where the emperors of the Ming and Qing dynasties honored their ancestors.The Imperial Ancestral Temple In 1924, it became a park for peace. In 1950, its name was changed to the Beijing Working People's Cultural Palace. Today, it is considered a very important part of China's cultural heritage. The site is protected by the government as a National Key Cultural Relics Protection Unit. === Temple of the Emperors === The Temple of the Emperors was a place where the Three Sovereigns and Five Emperors were worshipped. The emperors from the Ming and Qing dynasties were also worshipped there. It was first built in Yingtian Prefecture, which is now called Nanjing. It was moved to Shuntian Prefecture, which is now Beijing. The temple is on Fuchengmennei Street in the Xicheng District of Beijing. == Korea == The Jongmyo system was brought to Korea from China by the Silla kingdom. The first Jongmyo temple was built in 1394 by King Taejo of Joseon. It is believed to be the oldest royal Confucian temple in the world. In 1995, the temple was added to the World Heritage List by UNESCO. The Jongmyo ritual is a Confucian ceremony that honors the Joseon Dynasty monarchs and princesses. It takes place every year on the first Sunday in May at the Jongmyo temple in Seoul, Korea. The music played during this ceremony is a type of Korean court music. It is called Jongmyo ritual music. The music was recognized as an intangible cultural heritage by UNESCO in 2001. == Japan == The Ise Grand Shrine and Iwashimizu Hachimangū of Japan are known as the \"Nisho no Sōtō\". They are important places for worship for the imperial family. The imperial shrine in the Three Palace Sanctuaries of the Tokyo Imperial Palace is where the spirits of the Emperors of Japan are honored. During the Edo period, the Nikkō Tōshō-gū and other mausoleums of the Tokugawa family were the temples of the Tokugawa Shogunate. The shoguns would regularly go to these temples to pay their respects. There was also a place in Edo Castle where the Shogun's family could honor their ancestors. It was called the Gobudo-no-mikoto in Ōkoku. == Ryukyu == During the Ryukyu Second Shō dynasty, the Enkaku-ji Temple was a special temple built to honor the previous king. The Tenno-ji Temple and the Tenkai-ji Temple were dedicated to the memory of past monarchs. The Ryufu-ji Temple was created to honor the spirits of the kings of the First Shō dynasty. == Vietnam == Thế Miếu, also known as Thế Tổ Miếu, is a temple in the Imperial City of Huế, Vietnam. It was built to honor the emperors of Vietnam.Frommer's Vietnam: with Angkor Wat Ron Emmons - 2012 \"Visit the Hue Citadel, taking in some of its renovated buildings such as the Thai Hoa Palace and the Mieu Temple; this will probably occupy you for most of the day,\" == Related pages == * Ci shrine * Jisi (sacrifice ritual) == References == Category:Shrines Category:Korean culture Category:Religion in China Category:Religious Confucianism Category:Religion in Japan Category:Vietnamese culture",
 "title": "Jongmyo (shrine)"
}