{
 "id": "994820",
 "text": "The Ise Grand Shrine (伊勢神宮, Ise Jingū) is a religious site in Ise, Japan. It is for the sun goddess Amaterasu. The shrine is made up of many smaller shrines, with two main shrines being Naikū (内宮) and Gekū (外宮). People call the shrine simply Jingū (神宮). The Naikū Shrine (officially called \"Kōtai Jingū\") is in Uji-tachi, near Ise. It is where people worship Amaterasu, the sun goddess, who they believe lives there. The buildings are made of wood from a tree called cypress and use no nails to put them together. Instead, they use a special way of joining the wood. The Gekū Shrine (officially called \"Toyouke Daijingū\") is about 6 km from Naikū and is for Toyouke-Ōmikami, the god of farming, getting food from crops, and work.Ise Jingu official homepage, Besides the Naikū and Gekū shrines, there are 123 more Shinto shrines in and around Ise City. 91 of them are connected to Naikū and 32 are connected to Gekū.Ise Jingu official homepage People say the Sacred Mirror (Yata no Kagami) is kept at this shrine. It is one of the most important and holiest places in the Shinto religion. Only the central buildings can be seen from the outside because they are behind four tall wooden fences. Visitors can walk around in the forest and see the old walkways from the Meiji period. A long time ago, about one out of every ten Japanese people would make a special trip to the shrine. This was very popular and happened often for both religious and business reasons. According to old records, in 1625 over 3.62 million people visited the shrine in 50 days. In 1829, during a big festival that happens every 20 years, 1.18 million people came to the shrine in just three days.お伊勢さま、一度は行きたい庶民の夢 Cleanup CorporationPeople consider the shrine a sacred place and so checks for security do not happen since it is considered disrespectful to the shrine. There is a path that people take on their pilgrimage between the two main shrines that goes through a neighborhood called Furuichi. The person in charge of the shrine must be from the Japanese royal family, which makes sure the shrine is taken care of. The person in charge is now Princess Sayako Kuroda, who is the daughter of Emperor Emeritus Akihito. == References == Category:Shinto shrines Category:Twenty-Two Shrines Category:Mie Prefecture",
 "title": "Ise Grand Shrine"
}