{
 "id": "994978",
 "text": "Rozalia Asfandiyarovna Sultangareeva () performer of folk songs, Bashkir folklorist, Doctor of Philology, Honored Worker of Culture of the Bashkir ASSR (1989). == Biography == She was born March 28, 1955 in the village Novosepyashevo, Alsheevsky district, Bashkir ASSR. In 1978 she graduated from the philological faculty of the Bashkir State Pedagogical Institute. In 1988, she wrote her PhD thesis. In 2002, she wrote her doctoral thesis on the topic: \"Family and everyday ritual folklore of the Bashkir people.\" Since 1991 she has worked as a senior researcher at the Institute of History, Language and Literature of the USC RAS. She collected Bashkir folklore. Together with A. Suleymanov, she prepared for publication the 1st volume of the \"Bashkir Folk Art\" (\"Башҡорт халыҡ ижады\", 1995). She is the Chief Researcher of the Institute of History, Language and Literature of the Ufa Scientific Center of the Russian Academy of Sciences. She is the author of about 500 scientific researches on folklore choreography. She raised the oral Bashkir folklore to the modern stage. ==Research area== Rites, choreography, games, epic poems, religious folklore; stories, traditional culture, mythology. Rozalia Sultangareeva performs oral Bashkir folklore. She composes improvisations in the folklore style about the members of the Bashkir culture, about the past of Bashkortostan. == Awards and titles == Honored Worker of Culture of the Bashkortostan Diploma winner at the 12th World Festival of Youth and Students in Moscow (1985), Laureate of the International akyns and sesens competition in Alma-Ata (1996), Laureate of the All-Russian competition of folk song performers in Smolensk (1991), Laureate of the republican competition of folk song performers for the prize. G. Almukhametova (1984) Literary Prize after Akmullah (1991) Laureate of the International competition of akyns, jyrchy and dastanchi. (Alma-Ata, 1997) Laureate of the All-Russian competition \"Voices of Russia\" (Smolensk, 1991) Cavalier of the Order of Salavat Yulaev (2005) Honorary Diploma of the Republic of Bashkortostan (2016) ==Sources== * (ru) * SULTANGAREYEVA Rozaliya Asfandiyarovna.Folklore of Bashkortostan peoples: encyclopedia // Academy of Sciences of the Republic of Belarus, GAUN Resp. Bashkortostan \"Bashk. encycle.\"; [Scientific-ed. board: F. A. Nadrshina (chief editor), S. I. Apsatarova, L. A. Afanaseva, V. Ya. Babenko, F. G. Galieva, M. Kh. Idelbaev, I. E. Karpukhin, T. G. Minniyakhmetova, I. G. Petrov, R. R. Sadikov, U. G. Saitov (Ed.), R. A. Sultangareeva, I. K. Fazlutdinov, G. R. Khusainova; Per. in English. lang.: OOO \"Center for Intercultural Cooperation\"]. - Ufa: [Bashk. Encycl.], 2020. — 664 p.: ill. — Parallel text. Russian, English - (in translation). (en) ==Other websites== * UfaGuide encyclopedia (ru) * Website of the Academy of Sciences of the Republic of Bashkortostan (ru) Category:1955 births Category:Bashkir writers Category:Researchers and collectors of Bashkir folklore Category:Living people",
 "title": "Rozalia Asfandiyarovna Sultangareeva"
}