{
 "id": "995191",
 "text": "Fanuza Aitbaevna Nadrshina (; born February 7, 1936) is a Bashkir folklorist, doctor of philological sciences. Laureate of the Salavat Yulaev State Prize (1987). She was awarded the Order of Salavat Yulaev (2007). Honored Scientist of the Republic of Bashkortostan (2000). Honorary Member of the Academy of Sciences of the Republic of Bashkortostan (2016). == Biography == Nadrshina Fanuza Aitbaevna was born on February 7, 1936 in the village of Staro- Muradymovo Aurgazinsky district, Bashkir ASSR. In 1959 she graduated from the Sterlitamak State Pedagogical Institute. In 1954-1959 she was the head of the department of the Aurgazinsky district committee of the Komsomol, taught Russian language and literature, was the director of the school in the village of Tolbazy. In 1962-1973 she works at the Institute of History, Language and Literature of the Bashkir Branch of the USSR Academy of Sciences as a junior researcher, and since 1973 - a senior researcher. Now she is the chief of the Folkloristics Department of the Institute of the History of Language and Literature of the Russian Academy of Sciences. ==Scientific activity== Fanuza Nadrshina is the author of more than 200 scientific research, including 30 books, the encyclopedia \"Salavat Yulaev\", fundamental works \"History of Bashkortostan from ancient times to the 60s of the XIX century.\" (1996), \"History of the Bashkir people\" (2010).NADRSHINA, Fanuza Aitbayevna.Folklore of Bashkortostan peoples: encyclopedia // Academy of Sciences of the Republic of Belarus, GAUN Resp. Bashkortostan \"Bashk. encycle.\"; [Scientific-ed. board: F. A. Nadrshina (chief editor), S. I. Apsatarova, L. A. Afanaseva, V. Ya. Babenko, F. G. Galieva, M. Kh. Idelbaev, I. E. Karpukhin, T. G. Minniyakhmetova, I. G. Petrov, R. R. Sadikov, U. G. Saitov (Ed.), R. A. Sultangareeva, I. K. Fazlutdinov, G. R. Khusainova; Per. in English. lang.: OOO \"Center for Intercultural Cooperation\"]. - Ufa: [Bashk. Encycl.], 2020. — 664 p.: ill. — Parallel text. Russian, English - ISBN 978-5-88185-474-4 (in translation). (en)] She participated in the preparation of the multi-volume collection \"Bashkir Folk Art\" (\"Bashkort Halyk Izhady\"), for which, together with A. I. Kharisov, N. T. Zaripov, L. G. Barag, M. M. Sagitov and A. M. Suleimanov, in 1987 she was awarded the State Prize named after Salavat Yulaev.The regional interactive enceclopedic portal “Bashkortostan” (ru) ==Scientific researchs== \\- Songs of my folk / Compiler of the Musical Literary Species Collection - F.A. Kildiyarova; scientific ed., comp. literary part, auth. intro. Art., comment. and classification - F.A. Nadrshina; music ed. - F. A. Faizova. - Ufa: Song, 1995. - 183 p.. \\- Bashkort Folk songs, songs-legends /Author-compiler F. A. Nadrshina. - Ufa: Kitap, 1997. – 288 с. \\- Bashkort Folk Legends / Author-compiler F. A. Nadrshina. - Ufa: Kitap, 2007. – p. 468 . \\- Bashkir-English-Russian dictionary of adequate proverbs and sayings / Auth.-comp. F. Nadrshina, E. M. Zubairova [Sozinova]. - Ufa: Kitap, 2002. - 160 p. \\- Ural batur. Bashkort Folk Epic /Project, intro. Art., preparation of texts - F. A. Nadrshina. - Ufa: Informreklama, 2003. - 465 p. 16 p. ill. \\- Salavat in Bashkir Folklore, In 2 vol. Volume One: Legends / Project, comp., scientific. Ed., entry. Art. and comment. – F.A. Nadrshina. - Ufa: Informreklama, 2008 - 536 p. \\- Salavat in Bashkir Folklore, In 2 vol. Volume Two: Epic, Songs and Baits / Project, comp., scientific. Ed., entry. Art. and comment. – F.A. Nadrshina. - Ufa: Informreklama, 2008 - 312 p. \\- Bashkort Folk Epic Stories / Author-comp. - F.A. Nadrshina. - Ufa: Kitap, 2010. - 280 p.. \\- The Treasures of the Ancient Urals /Aut.-stat. F. A. Nadrshina, E. M. Sozinova. - Ufa: Kitap, 2019. 264 p. \\- Pearls of the language=Die Perlen der Sprach=Les perles de la langue.Bashkort, Russian, Inglis, German, French F. A. Nadrshina, E. M. Sozinova, Sozinova, Ғ. g. Shafiqov, Z. A. Rakhimova, N. N. Akhtamova, E. M. Nukhova, F. S. Kudryasheva, R. Ҡ. Garipov, L. M. Toҡombatova. Ufa: Kitap, 2020. 216 p. ==References== Category:1936 births Category:Bashkir writers Category:Researchers and collectors of Bashkir folklore",
 "title": "Nadrshina Fanuza Aitbaevna"
}