{
 "id": "995380",
 "text": "\"Paint It Black\" is a song by the Rolling Stones, an English rock band. Keith Richards and Mick Jagger wrote the song. The song was inspired by Indian music. London Recordings released the song as a single in the United States on 7 May 1966. Decca Records released the single in the United Kingdom on 13 May 1966. Later, \"Paint It Black\" was the first song on the American version of Aftermath (1966). The song is not on the UK version of the album. The song is based on music that Brian Jones made on the sitar. All five members of the Rolling Stones helped make the song. However, only Jagger and Richards were listed as songwriters. \"Paint It Black\" is different from many other songs made by the band. It has musical instruments that people do not use a lot in rock music. They are the sitar, organ, and castanets. The song had good and bad reviews from music critics. Some people thought the band was copying the Beatles by making music with the sitar. \"Paint It Black\" was very successful. It was number one on the Billboard Hot 100 music chart for eleven weeks. It was also number one on music charts in the UK. When the song was released again in 2007, it was on the UK Singles Chart for eleven weeks. It was the band's third number one single in the US. It was the band's sixth number one single in the UK. \"Paint It Black\" was platinum certified by the British Phonographic Industry (BPI). The song was put in the Grammy Hall of Fame in 2018. Rolling Stone magazine ranked the song 213 on a list of the 500 Greatest Songs of All Time. Many people who make music have made cover versions of \"Paint It Black\". It has been on many of the band's compilation albums. The band plays \"Paint It Black\" at many of their concerts. == Background == In 1965, the Rolling Stones were becoming more popular. They had many songs that were popular around the world. Mick Jagger and Keith Richards wrote most of these songs.; . Earlier, in 1964, they were one of the most popular bands in the United Kingdom. However, they were less popular in the United States. Other British bands, such as the Beatles, the Who, and the Kinks, were more popular in the US. In 1965, the Rolling Stones made the song \"(I Can't Get No) Satisfaction\". This song was number one on American music charts. The album it was on, Out of Our Heads, was also number one on the Billboard 200. The Rolling Stones made other successful songs, such as \"Get Off of My Cloud\" (1965) and \"19th Nervous Breakdown\" (1966). Allen Klein, an American businessman, saw that the band was becoming more popular in the US. He managed them in the United States. Andrew Loog Oldham was still the main manager of the band.; ; . Klein made Decca Records give the band $1.2 million in royalty payments. This was the first time the band had a lot of money from making music. They spent the money on many things, such as new cars and houses. Many people compared the Rolling Stones to the Beatles.Cooper, Laura E., and B. Lee, \"The Pendulum of Cultural Imperialism: Popular Music Interchanges Between the United States and Britain\", Journal of Popular Culture, Jan. 1993Szatmary, David P. (2014). Rockin' in Time (8th ed.). Pearson. Both of them were popular British rock bands. Oldham advertised the Rolling Stones as a more intense version of the Beatles. Both bands were important parts of the British Invasion. Because of their music, they were part of the counterculture of the 1960s. == Making the song == The Rolling Stones were changing when \"Paint It Black\" was made. Mick Jagger and Keith Richards were writing more music for the band. Early albums by the Rolling Stones only had a few songs made by Jagger and Richards. However, newer albums such as Out of Our Heads had many songs written by them. Jagger and Richards wrote every song on Aftermath (1966). Brian Jones, the person that made and led the band for many years, thought he was becoming less important. Jones had less control over the band's music because of Jagger and Richards. This was because Jagger and Richards wrote many of the band's most popular songs. Jones was bored of writing songs that had normal rock music. He played different instruments, such as the sitar. He wanted to make the band's music sound more unique. Jones learned how to play the sitar quickly. He had studied music with Harihar Rao, a sitar player, in the past. Rao had worked with Ravi Shankar, a famous Indian sitar player. Many other British bands used the sitar in their music, such as the Yardbirds. In 1965, the Beatles released Rubber Soul. One of the songs on this album, \"Norwegian Wood (This Bird Has Flown)\", had sitar music in it. In October 1965, Jones talked with George Harrison. Harrison was the guitar player for the Beatles. Jones played the sitar more after talking to him. He made basic songs with it. One of these songs became the sitar music in \"Paint It Black\". === Writing and recording === Jagger and Richards wrote most of the song while recording music in December 1965. They also wrote parts of it while they were at concerts in 1966. The band planned to make an album named Could You Walk on the Water? The band announced that the album would be released in March. A spokesperson for Decca Records said that they were not going to release an album with that name. They did not want Christians to get mad at the album's name, because it was about Jesus Christ walking on water.; ; . Because of the title, the Rolling Stones delayed the album's release to April 1966.; . This delay gave them more time to make music for the album. The new title for it was Aftermath. \"Paint It Black\" was recorded on 6 and 9 March 1966 in Los Angeles, California. Andrew Loog Oldham produced the song. The band also recorded many of the other songs on Aftermath on these days. == Music == \"Paint It Black\" was first written as a pop song in the minor key. The band did not like this version of the song. At first, they did not want to put it on their next album. During a break, Bill Wyman played the organ. He wanted to make a lower bass sound for the song. Wyman's organ music inspired the pentatonic melody in \"Paint It Black\". In 1995, Jagger said \"Paint It Black\" was a \"kind of Turkish song\". James E. Perone, a music professor, has said that the rhythm and music from the sitar on the song sound more Middle Eastern than Indian. The end of the song has acoustic guitar music played by Richards. Many music critics have said \"Paint It Black\" is raga rock or psychedelic rock. Perone said the song was very different from the rest of their music. Most of their other music is blues and rock-and-roll. Other songs on Aftermath, such as \"Stupid Girl\" and \"Lady Jane\", were also different. The song describes someone who is sad because of their spouse's death. Other people think the song also means different things, such as the Vietnam War or drug use. Robert Christgau, a music critic, has said that \"Paint It Black\" is an example of the band changing their music. He said that Jagger and Richards were the 2nd-best songwriting partners in rock. He put them behind John Lennon and Paul McCartney. == Release == London Records released \"Paint It Black\" as a single in the US on 7 May 1966. Decca Records released it on 13 May in the UK. The single was released with the song \"Long, Long While\" in the UK. This song was not on any of the band's studio albums. When the song was released, its writing was credited to \"Jagger-Richard\". This is because Oldham told Keith Richards to use the last name \"Richard\" on music the Rolling Stones made in the 1960s. Later releases of the song have its writing credited to \"Jagger- Richards\". In the US, the single was released with the song \"Stupid Girl\". \"Paint It Black\" and \"Stupid Girl\" are on the US version of Aftermath. \"Paint It Black\" is not on the UK version of the album. On the US version of the album, \"Paint It Black\" is the first song. It replaces \"Mother's Little Helper\". This is the first song on the UK version of the album. \"Stupid Girl\" is the second song on both versions of Aftermath. The song was first released with the name \"Paint It, Black\". This name is not correct. Decca Records made a mistake when writing the song's name on the album. The Rolling Stones played \"Paint It Black\" on the Ed Sullivan Show on 11 September 1966. In the UK, the first album \"Paint It Black\" was released on was Big Hits (High Tide and Green Grass). This was a compilation album released in 1966. Many other compilation albums made by the band had \"Paint It Black\" on them. Many live albums made by the Rolling Stones also have the song. == Legacy == When music critics first listened to the song, some of them thought it was good, and some thought it was bad. Some thought the band was copying the Beatles by making sitar music. When asked about this, Jones said it was \"rubbish\". He compared it to the fact that many rock bands use the guitar, but make different types of music. Jones' sitar music on the song inspired many other people to make psychedelic music. Writers for Melody Maker said the song would \"send the Stones back to number one\", and thought it was good. A writer for another British music magazine said Jagger's singing was \"better than ever\", but did not like the sitar music. Keith Altham from New Musical Express (NME) said it was the band's best single since \"(I Can't Get No) Satisfaction\". A writer for Billboard said \"Paint It Black\" was one of the best songs on Aftermath, and it was going to be a hit song. Many other music writers have said the song was ahead of its time, and inspired new blues, rock, and punk music. Almost 400 cover versions of \"Paint It Black\" have been made. Some music makers that have made cover versions of the song are U2, Vanessa Carlton, War, and Ciara. It has been put on many lists of the best songs ever made, such as ones made by Rolling Stone, Pitchfork and NME. The song was put in the Grammy Hall of Fame in 2018. It is number 213 on Rolling Stone's list of the 500 Greatest Songs of All Time. The song has been used in many movies and video games. \"Paint It Black\" was in the movie Full Metal Jacket (1987). It was also in Black Adam (2022). The song played during a fight scene in the movie. The song was used for an advertisement for Call of Duty: Black Ops III (2015). It has been in Guitar Hero games as well. The song was in Guitar Hero III: Legends of Rock (2007) and Guitar Hero Live (2015). In these games, players can play the song on a toy guitar. == Sales == In the UK, \"Paint It Black\" went to the number one spot on national music charts. It was on the Record Retailer music chart for ten weeks. The song was the Rolling Stones' sixth number one song in the UK. The band sold 300,000 copies of the single one week after it was released. In 2007, the song was released again. It went onto the UK Singles Chart for eleven weeks. In Germany, \"Paint It Black\" went to the number two spot on national music charts. The single was also popular in other countries in Europe, such as Austria, Norway, Ireland and Spain. In 2007, the re-release of the single was number 49 on Germany's national music chart. When it was released, \"Paint It Black\" was number 48 on the Billboard Hot 100. After three weeks, the song was number one on the music chart. It stayed number one for two weeks. It was the band's third number one single in the US. It was the first song with sitar music to be number one in the US. By June 1966, the band had sold more than one million copies of the single. \"Paint It Black\" stayed on the Billboard Hot 100 for 11 weeks. The single helped Aftermath go higher on music charts in the US. == Personnel == According to authors Andy Babiuk and Greg Prevost, except where noted: The Rolling Stones * Mick Jagger – lead and harmony vocals; writer * Keith Richards – harmony vocal; lead and acoustic guitars; writer * Brian Jones – sitar, acoustic guitar * Bill Wyman – bass, Hammond organ, maracas, cowbell * Charlie Watts – drums, tambourine, castanets Other music makers and music production * Jack Nitzsche – piano * David Hassinger – sound engineer * Andrew Loog Oldham – producer In Philippe Margotin and Jean-Michel Guesdon's book The Rolling Stones All the Songs, they credit \"tambourine, bongos, castanets\" to unknown music makers. In the book Rolling Stones Gear by Babiuk and Prevost, they credit acoustic guitar music to Jones, maracas and cowbell to Wyman and tambourine and castanets to Watts. Music studio * Recorded at RCA Studios (Los Angeles) ==Charts== ===Weekly charts=== 1966 weekly chart performance for \"Paint It Black\" Chart (1966) Peak position Finland (Soumen Virallinen) 3 Sweden (Kvällstoppen) 2 Sweden (Tio i Topp) 2 Spain (AFE) 4 UK (Melody Maker) 1 UK (New Musical Express) 1 UK (Record Retailer) 1 UK (Disc & Music Echo) 2 US Cash Box Top 100 1 US Record World Top 100 1 West Germany (Musikmarkt Hit-Parade) 2 1990 weekly chart performance for \"Paint It Black\" Chart (1990) Peak position Europe (Eurochart Hot 100) 52 2007 weekly chart performance for \"Paint It Black\" Chart (2007) Peak position 2012 weekly chart performance for \"Paint It Black\" Chart (2012) Peak position 2022 weekly chart performance for \"Paint It Black\" Chart (2022) Peak position ===Year-end charts=== 1966 year-end chart performance for \"Paint It Black\" Chart (1966) Position Austria (Ö3 Austria Top 40) 10 Belgium (Ultratop Flanders) 31 Netherlands (Dutch Top 40) 14 UK Record Retailer 30 US Billboard Hot 100 34 US Cash Box 32 1990 year-end chart performance for \"Paint It Black\" Chart (1990) Position Netherlands (Dutch Top 40) 14 Netherlands (Single Top 100) 10 ==Certifications== == Notes == == References == === Books === * * * * * * * * * * * * * * Category:1966 songs Category:The Rolling Stones songs Category:The Animals songs Category:U2 songs Category:Vanessa Carlton songs Category:Psychedelic rock songs",
 "title": "Paint It Black"
}