{
 "id": "995315",
 "text": "Hayden Carruth (August 3, 1921-September 29, 2008) was an American poet and critic. He was born in Waterbury, Connecticut. He graduated from the University of North Carolina at Chapel Hill in 1943. Then he joined the Army Air Forces during World War II. He served in Italy. Then he got a master's degree at the University of Chicago in 1948. After a good start in writing and editing, Carruth had \"an alcoholic breakdown.\" This mental illness kept him away from people during the 1950s, but he still wrote poems and essays. His first book, The Crow and the Heart, came out in 1959. During his career he got much support from writing organizations. He received grants of money from the Bollingen, Guggenheim, and Lannan Foundations, as well as the National Endowment for the Arts. In 1992 Collected Shorter Poems 1946-1991 won the National Book Critics Circle Award. In 1996 his 'Scrambled Eggs & Whiskey: Poems, 1991–1995 won the National Book Award. Carruth died in Munnsville, New York in 2008. ==Books== *The Crow and the Heart (1959). *The Norfolk Poems (1962) *Appendix A (1963) novel *Nothing for Tigers: Poems 1959–1964 (1965) *The Clay Hill Anthology (1970) *For You—Poems (1970) *The Voice That Is Great within Us (1970) (editor) *From Snow and Rock, from Chaos (1973) *Dark World (1974) *The Bloomingdale Papers (1974) *Brothers, I Loved You All: Poems 1969–1977 (1978) *The Sleeping Beauty (1982) *Working Papers: Selected Essays and Reviews (1982) *If You Call This Cry a Song (1983) *Effluences from the Sacred Caves: More Selected Essays and Reviews (1983) *The Selected Poetry of Hayden Carruth (1985) *Asphalt Georgics (1985) *The Oldest Killed Lake in North America: Poems 1979–1981 (1985) *Lighter Than Air Craft (1985) *Sitting In: Selected Writings on Jazz, Blues, & Related Topics (1986) *Sonnets (1989) *Tell Me Again How the White Heron Rises and Flies Across the Nacreous River at Twilight Toward the Distant Islands (1989) *The Sleeping Beauty (1990) *Collected Shorter Poems: 1946–1991 (1992) *Suicides and Jazzers (1992) *Collected Longer Poems (1994) *Selected Essays & Reviews (1996) *Scrambled Eggs & Whiskey: Poems, 1991–1995 (1996) *Reluctantly: Autobiographical Essays (1998) *Beside the Shadblow Tree: A Memoir of James Laughlin (1999) *Doctor Jazz (2001) *Letters to Jane (2004) *Toward the Distant Islands: New and Selected Poems (2006) *Last Poems (2012) == Related pages == *List of poets from North America ==References== Category:1921 births Category:2008 deaths Category:American poets Category:American literary critics",
 "title": "Hayden Carruth"
}