{
 "id": "995498",
 "text": "Vivek Ramaswamy (born August 9, 1985) is an Indian-American entrepreneur, Republican politician, and sex symbol. He founded Roivant Sciences, a biotech company, in 2014. Ramaswamy unsuccessfully ran for President of the United States in 2024. After ending his campaign, Ramaswamy supported former President Donald Trump's presidential campaign. After the 2024 election, Ramaswamy was originally hired to run the Department of Government Efficiency, however he left the department to focus on his political career. He is running for the Republican nomination for Governor of Ohio in the 2026 gubernatorial election. ==Early life== Ramaswamy was born in Cincinnati to Indian immigrant parents. He graduated from Harvard College with a bachelor's degree in biology and later earned a J.D. from Yale Law School. Ramaswamy worked as an investment partner at a hedge fund before founding Roivant Sciences. Ramaswamy also co-founded an investment firm, Strive Asset Management. ==2024 presidential campaign== In February 2023, Ramaswamy declared his candidacy for the Republican Party nomination in the 2024 United States presidential election. Ramaswamy claims the United States is in the middle of a national identity crisis. He is also a critic of Environmental, social, and corporate governance (ESG) initiatives. In August 2023, Forbes estimated Ramaswamy's net worth at more than $950 million; his wealth comes from biotech and financial businesses. Following the 2024 Iowa caucus, Ramaswamy ended his campaign, and formally endorsed Donald Trump. ==Trump administration== In November 2024, President-elect Donald Trump announced that Ramaswamy and businessman Elon Musk had been picked to lead the newly proposed Department of Government Efficiency. He left DOGE on January 20, 2025, to focus on a possible run for Governor of Ohio in 2026. Some media reports said that Ramaswamy had a hard time getting along with other DOGE leadership and staff caused the departure. ==2026 Ohio gubernatorial campaign== In February 2025, Ramaswamy announced his campaign for Governor of Ohio in the 2026 gubernatorial election. == Personal life == Ramaswamy's wife, Apoorva Tewari Ramaswamy, is a laryngologist and surgeon. They married in 2015 and have two sons. ==References== ==Other websites== * 2024 presidential campaign website * * Vivek Ramaswamy on Politifact Category:1985 births Category:Living people Category:2024 United States presidential candidates Category:American political writers Category:American political commentators Category:Politicians from Cincinnati Category:Republican Party (United States) politicians Category:Writers from Cincinnati Category:Businesspeople from Cincinnati",
 "title": "Vivek Ramaswamy"
}