{
 "id": "995495",
 "text": "The 2024 Republican Party presidential primaries were a series of primaries and elections in states that are organized by the Republican Party to choose the delegates to the 2024 Republican National Convention. The elections were held between January and June 2024. ==Background== Former president Donald Trump announced he would run on November 15, 2022. Former Ambassador to the United Nations Nikki Haley became the first to follow his entrance on February 14, followed by wealth management executive Vivek Ramaswamy one week later, businessman Perry Johnson on March 2, former Arkansas governor Asa Hutchinson on April 6, radio host Larry Elder on April 20, U.S. Senator Tim Scott on May 19, Florida governor Ron DeSantis on May 24, former Vice President Mike Pence on June 5, former New Jersey governor Chris Christie on June 6, North Dakota governor Doug Burgum on June 7, Miami mayor Francis Suarez on June 14, and former U.S. Representative Will Hurd on June 22. Four frontrunners quickly emerged: DeSantis, Haley, Ramaswamy, and Trump. The remaining candidates failed to gain traction, leading most to drop out in the second half of 2023. Once the primaries began, the only candidates left in the race were the aforementioned four and Hutchinson. Trump has been seen as the frontrunner and has had a steady lead in primary polling since 2020. Some Republicans have shown concerns about his nomination due to his loss in 2020, his own role in inciting the January 6 United States Capitol attack, his ongoing criminal investigations, and the results of the 2022 midterms Trump is the first president to run after leaving office since Herbert Hoover in 1940. If he wins the Republican nomination, he will be the first Republican to be nominated for president three separate times since Richard Nixon (Republican nominee in 1960, 1968, and 1972), and the first person to be the Republican presidential nominee in three consecutive elections. If he wins the general election, he will be the first president to serve non-consecutive terms since Grover Cleveland, who won his second term in 1892. Meanwhile, Pence's candidacy made him the first vice president to run against the president under whom they served since John Nance Garner in 1940. ===Primaries and caucuses results=== At the January 15 Iowa caucuses, Trump posted a landslide victory, while DeSantis narrowly beat out Haley for second. Ramaswamy finished a distant fourth, while Hutchinson took sixth, behind businessman Ryan Binkley. Owing to their poor showing, Ramaswamy and Hutchinson quickly dropped out of the race. On February 24, Trump won the 2024 South Carolina Republican presidential primary. == Candidates == === Declared === Republican nominee for the 2024 presidential election Name Born Experience Home state Campaign Bound delegates Contests won Popular vote Running mate Ref. Donald Trump (age ) Queens, New York President of the United States (2017–2021) Chairman of The Trump Organization (1971–2017) Florida Campaign \\---- FEC filing Website Secured nomination: March 12, 2024 2,268 (95.4%) 54 (AK, AL, AR, AS, AZ, CA, CO, CT, DE, FL, GA, GU, HI, IA, ID, IL, IN, KS, KY, LA, MA, MD, ME, MI (C, P), MN, MO, MP, MS, MT, NC, ND, NE, NH, NJ, NM, NV, NY, OH, OK, OR, PA, PR, RI, SC, SD, TN, TX, UT, VA, VI, WA, WI, WV, WY) 17,015,756 (76.4%) JD Vance === Withdrew during the primaries=== The candidate in this section have suspended their campaigns, or have otherwise ceased campaigning and ended their bids for the nomination during the primary season. Withdrawn major candidates for the 2024 Republican Party presidential primaries Name Born Experience Home state Campaign announced Campaign suspended Campaign Bound delegates Contests won Popular vote Nikki Haley (age ) Bamberg, South Carolina Ambassador to the United Nations (2017–2018) Governor of South Carolina (2011–2017) South Carolina State Representative (2005–2011) South Carolina February 14, 2023 March 6, 2024 Campaign \\----FEC filing Website 97 (4.1%) 2 (DC, VT) 4,381,799 (19.7%) Ron DeSantis (age ) Jacksonville, Florida Governor of Florida (2019–present) U.S. Representative from (2013–2018) Florida May 24, 2023 January 21, 2024 Campaign \\----FEC filing Website 9 (0.4%) None 353,615 (1.6%) Asa Hutchinson (age ) Bentonville, Arkansas Governor of Arkansas (2015–2023) Under Secretary of Homeland Security (2003–2005) Administrator of the Drug Enforcement Administration (2001–2003) Arkansas April 26, 2023 January 16, 2024 Campaign \\----FEC filing 0 (0.0%) None 22,044 (0.1%) Vivek Ramaswamy (age ) Cincinnati, Ohio Executive chairman of Strive Asset Management (2022–2023) CEO of Roivant Sciences (2014–2021) Ohio February 21, 2023 January 15, 2024 Campaign \\----FEC filing Website 3 (0.1%) None 96,954 (0.4%) === Withdrew before the primaries === The candidates in this section have suspended their campaigns, or have otherwise ceased campaigning and ended their bids for the nomination before any primary contests were held. Withdrawn major candidates for the 2024 Republican Party presidential primaries Name Born Experience Home state Campaign announced Campaign suspended Campaign Ref. Chris Christie (age ) Newark, New Jersey Governor of New Jersey (2010–2018) Candidate for president (2016) U.S. Attorney for the District of New Jersey (2002–2008) New Jersey Campaign * * * FEC filing Website Doug Burgum (age ) Arthur, North Dakota Governor of North Dakota (2016–present) Senior VP of Microsoft Business Solutions Group (2002–2007) President of Great Plains Software (1984–2001) North Dakota Campaign * * * FEC filing Website Tim Scott (age ) North Charleston, South Carolina U.S. Senator from South Carolina (2013–present) U.S. Representative from (2011–2013) South Carolina State Representative (2009–2011) South Carolina Campaign * * * FEC filing Website Mike Pence (age ) Columbus, Indiana Vice President of the United States (2017–2021) Governor of Indiana (2013–2017) U.S. Representative from (2003–2013) U.S. Representative from (2001–2003) Indiana Campaign * * * FEC filing Website border|frameless|x120px Larry Elder (age ) Los Angeles, California Host of The Larry Elder Show (1993–2022) Candidate for Governor of California in the 2021 recall election California Campaign * * * FEC filing Website Perry Johnson (age ) Dolton, Illinois Founder of Perry Johnson Registrars, Inc. (1994–present) Disqualified candidate for Governor of Michigan in 2022 Michigan Campaign * * * FEC filing Website Corey Stapleton (age ) Seattle, Washington Montana Secretary of State (2017–2021) Montana State Senator (2001–2009) Montana Campaign * * * FEC filing Website border|x120px Will Hurd (age ) San Antonio, Texas U.S. Representative from (2015–2021) Texas Campaign * * * FEC filing Website border|frameless|x120px Francis Suarez (age ) Miami, Florida Mayor of Miami (2017–present) Member of the Miami City Commission (2009–2017) Florida Campaign * * * FEC filing Website Other notable individuals who were not considered major candidates and who withdrew from the race before the beginning of the primary season include: * Steve Laffey, mayor of Cranston, Rhode Island (2003–2007) * Ryan Binkley pastor and businessman form * Texas (withdrew February 27 2024; * endorsed Trump) ===Declined to be candidates=== The following notable individuals have been the subject of speculation about their possible candidacy, but have publicly denied interest in running. * Marsha Blackburn, U.S. Senator from Tennessee (2019–present), United States Representative from TN-07 (2003–2019) * Tucker Carlson, host of Tucker Carlson Tonight (2016–2023) and co-founder of The Daily Caller * Liz Cheney, United States Representative from WY-AL (2017–2023), Deputy Assistant Secretary of State for Near Eastern Affairs (2002–2004, 2005–2009) (considering independent run) * Tom Cotton, U.S. Senator from Arkansas (2015–present), United States Representative from AR-04 (2013–2015) * Dan Crenshaw, United States Representative from TX-02 (2019–present) * Ted Cruz, U.S. Senator from Texas (2013–present), 3rd Texas Solicitor General (2003–2008), candidate for president in 2016 (running for re-election) * Joni Ernst, U.S. Senator from Iowa (2015–present) * Josh Hawley, U.S. Senator from Missouri (2019–present) (running for re-election) * Brian Kemp, 83rd Governor of Georgia (2019–present), 27th Georgia Secretary of State (2010–2018), member of the Georgia Senate from the 46th district (2003–2007) * Adam Kinzinger, United States Representative from IL-16 (2011–2023) * Kristi Noem, 33rd Governor of South Dakota (2019–present), United States Representative from SD-AL (2011–2019) * Dan Patrick, 42nd Lieutenant Governor of Texas (2015–present) * Rand Paul, U.S. Senator from Kentucky (2011–present), candidate for president in 2016 * Mitt Romney, U.S. Senator from Utah (2019–present), 70th Governor of Massachusetts (2003–2007), candidate for president in 2008, Republican presidential nominee in 2012 * Mike Pompeo, 70th United States Secretary of State (2018–2021), 6th Director of the Central Intelligence Agency (2017–2018), United States Representative from KS-04 (2011–2017) * Paul Ryan, 54th Speaker of the United States House of Representatives (2015–2019), United States Representative from WI-01 (1999–2019) and Republican vice presidential nominee in 2012 * Rick Scott, U.S. Senator from Florida (2019–present), 45th Governor of Florida (2011–2019) * Chris Sununu, 82nd Governor of New Hampshire (2017–present), member of the New Hampshire Executive Council (2011–2017) * Donald Trump Jr., businessman, executive vice president of The Trump Organization * Ivanka Trump, Advisor to the President of the United States (2017–2021) * Scott Walker, 45th Governor of Wisconsin (2011–2019), 5th Executive of Milwaukee County (2002–2010), member of the Wisconsin State Assembly from the 14th district (1993–2002), candidate for president in 2016 * Glenn Youngkin, 74th Governor of Virginia (2022–present) ==Notes== ==References== Category:United States presidential primary elections Category:2024 United States presidential election",
 "title": "2024 Republican Party presidential primaries"
}