{
 "id": "995532",
 "text": "In 2023 there have been some (notable or) famous events at high-altitude; The things (or objects) involved, have been a danger to airspace security. The incidents are: *Chinese balloon incident; The shoot-down was off the coast of South Carolina, on February 4. The balloon was discovered (or detected) in North America on January 28, 2023; It traveled thru Alaska, Western Canada, and contiguous United States *Latin America balloon incident, detected February 2, 2023 in Central America; location of travel: Costa Rica, Colombia, and Venezuela; *The Shoot-down in Alaska or \"Alaska high-altitude object\"; February 9, was the second time a thing was detected (in 2023) at high- altitude over Alaska (in the United States); shoot-down on February 10; The object landed on the frozen sea off Deadhorse, Alaska, near the Prudhoe Bay Oil Field, in the territorial waters of the United States. *Yukon high- altitude object, shot down on February 11, 2023 in Canada, North America; Yukon *Lake Huron high-altitude object, discovered February 11, 2023 ; shot down the next day; location of travel: Alberta, Montana, Wisconsin, Michigan, Ontario, Lake Huron *Shandong high-altitude object, detected February 12, 2023 in Asia; location: Rizhao *Romania and Moldova high-altitude objects, detected February 14, 2023 over south-east Romania, and Moldova In February 2023, the United States government said that those things that were shot-down by the United States, were not (alien spacecraft or) a kind of Unidentified flying object (UFO).https://www.nrk.no/urix/fortsatt-uklart-hva-tre-nedskutte- objekter-var-1.16297624. NRK.no. Retrieved 2023-02-14 ==Related pages== *High- altitude ==Further reading== *Ellen Nakashima, Shane Harris & Jason Samenow, U.S. tracked China spy balloon from launch on Hainan Island along unusual path, Washington Post (February 14, 2023) *Natasha Bertrand and Katie Bo Lillis, US developed method to track China’s spy balloon fleet within last year, sources say, CNN (February 10, 2023) ==Sources== Category:February 2023 events",
 "title": "List of high-altitude thing incidents in 2023"
}