{
 "id": "995588",
 "text": "Maud Stevens Wagner (February 12, 1877 – January 30, 1961) was an American circus performer. She was the first known female tattoo artist in the United States. She was one of the last people to make tattoos while never using a tattoo machine. == Life == Wagner was born in 1877. She was born in Emporia, Kansas. Her parents were David Van Bran Stevens and Sarah Jane McGee. Wagner started working in traveling circuses. She was an acrobat and contortionist (someone who can move her body in many ways). She met Gus Wagner at the World's Fair in 1904. He was a tattoo artist, and had many tattoos on his body. Gus said that people in Borneo taught him how to make tattoos. He taught her how to tattoo people. Years later, they married. Gus gave Maud many tattoos. They had a daughter named Lotteva. Maud did not let Gus tattoo their daughter. She learned how to make tattoos when she was nine. Later, Lotteva became a tattoo artist. Wagner learned how to make traditional tattoos. These types of tattoos were made using a needle dipped in ink. The needle was held in the hand, and poked into the skin. Making tattoos in this way took a very long time. The tattoo machine (a machine that makes it easier to make tattoos) was made in 1891, but Wagner did not use it. Later, the Wagners were two of the last tattoo artists to work without tattoo machines. Maud Wagner was the first woman who was known to be a tattoo artist. She had tattoos of many different things. Tattoos covered almost all of her body. Some of her tattoos were pictures of monkeys, lions, horses, and snakes. She also had her name tattooed on her arm. Her husband made all of her tattoos. Wagner stopped working in the circus. Maud and Gus Wagner traveled to many places in the United States. They worked as tattoo artists. They also went to vaudeville shows, and showed people their tattoos. Maud and Gus Wagner had many tattoos on their bodies. They helped bring the art of making tattoos to new places in the United States. The art of making tattoos started in places on the coast. They showed it to people who lived in other places. Maud Wagner died on January 30, 1961. She died because of cancer. She is buried in Chase County, Kansas. == References == Category:1877 births Category:1961 deaths Category:American circus performers Category:Deaths from cancer",
 "title": "Maud Wagner"
}