{
 "id": "995766",
 "text": "The Sportvereinigung Braunau was a football club from the Upper Austrian district capital of Braunau am Inn. On 31 January 2002, the club went bankrupt was dissolved . From the 1993/94 season until the club was dissolved, the club played eight and a half seasons in the second-rate First Division. ==History== The SV Braunau was founded in 1919 in the team room of the Braunau barracks. The colors were black and white. The first friendly match against SV Ried took place in the summer of this year. In the 1920/21 season, the young club won the championship title in the 2nd class Gau Salzburg, which as one of three second classes served as the foundation for the Upper Austria-Salzburg League, which was then organized by the Football Association for Upper Austria and Salzburg. In addition, SV Braunau played friendly games in the early years, mostly against teams from neighboring Bavaria and the state of Salzburg. After the game was completely stopped in 1940 SV Braunau was started again in 1945 and took part in a championship for the first time. The next years were characterized by regular promotions and relegations in Upper Austrian football. 1991 SVB started to march through. They won the 2. Landesliga and next season the Landesliga. 1992/93 they reached also the promotion to the 2. Bundesliga. At the end of the 1990s Braunau struggeled with debts of 3.5 million schillings. They changed its purchase policy and became a kind of training club for youth players of SV Salzburg who were not accepted into the professional squad of the Bundesliga club. Until the financial crash in January 2002 Bernd Winkler, Alexander Schriebl, Manfred Pamminger and Gerhard Breitenberger and others came to Braunau from Salzburg. All of them became important players. At the end of 2000 Braunau could not pay the players' salaries for a long time. On 30 January 30 the club stopped playing and was finally was dissolved. The league was then played to the end with nine clubs, and all SVB games in the second half of the season were scored 0:3 for the other team.News.at ==Ground== The club played its home games in the local Grenzlandstadion Braunau. The capacity is 7500 people. ==Honours == *1993 -2002: First Division (2nd tier) * 2× Champion Upper Austria: 1992, 1993 * ÖFB- Cup Quarter finals :1998/99 Weltfußball.at ==References== Category:Austrian football clubs Category:Football clubs of Upper Austria Category:1919 establishments in Austria Category:2002 disestablishments in Europe Category:1910s establishments in Austria Category:21st-century disestablishments in Austria",
 "title": "SV Braunau"
}