{
 "id": "995970",
 "text": "Hwa Chong Institution (HCI) is an independent secondary educational institution in Bukit Timah, Singapore. Hwa Chong Institution was formed by the merger of The Chinese High School (1919–2004) and Hwa Chong Junior College (1974–2005) in 2005. Hwa Chong Institution provides secondary education for boys only from Years 1 to 4, and pre-university education for both boys and girls in Years 5 and 6. Hwa Chong Institution operates under the Special Assistance Plan (SAP) for bilingualism. The school also offers the Integrated Programme and the Gifted Education Programme. Hwa Chong Institution is also a member of Strategic Alliance of Global Educators, Strategic Educational Alliance of Southeast Asia and the Global Learning Alliance which involves some of the world's best schools. Hwa Chong Institution is also partnered with educational institutions across the world. It includes cross-border research collaboration with the Loudoun Academy of Science and Westport Schools District. == History == The school is previously two separate schools. However, they are both affiliated with one another. It is called The Chinese High School and Hwa Chong Junior College. On 1 January 2005, both schools merged to form Hwa Chong Institution. The schools were merged as it wanted to offer the six-year Integrated Programme. The programme skips the Singapore- Cambridge GCE Ordinary Level examinations, which is tested in Year 4. Instead, student's take the Singapore-Cambridge GCE Advanced Level examinations, which is tested in Year 6. After the merge, the High School section still remained boys-only. The college section remained co-education. In spite of the merger, the High School section remains boys-only. The College section remains co- educational. Students in the college section consists of boys from Hwa Chong's High School section and girls Nanyang Girls' High School. === The Chinese High School (1919–2004) === The Chinese High School was founded by Tan Kah Kee in March 1919. The school was originally located at Niven Road. It was named the Singapore Nanyang Overseas Chinese Middle School. Originally, there was 78 pupils. The school offered comprehensive secondary level Chinese education. The school's clock tower is a national monument. In 1925, the school moved to its Bukit Timah campus. The school struggled to survive due to financial difficulties. However, Lee Kong Chain and Tan Kah Kee continued to strongly support the school. Today, the school commemorates what they did for the school. The school was accorded the Special Assistance Plan (SAP) status in 1979. Later, in 1988, the school achieved the status of an independent school. === Hwa Chong Junior College (1974–2004) === In the late 1960s, Singapore's education system introduced a two-year programme for pre-university education. After knowing about it, The Chinese High School's board of directors decided to construct a junior college immediately. They made it beside to The Chinese High School. This junior college was the second to be built in Singapore. It was government-aided. Hwa Chong Junior College began lessons in 1974 under the same administration as The Chinese High School.\"About us \", Hwa Chong Institution, Retrieved 30 August 2012. In 2004, Hwa Chong Junior College became independent. It is the first independent junior college in Singapore. === Merger as Hwa Chong Institution (2005–present) === Following the introduction of the Integrated Programme into Singapore's education system in the early 2000s, The Chinese High School merged with Hwa Chong Junior College on 1 January 2005. The merger formed an integrated institution. It have a High School section and a college section. In the same year, Hwa Chong International School was established. it offers independent education that leads to the International Baccalaureate Diploma. When HCI was formed in 2005, the former Hwa Chong Junior College's principal Ang Wee Hiong became the new principal and chief executive officer of HCI. Hon Chiew Weng, who was previously the principal of The Chinese High School, became principal of the High School Section and Deputy Chief Executive Officer of HCI. In 2008, HCI was selected for the FutureSchools@Singapore programme.Anna Yap, \"Internationalising Singapore \", Challenge (Singapore), November 2007. Retrieved 2 September 2012. In 2009, Hon Chiew Weng succeeded Ang Wee Hiong as Principal of HCI. Hon retired on 22 December 2017, and was succeeded by Pang Choon How. He studied at the school and was previously the principal of Chung Cheng High School (Main). ==== 100th Anniversary ==== HCI commemorated its centenary on its founder's day, 21 March 2019. On 21 March 2019, in commemoration of the school's centennial, a dinner was held. It was named the \"dinner of 10,000 people\". It was celebrated in the field before the school's iconic clock tower and the statue of Tan Kah Kee, the school's founder. The dinner had 12,581 attendees, including Singapore's Prime Minister Lee Hsien Loong. == School identity and culture == === Uniform and attire === In the High School Section, students in Secondary 1 to Secondary 3 (inclusive) wear a white short-sleeved shirt with khaki short trousers and white socks, which must cover the ankles. The school collar pin should be worn on the left collar. Either white, blue or black shoes with either white or black laces. Secondary 4 students wear beige long trousers with a beige shirt, similar to the boys in the College Section. In the College Section, girls wear a beige blouse and a beige skirt.Rules & Regulations , Hwa Chong Institution. Retrieved 4 September 2012. === Crest === The current school crest of Hwa Chong Institution is a edited form of the traditional Chinese character Huá (華), which is part of the school name and reflects its Chinese heritage. The crest has a red background and looks like a burning torch. == Notable alumni == Hwa Chong Institution and its former schools, The Chinese High School and Hwa Chong Junior College, have a lot of student which graduated from these schools. Its most famous alumnus is most likely Ong Teng Cheong, the fifth President of Singapore. Some other notable alumnus include Grace Fu, Sim Ann, Goh Si Hou, Shou Zi Chew, Olivia Lum, Tan Chin Hwee and Wee Cho Yaw. == Gallery == File:南洋华侨中学校门.JPG|Gate 3 of Hwa Chong Institution File:Statue of Dr Lee Kong Chian.jpg|Statue of Lee Kong Chian, a major donor, after whom the Kong Chian Administration Centre in the background is named File:CHS Tower Block.jpg|The Clock Tower Building, a national monument, which formerly served as an observation point during the Battle of Singapore File:新加坡南洋华侨中学钟楼.JPG|Another view of the Clock Tower, with a statue of Tan Kah Kee in front of it File:华侨中学教学楼.jpg|Classroom Block A of the High School Section File:Hwa Chong Junior College 2004.jpg|Main Facade of HCI's college section File:HCI SALT Centre.jpg|HCi's SALT Centre File:HCI Admin Block.jpg|HCI Admin Block File:HCI SRC.jpg|HCI SRC File:HCJC block.jpg|One of HCI college section blocks File:Science Research Centre.jpg|HCI Science Research Centre File:华侨中学体育场.JPG|HCI School Field == Other websites == * School website == References == Category:Schools in Singapore",
 "title": "Hwa Chong Institution"
}