{
 "id": "996069",
 "text": "Kokusai himitsu keisatsu: Tora no kiba (国際秘密警察 虎の牙, International Secret Police: Tiger's Fang), also known as Fangs of the Tiger, is a 1964 Japanese comedy-spy directed by Jun Fukuda. It is the second installment of five films in the Kokusai himitsu keisatsu series, a parody of James Bond-style spy movies. == Plot == The Vice Minister of Industry of the Republic of Alabanda, Klima, has come to Japan to purchase materials for building a water dam in the country. Jiro Kitami, who called himself a salesman and met with Klima, acted as his bodyguard. However, when Kitami learns that a large number of industrial cylinders have been purchased that have nothing to do with the dam construction, Klima secretly confines his secretary and her father and threatens him to produce poison gas. Klima plans to send the poison gas into a cylinder and send it to Alabanda to cause a civil war between the government and local guerrillas. At the same time, Klima secretly investigates Kitami's identity and finds out that he is an undercover agent working for ISP (International Secret Police). == Cast == * Tatsuya Mihashi as Jiro Kitami * Yumi Shirakawa as Rie Akashi * Tadao Nakamaru as Klima * Susumu Kurobe as Sabato * Kumi Mizuno as Reiko Matsushita * Akira Kubo as Sakuma * Susumu Fujita as Akashi (Rie's father) * Shoji Oki as Colonel Zumba * Toru Ibuki as Kajal * Tetsu Nakamura as Omuta * Naoya Kusakawa as Akagi * Hisaya Ito as Sudo * Hans Horneff as Berlanko * Harold Conway as Henry * Ed Keane as ISP Chief * Nadao Kirino, Akira Wakamatsu as Klima's henchmen * Toyohiko Sata as Takeda * Noriko Sengoku as Housewife next door * Shoichi Hirose as Repairman * Shin Otomo as Minister of Industry * Koji Uno as Secretary to the Minister of Industry ※ Non-credit * Toshio Miura as Klima's driver * Jun'ichirô Mukai as Alabanian Army officer * Kozo Nomura as Security officer at the airport * Seiji Ikeda as Police captain * Masaaki Tachibana, Hideo Shibuya, Wataru Ōmae as Alabanian Army soldiers * Yutaka Oka, Rinsaku Ogata, and Minoru Ito as Industrial staff * Yoshiyuki Uemura, Hiroshi Takagi, and Ryusuke Saijo as Alabanian rebels == Staff == * Producers: Tomoyuki Tanaka, Shin Morita * Screenwriter: Hideo Andô * Cinematographer: Masaharu Utsumi * Composer: Kan Ishii * Editor: Ryôhei Fujii * Production Designer: Kazuo Takenaka * Chief Assistant Director: Ken Sano * Sound Recording: Akira Saitô * Lighting Technician: Mitsuo Kaneko",
 "title": "Fangs of the Tiger"
}