{
 "id": "996129",
 "text": "Arthur Leigh Allen (December 18, 1933 – August 26, 1992) was an American sex offender who is a suspect in the Zodiac Killer series of killings. Allen became a suspect in 1971 when Don Cheney reported him to the police. Cheney was Allen's friend. Cheney met Allen in 1962 and became friends later in 1968. According to Allen, in a visit between Cheney and Allen between 1968 and 1969, Allen confessed to his desire to kill couples at lovers' lanes. Cheney said that Allen would use a gun with a flashlight attached to the barrel, like the Zodiac Killer. He also claimed that he would write letters to police under the name ‘Zodiac’. People said Cheney never visited Allen again after the conversation. Cheney was interviewed by San Francisco Police Department inspector Bill Armstrong. Police investigated Allen in 1971. In July of 1992, a victim of Zodiac, Mike Mageau, picked Allen as the man who shot him at Blue Rock Springs on a police lineup saying, “That’s him! He’s the man that shot me!”. == Early life == Allen was born in Honolulu, Hawaii on December 19, 1933. He grew up in Vallejo, California, and graduated from Vallejo High School in 1950, From 1951 to 1953, Allen worked at many jobs such as a lifeguard, and a sailmaker. Allen entered the United States Navy on December 13, 1951, and served until his honorable discharge on December 12, 1959. During his time in the navy, he served mostly in the reserves but spent some time on active duty. He served on multiple submarines and earned the China Service Medal for his service in southeast Asia. On April 4, 1958, Allen faced a special court-martial at Treasure Island for bringing a loaded .45 pistol onto the naval base. He was found not guilty. He received an Associate of Arts degree from Vallejo College in 1957. He then attended California Polytechnic State University, San Luis Obispo, however, he left the university in 1957. Allen studied at California's Polytechnic State University, San Luis Obispo again in 1958, He graduated in 1960 for which he received a Bachelor's degree. From 1960 to 1962, Allen was an elementary school teacher at Santa Rosa Elementary School in Atascadero, California. In 1962, Allen began teaching at Travis Elementary School in Fairfield, California, However, he was fired for having a firearm on school grounds. In 1966, Allen was hired as a teacher at Valley Springs Elementary School after moving to Valley Springs, California. In 1968, Allen was fired and charged after allegedly molesting students. == Criminal History == In 1974, Allen was arrested for child molestation. After pleading guilty, Allen was sent to Atascadero State Hospital for pre-sentence evaluation and treatment. On May 13, 1977, Allen was given a suspended prison sentence and five years of felony probation. He completed probation successfully in 1982. == Death == On August 26, 1992, Vallejo’s police and fire departments were notified of a person needing assistance at 32 Fresno Street. When they arrived, ambulance and fire personnel discovered Arthur Leigh Allen's lifeless body on the floor of his basement. According to Allen's autopsy, he died of arteriosclerotic heart disease.",
 "title": "Arthur Leigh Allen"
}