{
 "id": "996242",
 "text": "Philip Glenn Whalen (October 20, 1923 – June 26, 2002) was an American poet and a Zen Buddhist monk. Whalen grew up in a small town, The Dalles, Oregon. He went to public schools, and he wrote poetry for his high school magazine. He was drafted into the U.S. Army Air Corps in 1943 but stayed in the United States. After the war he went to Reed College. His tuition was paid by the G. I. Bill. There he became a friend of poets Lew Welch and Gary Snyder. They all met poet William Carlos Williams when he visited in 1950. In 1951 Whalen got a B. A. in general literature. In the early 1950s, Whalen travelled around the West Coast. At one point, Snyder helped him to become a fire lookout in the Cascade Mountains. He moved to San Francisco in 1955. On October 7, 1955, he read poems at the Six Gallery. He read with Snyder, Allen Ginsberg, Philip Lamantia, and Michael McClure. This has been called \" birth of the Beat generation.\" From this time, Whalen's friendship with Ginsberg and Jack Kerouac connected him to the Beat movement. The Six Gallery reading also was the start of the San Francisco poetry renaissance. In 1973 Whalen became an ordained Zen Buddhist monk. He lived at Zen Centers in San Francisco and Santa Fe, New Mexico. Whalen died in San Francisco in 2002. == Poetry == * The Calendar, a Book of Poems. (1951) * Self Portrait from Another Direction. (1959) * Memoirs of an Interglacial Age. (1960) * Like I Say. (1960) * Monday in the Evening, 21:VII:61. (1964) * Every Day. (1965) * Highgrade: Doodles, Poems. (1966) * On Bear's Head. (1969) * Scenes of Life at the Capital. (1970) * Enough Said: Fluctuat Nec Mergitur: Poems 1974-1979. (1980) * Heavy Breathing: Poems 1967-1980. (1983) * Canoeing up Cabarga Creek: Buddhist Poems 1955-1986. (1996) * Overtime: Selected Poems by Philip Whalen. (1999) * The Collected Poems of Philip Whalen. (2007) == Prose == * You Didn't Even Try. (1967) * Imaginary Speeches for a Brazen Head. (1972) * Off the Wall: Interviews with Philip Whalen. (1978) * The Diamond Noodle. (1980) * Winning His Way, or, the Rise of William Johnson: a diverting history for the instruction & improvement of the breed. (1983) * Two Novels. (1985) * Goof Book (for Jack Kerouac). (2001) == Related pages == *List of poets from North America ==References== ==Other websites== *Philip Whalen at PennSound Category:1923 births Category:2002 deaths Category:American poets Category:Writers from Portland, Oregon",
 "title": "Philip Whalen"
}