{
 "id": "996304",
 "text": "The Dave Clark Five, also known as the DC5, were an English pop rock band formed in Tottenham, a town in the London Borough of Haringey, in the year 1958. == Forming (1958-1962) == The group was first formed by Dave Clark to help fund new equipment for his football team, under the name The Dave Clark Five Featuring Stan Saxon. Eventually, it became an actual full-time rock band. The Dave Clark Five Featuring Stan Saxon members included: Stan Saxon singing vocals, Mick Ryan on guitar, Chris Walls on bass, and later Rick Huxley on guitar. In 1961, Saxon, Ryan and Walls left and their name was shortened to The Dave Clark Five. Huxley switched to Bass and Mike Smith, and Lenny Davidson joined that same year. A year later, Denis Payton joined on guitar, saxophone, and harmonica. == Worldwide Success (1963-1972) == In 1963, they signed to EMI records and started releasing songs. Around this time, The Beatles had recently came into the spotlight. By 1964, the British Invasion phenomena had begun and the Dave Clark Five became rivals to the Beatles. The Dave Clark Five first appeared on The Ed Sullivan Show in March 1964 (one month after the Beatles). The Clark Five would appear on the Ed Sullivan show the most (when compared to other British Invasion groups). The Dave Clark Five would have hit after hit, including Glad All Over, Bits And Pieces, Over and Over, and Because, among others. In 1970, the Dave Clark Five would split up, however, Clark and Smith would rebrand the group into Dave Clark and Friends. The Dave Clark and Friends split in 1972. The Dave Clark and Friends members included: Alan Parker (guitar), and Eric Ford (bass). == Post-Clark Five == Clark is an entrepreneur and a multi-millionaire. He owns a house in West London that costs £12 million. Clark owns the rights to all the Dave Clark Five music masters. In the 1980s he acquired the rights to the 1960s UK music show Ready Steady Go!. Clark was close friends with Freddie Mercury, lead singer of Queen, who he first met in the year 1976. He was by Mercury's bedside when Mercury died on 24 November 1991. Clark produced an album called Time in the 1980s. Smith worked as a solo artist. He was paralysed in 2003 and died of Pneumonia in 2008. He died eleven days before The Dave Clark Five were inducted into the Rock and Roll Hall of Fame. Davidson opened an antique shop and organ-repair shop. He also teaches guitar in the UK county Buckinghamshire. Huxley worked in property. He died of Emphysema in 2013. Payton worked in real estate. He died of Cancer in 2006. == Rock and Roll Hall of Fame == The Dave Clark Five were inducted into the Rock and Roll Hall of Fame in 2008. The ceremony was attended by Clark, Davidson, and Huxley. Mike Smith died of Pneumonia eleven days before the ceremony. They were inducted by Tom Hanks. == Studio albums == * Glad All Over (US, 1964) * The Dave Clark Five Return! (US, 1964)/A Session with The Dave Clark Five (UK, 1964) * American Tour (US, 1964) * Coast to Coast (US, 1964) * Weekend in London (US, 1965) * Having a Wild Weekend (US, 1965)/Catch Us If You Can (UK, 1965) * I Like It Like That (US, 1965) * Try Too Hard (US, 1966) * Satisfied with You (US, 1966) * 5 By 5 (US, 1967) * You Got What It Takes (US, 1967) * Everybody Knows (US, 1968)/Everybody Knows (UK, 1967) * 5 by 5 = Go! (UK, 1969) * If Somebody Loves You (UK, 1970) Category:Musical groups from London",
 "title": "The Dave Clark Five"
}