{
 "id": "996363",
 "text": "Maxset Kewnimjaevich Otemuratov — (rus, Махсет Кеунимжаевич Отемуратов) born, 14 June 1978, Nukus, Karakalpakstan, Uzbekistan and Karakalpakstan folk pop singer: sings in Uzbek and in Karakalpak language. Nihol Young Talent Award | Laureate of the Nihol Award (2001) Honored Artist of Karakalpakstan (2005), Honored Artist of Uzbekistan (2011) Actor == Biography == Maxset Keulimzhaevich Otemuratov was born on June 14, 1978 in Akmangit village. In the village of of Nukus district in a simple family. Father: Utemuratov Keulimzhai (born March 21, 1940). Mother: Utemuratova Aksulu (born March 8, 1946). In 1985 he went to study at high school № 1 named after M. V. Frunze, in 1990 he continued his studies at high school № 21 named after Berdakh, and in 1995 he safely graduated. In 1996, he entered the Faculty of Physical Education Nukus of the Pedagogical Institute named after Aziyaz. In 1996-1997 he was the head of the KVN \"Turan\". Since those years he begins his creativity. In 1996, at a competition dedicated to the memory of the deceased Zamira Khojanazarova, takes an honorable 3rd place. Winning the attention of honorary teachers, begins to perform on the big stage. In 1999 having successfully graduated from the university begins to work as a methodologist in the department of work with talented children. In 2000 - for the first time in the history of Karakalpakstan KVN team \"Turan\" won the Republican round of the contest \"Kunaklar kham zyirekler\" and received a gold cup. Makhset Otemuratov was awarded a diploma of Jokary Kenes Karakalpakstana == Prizes and Awards == * 1996 - 3rd place in the contest dedicated to the memory of deceased Zamira Khozhanazarova * 2001 - Winner of the State Award \"Nihol\" * 2004 - Winner of the Republican round of the contest \"Uzbekistan - My Homeland\" contest. * 2005 - Title of \"Honored Artist of Karakalpakstan\" by the decision of Deputy Jokary Kenes Musa Tazhetdinovich Yerniyazov * 2011 - The title of \"Honored Artist of Uzbekistan == Concerts == * May 24, 2000 - Berdakh Republican Music Theater * October 23, 2001 - Amphitheater * January 20–23, 2004 - Berdakh Cinema * April 14–16, 2008 - Karakalpak music theater, \"Men Yelimnyң Ashygiman\" (\"I Am in Love with My Country\") * September 5, 2010 - On the Wings of Geese (On the Wings of Geese) at the Amphitheater * 2013 - Khalkym menen maqtanaman ('I am proud of my people) at the Karakalpak State Music Theatre * March 1–7, 2016 - \"Anam-au\" at Berdakh State Theater of Music == Family == Father: Utemuratov Keunimzhai (1940-2011), worked in Mobile Mechanized Column of Nukus district. Mother: Utemuratova Aksungul (1946-2020), worked at the Central Hospital of Nukus district. Brother: Muratbai (born 1968). Sisters: Tamara (born 1965), Perdegul (born 1970), Klara (born 1971), Muhabbat (born 1974). Spouse: Gulzira Kutlymuratova (born 1982), housewife. Children: Dilfuza (born 2002), Salimboy (born 2004), Zaurbek (born 2007), Ilkhambek (born 2014). == Discografiya == Title Years 1 Kel Gulim 01.11.2019 2 Bir so'z 05.06.2019 3 Biri sensen biri men 07.08.2019 4 Kel bag'larima 02.10.2018 5 Gulimsen 09.11.2019 6 Ulken Uy 02.04.2019 7 Ajag'a 8 A'kege arnaw 9 A'kejan 10 Alistagi dostim 11 Anajan 12 Anajanim 13 Analardi asra 14 Anamaw 15 Apa 16 Apaw apaw 17 Aqmang'it ariwlari 18 Aqmang'it tan'i 19 Aral 20 Ayraliq darti 21 Ayt sen Ajiniyazdin' qosiqlarin 22 Bag'da gulim 23 Bagisha 24 Bawirman 25 Baxitli ana 26 Baxtin'di taptin' 27 Bir gulsen 28 Bir so'z 29 Biri sensen' biri men 30 Bunyodbek 31 Debdu 32 Elim Qaraqalpag'im 33 G'azlardin' qanatinda 34 Gozzalimsan' 35 Gulimsen 36 Gu'lrayxan 37 Imrambek 38 Ishqi bag'inda 39 Jan su'ymegen 40 Janim Akem 41 Joytaman 42 Kel bag'larima 43 Kel Gulim 44 Kewil 45 Ku'ygelek ko'zli yarim 46 Maqtanaman 47 Men su'ygen qiz 48 Mexir bulag'i 49 Muhabbat 50 Mun qalmas 51 Nalish 52 Nawriz keldi 53 Nawriz 54 Nazli yar 55 Nazlinin' 56 Nege bilmedim 57 Oynag'anda 58 Pariyler 59 Pashayi koylek 60 Pedinstitut 61 Perishte 62 Perizat 63 Peryzadim sendedur 64 Peryzadim 65 Qalbim sirlari 66 Qa'lbimdi biylegen 67 Qaraqalpag'im 68 Qaraqalpag'im 69 Qarindasim 70 Qazaq qizi 71 Qirmizi apa 72 QQ Perzentimen 73 Ramazan 74 Raxmet ustazlar 75 Rayxanim 76 Sag'inbadin'ba 77 Sag'indim 78 Sahibjamal qizim 79 Sauir yar 80 Sauiyr yar 81 Sa'wdigim 82 Shiyrin pallarina 83 Sirli sezim 84 Suliw 85 Suttey pak anam 86 Suyigen yarim bar 87 Su'yiklim 88 Suyip qaldim 89 Tek o'zin' 90 To'lqin Jabborov & Ozodbek Nazarbekov & Maxset & Yahyobek - Orol 91 Tug'an jer 92 Uanttim seni 93 Ulken uy 94 Ullarim 95 Ulli O'zbekistan 96 Ush qon'ir 97 Ustamiza 98 Ustazim 99 Xaliq so'zligi 100 Xalqim sen degende 101 Yadima tu'sti 102 Zaman keldi == References == Category:1978 births Category:Living people Category:Uzbekistani people",
 "title": "Maxset Otemuratov"
}