{
 "id": "996446",
 "text": "\"No One Knows\" is a song by Queens of the Stone Age. Queens of the Stone Age is an American rock band. The song was written by Josh Homme and Mark Lanegan. It was the first single from the band's third album, Songs for the Deaf. The song was released on November 26, 2002. \"No One Knows\" was the band's first song to be on the Billboard Hot 100. It was nominated for a Grammy Award in 2003. == Release == \"No One Knows\" was released as a single on November 26, 2002. It is the most successful single from Songs for the Deaf. It went onto many rock music charts in the United States. It was also number one on the US Alternative music chart. It is the band's highest charting single in many countries, such as the Netherlands and Ireland. The song reached number 15 on the UK Singles Chart.Queens of the Stone Age – UK Singles Chart. officialcharts.com. Retrieved on Jan 03, 2013. Many critics liked the song. Triple J, an Australian radio station, voted it the best song of 2002. Triple J also voted four other Queens of the Stone Age songs for the top 100 best songs of 2002. Rolling Stone put \"No One Knows\" at number 97 on their list of the 100 best guitar songs. \"With this enduring throwback to the T. Rex beat, QOTSA guitarist and overall mastermind Josh Homme found the sweet spot between hooky hard rock and the pulverizing metal he'd grown up playing. More than a few of the last half-decade's modern-rock bands have taken their cues from this hybrid of downtuned menace and AM-radio sugar frosting.\" In 2014, NME said it was one of the 100 greatest songs of all time. The song was nominated for a Grammy Award for Best Hard Rock Performance in 2003. It was the band's first Grammy nomination. The award was given to \"All My Life\" by Foo Fighters. Dave Grohl, a member of Foo Fighters, played the drums on \"No One Knows\". == Track listing == The single version of the song was released in many different ways. It was released on CD and 7\" vinyl. The single had other songs on it. Different versions of the single had different songs. ;German CD, UK release CD-1: # \"No One Knows\" (Josh Homme, Mark Lanegan) # \"A Song for the Dead\" (live from The Mean Fiddler, Soho, London, England) (Homme, Lanegan) # \"Avon\" (live from The Mean Fiddler, Soho, London, England) (Homme) # \"No One Knows\" (multimedia track) (Homme, Lanegan) ; ;UK release CD-2: # \"No One Knows\" (Homme, Lanegan) # \"Gonna Leave You\" (Spanish version) (Homme, Nick Oliveri) # \"Tension Head\" (live from The Mean Fiddler, Soho, London, England) (Homme, Oliveri) ;European 7\": # \"No One Knows\" (Homme, Lanegan) # \"Tension Head\" (live from The Mean Fiddler) (Homme, Oliveri) ; ;Canadian CD: # \"No One Knows (album version)\" # \"No One Knows (UNKLE reconstruction – radio edit)\" # \"No One Knows (UNKLE reconstruction – full-length)\" # \"No One Knows (UNKLE reconstruction – instrumental)\" # \"No One Knows\" (multimedia track) :All songs by Homme, Lanegan == References == Category:2002 songs Category:Alternative rock songs Category:Hard rock songs Category:Queens of the Stone Age songs Category:Boogie rock songs",
 "title": "No One Knows"
}