{
 "id": "996637",
 "text": "Jake Wesley Rogers (born 19 December 1996) is an American pop musician and songwriter. == Biography == Rogers was born in Springfield, Missouri, where he learned to play the guitar at age 6 and began playing piano and voice training at age 12. He began performing in theater productions in 5th grade and writing songs soon thereafter. At a young age he attended formative concerts for artists like Lady Gaga and Nelly Furtado. He came out as gay in 6th grade, and though his family was supportive he felt he had to hide his orientation due to the cultural climate in his hometown. Rogers moved to Nashville at age 18 to study songwriting at Belmont University. In his first year Rogers' live performance attracted the interest of Sony/ATV, resulting in a publishing deal. He graduated in 2018. == Career == Rogers began releasing music independently in 2016, leading to his debut EP Evergreen in June 2017. After releasing his next two singles \"Jacob from the Bible\" and \"Little Queen\" in February and March 2019 respectively, Rogers released his sophomore EP Spiritual in April 2019, followed by a European tour and a performance on BBC Radio 4 that fall. In November 2020, Rogers was featured on the Happiest Season soundtrack executive produced by Justin Tranter, alongside a slate of other LGBTQ songwriters and artists. In May 2021, it was revealed that Rogers had signed to Warner Records via Tranter's imprint Facet Records. Rogers released his debut major label single \"Middle of Love\" alongside the announcement. The single, which was co-written with Tranter and Eren Cannata, is the first offering from Rogers' forthcoming 2021 EP. Rogers released his next single \"Momentary\" in June 2020. Rogers made his TV debut on October 5, 2021 on The Late Late Show with James Corden (Season 7, Episode 17), performing the song “Middle of Love”. Rogers will appear as an opening act on Ben Platt's Reverie Tour in September and October 2022. Rogers will also appear as an opening act on Panic! at the Disco's Viva Las Vengeance Tour in September and October 2022. == Discography == === Evergreen (2017) === * Release date: June 16, 2017 * Formats: digital download, streaming * Label: Self released ==== Track listing ==== # Evergreen # You Should Know # Sanctuary # Love You Like No Other === Spiritual (2019) === * Release date: April 5, 2019 * Formats: digital download, streaming * Label: Self released ==== Track listing ==== # Jacob from the Bible # The Pretender # Little Queen # Man on the Moon # Holy Man === Pluto (2021) === * Release date: October 1, 2021 * Formats: digital download, streaming * Label: Facet Records/Warner Records ==== Track listing ==== # Weddings and Funerals # Middle of Love # Pluto # Under the Sun # Cause of a Scene # Momentary === LOVE (2022) === * Release date: October 21, 2022 * Formats: digital download, streaming * Label: Facet Records/Warner Records ==== Track listing ==== # Call it Love # Lavender Forever # Modern Love # My Mistake # Hindsight # Dark Bird ==References== ==Other websites== *jakewesleyrogers.com * * * * Category:Living people Category:1996 births Category:American singer-songwriters Category:Singers from Missouri Category:American pop singers Category:American LGBT people",
 "title": "Jake Wesley Rogers"
}