{
 "id": "996974",
 "text": "This is a list of Israeli highways. Besides highways in Israel proper, it includes highways in the West Bank and the Golan Heights, because the Israeli administration maintains them in these areas. There are 48 designated Israeli highways. Most of these are open-access arterial expressways, which may be entered from ordinary junctions. Some are limited-access freeways, which may be entered from interchanges. Six highways are freeways, six are partially limited-access freeways and partially expressways, and the other 35 are expressways. There is only one three-digit road in the country classified as a freeway, Route 431. Highway 6, the Trans-Israel Highway, is the only toll road. Two of the expressways (Highway 57 and Highway 60) are divided into several separate sections as a result of an IDF decree forbidding Israelis from traveling on certain stretches of these highways (see Notes below). ==1–99== Road Classification Length Start location Intermediate locations End location Highway 1 Freeway, part Expressway 94 km Tel Aviv Ben Gurion International Airport, Lod, Jerusalem Jordan River Valley Highway 2 Freeway, part Expressway 89 km Tel Aviv Herzliya, Netanya, Hadera Haifa Highway 3 Expressway 53 km Ashkelon Kiryat Mal'akhi Mevo Horon Highway 4 Expressway, part Freeway 205 km Erez border crossing Ashkelon, Ashdod, Yavne, Rishon LeZion, Holon, Ramat Gan, Bnei Brak, Petah Tikva, Kfar Saba, Raanana, Netanya, Hadera, Haifa, HaKerayot, Akko, Nahariya Rosh HaNikra Crossing Highway 5 Freeway, part Expressway 40 km Tel Aviv Ramat Hasharon, Petah Tikva, Rosh HaAyin Ariel Highway 6 Tollway 180 km Shoket Interchange Rosh HaAyin, Kfar Saba, Yokneam, Kiryat Gat, Beer Sheva, Harish, Kiryat Tivon Eliakim Highway 7 Expressway 16 km Gedera Yad Binyamin Highway 9 Freeway 12.2 km Mikhmoret Elyakhin, Hadera Maor, Sde Yitzhak Highway 10 Expressway 182 km Sayarim Valley Nitzana Kerem Shalom Highway 12 Expressway 71 km Eilat Ovda Neot Smadar Highway 13 Expressway 12 km Menuha Plain Tzhiha Valley Highway 20 Freeway 34.6 km Gan Sorek Rishon LeZion, Bat Yam, Holon, Tel Aviv, Giv'atayim, Ramat Gan Herzliya Highway 22 Freeway 17 km Haifa HaKrayot Kfar Masaryk Highway 23 (Carmel Tunnels) Freeway, mostly tunnel 8 km Haifa Haifa Highway 25 Expressway 118 km Nahal Oz Netivot, Beersheba, Dimona Arava Highway 31 Expressway 85 km Eshel HaNassi Lehavim, Hura, Kuseife, Arad Neve Zohar Highway 34 Expressway 20 km Netivot Sderot Yad Mordechai Highway 35 Expressway 58 km Ashkelon Kiryat Gat Hebron Highway 38 Expressway, Part Freeway 29 km Bet Govrin Bet Shemesh Sha'ar HaGai Highway 39 (planned) Freeway 25 km (planned) Nir Banim Valley of Elah Jerusalem Highway 40 Expressway 300 km Lotan Mitzpe Ramon, Beersheba, Kiryat Gat, Kiryat Mal'akhi, Gedera, Rehovot, Ramla, Lod, Petah Tikva, Hod HaSharon Kfar Saba Highway 41 Expressway 4 km Ashdod Gedera Highway 42 Expressway 19 km Ashdod Yavne Rishon LeZion Highway 44 Expressway 41 km Tel Aviv Holon, Lod, Ramle Eshet'el Highway 45 Expressway 4.7 km Givat Ze'ev Atarot Industrial Zone Highway 46 Expressway 4 km Ben Gurion Intl Airport Tirat Yehuda Highway 50Also referred to as \"Sderot (Menachem) Begin\", \"(Menachem) Begin Boulevard\", \"Begin Expressway\" or \"Begin Highway\", the road has been known as and still appears on some maps as \"Route 404\". In 2012, the Israel Ministry of Transport and the Jerusalem Municipality began using the new designation, \"Highway 50\". New blue \"Highway 50\" signs are being posted to reflect this change. Freeway 16.2 km Atarot Beit Hanina, Ramot, Har Hotzvim, Kiryat HaLeom, Katamonim, Malha, Gilo Gilo Highway 55 Expressway 23 km Kfar Saba Karnei Shomron Kedumim Highway 57 (Western section)At the time of its designation Highway 57 was a consecutive highway, running from Netanya to Adam Bridge Border Crossing. With the outbreak of the Al-Aqsa Intifada an IDF decree forbade Israelis from traveling on the Nitzanei Oz – Hamra section, effectively splitting Highway 57 into two separate highways. Final designation of the highway is dependent on the final status agreement between Israel and the Palestinians. Expressway 15 km Netanya Kfar Yona Nitzanei Oz Highway 57 (Eastern section) Expressway 15 km Hamra Adam Bridge Border Crossing Highway 60 (Southern section)At the time of its designation Highway 60 was a consecutive highway, running from Beersheba to Nazareth. With the outbreak of the Al-Aqsa Intifada an IDF decree forbade Israelis from traveling the section between the Qalandia checkpoint and Geva Binyamin and the section between Tel Dotan and the Jalamah checkpoint, effectively splitting Highway 60 into three separate highways. Final designation of the highway is dependent on the final status agreement between Israel and the Palestinians. Expressway 100 km Beersheba Hebron, Bethlehem, Jerusalem Qalandia checkpoint Highway 60 (Central section)Travel on the northernmost 24 km of this section of Highway 60 (Shavei Shomron - Tel Dotan) is recommended only with an IDF escort, due to security concerns. Expressway 90 km Geva Binyamin Shilo, Eli Tel Dotan Highway 60 (Northern section) Expressway 24 km Jalamah checkpoint Afula Nazareth Highway 61 Expressway 2 km Maor, Sde Yitzhak Baqa al-Gharbiyye Highway 65 Expressway 90 km Caesarea Hadera, Pardes Hanna-Karkur, Umm al-Fahm, Afula Kadarim Highway 66 Expressway 20 km Ma'ale Iron Yokneam Illit Highway 70 Expressway 76 km Zikhron Ya'akov Yokneam Illit, Kiryat Tivon, Kiryat Atta, I'billin, Shefar'am, Tamra, Jadeidi-Makr, Abu Sinan Shlomi Highway 71 Expressway 35 km Afula Bet She'an Jordan River Border Crossing Highway 73 Expressway 12 km Nahalal Migdal HaEmek Tel Adashim Highway 75 Expressway 40 km Haifa Nesher, Kiryat Tivon, Migdal HaEmek, Nazareth Illit Nazareth Highway 77 Freeway, part Expressway 47 km Ramat Yishay Zarzir, Kafar Kanna Tiberias Highway 79 Expressway, part Freeway 27 km Kiryat Bialik Kiryat Atta, Shefar'am Reineh Highway 80 Expressway 34 km Ar'ara BaNegev Bet Yatir Highway 85 Expressway 37 km Akko Shagor, Karmiel, Nahf, Rame Korazim Highway 87 Expressway 35 km Kfar Nahum Alonei HaBashan Highway 89 Expressway 58 km Nahariya Ma'alot-Tarshiha, Safed Elifelet Highway 90 Expressway 480 km Taba Border Crossing Eilat, Jericho, Bet She'an, Tiberias, Hatzor HaGlilit, Kiryat Shmona Metula Highway 91 Expressway 28 km Mahanayim Eyin Zivan Highway 92 Expressway 24 km Tzemah Bet Tzeyda Highway 98 Expressway 99 km Ma'agan Majdal Shams Hermon Ski resort Highway 99 Expressway 24 km Kiryat Shmona Mas'ade ==100–999== * Route 109 * Route 171 * Route 204 * Route 211 * Route 222 * Route 224 * Route 225 * Route 227 * Route 232 * Route 234 * Route 241 * Route 258 * Route 264 * Route 293 * Route 310 * Route 334 * Route 352 * Route 353 * Route 354 * Route 356 * Route 358 * Route 367 * Route 386 * Route 398 * Route 404 (Number was changed to 50) * Route 406 * Route 410 * Route 411 * Route 412 * Route 417 * Route 423 * Route 436 * Route 437 * Route 431, Freeway * Route 441 * Route 443 * Route 444 * Route 446 * Route 449 * Route 457 * Route 458 * Route 461 * Route 465 * Route 471 Freeway * Route 481 * Route 482 * Route 491 * Route 505 * Route 508 * Route 531, Freeway * Route 541 * Route 551 * Route 553 * Route 554 * Route 557 * Route 574 * Route 578 * Route 581 * Route 584 * Route 585 * Route 650 * Route 651 * Route 652 * Route 653 * Route 654 * Route 667 * Route 669 * Route 672 * Route 675 * Route 716 * Route 717 * Route 721 * Route 752 * Route 762 * Route 767 * Route 768 * Route 772 * Route 780 * Route 781 * Route 784 * Route 789 * Route 804 * Route 805 * Route 806 * Route 807 * Route 808 * Route 854 * Route 859 * Route 864 * Route 866 * Route 869 * Route 886 * Route 888 * Route 899 * Route 918 * Route 959 * Route 977 * Route 978 * Route 999 ==Notes== ==Other websites== *Map of Israel at mapa.co.il *Highways in Israel at Tamir Rental * Israel Highways Highways",
 "title": "List of Israeli highways"
}