{
 "id": "996977",
 "text": "Electra-Afikim is an Israel bus company that operates lines in Ashdod, Yavne, Rosh HaAyin and other locations. ==History== The company was founded in 2008 and is part of Sela Holdings. It began operating on September 1, 2009. In March 2013, the company began operating 'Palestinian only' buses and bus lines for Palestinian workers commuting from the West Bank to jobs in Israel, following complaints from Jewish settlers. Afikim also purchased Connex's activity in Israel in 2013, significantly expanding its operations, and as of November 2014, operated about 145 routes and a fleet of 350 buses, with plans to purchase a further 200 for the Ashdod–Yavne–Tel Aviv sector. In 2015, Afikim won the tender for cluster of Petah Tikva and Rosh HaAyin which includes all intracity service in Petah Tikva and Rosh HaAyin. On May 6 2016, Afikim started to operate the intracity and intercity services in Rosh HaAyin and line 47 from Giv'at Shmuel to Petah Tikva. On February 13 2017, Afikim started to operate line 485 from Jerusalem to Ben Gurion Airport. On 2021 the compeny was renamed Electra-Afikim, after 51% of the sheres of the company were sold to the Electra group. ==Ridership by sector== In 2017, each sector had the following annual ridership: Sector Ridership (in millions) Petah Tikva and Rosh HaAyin internal 21 Ashdod internal 14.7 Ashdod – Yavne – Tel Aviv 10 Samaria 4.9 Jerusalem – Bnei Brak 3 ==Criticism== ===Involvement in Israeli settlements=== On 12 February 2020, the United Nations published a database of 112 companies helping to further Israeli settlement activity in the West Bank, including East Jerusalem, as well as in the occupied Golan Heights. These settlements are considered illegal under international law. Afikim was listed on the database on account of its \"provision of services and utilities supporting the maintenance and existence of settlements, including transport\" in these occupied territories. ==References== Category:Transport companies Category:Transport in Israel",
 "title": "Electra-Afikim"
}