{
 "id": "997057",
 "text": "Modern Hebrew () is the standard form of the Hebrew language spoken today. It is the official language of Israel, where it is used in government, education, and daily life. The roots of Modern Hebrew can be traced back to ancient Hebrew, which was used in the Bible and other religious texts. However, after the destruction of the Second Temple in Jerusalem in 70 CE, Hebrew ceased to be a spoken language and was only used for religious purposes. In the late 19th century, a group of Jewish scholars and writers began working to revive Hebrew as a spoken language. They developed new words and grammatical structures to adapt the language for modern use. Modern Hebrew is spoken today by about 9 millions of people (counting native, fluent and non-fluent speakers), mostly in Israel. == Rivival == Modern Hebrew revival refers to the effort to revive Hebrew as a spoken language. Hebrew was originally a language spoken in ancient times, was not a spoken language later, and was only used for religious purposes. In the late 19th century, a group of Jewish scholars and writers began working to revive Hebrew as a spoken language, in what is known as the Hebrew Language Revival. They developed new words and grammatical structures to adapt the language for modern use. This effort was part of the broader Zionist movement, which aimed to establish a Jewish homeland in Palestine. Through the efforts of these scholars and writers, Hebrew was once again established as a living language, and it is now the official language of Israel. Modern Hebrew has evolved to include modern terminology for fields such as science, technology, and politics, while still retaining its rich literary and religious traditions. ==Classification== Modern Hebrew is classified as an Afroasiatic language of the Semitic family, the Canaanite branch of the North-West semitic subgroup.Weninger, Stefan, Geoffrey Khan, Michael P. Streck, Janet CE Watson, Gábor Takács, Vermondo Brugnatelli, H. Ekkehard Wolff et al. The Semitic Languages. An International Handbook. Berlin–Boston (2011). Modern Hebrew has loanwords from many languages, including Arabic (Levantine dialect and from the Jewish Arab dialects), Aramaic, Yiddish, Judaeo-Spanish (Ladino), German, Polish, Russian and English. ==References== Category:Hebrew language",
 "title": "Modern Hebrew"
}