{
 "id": "997096",
 "text": "Peter Gregory Onwubuasi Obi, commonly known as Peter Obi, is a Nigerian politician and activist who was the former governor of Anambra State and the presidential candidate of the Labour Party in the 2023 general elections in Nigeria. ==Early life== Peter was born on July 19, 1961, and grew up in Onitsha⁣ where he currently lives. Obi was the former governor of Anambra State and in 2022, he became the 2023 Nigerian presidential election nominee of Labour Party. He had his tertiary education at the University of Nigeria in 1984 after his secondary education at Christ the King College, Onitsha. He has worked in different managerial capacities, from Chairman and Director of Guardian Express Mortgage Bank, Guardian Express Bank Plc, Future View Securities Ltd, Paymaster Nigeria Ltd, Chams Nigeria Ltd, Data Corp Ltd and Card Centre Ltd. He was also the youngest chairman of Fidelity Bank Nigeria. ==Political Career== In 2003, Obi went into politics as a member of All Progressive Grand Alliance after his entrepreneurship stage for governor. He won the election in 2006. ==Awards and Recognitions== In 2007, he was named Man of the Year by Sun Newspaper. Two years later, he was awarded the Most Prudent Governor in Nigeria and Governor of the Decade in 2020 by This Day. Obi has won many awards including Champion Newspaper's Nigeria's Most Trustworthy Governor in 2009. Followed by West Africa ICT Development Award for Governor of the Year in 2010. He was one of the Africans for the Bill & Melinda Gates Foundation Best Performing Governor on Immunization in South- East Nigeria in 2012. Obi also won Silverbird Man of the Year in 2013. ==Personal life== Obi is married to Margaret Brownson Obi. ==Reference== ==Other websites== * Peter Obi Profile on African Confidential * Peter Obi and a Dream Deferred Council on Foreign Relations Category:Nigerian politicians Category:People from Anambra State Category:1961 births Category:Living people",
 "title": "Peter Obi"
}