{
 "id": "997087",
 "text": "Rajshahi College is a prestigious educational institution located in the city of Rajshahi, Bangladesh. It was established in 1873 and is one of the oldest and largest colleges in the country. The college is affiliated with the National University of Bangladesh and offers undergraduate and graduate degree programs in various fields of study. ==History== Rajshahi College was founded during the British colonial period in 1873. The college was initially named as Rajshahi Collegiate School and was converted into a college in 1881. The college was established to provide higher education to the people of Rajshahi and its surrounding areas. The college played a significant role in the socio- cultural and political movements of East Bengal and the Indian subcontinent. ==Academics== Rajshahi College offers undergraduate and graduate degree programs in various fields of study, including arts, science, commerce, and social sciences. The college has several academic departments, including Bengali, English, history, philosophy, economics, physics, chemistry, mathematics, zoology, botany, and computer science. The college has highly qualified and experienced faculty members who are dedicated to providing quality education to students. ==Facilities== Rajshahi College has a large and beautiful campus with modern facilities. The college has several academic buildings, a central library, computer labs, science labs, a gymnasium, an auditorium, and sports facilities. The college also has a student dormitory and a canteen that serves delicious and affordable food to the students. ==Extracurricular activities== Rajshahi College encourages students to participate in extracurricular activities to develop their skills and talents. The college has several student organizations, including debating clubs, cultural clubs, sports clubs, and social service clubs. The college also organizes several events and programs throughout the year, including annual sports days, cultural events, and seminars. ==Notable alumni== Rajshahi College has produced many notable alumni who have made significant contributions to the country and the world. Some of the notable alumni of the college: Akshay Kumar Maitreya, Jadunath Sarkar, Qazi Motahar Hossain and Pramathanath Bishi etc. ==References== Category:Colleges and universities in Bangladesh Category:Rajshahi Division",
 "title": "Rajshahi College"
}