{
 "id": "997047",
 "text": "Shelly Oberoi is an Indian politician and the current mayor of North Delhi Municipal Corporation. She was elected to the position in May 2022, becoming the first-time councillor of the Aam Aadmi Party (AAP) to hold the position.AAP’s First-time Councillor Who Won from BJP Stronghold: Who is Delhi’s New Mayor Shelly Oberoi?: AAP’s First-time Councillor Who Won from BJP Stronghold: Who is Delhi’s New Mayor Shelly Oberoi?, accessdate: February 23, 2023 ==Early life== Oberoi was born in Delhi and completed her schooling from Delhi Public School, R.K. Puram. She went on to obtain a degree in Commerce from the University of Delhi. Prior to entering politics, Oberoi worked as a businesswoman and entrepreneur.Hindustan Times: AAP's Shelly Oberoi is new Delhi mayor, Aaley Mohammed Iqbal her deputy | Latest News Delhi - Hindustan Times, accessdate: February 23, 2023 ==Political career== In 2017, Oberoi joined the AAP and contested the municipal elections from the Model Town ward in North Delhi. Despite facing a tough challenge from the Bharatiya Janata Party (BJP), she emerged victorious, becoming the first-ever AAP councillor from the area. As a councillor, Oberoi focused on improving civic amenities in her ward, including better sanitation, road repairs, and street lighting. She also worked to improve the quality of education and healthcare facilities in her area. ==Mayor election== In 2022, Oberoi was chosen as the AAP's candidate for the mayoral elections in North Delhi. Despite facing tough competition from the BJP, she won the election with a comfortable margin, becoming the first-ever AAP mayor of North Delhi. As mayor, Oberoi has prioritized the implementation of various welfare schemes for the citizens of North Delhi. She has also emphasized the need for greater cooperation between the state government and the municipal corporation to improve the quality of civic amenities in the area. Oberoi's rise to the position of mayor has been seen as a testament to the growing influence of the AAP in Delhi's political landscape. Her focus on improving the quality of life for citizens and commitment to inclusive governance has earned her widespread support and admiration. ==Reference== Category:Living people Category:Politicians from New Delhi Category:1983 births",
 "title": "Shelly Oberoi"
}