{
 "id": "997077",
 "text": "Kaus Mia was a Bangladeshi businessman who gained national attention for his exceptional commitment to paying taxes. Born in 1931, he started his career as a small grocer at the age of 19, before moving on to the tobacco industry. ==Recognition== Mia first gained public recognition in 2021, when he was named the best taxpayer of the Mujib Year, which marked the birth centenary of Sheikh Mujibur Rahman, the founding father of Bangladesh. The award was presented to him by the National Board of Revenue (NBR) in recognition of his exemplary record of tax compliance and contribution to the country's economic development. ==Life story== Mia's success story is all the more remarkable given his humble beginnings. As a young man, he started his own small grocery store in his hometown of Khulna, in the southwest of Bangladesh. Later on, he entered the chewing tobacco industry and founded his own company, Kaus Tobacco Industries, which has become a leading player in the sector. Despite his success, Mia has never shied away from his tax obligations. He has consistently paid his taxes on time and in full, earning him a reputation as a model citizen and a responsible business owner. Mia's commitment to tax compliance has not gone unnoticed. In addition to being named the best taxpayer of the Mujib Year, he has also been recognized by the NBR as a top taxpayer in previous years. His example has inspired many others to follow in his footsteps, and he has become a role model for aspiring entrepreneurs and responsible citizens across Bangladesh. Kaus Mia died on 25 June 2024 due to diseases of old age. ==Achievements== In recognition of his achievements, Mia has received numerous awards and accolades from various organizations, including the Federation of Bangladesh Chambers of Commerce and Industry (FBCCI) and the Bangladesh Chewing Tobacco Manufacturers Association (BCTMA). However, he remains humble and focused on his goals, stating that his ultimate aim is to contribute to the development of his country and make a positive impact on society. ==References== Category:Living people Category:Bangladeshi businesspeople Category:1931 births Category:People from Khulna Division",
 "title": "Kaus Mia"
}