{
 "id": "997296",
 "text": "William Shakespeare, considered the greatest English writer of all times, was born in 1564 in Stratford-upon-Avon, and was the third of eight children. He went to a good grammar school and studied Latin and Classics. That influenced him as well as his latter works. Thanks to his education, Shakespeare learnt certain tools to work with and develop his talent. He married Anne Hathaway at the age of 18 and had three children. He died on the 23rd of April of 1616, and he is considered to belong to the Elizabethan Era - the period in English history under the reign of Queen Elizabeth I, during the Tudor Period (1485-1603). This period of time is considered to be the golden age in English History due to the prosperity England underwent as well as the development of the arts. It is characterized by political, religious and social peace and marked by the flourishing of the Renaissance and, therefore, literature and intellectual progress. It is an era of patriotism and nationalism, as well as religious tolerance. In words of W. H. Hudson: \"Such were some of the conditions which combined to create the spirit of Shakespeare’s age – An age in which men lived intensely, thought intensely and wrote intensely.” He wrote his first plays around 1592 and covered the topics of tragedy, comedy and history. A couple of years later he was already affiliated with different theater companies in London and in the year 1599 he and others established the Globe theater. == General Influence == As he is one of the most renowned authors of universal literature, and considered the father of English literature, he is an iconic cultural figure. But he is as iconic in popular culture, as well. Nowadays his figure and his legacy of works remain present in media or entertainment. Shakespeare popularized phrases and expressions that today can be seen or heard; or even give title to modern works (To Be or Not To Be, 1942; North by Northwest, 1959). Shakespeare was one of the key elements of the final development and establishment of Early Modern English, along with other factors like the printing industry in London, and A Table Alphabetical, the first English dictionary. This happened by the late 16th century and the early 17th. He also influenced other writers (for example, Lord Byron); and these writers influenced later to others. So the influence of Shakespeare has been reminiscent through the years. Regarding the English language, he introduced several new idiomatic expressions and words, as mentioned before. Some of them are still used nowadays. It is calculated that Shakespeare created around 1700 new words (for example: \"deafening\", \"hush\", \"hurry\", \"downstairs\", \"gloomy\", \"lonely\", \"alone\", \"dawn\"). Apart from creating brand new words, he also created words in many ways: changing nouns into verbs, changing verbs into adjectives, connecting words that had never been used together before, etc. He also added prefixes and suffixes to many words. He was influenced by Latin and French to create new words. == Vocabulary == === Grammatical Conversions === The lack of grammatical rules during Shakespeare’s time and the flexibility of the language made it possible for him to coin new terms and influence the development of the English language. The disappearance of inflectional endings is one of the things that made grammatical conversions (using a word class with a new function) grow. Shakespeare used this procedure, especially to turn nouns into verbs: “The wild disguise has almost anticked us all.” (to make a fool of); “Grace me no grace, nor uncle me no uncle…”. The Old English “thou” and “ye” (singular and plural respectively) were slowly substituted by Early Modern English “you”, as the difference between subject “ye” and object “you” had disappeared. By Shakespeare’s time, in the singular, it was also an alternative to “thou” and “thee” and was used as a formal way to refer to someone. Moreover, “thou” and “thee” were used by people of higher rank to refer to the ones who were above them. “Thou” could also be used if a lower rank person wanted to refer to someone of higher rank with the purpose of disrespecting them, and Shakespeare made the most of it. For instance, he used to express that its use can be seen as a challenge: “If thou thou’st him somethrice, it shall not be amiss” (Twelfth Night) === Idiomatic Expressions === Shakespeare’s vocabulary is estimated to have included about 24000 words, even probably 28000. Thus, the great popularity of his works led to the introduction of new words and idioms into the English language, many of which are still present in ordinary life today. Some examples of words that became known for his works are the following: eyeball, barefaced, fashionable, accommodation, apostrophe, bloody, critic, dislocate, exposure, generous, hurry, impartial, lonely, monumental, obscene, pious and suspicious, among many others. In “Romeo and Juliet”, he introduced the words ladybird and uncomfortable. Ladybird is said by the Nurse at the beginning of the third scene in “Romeo and Juliet”, and uncomfortable by Capulet in Scene 5. As a further example, the word outbreak appears in “Hamlet”, in Act 2, Scene 1. In both of these works he included new idiomatic expressions as well, by combining common words into a new semantic unit and adding a figurative sense to the resulting whole. “Hamlet” contains the expressions my own flesh and blood, meaning “a relative of mine”, and in my heart of hearts, “deep within myself”; while the idiom wild-goose chase, meaning “a search that turned out to be a waste of time”, has been taken from “Romeo and Juliet”. Shakespeare also introduced words that were then adapted to a different form. The present idiomatic expression “all that glitters is not gold” was originally “all that glistens is not gold”, included in The Merchant of Venice, Act 2, Scene 7. The meaning of this idiom is that things are not always as good as they appear to be. == Critics == Estimates suggest that Shakespeare invented approximately 1700 words. However, some academics argue that the real number might be lower. It is possible that many of these words had been in common use for years and Shakespeare was simply the first person that wrote them down. Many written texts from Shakespeare’s period did not survive the years, so even if other people wrote them down, they might no longer exist. Without written records, it is almost impossible to say who used the phrase first. Many words that have been attributed to Shakespeare are simply modern modifications that can be traced back to older forms. Other academics argue that the Oxford English Dictionary has been favouring Shakespeare when it comes to inventing new words. According to Jonathan Hope \"the Victorian scholars who read texts for the first edition of the OED paid special attention to Shakespeare: [H]is texts were read more thoroughly, and cited more often, so he is often credited with the first use of words.\" For example, some of the commonly used phrases that are incorrectly attributed to Shakespeare are: all that glisters is not gold, laughing stock, out of the question, the naked truth etc. == References == Category:English language Category:William Shakespeare",
 "title": "Influence of William Shakespeare on the English language"
}