{
 "id": "997268",
 "text": "The 11 from La Masia is a historic football match played at the City of Valencia Stadium on 25 November 2012 in which FC Barcelona fielded at the same time eleven players nurtured in their own La Masia talent development facility. The team faced Levante UD in the twelfth round of La Liga and won the match 0-4. The 11 players brought up at La Masia included Víctor Valdés, Martin Montoya, Gerard Piqué, Carles Puyol, Jordi Alba, Sergio Busquets, Xavi, Cesc Fàbregas, Andres Iniesta, Pedro Rodríguez and Lionel Messi. The match was a milestone in FC Barcelona's history as it was the first time a team fielded at the same time eleven players nurtured in the club's talent development facility in an official match. La Masia has been a fundamental part of FC Barcelona's football culture and has produced many world-class players, such as Lionel Messi, Xavi, Andrés Iniesta and Sergio Busquets. The 11 from La Masia are an example of FC Barcelona's commitment to developing young talent and their unique style of play based on ball control and possession. The match has been remembered as a historic event in the club's long tradition and as a tribute to the players who have been brought up at La Masia. == Antecedents == FC Barcelona is a football club based in Barcelona, Catalonia, Spain, founded in 1899. The club is known for its successful history and its characteristic style of play based on ball control and short passing. One of the club's success factors is its La Masia youth academy, which has produced many of the world's best players. On November 25, 2012, FC Barcelona moved to Valence to face Levante UD in a league match in La Liga. This was an important match for the club, which had already established itself as one of the top clubs in the world. Ahead of the match, FC Barcelona coach Tito Vilanova fielded ten players who had trained and developed at the club's La Masia youth academy. Only player to not train with La Masia youth academy was right back Dani Alves. But, after he got injured in 15th minute, he was replaced by Martin Montoya, thus completing the historic line-up. This was the first time in FC Barcelona's history that the club used all eleven academy players in an official match. The XI consisted of goalkeeper Víctor Valdés, defenders Martin Montoya, Gerard Piqué, Carles Puyol and Jordi Alba, midfielders Sergio Busquets, Xavi and Cesc Fàbregas, and forwards Andres Iniesta, Pedro Rodríguez and Lionel Messi. The match, which was also called \"Los 11 de La Masia\", became a historic event for FC Barcelona and its youth academy. This is proof of the club's successful work in developing and promoting young talent. The club's ability to cultivate youth academy talent is vital to its success and to maintaining its identity as a club that plays a beautiful and attractive game of football. == Chronicle == == Players == Portfolio: Víctor Valdés Defence: Martin Montoya, Gerard Piqué, Carles Puyol, Jordi Alba Midfield: Sergio Busquets, Xavi, Cesc Fàbregas Strikers: Pedro Rodríguez, Lionel Messi and Andrés Iniesta. Levante UD: Portfolio: Gustavo Munúa Defense: Pedro López, Sergio Ballesteros, David Navarro, Juanfran García Midfield: Iborra, Michel, Rubén García, Juanlu Gómez, Vicente Iborra Striker: José Javier Barkero. == Reaction and meaning == After the match between \"The 11 from La Masia\" and Levante UD on 25 November 2012, the press praised the performance of FC Barcelona and especially their youth academy, La Masia. This was the first time in the club's history that an entire starting eleven consisted of own products, which was a big step forward for the club's philosophy and youth activities. Sports journalists particularly praised Lionel Messi's performance on the pitch, where he showed his class and skill by creating several scoring chances and scoring a goal himself. Midfielder Cesc Fàbregas was also praised for his goal and his contributing role in the game. Several football experts also commented on how important it is for clubs to have a strong youth operation, stressing that Barcelona's success was not only due to individual performances, but to the club's long-term philosophy. Both coach Tito Vilanova and the players were humbled by the victory and stressed the importance of continuing to work hard and improve the team. This was an important victory for FC Barcelona and proof that their youth operation was one of the best in the world. After the match, fans showed their support and love for the club through social media and other platforms. This was an important day in Barcelona's history and a testament to their strength as a club and as a team. == Aftermath == The match \"The 11 from La Masia\" was one of the most significant matches in the history of FC Barcelona. Not only did the club present a starting eleven made up of players developed in the club's youth academy, but also showed that these players were fully capable of playing at the highest level of professional football. The match marked the beginning of an era where La Masia-produced players became the core of Barcelona's dominance of Spanish and European football. In the following years, players such as Sergi Roberto, Marc Bartra and Rafinha Alcántara became important members of the first team. By successfully integrating the youth academy with the first team, FC Barcelona has created a model for club development that has inspired other football clubs around the world. The 11 from La Masia will always be a reminder of Barcelona's pride in its academic tradition and the club's ability to produce some of the best footballers in the world. === 10-year anniversary === In 2022, FC Barcelona held a tribute event to celebrate the 10th anniversary of \"The 11 from La Masia\". During the event, highlights from the match were shown and former players and coaches were interviewed about their memories of the historic event. Players who took part in the match were also invited to celebrate the anniversary and meet the fans. As well as paying tribute to the match and the players who took part in it, the club also used the occasion to emphasize the importance of their youth academy and their commitment to training young talent. The event also showed how players who debuted at the club as youngsters still play an important role in today's teams and how their success has inspired other young players to follow in their footsteps. == References == Category:FC Barcelona Category:La Liga",
 "title": "The 11 from La Masia"
}