{
 "id": "997311",
 "text": "John William Cheever (May 27, 1912 – June 18, 1982) was an American short story writer and novelist. He was born in 1912 in Quincy, Massachusetts. His family had money trouble when he was a teenager. His mother ran a gift shop. He had to leave Thayer Academy because he had bad grades. He wrote a short story about this. It was printed in the New Republic when he was 18. Cheever did not go to college. He had jobs in a department store and at a newspaper. He moved to New York City in 1934. The writer Malcolm Cowley, whom he met through the New Republic, told him to write lots of stories, and he did. Two were printed in The New Yorker. He met Mary Winternitz in 1939, and they married in 1941. After the Pearl Harbor attack, he joined the U. S. Army. He worked for the Signal Corps propaganda unit in New York. While he was in the army, in 1943, his first book was published. It was a short story collection, The Way Some People Live. In 1951 Cheever moved with his wife, daughter, and son to Westchester County outside of New York City. Another son was born in 1957. Cheever's good work at writing was noticed during his life. He got Guggenheim Fellowships in 1951 and 1960. Stories he wrote won Benjamin Franklin and O. Henry awards. He was elected to the National Institute of Arts and Letters in 1957. His first novel, The Wapshot Chronicle won the National Book Award in 1958. The Wapshot Scandal of 1964 won the Howells Medal as the best work of fiction to be published between 1960–1965. The Stories of John Cheever won both the Pulitzer Prize for Fiction and the National Book Critics Circle Award in 1979. He was given the National Medal for Literature in 1982, two months before he died from cancer. After his death, many memoirs, journals and other writings talked about Cheever's bisexuality, his marriage troubles and alcoholism. == Works == === Novels === * The Wapshot Chronicle (1957) * The Wapshot Scandal (1964) * Bullet Park (1969) * Falconer (1977) * Oh What a Paradise It Seems (1982) === Short story collections === * The Way Some People Live (1943) * The Enormous Radio and Other Stories (1953) * The Housebreaker of Shady Hill and Other Stories (1958) * Some People, Places, and Things That Will Not Appear in My Next Novel (1961) * The Brigadier and the Golf Widow (1964) * The World of Apples (1973) * The Stories of John Cheever (1978) *Thirteen Uncollected Stories by John Cheever (1994) === Collections === * The Letters of John Cheever, edited by Benjamin Cheever (1988) * The Journals of John Cheever (1991) * Collected Stories & Other Writings (Library of America) (2009) * Complete Novels (Library of America) (2009) == References == Category:1912 births Category:1982 deaths Category:American novelists Category:American short story writers",
 "title": "John Cheever"
}