{
 "id": "997560",
 "text": "The San Francisco Renaissance is a name for the work of a group of poets in San Francisco in the 1950s and '60s. This poetry made San Francisco famous in the 1950s as a place where new writing was happening. The \"renaissance,\" or \"re-birth,\" was not one thing. It describes the coming together of many different groups and individuals. A poetry reading at the Six Gallery on October 13, 1955 was the first public event. It was organized by older poet Kenneth Rexroth. During this reading, five poets—Allen Ginsberg, Philip Lamantia, Michael McClure, Gary Snyder, and Philip Whalen—read their work. The most exciting was Ginsberg's reading of his long poem \"Howl\". This is called the beginning of Beat poetry. But other kinds of poetry—like those connected to the Black Mountain School—were also part of the San Francisco Renaissance. Other poets who are part of the Renaissance are Robert Duncan, Robert Creeley, Jack Spicer, Joanne Kyger, Robin Blaser, and William Everson. After the 1960s, the Renaissance continued in the poetry of Robert Hass, Robert Pinsky, Denise Levertov, Lorna Dee Cervantes, Victor Hernández, Ron Silliman, Leslie Scalapino, and Lyn Hejinian. ==Sources== ===Print=== *Allen, Donald M., ed. The New American Poetry: 1945-1960 (1960, 1999) *Ellingham, Lewis & Killian, Kevin. Poet Be Like God: Jack Spicer and the San Francisco Renaissance (1998) *French, Warren G. \"The San Francisco Poetry Renaissance 1955-1960\" (1991) *Davidson, Michael. The San Francisco Renaissance: Poetics and Community at Mid-Century (1989). *Kerouac, Jack The Dharma Bums (1958) *Snyder, Gary The Real Work: Interviews & Talks 1964-1979 (1980) *Spicer, Jack The Collected Books of Jack Spicer. Edited and with commentary by Robin Blaser (1975) *Watts, Alan W. \"Breakthrough\" (chapter) in In My Own Way (1972) ===Recordings and sound-files=== *Howls, Raps & Roars: Recordings from the San Francisco poetry renaissance (compilation) (Universal Music Group, 1963; Fantasy Records 1993) ==References== ==Other websites== *The Beats and the San Francisco Renaissance Captured April 25, 2005. *City Lights History Category:Poetry Category:San Francisco",
 "title": "San Francisco Renaissance"
}