{
 "id": "997696",
 "text": "The 2022 Nigeria floods affected many parts of the country. From the Federal Government Data, the floods rendered over 1.4 million people homeless, killed over 603 people, and injured more than 2,400 persons. About 82,035 houses had been damaged, and 332,327 hectares of land had also been affected. While Nigeria frequently experiences seasonal flooding, this flood was the worst in the country since the 2012 Nigeria flood. As of October, over 200,000 homes were completely or partially destroyed by the floods. On 7 October, a boat carrying people fleeing the floods from Ogbaru capsized on the Niger River, causing 76 deaths. The flooding was caused by heavy rainfall, climate change, as well as the release of water from the Lagdo Dam in neighbouring Cameroon, which began on 13 September. Flooding, which affected Nigeria, Niger, Chad, and the surrounding region, began in the early summer of 2022 and ended in October. == Causes == The Nigerian government has blamed the floods of 2022 on unusually heavy rains and climate change. United Nations Humanitarian Coordinator for Nigeria Matthias Schmale said that the flooding could be largely explained by climate change. Climate change in Nigeria has been responsible for flooding, droughts, decreased air quality and the loss of habitat. A climate modeling study by the World Weather Attribution project estimated that the floods were rendered far more likely and much more intense by climate change. They modeled the June to September rainfall in the Lake Chad and lower Niger river catchment areas, looking at total rainfall and intense rain weeks. Flooding increased on 13 September with the perennial release of water from the Lagdo Dam in neighbouring Cameroon. Excess water released from the dam cascades down River Benue and its tributaries, flooding communities in the states of Kogi, Benue, and other states in the northeast. When Lagdo Dam was constructed in 1982, there was an agreement by Nigerian authorities to build a second, twin dam in Adamawa State to contain the overflows. Known as the Dasin Hausa Dam project, it was to be situated in Dasin Village of the Fufore local government area, but was never built by the Nigerian government. Nigerian Minister of Humanitarian Affairs, Disaster Management & Social Development Sadiya Umar Farouq said that \"there was enough warning and information about the 2022 flood\" she blamed local governments, states, and communities for not acting promptly despite the warnings. The indiscriminate construction on natural flood plains and storm water paths together with poor drainage systems in many residential areas clog channels with waste. Lax enforcement of environmental laws has only exacerbated problems even further. ==References== Category:2022 in Nigeria Category:2022 floods",
 "title": "2022 Nigeria floods"
}