{
 "id": "997699",
 "text": "Os Renovadores (the Renewers) or Os Novos (New ones) was a diverse group who wanted to renew visual Galician arts from the 1920s. == Artists == Maside, Souto, Colmeiro, Seoane, Eiroa, Mazas, Torres and Laxeiro are considered members of Os Novos; Jose Frau is sometimes named; Virxilio Blanco, who went young to Cuba, is also included. For their influence, Castelao, Camilo Díaz and Asorey are considered part of the group. Some others were the surrealists Granell, Mallo and Urbano Lugris, and, later, Maria Antonia Dans, Elena Gago, Angel Johan, Colombo, Cebreiro, Pesqueira, Concheiro and Bonome. Isaac Díaz Pardo, son of Camilo Díaz, continued the legacy of his family and renewed the forms of design and ceramics. == The precursors == In Séculos Escuros age there were efforts to preserve the dignity of Arts (Compostelan Baroque), Science and Education (by Sarmiento and Benito J. Feijoo), and Literature. In the 19th century, there was a resurgence (Rexurdimento) in poetry.Etnicidade e nacionalismo. GONZÁLEZ REBOREDO, Xosé In painting, there is an affinity for romantic and post-impressionist landscapes influenced by Cézanne. Some Galicians, like Valle-Inclán, accused the artistic primacy of the Madrid- Valencia axis inside Iberian Peninsule. Some promising artists died young and were called the 'Sick Generation'.\"“Xeración doente”: Ovidio Murguía, Joaquín Vaamonde, Ramón Parada Justel e Jenaro Carrero\" no Museo Provincial de Pontevedra. === Precursor's gallery of images === == The avant-garde == In Europe, the vanguards grew up. Some Spaniards (mostly Catalans as Miró or Dalí) went to France. In the 1920s, 'Group Nós' wanted to link Galician culture to Europe, and 'Xeración do 25' emerged ( literature renovators). Artists born in the 1900s and 1910s don't break with olders, such as Baliño, Castelao or Asorey, and they try to renew art tradition. Writers and designers gather around El Pueblo Gallego, which published both in Spanish and Galician. In 1921, Santiago Ramón y Cajal gave Castelao a scholarship to learn about the avant-garde. For him, art must be universal and linked to the 'mother culture'. When he knew Central European art, he made some offensive comments about Picasso, who after his training in Galicia and Catalonia was creating Cubism in Paris. Castelao prefered the Russian new art because it was \"linked to the people\". Later, he published an essay saying that the vanguards could be \"crazy, but not silly\", and he wrote to the poet Manuel Antonio about old and new art roots. He spent one year traveling and he wrote in his diary: > Spanish people think that, to be universal, national artist (of the Galician > nation) are asked to 'kill the regional spirit' and be Spanish (...) if you > realize that art has no borders, it means that it is cosmopolitan. Why don't > you ask us to 'kill the Spanish spirit'? (...) if Spanish art can come out > of Spain, so can Galician, Basque and Catalan art. Carlos Maside traveled a lot. His work was shown in the US by the Carnegie Institute, along with Mallo and Souto. In Paris, he saw Gaugin and Van Gogh art. It influenced his work beyond Cubism, Magic realism, Expressionism and the Bauhaus professor Kandinsky. Maside made graphic works for the Autonomy campaign, collaborated with Seminar on Galician Studies, and suggested an Art Library in Santiago. He stayed in inner exile and made friends with younger artists like Laxeiro and his nephew Xulio. Manuel Colmeiro was another artist who traveled a lot. After the war, he went into exile in Argentina, where he created murals in Galerías Pacífico. In exile, he interacted with artists like Seoane, Dieste, and Alberti. He moved to Paris in 1949 and in 1989 he returned to Galicia. In the 60s, he had exhibitions in London and won several awards in the 80s. He died in Salvaterra de Minho in 1999 at the age of 98. His daughter Elena Colmeiro was also an artist, specializing in sculpture and ceramics. Seoane talked to Freixanes about the concerns of students in Compostela during the first part of 20th century: > \"Simplicismus\" interested a lot, within the \"art nouveau\". The European > artistic and intellectual center began to move from Paris to Berlin both in > painting and the visual arts as well as in philosophical and political > thought (...) Austria was also very present, Paul Klee, Grosz... All of > this, although it may seem curious, it was known in the restless Galicia of > those years. === Sculpture === Asorey, born in 1889, made figurative art, but with new themes and expressionist texture. He wasn't as iconoclast and abstract as the avant-garde, but he caused controversies. He sculpted a Virgin with a host on her chest for A Estrada and the priest didn't want it. That iconography was also used by Díaz in his posters for the Statute of Autonomy of Galicia, with the coat of arms of the Kingdom of Galicia (today official of the Autonomy). The war took him many friends, but he continued in internal exile. This led to some oblivion later, according to his family. Asorey made monuments to great figures of culture, such as the Enlightenment philosopher Benito J. Feijoo, the writer Curros Enríquez or the astronomer from Lalín, Pontevedra, Ramón Mª Aller. In 2019, Asorey's sculpture \"A Santa\" returned to Galicia for an exhibition, after 70 years in Montevideo. The sculpture, created in 1926, received criticism from the Queen of Spain for breaking political correctness at the time. However, Asorey later stated in a press interview in 1956 that this was the work he was most satisfied with. === Between tradition and renewal === The movement in Galicia was less disruptive than other vanguards. They valued tradition and they were also very cosmopolitan, and the work of other people was fundamental to that movement, from Nós generation to scientists of the Seminary of Galician Studies, archaeologists, etc. Enrique Campo with only four years of work but very intense, practiced with new fields of drawing, archeology and scientific illustration. === The surrealists === Some of the Renovators were influenced by surrealism, like vivarian painter Maruxa Mallo, who had strong ties with surrealists such as Bretón, Lorca and Buñuel. She was far from his homeland, but the Galician sea was included as a theme in her work. During the fascist uprising, Mallo was in Vigo and managed to escape to Portugal. With the help of Gabriela Mistral, Chilean ambassador in Lisbon, could travel to Americas, where she was in touch with Seoane. Other artists marked by the war were Francisco Miguel, killed in 1936; he worked with Siqueiros and illustrated works by Borges and Mistral. The painter Urbano Lugrís, son of Lugrís Freire, an intelectual contrary to Franco, was forced to take the side of fascism, like other artists. He also worked on set designs and architecture, such as the Surrealist chapel of Magi, in Bueu. === Scenography and Theater === In the 1920s, members of Irmandades were involved in theater and founded Escola Dramática Galega, with notable playwrights such as Cotarelo Valledor and Vicente Risco. Noriega Varela and Cabanillas bridged the gap between 19th century and the avant-gardes. Cabanillas assimilates the poetry of Curros, Rosalía de Castro and Pondal, also taking modernist elements. Rafael Dieste was the most prominent author in the Generation of 25, and the scenography was diverse, with surrealist and symbolist elements. Lorca founded La Barraca in the early 1930s where Lugrís and Ernesto G. da Cal participated in the scenography. Lorca wrote Six poems in Galician in 1935 as a result of his friendship with them. === The graphic humor === Galician humor and satire have a long tradition, from sneering medieval poems to modern-day comics (the first Galician comic strips are published in 1888 and in the first decades of XX drawing was analysis tool in the key of socio-political criticism or charge). Authors like Risco and Otero Pedrayo, who portrayed Diego Gelmires as a comedian, used satire to comment on Galician society. Pioneers of puppetry like Barriga Verde reflected with humor the quarrels between Galicians and Portuguese, as Gabriel Feijóo had done centuries before. Artists like Maside and Díaz drew inspiration from illustrations and caricatures of Central European humor. Castelao and Luis Bagaría (although Catalan by birth, he was a close friend of a lot of Galician artists) were two of the most influential graphic humorists in Galicia, and Vázquez Díaz combined classic portraits in sculpture with satire in his penguin, closely linked to surrealism, for which he suffered censorship. == Legacy == The renewal of art influenced the next generation of Galician artists, called by some Segundos Renovadores. The exiles participated in drawing, painting, murals, architecture, typography and ceramics. Artists such as Seoane, the Granell brothers, Mallo and others found a great echo in the internal exile. Bello Piñeiro, promoter of the Sargadelos pottery, founded upon their return to Galicia by Luis and Maruxa Seoane and Díaz Pardo among others. === The typography === The renovators created fonts and recovered traditional typography in stone, continued by Laboratorio de Formas. Recent creators have made fonts based on them, like Vila Morena (Ipanema Graf) and Gallaecia Castelo (Carlos Núñez). Marcos Dopico and Natalia Crecente from the University of Vigo analyzed their typographic program. They combined traditional fonts from different origins with the systematization of Bauhaus and Ulm schools, and according to Díaz Pardo, the Soviet Vkhutemas. > Graphic work was developed in a local environment, linked to areas close to > the art, artisanal manufacturing, stonework or illustration (...) Several > sources would be used; rock carving, inscriptions on church arches, > petroglyphs (...) bread sculptures from St. Andre de Teixido, traditional > ceramics, lace from the Coast... in short, all the heritage elements of > Galician culture. The principles of modernity, with one eye on the Bauhaus > and the Ulm school and the other on the geographical and cultural context, > avoiding any standardization, evolved here to \"enrich the world with our > difference\", an ideology applied to all the products they come out of the > Laboratory of Shapes. On fabric research, Luís Seoane and Maria. E. Montero: === Buildings in Galicia with Renovadores' work === ==Notes== == References == == Notes ↑ ↑ == * ↑ == Bibliography == * Quatro renovadores da arte galega. Souto. Colmeiro. Laxeiro. Seoane (1993). Consorcio da Cidade de Santiago de Compostela. ISBN 84-88484-09-7. == Other websites == * https://linz.march.es/Documento.asp? Reg=r-41515 Chronicle by Freixanes on the influence of the avant-garde in Castelão and Galicia. * A tour over 30 murals by Seoane in Buenos Aires. https://www.clarin.com/revista-enie/cartografia-oculta-luis- seoane_0_lu8nvw5Eq.html Category:Art Category:Galicia",
 "title": "Os renovadores"
}