{
 "id": "997697",
 "text": "Natural disasters in Nigeria can be referred to as an event in Nigeria leading to the loss of lives and properties as a result of climate change in the country. Natural disasters of a place can be caused by flooding, erosion, insect infestation, etc.https://www.humanitarianlibrary.org/sites/default/files/2013/08/3speaker03_1.pdf There have been several forms of disasters related to climate change in Nigeria, some of which are flooding, soil and coastal erosion, landslides, tidal waves, coastal erosion, sand-storms, oil spillage, locust/insect infestations, and other man-made disasters. It can be said that the country's under-protected and expansive environment contributed to making the people especially vulnerable to these disasters. Other dangers include northern dust storms, which are usually from northern states to southern states; causing damages through large deposits of dust and dirt from these regions. Hail (Small ice pellets or sleet That is mostly translucent, e.g Snow) is another cause, which rarely occurs in some parts of Nigeria, leading to damage to crops and properties. ==Types of Natural disasters in Nigeria== This section explains different kinds of disasters that had happened in Nigeria to date. ===Drought=== There was a drought in 1972 and 1973 that lead to the death of about 13% of animals in the northeastern part of Nigeria and also an annual agricultural yield loss of about 50%. The rainfall trend between 1960 and 1990 in northeast Nigeria steadily declined by about 8 mm/year. Nigeria's most recent drought was between 1991 to 1995https://knowledge.unccd.int/sites/default/files/country_profile_documents/1%2520FINAL_NDP_Nigeria.pdf Flood Constant events of flooding in different parts of Nigeria had led to socioeconomic damage, injury, and loss of life. ===2022 Nigeria floods=== The 2022 Nigeria floods affected many parts of the country. Data collected From the Federal Government shows that floods had displaced over 1.4 million people, killed over 603 people, and injured more than 2,400 people. About 82,035 houses had been damaged, and 332,327 hectares of land was also been affected. ===2021=== According to Adamawa State Emergency Management Agency (ADSEMA) On the 11th and 12th of August, two days of uninterrupted rainfall happened in the State, which caused flooding that affected 66 houses and destroyed about 150 farmlands in Lababiri Village in Adamawa State. The incident which also affected 79 communities in 16 Local Government Areas, killed about 7 people and left 74,713 people homeless in the same state. ==Reference== Category:climate change Category:Nigeria",
 "title": "Natural disasters in Nigeria"
}