{
 "id": "997798",
 "text": "Full Circle is a hip hop music group. They have people from Prime Boys and Halal Gang in it. This includes Jimmy Prime, SAFE, Jay Whiss, Puffy L'z, Donnie and Smoke Dawg (before he died). Smoke Dawg's younger brother Young Smoke joined the group in 2020. ==Background== The group was made in 2015 because the people in it were good friends and used to make songs together under their solo names a lot but decided to come together to perform under the \"Full Circle\" group name. They released the song \"Full-Circle\" named after the groups name in 2016 and was produced by Boi-1da. The group released the songs \"Income\" and \"El Chapo\" in 2016 too. Full Circle member Smoke Dawg was shot dead in 2018. Their manager Kosi Modekwe was also killed. ==Discography== ===Singles=== List of singles Title Year Album \"Income\" 2016 rowspan=\"3\" \"El Chapo\" \"Full Circle\" \"The World is Yours\" 2019 NorthernSound List of singles as a collective Title Year Performer(s) Album \"Time Flies\" 2016 Jay Whiss featuring Jimmy Prime and Smoke Dawg rowspan=\"5\" \"Driven\" Jay Whiss featuring SAFE \"Feeling Great\" 2017 Donnie featuring Puffy L'z \"Been Through\" Donnie featuring SAFE and Puffy L'z \"Humana\" Jimmy Prime featuring Donnie and Smoke Dawg \"Feeling Great\" 2018 Smoke Dawg featuring Jimmy Prime and SAFE Struggle Before Glory \"Down\" Smoke Dawg featuring Jay Whiss and SAFE \"These Games\" Smoke Dawg featuring SAFE & Jay Whiss \"Good as it Gets\" 2019 Donnie featuring Jimmy Prime and Smoke Dawg From the Beginning to the End \"Attic\" Donnie featuring SAFE \"Boring\" Puffy L'z featuring Smoke Dawg and Jay Whiss Take No L'z \"Every Night\" Jay Whiss featuring SAFE Dark Cloud EP \"Valet\" Jay Whiss featuring Puffy L'z Peace of Mind \"Diamonds Dripping\" 2020 Smoke Dawg featuring Jay Whiss and Young Smoke Struggle Before Glory (Deluxe) \"Belligerent\" Donnie featuring Young Smoke rowspan=\"1\" ==Related pages== * Halal Gang * Prime Boys ==References== Category:2015 establishments in North America Category:Canadian musical groups Category:Hip hop bands Category:Musical groups established in 2015",
 "title": "Full Circle (group)"
}