{
 "id": "997864",
 "text": "The 50th Anniversary of the Republic Sculptures are 20 sculptures that were made for Istanbul. They were made by Turkish sculptors as a celebration of the 50th anniversary of the Turkish Republic. The sculptures were put in different parks and squares in Istanbul around the year 1973. Many of them were damaged, destroyed, lost, or moved. Only some of them are still there. It was not easy for Turkish sculptors to show their work in public spaces between 1950 and 1960. There were not many types of sculptures (other than monuments) in Turkey until 1973. In May 1972, a committee in charge of celebrating the 50th anniversary of the Turkish Republic held a meeting at the headquarters of the Governor of Istanbul. They wanted to have 50 sculptures made to celebrate the anniversary. But, because they didn't have enough money, they reduced it to 20. The committee chose 20 artists to make these sculptures. On 13 September 1973, the committee approved sketches and photographs sent by the 20 artists. This was an important event in the history of Turkish sculpture. For the first time, sculptors were able to create sculptures that were not monuments for public spaces. This supported the idea of modern sculpture in Turkey. The results of the project were 20 sculptures put up in public spaces in Istanbul. These sculptures were made by well-known sculptors, and were in their original style. Many of the sculptures were lost, damaged or removed. Some of them were damaged only a few days after they were put in their place. Güzel İstanbul by Gürdal Duyar was thought by some traditional conservative people to be inappropriate. It was removed from Karaköy Square and eventually taken to Yıldız Park. İşçi by Muzaffer Ertoran was attacked. No one knows what happened to Mimar Sinan by Nusret Suman. İkimiz by Namık Denizhan was removed because of damage. Birlik by Mehmet Uyanık was destroyed by a water compressor in 1986. Yükseliş by Bihrat Mavitran was destroyed to make more space for a road in 1984. Yağmur by Ferit Özşen was damaged and then removed. Many of the sculptures were abstract art. The abstract sculptures that got lost are: the one by Füsun Onur that was removed when Bedrettin Dalan was the mayor in 1985, the one by Seyhun Topuz that collapsed due to \"natural causes\" in 1984, and the one by Tamer Başoğlu which disappeared in 1986. The sculptures made by Yavuz Görey and Metin Haseki were probably stolen by scrap dealers because they were made of valuable metal. == Sculptures == The 50th Anniversary Sculptures Image Name/Type Sculptor Location Material Notes İşçi Heykeli ('Workers Statue') Tophane Concrete It was attacked and damaged for many years. It was eventually removed in 2016. Güzel İstanbul ('Beautiful Istanbul') Karaköy Square (10 March – 18 March 1974) Yıldız Park (3 May 1974 – present) Concrete It was placed on 10 March 1974. Some people thought it was inappropriate because it was a naked woman. They removed it from Karaköy, and damaged it while they were removing it. Later people put it in a park named the Yıldız Park. It was eventually placed properly in the park (standing up straight). Yağmur ('Rain') Arnavutköy Akıntı Burnu Iron It was removed in 1987 because the road next to the beach was made wider. Abstract: Negative Form Gümüşsuyu Park, Dolmabahçe Copper It was stolen on the same day or maybe after only 1 week. Abstract:Yükseliş ('Ascension') in front of the Hilton Hotel in Harbiye Aluminium It was lost in 1979 during road construction that was happening next to it. İkimiz ('The Two of Us') Taksim Gezi Park Concrete It was removed after the 1980 Turkish coup d'état. The sculptor who made it removed it himself after it got damaged. Some people think he removed it after a colonel told him to remove it. The colonel was the Mayor of Şişli at the time. Abstract Maçka Concrete It still stands in its original place, as of 4 April 2021. Abstract Bebek Park Copper It still stands in its original place, as of 4 March 2022. Bahar ('Spring') Emirgan Park Concrete It was first placed in front of the Istanbul Metropolitan Municipality building. After that it was moved to a few different places. The last place that it was moved to was the Yellow Kiosk in Emirgan Park where it should be today. Abstract: Dayanışma ('Solidarity') Fındıklı Park Concrete It stands in its original place, as of August 2019. Abstract: Yankı ('Echo') Gümüşsuyu Park Sheet metal In 2012 the sculpture was renovated. It stands in its original place, as of April 2019. Abstract Fındıklı Park Aluminium It was removed in 1985 when the Fındıklı Park was being re- organized. Abstract Taşlık Park, Beşiktaş Bronze It might have been stolen for its material. It disappeared around 1984, or it was destroyed in 1984 when a truck crashed into it. Birlik ('Unity') Barbaros Boulevard, Beşiktaş Concrete It was removed in 1986 by being broken with a compressor after the mayor of Beşiktaş said that it was \"unnecessary\" and \"meaningless\". Mimar Sinan (Mimar Sinan) Saraçhane Park, Fatih Concrete It got lost in 1980. Abstract 4. Levent Iron It collapsed by itself in 1984. A few years later it was completely removed during road construction. Figür ('Figure') Orduevi Garden, Harbiye Concrete It was placed in front of the Muhsin Ertuğrul stage. It was later moved to the garden of the Harbiye Orduevi when that got expanded. Finally it was moved to behind the İstanbul Radyoevi, where it still is today. Abstract: Bediha Muvahhit Anısına (In Honor of Bediha Muvahhit) Yenikapı, Fatih Iron It was stolen by scrap metal dealers or was removed in a different way in 1986 Abstract: Tavus ('Peacock') Gülhane Park, Eminönü Iron It was removed from Gülhane Park in 1984 by the Parks and Gardens Directorate. Çıplak ('Nude') Gülhane Park, Eminönü Concrete It was removed during renovation of the park. == Recent events == In 2011, seven of the sculptures were cleaned and restored. This event was known as the \"sculpture project\". Yankı by Hüseyin Anka Özkans was made to look new again, according to what was reported. As of September 2011, there was a plan to restore the Abstract sculpture in Maçka, the Bahar sculpture in Emirgan Park, the Republic 50 Years Monument in Galatasaray Square, the Dayanışma sculpture in Fındıklı Park, the Figür sculpture in front of the Muhsin Ertuğrul Theater, and the abstract sculpture at Bebek children's park. == References == == Sources == * * * * Category:Istanbul Category:Sculpture",
 "title": "50th Anniversary of the Republic Sculptures"
}