{
 "id": "99789",
 "text": "SpongeBob SquarePants is the main protagonist of the Nickelodeon cartoon SpongeBob SquarePants. He is a yellow sea sponge who loves his job as a fry cook at the Krusty Krab. SpongeBob lives in a pineapple with his pet snail Gary. SpongeBob was first seen on May 1, 1999 in the show's television pilot (\"Help Wanted\"). He is voiced by Tom Kenny. SpongeBob continues to inspire children of all ages and even adults. To this day, he is seen as a role model for many teenagers age 13-25. His family is his father Harold, his mother Margaret, his uncle Sherm, his uncle Blue, his grandfather Grandpa SquarePants, his grandmother Grandma SquarePants, his grandmother Grandma BubbleBottom, his cousin Stanley, his cousin Larry, his cousin BlackJack, and his cousin Todd. ==Role in SpongeBob SquarePants== SpongeBob is a yellow sea sponge. He lives in Bikini Bottom, an underwater town. He loves his job as the Krusty Krab's fry cook. He works for Mr. Krabs, who owns the Krusty Krab. His neighbor Squidward Tentacles works at the Krusty Krab as a cashier. SpongeBob like to fish for jellyfish. He plays karate with his friend Sandy Cheeks. He is also good at blowing bubbles. SpongeBob's best friend is his neighbor Patrick Star. SpongeBob lives in a pineapple that is used as a house. He has a snail as a pet named Gary. Because SpongeBob is very happy, he thinks that everyone else around him is too. For example, he likes to be with Squidward, who does not like SpongeBob. SpongeBob wants to get a driver's license at Mrs. Puff's school for driving. However, he has failed every driving test. ===Antagonistic Side=== SpongeBob is known for having an antagonistic side and plays a villainous role in several episodes, mainly due to annoying Squidward and Mrs. Puff. In \"Help Wanted\", he flung numerous flying burgers at Patrick, not caring that he attacked his best friend (although this may have not been on purpose). In \"Sandy's Rocket\", he caused a helicopter crash prior to the events of the episode, leading to dozens of deaths as shown by graves. In \"CreamBob ConePants\", he and Patrick devoured the residents of Pint Bottom, leaving the town deserted. In \"Hall Monitor\", he pretended to be the \"Open Window Maniac\", causing two people to get scared and run away. In \"Demolition Doofus\", he crashed into cars two times when Mrs. Puff told him to stop. In \"Atlantis SquarePantis\", he made Patrick take a picture of the bubble even though he knew it would get them in trouble. == References == Category:Anthromophic characters Category:Fictional characters introduced in 1999 Category:SpongeBob SquarePants characters Category:Animated movie characters Category:Animated television characters",
 "title": "SpongeBob SquarePants (character)"
}