{
 "id": "997838",
 "text": "This list is a list of Armenian monarchs == Antiquity == No. Name Years Portrait or couinage Notes House 1 Orontes III 321–260 BC * First king from Orontid dynasty Orontid 2 Sames I 260–243 BC * Son of Orontes III(?) * Also king of Sophene and Commagene 3 Arsames I 243–228 BC * Son of Sames I(?) * Also king of Sophene and Commagene 4 Xerxes I 228–212 BC * Son of Arsames I * Also king of Sophene and Commagene 5 Orontes IV 212–200 BC * Son of Arsames I(?) 6 Artaxias I 189–160 BC * Founder of Artaxiad dynasty * Probably descended from Orontids Artaxiad 7 Artavasdes I 160 BC–115 BC * Son of Artaxias I 8 Tigranes I 120–95 BC(?) * Son of Artavasdes I * Historians, such as Manandian, Lang and Adalian consider him a real figure but differ or are uncertain on the exact dates of his reign. 9 Tigranes II the Great 95–55 BC * Son of Artavasdes I or Tigranes I * At one time, the domains of Tigranes the Great stretched from the shores of the Caspian Sea to the Mediterranean, from Mesopotamia up to the Pontic Alps. 10 Artavasdes II 55–34 BC * Son of Tigranes the Great 11 Artaxias II 34 BC–20 BC * Son of Artavesdes II 12 Tigranes III 20 BC–8 BC 13 Erato 8 BC–2 AD * Son and daughter of Tigranes III Tigranes IV 14 Ariobarzanes II 2–4 * Previously king of Media Atropatene 15 Artavasdes IV 4–6 16 Erato 6–12 * Second co-reign Artaxiad Tigranes V 17 Vovones I 12–18 * Previously king of Parthian Empire * First Arsacid king Arsacid 18 Artaxias III 18–34 19 Arsaces I 34–35 * Son of the Artabanus II, ruler of Parthian Empire Arsacid 20 Orodes I 35–35 * First reign * Son of the Artabanus II, ruler of Parthian Empire Arsacid 21 Mithridates I 35–37 * First reign 22 Orodes I 37–42 * Second reign Arsacid 23 Mithridates I 42–51 * Second reign 24 Rhadamistus 51–53 * First reign 25 Tiridates I 53–53 * First reign * Son of the Vovones II, ruler of Parthian Empire Arsacid 26 Rhadamistus 54–55 * Second reign 27 Tiridates I 55–88 * Second reign, the Arsacid dynasty came to power in full Arsacid 28 Sanatruk I 88–110 * Son of Tiridates I(?) 29 Axidares I 110–113 * Son of Pacorus II, king of Parthian Empire 30 Parthamasiris I 113–114 31 Vologases I 118–140 * Son of Sanatruk Arsacid 32 Sohaemus 141–161 * First reign 33 Bakur I 161–163 * Son of Vologases IV king of Parthian Empire Arsacid 34 Sohaemus 163–180 * Second reign 35 Vologases II 180–191 * Son of Vologases IV, king of Parthian Empire * Later king of the Parthian Empire Arsacid 36 Khosrov I 191–217 * Son of Vologases II 37 Tiridates II 217–252 * Son of Khosrov I 38 Hormizd-Ardashir 252–270 * Son of the Sasanian king Shapur I; made king of Armenia by his father after the Sasanians conquered the kingdom, later king of the Sasanian Empire as Hormizd I. 39 Narseh 270–280 * Brother of Hormizd-Ardashir * Later king of the Sasanian Empire 40 280–287 Khosrov II 280–287 * Son of Tiridates II * In western Armenia, enthroned by the Romans after Narseh ceded parts of western Armenia to Emperor Probus. Arsacid 41 Narseh 287–293 Tiridates (III) 287–293 * Brother of Khosrov II * Initially king of only western Armenia but granted the rest of the kingdom as well after Narseh became king of the Sasanian Empire. Arsacid 42 293–298 43 Tiridates III (or IV) 298–330 * Son of Khosrov II * In 301, Tiridates proclaimed Christianity as the state religion of Armenia, making the Armenian kingdom the first state to embrace Christianity officially. 44 Khosrov III 330–339 * Son of Tiridates III (or IV) 45 Tigranes VII 339–350 * Son of Khosrov III 46 Arshak II 350–368 * Son of Tigranes VII 47 Pap 370–375 * Son of Arshak II 48 Varazdat I 375–378 * Nephew of Pap (perhaps son of Pap's younger brother Tiridates) The Sasanians appointed their own Armenian king (Khosrov IV) in 384, against the Roman-supported Arshak III, leading Armenia to becoming informally divided under the two kings. Upon the death of the Roman- supported Arshak III in 389, Emperor Theodosius I, unable to appoint another king, incorporated the region into the Roman Empire. Thus, the Sasanian- supported kings became the sole kings of Armenia. 49 Vramshapuh 389–414 * Son of Varazdat(?) 50 Shapur 418–422 * Son of the Sasanian king Yazdegerd I, later king of the Sasanian Empire as Shapur IV 51 Artaxias IV 422–428 * Son of Vramshapuh * The last king, in 428, Armenian nobles petitioned Bahram V to depose Artaxias IV (r. 422); Bahram V (r. 420–438) abolished the Kingdom of Armenia and appointed Veh Mihr Shapur as marzban (governor of a frontier province, \"margrave\") of the country, which marked the start of a new era known as the Marzbānate period. Arsacid == Medieval == === Non-independent rulers of Armenia === The rulers of Armenia under the Sasanians (as province, known as the Persarmenia), Rashidun, Umayyad and Abbasid (as autonomous, known as the Arminiya) caliphates. No. Name Years Portrait or couinage Notes House 1 Veh Mihr Shapur 428–442 Iranian grandee, nominated by Bahram V. 2 Vasak Swni 442–452 Armenian nobleman, nominated by Yazdgerd II. 3 Adhur Hormizd 451–465 Iranian grandee, nominated by Yazdgerd II. 4 Adhur Gushnasp 465–482 Iranian grandee, nominated by Peroz I. 5 Sahak II Bagratuni 481–482 Armenian nobleman, elected by the rebellious Armenian nobles. Bagratuni 6 Shapur Mihran 482–482 Iranian millitary occupation 7 Vahan I Mamikonian 482–483 Armenian nobleman, head of provisional government. Mamikonian 8 Zarmihr Karen 483–483 Iranian military occupation. 9 Shapur of Ray 483–484 Iranian grandee, nominated by Peroz I. Cyril Toumanoff suggests a marzpan named Andigan for the same period. 10 Vahan I Mamikonian 484–505/510 Armenian nobleman, second rule, nominated by Peroz I. Mamikonian 11 Vard Mamikonian 505–509 or 510–514 Armenian nobleman, brother of Vahan I, recognized as marzpan by Kavadh I. – Several Iranian marzpans perses 11 years 12 Mjej I Gnuni 518–548 Armenian noble, mentioned by Cyril Toumanoff and Gérard Dédéyan, but not included by René Grousset. Gnuni 13 Gushnasp Bahram 548–552 or 552–554 Iranian nobleman 14 Tan-Shapur 552–560 or 554–560 15 Varazdat 560–564 16 Chihor-Vishnasp 564–572 17 Vardan III Mamikonian 572–573 Armenian noble, leader of anti-Iranian rebellion. Mamikonian 18 Golon Mihran 572–574 Iranian general tasked by Khosrau I with subduing the revolt. Cyril Toumanoff substitutes him and Vardan with Vardan- Gushnasp. 19 Vardan III Mamikonian 573–577 Armenian noble, under Byzantine protectorate. For the same period, Krikor Jacob Basmadjian a Cyril Toumanoff have Philip, prince of Syunik. Mamikonian 20 Tamkhosrau 577–580 Iranian grandee, nominated by Khosrau I. 21 Varaz Vzur 580–581 rowspan=\"4\" 22 Pahlav 581–582/588 23 Frahat 582/588–588/589 24 Hrartin 588/589–590 25 Musel II Mamikonian 590–591 Armenian noble, installed by the Byzantines. Bagratuni 26 Vindatakan 592–605 These five marzpans are mentioned by Cyril Toumanoff. Nakhvefaghan Merakbout Yazden Boutmah 27 Smbat IV Bagratuni 604–611 or 616 Armenian noble, Christian Settipani records him as marzpan from 599 to 607. He is not mentioned as marzpan by Toumanoff. René Grousset holds that Khosrau II named him marzpan following his victories in Hyrcania, ca. 604, and adds that he possibly continued in office until his death in 616-617. However, he also mentions three other marzpans over the same period (see following). Bagratuni 28 Shahrayeanpet 611–613 Marzpan at Dvin, in eastern Armenia, along with Shahin Vahmanzadegan as pahghospan in western (former Byzantine) Armenia 29 Parshenazdat 613–613 Iranian grandee, nominated by Khosrau II. 30 Namdar- Gushnasp 616–619 31 Shahraplakan 619–624 32 Rotshvehan 624–627 33 Varaztirots II Bagratuni ca. 628 Armenian nobleman, named marzpan by Kavadh II for the portions of Armenia remaining under Iranian rule. Following the onset of the Muslim conquest of Iran, Varaztirots aligned himself with the Byzantines. Bagratuni 34 Mjej II Gnuni 630–635 Armenian nobleman, named governor of Armenia by the Byzantine emperor Heraclius. Gnuni 35 David Saharuni 635–638 Armenian nobleman, he murdered Mjej and proclaimed himself governor. He was recognized by Heraclius, who named him kouropalates and ishkhan of Armenia. Saharuni 36 Theodore Rshtuni 643–645 Armenian nobleman, following the complete collapse of Iran, he was named Prince of Armenia by the Byzantines, but died before being formally invested Rshtuni 37 Varaztirots II Bagratuni 645/646 Bagratuni 1 Theodore Rshtuni 650–655 Various Armenian noblemans Rshtuni 2 Hamazasp II Mamikonian 655–658 Mamikonian 3 Gregory I Mamikonian 662–684/85 4 Ashot II Bagratuni 686–690 Bagratuni 5 Nerses Kamsarakan 689–691 Kamsarakan 6 Smbat VI Bagratuni 691–711 Bagratuni 7 Ashot III Bagratuni 732–748 8 Gregory II Mamikonian 748–750 Mamikonian 9 Sahak VII Bagratuni 755–761 Bagratuni 10 Smbat VII Bagratuni 761–775 11 Ashot IV Bagratuni 806–826 12 Bagrat II Bagratuni 830–851 13 Ashot V Bagratuni 862–884 Armenian nobleman, later king of Bagratuni kingdom of Armenia === Bagratid Kingdom of Armenia === The Bagratid Armenia was an independent Armenian state established by Ashot I Bagratuni of the Bagratuni dynasty in the early 880s following nearly two centuries of foreign domination of Greater Armenia under Arab Umayyad and Abbasid rule. No. Name Years Portrait or couinage House Notes 1 Ashot I the Great 884–890 Bagratuni * Former presidental prince of Armenia 2 Smbat I 890–914 * Son of Ashot the Great 3 Ashot II 914–928 * Son of Smbat I 4 Abas I 928–952 5 Ashot III the Merciful 953–977 * Son of Abas I * During the his reign, Ani became the kingdom's capital and grew into a thriving economic and cultural center. 6 Smbat II 977–989 * Son of Ashot III 7 Gagik I 989–1020 8 Hovhannes-Smbat III 1020–1040 * Son of Gagik I * In Ani Ashot IV 1021–1039 * Son of Gagik I * In Talin 9 Gagik II 1041–1045 * Son of Ashot IV * Last king, he died in exile === Variorous Armenian kingdoms === Kingdom of Kars (962/3–1064) * Mushegh (962/3–984) son of Abas I of Armenia * Abas I (984–1029) * Gagik-Abas II (1029–1064) he claimed the position of king of all Armenia following the collapse of the main Bagratid kingdom in 1045. The kingdom centered on now northeastern Turkey (Kars Province) and northwestern Armenia. Kingdom of Vaspurakan (908–1021) * Gagik I Ardsruni (908–943) * Derenik-Ashot Adrsruni (943–958) * Abusahl-Hamazasp (958–968) * Ashot-Sahak (969/972–991) * Gurgen-Khachik (991–1003) * Seneqerim-Hovhannes (1003–1021) The kingdom centered on Lake Van, located in what is now eastern Turkey (in Van Province) and partially northwestern Iran. Kingdom of Syunik (970–1170) * Smbat II (970–998) * Vasak VI (998–1019) * Smbat III (1019–1044) * Grigor I (1044–1084) * Senekerim Sevadian (1084–1094) * Grigor II (1094–1166) * Hasan of Gerakar (1166–1170) son-in-law of Grigor II The kingdom centered in Syunik province of now Armenia. Kingdom of Lori (982–1145) * Gurgen I (982–989) * David I (989–1046/1048) * Gurgen II (1046/1048–1081/1089) * David II and Abas (1089–1145) The kingdom was located on the territories of modern-day northern Armenia, partially northwestern Azerbaijan and southern Georgia. In addition, five Armenian meliks ruled the mountainous Karabakh from the 14th to the 19th centuries. === Armenian Kingdom of Cilicia === The Armenian Kingdom (starting of an principality) of Cilicia was an Armenian state formed during the High Middle Ages by Armenian refugees fleeing the Turcoman invasion of the Armenia. Located outside the Armenian Highlands and distinct from the Kingdom of Armenia of antiquity or medieval. No. Prince Years Portrait or couinage Notes House 1 Ruben I 1080–1095 * First Armenian prince of Cilicia * He declared the independence of Cilicia from the Byzantine Empire, thus formally founding the beginning of Armenian rule there. Rubenid 2 Constantine I 1095–1099 * Son of Ruben I 3 Thoros I 1100/2–1129 * Son of Constantine I 4 Leo I 1129–1138 5 Thoros II the Great 1145–1169 * Son of Leo I * He successfully ousted the Byzantine garrisons from Pardzerpert, Vahka, Sis, Anazarbus, Adana, Mamistra and Tarsus. 6 Ruben II 1169–1170 * Son of Thoros II 7 Mleh I 1170–1175 * Son of Leo I 8 Ruben III 1175–1186/7 * Grandson of Leo I, son of Stephen 9 Leo II 1186/7–1198 No. King Years Portrait or couinage Notes House (9) Leo I (II) 1199–1219 * In 1198, with the crowning of Leo I, King of Armenia of the Rubenid dynasty, Cilician Armenia became a kingdom. Rubenid 10 Isabella 1219–1226 * Daughter of Leo I * Queen regnant and later co-ruler 11 1226–1253 Hethum I 1226–1253 * First king from Hethumids * Co-ruler and later only king Hethumid 12 1253–1270 13 Leo II (III) 1268–1289 * Son of Hethum I 14 Hethum II 1289–1293 * Son of Leo II * First reign 15 Thoros III 1293–1294 * Son of Leo II 16 Hethum II 1294–1296 * Second reign 17 Smbat IV 1296–1298 * Son of Leo II 18 Constantine I (II) 1298–1299 19 Hethum II 1299–1305 * Third reign 20 Leo III (IV) 1305–1308 * Son of Thoros III 21 Oshin 1308–1320 * Son of Leo III 22 Leo IV (V) 1320–1341 * Son of Oshin * During this period, the kingdom was much harassed by Mamluks and Mongols. 23 Constantine II (IV) 1342–1344 * First king from crusader-dynasty of Lusignan Lusignan 24 Constantine III (V) 1344–1362 * He was the second cousin of Constantine II. Hethumid–Lusignan 25 Constantine IV (VI) 1362–1373 Hethumid 26 Leo V (VI) 1374–1375 * The last king then claimed the throne after losing power to the throne Lusignan === Turcoman kings of Armenia === In the decades following the Battle of Manzikert, one of the Turcoman vassal dynasties of the Seljuk Turks gained control of the city of Ahlat in the former Armenian heartland. These Turcoman emirs took the used title of Shah-i Armen (ie. \"King of the Armenians\"). No. Name Years Portrait or couinage House Notes 1 Sökmen 1100–1111 Sökmenid * Turcoman military commander, former slave amir in the service of Seljuks. 2 Zahireddin Ibrahim 1111–1127 3 Ahmed 1127 4 Sökmen II 1128–1185 ==== Qara Qoyunlu ==== The title Shah-i Armen was temporarily revived in the 15th century under the rule of the Turcoman Qara Qoyunlu during the rule of Qara Iskandar. Iskandar sought to cultivate the Armenian population, especially the feudal lords and clergy. To reinforce this policy, he took the title \"Shah-i Armen,\" King of the Armenians. No. Name Years Portrait or couinage House Notes 1 Iskandar or Qara Iskandar 1420–1436 Qara Qoyunlu * 4th ruler of Qara Qoyunlu * Son of Qara Yusuf == References == == Sources == * * * Armenia *",
 "title": "List of Armenian monarchs and presidents"
}