{
 "id": "997940",
 "text": "Rönesans Rezidans (Renaissance Residence) was a residential building in Ekinci, Antakya, that fell over in February of 2023 during the 2023 Turkey–Syria earthquake. It was the first luxury apartment in Hatay Province. The building was built between 2011 and 2012. It was the home of generally more wealthy people in Antakya. It was kind of a luxurious residence. It was built by Antis Yapi, a company that was established many years ago. When it fell over during the first earthquake it might have trapped or killed at least 800 people. Rescue efforts looking for survivors are still ongoing. It was said that the structure of the building was strong, and that it did not collapse but it was instead tipped as Dr. Ahmet Ercan explains. The shockwave got bigger on its way from Gaziantep, where the epicentre of the first earthquake was. When the shockwave arrived in Hatay Province it had gotten so big that it caused much more intense and violent shaking of the ground in Hatay. Architect/Engineer Yoshinori Moriwaki said that the building did not have friction piles which he says would have prevented it from falling over. The building did have a floating raft system. Geophysics Professor Ahmet Ercan said that the foundation of the building should have been deeper. He said that it looks 3 meters deep but it should have actually been about 10 meters deep. The Ekinciler Belde Municipality gave the permits for the building in 2013. Lütfü Savaş said that the building was probably build correctly and followed regulations. == Design and construction == The building is the first residenz (Turkish: Rezidans) in Hatay. It was built to be a home for families that are working in the growing border trade business in Hatay. Hatay is next to the Syrian border. The building was home to around 700 residents. Other people have said that almost 1000 residents lived in the building. The building is 12 floors high and has a total 249 homes, 2 shops. The building is divided into 4 blocks. The area that the building takes up on the ground is large. The homes range from squared. The building had amenities such as a half Olympic sized pool, jacuzzi, gym, sports facilities, children's playground, a place for cars to park under a roof, secretary and reception services, walking and biking paths, wakeup service, shop, 24/7 security services and waterfalls. Mehmet Yaşar Coşkun was the Chairman of the Board of Antis Yapı when the building was made. He said that this project will \"create an area where all kinds of social activities can take place\". The need for parking spaces is answered inside the building. Keeping the cars inside keeps the outside without cars and free and open for activities to take place. Building started in 2011 by Antis Yapı. The first of the building was started with a ceremony which was attended by: Hatay MP Sadullah Ergin, Hatay governor H. Celalettin Lekesiz, mayor Lütfü Savaş, chief constable Ragıp Kılıç and mayor of Ekinci municipalit Seyfettin Yeral. The plan was to finish building in April 2013. It was finished in 2012. The company Antis Yapı was started by the architect Mehmet Yaşar Coşkun and engineer Hüseyin Yalçın Coşkun. The license for the building was given by the Ekinciler Belde Municipality in 2012 accordign to Lütfü Savaş. The building was constructed onto a floating raft foundation. People thought the building can survive earthquakes. == Collapse == The building fell over after the first earthquake of the 2023 Turkey–Syria earthquakes, which affected Hatay. People beliebe that there are 800 people under the building. People got angry at the building because many older buildings that were close were still standing as of 17 February, while Rönesans Rezidans had fallen over. Dr.Ercan has explained that the concrete wasn't bad, but the foundation was not deep enough. Also the shockwaves of the first earthquake arrived in Antakya with a much bigger than was expected. According to Dr. Ercan, the disaster might not be the fault of municipality or contractor or the building inspection board. He says there needs to be a proper analysis of the situation that takes into consideration how exactly the earthquake waves affected the building. The investigation should be done by geophysics experts, and they should not rush to put the blame on anyone and also not rush to forgive anyone. However the rubble of the building was already cleared out by 24 February even though the building was cleared up it is still not known how many people died because of the collapse. Lütfü Savaş who is the mayor of Hatay Province said that the building was built correctly and did what it needed to to survive an earthquake. He is confident that this is true because the architect was an idealist, and he was also a former president of the Chamber of Architects. He said that everyone will be questioned of course. It would be bad not to. They will look for anything that might be missing. Professor of Geophysics Dr. Ahmet Ercan said that the shockwave of the earthquake had increased instead of reducing in magnitude when it arrived in Antakya. It had increased so much that it was more than gravity but in the opposite direction of gravity. This means that buildings were thrown up into the air from the ground and pushed sideways even if they were strong constructions. Rönesans Rezidans shows this. The building is knocked over but it has not collapsed. All the columns and beams look strongly attached to each other and show no sings of breaking. A rule of thumb is that for every 5 floors above ground there should be 1 floor under the ground. It looks like the foundation floor is about deep, but according to the rule it should have been about deep. Japanese Architect and Engineer Yoshinori Moriwaki also interpreted the collapse of Rönesans Rezidans. He said that the length of Rönesans Rezidans played a part in its collapse. A long building is fine but should use friction piles. Friction piles would have increased the price of the whole project by about 10%. The stakes would go all the way down to where the ground is more stable. He said that even though it fell over, there was actually not much damage to the structure. No matter how strong the building is, a bad foundation can lead to the building collapsing. According to some sources the building was constructed on a floating raft system which is a system used when the ground under a building is too soft for friction piles. Moriwaki compared the relationship of architects and engineers in Turkey and Japan. He said that in Turkey the architect is very powerful. In Turkey for example the boss is an architect and the engineer works for the architect. In Japan however, since the 1995 Kobe earthquake and the 2011 Sendai-Miyagi earthquake/Fukushima disaster, Japan changed the system to give more power to the engineers. According to some reports residents were already worried about the buildings structure before it collapsed. == Residents == The roughly 250 residential units of the building was a home to 700-1000 people. They were generally the more wealthy residents of Antakya. Members of the Hatayspor team were living in the building. Team manager Volkan Demirel also previously lived in the building and two of his neighbors died. Player Christian Atsu and technical director Taner Savut were Hatayspor members under the wreckage. A thermal imaging camera determined signs of life in the wreckage and it was reported that Atsu had been rescued but that Savut is still missing, later it was later reported that Atsu is also still missing. Atsu might have been on the 9th floor when the building collapsed, his body was found by 18 February confirming his death. Taner Savut was also later identified and confirmed dead in a hospital in Adana. Handball player Cemal Kütahya along with his wife and kids, and educator Hülya Aydın were also missing in the wreckage. Kutahya and one of his sons have since been reported dead. Many doctors lived in the building. Doctor Şebnem Turan Adıgüzel who was rescued from the rubble said that some of her colleagues had unfortunately died. == Rescue efforts == A Hungarian rescue team saved 12 people. Hungarian Firefighter Lieutenant Colonel Dániel Mukics personally rescued a resident named Selma from the wreckage at the 47th hour. He was part of a 55-person team. A team of 75 Turkish coal miners saved 40 people in the 7 consecutive days that they were at the scene. A team from China has also been working building. The Erzurum Search and Rescue Team (ERAKUT) who belong to the Erzurum Metropolitan Municipality Fire Brigade Department also arrived at the wreckage and were involved in the rescuing of a 9 year old boy. == Arrests == The contractor of the building, Mehmet Yaşar Coşkun, was arrested at the airport in Istanbul. He was on his way to Montenegro where he said he was working on some other projects. He said his trip had nothing to do with the earthquake and that his trip was not an attempt to run away. He was sent to Metris Prison. The locations of the project manager İbrahim Dahiroğlu and the site manager Bayram Mansuroğlu are unknown. Coşkuns lawyer said that \"the public is looking for a criminal, a culprit. My client was picked as this culprit\". Coşkun said that the building was strong and had all the necessary licenses. == References == === Citations === === Sources === * * * * === Further reading === * == Other websites == * Category:Hatay Province Category:Pages with unreviewed translations Category:2023 in Turkey Category:2020s disasters in Turkey Category:February 2023 events Category:2023 disasters in Asia Category:Buildings and structures in Turkey",
 "title": "Rönesans Rezidans"
}