{
 "id": "998015",
 "text": "Kelvin Doe (born October 26, 1996, in Freetown, Sierra Leone), is a Sierra Leonian engineer. == Career == Born in a poor area of Freetown, Sierra Leone, Kelvin Doe is the youngest of five. The area lacked electricity and water, and it was so unreliable that the lights would only come on once a week. At the age of 10 he started collecting old devices and scrap metal to create something new out of it. He would do this by taking apart the old devices to see how they work, and then piece them back together as new inventions that came straight out of his mind. He built batteries and transmitters out of discarded pieces of scrap. Later he participated in GMin’s Innovate Salone idea competition, where he got to the finals and built a generator from scrap metal. He used the living room as his workstation where he built batteries for power lamps, and generators for electricity when it was not available. He made a radio transmitter and started his own radio station under the name DJ Focus. The inspiration for the name came from his belief that with focus, anyone can achieve what they strive for. Kelvin was only 15 years old when he built the radio station, which he used to broadcast news, music and messages for peace and unity to his community. Kevin built the generator that powered the radio station. He built it of scrap metal, acid and soda. He later has continued to create and innovate. Kelvin now owns and runs his own tech company as a CEO. The company is called “K-Doe Tech, Inc” where he designs and sells consumer electronics. == Recognition == Kelvin has won many international awards. One of them is called “the presidential Gold Medal”. Because of his great accomplishments, he received an invitation to the United States. He was invited to participate in a program in the famous technology university called The Massachusetts Institute of Technology (MIT). He is the youngest person to have participated at this program. == References == Category:1996 births Category:Living people Category:Electrical engineers Category:Sierra Leonean people",
 "title": "Kelvin Doe"
}