{
 "id": "998148",
 "text": "The brook silverside (Labidesthes sicculus) is a North American species of Neotropical silverside. The brook silverside lives in slow moving rivers and lakes from the Great Lakes to the Mississippi River. The brook silverside survives best in clear water with aquatic vegetation. The brook silverside occupies freshwater lakes, ponds, quiet pools and small rivers. == Life history == The brook silverside breeds in the summer from late May to mid- August. Their life span is only one year. During the first year, they have rapid growth, growing up to one millimeter per day. Brook silversides quickly reach a maximum size of approximately eight centimeters. They reach sexual maturity by the first summer in order to reproduce. Some studies report that brook silversides reproduce by internal fertilization, although this has not been entirely confirmed. When the eggs are produced, they have an attached filament, which allows for the eggs to be deposited on wood, plants and rocks. Temperature does not affect the sex of fish. After the eggs hatch, they immediately swim away from the shore into deeper water, but still stay just under the surface. They congregate in large schools. The brook silverside migrates throughout its life cycle. No human-induced changes are reported as affecting the life history. Human-induced changes are reported as more strongly affecting populations rather than behaviors. == Current management == Human intervention through species introduction, habitat alteration, pollution, and construction are causing the decline of the brook silverside and other freshwater fishes. Freshwater fishes account for the majority of extinctions in ray-finned fishes. To stabilize and increase populations, no more dams or waterways should be built. Additionally, pollution must be stopped. Agricultural runoff creates turbid waters, which the brook silverside cannot thrive in. Stream sampling occurs through organizations such as USFWS and TVA (locally). This allows for populations to be monitored and stream chemistry to be controlled. Over-fishing and hybridization aren't causing brook silverside populations to decline. Invasive species and habitat destruction have the greatest impact on population decline. Areas are being reserved for the preservation of endemic fish, but more must still be done. == Related pages == * Swordfish * Sea monster * Ovalentaria * Percomorpha * Labriformes * Tubemouth * Leedsichthys == References == # ^ NatureServe (2013). \"Labidesthes sicculus\". IUCN Red List of Threatened Species. 2013: e.T201944A18229117. doi:10.2305/IUCN.UK.2013-1.RLTS.T201944A18229117.en. Retrieved 19 November 2021. # ^ a b c Froese, Rainer; Pauly, Daniel (eds.) (2015). \"Labidesthes sicculus\" in FishBase. October 2015 version. # ^ a b Jonna, R. (2004): Actinopterygii. NatureServe. # ^ Marsden, J.E., Langdon, R.W. & Good, S.P. (2000): First occurrence of the brook silverside (Labidesthes sicculus) in Lake Champlain, Vermont. Northeastern Naturalist, 7 (3): 248-254. # ^ a b Powles, P.M. & Sandeman, I.M. (2008): Growth, summer cohort output, and observations on the reproduction of brook silverside, Labidesthes sicculus (Cope) in the Kawartha Lakes, Ontario. Environmental Biology of Fishes, 82 (4): 421-431. # ^ a b Strongin, K., Taylor, C.M., Roberts, M.E., Neill, W.H. & Gelwick, F. (2011): Food Habits and Dietary Overlap of Two Silversides in the Tennessee-Tombigbee Waterway: The Invasive Menidia audens Versus the Native Labidesthes sicculus. The American Midland Naturalist, 166 (1): 224-233. # ^ Morris, J.E. (1982): Distribution and food habits of the inland silverside, Menidia beryllina, and the northern brook silverside, Labidesthes sicculus, in Lake Conroe, Texas. Master's Thesis. Texas A&M; University. 57 pp. # ^ Bloom, D.D., Piller, K.R., Lyons, J., Mercado-Silva, N. & Medina-Nava, M. (2009): Systematics and Biogeography of the Silverside Tribe Menidiini (Teleostomi: Atherinopsidae) Based on the Mitochondrial ND2 Gene. Copeia, 2009 (2): 408-417. # ^ Pratt, K.E., Hargrave, C.W. & Gido, K.B. (2002): Rediscovery of Labidesthes sicculus (Atherinidae) in Lake Texoma (Oklahoma-Texas). The Southwestern Naturalist, 47 (1): 142–147. # ^ Hubbs, C.L. (1921): An Ecological Study of the Life-History of the Fresh- Water Atherine Fish Labidesthes sicculus. Ecology, 2 (4): 262-276. Category:Teleosts Category:Animals of North America Category:Freshwater fish",
 "title": "Brook silverside"
}