{
 "id": "99855",
 "text": "Pinnipeds From Latin pinna, wing or fin, and ped-, foot. are the seals and their relatives, a group of semi-aquatic marine mammals. The Pinnipedia is in the Order Carnivora. There are three seal families: Odobenidae (walruses), Otariidae (eared seals, including sea lions and fur seals), and Phocidae (true seals). Seals are sleek-bodied and barrel-shaped. Their bodies are well adapted to the aquatic habitat where they spend most of their lives. Pinnipeds have flippers for hands, big bulky bodies, doggish faces, and big eyes. Unlike cetaceans, pinnipeds have their noses on their faces, and each nostril of the nose closes when the pinniped goes underwater. Like cetaceans, pinnipeds have a thick layer of blubber (fat) just under their skin: this blubber keeps them warm in cold waters and keeps them fed during times when food is not easily found. When they cannot find food, they live off the fat in the blubber. Pinnipeds are carnivorous. This means they eat only meat (such as fish or squid) and not plants. However, almost all pinnipeds can be eaten by polar bears, sharks and killer whales. Seals are often trained in zoos or aquariums to put on shows. However, in Sweden, it is illegal to train a seal to balance a ball on its nose. == Sleep == Pinnipeds sleep in the water.Lyamin et al 2004. Relationship between sleep and eye movement in cetaceans and pinnipeds. Archives Italliennes de Biologie 142: 557568. They may also sleep on land. In both environments, there is a danger. At least in the northern hemisphere, there is danger from polar bears on land, and in the water, there is danger from sharks.Gill, Victoria 2012. Slowest Greenland shark hunts sleeping prey. BBC Nature While sleeping in water, the animals go through different stages of sleep. They do some behaviors during sleep: they come to the surface occasionally to breathe, and they now and then open an eye for a period of time. The details vary in different species or groups. Similar adaptations are found in cetaceans like dolphins. == Taxonomy == * Family Phocidae (Earless seals or true seals) ** Subfamily Monachinae *** Tribe Monachini **** Genus Monachus *** Tribe Mirungaini **** Genus Mirounga: Elephant seals *** Tribe Lobodontini **** Genus Ommatophoca ***** Ross seal (Ommatophoca rossii) **** Genus Lobodon ***** Crabeater seal (Lobodon carcinophagus) **** Genus Hydrurga ***** Leopard seal (Hydrurga leptonyx) **** Genus Leptonychotes ***** Weddell seal (Leptonychotes weddellii) ** Subfamily Phocinae *** (placed here) **** Genus Cystophora ***** Hooded seal (Cystophora cristata) **** Genus Erignathus ***** Bearded seal (Erignathus barbatus) *** Tribe Phocini **** Genus Histriophoca *****Ribbon seal (Histriophoca fasciata) **** Genus Phoca ***** Spotted seal (Phoca largha) ***** Common seal or Harbor Seal (Phoca vitulina) ***** Harp seal (Phoca groenlandica, formerly Pagophilus groenlandicus) **** Genus Pusa ***** Ringed seal (Pusa hispida, formerly Phoca hispida) ***** Caspian seal (Pusa caspica, formerly Phoca caspica) ***** Baikal seal or Nerpa (Pusa sibirica, formerly Phoca sibirica) **** Genus Halichoerus ***** Grey seal (Halichoerus grypus) * Family Otariidae (Eared seals) ** Genus Arctocephalus (Fur seals) *** Antarctic fur seal (Arctocephalus gazella) *** Brown fur seal (Arctocephalus pusillus) ** Genus Callorhinus *** Northern fur seal (Callorhinus ursinus) ** Genus Eumetopias *** Steller sea lion or Northern Sea Lion (Eumetopias jubatus) ** Genus Neophoca *** Australian sea lion (Neophoca cinerea) ** Genus Otaria *** South American sea lion or Southern Sea Lion (Otaria flavescens, formerly Otaria byronia) ** Genus Phocarctos *** New Zealand sea lion (Phocarctos hookeri) ** Genus Zalophus *** California sea lion (Zalophus californianus) * Family Odobenidae (Walruses) ** Walrus (Odobenus rosmarus) == References == *",
 "title": "Pinniped"
}