{
 "id": "99865",
 "text": "Sir John Alexander Macdonald (January 11, 1815 – June 6, 1891) was the first and third Prime Minister of Canada. He was an important influence on the Canadian Confederation, July 1, 1867. Macdonald was in office from 1867 to 1873 and again from 1878 to 1891, making him the second longest-serving Prime Minister of Canada (after William Lyon Mackenzie King) and the only one to win six majority governments. One of the things Macdonald wanted to do was to build a transcontinental railway that would link Canada from the Atlantic Ocean to the Pacific Ocean. That railway, called the Canadian Pacific Railway, was completed in 1885. He is also criticized for taxing every Chinese person trying to get in Canada, and for doing things that hurt indigenous people in Canada. Macdonald did not speak French as well as the Prime Ministers who came after him. He could speak Scottish Gaelic and a bit of Latin. Macdonald had four siblings. He was the third of five children. == References == == Other websites == * * * * The Canadian Museum of Civilization - Face-to-Face - The Canadian Personalities Hall * John A. Macdonald: Architect of Modern Canada * John A. Macdonald, Confederation and Canadian Federalism * Biography at the Dictionary of Canadian Biography Online * \"Sir John A. Macdonald, Freemason\" * Synopsis of federal political experience from the Library of Parliament * Image of The Jamaica with Sir and Lady Macdonald aboard * John Macdonald's Gravesite * Correspondence of Sir John Macdonald; selections from the correspondence of the Right Honorable Sir John Alexander Macdonald, first Prime Minister of the Dominion of Canada, made by his literary executor Sir Joseph Pope (1921) * * Dictionary of Canadian Biography article by J. K. Johnson and P. B. Waite * The John A. Macdonald Portal, edited by Alastair Sweeny Category:1815 births Category:1891 deaths Category:Politicians from Glasgow Category:Privy Councillors (Canada) Category:Members of the Privy Council of the United Kingdom Category:Knights Commander of the Order of St Michael and St George Category:Knights Grand Cross of the Order of the Bath Category:Leaders of the Opposition (Canada) Category:Canadian King's Counsel Category:19th-century Canadian people",
 "title": "John A. Macdonald"
}