{
 "id": "998764",
 "text": "Needles is a small city in San Bernardino County, California. It is in the hot, dry Mojave Desert, on the west side of the Colorado River. Needles is across the river from Arizona, and about 12 miles from Nevada. It is along Interstate 40. As of 2020, 4,931 people live there. == History == Needles was named after a group of pointy rock columns, on the Arizona side of the river. These were called \"The Needles\". The town was founded in 1883 when people were building a railroad (the Atchison, Topeka and Santa Fe Railway). They needed a bridge to cross the Colorado River. At first, there was only a group of tents where workers lived. Soon, people built stores, restaurants, laundries, and saloons. Needles was the largest port, north of Yuma, on the river. This was actually a bad place to build a bridge. The sides and bottom of the river were unstable. When the river flooded, the bridge broke apart three times – in 1884, 1886 and 1888. The railway decided to take it down. They built a new bridge ten miles to the south. This part of the river had a solid rock bottom. The new bridge was complete in 1890.Richard E. Lingenfelter, Steamboats on the Colorado River, 1852–1916, University of Arizona Press, Tucson, 1978 Many people were starting to cross the country on railroads. A man named Fred Harvey decided to build restaurants and hotels near train stations. He built one of the first restaurant chains. The El Garces Hotel in Needles was one of his most famous hotels. People thought it to be the \"crown jewel\" of the Harvey company. Needles was a major stop on the historic U.S. Route 66 highway from the 1920s through the 1960s. For migrants from the Midwest Dust Bowl in the 1930s, it was the first town they saw in California. Needles has many motels and other shops from that time. Hundreds of thousands of people visit Needles every year. == Nearby places == Mohave Valley, Arizona is across the river, on the east side. Las Vegas is about 100 miles to the north. San Bernardino, the county seat, is about 200 miles to the southwest. Havasu National Wildlife Refuge is about 18 miles to the south, on the river. The town is near the east side of Mojave National Preserve. It is even closer to Dead Mountains Wilderness. == Climate == Needles has a hot desert climate. At midday in summer, Needles is one of the hottest places in the United States and the world. In July, the hottest month: *The average temperature is *The average high is *The average low is . In December, the coldest month: *The average temperature is *The average high is *The average low is The highest temperature ever measured was , and the lowest was . On average, of rain falls every year. On August 13, 2012, rain fell in Needles when the temperature was . This may be the hottest rain ever measured on Earth. ==Famous people== *Charles Schulz, cartoonist of Peanuts, lived in Needles 1928–30 and made it the home of Snoopy's brother Spike. *Alice Notley, American poet, grew up in Needles. *Natalie Diaz, American poet and winner of the 2021 Pulitzer Prize for Poetry. == References == Category:Settlements in San Bernardino County, California Category:Cities in California",
 "title": "Needles, California"
}