{
 "id": "99878",
 "text": "Christopher Allen Lloyd, who is known professionally as Chris Lloyd or Christopher Lloyd (born October 22, 1938) is an American actor. He has appeared in theater productions, films, stage, television and video game work since 1961 and is most known for the movies Back to the Future (as Doctor Emmett Brown) and The Addams Family (as Uncle Fester), the television programs Taxi (as Rev. Jim Ignatowski) and Cyberchase (as The Hacker), and Piranha 3D (as Mr. Goodman). == Filmography == Year Title Role Notes 1975 One Flew Over the Cuckoo's Nest Max Taber 1977 Another Man, Another Chance Jesse James Uncredited 1978 Three Warriors Steve Chaffey Goin' South Deputy Towfield 1979 Butch and Sundance: The Early Days Bill Tod Carver The Lady in Red Frognose The Onion Field Jailhouse lawyer 1980 The Black Marble Arnold's Collector Schizoid Gilbert 1981 The Legend of the Lone Ranger Maj. Bartholomew \"Butch\" Cavendish The Postman Always Rings Twice The Salesman National Lampoon's Movie Madness Samuel Starkman Segment: \"Municipalians\" 1983 Mr. Mom Larry To Be or Not to Be S.S. Captain Schultz 1984 Star Trek III: The Search for Spock Cmdr. Kruge The Adventures of Buckaroo Banzai Across the 8th Dimension John Bigbooté National Lampoon's Joy of Sex Coach Hindenberg 1985 Back to the Future Dr. Emmett \"Doc\" Brown Clue Professor Plum The Black Cauldron Horned King's Guards (voice) 1986 Miracles Harry 1987 Walk Like a Man Reggie Shand / Henry Shand The Legend of the White Horse Jim Martin 1988 Track 29 Henry Henry Who Framed Roger Rabbit Judge Doom Eight Men Out Bill Burns 1989 The Dream Team Henry Sikorsky Back to the Future Part II Doc Brown 1990 Back to the Future Part III Why Me? Bruno Daley DuckTales the Movie: Treasure of the Lost Lamp Merlock the Magician (voice) 1991 Back to the Future: The Ride Dr. Emmett \"Doc\" Brown Simulator ride Suburban Commando Charlie Wilcox The Addams Family Uncle Fester/Gordon Craven 1993 Twenty Bucks Jimmy Dennis the Menace Switchblade Sam Addams Family Values Uncle Fester Addams 1994 Angels in the Outfield Al \"The Boss\" Angel Camp Nowhere Dennis Van Welker Radioland Murders Zoltan The Pagemaster Mr. Dewey / The Pagemaster 1995 Mr. Payback: An Interactive Movie Ed Jarvis Short film Things to Do in Denver When You're Dead Pieces 1996 Cadillac Ranch Wood Grimes The Hunchback of Notre Dame Frollo's Soldiers (voice) 1997 Changing Habits Theo Teagarden Dinner at Fred's Dad Anastasia Rasputin (voice) Angels in the Endzone Al \"The Boss\" Angel Reprised role 1998 The Real Blonde Ernst The Animated Adventures of Tom Sawyer Judge Thatcher (voice) 1999 My Favorite Martian Uncle Martin Baby Geniuses Heep Convergence Morley Allen Man on the Moon Himself - \"Taxi\" actor Cameo, Uncredited 2001 Kids World Leo Happy Birthday Attorney Burn When Good Ghouls Go Bad Uncle Fred Walker 2002 Interstate 60: Episodes of the Road Ray Wish You Were Dead Bruce Hey Arnold!: The Movie Coroner (voice) 2003 Haunted Lighthouse Cap'n Jack Short film 2004 Admissions Stewart Worthy 2005 Here Comes Peter Cottontail: The Movie Mr. Sassafrass (voice) Bad Girls from Valley High Mr. Chauncey Enfants terribles Reverend Burr 2007 Flakes Willie 2008 Fly Me to the Moon Grandpa (voice) The Tale of Despereaux Hovis (voice) 2009 Call of the Wild 'Grandpa' Bill Hale Santa Buddies Stan Cruge 2010 Snowmen The Caretaker Jack and the Beanstalk Headmaster Piranha 3D Mr. Goodman 2011 Love, Wedding, Marriage Dr. George InSight Shep Adventures of Serial Buddies Dr. Von Gearheart Snowflake, the White Gorilla Dr. Archibald Pepper (voice) English dub The Chateau Meroux Nathan 2012 Foodfight! Mr. Clipboard (voice) Cadaver Cadaver (voice) Short film Piranha 3DD Mr. Goodman Delhi Safari Pigeon (voice) English dub The Axe Boat Tom Field Short film The Oogieloves in the Big Balloon Adventure Lero Sombrero Mickey Matson and the Copperhead Conspiracy Grandpa Jack Dead Before Dawn Horus Galloway Excuse Me for Living Lars Sid the Science Kid: The Movie Dr. Bonabodon (voice) Last Call Pete The Illusionauts Professor (voice) 2013 Jungle Master Dr. Sedgwick (voice) The Coin William Short film 2014 A Million Ways to Die in the West Doc Brown Cameo Sin City: A Dame to Kill For Kroenig The One I Wrote for You Pop 2015 88 Cyrus Doc Brown Saves the World Emmett Brown Short film The Boat Builder Abner 2016 I Am Not a Serial Killer Mr. Crowley Donald Trump's The Art of the Deal: The Movie Doc Brown Cold Moon James Redfield 2017 Going in Style Milton Kupchak Muse Bernard Rauschen The Sound Clinton Jones 2018 Boundaries Stanley Making a Killing Lloyd Mickey ReRun (Future) George Benson 2019 Welcome to Pine Grove! Arthur Post-production The Haunted Swordsman The Black Monk (voice) Short film 2021 Nobody Hutch's father Completed TBA Time the Fourth Dimension Completed Tankhouse Buford Filming Senior Moment Sal Spinelli Post-production ==References== ==Other websites== * * * *Another Unofficial Christopher Lloyd Web Site *Christopher Lloyd at Memory Alpha Category:1938 births Category:Living people Category:Actors from Stamford, Connecticut Category:American movie actors Category:American stage actors Category:American television actors Category:American voice actors Category:Emmy Award winning actors",
 "title": "Christopher Lloyd"
}