{
 "id": "998750",
 "text": "Paul Rand (born Peretz Rosenbaum; August 15, 1914 – November 26, 1996) was an influential American graphic designer. He was best known for his corporate logo designs, including the iconic logos for IBM, ABC, and UPS. Rand was a pioneer of the modernist movement in graphic design. He is widely regarded as one of the most important and influential designers of the 20th century. His work was characterized by simplicity, wit, and elegance. He was known for his ability to distill complex ideas into memorable and timeless designs. Rand was a prolific writer and educator. His books, including \"Thoughts on Design\" and \"Design, Form, and Chaos,\" are still widely read and studied today. Throughout his career, Rand was honored with awards and accolades, including induction into the Art Directors Club Hall of Fame and the New York City Art Directors Club Hall of Fame. == Early life and Education == Paul Rand was born as Peretz Rosenbaum on August 15, 1914, in Brooklyn, New York, to Jewish immigrants from Russia. He grew up in a working-class family and was the youngest of three sons. Rand showed an early interest in art and design, often drawing cartoons and designing posters for his school's events. == Early Career == Rand attended the Pratt Institute in Brooklyn, where he studied advertising and illustration. During his time at Pratt, Rand became interested in the work of modernist designers such as Jan Tschichold and László Moholy-Nagy. He also studied the works of artists such as Pablo Picasso and Georges Braque, whose cubist style would later influence his design work. After completing his studies at Pratt in 1932, Rand worked as a freelance designer and illustrator. He studied at the Art Students League of New York, where he improved his skills in drawing and design. His innovative and minimalist approach to design would later make him one of the most influential designers of the 20th century.\" == Other websites == *Official Website *Paul Rand Quotes Category:1914 births Category:1996 deaths Category:American designers",
 "title": "Paul Rand"
}