{
 "id": "99886",
 "text": "Aquaman is a fictional comic book superhero published by DC Comics. The character was created by Paul Norris and Mort Weisinger and first appeared in More Fun Comics #72 in November, 1941. During the Silver Age of Comic Books, Aquaman was a founding member of the Justice League of America. Aquaman's comic books are filled with colorful undersea characters and a rich supporting cast, including his mentor Vulko, his powerful wife Mera, and various sidekicks such as Aqualad, Aquagirl, and Dolphin. Aquaman stories tend to blend high fantasy and science fiction. His villains include his archenemy, Black Manta, and his half-brother, Ocean Master. == Fictional character biography == Aquaman is the alias of Arthur Curry, who also goes by the Atlantean name Orin. Others to use the title of Aquaman include a short-lived human successor, Joseph Curry; his protégé Jackson Hyde; and the mysterious Adam Waterman, who was briefly active during World War II. Aquaman's biography and origin has been reinvented several times since 1941. The best-known version of Aquaman, developed in the “Silver Age” of comic books in the 1950s and '60s, is the son of a lighthouse keeper and an Atlantean outcast. In 1964 he became one of the first superheroes to get married when he wed the undersea queen Mera. == Powers and abilities == Aquaman has several superhuman powers. He can breathe underwater and swim at very high speeds. Aquaman has super strength and is very hard to injure. Aquaman's most famous ability is to communicate and command marine animals. == In other media == Aquaman has appeared in several cartoon series, such as the Super Friends, and also in the live-action TV series Smallville, with Superman. Jason Momoa played Aquaman in the 2016 movie Batman v Superman: Dawn of Justice, the 2017 movie Justice League, the 2018 movie Aquaman, the 2021 movie Zack Snyder's Justice League, and the 2023 movie Aquaman and the Lost Kingdom. Category:DC Comics superheroes Category:DC Comics adapted into movies Category:Fictional characters introduced in 1941 Category:Justice League",
 "title": "Aquaman"
}