{
 "id": "99882",
 "text": "The Buzz on Maggie is an American animated television series produced by Walt Disney Television Animation and Bardel Entertainment. It is about the daily life of a fly named Maggie Pesky. The show takes place in a city called Stickyfeet, found in a dump. Most of the characters in the show are talking insects. The show had two different stories in each episode. The show was cancelled after only one season of twenty-one episodes. The series premiered June 18, 2005 on Disney Channel in the United States and on Teletoon in Canada. ==Cast== * Jessica DiCicco as Maggie Pesky - a teenage fly who wants to be a famous rock star. * David Kaufman as Aldrin Pesky - Maggie's older brother who likes sports. * Thom Adcox-Hernandez as Puppet Pesky - Maggie's sweet younger brother. * Cree Summer as Rayna Cartflight - Maggie's best friend. * Brian Doyle-Murray as Chauncey Pesky - Maggie's father. * Susan Tolsky as Frieda Pesky - Maggie's mother. * Tara Strong as Bella Pesky - Maggie's baby sister who is still a maggot. * Jeff Bennett as Principal Peststrip - the principal of Buzzdale Academy. * Tara Strong as Dawn Swatworthy - a mean popular fly at Buzzdale Academy. * Jeff Bennett as George - Aldrin's best friend. * Curtis Armstrong as Mr. Cornelius Bugspit - the drama and history teacher at Buzzdale Academy. * Jess Harnell as Eugene and Wendell - two smart beetles who are twins. * Laraine Newman as Lacey Ladybug - a rich mean ladybug who thinks they are better than flies. * Tara Strong as Maria Monarch - a shy monarch butterfly. * Jess Harnell as Melvin Stinkleton - a stink bug who attends Buzzdale Academy. ==Episodes== # The Flyinator/Ladybugged # Funball/The Science Whatchamacallit # The Candidate/Germy # Lunchlady/Love Stinks # The Price of Fame/King Flear # Rottingmuck Ranch/Bella Con Carney # Bugsitting/Le Termite # Pieface/The Hangout # Slumber Party/Spelling Bees # The Usual Insects/Sister Act # Hooligans/Scum Bites # The Big Score/Scare Wars # Metamorpho Sis/Radio Free Buzzdale # Those Pesky Roaches/Bugtillion # Hot For Tutor/Sick Days inc. # Scout of Order/Ant Mines # Faking History/Bugs on the Brink # Training Days/Honey Stripers # Racooooon!/Best, Best Friends # Peskys Unclogged/Club Hopping # Synchronized Flying/Roach Hotel Category:2005 American television series debuts Category:2010 American television series endings Category:2000s American animated television series Category:Television series by Disney Category:English-language television programs",
 "title": "The Buzz on Maggie"
}