{
 "id": "998900",
 "text": "\"Distant Sun\" is a 1993 song by Crowded House and is the leading single from their fourth studio album Together Alone. It went to number 4 in Canada, number 5 in New Zealand, number 19 in the United Kingdom, number 23 in Australia and number 70 in Germany. It was covered by Brooke Fraser. ==Track listings== As the lead single from Together Alone, \"Distant Sun\" was released in various versions internationally. All songs, including B-sides, were written by Neil Finn unless otherwise noted.Bailey, Marck; Comprehensive discography of Crowded House including track listings for all albums and singles. Released 28 March 1995. Retrieved 4 July 2007. UK CD single All live tracks were recorded at The Roxy, Los Angeles, 26 February 1987. \"Distant Sun\" and \"Walking on the Spot\" are from the Together Alone album. Disc one # \"Distant Sun\" – 3:51 # \"This Is Massive\" – 3:55 (live) # \"When You Come\" – 6:16 (live) Disc two # \"Distant Sun\" – 3:51 # \"Walking on the Spot\" – 2:54 # \"Throw Your Arms Around Me\" – 3:54 (live) # \"One Step Ahead\" – 3:52 (live) Holland CD single # \"Distant Sun\" # \"Don't Dream It's Over\" (live at the King Biscuit Flower Hour, 24 March 1987) Netherlands CD single All B-sides recorded live at The Roxy, Los Angeles, 26 February 1987 except \"Walking on the Spot\" which is the Together Alone album version. # \"Distant Sun\" – 3:51 # \"Walking on the Spot\" – 2:54 # \"Throw Your Arms Around Me\" – 3:54 (live) # \"One Step Ahead\" – 3:52 (live) Australian CD single All live tracks were recorded at The Town & Country Club, London on 9 and 10 November 1991. # \"Distant Sun\" – 3:50 # \"Walking on the Spot\" (live) – 2:55 # \"When You Come\" (live) – 6:23 # \"Skin Feeling\" – 3:56 # \"Weather with You\" (live) – 5:26 US CD single Live tracks were recorded at Munich, Germany, 12 December 1993. # \"Distant Sun\" (remix version) – 3:45 # \"Pineapple Head\" – 3:54 (live) # \"Locked Out\" – 3:38 (live) ==References== Category:1993 songs Category:Crowded House songs",
 "title": "Distant Sun"
}