{
 "id": "999137",
 "text": "The Pontiac Solstice was a 2-seat roadster and 2-seat coupe. It was one of the last models created by Pontiac, a former brand of General Motors. Depending on the trim, the Solstice had either the LE5 or LNF engine, the LNF being the more powerful of the two. Production ended following the 2008 financial crisis and closing of Pontiac in 2010. == History == The Pontiac Solstice was first introduced as a concept car in 2004. It remained unusually similar to its original vision on release in 2002. Despite being produced in 2005, Pontiac Solstice models produced in that year were specified as 2006 model year cars. It was based on the GM Kappa platform, which would also be used for the Saturn Sky, Opel GT, and Daewoo G2X. It was released as a convertible soft-top car with a 2.4 liter four-cylinder LE5 engine. It made 177 horsepower and 166 pound-feet of torque, which pushed a 0 to 60 MPH time of 7.2 seconds. Without any additional options, the Pontiac Solstice was sold at a starting price of $19,995-- a competitive price for the time, especially when compared to its main rival: the Mazda MX-5 NC. The Solstice GXP was revealed in the 2006 Los Angeles Auto Show. It featured a 2 liter LNF engine making 260 horsepower and 260 pound-feet of torque. This improved its 0 to 60 time from the base model to 5.2 seconds. In 2008, an optional dealer-installed upgrade to the vehicle's computer and sensors became available. The engine's output could be increased to 290 horsepower and 345 pound-feet of torque (325 pound-feet on automatic transmission-equipped models.) In 2009, the Pontiac Solstice coupe became available. The coupe was a hard-top convertible. It used a targa top style of convertible top. It also had a glass rear hatch, as well as extra cup holders behind the head rests. == Data == The Pontiac Solstice, regardless of trim, was equipped with 18 inch rims. It could be bought with some or all of the following options: * Spoiler * Leather seats * Power windows and locks * XM satellite radio * 6-disc radio * Limited slip differential * Automatic transmission * Chrome/polished wheels * On-Star system * Sportier suspension The Pontiac Solstice could come in four main varieties: * Solstice base convertible * Solstice GXP convertible * Solstice base coupe * Solstice GXP coupe Base models featured the 177 horsepower, 166 pound-feet LE5 engine, while GXP models featured the 260 horsepower, 260 pound-feet LNF engine. The Pontiac Solstice base model convertible has an official curb weight of 2,860 lbs. The base model coupe has an official curb weight of 2,930 lbs. The GXP model convertible has an official curb weight of 2,976 lbs. The GXP model coupe has an official curb weight of 3,018 lbs. The Pontiac Solstice features a front-mid engine, rear-wheel drive layout. It features Stabilitrak, GM's electronic stability control software, as a driver's aid. It also features four wheel anti-lock brakes. The Solstice comes standard with size 245/45/R18 tires. The Pontiac Solstice has hydraulic power steering. The Pontiac Solstice is a body-on-frame vehicle, as are all Kappa Platform vehicles. Body panels do not contribute to the vehicle's structure. Instead, a steel frame is present beneath the body panels that give the vehicle its structural strength. ==References== Category:Pontiac automobiles Category:Roadsters Category:2000s automobiles",
 "title": "Pontiac Solstice"
}