{
 "id": "999223",
 "text": "Jan Jongbloed (; born 25 November 1940) is a Dutch former professional footballer who played as a goalkeeper. He played with the Netherlands national football team. His style of play made him comparable to an added defender: he often collaborated in the construction of the action, embodying the spirit of total football. Regarded as one of the best Dutch goalkeepers of all time. He was the starting goalkeeper for the Netherlands at the 1974 and 1978 World Cups. Jan played an unusual role as an offensive goalkeeper, one of the pioneers of the sweeper-keeper, a rather rare feature in those years. More skilled with his feet than with his hands, he hardly ever used gloves on the pitch. == Club career == His career began in 1959 defending goal for DWS, a small club from his hometown Amsterdam. This won the newly promoted title in the 1963–1964 season and in 1972 it was transformed, with a merger, into FC Amsterdam. Jongbloed moved to Roda JC in 1977, then to Go Ahead Eagles in 1981, before ending his career at 45 due to a heart attack; having played his last game in the Go Ahead Eagles at the age of 44 years, 9 months and 14 days he is still the oldest player to have played a game in the Eredivisie. He is also still the record holder for the number of matches played in professional football (707). == International career == Jongbloed made international debut on 26 September 1962 in a 4-1 defeat against Denmark. This remains his only presence for almost twelve years; in fact, he is called up only in view of the 1974 World Cup, even though he is not even a professional (in fact he manages a tobacco shop). Called up in place of the more popular Jan van Beveren and fielded by Rinus Michels in place of Piet Schrijvers from the first match (contrary to public opinion), he reached the final having conceded only one goal, moreover an own goal from Ruud Krol, they were then defeated in the last act 2-1 by the hosts West Germany. After being called up in the Dutch expedition participating in the 1976 European Championships, but without ever being used, Jongbloed was also called up by Ernst Happel in the following 1978 World Cup. Here too he starts, despite being replaced in the first two games of the second phase after the three goals conceded against Scotland (Schrijvers plays in the matches against Austria and West Germany). Jongbloed returns to the field during the decisive match against Italy, after Schrijvers was injured by colliding with his teammate Ernie Brandts on the occasion of the goal of the momentary blue advantage. Then play the final and also on this occasion Holland was defeated by the home team, Argentina. Jongbloed ends his militancy in the national team with this match, in which he has collected a total of 24 appearances. He broke a goalkeeper record as an international: 683 minutes without conceding a goal. == Coaching career == From the beginning of 1988 he was an assistant coach at Vitesse, in which the first major success followed in 1989; trainer Bert Jacobs became champion of the Eerste Divisie. The following year, fourth place in the Eredivisie was reached with European football as a reward. In between, the club also reached the cup final, in which PSV was too strong. In the years that followed, Vitesse always finished in the top six and participated in the UEFA Cup nine times. In October 1999 he did the honors for the dismissed Herbert Neumann together with Edward Sturing. Jongbloed did the same with Frans Thijssen four years earlier, after Ronald Spelbos had to leave. Since 2000 he has been active as a youth coach at the Arnhem club. In 2010 it became clear that his contract with Vitesse would not be extended. The Zaanse amateur association Hellas Sport then appointed Jongbloed as a technical advisor. Jongbloed was last active as a youth trainer at ZVV Zilvermeeuwen, also from Zaandam. == Personal life == Jongbloed was married twice and twice divorced; he has a daughter Nicole. His son Eric was also a football goalkeeper with DWS. He was hit by lightning and killed, aged 21, during a match on 23 September 1984. == Honours == DWS *Eredivisie: 1963–64 Netherlands *FIFA World Cup runner-up: 1974, 1978 *UEFA European Championship third place: 1976 == References == Category:Dutch association football goalkeepers Category:1940 births Category:Living people",
 "title": "Jan Jongbloed"
}