{
 "id": "999389",
 "text": "Ride the Cyclone is a musical about six teens, all part of a Canadian school choir, dying in a freak roller coaster accident. Before they all died, a fortune-telling machine read their fortunes, knowing they would ride the doomed rollercoaster and could tell them nothing. Before the children would pass into the afterlife, the fortune-telling machine brings their souls there to present an offer. He says that he can bring back one of the souls beyond death, and back to life. (It is unknown if this is for recreation or other purposes). This offer is presented as a contest, giving each student a chance to come forward and present their case for why they should return to life. First, Ocean O'Connell Rosenberg, a cheerful school girl raised in a liberal family, sings about how she is the only one worth living because of her grades and grade point average. Once she finishes, Noel Gruber (who is introduced as the only gay guy in his small town) sings about how he want to be a sex worker in post-World War Paris, France. After a few more songs (\"Every Story's Got A Lesson\", \"This Song Is Awesome\"), Misha sings about rap and his long-distance girlfriend Talya. Ricky Potts, a boy who makes his entrance with his trusted walking-canes, sings about his religion and how he'll hope to find his leaders. Constance Blackwood, the girl said to be Ocean's best friend, sings about her life and how she loves her small town. Although everyone else sings about happiness, Jane Doe sings about her despair and her longing for knowing who she really is, as she lost her head when she died and holds no memories of who she was in life. The choir wants to help her, so they throw her a fake birthday party. Karnak changes the rules at the last second, and chooses Ocean (since she had the highest grade point average) and tells her she has the ability to choose who returns to the land of the living. Ocean votes for Jane Doe, revealing her identity - her name being Penny Lamb. The musical then ends on a cliffhanger. == Characters == * The Amazing Karnak: A mechanical fortune- telling machine that serves as the narrator. * Ocean O'Connell Rosenberg: A competitive over-achiever who struggles to put others before herself. * Noel Gruber: The only gay man in town who has an obsession with French Cinema. * Misha Bachynskyi: A Ukrainian adoptee who puts on a mask to seem tough. * Ricky Potts: A mute boy with a degenerative disease and an overactive imagination. * Jane Doe (Penny Lamb): A decapitated girl who is unsure of her true identity. * Constance Blackwood: The secretly self-loathing nicest girl in town. == Musical numbers \"Karnak's Dream of Life\" == * \"Welcome...\" * \"The Uranium Suite\" * \"Jane Doe's Entrance\" * \"What the World Needs\" * \"Meet Noel Gruber\" * \"Noel's Lament\" * \"Every Story's Got a Lesson\" * \"This Song is Awesome\" * \"Talia\" * \"Meet Ricky Potts\" * \"Space Age Bachelor Man\" * \"Meet Jane Doe\" * \"The Ballad of Jane Doe\" * \"The New Birthday Song\" * \"Jawbreaker\" * \"Sugar Cloud\" * \"It's Not a Game / It's Just a Ride\" These are usually sang by all six of the teenagers and sometimes the Amazing Karnak; for the songs meant to be solos the rest of the group provides background vocals. == Productions == * 2008 Victoria 2011 Toronto 2013 Western Canada tour 2015 Chicago 2016 Off-Broadway 2018 Seattle 2019 Atlanta 2019 Minneapolis 2022 Mccarter Theatre Princeton, New Jersey 2022 Blue Bridge Theatre Victoria, British Columbia 2022 Sudbury, Ontario 2022 Newmarket, New Hampshire 2022 Bancroft Village Playhouse Bancroft, Ontario 2023 Arena Stage Washington, DC 2023 Chance Theater Anaheim, CA 2023 4 Chairs Theater Chicago, Illinois; 2025 Buenos Aires, Argentina (Soon) Music, Lyrics, and Book by: Jacob Richmond and Brooke Maxwell Category:2000s musicals",
 "title": "Ride the Cyclone"
}