{
 "id": "99945",
 "text": "Eric Stark Maskin (born December 12, 1950) is an American economist. In 2007, he won the Nobel Prize in Economics with Leonid Hurwicz and Roger Myerson. He is the Albert O. Hirschman Professor of Social Science at the Institute for Advanced Study, and a visiting Professor at Princeton University. ==Life story== Maskin was born in New York City, New York on December 12, 1950, to a non-religious Jewish family, and grew up in Alpine, New Jersey.Silverstein, Marilyn. \"Nobel winner who's at home with Einstein\" , New Jersey Jewish News, November 8, 2007. Accessed January 22, 2008. \"A native of New York, Maskin grew up in New Jersey, in a nonreligious Jewish home in the town of Alpine.\" He graduated from Tenafly High School in Tenafly, New Jersey in 1968,Minutes of Library Board Meeting , Tenafly Public Library, dated October 15, 2007. Accessed January 22, 2008. and then studied at Harvard University where he received his A.B. and Ph.D. After he got his Ph.D., Maskin went to the University of Cambridge in 1976 where he was a research fellow at Cambridge College. He taught at Massachusetts Institute of Technology from 1977-1984 and from 1985-2000 at Harvard, where he was the Louis Berkman Professor of Economics. In 2000, he moved to the Institute for Advanced Study in Princeton, New Jersey. He has studied a wide range of subjects in economic theory, such as game theory, the economics of incentives, and contract theory. He is particularly well known for his work on mechanism design/implementation theory and dynamic games. His current research projects include comparing different rules for elections, the causes of inequality and studying coalition formation. He is a Fellow of the American Academy of Arts and Sciences, Econometric Society, and the European Economic Association, and a Corresponding Fellow of the British Academy. He was president of the Econometric Society in 2003. == Software patents == Maskin suggested that software patents make new inventions difficult. Software, semiconductor, and computer industries have made many inventions in the past when patent laws have been weak, he argued. \"In the 1980s when patent protection was extended to software,\" wrote Maskin. \"Arguments predicted that productivity should have increased among patenting firms.\" Maskins ideas that this would not happen were correct. \"These increases did not occur.\" Sequential Innovation, Patents, and Imitation, by James Bessen and Eric Maskin, Discussion paper, MIT (2000), forthcoming in The RAND Journal of Economics == References == == Other websites == *Webpage from Institute for Advanced Study, School of Social Science *Profile in The Daily Princetonian *Nash Equilibrium and Welfare Optimality * Category:1950 births Category:Living people Category:American economists Category:American Nobel Prize winners Category:Harvard University alumni Category:Harvard University faculty Category:Jewish American academics Category:Jewish American scientists Category:Jewish Nobel Prize winners Category:Scientists from New York City Category:Educators from New York City",
 "title": "Eric Maskin"
}