{
 "id": "99948",
 "text": "Roger Bruce Myerson (born 29 March 1951) is an American economist and co- winner, with Leonid Hurwicz and Eric Maskin, of the 2007 Nobel Prize in Economics \"for having laid the foundations of mechanism design theory.\" He has made contributions as an economist, as an applied mathematician, and as a political scientist. ==Biography== Roger Myerson was born on March 29, 1951 to a Jewish family.JUF News: Nobel Prize winners have Jewish, Chicago connections He attended Harvard University, where he received his A.B., S.M. (1973), and Ph.D. (1976), all in applied mathematics. From 1976 to 2001, he was a professor of economics at Northwestern University's Kellogg School of Management. Currently, he is the Glen A. Lloyd Distinguished Service Professor of Economics at the University of Chicago. == Contributions == Among his scientific contributions to game theory and mechanism design, the following are noteworthy: * \"Graphs and Cooperation in Games,\" Mathematics of Operations Research 2 (1977), 225-229. * \"Two-Person Bargaining Problems and Comparable Utility,\" Econometrica 45 (1977), 1631-1637. * \"Refinements of the Nash Equilibrium Concept,\" International Journal of Game Theory 7 (1978), 73-80. * \"Incentive Compatibility and the Bargaining Problem,\" Econometrica 47 (1979), 61-73. * \"Optimal Auction Design,\" Mathematics of Operations Research 6 (1981), 58-73. * \"Mechanism Design by an Informed Principal,\" Econometrica 51 (1983), 1767-1797. * \"Two-Person Bargaining Problems with Incomplete Information,\" Econometrica 52 (1984), 461-487. * \"Bayesian Equilibrium and Incentive Compatibility,\" in Social Goals and Social Organization, edited by L. Hurwicz, D. Schmeidler, and Hugo Sonnenschein, Cambridge University Press (1985), 229-259. He wrote a general textbook on game theory in 1991, and has also written on the history of game theory, including his review of the origins and significance of noncooperative game theory. Myerson has worked on economic analysis of political institutions and written several major survey papers: * \"Analysis of Democratic Institutions: Structure, Conduct, and Performance,\" Journal of Economic Perspectives 9:1 (1995), 77-89. * \"Economic Analysis of Political Institutions: An Introduction,\" Advances in Economic Theory and Econometrics: Theory and Applications, volume 1, edited by D. Kreps and K. Wallis (Cambridge University Press, 1997), pages 46–65. * \"Theoretical Comparisons of Electoral Systems,\" European Economic Review 43 (1999), 671-697. His recent work on democratization has raised critical questions about American policy in occupied Iraq. ==Books by Professor Myerson== Myerson has published the following books: * Game Theory: Analysis of Conflict, Harvard University Press, 1991. * Probability Models for Economic Decisions, Duxbury Press, 2005. ==References== == Other websites == *Webpage at the University of Chicago *ABC News Chicago video interview *The scientific background to the 2007 Nobel prize: Mechanism Design Theory Category:1951 births Category:Living people Category:American economists Category:American Nobel Prize winners Category:American political scientists Category:Harvard University alumni Category:Jewish American academics Category:Jewish American scientists Category:Jewish Nobel Prize winners Category:Scientists from Boston Category:Educators from Boston",
 "title": "Roger Myerson"
}