{
 "id": "999511",
 "text": "Andrew Mwenda (born 1972) is a Ugandan print, radio and television journalist. He is the founder and owner of The Independent, a current affairs news magazine. He was the political editor of The Daily Monitor, a Ugandan daily newspaper, and was a presenter on KFM Radio in Kampala. ==Background and education== Mwenda was born in 1972 in Fort Portal, Kabarole District, in the Western Region of Uganda. His father is Mzee Phillip Muhanga of Fort Portal. Mwenda is a younger brother to Lieutenant General Kayanja Muhanga, a senior UPDF military officer. After local primary school, Mwenda entered Nyakasura School where he completed his O-Level studies. He then went to Busoga College Mwiri in the Eastern Region of Uganda for his A-Level education. He graduated with a High School Diploma from Mwiri. He was admitted to Makerere University where he graduated with a Bachelor of Arts in Journalism. Later, he won a Chevening Scholarship and was admitted to the School of Oriental and African Studies at the University of London. He graduated with a Master of Science in Development Studies. He was a a fellow at Saïd Business School at the University of Oxford in 2009 and a visiting fellow at Yale University, in 2010. He also studied at Stanford University between 2006 and 2007. He was a visiting lecturer at the University of Florida, Gainesville, in 2005, and a visiting fellow at the Africa Study Centre of the University of Leiden, in the Netherlands in 2003. In 2008, the World Economic Forum selected Mwenda as a Young Global Leader and in 2010, Foreign Policy Magazine named him among the 100 Top Global Thinkers.In 2011, President Paul Kagame of Rwanda nominated Mwenda to serve on his Presidential Advisory Council. In 2012 and 2013, Mwenda was named by Foreign Policy among the global top 100 most influential persons on Twitter. in 2011, Mwenda helped negotiate a truce between President Yoweri Museveni of Uganda and Kagame of Rwanda. Between 2011 and 2018, he worked as a de facto envoy of each president to the other and helped maintain a cordial relationship between them as individuals and also between the two countries. This arrangement finally collapsed in 2018. In 2005, he was among sixteen senior journalists invited by the British government to discuss with Prime Minister Tony Blair the forthcoming report of the Commission for Africa. ==Work history== Mwenda is the managing director of Independent Publications Limited, publishers of The Independent Mwenda worked as a political editor of the Daily Monitor and general manager of its affiliate on FM radio, KFM, before starting The Independent in 2007. He worked as a consultant for the World Bank, the World Resources Institute, and Transparency International. He has written for international news media like Der Spiegel, the International Herald Tribune, The New York Times, and Foreign Policy. He also produced documentaries for BBC World television and radio. In August 2005, he was charged with sedition for broadcasting a discussion of the cause of death of Sudanese vice-president John Garang. Garang was killed when the Ugandan presidential helicopter smashed in a storm over a rebel area, on the way back from talks in Uganda. During his radio programme, the journalist accused the Ugandan government of \"incompetence\" and said they had put Garang on \"a junk helicopter ... at night ... in poor weather ... over an insecure area\". In April 2008, he was arrested and released on bail by the Ugandan government for \"being in possession of seditious material and of publishing inflammatory articles\". ==Activism== In July 2006, Mwenda appeared before the British House of Commons committee on Global Poverty to testify against aid to Africa. He has criticised aid agencies and charities for ineffectiveness and collusion with corruption. He believes that western aid has been largely unhelpful for African development. He thinks it encourages dependency, keeps wars going, and creates corrupt states. In 2014, Mwenda was one of the people asking to stop The Uganda Anti-Homosexuality Act, 2014. ==Awards== Mwenda won the CPJ International Press Freedom Awards in 2008 from the Committee to Protect Journalists. ==Journal articles== * 2007: Investieren Geht uber Schmieren, Entwicklungspolitik, December 2007, Nr. 12 62 Jahr. * 2007: Personalizing power in Uganda, Journal for Democracy, July 2007, Volume 18, Number 3 * 2006: \"Sustaining Growth and Achieving Deep Reductions in Poverty: How Uganda Recovered from Conflict\"; in Attacking Africa's Poverty: Experience from the Ground Edited by Louise Fox and Bob Liebenthal, World Bank, Washington DC. * 2006: Foreign aid the Weakening of Democratic Accountability in Uganda (a policy briefing paper for the Cato Institute, a think tank in Washington DC. * 2006: With Roger Tangri: 'Politics, Donors, and the Ineffectiveness of Anti- Corruption Institutions in Uganda', Journal of Modern African Studies, 44, 1 (2006) * 2005: With Roger Tangri: 'Patronage Politics, Donor Reforms, and Regime Consolidation in Uganda', African Affairs, 104, 416 (2005), 449–67. * 2003: With Roger Tangri: \"Military Corruption and Ugandan Politics since the late 1990s.\" in the Review of African Political Economy No. 98, 2003. * 2001: With Prof. Roger Tangri, Corruption and Cronyism in Uganda's Privatisation in the 1990s, Africa Affairs 100–398 (2001) 87–103 ==References== Category:1972 births Category:Living people Category:Makerere University alumni Category:Ugandan people Category:African businesspeople Category:African journalists",
 "title": "Andrew Mwenda"
}