{
 "id": "99951",
 "text": "Mario Renato Capecchi (born 6 October 1937) is an Italian-born American molecular geneticist. He won the 2007 Nobel Prize in Physiology or Medicine with Martin Evans and Oliver Smithies. Capecchi is Distinguished Professor of Human Genetics and Biology at the University of Utah School of Medicine, which he joined in 1973. ==Life== Mario Capecchi was born in the Italian city of Verona in 1937. His father, Luciano Capecchi, was an Italian airman who was reported as missing in action in the Western Desert Campaign. His mother, Lucy Ramberg, was the American-born daughter of Impressionist painter Lucy Dodd Ramberg and German archaeologist Walter Ramberg. During World War II, his mother was sent to the Dachau concentration camp, as punishment for handing out pamphlets and belonging to an anti-Fascist group. Before her arrest she had sold her belongings and gave the money to a poor family near Bolzano, to give her son a place to live. After a year, the money was spent and the family was unable to care for him. At four-and-a-half years old he was left to live on the streets of northern Italy for the next four years, living in various orphanages and roving through towns with groups of other homeless children. He almost died of hunger. His mother had been freed from Dachau and began a year- long search for him. She finally found him in a hospital bed in Reggio Emilia, ill with a fever and living one bowl of chicory coffee and bread crust each day. She took him to Rome, where he had his first bath in six years. In 1946 his uncle, Edward Ramberg, an American physicist at RCA, sent his mother money to return to the United States. Mario and his mother moved to Pennsylvania to live at a cooperative community which had been started by his uncle. In 1960 Capecchi came to MIT as a graduate student to study physics and mathematics, but he soon became interested in molecular biology. He moved to Harvard to join the laboratory of James D. Watson, co-discoverer of the shape of DNA. Capecchi received his PhD in biophysics in 1967 from Harvard University. In 1973 he joined the faculty at the University of Utah. Since 1988 Capecchi has also been an investigator of the Howard Hughes Medical Institute. He is a member of the National Academy of Sciences. He has taught for Duke University's Program in Genetics and Genomics. After the Nobel committee announced that Capecchi had won the Nobel prize, an Austrian woman named Marlene Bonelli claimed that Capecchi was her long-lost half-brother, which he acknowledged was true. == Knockout mice == Mario Capecchi is known for his work in gene targeting of the mouse embryonic stem cells. This helped him and others study how genes work. The work includes cloning and genetic changing. The work on gene targeting and knockout mice won the 2007 Nobel Prize in Physiology or Medicine, jointly with Martin Evans and Oliver Smithies. Dr. Capecchi has also pursued a systematic analysis of the mouse Hox gene family. This gene family is controls embryonic development in all multicellular animals (metazoa). == Selected honours == *1996 – Kyoto Prize in Basic Sciences *1996 – German Molecular Bioanalytics Prize *1997 – Franklin Medal for Advancing Our Knowledge of the Physical Sciences *1998 – Baxter Award for Distinguished Research in the Biomedical Sciences *2000 – Italian Premio Phoenix-Anni Verdi for Genetics Research Award *2001 – Albert Lasker Award for Basic Medical Research, co-winner with Martin Evans and Oliver Smithies. *2001 – Spanish Jiménez-Diáz Prize *2001 – Pioneers of Progress Award *2001 – National Medal of Science *2002 – John Scott Medal Award *2002 – Massry Prize *2003 – Pezcoller Foundation-AACR International Award for Cancer Research *2002/3 – Wolf Prize in Medicine *2005 – March of Dimes Prize in Developmental Biology. *2007 – Nobel Prize in Physiology or Medicine, co-winner with Martin Evans and Oliver Smithies. ==References== ==Other websites== * Howard Hughes Medical Institute biography * Eccles Institute of Human Genetics biography * University of Utah biography * Interviews with Mario Capecchi from Dolan DNA Learning Center's DNA Interactive * Capecchi animation from Dolan DNA Learning Center's DNA from the Beginning Category:1937 births Category:Living people Category:Academics from Utah Category:American geneticists Category:American Nobel Prize winners Category:Harvard University alumni Category:Naturalized citizens of the United States Category:People from Verona Category:Wolf Prize winners Category:Italian Nobel Prize winners",
 "title": "Mario Capecchi"
}