{
 "id": "999607",
 "text": "A military vehicle is a vehicle for land-based military transport and activity, including combat vehicles. These vehicles are designed (or made for) or used a lot by military.military vehicle definition - TheFreeDictionary By Farlex == Types of military vehicles == ===Combat vehicles=== * Armoured personnel carrier, often has a weapon that is less than 20 millimeters calibre. Some APCs have \"30-millimeter guns and anti-tank missiles\".https://www.forbes.com/sites/sebastienroblin/2020/11/25/this-is-not- a-tank-a-laypersons-guide-to-armored-fighting-vehicles/. Retrieved 2023-08-04. \"The latest APCs are receiving heavier 30-millimeter guns and anti-tank missiles, blurring the lines between them and IFVs.\" APCs are sometimes called battlefield taxi.https://time.com/6245649/us-bradleys-vehicles-ukraine/. Time. Retrieved 2023-07-16 * Infantry fighting vehicle, has at least a \"cannon of ... 20 millimeters calibre and sometimes an anti-tank missile launcher\". IFV is a kind of armoured fighting vehicle. Those vehicles are used by infantry (or a kind of soldier). * Battle tank or tank are names for main battle tank * Scout vehicle or reconnaissance vehicle, used for reconnaissance (or a kind of exploring) * Anti-aircraft weapon with its own propulsion * Self-propelled artillery *armoured car, a kind of armoured fighting vehicle * Tracked military vehicle ** Half-track * Technical, a kind of Improvised fighting vehicle * Gun truck, a kind of improvised fighting vehicle * Armoured train and Military draisine, part of Military railways * MRAP, a kind of armoured personnel carrier File:Leopard_2_A7.JPG|Tank (picture shows Leopard 2A7) File:FPCougar.jpg|MRAP, a kind of armoured personnel carrier (the picture shows a Cougar HE MRAP being tested with landmines) File:Bundesarchiv Bild 101I-801-0664-37, Berlin, Unter den Linden, Schützenpanzer.jpg|A half-track (vehicle); The picture shows a front wheel, and a track (farther to the right side of the picture). File:BMP-3 amphibious infantry fighting vehicle.jpg|Infantry fighting vehicle (this is a Russian BMP-3 with soldiers on it) File:T 17 Staghound Armored Car (1).jpg|Armoured car (picture shows T17E1 Staghound during World War II) File:M113.jpg|Armoured personnel carrier (picture shows M113 in South Vietnam === Non-combat vehicles=== ** Military ambulances ** Amphibious vehicle ** Float ** Military bicycle ** Military engineering vehicle ** Military light utility vehicle ** Military motorcycle ** Off-road military vehicle (related page: off-road vehicle) ** Recovery vehicle ** Military trailer ** Military truck File:Bohdan evac, Kyiv 2018, 20.jpg|Military ambulance File:Alvis_Stalwart_W&P2011.JPG;|This amphibious vehicle, is a kind of military truck ==Related pages== *Bradley Fighting Vehicle *SPRAT * Humvee *Tank ==Sources== Category:Military transport Category:Vehicles",
 "title": "Military vehicle"
}