{
 "id": "999681",
 "text": "Beer pong is a drinking game. It is also known as Beirut. It is played with two teams. Cups filled with beer are set at each end of a table. The players then take turns and try to throw ping pong balls at the cups of the opposing team. If a ball lands inside a cup, the opposing team has to drink that cup, and the cup is removed. When all the cups of a team are removed, that team loses. Beer Pong was first played at Dartmouth College, in the United States, between 1950 and 1960. When at certain places there are usually \"House Rules\" Some examples of these house rules are: * Many people play with water instead of beer and then drink from their own separate drinks instead if a cup is removed, this is much more sanitary. * If a ball lands in a cup that has already been removed, it is placed back into the formation of cups. * If you get 2 cups in a row, you can call \"fire\" meaning if you get another cup in a row you continuously get another shot until you miss * If the ball rolls back towards the thrower and they grab it before it falls off the table they may throw a trick shot, typically behind the back for males or left handed for females * If the ball rolls across the top of multiple cup edges or happens to touch more than one cup before falling in, every cup the ball touches is removed from play. * Each team can get one rerack per game, where if you have 6 or fewer cups left you can call certain formations. such as straight line or triangle. * If the first cup you get removed is the center cup for either team, the person who threw the ball much play on one knee instead of standing until they get another cup * \"Gentlemen's\" is something you call when you only have 2 or fewer cups on the table and they are re-racked to be in a line with one touching the far edge, and the other is in front of that cup. * \"Balls Back\" is when you and your teammate each get a cup in the same turn, you are both allowed to throw again. * \"Island\" is something you can call once per game per player, if their is a cup left that is not touching another cup, and you hit the shot, you get both that cup and the closest cup to it removed. * \"Front cup\" is something you call where if you get the cup that is in the front(closest to you) of the formation you get an additional cup removed * You can bounce the pong ball into the cups, if you do and you make it into a cup, you remove two cups. But if the ball is bounced in any way the opposing team may swat the ball away or catch the ball. * If the ball is swirling around the inside of the cup before touching the liquid and stopping, the defending team may scoop the ball out or blow air into the cup to make it fall out. If you or the ball touches the water it counts as a successful throw and the cup is removed. * If a cup is knocked over for any reason, that cup is removed from play. This can be a tactic if a cup is very close to the edge. * If both players get both balls in the same cup before it is removed from play, They automatically win the game. * If one team gets all their cups removed the other team can get \"redemption\" shots, they can throw their balls until they miss and can use any rules to do so. If they successfully remove the rest of their cups, the game goes into a tie breaker game, this can either be another full game or it can use the tower rule. * The Tower rule is when after a successful redemption, each team makes a small formation of 3 cups in a triangle on the bottom then one cup stacked on top in the center of the three cups. Each team must land a ball in the top cup before being able to remove any lower cups, if the top cup falls into of the the lower cups both cups are removed. Category:Drinking games",
 "title": "Beer pong"
}