{
 "id": "999911",
 "text": "Daniel Bernoulli (February 8, 1700 - March 8, 1782) was a Swiss mathematician and one of many famous mathematicians in the House of Bernoulli. He is remembered for his mathematical applications to mechanics, especially fluid mechanics, as well as for his pioneering work in probability and statistics. Bernoulli's scientific work is also studied in many schools around the world. == Biography == Daniel Bernoulli was born in Groningen, Netherlands. His father was Johann Bernoulli, his grandfather was Jacob Bernoulli, and his brother of Johann II. He was said to have a bad relationship with his father. They participated together and tied in a scientific context at the University of Paris. Johann was unable to bear the shame of having to compete with his son that banned Daniel from their house. Johann Bernoulli also stole some key ideas from Daniel's book Hydrodynamica to write his own book Hydraulica before Hydrodynamica was published. Despite Daniel's efforts to reconcile, his father carried the enmity until his death. When Daniel was seven, his younger brother Johann Bernoulli II was born. While he was still in school, his father Johann encouraged him to study business. However, Daniel refused, because he wanted to study mathematics. But he then followed his father's will and studied business. His father then asked him to study medicine, and Daniel agreed with the condition that his father would teach him mathematics privately. He had a close friendship with Leonhard Euler. He arrived St. Petersburg in 1724 as professor of mathematics. But with unhappiness there, Bernoulli fell ill in 1733 giving him an excuse to leave. He returned to the University of Basel, where he successfully held chairs in medicine, metaphysics and natural philosophy, until his death. === Mathematics study === His first mathematical work was Exercitationes, which was published in 1724 with the help of Goldbach. Two years later, he showed for the first time the analysis of an object's motion into translational and rotational motion. Daniel Bernoulli's main work is the Hydrodynamique (Hydrodynamica) published in 1738, it was similar to Joseph Louis Lagrange's Mécanique Analytique. It classified the results into a single principle, the conservation of energy. Bernoulli also wrote a large number of different questions in the field of mechanics, especially problems connected with vibrating strings, and the solutions were given by Brook Taylor and Jean le Rond d'Alembert. === Physics === Daniel Bernoulli was the first to formulate the aerodynamic theory, and he applied the ideas to explain Robert Boyle's laws. He worked with Euler on physical elasticity, developing the Bernoulli equation, Bernoulli's principle, and aerodynamics . == Further reading == * [Anon.] (1911) \" Bernoulli, Encyclopaedia Britannica * [Anon.] (2001) \"Daniel Bernoulli\", Encyclopaedia Britannica * Blower, S. (2004), D, Bernoulli's \" \", Reviews of Medical Virolology, 14 : 275–2880-435-54150-1 * Mikhailov, GK, 2005, \"Hydrodynamica\" in Grattan-Guinness, I., ed., Landmark Writings in Western Mathematics . Elsevier: 131-42. * Pacey, AJ & Fisher, SJ (1967) \"Daniel Bernoulli and the viva of compressed air\", British Journal for the History of Science 3, 388-92 * Rouse Ball, WW [1908] (2003) \" The Bernoullis, \" in A Short Account of the History of Mathematics, 4th ed., Dover, ISBN 0-486-20630-00486611876 == Other websites == * Stanford Encyclopedia of Philosophy: The St. Petersburg Paradox by RM Martin. Category:Swiss physicists Category:Fellows of the Royal Society Category:Swiss mathematicians Category:1782 deaths Category:1700 births Category:Academics of the University of Basel",
 "title": "Daniel Bernoulli"
}