{
 "id": "999994",
 "text": "Bekaboo () is an Indian fantasy television series. It premiered on 18 March 2023 on Colors TV. It was produced by Ekta Kapoor and Shobha Kapoor under Balaji Telefilms. ==Cast== The series stars Shivangi Joshi as Rajpari Devlekha , Zain Imam as Pratham Raichand, Shalin Bhanot as Ranav Raichand, Eisha Singh as Rajpari Bela and Antara Biswas as Yamini ===Main cast=== * Shivangi Joshi as Rajpari Devlekha Raichand; Crown princess of Parilok; Rani Pari's daughter; Pratham's wife; Ashwat's love interest; Ranav's aunt; Valak and Patali's elder daughter-in-law (2023)(Dead) * Zain Imam as Pratham Raichand; A demon from hell; Valak and Patali's elder son; Ashwat and Vansh's brother; Rajpari Devlekha's husband; Ranav's uncle; Rani Pari's son-in-law; Ranav's body (2023)(Dead) ** Rudra Soni as young Pratham Raichand (2023) * Shalin Bhanot as Ranav Raichand alias Pratham Raichand; A demon from hell; Pratham's reincarnation; Kanika and Ashwat's son; Rajpari Bela's husband; Mallika's ex- fiance; Naina's ex-boyfriend; Pratham and Rajpari Devlekha's nephew; Valak and Patali's grandson (2023) ** Harsh Usdadiya as young Ranav Raichand (2023) ** Hassan Ahamd as child Ranav (2023) * Eisha Singh as double role ** Rajpari Bela Raichand; Crown Princess of Parilok; Ranav's wife; Rajpari Devlekha's reincarnation (2023) *** Mahi Bhanushali as young Bela (2023) ** Sophia Andrasan; Yatin's fiance; Bela's Identity (2023) === Recurring === * Hrishikesh Pandey as double role ** Valak Raichand; A demon from hell; Patali's husband; Pratham Ashwat and Vansh's father; Yamini and Seema's step- father; Ranav's grandfather; Aditya, Udit and Naksh's step-grandfather (2023) ** Malak Raichand; A demon from hell; Valak's twins brother; Pratham, Ashwat and Vansh's uncle; Deep's friend; Ashwat and Vijay's murder; Bela's Vishwasghati (2023)(Dead) * Sudha Chandran as Patali Raichand; Valak's wife; Pratham, Ashwat, Vansh, Yamini and Seema's mother; Ranav, Aditya, Udit and Naksh's grandmother(2023) * Sangeeta Bala Chandran as Mrs Raichand; Shekhar's mother; Aditya Udit and Naksh's grandmother (2023) * Chetan Hansraj as Shekhar Raichand; Kanika's elder brother; Yamini's husband; Aditya Udit and Naksh's father (2023) * Antara Biswas as Yamini Raichand; Shekhar's wife; Aditya, Udit and Naksh's mother; Patali's daughter; Pratham Ashwat Vansh and Seema's stepsister; Ashwat and Kanika's murder (2023) * Karan Jotwani as Ashwat Raichand; Patali and Valak's second son; Pratham and Vansh's brother; Kanika's husband; Ranav's father (2023)(Dead) * Subha Rajput as Kanika Raichand; Shekhar's younger sister; Ashwat's wife; Ranav's mother; Patali and Valak's second daughter-in-law (2023)(Dead) * Viral Yadav/Ayush Shakeen as Udit Raichand; Yamini and Shekhar's second son; Aditya and Naksh's brother (2023)/(2023)(Dead) * Abhishek Kumar as Aditya Raichand; Yamini and Shekhar's elder son; Udit and Naksh's brother; Mallika's husband (2023)(Dead) * Himani Sahani as Mallika Raichand; Manoj's daughter; Ranav's ex-fiance; Aditya's widow (2023) * Rushal Parakh as Naksh Raichand; Yamini and Shekhar's younger son; Aditya and Udit's brother (2023) * Roselin Sonia Gomes as Mrs Raichand; Vansh's wife; Ranav's aunt; Valak and Patali's younger daughter-in-law (2023) * Arjit Taneja as Vansh Raichand; Valak and Patali's younger son; Pratham and Ashwat's brother; Ranav's Uncle (2023) * Sanjay Swaraj as Manoj Sambiyal; A Mayor; Mallika's father; Ashwat's killer; Shekhar and Yamini's friend (2023) * Abhishek Kapur as Inderjeet; A demon; Yamini, Shekhar and Manoj's best friend; Ashwat's killer (2023) * Sanjeev Jaiswal as Dada Ji; Ashwat, Pratham and Vansh's friend; Raichand's House (2023) * Shubhaavi choksey as Rani Pari; Queen of Parilok; Rajpari Devlekha and Rajpari Bela's mother Pratham and Ranav's mother-in-law (2023) * Parvin Manjarekar as Daruk; A demon; Yamini's assistant; Raichand's House (2023) * Bakul Thakkar as Arvind; Deep's husband; Bela's adopted father; Manoj's friend; Ashwat's killer (2023) * Richa Soni as Deep aka Nakabposh; Arvind's wife; Bela's adopted mother; Malka's friend; Ashwat's murder (2023) * Rohit Choudhary as Yatin Gandhi; businessman from the UK; Sophia's fiance (2023) * Nibeditaa Paal as Naina; Ranav's childhood friend and love interest (2023) * Neel Motwani as Vijay; Bela's ex-fiance (2023) ==Production== The series was announced on Colors TV by Balaji Telefilms. Shalin Bhanot, Eisha Singh and Antara Biswas were signed as the lead. It is the remake of French novel Beauty and the Beast. The shooting of the series started in February 2023, with Shivangi Joshi joining the cast. The promo featuring the leads was released on 22 February 2023. ==References== == Other websites == * Bekaboo on Colors TV * * Bekaboo on Voot Category:2023 Indian television series debuts Category:2020s Indian television series Category:Fantasy television series",
 "title": "Bekaboo"
}