{
 "id": "99996",
 "text": "The history of Europe means all the time since the beginning of written records in the European continent up to the present day. It is traditionally divided into ancient (before the fall of the Western Roman Empire) medieval, and modern (after the fall of Constantinople). Europe's antiquity dates from the Minoan civilization, the Myceneans and later on Homer's Iliad in Ancient Greece of around 700 BC. The Roman Republic was established in 509 BC, which was usurped by Octavian's new Roman Empire at its first century BC peak. The Christian religion was adopted in the fourth century, and in the sixth was organized, within the Empire, by Emperor Justinian I (527–565) with five most important cities: Rome, Constantinople, Antioch, Jerusalem and Alexandria. The fall of the Western Roman Empire was followed by a decline of Western Europe. The Byzantine Empire survived in the East. A new schism within the church's authority in 1054 was added to the earlier division that had persisted since 451. It was followed by Crusades from west to rescue the Holy Land from Muslim invasion. Feudal society began to break down, as the Black Death spread. The Fall of Constantinople in 1453 showed the military weakness of the Christians in Eastern Europe. It is often used as a starting point for modern history. Western Christians completed the Reconquista and discovered a New World in 1492. Europe awoke from the medieval period through rediscovery of classical learning, much of which had been kept alive in the Muslim world while the Western church had rejected much of it as paganry. The Renaissance was followed by the Protestant Reformation, as priest Martin Luther attacked Papal authority. The Thirty Years War, the Treaty of Westphalia and the Glorious Revolution prepared for expansion and enlightenment. The Industrial Revolution, beginning in Great Britain, allowed masses of people, not just the rich, to escape for the first time from lives of being always poor and barely able to afford either food or shelter.The Origins of the Industrial Revolution in England The early British Empire split as its colonies in America revolted to establish their own representative government. Political change in continental Europe was spurred by the French Revolution, as people cried out for liberté, egalité, fraternité (liberty, equality, brotherhood). The French leader, Napoleon Bonaparte, conquered and reformed the social structure of the continent through war up to 1815, when he met his final defeat at the Battle of Waterloo and was sent away into exile. As more and more small property holders were granted the vote, especially in France and the UK, socialist and trade union activity developed and revolution gripped Europe in 1848. The last vestiges of serfdom were abolished in Austria-Hungary in 1848. Russian serfdom was abolished in 1861. The Balkan nations began to regain their independence from the Ottoman Empire. After the Franco-Prussian War, Italy and Germany were formed, each from groups of smaller countries which spoke the same languages, in 1870 and 1871. Conflict intensified across the globe, in a chase for empires, where powerful countries turned less powerful ones into colonies, until the outbreak, in 1914, of the biggest war that had ever been fought up to that point in time. It was called the Great War but now most often called World War I or the First World War. In the desperation of war, the Russian Revolution promised the people \"peace, bread and land\" and led to the end of the Russian Empire and its replacement by the formation of the Soviet Union. The defeat of Germany came at the price of economic destruction, which was formally written into the Treaty of Versailles in 1919 where it was stated that the First World War had been entirely the fault of Germany and its allies and demanded that they pay back the entire amount the war had cost. The Great Depression began in 1929, brought about in part by the economic problems caused by the attempt to force Germany to pay for the war and in part by trade restrictions. Millions of people around the world lost their jobs. Governments changed in many countries, some by elections and some by revolutions. The governments soon fell into two main groups, those who believed in freedom and human rights and those who followed fascism. These two deeply different views led to a Second World War, which most people who write history feel began in Europe when Germany invaded Poland in 1939, but soon spread to most of the countries in the world. It took in wars which were already happening in other places, most notably the war between Japan and China. After this war Socialism spread to Central and Eastern Europe, including the relatively new Eastern European countries of Yugoslavia, Bulgaria, Romania, Albania, and in Asia North Vietnam and North Korea, and, slightly later, to Cuba in the Caribbean Sea very near to North America. The conflict between the advocates of a capitalist and a socialist economy and political system led to the Cold War, a forty-year argument between the United States and the Soviet Union, two of the countries which had worked together to win the Second World War and the two which had come out of it with the most powerful military forces. They led respectively a Western Bloc and an Eastern Bloc, dividing Europe. Each side wanted to promote their type of government. People across the world feared a nuclear war because of the tension, and Europe, divided by the Iron Curtain, was assumed to be a probable battleground. Communism became less attractive when it became clear that it could promote economic growth less effectively than the capitalistic Western states and that it was not suited for a reform\"The illusion that Communism was reformable, that Stalinism had been a wrong turning, a mistake that could still be corrected [...] that illusion was crushed under the tanks on August 21st 1968 and it never recovered.\" that allowed freedom of speech for everyone. Therefore, the Soviet Union forced Hungary to give up its reform in 1956, it favoured the building of the Berlin Wall in 1961 and it stopped reform in Czechoslovakia in 1968. When in 1988/89 the Soviet leader Gorbachev made clear that he would not force the countries of the East block to stick to Communism\"Gorbachev did more than just let the colonies go. By indicating that he would not intervene he decisively undermined the only real source of political legitimacy available to the rulers of the satellite states [...] It was Mr. Gorbechev's revolution.\" Judt, p.632/33 the Berlin Wall was torn down in 1989 and the Soviet Union collapsed (1991). Then the United States was the only superpower left. Europe signed a new treaty of union, which included 27 European countries in 2007. ==Related pages== * History * Europe * European Union == Notes == == References == * Europe: A History, by Norman Davies, published by Pimlico, * Illustrated History of Europe\", by Frederic Delouche, published by Henry Holt & Co * European History, by various authors, online book on Wikibooks == Other websites == * Maps of Europe at Wikimedia * An Atlas of European History at Wikimedia",
 "title": "History of Europe"
}