{
  "id": "help",
  "title": "Help page",
  "text": "Welcome to the offline Wikipedia!\n\n===Manual===\n\n===Searching for an article===\nType your search term in the search field and press Enter.\n\n===Adjusting the display===\nIf you press Alt+Enter repeatedly, you can change the display mode.\nPressing Alt+Enter once softens the text and makes it less blocky.\nPressing it twice changes the aspect ratio, which improves readability on some screens.\nThree times softens the text at that adjusted ratio.\nFour times exits fullscreen mode and puts the program in a window.\nFive times resets everything to the original setting.\n\n===Exiting the program===\nYou can type 'quit' in the search field to exit the program.\nIf you're in windowed mode, you can simply click the X in the corner.\n\n===Viewing a random article===\nJust press Enter without typing anything to view a random article.\n\n===Interrupting a search===\nIf the search takes too long, you can press the ESC key to interrupt it.\n\n===FAQ===\n\n===Why an offline Wikipedia?===\nWhy not? There’s no mode like text mode. Also, this was a fun Python and QB64 project for me.\n\n===What files make up a complete offline Wikipedia?===\nThese files:\n\n..\\wiki.bas\nThis is the source code of the offline Wikipedia. It's written in QB64 Phoenix Edition, a free BASIC dialect that closely resembles QuickBASIC.\n\n..\\create_index_file.py\nA Python script that creates an index file from JSON articles.\n\n..\\sort_index.py\nA Python script that alphabetically sorts the index. This version doesn’t yet offer autosuggestions during typing, but the sorted index makes development easier. Feel free to build on it, fellow hobbyists!\n\n..\\wiki\\artikel_index.txt\nThe index file for Wikipedia.\n\n..\\wiki\\many json files\nAll the article files.\n\n===Which Wikipedia is this based on?===\nTo keep it compact, this uses the Simple English Wikipedia.\n\n===I speak a minority language that has its own Wikipedia. Can I make my own offline version?===\nYes, instructions are in the FAQ included.\n\n===May I modify your program and make my own version?===\nYes.\n\n===I made my own version, but now the program is really slow!===\nThat’s because the program scans the entire article_index file. You could split the index into files per first letter (or letter pair) and modify the source code to match.\n\n===I found a bug.===\nThat’s possible. The program hasn’t been thoroughly tested. The biggest challenge was displaying special characters properly. I’ve added many, but surely missed a few. Feel free to report bugs in the comments on the Internet Archive page where you got this. Maybe I’ll upload a new version someday.\n\n===What or who is Squirrel Monkey?===\nSearch YouTube for Squirrelmonkeycom. Subscribe and make me happy!\n\n===Will that really make you happy?===\nYes, absolutely!\n\n===Why does Australia on the title screen look like it got bombed?===\nI'm a terrible ANSI artist, sorry! I have nothing against Australia.\n\n===How do I make my own Wikipedia?===\n1) Download the dump:\nGo to /dumps.wikimedia.org, find your desired language, and download the file containing 'pages-articles.xml.bz2'.\nThis file isn’t the largest one—larger ones contain the entire page history, which we don’t need.\n\n2) You can unpack the dump with tools like 7-Zip or WinRAR.\n\n3) On GitHub, download the WikiExtractor by user Attardi. You’ll need Python installed. This converts the XML to plain text files.\n\n4) Once you have the text files, use create_json_files.py to convert them to JSON.\n\n5) If you want your articles sorted alphabetically (optional), you can use sort_index.py to alphabetize the index file.\n\nMake sure your JSON files are in the subfolder named 'wiki'.\nAlso place artikel_index.txt in that same folder.\nDon’t forget to add this help file (help.json) to the index!\n\n===Python is confusing. Isn’t there an easier way?===\nYes—try installing Thonny. It’s a simple Python environment with a GUI. If you get an error, it usually just means you need to install a missing library (easy in Thonny: Tools -> Manage Packages -> Search and Install). Another common issue is using the wrong folder path.\n\n===Thank you===\nI want to thank everyone who follows me on YouTube (Squirrelmonkeycom) for their support!"
}
